{"offset":0,"number":50,"available":12688,"news":[{"id":334131056,"title":"Kashmir: a major escalation hotspot","text":"EDITORIAL: The 2025 Global Peace Index designates Kashmir as one of the world’s foremost escalation hotspots where tensions between India and Pakistan remain “perilously high” — a sobering assessment shared by independent political and defence analysts. \n\nThe Index put out by Sydney-based Institute for Economics and Peace explains that the situation in Kashmir exemplifies the fragility of ceasefire agreements in volatile geographic settings and underscores the dangers posed by non-state actors capable of triggering international crises. \n\nSuch a danger, however, can also arise from suspected false flag operations, like the 2019 Pulwama attack on a convoy of Indian security personnel in the illegally Indian Occupied Jammu and Kashmir (IIOJ&K), and last April’s Pahalgam terrorist attack. \n\nPrime Minister Narendra Modi’s government used both incidents to launch military misadventures inside Pakistan only to face a punishing retaliation. The four-day May 7-10 conflict between the two countries was their deadliest in decades, brought to a halt by a ceasefire brokered by US President Donald Trump. \n\nThe Kashmir dispute, rooted in the unfinished agenda of Partition, has sparked three wars between Pakistan and India as well as limited skirmishes over the Line of Control in the disputed region. \n\nThe Modi government’s decision in August of 2019 to revoke Article 370 of the Indian constitution, — which granted limited autonomy to IIOJ&K — led to bifurcation of the disputed region into two entities, Jammu and Kashmir and Ladakh — over much of which China has territorial claims — and made Union territories. \n\nPM Modi’s critics at home, including the main opposition Congress Party leader Rahul Gandhi, have been accusing his government of creating a common interest for Pakistan and China in wresting back Kashmir from India. In any case, the risk of escalation between the two nuclear-armed nations carries grave implications. \n\nEven a conventional conflict, as seen last May, holds the potential of rapidly spiralling into a serious crisis. Discomfited by the outcome, Modi refuses to even acknowledge that the US played any role in defusing tensions in the latest stand-off with Pakistan. This hardline stance resonates with his far-right Hindu nationalist support base, but leaves little room for constructive diplomacy.\n\nIt is more than obvious that PM Modi feels let down by President Trump’s persistent assertions that he had helped bring about ceasefire between the two countries at India’s request. At the risk of annoying him, New Delhi has denied having made any such request. \n\nModi also passed on President Trump’s invitation to stopover in Washington on way back from the G7 Summit in Canada, on the pretext of some pressing business at home. Yet as the Global Peace Index indicates, without some sort of diplomatic engagement the chance of miscalculation or inadvertent escalation will only grow. Reinstating dialogue mechanisms, whether backchannel or bilateral, is essential for establishing durable peace and stability in South Asia.\n\nCopyright Business Recorder, 2025","summary":"EDITORIAL: The 2025 Global Peace Index designates Kashmir as one of the world’s foremost escalation hotspots where tensions between India and Pakistan remain “perilously high” — a sobering assessment shared by independent political and defence analysts. \n\n\n\nThe Index put out by Sydney-based Institute for Economics and Peace explains that the situation in Kashmir exemplifies the fragility of ceasefire agreements in volatile geographic settings and underscores the dangers posed by non-state actors capable of triggering international crises. \n\n\n\nSuch a danger, however, can also arise from suspected false flag operations, like the 2019 Pulwama attack on a convoy of Indian security personnel in the illegally Indian Occupied Jammu and Kashmir (IIOJ&amp;K), and last April’s Pahalgam terrorist attack. \n\n\n\nPrime Minister Narendra Modi’s government used both incidents to launch military misadventures inside Pakistan only to face a punishing retaliation. The four-day May 7-10 conflict between the two countries was their","url":"https://www.brecorder.com/news/40369084/kashmir-a-major-escalation-hotspot","image":"https://i.brecorder.com/large/2025/06/6858af8c2633a.jpg","video":null,"publish_date":"2025-06-23 01:36:52","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.014},{"id":334130688,"title":"Toxic Threat From 'Forever Chemicals' Sparks Resistance In Georgia Towns","text":"Sasha and Jamie Cordle thought their small farm in rural Georgia would be a ladder out of working-class struggle, and a gift for their children and grandchildren.Instead, it may be poisoning them.Tests show their spring water is laced with toxic \"forever chemicals\" at levels tens of thousands of times above federal safety guidelines, likely from nearby carpet factories.\"It scares us,\" said Sasha, a 38-year-old dispatcher whose husband drives long hauls across the country. She's worried about their five children, two-year-old granddaughter, and a grandson due in October.PFAS -- or per- and polyfluoroalkyl substances -- are a group of more than 10,000 human-made chemicals that repel heat, water, oil, and stains.Developed in the 1940s, they're still used in nonstick pans, firefighting foams and stain-proof carpets, yet are now linked to hormonal disruption, immune suppression and cancers.Their ultra-tough carbon-fluorine bonds take millennia to break down in the environment, linger in bodies for years, and are now found in the blood of nearly every living creature on Earth.Here in Dalton, Georgia, which calls itself the \"Carpet Capital of the World,\" mills run by giants Mohawk Industries and Shaw Industries are widely blamed for making the region one of America's most PFAS-laden.They're accused of spewing the chemicals into the air, flushing them into sewers unequipped to remove them, and indirectly contaminating farmland through sludge byproducts later spread as fertilizer.The Cordles have joined other landowners in suing the carpet makers, seeking damages to \"remediate\" their properties -- a process they estimate could cost about $1 million per acre -- plus punitive damages.Mohawk, Shaw, and chemical giant 3M declined to comment on the complaint. Chemical maker Chemours, another chemical maker and defendant, says it has no factories in Georgia and denies culpability.In a complex web of lawsuits, Dalton Utilities, which manages the local water system, has also sued the carpet makers, while Mohawk has sued 3M over the same issue.The Biden administration last year enacted the first enforceable national drinking water standards for six PFAS chemicals.But under President Donald Trump, the federal government has since rolled back limits on four of the chemicals and delayed the compliance deadline for the remaining two.Meanwhile, the Cordles have seen alarming signs, in both humans and animals.Sasha, who moved to the property after marrying Jamie in 2020, soon developed two autoimmune conditions, as well as high blood pressure and chronic fatigue.\"Sometimes getting out of bed, I feel like I'm 80,\" she said.Her grown children also report various ailments -- and some goat kids didn't survive their birth defects.Attorney Ben Finley is leading a wave of damages claims, recruiting new clients at buoyant town halls.So far, his firm has filed suits for 18 lead plaintiffs.\"We're drawing a direct line between contamination, lost property value and cleanup cost,\" Finley said.While the lawyers work the crowds, water expert Bob Bowcock takes water, soil and dust samples to help build the scientific case behind the legal one.\"We've got springs emitting into ponds that are discharging to creeks at over 180,000 parts per trillion,\" he said. The national guideline for drinking water is just four parts per trillion, and local creeks are often seen frothing with pollution.PFAS in the soil move up the protein chain and into the food web -- contaminating eggs, milk, beef, and leafy greens that find themselves on store shelves nationwide.The carpet makers are the area's main economic lifeline, yet many are now turning against them.Mary Janet Clark, 62, toiled for the carpet makers, had her ovaries removed after cancer, and now has a tumor in her brain.\"We helped them build their business and make all that money,\" said her son, David Wray, 40. \"It's just cruel.\"Others share similar grief.Human-resources manager Teresa Ensley, 57, lost her brother, father and husband to cancer in just a few years.Studies have linked PFAS to elevated colon cancer rates, the disease that killed her brother and husband. She and her 81-year-old mother both suffer severe thyroid problems and have had hysterectomies.Even for those not yet sick, the toll is palpable.Greg and Sharon Eads hoped to retire on farmland they bought in 2019, but it has since tested hot for PFAS, unraveling their dream.They own $50,000 worth of cattle now off-limits for milk or meat.It's become \"basically a petting zoo,\" said Greg. \"I can't do anything with them, not in good conscience.\"During a recent visit, the couple led AFP through bucolic pastures where the herd huddled around a healthy newborn calf -- a welcome moment of hope after several others were lost to deformities.","summary":"Sasha and Jamie Cordle thought their small farm in rural Georgia would be a ladder out of working-class struggle, and a gift for their children and grandchildren.","url":"https://www.ibtimes.com/toxic-threat-forever-chemicals-sparks-resistance-georgia-towns-3776477","image":"https://d.ibtimes.com/en/full/4606607/lawyer-nick-jackson-talks-citizens-during-townhall-event-about-pfas-chatsworth-georgia.jpg","video":null,"publish_date":"2025-06-23 01:27:08","author":"Issam Ahmed","authors":["Issam Ahmed"],"language":"en","category":"politics","source_country":"US","sentiment":-0.235},{"id":334129834,"title":"‘Nervous’: Trump strikes spook ASX","text":"The ASX 200 fell 44.30 points or 0.52 per cent to 8461.20 on the opening bells as investors weighed up the risks in the Middle East. \n\nThe Aussie dollar also slumped, falling from US64.94 cents to US64.48 as the tension escalates. \n\nInvestors are worried about two major potential escalations in the conflict, with either the closure of the Strait of Hormuz or an all-out regional war negatively impacting the price of oil.\n\nCutting off the Strait of Hormuz could send the price of oil above $US100 a barrel, as the 32km mile stretch is the primary route of exports from Saudi Arabia, Iraq, the UAE, and Kuwait.\n\nCapital.com senior financial market analyst Kyle Rodda said traders would be looking to gauge risks of energy shocks and the potential impact of the broader conflict.\n\n“The markets are confronting a very nervous start to the week where the only thing that will matter is the fallout from the US missile strike on Iranian nuclear assets over the weekend,” Mr Rodda said.\n\n“There’s already some talk of (closing the Strait of Hormuz) from the Iranians, with the instability in the region and risks to critical infrastructure alone enough to worry energy markets.”\n\nUS Secretary of State Marco Rubio said closing the crucial Strait of Hormuz would be a “suicidal” move to the Iranian regime. \n\nMr Rubio said closing the strait would affect the US, but it would have “a lot more impact on the rest of the world”, particularly on China. \n\n“That would be a suicidal move on (Iran’s) part because I think the whole world would come against them if they did that,” Mr Rubio said.\n\nOn Saturday (Sunday AEST), US forces confirmed strikes on three Iranian nuclear facilities in the latest flair up between Israel and Iran. \n\nUS President Donald Trump said the three nuclear sites in Iran – Fordow, Isfahan and Natanz – were “completely obliterated” but this is yet to be independently verified. \n\nThe armed conflict sent the price of Brent crude oil surging to above $US80 a barrel after it was about $US65 a barrel. \n\nMr Rodda said the first move by markets would be a possible kneejerk, with traders taking a shoot-first-ask-questions-later approach. \n\n“But as the dust settles and more of the facts become known – especially the extent of the damage achieved by the US – the markets will turn to gaming out the likely course of events from here and quantifying the risks to asset prices,” he said.","summary":"Investors face a “nervous week” as the fallout from the Middle East conflict drags markets lower and the price of oil skyrockets.","url":"https://www.news.com.au/finance/markets/australian-markets/asx-falls-on-very-nervous-start-to-mondays-trading-after-us-strikes-iran/news-story/556efea20e3cf5a93131fcbc5a2644ee?from=rss-basic","image":"https://content.api.news/v3/images/bin/ff8f0121f74e46a1ab435652fa45c92b","video":null,"publish_date":"2025-06-23 01:20:22","author":"Cameron Micallef","authors":["Cameron Micallef"],"language":"en","category":"politics","source_country":"au","sentiment":-0.139},{"id":334129830,"title":"Hanson’s demand after US attacks Iran","text":"Senator Hanson voiced strong support for the US military action, describing its strikes against Iran over the weekend as necessary for global security. \n\n“The world is a safer place without nuclear weapons in the hands of the Islamic Republic of Iran – a radical Islamic dictatorship,” Senator Hanson said in a statement.\n\n“Safety of Australians should remain paramount and that is why One Nation supports the strike conducted by the United States to destroy Iran’s nuclear enrichment facilities.”\n\nHer comments come after US President Donald Trump confirmed the United States had carried out an attack on three nuclear sites in Iran on Sunday.\n\nThe attack follows Israel launching a surprise attack targeting Iran’s nuclear program on June 13, prompting the countries to trade deadly strikes.\n\nForeign Minister Penny Wong confirmed the government’s support for the US’s action on Monday morning.\n\n“We support action to prevent Iran obtaining a nuclear weapon. And that is what this is,” she told Nine.\n\nSenator Hanson accused the federal government of being “weak” in response to “terrorism against Israel”, calling for an end to domestic protests and a stop to resettlement visas for Iranian citizens.\n\nProtests calling for an end to Israel’s blockade of Gaza have been ongoing across Australia, with recent protests also calling for Australia to pull out of AUKUS, its defence deal with the US and the UK.\n\n“Since the Iranian regime-backed Hamas terrorist attack on Israel on October 7 2023, Australia has faced anti-Semitic protests at the Sydney Opera House, our government-funded universities, parliamentary offices, and in our suburbs,” Senator Hanson said.\n\n“This must not be tolerated following US strikes and I request that you work with state and territory governments to prevent these protests from recommencing,\n\n“One Nation seeks confirmation from you and your government that you will prosecute radical Islamic preachers who inspire terrorism and hatred in Australia,\n\n“And we seek your assurance that your government will not offer additional visas to Iranians seeking resettlement in Australia.”\n\nProtesters descended on the US consulate in Melbourne and Hyde Park in Sydney on Sunday to denounce the bombing of Iran.\n\nStudents for Palestine Iranian socialist Bella Beiraghi called out the Israeli and US governments for “recycling 20-year-old lies” about Iran’s nuclear weapons program at Melbourne’s rally.\n\n“They say that Iran is a mortal threat to the region, but if you just look over the past 20 months of genocide in Gaza, you can see who the real threat to the region is; it’s Israel and America,” she said.\n\nRight-wing commentator Kobie Thatcher echoed Senator Hanson’s call, posting a video of the gathering on ‘x’, labelling them “absolutely disgraceful scenes” and calling for “mass deportations”.","summary":"Pauline Hanson is pushing for a visa ban for Iranian nationals and tougher action on nationwide protests against recent US strikes.","url":"https://www.news.com.au/world/middle-east/hanson-demands-visa-ban-protest-crackdown-after-us-strikes-on-iran/news-story/c9fb18a8064ed17bea5501e3be991d48?from=rss-basic","image":"https://content.api.news/v3/images/bin/9a657309dd8068d83c70b5ee5690d958","video":null,"publish_date":"2025-06-23 01:20:22","author":"Amelia Swan","authors":["Amelia Swan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.191},{"id":334131090,"title":"Israel-Iran war: US joins war, bombs 3 Iran N-sites","text":"The United States inserted itself into Israel’s war against Iran by dropping 30,000-pound bombs on a uranium enrichment site early on Sunday, raising urgent questions about what remains of Tehran’s nuclear programme and how its weakened military might respond.SURPRISE ATTACK US B-2 bombers hit Iran’s Fordow, Natanz, Isfahan N-facilitiesVOWING REVENGE Tehran rules out talks as option after attack, looks to Russia for helpESCALATION FEARS US entry may lead to wider conflict, UNSC calls emergency meetIran lashed out at the US for crossing “a very big red line” with its risky gambit to launch strikes on three Iranian nuclear sites with missiles and the bunker-buster bombs.“The warmongering and lawless administration in Washington is solely and fully responsible for the dangerous consequences and far-reaching implications of its act of aggression,” Iranian Foreign Minister Abbas Araghchi said, adding that he would immediately fly to Moscow to coordinate positions with close ally Russia.Amid fears of a wider regional conflict, the Trump administration sent a clear message that it wanted to restart diplomatic talks with Iran. Defence Secretary Pete Hegseth told reporters that the US “does not seek war” with Iran. But Tehran said the time for diplomacy had passed and that it had the right to defend itself.President Donald Trump earlier warned there would be additional strikes if Tehran retaliated against US forces. “There will either be peace or tragedy for Iran,” said Trump who acted without congressional authorisation.The Atomic Energy Organisation of Iran confirmed that attacks took place on the Fordow and Natanz enrichment facilities as well as the Isfahan nuclear site. Both Iran and the UN nuclear watchdog said there were no immediate signs of radioactive contamination around the sites.Trump claimed the US “completely obliterated” the sites, but the Pentagon reported “sustained, extremely severe damage and destruction”. US defence officials said an assessment was ongoing.With the attack, the US has inserted itself into a war it spent decades trying to avoid. Success could mean ending Iran’s N-ambitions and eliminating the last significant state threat to the security of Israel, its close ally. Failure could plunge it into another long and unpredictable conflict in the Middle East.For Iran’s supreme leader, it could mark the end of an ambitious campaign to transform the Islamic Republic into a greater regional power that holds enriched nuclear material a step away from weapons-grade. Ayatollah Ali Khamenei last spoke publicly on Wednesday, warning the US that strikes targeting the Islamic Republic will “result in irreparable damage for them”.Iran, battered by Israel’s largest-ever assault on it that began on June 13, has a few ways it could retaliate. It could launch a wave of attacks on US forces stationed in the Middle East with the missiles and rockets that Israel hasn’t destroyed. It could attempt to close a key bottleneck for global oil supplies, the Strait of Hormuz between it and the UAE.Or it could hurry to develop a nuclear weapon with what remains of its program. The Atomic Energy Organisation of Iran insisted that its nuclear programme will not be stopped.Iran has long maintained that its nuclear programme was peaceful, and US intelligence agencies have assessed that Tehran is not actively pursuing a bomb. Israel has significantly degraded Iran’s air defences and offensive missile capabilities and damaged its nuclear enrichment facilities. But only the US military has the bunker-buster bombs that officials believe offered the best chance of destroying sites deep underground and the planes to drop them.Fourteen of the bombs were used on two nuclear sites, including Fordow, according to Air Force Gen. Dan Caine, chairman of the Joint Chiefs of Staff. In all he said, 75 precision-guided weapons were used, including missiles fired from a submarine.The strike on Fordow, which is dug deep into a mountain, raised an urgent question — what has happened to Iran’s stockpile of uranium and centrifuges? Satellite images taken after the American strikes, analysed by AP, show damage to the facility. The images suggest Iran packed the entrance tunnels to Fordow with dirt and had trucks at the facility ahead of the US strikes. Several Iranian officials, including Atomic Energy Organisation of Iran spokesman Behrouz Kamalvandi, have claimed Iran removed nuclear material from targeted sites.","summary":"The US bombed Iranian nuclear sites with bunker-buster bombs, triggering a strong response from Iran. Iran condemned the attack, threatened retaliation, and vowed to continue its nuclear program. The US aims to halt Iran's nuclear ambitions and protect Israel, but risks a wider conflict in the Middle East. (This summary is generated via AI.)","url":"https://www.tribuneindia.com/news/top-headlines/us-joins-war-bombs-3-iran-n-sites","image":"https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTIwOGNkZGUwLTRmZDAtMTFmMC1iNWU1LWExZjBiMDAwYjYwYy5qcGc=","video":null,"publish_date":"2025-06-23 01:09:11","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.431},{"id":334129932,"title":"Anthony Albanese's excuse is revealed for disappearing when Trump bombed Iran - as he's mocked: 'Right to disconnect'","text":"Anthony Albanese's excuse is revealed for disappearing when Trump bombed Iran - as he's mocked: 'Right to disconnect'\n\nREAD MORE: Penny Wong shifts tone on escalating Iran crisis\n\nBy MAX AITCHISON, POLITICAL REPORTER FOR DAILY MAIL AUSTRALIA\n\nPublished: 01:23 BST, 23 June 2025 | Updated: 01:59 BST, 23 June 2025\n\nFormer prime minister Scott Morrison has slammed Anthony Albanese for failing to speak publicly in the 24 hours after the US strike on Iranian nuclear facilities. \n\nThe former Liberal leader said Australia's allies 'need to know where it stands' after US President Donald Trump unleashed a fleet of B-2 bombers to 'obliterate' three Iranian nuclear enrichment sites on Sunday. \n\n'We've heard from (UK Prime Minister) Keir Starmer, we've heard from (French President) Emmanuel Macron, we've heard from many,' Morrison told 2GB.\n\n'I think it's very important that Australia makes it very clear where we stand. \n\n'I think on the Middle East issue more broadly, particularly going back to October 7th, there's been an absolute fog of ambiguity when it comes to where the government stands on this issue, and in this case, particularly with our strongest ally.\n\n'Now I think this has been a courageous action by President Trump.'\n\nMr Albanese told 2GB host Ben Fordham that he would speak after the National Security Cabinet (NSC) convened a meeting on Monday morning.\n\nBut Morrison insisted that an NSC meeting could have taken place on Sunday and that Albanese should have spoken on the 6pm news last night. \n\n'Clarity requires timeliness, and so I look forward to a positive statement from the Prime Minister and the government and an acknowledgement of the right actions which have been taken by the US President,' Morrison added.\n\nFormer Prime Minister Scott Morrison has slammed Anthony Albanese for failing to speak publicly for almost 24 hours on the US strike on Iranian nuclear facilities (pictured: Jenny Morrison, Melania Trump, Donald Trump and Scott Morrison)\n\nThe Prime Minister told 2GB host Ben Fordham that he would speak after the National Security Cabinet (NSC) convened a meeting on Monday morning\n\nOne 2GB listener quipped that Albanese had been silent because he was 'just using his right to disconnect'.\n\nThe right to disconnect law, which the Albanese Government introduced last year, allows employees to refuse work-related contact outside of their working hours.\n\nIt comes after the Albanese Government shifted its tone on the US strikes on Monday morning.\n\nOn Sunday, a government spokesperson offered no endorsement of the US decision to target Iranian nuclear facilities, instead calling 'de-escalation, dialogue, and diplomacy'.\n\nBut after the Coalition offered its full support for the 'proactive action', Foreign Minister Penny Wong came out in support of Trump's military intervention. \n\n'The world has agreed Iran cannot be allowed to get a nuclear weapon. So yes, we support action to prevent that. And that is what this is,' Senator Wong told ABC's News Breakfast. \n\n'The big question is, now what? And Australia says, like so many other countries, we do not want escalation and a full-scale war, and we continue to call for dialogue and diplomacy.'\n\nWhen asked about the legality of the strikes, Senator Wong said: 'I think we are all clear that Iran… cannot be allowed to get a nuclear weapon. So yes, the government does support action to prevent that.'\n\nFollowing crisis talks with UK Prime Minister Keir Starmer on Sunday, Trump took to social media claim that the current Islamic regime 'is unable to MAKE IRAN GREAT AGAIN' (pictured: Trump arriving to deliver an address following US strikes on Iran's nuclear facilities)\n\nFollowing crisis talks with UK Prime Minister Keir Starmer on Sunday, Trump took to social media to claim that the current Islamic regime 'is unable to MAKE IRAN GREAT AGAIN'.\n\n'Why wouldn't there be a regime change?' Trump asked, rhetorically - even as he and Starmer urged Ayatollah Khamenei to 'return to the negotiating table as soon as possible'.\n\nIsrael's Prime Minister Benjamin Netanyahu said his country was close to achieving its goals of destroying Iran's nuclear program.\n\n'We won’t pursue our actions beyond what is needed to achieve them, but we also won't finish too soon,' Netanyahu said on Monday.\n\n'When the objectives are achieved, then the operation is complete and the fighting will stop.'\n\nFollowing an emergency session of the UN Security Council, Secretary-General António Guterres warned that the conflict risks 'descending into a rathole of retaliation'.\n\n'We now risk descending into a rathole of retaliation after retaliation,' he said.\n\n'To avoid it, diplomacy must prevail, civilians must be protected, safe maritime navigation must be guaranteed.'\n\nKeir StarmerIranAnthony Albanese\n\nShare or comment on this article:\nAnthony Albanese's excuse is revealed for disappearing when Trump bombed Iran - as he's mocked: 'Right to disconnect'\n\nAdd comment","summary":"The former PM said Australia's allies 'needs to know where it stands' after Donald Trump unleashed B-2 bombers to 'obliterate' three Iranian nuclear enrichment sites on Sunday.","url":"https://www.dailymail.co.uk/news/article-14837057/Scott-Morrison-Iran-Anthony-Albaneses.html","image":"https://i.dailymail.co.uk/1s/2025/06/23/00/99620787-0-image-a-7_1750634515180.jpg","video":null,"publish_date":"2025-06-23 00:59:07","author":"Editor,Max Aitchison","authors":["Editor","Max Aitchison"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.203},{"id":334127934,"title":"Iran threatens US bases in response to strikes on nuclear sites","text":"Iran on Sunday threatened US bases in the Middle East after massive air strikes that Washington said had destroyed Tehran's nuclear program, though some officials cautioned that the extent of damage was unclear.With aerial assaults between Iran and Israel raging -- including fresh strikes by Israel on what it said were military targets in Iran -- the US State Department issued a worldwide caution alert for its citizens traveling or living abroad.International concern focused on fears that the unprecedented US attacks would deepen conflict in the volatile region after Israel launched a bombing campaign against Iran earlier this month.Ali Akbar Velayati, an advisor to Iran's supreme leader Ayatollah Ali Khamenei, said bases used by US forces could be attacked in retaliation. Any country in the region or elsewhere that is used by American forces to strike Iran will be considered a legitimate target for our armed forces, he said in a message carried by the official IRNA news agency. America has attacked the heart of the Islamic world and must await irreparable consequences. In a sign of possible nervousness about a wider war, oil prices jumped by more than four percent at one point in early trading in Asia.President Donald Trump urged Iran to end the conflict after he launched surprise strikes on a key underground uranium enrichment site at Fordo, along with nuclear facilities in Isfahan and Natanz. We had a spectacular military success yesterday, taking the 'bomb' right out of their hands (and they would use it if they could!) he said on social media.And while the US president did not directly advocate regime change in the Islamic republic, he openly played with the idea -- even after his aides stressed that was not a goal of American intervention. It's not politically correct to use the term, 'Regime Change,' Trump posted on his Truth Social platform. But if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn't there be a Regime change??? MIGA!!! Defense Secretary Pete Hegseth told a Pentagon press briefing earlier that Iran's nuclear program had been devastated, adding the operation did not target Iranian troops or the Iranian people. Standing beside Hegseth, top US general Dan Caine said that while it would be way too early for him to determine the level of destruction, initial battle damage assessments indicate that all three sites sustained extremely severe damage and destruction. Israel's Prime Minister Benjamin Netanyahu meanwhile said his country's military strikes will finish once the stated objectives of destroying Iran's nuclear and missile capabilities have been achieved. We are very, very close to completing them, he told reporters.Tehran protestsAs Iran's leaders struck defiant tones, President Masoud Pezeshkian also vowed that the United States would receive a response to the attacks.People gathered Sunday in central Tehran to protest against US and Israeli attacks, waving flags and chanting slogans.In the province of Semnan east of the capital, 46-year-old housewife Samireh told AFP she was truly shocked by the strikes. Semnan province is very far from the nuclear facilities targeted, but I'm very concerned for the people who live near, she said.In an address to the nation hours after the attack, Trump claimed success for the operation, and Vice President JD Vance followed up Sunday morning. We know that we set the Iranian nuclear program back substantially last night, Vance told ABC.But he also suggested Iran still had its highly enriched uranium. We're going to work in the coming weeks to ensure that we do something with that fuel, he said. They no longer have the capacity to turn that stockpile of highly enriched uranium to weapons-grade uranium. Another Khamenei advisor, Ali Shamkhani, said in a post on X that even if nuclear sites are destroyed, game isn't over, enriched materials, indigenous knowledge, political will remain. Rafael Grossi, director of the International Atomic Energy Agency (IAEA), told an emergency meeting of the UN Security Council that craters were visible at the Fordo facility, but no one had been able to assess the underground damage.Retaliation riskThe main US strike group was seven B-2 Spirit bombers that flew 18 hours from the American mainland to Iran.In response to the attack, which used over a dozen massive bunker buster bombs, Iran's armed forces targeted sites in Israel including Ben Gurion airport near Tel Aviv, with at least 23 people wounded.Nine members of the Revolutionary Guards were killed Sunday in Israeli attacks on central Iran, local media reported, while three people were killed after an ambulance was also struck.Israeli strikes on Iran have killed more than 400 people so far, Iran's health ministry said. Iran's attacks on Israel have killed 24 people, according to official figures.The United Arab Emirates, Qatar and Oman, which had been mediating Iran-US nuclear talks, criticized the US strikes and called for de-escalation, while France, Germany and Britain called on Tehran not to take any further action that could destabilize the region. Late Sunday the US State Department issued a worldwide caution for Americans, saying the conflict in the Middle East could put those traveling or living abroad at an increased security risk. There is the potential for demonstrations against US citizens and interests abroad, the security alert said. The Department of State advises US citizens worldwide to exercise increased caution.","summary":"Iran has threatened to target U.S. bases in the Middle East following major U.S. airstrikes that Washington claims severely damaged Iran's nuclear program. The strikes, which hit key nuclear sites including Fordo, Natanz, and Isfahan, sparked ongoing aerial exchanges between Iran and Israel. In response, Iran warned that any country hosting U.S. forces involved in the attacks would be considered a legitimate target.","url":"https://economictimes.indiatimes.com/news/international/global-trends/iran-threatens-us-bases-in-response-to-strikes-on-nuclear-sites/articleshow/122013036.cms","image":"https://img.etimg.com/thumb/msid-122013040,resizemode-4,width-1200,height-900,imgsize-104072,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-23 00:57:39","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.357},{"id":334127884,"title":"Iran will decide 'timing, nature and scale' of its response to US, Israeli attacks – video","text":"Skip to main contentSkip to navigationSkip to navigation\n\nPrint subscriptions\nSearch jobs\n\nEurope edition\n\nAustralia edition\nInternational edition\nThe Guardian - Back to homeThe Guardian\n\nShow moreHide expanded menu\n\nView all News\n\nClimate crisis\n\nEnvironment\n\nGlobal development\n\nView all Opinion\nThe Guardian view\n\nOpinion videos\n\nView all Sport\n\nRugby union\n\nView all Culture\n\nArt & design\n\nView all Lifestyle\n\nHealth & fitness\nHome & garden\n\nSearch input \ngoogle-search \n\nPrint subscriptions\n\nSearch jobs\n\nDigital Archive\nGuardian Licensing\n\nThe Guardian app\n\nNewsletters\nToday's paper\nInside the Guardian\nGuardian Weekly\n\nCorrections\n\nSearch input \ngoogle-search \n\nSearch jobs\n\nDigital Archive\nGuardian Licensing\n\nMiddle East\n\nGlobal development\n\nIran will decide 'timing, nature and scale' of its response to US, Israeli attacks – video\n\nIran’s UN ambassador, Amir Saeid Iravani, told an emergency meeting of the United Nations Security Council on Sunday that the US had 'decided to destroy diplomacy' with its strikes on Iran. He added that the Iranian military will decide a 'proportionate response'.\n\nIran says US ‘must receive a response’ after Trump’s strikes on nuclear sites\n\n‘We weren’t expecting it yet’: US attack met with panic in Iran\n\nSource: UNTV\nMon 23 Jun 2025 02.57 CEST\n\nExplore more on these topics\n\nIran's nuclear programme\nUS foreign policy\nTrump administration\n\nMiddle East and north Africa\nDonald Trump\n\nMost viewed\n\nMost viewed\n\nMiddle East\n\nGlobal development\n\nOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our email\n\nComplaints & corrections\n\nWork for us\n\nPrivacy policy\nCookie policy\nTerms & conditions\n\nAll writers\nDigital newspaper archive\nTax strategy\n\nNewsletters\n\nAdvertise with us\nSearch UK jobs\n\nBack to top\n© 2025 Guardian News & Media Limited or its affiliated companies. All rights reserved. (dcr)","summary":"Iran’s UN ambassador, Amir Saeid Iravani, told an emergency meeting of the United Nations Security Council on Sunday that the US had 'decided to destroy diplomacy' with its strikes on Iran. He added that the Iranian military will decide a 'proportionate response'.\n\n\nIran says US ‘must receive a response’ after Trump’s strikes on nuclear sites\n\n\n‘We weren’t expecting it yet’: US attack met with panic in Iran\n\n Continue reading...","url":"https://www.theguardian.com/world/video/2025/jun/23/iran-un-ambassador-response-us-strikes","image":"https://i.guim.co.uk/img/media/6a8c81b5705103110280704c93ce98c73767b502/289_0_3333_2667/master/3333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-06-23 00:57:24","author":"Guardian Staff","authors":["Guardian Staff"],"language":"en","category":"politics","source_country":"us","sentiment":0.369},{"id":334129478,"title":"US officially enters war, Iran vows: 'You will pay'","text":"U.S. President Donald Trump did on Sunday what the entire world, most importantly his American voters – had been warning him not to do: He flew U.S. B-2 bombers inside Iran to directly join Israel's war against the country, launching strikes on Iran's nuclear facilities in three locations.\n\nThe President then took to his social media platform to announce the attacks were a \"spectacular military success\" and that Iran’s key nuclear enrichment facilities had been \"completely and totally obliterated.\"\n\nUnderstanding that Trump is wrong about his attacks' effectiveness isn't difficult. Two sites he struck, Esfahan and Natanz, had been previously attacked by Israel last Friday, and the facilities had been emptied of enriched uranium and critical enrichment technology. His attacks on Fordow were new, but the results weren't. Satellite images show only one entrance and one exit, out of the existing five, was damaged. The main site itself – buried dozens of meters underground and protected by a mountain – remains intact.\n\nResidents filming Fordow from a distance also failed to detect any smoke or fire. Reports from Qom, the closest city to the nuclear facility, observed normal city functioning with people heading to everyday errands unaffected. They seemed to have come to terms with their country fighting a war 10 days after Israel initiated it on June 13.\n\nIran and the U.S. were participating in indirect nuclear negotiations before the war broke out. Iran’s Foreign Minister Abbas Araghchi, speaking at an OIC meeting in Ankara, stated clearly that what the U.S. obliterated with its Sunday strikes – and earlier ones it helped Israel carry out – wasn't Iran's nuclear facilities, \"but rather diplomacy.\" During the ongoing aerial campaign against Iran, at least 400 civilians have been killed and 2,000 injured according to the latest Health Ministry figures. \n\nThe current situation flies in the face of repeated U.S. claims that while informed about Israel’s initial attacks, Americans themselves were not involved. In his first remarks after the Sunday aggression, Iranian President Masoud Pezeshkian stated during a cabinet meeting that while Tehran knew the U.S. was aiding Israel's war against Iran, the direct American strikes proved Washington was the actual instigator all along. \"They tried to conceal their involvement initially, but after seeing Israel was getting crushed, they had no choice but to enter the war directly.\"\n\nExperts believe Israel's initial strikes – targeting top Iranian military leaders in residential buildings – weren't designed for prolonged war. The regime and its American backers asssumed assassinating generals would prevent retaliation and rally Iranians to topple their government. Neither objective succeeded. Instead, Iran unified more strongly, and its Armed Forces began retaliation the same day its top generals were assassinated, pummeling Israel and wreaking havoc in occupied territories under new, less cautious military leadership. Under these circumstances, analysts tell the Tehran Times, the U.S. was forced to intervene to manufacture an Israeli \"victory.\"\n\nWhat happens now?\n\nHours after the attack, U.S. Defense Secretary Pete Hegseth broke his silence, stating the Trump administration is not seeking to expand the war and has sent private messages to Tehran requesting a \"return to negotiations.\"\n\nHowever, Iranians had previously warned that direct American attacks would be met with retaliation. Earlier in the week, Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei stated in a video message that any U.S. strikes would bring about \"irreparable harm\" for the Americans.\n\nIt's now clear that Iran will continue targeting Israel, which has been plunged into economic and societal chaos and is facing daily Iranian missile and drone attacks, with limited interception success.\n\nAs for the U.S., Iran has several options. These include attacks on one or more of the 19 American bases in the region, housing approximately 50,000 troops or workers, the closure of the Strait of Hormuz, through which a quarter of the world's oil passes, and a change in its nuclear doctrine. Since Iranians have indicated they will adhere to the Treaty on the Non-Proliferation of Nuclear Weapons (NPT), at least for the time being, a direct military response remains the most probable next step.\n\nAccording to Fars News, Iran estimates that the war could last up to six months and has prepared to sustain it. \n\nAll of this has, meanwhile, pushed the region to the brink of a regional conflagration, a situation narrowly avoided numerous times in the past 20 months due to unchecked Israeli aggression in Lebanon, Gaza, and Syria.\n\nRegional countries, including Saudi Arabia, Qatar, Oman, Kuwait, the UAE, and Turkey, said they are concerned about the “lasting consequences” of U.S. strikes on Iran in separate statements they published on Sunday. \n\nMNA/TehranTimes","summary":"TEHRAN, Jun. 23 (MNA) – U.S. President Donald Trump directly joined Israel's war against the country, launching strikes on Iran's nuclear facilities in three locations.","url":"https://en.mehrnews.com/news/233527/US-officially-enters-war-Iran-vows-You-will-pay","image":"https://media.mehrnews.com/d/2025/06/22/4/5563613.jpg?ts=1750619080125","video":null,"publish_date":"2025-06-23 00:55:00","author":null,"language":"en","category":"politics","source_country":"ir","sentiment":-0.327},{"id":334127886,"title":"Israel-Iran war live: Trump floats regime change to ‘make Iran great again’ as region braces for Iranian response to US strikes","text":"Hello and welcome to our live coverage of the US and Israeli war on Iran.\n\nUS president Donald Trump has brought up the possibility of regime change in Iran following US military strikes against key Iran military sites over the weekend, even as top members of his administration insisted the US was not seeking to topple the Iranian leadership.\n\n“It’s not politically correct to use the term, “Regime Change,” but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!” Trump wrote in a post on his social media platform Truth Social.\n\nEarlier, vice-president JD Vance had insisted the US was “not at war with Iran, we’re at war with Iran’s nuclear programme” while US secretary of state Marco Rubio said that that the US was “not looking for war in Iran”.\n\nThe world was meanwhile braced for Iran’s response after to the US attacks, which saw it joining Israel in the biggest western military action against the Islamic Republic since its 1979 revolution.\n\nSpeaking in Istanbul, Iranian foreign minister Abbas Araqchi said his country would consider all possible responses. There would be no return to diplomacy until it had retaliated, he said. “The US showed they have no respect for international law. They only understand the language of threat and force,” he said.\n\nHe later flew to Moscow to discuss “common threats” with President Vladimir Putin.\n\nIn other key developments:\n\n Israeli prime minister Benjamin Netanyahu said that Israel is very close to meeting its goals in Iran of removing the threats of ballistic missiles and the nuclear programme. Speaking to Israeli reporters, he said: “We won’t pursue our actions beyond what is needed to achieve them, but we also won’t finish too soon. When the objectives are achieved, then the operation is complete and the fighting will stop.”\n\n The UK, France and Germany have released a joint statement following American strikes on Iran’s nuclear facilities, saying that they call upon Iran to engage in negotiations leading to agreement that addresses all concerns associated with its nuclear program. The three countries also urged Iran “not to take any further action that could destabilize the region”, adding: “We have consistently been clear that Iran can never have a nuclear weapon and can no longer pose a threat to regional security.”\n\n Iran’s health ministry said that the US strikes on its nuclear facilities had wounded an unspecified number of people but that none “showed any signs of radioactive contamination”. “For years, the ministry of health has set up nuclear emergency units in the nearest medical facilities to nuclear sites,” ministry spokesperson Hossein Kermanpour said on X.\n\n Israel said that its fighter jets had struck “dozens” of targets across Iran on Sunday, including a long-range missile site in Yazd in the centre of the country for the first time, Agence France Presse reports. A military statement said that “approximately 30 IAF (air force) fighter jets struck dozens of military targets throughout Iran” - including “the ‘Imam Hussein’ Strategic Missile Command Center in the Yazd area, where long-range Khorramshahr missiles were stored”.\n\n US secretary of state Marco Rubio said that “there are no planned military operations right now against Iran.” In a new interview with CBS, Rubio added that “no one will know for days” whether Iran had moved some of its nuclear materials prior to the strikes.\n\n Iran’s parliament has reportedly approved the closing of the key strait of Hormuz shipping lane. Reuters reported Iran’s supreme national security council will make the final decision on the move, which could hamstring global trade by shutting the narrow passage between Iran and Oman.\n\n Pete Hegseth, the US secretary of defence, said the impact of the air strikes was still being assessed, but that the bombing had hit the areas that had been identified in the planning of the operation. Hegseth said: “The battle damage assessment is ongoing, but our initial assessment as the chairman said is that all of our precision munitions struck where we wanted them to strike, and had the desired effect.”\n\n Pete Hegseth praised Donald Trump’s leadership, and said he had overseen the “obliteration” of Iran’s nuclear ambitions. Hegseth said: “Many presidents have dreamed of delivering the final blow to Iran’s nuclear program, and none could until President Trump.”","summary":"Top officials insist US ‘not at war with Iran’; Iranian foreign minister reportedly lands in Moscow to discuss ‘common threats’ with Putin\n\n\nIran says US ‘must receive a response’ after Trump’s strikes on nuclear sites\n\nThe US State Department has issued a “worldwide caution” for Americans, saying the conflict between Israel and Iran could put those travelling or living abroad at an increased security risk. In a post on its website it wrote:\n\nThe conflict between Israel and Iran has resulted in disruptions to travel and periodic closure of airspace across the Middle East. There is the potential for demonstrations against US citizens and interests abroad. The Department of State advises US citizens worldwide to exercise increased caution.\n\nThe ambulance … was en route to transfer a patient when it was severely damaged by a drone strike.\n\nAll occupants of the ambulance – including the driver, the patient, and the patient’s companion – were martyred.\n\n Continue reading...","url":"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news","image":"https://i.guim.co.uk/img/media/bd18e97222dc2e5d646e0c2e394a873d20bb28d2/858_0_4450_3561/master/4450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl","video":null,"publish_date":"2025-06-23 00:54:58","author":"Helen Livingstone","authors":["Helen Livingstone"],"language":"en","category":"politics","source_country":"us","sentiment":-0.149},{"id":334127930,"title":"Russia may be 'a friend' of Iran, but it seems unlikely to offer much help","text":"The Iranian foreign minister said Sunday that he was heading to Russia to meet with President Vladimir Putin on Monday, as Iran weighed a response to a wave of U.S. strikes on its nuclear sites. There was little sign that Russia was prepared to provide military assistance to Iran, its closest remaining Middle East ally, as it prioritized its own war against Ukraine. Iran has not received concrete support from any allies through 10 days of war with Israel. In announcing the trip to Moscow, Iranian Foreign Minister Abbas Araghchi called Russia a friend of Iran and said that the two countries enjoy a strategic partnership and we always consult with each other and coordinate our positions. The Russian Foreign Ministry condemned the American military intervention in Iran, saying it had undermined global efforts to contain the proliferation of nuclear weapons. But the Kremlin has not publicly commented on the attacks, and it has not announced any tangible steps to help Iran. The guarded reaction reflects Putin's limited resources, with Russia in its fourth year of war in Ukraine. Russia is trying to maintain warm relations with Iran's Middle Eastern rivals, including Saudi Arabia. The Kremlin is also likely to tread carefully on issues that may alienate President Donald Trump, whose support -- or, at least, acquiescence -- it needs to secure a peace deal in Ukraine on its own terms. In addition, Russia has benefited from a rise in oil prices caused by the growing unrest in the Middle East. This article originally appeared in The New York Times.","summary":"Iranian Foreign Minister Abbas Araghchi announced a visit to Moscow to meet President Vladimir Putin amid rising tensions following U.S. strikes on Iran’s nuclear sites. While Russia condemned the U.S. intervention, it has not offered military support to Iran, reflecting its focus on the ongoing war in Ukraine and its desire to maintain relations with other Middle Eastern countries like Saudi Arabia.","url":"https://economictimes.indiatimes.com/news/international/global-trends/russia-may-be-a-friend-of-iran-but-it-seems-unlikely-to-offer-much-help/articleshow/122013025.cms","image":"https://img.etimg.com/thumb/msid-122013030,resizemode-4,width-1200,height-900,imgsize-69172,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-23 00:54:27","author":"Anatoly Kurmanaev","authors":["Anatoly Kurmanaev"],"language":"en","source_country":"in","sentiment":0.193},{"id":334130036,"title":"Morning Digest: India debunks claims of U.S. using Indian airspace for Iran strikes; Iranian Parliament votes to close vital Strait of Hormuz after U.S. attack on nuclear sites, and more","text":"Iranian Parliament votes to close vital Strait of Hormuz after U.S. strikes on nuclear sites, disruptions likely to impact oil prices for India\n\nIran’s Parliament, the Majlis, has reportedly approved the closure of the Strait of Hormuz in response to the attacks by the U.S. on Iranian nuclear facilities, the country’s state-owned media PressTV reported on Sunday (June 22, 2025), citing Esmaeil Kowsari, a member of the Majlis. According to the report, the final decision on the closure of the Strait of Hormuz lies with Iran’s Supreme National Security Council. The Strait of Hormuz connects the Persian Gulf with the Gulf of Oman and the Arabian Sea, and is one of the world’s most important oil trade routes. India imports about 80% of its oil requirement, meaning that disruptions in the Strait of Hormuz will likely impact the price of oil that India purchases. The Strait of Hormuz is also a vital trade route for ships travelling to and from India.\n\nUnited Nations chief warns of cycle of retaliation after U.S. bombs Iran\n\nUnited Nations chief Antonio Guterres warned Sunday (June 22, 2025) against yet “another cycle of destruction” and retaliation following the U.S. strikes on Iran’s nuclear facilities, which he said marked a “perilous turn” in the region. “I have repeatedly condemned any military escalation in the Middle East,” the secretary-general told an emergency meeting of the United Nations Security Council. “The people of the region cannot endure another cycle of destruction. And yet, we now risk descending into a rathole of retaliation after retaliation,” he added.\n\n‘Anti-Naxal’ campaigns to continue in monsoon, says Amit Shah\n\nUnion Home Minister Amit Shah on Sunday (June 22, 2025) said that for the first time, ”anti-Naxal” operations would continue during the monsoon even as he reiterated his appeal that Naxals lay down arms and join the mainstream. “Every time during the rainy season, Naxalites used to get rest, but this time, we will not let them sleep during monsoon and we will move further to achieve the target of 31/3 (2026, to eliminate Naxalism_,” Mr. Shah said, laying the foundation stone for the National Forensic Science University (NFSU) campus and a Central Forensic Science Lab in Chhattisgarh’s Nava Raipur Atal Nagar.\n\nIndia debunks claims of U.S. using Indian airspace for Iran strikes, PIB Fact Check confirms\n\nIndia on Sunday (June 22, 2025) dismissed as “fake” claims by certain social media handles that the U.S. fighter jets used Indian airspace to launch strikes against Iran. The U.S. bombed three nuclear sites in Iran on Sunday (June 22, 2025), with U.S. President Donald Trump warning of additional strikes if Iran retaliates. “Several social media accounts have claimed that Indian airspace was used by the United States to launch aircraft against Iran during Operation #MidnightHammer. This claim is fake,” PIB Fact Check said in a post on X.\n\nNIA nabs one more in Maoist revival conspiracy case\n\nThe National Investigation Agency (NIA) on Sunday (June 22, 2025) arrested a key accused involved in the attempts to revive a Communist Party of India (Maoist) Northern Region Bureau (NRB) terror module. The agency also seized digital devices, including hard drives, pen drives, and mobile phones, as well as other “incriminating” material during a search in the West Delhi house of the accused person identified as Vishal Singh, originally from Uttar Pradesh’s Mathura. “Investigations have revealed that the accused, a member of the CPI (Maoist), had delivered a drone to leaders of the banned terror outfit in Chhakarbanda/Panchrukhiya forest area of Bihar to further its anti-national activities,” the probe agency said.\n\nINS Tamal, India’s last imported warship, to be commissioned on July 1\n\nThe Indian Navy is all set to commission its latest stealth multi-role frigate INS Tamal on July 1 at Kaliningrad in Russia. This will be the last warship of the Indian Navy to have been built outside India and the eighth in the series of Krivak-class frigates inducted from Russia over the past two decades. The ceremony will be presided over by Western Naval Commander Vice Admiral Sanjay J. Singh in the presence of several high-ranking Indian and Russian government and defence officials.\n\nECI considers intensive house-to-house verification to update electoral rolls before Bihar Assembly election\n\nAmid allegations by Opposition parties over alleged manipulation of voter rolls, the Election Commission of India (ECI) on Sunday (June 22, 2025) said it was contemplating intensive house-to-house verification for the revision of electoral rolls before the upcoming Bihar Assembly election. This approach is being considered as, in the past, persistent concerns have been raised by various civil society organisations, political parties, and agencies on the inclusion or deletion of names of electors from the rolls, sources in the ECI said. \n\nAnother flight from Iran carrying 311 Indians lands in Delhi; over 1,400 evacuated so far\n\nIndia on Sunday (June 22, 2025) evacuated more than 300 Indian nationals from Iran amid the escalating tensions between the Persian Gulf nation and Israel following the U.S. bombing of three Iranian nuclear sites. The Ministry of External Affairs (MEA) said 311 Indians landed in Delhi on a special flight from the Iranian city of Mashhad. With the fresh batch of evacuees, the total number of those brought back from Iran now stands at 1,428. Three-hundred eleven Indian nationals arrived in New Delhi on a special flight from Mashhad at 4:30 p.m. on June 22, External Affairs Ministry spokesperson Randhir Jaiswal said.\n\nDGCA launches comprehensive safety audit to ensure aviation safety\n\nThe Directorate General of Civil Aviation (DGCA) has launched a comprehensive safety audit to provide a holistic evaluation of the aviation sector by meticulously examining safety, operational efficiency and regulatory compliance. The aviation regulator’s new audit framework is expected to proactively identify systemic vulnerabilities, enhance resilience and ensure strict adherence to the International Civil Aviation Organization’s (ICAO) Standards and Recommended Practices (SARPs) and India’s national aviation objectives. The move to strengthen the safety infrastructure comes days after the tragic crash of London-bound Air India flight AI-171 moments after takeoff in Ahmedabad.\n\nAir India to temporarily reduce flights operated with narrow-body planes on 19 routes\n\nAir India on Sunday (June 22, 2025) said it will temporarily reduce 118 weekly flights operated with narrow-body planes on 19 routes and suspend services on three routes. The announcement comes days after the Tata Group-owned carrier said it will cut international flights operated with wide-body planes by 15% temporarily. In a statement, the airline said it is going for “temporary cuts of less than 5% to its overall narrow-body network”. It said, “This voluntary decision leads to the temporary suspension of Air India’s services on 3 routes and reduction of frequency on 19 routes. The changes are effective until at least 15 July 2025.”\n\nU.S. travel advisory warns citizens of crime, rape, terrorism in India, urges ‘increased caution’\n\nThe U.S. has issued an advisory for its citizens travelling to India, urging “increased caution” due to crime and rape, and advising them not to travel to certain parts of central and eastern parts of the country due to terrorism. The travel advisory issued last week states that “rape is one of the fastest growing crimes in India” and violent crimes, including sexual assault, happen at tourist sites and other locations. It added that terrorists, who target tourist locations, transportation hubs, markets/shopping malls and government facilities, may attack with little or no warning. The advisory also tells U.S. citizens not to travel to parts of Central and East India “due to terrorism.”\n\nIranian ambassador says U.S. ‘decided to destroy diplomacy’ with strikes on nuclear sites\n\nIran said Sunday (June 22, 2025) that the U.S. “decided to destroy diplomacy” with its strikes on the country’s nuclear programme and that the Iranian military will decide the “timing, nature and scale of Iran’s proportionate response”. Iran’s United Nations ambassador, Amir Saeid Iravani, spoke to an emergency meeting of the United Nations Security Council hours after the U.S. inserted itself into Israel’s war against Iran by striking three nuclear sites inside the Islamic Republic.\n\nU.S. President Trump hints at potential regime change in Iran\n\nThe Trump administration on Sunday (June 22, 2025) sent a series of conflicting messages to Iran — with U.S. officials initially indicating a willingness to resume negotiations after a surprise attack on three of the country’s nuclear sites and President Donald Trump talking up the possibility of regime change. “It’s not politically correct to use the term, ‘Regime Change’, but if the current Iranian regime is unable to make Iran great again, why wouldn’t there be a regime change?” Mr. Trump posted on social media. “MIGA!!!”\n\nAt least 20 dead in Syria church attack; Government blames Islamic State\n\nAt least 20 people were killed Sunday (June 22, 2025) in a suicide attack on a church in Damascus, authorities said, with Syria’s Interior Ministry blaming a member of the Islamic State group. The international community condemned the attack, the first of its kind in the Syrian capital since Islamist-led forces toppled long-time ruler Bashar al-Assad in December, and the first on a church there since the country’s civil war erupted in 2011. The Interior Ministry said in a statement that “a suicide attacker affiliated with the Daesh (IS) terrorist group entered the Saint Elias church in the Dwelaa area of the capital Damascus, where he opened fire and then blew himself up with an explosive belt”.\n\nOver 100 firefighters battle large wildfire on eastern Greek island of Chios\n\nMore than 100 firefighters assisted by water-dropping helicopters and planes were battling a large wildfire burning near the main town of the eastern Aegean island of Chios Sunday (June 22, 2025), with emergency services ordering the evacuation of a dozen areas. The fire department said three separate blazes had broken out in the morning and mid-day on Sunday (June 22, 2025) near the town of Chios. The flames were fanned by strong winds, leaving firefighters struggling to contain what turned into one large blaze. The fire department said it was sending an arson investigation team to the island.\n\nInd vs Eng, 1st Test Day 3: Bumrah hands India a slender lead\n\nTrying to get near a 471-run first-innings total would have been a steep climb for most sides. But so emphatically did England turn the tables on India that for most of day three of the first Test in Headingley, it was the visitors — despite a rejuvenating, cool breeze blowing across the ground — who resembled a pack of tired cyclists staring at a hulking mountain. England, from an overnight 209 for three, fought India to a standstill, ending its first essay just six runs adrift. For the remaining two days, the forecast is for grey skies. That means India has to bat well, both for time and runs. India showed the stomach for a fight by reaching 90 for two, propelled by a silken K.L. Rahul knock (47 batting, 75b, 7x4). Jasprit Bumrah got a deserved fifer (24.4-5-83-5), but by the time the 31-year-old earned his fourth and fifth wickets.","summary":"Here is a select list of stories to start the day.","url":"https://www.thehindu.com/news/morning-digest-june-23-2025/article69726252.ece","image":"https://th-i.thgim.com/public/incoming/4rydst/article69725098.ece/alternates/LANDSCAPE_1200/2025-06-18T154538Z_1822239137_RC225FAD2IDY_RTRMADP_3_IRAN-NUCLEAR-SHIPPING-HORMUZ.JPG","video":null,"publish_date":"2025-06-23 00:53:43","author":"Western Naval Commander","authors":["Western Naval Commander"],"language":"en","category":"politics","source_country":"in","sentiment":-0.066},{"id":334126782,"title":"World News | Anti-war Protests Erupt in New York After US Strikes on Iran; Major Cities on High Alert","text":"New York [US], June 23 (ANI): Anti-war protests broke out in New York City on Sunday (local time) as demonstrators took to the streets to condemn the recent US airstrikes on Iranian nuclear facilities, amid heightened security measures across major cities in the United States. Hundreds of protesters marched through the streets of New York, waving Palestinian flags and holding placards that read \"Hands Off Iran\" and \"Stop The War on Iran\", in response to Operation Midnight Hammer -- the US-led military action targeting Iran's Fordow, Isfahan, and Natanz nuclear sites. Also Read | US War Is With Nuclear Programme, Not Iran; Washington Still Open to Diplomacy: JD Vance After ‘Operation Midnight Hammer’ Attacking Tehran's 3 Nuclear Facilities.\nProtesters were also calling out to Israel for initiating the conflict with Iran, as well as their military operation in Gaza.\nEarlier in the day, the New York City Police Department (NYPD) stated that it is deploying more resources across key sites in the city to monitor any potential impact as developments unfold in Iran. Also Read | 'This Is Fake': India Debunks Social Media Posts Claiming US Aircraft Used Indian Airspace to Launch Strikes Against Iran During Operation Midnight Hammer.\nIn a post on X, the NYPD stated that the additional resources would be deployed to religious, cultural and diplomatic sites throughout the city. The department emphasised that it is coordinating with federal partners as part of precautionary measures.\n\"We're tracking the situation unfolding in Iran. Out of an abundance of caution, we're deploying additional resources to religious, cultural, and diplomatic sites across NYC and coordinating with our federal partners. We'll continue to monitor for any potential impact to NYC.\"\nThe developments follow after US President Donald Trump on Saturday (US local time) said that the United States has launched an attack on three Nuclear sites in Iran. US Defence Secretary Pete Hegseth confirmed the success of the operation launched by the US in Iran on Sunday.\nDuring a media briefing with Chairperson of the Joint Chiefs of Staff Air Force General Dan Caine, Hegseth said that the US had successfully conducted precision strikes in Iran's Fordow, Isfahan, and Natanz. \"Last night, on President Trump's order, the US Central Command conducted a precision strike in the middle of the night against three nuclear facilities in Iran - Fordow, Isfahan, and Natanz - in order to destroy or severely degrade Iran's nuclear programme. As Chairman of the Joint Chiefs will demonstrate, it was an incredible and overwhelming success,\" he said. Hegseth said that the orders from the US President and Commander-in-Chief were clear. They 'obliterated' Iran's nuclear ambitions. \"The order we received from our Commander-in-Chief was focused, it was powerful, and it was clear. We devastated the Iranian nuclear program,\" he said. Hegseth also said that the US did not target Iranian troops or civilians. \"But it's worth noting that the operation did not target Iranian troops or the Iranian people,\" he added. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Hundreds of protesters marched through the streets of New York, waving Palestinian flags and holding placards that read &quot;Hands off Iran&quot; and &quot;Stop The War on Iran&quot;, in response to Operation Midnight Hammer -- the US-led military action targeting Iran's Fordow, Isfahan, and Natanz nuclear sites.","url":"https://www.latestly.com/agency-news/world-news-anti-war-protests-erupt-in-new-york-after-us-strikes-on-iran-major-cities-on-high-alert-6945804.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250623000412.jpg","video":null,"publish_date":"2025-06-23 00:50:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.09},{"id":334128306,"title":"Pakistan nominated Trump for peace prize — then condemned his attacks on Iran","text":"Pakistan condemned the strikes ordered on its neighbour Iran by Donald Trump on Sunday.\n\nBut a day earlier, Islamabad had said it would nominate the US president for the Nobel Peace Prize for helping end a four-day conflict with India last month.\n\nIt said he had \"demonstrated great strategic foresight and stellar statesmanship\".\n\nHowever, in its latest statement, Pakistan said Mr Trump's decision to bomb Iranian nuclear facilities violated international law and that diplomacy was the only way to resolve the Iran crisis.\n\n\"The unprecedented escalation of tension and violence, owing to ongoing aggression against Iran is deeply disturbing,\" Pakistan's Ministry of Foreign Affairs said.\n\nAlso on Sunday, Pakistan's prime minister, Shehbaz Sharif, telephoned Iranian President Masoud Pezeshkian and \"conveyed Pakistan's condemnation of the US attacks,\" a statement from the Pakistani leader said.\n\nPakistan's information minister and the foreign ministry did not respond to requests for comment on the apparent contradiction in the country's positions over the weekend.\n\nThousands protest against strikes\n\nIn Pakistan's biggest city, Karachi, thousands marched in protest against the US and Israeli strikes on Iran.\n\nA large American flag with a picture of Mr Trump on it was placed on the road for demonstrators to walk over.\n\nThe protesters shouted out chants against America, Israel and Pakistan's regional enemy India.\n\nMr Trump hailed the mission, which involved stealth bombers launching strikes on three uranium enrichment facilities, as a huge success.\n\nThe targets at Fordow, Natanz and Isfahan had been \"totally obliterated\" he said.\n\nIran's president says the US must receive a \"response to their aggression\" after Sunday's attacks, as new satellite imagery shows damage at the Fordow nuclear site.\n\nOvernight, Vice-President JD Vance said the US was not at war with Iran and had \"no interest in boots on the ground\".","summary":"Pakistan condemned Donald Trump's Sunday strikes on Iran — just a day after saying it would nominate him for the Nobel Peace Prize for helping end last month's India conflict.","url":"https://www.abc.net.au/news/2025-06-23/pakistan-condems-donald-trump-bombing-iran-nobel-peace-prize/105447978","image":"https://live-production.wcms.abc-cdn.net.au/a6267a487d989c518c0f286007136404?impolicy=wcms_crop_resize&cropH=705&cropW=1253&xPos=0&yPos=18&width=862&height=485","video":null,"publish_date":"2025-06-23 00:49:26","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.434},{"id":334130128,"title":"China says US attack on Iran has damaged its credibility","text":"HONG KONG: China said the US attack on Iran's nuclear facilities has damaged Washington's credibility and Beijing was concerned that the situation \"may go out of control\", its state broadcaster reported, following a UN Security Council meeting on Sunday (Jun 23).\n\nPresident Donald Trump said the US had \"obliterated\" Tehran's key nuclear sites, joining Israel in the biggest Western military action against the Islamic Republic since its 1979 revolution.\n\nThe UN Security Council met on Sunday to discuss US strikes on Iran's nuclear sites as Russia, China and Pakistan proposed the 15-member body adopt a resolution calling for an immediate and unconditional ceasefire in the Middle East.\n\nChina's UN Ambassador Fu Cong said parties should restrain the \"impulse of force, avoid exacerbating conflicts and adding fuel to the fire\", according to the state broadcaster CCTV.\n\nFu said parties, especially Israel, \"should immediately cease fire to prevent the situation from escalating and avoid the spillover of war\".\n\nIran was hurt \"but the United States credibility was also damaged - both as a country and as a participant in any international negotiations\", Fu said.\n\nState media commentary late on Sunday said the US move was extremely dangerous and provocative. The Global Times newspaper in an opinion piece, said external military interference would never bring peace, and only \"deepen regional hatred and trauma\".\n\nSeparately China's embassy in Iran said late on Sunday that most Chinese citizens in Iran had been evacuated safely, and those remaining were not in high-risk areas.","summary":"","url":"https://www.channelnewsasia.com/east-asia/china-says-us-attack-iran-has-damaged-its-credibility-5197231","image":"https://dam.mediacorp.sg/image/upload/s--Bs32MVFc--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-06-22t234405z_1_lynxmpel5l0gr_rtroptp_3_iran-nuclear-un.jpg?itok=8B","video":null,"publish_date":"2025-06-23 00:49:15","author":null,"language":"en","category":"politics","source_country":"SG","sentiment":-0.274},{"id":334129796,"title":"Photo confirms Gabbard was in Situation Room during Iran strikes","text":"She is seated to the left of CIA Director John Ratcliffe, who was included in the original selection of photos released by the White House on Saturday night.\n\nThat earlier photo, however, was focused solely on Ratcliffe watching the strikes intently, with anyone to the left of him cut from the shot.\n\nThe release of Gabbard’s Situation Room photo follows earlier speculation that she was not in the facility at the time of the strikes, which was only heightened by President Donald Trump’s direct rebuttals last week of her intelligence assessments about Iran’s nuclear capabilities.\n\nAs recently as Friday, Trump told reporters that Gabbard was “wrong” when she told Congress that Iran “was not building a nuclear weapon.”\n\nYES, IRAN WAS ON THE VERGE OF OBTAINING NUCLEAR WEAPONS\n\nThe White House released an initial batch of photos from the Situation Room on their X account Saturday night, all of which did not include Gabbard in the frame. Instead, pictured were Trump, Vice President JD Vance, Secretary of State Marco Rubio, Defense Secretary Pete Hegseth, Joint Chiefs of Staff Chairman Dan Caine, CIA Director John Ratcliffe, and chief of staff Susie Wiles.\n\nA White House official explained the earlier omission on Sunday by confirming Gabbard was present in the Situation Room, telling Fox News that she is a “key player.”","summary":"A newly released photo shows Director of National Intelligence Tulsi Gabbard among other Trump administration officials in the Situation Room during the U.S. strikes on Iranian nuclear sites Saturday evening. The rapid response X account for the Trump White House posted a photo on Sunday evening, nearly 24 hours after the strikes took place, showing [&#8230;]","url":"https://www.washingtonexaminer.com/policy/national-security/3450472/photo-gabbard-was-in-situation-room-iran-strikes/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/tulsi-gabbard-situation-room-iran-strikes.webp","video":null,"publish_date":"2025-06-23 00:48:23","author":"Zach LaChance","authors":["Zach LaChance"],"language":"en","category":"politics","source_country":"us","sentiment":-0.459},{"id":334127928,"title":"Canberra supports US attack on Iranian nuclear sites, pushes for dialogue","text":"Australia has backed US strikes on Iranian nuclear sites to prevent Tehran from acquiring nuclear weapons. At the same time, calling for urgent de-escalation and a return to diplomacy.After several days of escalations, the US launched strikes on three Iranian nuclear facilities on Sunday (AEST). President Donald Trump stated, “There will be peace, or there will be tragedy for Iran.”Foreign Minister Penny Wong confirmed the support on Monday. She said the world must act to prevent Iran from acquiring nuclear weapons. A UN watchdog recently found Iran had enriched uranium close to weapons-grade.Senator Wong also said Australia had not received any request for military help and was told that the joint US-Australian base at Pine Gap was not involved. She said this was a dangerous moment.Foreign Minister Penny Wong has urged all parties to prioritise diplomacy and dialogue to prevent a “full-scale war” in the Middle East.The National Security Committee will meet in Canberra on Monday to discuss the situation.Australia’s backing goes further than that of allies like the UK, Canada, and New Zealand, which have stopped short of directly supporting the strike.Liberal Senator and former Australian ambassador to Israel, Dave Sharma, called the initial response underwhelming but said support for the strikes was the right move.However, the Greens strongly opposed the strikes. Senator David Shoebridge said military action would only harm civilians and branded Donald Trump a warmonger .Former Australian ambassador to Iran Paul Foley said the government's stand was appropriate. But he warned that tensions could rise, depending on Iran's next move.Options for Iran include not responding, launching a limited strike, or attacking US targets. Foley said diplomacy is still possible if both sides are serious.About 2,900 Australians in Iran and 1,300 in Israel have registered to leave. Australia has officials at the border to help citizens exit Iran. Airspace is closed, and Wong warned that leaving is risky but advised it if possible.The UK, France, Germany, and Italy urged Iran not to escalate. Canada and New Zealand echoed calls for diplomacy.","summary":"Australia has voiced its support for the US strikes on Iranian nuclear facilities, aimed at preventing Iran from developing nuclear weapons, while simultaneously advocating for de-escalation and a return to diplomatic solutions. Foreign Minister Penny Wong emphasized the need to prevent a full-scale war in the Middle East, urging all parties to prioritize dialogue amidst rising tensions.","url":"https://economictimes.indiatimes.com/news/international/australia/canberra-supports-us-attack-on-iranian-nuclear-sites-pushes-for-dialogue/articleshow/122012984.cms","image":"https://img.etimg.com/thumb/msid-122012999,resizemode-4,width-1200,height-900,imgsize-57488,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-23 00:47:55","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.346},{"id":334126118,"title":"Trump’s $400 Million Impact on Australia’s International Strategy: ‘Projects Are Unraveling’","text":"The reduction in foreign aid by the Trump administration has led to a $400 million impact on Australian projects, as reported by a leading humanitarian agencies’ body. This has caused organizations to cut essential tasks, leaving vulnerable groups without much-needed assistance.\n\nEarlier this year, Conciliation Resources (CR), a group dedicated to fostering international peace, began a five-year initiative aimed at the Highlands of Papua New Guinea.\n\nUnfortunately, Ciaran O’Toole, who leads CR’s Southeast Asia and the Pacific division, indicated that the project was suspended due to budget cuts by the United States Agency for International Development (USAID), resulting from a 90-day funding pause in January under President Donald Trump.\n\n“Our principal efforts are directed at communities to build or reinforce their ability to avert violent conflict,” O’Toole stated.\n\nThe program’s goal was to prevent violence in an area where conflict is increasing. Last year, 49 people were killed in the Highlands region in what was considered a major escalation in tribal fighting.\n\n“It’s not just reacting to when violence occurs. It’s not just crisis management. It is about trying to resolve what are the underlying causes of these conflicts,” O’Toole said. \n\n“It is what not happens, right? It’s the headlines that don’t exist.”\n\nBut the plan to station mediators in PNG’s Hela province to assist communities in finding non-violent ways to address grievances came to an abrupt halt due to the funding pause earlier this year. Only 14 per cent of programs have had their funding reinstated since then. \n\nCR was forced to let some staff go and reduce the hours of others.\n\nThe program is one of more than 120 projects by Australian aid agencies impacted by the cuts, according to a report by the Australian Council for International Development (ACFID).\n\nACFID found that at least 124 programs run by Australian organisations were affected by the US funding cuts, worth at least $400 million, and 20 in-country offices for Australian-based aid organisations were closed as a result.\n\nJessica Mackenzie, ACFID policy and advocacy chief, said: “Just one agency had to let go of 200 local staff.”\n\n“They would have been single-income families, so you can imagine the flow-on effects.”\n\nThe Trump administration’s funding cuts have resulted in a $400 million hit to Australian projects, according to ACFID. Source: SBS News\n\nAustralian-run programs in the Indo-Pacific region were hardest hit, with $113 million worth of funding lost in the Pacific, closely followed by $111 million in Southeast Asia.\n\nBut the impact for Australian agencies extends throughout Africa, the Middle East, and Asia.\n\nThe report found a specific program assisting 765,000 people in Yemen was discontinued.\n\n“It was providing life-saving medicine. It was providing life-saving food, and it was providing malnutrition help for 26,000 children under the age of five,” Mackenzie said.\n\nIn Nepal, a program supporting over 300 girls in attending school was also axed, according to the report.\n\n“That means that they’re more exposed to modern slavery, to human trafficking, to forced child marriage,” Mackenzie said. “The flow-on effects of these projects and their ability to break the cycle of poverty are really quite compounding.”\n\nIt is still unclear whether programs co-funded by both the Australian and US governments will proceed.\n\n“When that US funding was stripped back, that whole project now comes into question,” Mackenzie said. “What I’m hearing, it’s very hard to say at this early stage, but a lot of these projects are falling away now.”\n\nChild-related programs have been the most heavily impacted, according to figures.\n\nThe US government undertook a review during the initial 90-day pause to ensure only programs fully aligning with the president’s foreign policy were funded by USAID.\n\nWhile aid organisations say they have been given little clarity by the administration as to why programs were cut, there is a belief that those focused on climate change and gender did not meet the administration’s expectations.\n\n“I don’t think there was much thinking gone into it, to be quite honest,” O’Toole said. \n\n“Anything that had the word gender in it. Anything, possibly, even with the words peace building, was eliminated, we believe, pretty quickly.\n\nAustralia’s response to funding cuts\n\nLabor reallocated $119 million of foreign aid from global health and education programs to the Indo-Pacific region in its pre-election budget in response to the USAID pause, but did not announce any additional spending.\n\nAfter the election, Labor committed $10 million of additional aid to Gaza.\n\nACFID is calling for aid spending to be increased from 0.65 per cent to 1 per cent of the federal budget to help fill the gap left by the US cuts.\n\n“Between 2005 and 2015, it was at 1 per cent,” Mackenzie said. “This isn’t a really big change.”\n\nSince coming into power, Labor has increased its diplomatic and humanitarian efforts in the Pacific, with concerns about China’s influence in the region driving increased investment and aid programs.\n\nMackenzie said the government should prioritise funding health, education, and nutrition programs over initiatives with “geostrategic imperatives”.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe reduction in foreign aid by the Trump administration has led to&#8230;\n\n\nThis Post: Trump&#8217;s $400 Million Impact on Australia&#8217;s International Strategy: &#8216;Projects Are Unraveling&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/trumps-400-million-impact-on-australias-international-strategy-projects-are-unraveling/","image":"https://images.sbs.com.au/dims4/default/4b7fda3/2147483647/strip/true/crop/1242x699+0+53/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F8b%2F66%2F439abda94a7ebf878891d4bb38fd%2Fpodcast-sbsnews-shorts-1242x804-2.jpg&imwi","video":null,"publish_date":"2025-06-23 00:47:35","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.665},{"id":334129416,"title":"ASX falls on ‘very nervous start’ to Monday’s trading after US strikes Iran","text":"Oil prices have surged as the rest of the market wobbled on Monday morning, with the ASX 200 suffering a “very nervous start” to the trading week.\n\nThe ASX 200 fell 44.30 points or 0.52 per cent to 8461.20 on the opening bells as investors weighed up the risks in the Middle East.\n\nThe Aussie dollar also slumped, falling from US64.94 cents to US64.48 as the tension escalates.\n\nInvestors are worried about two major potential escalations in the conflict, with either the closure of the Strait of Hormuz or an all-out regional war negatively impacting the price of oil.\n\nCutting off the Strait of Hormuz could send the price of oil above $US100 a barrel, as the 32km mile stretch is the primary route of exports from Saudi Arabia, Iraq, the UAE, and Kuwait.\n\nCapital.com senior financial market analyst Kyle Rodda said traders would be looking to gauge risks of energy shocks and the potential impact of the broader conflict.\n\n“The markets are confronting a very nervous start to the week where the only thing that will matter is the fallout from the US missile strike on Iranian nuclear assets over the weekend,” Mr Rodda said.\n\n“There’s already some talk of (closing the Strait of Hormuz) from the Iranians, with the instability in the region and risks to critical infrastructure alone enough to worry energy markets.”\n\nUS Secretary of State Marco Rubio said closing the crucial Strait of Hormuz would be a “suicidal” move to the Iranian regime.\n\nMr Rubio said closing the strait would affect the US, but it would have “a lot more impact on the rest of the world”, particularly on China.\n\n“That would be a suicidal move on (Iran’s) part because I think the whole world would come against them if they did that,” Mr Rubio said.\n\nOn Saturday (Sunday AEST), US forces confirmed strikes on three Iranian nuclear facilities in the latest flair up between Israel and Iran.\n\nUS President Donald Trump said the three nuclear sites in Iran – Fordow, Isfahan and Natanz – were “completely obliterated” but this is yet to be independently verified.\n\nThe armed conflict sent the price of Brent crude oil surging to above $US80 a barrel after it was about $US65 a barrel.\n\nMr Rodda said the first move by markets would be a possible kneejerk, with traders taking a shoot-first-ask-questions-later approach.\n\n“But as the dust settles and more of the facts become known – especially the extent of the damage achieved by the US – the markets will turn to gaming out the likely course of events from here and quantifying the risks to asset prices,” he said.","summary":"Investors face a “nervous week” as the fallout from the Middle East conflict drags markets lower and the price of oil skyrockets.","url":"https://thewest.com.au/business/asx-falls-on-very-nervous-start-to-mondays-trading-after-us-strikes-iran-c-19123888","image":"https://images.thewest.com.au/publication/C-19123888/a5e7a3846536194c6091be8255b09d53e087459a-16x9-x0y192w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2025-06-23 00:47:27","author":"Cameron Micallef,Cameron Micallefnew","authors":["Cameron Micallef","Cameron Micallefnew"],"language":"en","source_country":"au","sentiment":-0.135},{"id":334131016,"title":"Nuclear sites: Iran threatens US bases in response to strikes","text":"WASHINGTON: Iran on Sunday threatened US bases in the Middle East after massive air strikes that Washington said had destroyed Tehran’s nuclear program, though some officials cautioned that the extent of damage was unclear.\n\nInternational concern intensified that the unprecedented US attacks would deepen conflict in the Middle East after Israel launched a bombing campaign against Iran earlier this month.\n\nAli Akbar Velayati, an advisor to Iran’s supreme leader Ayatollah Ali Khamenei, said bases used by US forces could be attacked in retaliation.\n\n“Any country in the region or elsewhere that is used by American forces to strike Iran will be considered a legitimate target for our armed forces,” he said in a message carried by the official IRNA news agency.\n\n“America has attacked the heart of the Islamic world and must await irreparable consequences.”\n\nPresident Donald Trump urged Iran to end the conflict after he launched surprise “bunker buster” strikes on a key underground uranium enrichment site at Fordo, along with nuclear facilities in Isfahan and Natanz.\n\n“We had a spectacular military success yesterday, taking the ‘bomb’ right out of their hands (and they would use it if they could!)” he said on social media.\n\nDefense Secretary Pete Hegseth told a Pentagon press briefing that Iran’s nuclear program was “devastated,” adding that the operation “did not target Iranian troops or the Iranian people.”\n\nStanding beside Hegseth, top US general Dan Caine said “it would be way too early for me to comment on what may or may not still be there.”\n\n“Initial battle damage assessments indicate that all three sites sustained extremely severe damage and destruction.”\n\nAs Iran’s leaders struck a defiant tone, President Masoud Pezeshkian also vowed that the United States would “receive a response” to the attacks.\n\nPeople gathered Sunday in the center of Tehran to protest against US and Israeli attacks, waving flags and chanting slogans.\n\nIn an address to the nation hours after the attack, Trump had claimed total success for the operation, and Vice President JD Vance followed up on Sunday morning.\n\n“We know that we set the Iranian nuclear program back substantially last night,” he told ABC.\n\nBut he also suggested Iran still had its highly enriched uranium.\n\n“We’re going to work in the coming weeks to ensure that we do something with that fuel,” he said. “They no longer have the capacity to turn that stockpile of highly enriched uranium to weapons grade uranium.”\n\nAnother Khamenei advisor, Ali Shamkhani, said in a post on X that “even if nuclear sites are destroyed, game isn’t over, enriched materials, indigenous knowledge, political will remain.”\n\nRafael Grossi, the head of the UN International Atomic Energy Agency (IAEA), told CNN there were clear signs of the hit on Fordo.\n\nBut no one knows “how much it has been damaged,” he said.","summary":"WASHINGTON: Iran on Sunday threatened US bases in the Middle East after massive air strikes that Washington said had destroyed Tehran’s nuclear program, though some officials cautioned that the extent of damage was unclear.\n\n\n\nInternational concern intensified that the unprecedented US attacks would deepen conflict in the Middle East after Israel launched a bombing campaign against Iran earlier this month.\n\n\n\nAli Akbar Velayati, an advisor to Iran’s supreme leader Ayatollah Ali Khamenei, said bases used by US forces could be attacked in retaliation.\n\n\n\n“Any country in the region or elsewhere that is used by American forces to strike Iran will be considered a legitimate target for our armed forces,” he said in a message carried by the official IRNA news agency.\n\n\n\n“America has attacked the heart of the Islamic world and must await irreparable consequences.”\n\n\n\nPresident Donald Trump urged Iran to end the conflict after he launched surprise “bunker buster” strikes on a key underground uranium enrichment site at","url":"https://www.brecorder.com/news/40369123/nuclear-sites-iran-threatens-us-bases-in-response-to-strikes","image":"https://i.brecorder.com/large/2025/06/6858a30d78257.png","video":null,"publish_date":"2025-06-23 00:45:47","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.284},{"id":334131018,"title":"Democrats assail ‘erratic’ Trump over Iran strikes","text":"WASHINGTON: Democrats bristled Sunday over US President Donald Trump’s decision to launch air strikes on Iran without seeking authorization from Congress, accusing the Republican of violating the constitution and demanding a vote to rein in his war powers.\n\nMembers of the Senate and House of Representatives argued that US intelligence had not shown an imminent threat from the Middle Eastern country that justified Trump’s unilateral action.\n\n“President Trump’s actions in bombing Iran puts the US on the brink of a wider war in the Middle East, all without constitutionally required Congressional approval,” Senate Democratic Whip Dick Durbin said in a statement.\n\nDemocrats were divided between those demanding a vote on a war powers resolution to constrain Trump’s authority to launch further action and a smaller group, who maintained that the strikes were grounds for the Republican leader’s impeachment.\n\nThey included Illinois moderate Sean Casten and New York leftist Alexandria Ocasio-Cortez, who accused the president of having “impulsively risked launching a war that may ensnare us for generations.” Chuck Schumer and Hakeem Jeffries, the Democratic leaders in the Senate and House respectively, said Trump had “dramatically increased” America’s risk of becoming embroiled in a new Middle Eastern conflagration.","summary":"WASHINGTON: Democrats bristled Sunday over US President Donald Trump’s decision to launch air strikes on Iran without seeking authorization from Congress, accusing the Republican of violating the constitution and demanding a vote to rein in his war powers.\n\n\n\nMembers of the Senate and House of Representatives argued that US intelligence had not shown an imminent threat from the Middle Eastern country that justified Trump’s unilateral action.\n\n\n\n“President Trump’s actions in bombing Iran puts the US on the brink of a wider war in the Middle East, all without constitutionally required Congressional approval,” Senate Democratic Whip Dick Durbin said in a statement.\n\n\n\nDemocrats were divided between those demanding a vote on a war powers resolution to constrain Trump’s authority to launch further action and a smaller group, who maintained that the strikes were grounds for the Republican leader’s impeachment.\n\n\n\nThey included Illinois moderate Sean Casten and New York leftist Alexandria Ocasio-Cortez, who accused ","url":"https://www.brecorder.com/news/40369124/democrats-assail-erratic-trump-over-iran-strikes","image":"https://i.brecorder.com/large/2025/06/6858a2386f03f.jpg","video":null,"publish_date":"2025-06-23 00:45:47","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.067},{"id":334126122,"title":"The Collapse of Operation ‘Midnight Hammer’: A Mission Founded on Deception","text":"The ‘Invisible Defenders’ rolled from aircraft hangers into the muggy Missouri air at the start of a mission destined for the annals of military aviation.\n\nAssembled were nine of the most expensive and advanced aircraft in the world, the B-2 Stealth Bomber, eerily futuristic in appearance and destined to reshape the Middle East.\n\nEven at Whiteman Air Force Base in the US Mid-West the details of the mission were a closely guarded secret.\n\nThe bombers slipped into the clammy darkness above Whiteman at just after midnight local time on Saturday at the start of a 37-hour mission that would surprise the world.\n\nToday, that world is adjusting to the implications of Operation Midnight Hammer, a mission marking the end of a 45-year stand-off between the United States and Iran. A vast amount of detail has yet to be released, but the mission was planned and rehearsed years in advance for precisely the situation the US is now confronted by.\n\nUnder the wings of each of the B-2s were two of the biggest conventional bombs ever produced, the GBU-57, or Massive Ordnance Penetrator (MOP) as it is known in military vernacular.\n\nInitially, the fleet flew in a triangular formation across the night sky and over the great plains and lakes of America’s interior.\n\nBut then came the first of many deceptions – intended to keep the world guessing about Donald Trump’s intentions – when a pair of B-2s split from the ‘strike package’ and headed west towards the Pacific.\n\nTheir destination was not Iran but Guam, a US island territory in Pacific Micronesia and home to the Andersen Air Force Base, 4,000 miles from Iran.\n\nKeen watchers of the sky, particularly in these turbulent times, soon picked up on their movements and reports spread. Their intended destination was reported on international wire services and made the Trump-friendly Fox News headlines.\n\nThat focus allowed the remaining seven-strong team to head to their real target – the nuclear facilities run by the Tehran regime. Operating under virtual radio silence, they flew undetected for 18 hours, aided by refuelling tankers in the sky to keep them on their way.\n\nGeneral Dan Caine, chairman of the US Joint Chiefs of Staff, explained to the world’s press yesterday: ‘As part of a plan to maintain tactical surprise, part of the package proceeded to the west and into the Pacific as a decoy. This deception effort was known only to an extremely small number of planners and key leaders here in Washington DC and in Tampa [the headquarters of US Central Command].\n\n‘The main strike package proceeded quietly to the east with minimal communications.\n\n‘Throughout the 18-hour flight into the target area the aircraft completed multiple in-flight refuellings.’\n\nSenior US officials, including the Commander-in-Chief himself, were buoyed by the success of the sleight of hand as they gathered in the White House War Room.\n\nThere the US President, whose second term is likely to be shaped by the fallout from yesterday’s operation, was joined by leading lieutenants, such as Vice-President JD Vance and Defence Secretary Pete Hegseth.\n\nA notable absentee was National Security Director Tulsi Gabbard, who became persona non grata after she backed a US intelligence report that concluded that Iran, contrary to Israel’s claims, was not on the cusp of developing a nuclear missile.\n\nReportedly, President Trump has scarcely spoken to her since.\n\nShe is likely to have been among the majority of US officials who were entirely unaware that Midnight Hammer was taking place.\n\nIt was America’s most classified mission of recent times. Very few officers in the Pentagon knew of its existence, let alone the operational details.\n\nAccording to reports, the UK was told of the mission before the bombs dropped, but President Trump’s decision to launch it from mainland United States, rather than the joint UK-US base at Diego Garcia, was telling.\n\nSeemingly, he was determined to deliver an ‘America First’ mission to convince isolationist sceptics in his Make America Great Again (MAGA) support base that he had made the right call.\n\nThat determination dictated that the United States provided every one of the 125 combat aircraft involved, every precision-guided missile, every cruise missile and every naval vessel.\n\nThe seven remaining B-2s continued towards Iran, shielded by an echelon of fighter jets. But the US’s opening salvo would be fired not from any of these aircraft but a US nuclear submarine in the Arabian Sea.\n\nAt just before 10pm GMT the as-yet unnamed US submarine fired more than two dozen Tomahawk land attack cruise missiles.\n\nTheir purpose was to neutralise Iranian defence systems protecting nuclear enrichment facilities at Isfahan. When these sites had been destroyed, the B-2 group entered Iranian airspace.\n\nThe stealth jet squadron slipped into enemy skies, moving into attack formation at ‘high altitude and high speed’, with lighter, more mobile F-22 fighter jets sweeping in front of the B-2s to shield them from any surface-to-air or air-to-air fire. \n\nThere was none. Not a single shot was fired at any of the aircraft or warships involved in Midnight Hammer from the beginning of the operation to its end.\n\nSoon they were on top of their main target, the Fordow nuclear plant buried in a mountain south of Tehran and protected with reinforced concrete. The first bunker-busters struck vulnerable positions at the facility such as ventilation shafts. According to US commanders, all 14 GBU-57s struck their intended targets.\n\nSmoking craters picked up on satellite images yesterday looked almost like pin-pricks on the rocky landscape, showing the accuracy of the strikes. The huge blast effects desired by the Americans will have occurred deep beneath the surface.\n\nFinally, it appears a further volley of Tomahawk cruise missiles launched by US Navy vessels to protect the B-2s and F-22s as they began their long journey home.\n\nThe aircraft left Iranian airspace just 25 minutes later and headed home, seemingly without the regime having a clue that they were there. Then, and only then, did the White House inform Congress of the military action. This could prove controversial in the US, particularly as no exceptions were made for senior Republicans in both houses.\n\nEven ultra-loyal Trump lawmakers had to wait. As the US had not declared war on Iran, the bombing mission did not need Congress’s prior approval. Gen Caine said yesterday that initial assessments indicated that ‘all three sites sustained extremely severe damage and destruction’.\n\nPresident Trump boasted that they had been ‘completely and totally obliterated’ and that no other military in the world could have accomplished the mission.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe ‘Invisible Defenders’ rolled from aircraft hangers into the muggy Missouri air&#8230;\n\n\nThis Post: The Collapse of Operation &#8216;Midnight Hammer&#8217;: A Mission Founded on Deception first appeared on Internewscast Journal","url":"https://internewscast.com/news/the-collapse-of-operation-midnight-hammer-a-mission-founded-on-deception/","image":"https://internewscast.com/wp-content/uploads/2025/06/How-Operation-Midnight-Hammer-fell-Mission-was-built-on-deception.jpg","video":null,"publish_date":"2025-06-23 00:45:32","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.062},{"id":334126982,"title":"Why your hangover REALLY is getting worse the older you get... and it's not what you think: POLLY VERNON exposes the secret world of the female body, from common lifestyle problems that trigger menopause to how much breasts weigh","text":"How much do you know about the female body? Your body? Or your friend's, your sister's, your daughter's?\n\nOh, you know the one! It's considered softer, 'fairer'; more vulnerable but also, more capable of enduring pain. It bleeds on purpose sometimes, it can get pregnant at others, it's both fetishised and derided (often by the same people, at the same time), and it belongs to 49.74 per cent of the world's population.\n\nFor example: Do you know what a female sex hormone is? Or any hormone for that matter – what they look like, how they operate?\n\nWhat they want from us? Are they really our diabolical overlords, capable of manipulating our bodies and our personalities on an unknowable whim? Or are they on-side? Friendly, even?\n\nAnd what's a brain exactly? Is a female brain distinct from a male brain? Does that explain why we're twice as likely to be diagnosed with depression and Alzheimer's? Did you know women are twice as likely to be diagnosed with Alzheimer's?\n\nHow about menopause? Is it puberty in reverse? An initially slow, but then increasingly speedy luge run toward pointlessness, social invisibility, fury, flushes, divorce and death?\n\nOr is it actually not that at all? Because, you know, women have been known to win Nobel prizes after the menopause.\n\nI didn't know. Didn't know any of it. For years, I'd driven my body around like it was a car – and I had zero interest in the manual. Then, one day last year, I found myself in the haematology department of my local hospital in north London waiting for a blood test. I was due to start taking a drug to cure a dose of toenail fungus – sexy I know – and this drug was hardcore enough that my liver function needed to be assessed in advance.\n\nThere were forty-ish people in the waiting room with me, all ages, all ethnicities, all shapes and sizes and clothing choices and so on, but… just the one gender.\n\nWe were all female. Every last one of us. 'What's this about?' I wondered.\n\nLater that day I loitered on the Tube platform, waiting for my train, half-heartedly reading the billboard adverts covering the walls. I suddenly realised that one in three of them – maybe more – were offering private diagnostic tests.\n\nThere was everything from fertility tests, menopause-related hormone tests, immune system tests to thyroid function.\n\nAll these tests! And almost all of them very obviously aimed at women. Tests designed to check every aspect of us, to pinpoint potential failings and deficiencies, and name and quantify future risks we hadn't even considered yet.\n\nSuddenly, wherever I went, all I heard was chat about women's bodies.\n\nA feminist mate told me 'there's more research into male pattern baldness than there is into all aspects of women's health combined'. My GP sang the praises of HRT – 'but isn't it dangerous?' I replied – and said that women in their 50s and 60s were seeing some of the highest rates of sexually transmitted infection.\n\nSo much of it was confusing and contradictory and overwhelming. I really did need a manual.\n\nI'm a journalist, an interviewer by trade. I've interviewed everyone from Harry Styles to Donald Trump to Gwyneth Paltrow. Interviewing is something I love doing; lifting the bonnet on someone else's mind, having a good old rummage, seeing who they are and what they know. It's one of the few things I'm qualified to do.\n\nSo – I start thinking – what if I were to apply my interview techniques to a load of experts on women's bodies? Neuroscientists, academics, medical specialists, midwives, gynaes, psychologists and physios?\n\nWhat if I were to collate… Not just the textbook knowledge, but also the evolving theses, observations and personal experiences of a bunch of people who have dedicated their professional lives to women's bodies?\n\nSo that's what I did. And now I've published it all in my new book, How The Female Body Works.\n\nHere are ten of the little gems and nuggets of hitherto unknown knowledge I gleaned along the way. Bet you didn't know them either…\n\nWhy menopausal women get hot flushes\n\nI turn to hormone specialist Dr Nicky Keay for this one. One theory, she tells me, says it's all to do with the conductors of the hormonal orchestra – the pituitary gland and the hypothalamus – which lie at the base of the brain.\n\nWhen a woman reaches menopause, her egg supply has dwindled almost to nothing and she's no longer able to regularly ovulate. For a while, however, these controllers still attempt to chivvy the ovaries into action by pumping out two egg-stimulating hormones – FSH (follicle-stimulating hormone) and LH (luteinising hormone) – as if they can force them into action. 'The conductor of the endocrine orchestra, the pituitary gland, gets very cross with the ovaries. 'You're slacking! What are you doing?',' says Dr Keay.\n\nBut there's a side-effect of this. Because the pituitary and hypothalamus also act as the body's thermostat, constantly checking and adjusting its temperature, the brain's efforts to get the ovaries producing eggs – something they can no longer do – now raises the body's temperature. And boom – a hot flush hits. Or that's the theory.\n\n'Why ever they happen, the point is,' Dr Keay goes on, 'you feel out of control and horrible… typically in the middle of a work meeting.'\n\nWhy your breasts could account for almost half a stone when you step on the scales!\n\nIf you've ever wondered – and most women have – B cup breasts weigh around 10oz each, a C cup, around 1lb each, D: around 1lb 8oz each, while DD/E cup boobs can weigh anywhere between 1lb 8oz and 3lb each!\n\nWhy a woman might overlook an unwashed mug in the sink before day 14 of her menstrual cycle… but won't after it\n\nThis is all to do with the hormone oestrogen, which builds in the first phase of the menstrual cycle. Oestrogen makes you 'more positive, more energised', says Maisie Hill, menstrual health expert and author of Period Power. In this first phase: 'We're more out in the world, going out, curious, interested, flirty...Whether you want to conceive or not, your body, your hormones, are driving you towards mating behaviour.'\n\nWhich is also why oestrogen 'doesn't want you focused on the pile of dirty dishes your partner has left', Maisie goes on, 'because then, you're not going to want to have sex with them.'\n\nIn the second half of the cycle, however, oestrogen falls back, progesterone surges and, well, 'the rose-tinted glasses are off…'\n\nThat's when we see the details that bother us – the ones we were able to gloss over before. If you're more critical of your partner – and self-critical – during the last two weeks of your cycle, that's down to your hormones.\n\nWhy you might get the menopause early if you are stressed\n\nA constant release of the stress hormone cortisol through earlier life can disrupt the production of oestrogen and progesterone, says Dr Keay. This is why stress can cause interruptions in a regular menstrual cycle and ultimately be a factor in preventing a woman from conceiving.\n\nIt now seems excess cortisol might also hasten the onset of menopause by up to four years. It's a bit of a vicious circle, too – falling oestrogen during menopause can also cause anxiety, which can make you more vulnerable to stress.\n\nWhy your hangover is worse the older you get\n\nIt feels horribly unfair, but women are affected by alcohol more than men. 'We have more body fat than men, so the rate at which we metabolise alcohol is slower,' research fellow in behavioural science and health at University College London Dr Sharon Cox tells me. 'If we drink the same as men, we will get more unwell.'\n\nMoreover, as we get older, we find it harder again to metabolise alcohol, so hangovers become worse. This is exacerbated during the menopause, when our oestrogen levels drop. But it's not just a physical phenomenon. Dr Sally Adams, assistant professor in health psychology at the University of Bath has found that as women get older, they start to feel more guilty about drinking and to subjectively rate their hangovers as worse than they used to be. More guilty than when we were younger? 'And more guilty about drinking than men,' she says.\n\nSo our hangovers, or at least our perception of their severity, might be a form of self-punishment? We're sort of making ourselves feel worse? Or perhaps, experiencing our guilt as physical pain? Because we think we're too old to be behaving like this?\n\n'Yes! And then, there's another twist to this, which is: women who've had children, regardless of their age, also report feeling more guilt and more pain when they're hungover. It's likely the feeling of guilt is intertwined with pain. 'I'm in pain because I feel ashamed, I feel ashamed because I'm in pain'.'\n\nPerhaps, then, if we stopped feeling so bad about it, we'd stop feeling so bad.\n\nWhy men can smell female sex hormones\n\nIs there such a thing as arome de oestrogen? Well, yes there is, according to an (admittedly small) study from the University of Zurich in 2019, in which men were asked to rate 28 women of reproductive age in order of the attractiveness of their smell.\n\nAll the study subjects chose women who, previous tests indicated, possessed the highest levels of oestrogen. Another study by researchers at Yale University, published in 2020, also concluded that women smell different when they are most fertile.\n\nWhy baby brain is real, but not in the way you think it is\n\nThe brain in pregnancy goes into 'a state of plasticity', according to Dr Sarah McKay, author of The Woman's Brain Book. Meaning? 'That it's super sensitive to learning and change.'\n\nJust as at puberty, a significant pruning of grey matter takes place during pregnancy, which counter-intuitively allows speedier connections between nerve cells, making you smarterand sharper.\n\nThe reason? To very quickly learn how to interpret what our imminently-arriving baby needs and wants.\n\nThis change, Dr McKay says, is driven 'particularly in the third trimester' by oestradiol, that especially potent hormonal subtype of oestrogen, which 'is at sky-high levels during pregnancy'.\n\n'If you have a pregnancy, you'll get a thousand times more oestrogen than you'll receive in the entire rest of your life. And that's a good thing, because oestrogen is a good hormone, our brains really like it. It builds [brain] resilience, and – particularly during pregnancy – it's driving the social brain rewiring.'\n\nThese changes, this rewiring, Dr McKay thinks, is routinely misconstrued.\n\nPregnant women, and women who have given birth and are now raising newborns, are often assumed to be cognitively lesser, when in fact, they're demonstrably sharper. This, then, is the real definition of 'baby brain'.\n\nWhy breast milk varies according to the time of day – and the weather\n\nCan newborns somehow communicate with their mothers' bodies to influence the very make-up of their milk? Or is that Googled-up rubbish?\n\n'The nutrients in breast milk vary for lots of different reasons,' says Dr Philippa Kaye, a GP, former sexual health advisor for Ann Summers, and most pertinently in this instance, author of the brilliant Breasts: An Owner's Guide. In the kind of hot weather we've been having, for example, a woman's body produces milk with more water content to keep a baby hydrated.\n\nIt can also change depending on the time of day, with different levels of an amino acid that makes us feel sleepy called trytophan. 'So, in an ideal world, if you're expressing at nine o'clock at night, that would be the milk you'd would give on a night feed rather than at seven in the morning,' says Dr Kaye. The more trytophan, the better a baby should sleep.\n\nStudies also show that breast-fed children are roughly twice as likely to go on to achieve top GCSE results; that their performance in the exams, taken at 16 years of age, improves incrementally the longer the child's mother breastfed them, and that breastfeeding for at least four months significantly increased the likelihood of passing five GCSEs.\n\nWhy Elizabeth II may have had a biologically 'young' brain\n\n'She had four children,' says Dr McKay. 'Up to four children builds in biological resilience to ageing – it makes your brain look slightly younger – but if you have more than four, the stress of it all wipes that out.'\n\nWhy do twice as many women get Alzheimer's as men?\n\nPartly because women live longer than men and there are simply more old ladies than old men to get Alzheimer's, and partly because, yes, the menopause makes women more vulnerable to it.\n\nNeuroscientist Dr Lisa Mosconi, author of The Menopause Brain, says there are 'changes in structure, connectivity and energy production' during menopause, though the brain does adapt to them.\n\n'The greatest brain changes occur in the timeframe where [menopause] symptoms are most intense.'\n\nImportantly, however, while all women go through menopause, they don't all develop Alzheimer's (about 20 per cent do). 'So menopause doesn't cause Alzheimer's, but it may make the brain more vulnerable.'\n\nBut Dr McKay also wonders if Alzheimer's is more prevalent in women because it's more routinely diagnosed in women – and because of the part we play\n\nin society. One theory says that, particularly in more traditionally-structured families, if the female gets Alzheimer's disease, she often comes to the clinic much earlier in the disease process than the man.\n\n'Because if the man still has his wife getting up every morning, making him his tea and his toast, washing his clothes, he presents much later, because he's kind of supported through,' says Dr McKay. 'Whereas if she gets dementia, he's screwed.\n\n'So we see gender playing a role there in terms of diagnosis.'\n\nShe also thinks there's reason to be hopeful that Alzheimer's will become less apparent in women as our societies become more equal in gender terms. The more 'educated, connected, out-in-the-world lives' women lead, the less likely – goes the theory – they are to get dementia. \n\nHow The Female Body Works by Polly Vernon (New River, £16.99), to be published 26 June. © Polly Vernon 2025. To order a copy for £13.49 (offer valid to 28/06/25; UK P&P free on orders over £25) go to mailshop.co.uk/books or call 020 3176 2937.","summary":"How much do you know about the female body? Your body? Or your friend's, your sister's, your daughter's?","url":"https://www.dailymail.co.uk/femail/article-14836239/Polly-Vernon-baby-brain-stress-exists-female-body.html","image":"https://i.dailymail.co.uk/1s/2025/06/22/15/99612217-0-image-m-11_1750601471925.jpg","video":null,"publish_date":"2025-06-23 00:42:54","author":"Editor,Polly Vernon","authors":["Editor","Polly Vernon"],"language":"en","source_country":"gb","sentiment":-0.113},{"id":334126178,"title":"US warns against Iran retaliation as Trump raises 'regime change' - Reuters","text":"SummaryTrump asks 'why wouldn't there be a Regime change?'Operation included over 125 aircraft and more than 75 munitionsHegseth: operation is not open ended, US will respond if neededTop general: nuclear sites sustained extremely severe damage and destruction\n\nWASHINGTON, June 22 (Reuters) - U.S. President Donald Trump on Sunday raised the question of regime change in Iran following U.S. strikes against key military sites over the weekend, as senior officials in his administration warned Tehran against retaliation.\n\n\"It’s not politically correct to use the term, “Regime Change,” but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!\" Trump wrote on his social media platform.\n\nAdvertisement · Scroll to continue\n\nTrump's post came after officials in his administration, including U.S. Vice President JD Vance and Defense Secretary Pete Hegseth, stressed they were not working to overthrow Iran's government.\n\n\"This mission was not and has not been about regime change,\" Hegseth told reporters at the Pentagon, calling the mission \"a precision operation\" targeting Iran's nuclear program.\n\nVance, in an interview on NBC's \"Meet the Press with Kristen Welker,\" said \"our view has been very clear that we don't want a regime change.\"\n\n\"We do not want to protract this or build this out any more than it's already been built out. We want to end their nuclear program, and then we want to talk to the Iranians about a long-term settlement here,\" Vance said, adding the U.S. \"had no interest in boots on the ground.\"\n\nAdvertisement · Scroll to continue\n\n\"Operation Midnight Hammer\" was known only to a small number of people in Washington and at the U.S. military's headquarters for Middle East operations in Tampa, Florida.\n\nComplete with deception, seven B-2 bombers flew for 18 hours from the United States into Iran to drop 14 bunker-buster bombs, chairman of the Joint Chiefs of Staff, General Dan Caine, told reporters.\n\nIn total, the U.S. launched 75 precision-guided munitions, including more than two dozen Tomahawk missiles, and more than 125 military aircraft in the operation against three nuclear sites, Caine said.\n\nThe operation pushes the Middle East to the brink of a major new conflagration in a region already aflame for more than 20 months with wars in Gaza and Lebanon, and a toppled dictator in Syria.\n\nDAMAGE TO FACILITIES\n\nWith the damage visible from space after 30,000-pound U.S. bunker-buster bombs crashed into the mountain above Iran's Fordow nuclear site, experts and officials are closely watching how far the strikes might have set back Iran's nuclear ambitions.\n\nCaine said initial battle damage assessments indicated all three sites sustained extremely severe damage and destruction, but he declined to speculate whether any Iranian nuclear capabilities might still be intact.\n\nU.N. nuclear watchdog chief Rafael Grossi was more cautious, saying while it was clear U.S. airstrikes hit Iran's enrichment site at Fordow, it was not yet possible to assess the damage done underground.\n\nA senior Iranian source told Reuters on Sunday that most of the highly enriched uranium at Fordow, the site producing the bulk of Iran's uranium refined to up to 60%, had been moved to an undisclosed location before the U.S. attack.\n\nItem 1 of 2 U.S. Secretary of Defense Pete Hegseth holds a briefing at the Pentagon, after the U.S. struck Iranian nuclear facilities, during the Israel-Iran conflict, in Arlington, Virginia, U.S., June 22, 2025 in this still image taken from handout video. Reuters TV/U.S. Department of Defense/Handout via REUTERS [1/2]U.S. Secretary of Defense Pete Hegseth holds a briefing at the Pentagon, after the U.S. struck Iranian nuclear facilities, during the Israel-Iran conflict, in Arlington, Virginia, U.S., June 22, 2025 in this still image taken from handout video. Reuters TV/U.S. Department of Defense/Handout via... Purchase Licensing Rights, opens new tab Read more\n\nVance told NBC the U.S. was not at war with Iran but rather its nuclear program, and he thought the strikes \"really pushed their program back by a very long time.\"\n\nTrump called the damage \"monumental,\" in a separate social media post on Sunday, a day after saying he had \"obliterated\" Iran's main nuclear sites, but gave no details.\n\nTehran has vowed to defend itself and responded with a volley of missiles at Israel that wounded scores of people and destroyed buildings in its commercial hub Tel Aviv.\n\nBut, perhaps in an effort to avert all-out war with the superpower, it had yet to carry out its main threats of retaliation, to target U.S. bases or choke off the quarter of the world's oil shipments that pass through its waters.\n\nCaine said the U.S. military had increased protection of troops in the region, including in Iraq and Syria.\n\nThe United States already has a sizeable force in the Middle East, with nearly 40,000 troops in the region, including air defense systems, fighter aircraft and warships that can detect and shoot down enemy missiles.\n\nReuters reported last week the Pentagon had started to move some aircraft and ships from bases in the Middle East that may be vulnerable to any potential Iranian attack.\n\nNOT OPEN-ENDED\n\nWith his unprecedented decision to bomb Iran’s nuclear sites, directly joining Israel’s air attack on its regional arch foe, Trump has done something he had long vowed to avoid - intervene militarily in a major foreign war.\n\nThere were sporadic anti-war demonstrations on Sunday afternoon in some U.S. cities, including New York City and Washington.\n\nIt was unclear why Trump chose to act on Saturday.\n\nAt the press conference, Hegseth said there was a moment in time when Trump \"realized that it had to be a certain action taken in order to minimize the threat to us and our troops.\"\n\nAfter Trump disputed her original assessment, Director of National Intelligence Tulsi Gabbard on Friday said the U.S. had intelligence that should Iran decide to do so, it could build a nuclear weapon in weeks or months, an assessment disputed by some lawmakers and independent experts. U.S. officials say they do not believe Iran had decided to make a bomb.\n\nU.S. Secretary of State Marco Rubio, asked on CBS' \"Face the Nation with Margaret Brennan\" whether the U.S. saw intelligence that Iran's Supreme Leader Ayatollah Ali Khamenei had ordered nuclear weaponization, said: \"That's irrelevant.\"\n\nHegseth, who said the Pentagon notified lawmakers about the operation after U.S. aircraft were out of Iran, said the strikes against Iran were not open-ended.\n\nRubio also said no more strikes were planned, unless Iran responded, telling CBS: \"We have other targets we can hit, but we achieved our objective. There are no planned military operations right now against Iran - unless they mess around.\"\n\nReporting by Phil Stewart and Idrees Ali; Additional reporting by Jasper Ward and Kanishka Singh; Editing by Giles Elgood, Lisa Shumaker, Deepa Babington and Chris Reese\n\nPurchase Licensing Rights\n\nPhil StewartThomson ReutersPhil Stewart has reported from more than 60 countries, including Afghanistan, Ukraine, Syria, Iraq, Pakistan, Russia, Saudi Arabia, China and South Sudan. An award-winning Washington-based national security reporter, Phil has appeared on NPR, PBS NewsHour, Fox News and other programs and moderated national security events, including at the Reagan National Defense Forum and the German Marshall Fund. He is a recipient of the Edwin M. Hood Award for Diplomatic Correspondence and the Joe Galloway Award.Idrees AliThomson ReutersNational security correspondent focusing on the Pentagon in Washington D.C. Reports on U.S. military activity and operations throughout the world and the impact that they have. Has reported from over two dozen countries to include Iraq, Afghanistan, and much of the Middle East, Asia and Europe. From Karachi, Pakistan.","summary":"US warns against Iran retaliation as Trump raises 'regime change'  Reuters","url":"https://www.reuters.com/world/middle-east/us-strikes-against-iran-nuclear-facilities-incredible-overwhelming-success-2025-06-22/","image":"https://www.reuters.com/resizer/v2/EJ4BHHYMPNME5NHQGSSRZ2Q3CA.jpg?auth=20604b529ec2308b9c8456355ca1ea37ad5ad73c5df925f0adc5afaff1c6a6bc&height=1005&width=1920&quality=80&smart=true","video":"https://ajo.prod.reuters.tv/v3/playlist/695648/master.m3u8","publish_date":"2025-06-23 00:34:00","author":"Idrees Ali,Phil Stewart","authors":["Idrees Ali","Phil Stewart"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.276},{"id":334130836,"title":"White House calls CNN 'fake news' for report claiming Democratic leadership wasn't briefed on Iran strike","text":"White House press secretary Karoline Leavitt demanded CNN retract a story on Sunday that claimed Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries were not briefed on President Donald Trump’s strike on Iran. Trump launched \"Operation: Midnight Hammer\" on Saturday and struck three of Iran’s key nuclear facilities in a surprise attack. The White House announced the success of the attack later that night. CNN reported that House Speaker Mike Johnson and Senate Majority Leader John Thune, both Republicans, were briefed on the strikes ahead of time, with Schumer and Jeffries, both Democrats, receiving notifications only before the public announcement and well after the attack. TOP DEMOCRATS, MEDIA DECLARE US AT WAR AFTER IRAN STRIKES AS WHITE HOUSE PUSHES BACK ON NARRATIVE Leavitt called the report \"fake news\" on X. \"This is Fake News. The White House made bipartisan courtesy calls to Congressional Leadership and spoke to @SenSchumer before the strike. @RepJeffries could not be reached until after, but he was briefed. @CNN please retract,\" Leavitt wrote. Fox News Digital reached out to Schumer and Jeffries’ offices for comment. The CNN report added that Sen. Mark Warner, D-Va., and Rep. Jim Himes, D-Ct., who are members of the intelligence committees in the Senate and House respectively, were not told until after the strikes. CNN didn't immediately respond to a request for comment. Both Schumer and Jeffries released statements over the weekend condemning Trump for the strikes on Iran. SECRETARY OF STATE MARCO RUBIO CLASHES WITH CBS HOST OVER IRANIAN NUCLEAR AMBITIONS Although both criticized Trump for not seeking congressional authorization for the attack, neither claimed that they were not briefed or notified before the actual strike. In his statement, Schumer called on Thune to enforce the War Powers Act. \"No president should be allowed to unilaterally march this nation into something as consequential as war with erratic threats and no strategy,\" Schumer said. CLICK HERE TO GET THE FOX NEWS APP","summary":"White House press secretary Karoline Leavitt attacked CNN for reporting that the administration didn’t reach out to Sen. Chuck Schumer and Rep. Hakeem Jeffries.","url":"https://www.foxnews.com/media/white-house-calls-cnn-fake-news-report-claiming-democratic-leadership-wasnt-briefed-iran-strike","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/ebce6515-leavitt.png?ve=1&tl=1","video":null,"publish_date":"2025-06-23 00:30:33","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"us","sentiment":-0.335},{"id":334128364,"title":"Morales seeks re-election defying constitution and criminal charges","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\nunder the radar\n\nMorales seeks re-election defying constitution and criminal charges\n\nSupporters of former president clash with authorities as Bolivia's political and economic turmoil deepens\n\nNewsletter sign up\n\nEvo Morales wants to stand for a fourth term in Bolivia's upcoming presidential election, sparking unrest and violence across the country\n\n(Image credit: Illustration by Stephen Kelly / Getty Images)\n\nHarriet Marsden, The Week UK \n\n23 June 2025\n\nEnduring support for former president Evo Morales has once again boiled over into violence in Bolivia, deepening the nation's political and economic crisis.\n\nAt least four first responders are dead after clashes between anti-government protesters and authorities, the justice minister said last week, adding that some had been shot. \"We can't call these civilian protests any more,\" said César Siles. \"We are talking about paramilitary groups, groups that carry weapons, and we have to respond firmly.\"\nMore than 300 people have been injured in weeks of unrest after the courts blocked Morales, 65, from seeking a fourth term in the 17 August election and thus defying Bolivia's constitutional two-term limit. The demonstrations have \"strangled transportation by blocking highways\", said Reuters. Protests have \"gained momentum\" in rural areas of the Andean nation, amid \"frustration\" over Morales' disqualification and the \"deteriorating\" economic landscape, with inflation at its highest rate in nearly 20 years.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nSocialist hero turned exile\nAfter Morales became the first Indigenous leader of Bolivia in 2006, the former coca farmer presided over a decade of economic prosperity driven by a boom in natural gas. But in 2016, Bolivians narrowly voted against his attempt to remove presidential term limits from the constitution in a referendum. Morales chose to ignore it, running again in 2019 for an unprecedented third term as president at the head of the Movimiento al Socialismo (Mas) party.\n\nMorales claimed to have won a vote \"marred by accusations of fraud\", said The Associated Press, triggering weeks of violent protests. He was forced to flee to Mexico, where he backed his finance minister, Luis Arce, as the new leader of Mas.\nIn 2020, Arce swept to victory. But Morales' return from exile turned the socialist allies into \"bitter\" rivals for the leadership of Mas. The \"depth of the schism\" has \"paralysed the government\" and exacerbated Bolivia's worsening economic crisis.\nThe courts upheld Bolivia's two-term presidential limit – but in February Morales announced that he would seek re-election \"in defiance\" of that ruling, said France24. \"We will win,\" Morales said in his \"political fiefdom\" of Cochabamba, central Bolivia. He said he would run as the candidate for a small leftist group named \"The Front for Victory\", which has no seats in parliament, instead of Mas.\nThe charges against Morales\nBut Morales is also facing criminal charges. Since October, he has been \"entrenched in the coca-growing region of Chapare\", said The Guardian. A warrant was issued in December for his arrest on charges of human trafficking involving a minor. The claim is that he had a sexual relationship with a 15-year-old girl while in office, and allegedly fathered a child with her in 2016. Hundreds of coca farmers have been protecting him from the police and military, who are trying to execute that warrant.\nIn the mining town of Llallagua, a 17-year-old student was reportedly \"beaten to death by protesters who accused him of being a police informant\". One of the police officers was \"kidnapped by a mob\", according to the government, and killed with dynamite.\n\"[The officers] were Bolivians who gave their lives at a time when the country is under siege, facing the risk that elections might not be able to take place,\" said Arce.\n\"Morales wants to enter the elections at all costs, and he won't succeed,\" said economic analyst Gonzano Chávez Alvarez, a professor at the Universidad Católica Boliviana. \"So there's uncertainty over whether the elections will really happen because it's hard to say whether Morales will have enough strength to stop them.\"\n\nExplore More\n\nSouth America\nLatin America\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nHarriet Marsden, The Week UK\n\nSocial Links Navigation\n\nHarriet Marsden is a writer for The Week, mostly covering UK and global news and politics. Before joining the site, she was a freelance journalist for seven years, specialising in social affairs, gender equality and culture. She worked for The Guardian, The Times and The Independent, and regularly contributed articles to The Sunday Times, The Telegraph, The New Statesman, Tortoise Media and Metro, as well as appearing on BBC Radio London, Times Radio and “Woman’s Hour”. She has a master’s in international journalism from City University, London, and was awarded the \"journalist-at-large\" fellowship by the Local Trust charity in 2021. \n\nJune 22 editorial cartoons\n\nSunday’s political cartoons include a SpaceX flight, Bibi pulling Donald Trump toward war, and an ICE agent looking like a bank robber\n\n5 bunker-busting cartoons about the Israel-Iran war\n\nPolitical cartoonists take on Iran waiting for Pete Hegseth to leak war plans and Donald Trump's wish for a Nobel prize\n\nMalaysia's delicious food and glorious beaches\n\nThe Week Recommends\nFrom 'colourful' George Town to the 'jungled interior' of Langkawi, Malaysia is incredibly diverse\n\nYou might also like\n\nIs the G7 still relevant?\n\nTalking Point\nDonald Trump's early departure cast a shadow over this week's meeting of the world's major democracies\n\nTrump leaves G7 early, warns Tehran to evacuate\n\nTrump claimed to have left the summit due to ongoing issues in the Middle East\n\nIs this the end for India's Maoist insurgency?\n\nUnder The Radar\nNarendra Modi clamps down on Naxalite jungle rebels in move some see as attempt to seize mineral wealth\n\nHow the Arctic became a geopolitical flashpoint\n\nThe Explainer\nThe UK is working with Nato allies in the Arctic Circle to prepare for potential Russian aggression\n\nWhy Turkey's Kurdish insurgents are laying down their arms\n\nUnder the Radar\nThe PKK said its aims can now be 'resolved through democratic politics'\n\nMerz's coalition deal: a 'betrayal' of Germany?\n\nTalking Point\nWith liberalism, freedom and democracy under threat globally, it's a time for 'giants' – but this is a 'coalition of the timid'\n\nTaiwan's tricky balancing act\n\nThe Explainer\nThe island nation, no longer certain of US backing against a hostile China, is quietly looking for other solutions\n\nMarine Le Pen: will her conviction fuel the far-right?\n\nTalking Point\nWith National Rally framing their ex-leader as a political martyr, is French court ruling an own goal for democracy?\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"Supporters of former president Evo Morales clash with authorities as political and economic turmoil deepens","url":"https://theweek.com/politics/morales-seeks-re-election-defying-constitution-and-criminal-charges","image":"https://cdn.mos.cms.futurecdn.net/iCNfdhcN9EGKGCUyqmKULA.jpg","video":null,"publish_date":"2025-06-23 00:26:14","author":"Harriet Marsden","authors":["Harriet Marsden"],"language":"en","category":"politics","source_country":"us","sentiment":0.25},{"id":334126114,"title":"How Trump’s Actions Shaped the Future: Defeating the Suicide Bill and More Insights","text":"From the right: Don Just Changed the Future\n\nCommentary’s John Podhoretz finds it remarkable that in the Middle East scenario, Trump’s claims about himself hold true. Trump boasts of ending wars rather than starting them, and the events of Saturday night align with this, as he effectively puts a stop to Iran’s hostile actions, either immediately or after further resistance from Iran’s leaders. According to Podhoretz, Israel also didn’t initiate the conflict; it began with Iran and its allies on October 7. The broader implications of the strike are significant enough that there’s no need to hasten in interpreting them. Notably, Trump has expressed a belief since an assassination attempt in Butler, Pa., that a higher power preserved him for a purpose, a sentiment Podhoretz now shares.\n\nConservative: Kill the Suicide Bill\n\nJohn Hirschauer from City Journal is urging Gov. Hochul to veto “The Medical Aid in Dying Act” that the State Assembly approved in April. This legislation would permit individuals with terminal illnesses to obtain prescriptions for life-ending drugs. The bill doesn’t just move towards affirming suicide as a fundamental right; it also lacks substantial protections. For instance, it doesn’t mandate a psychiatric evaluation for those requesting the drugs, and it doesn’t have a residency clause, allowing non-residents to come to New York to end their lives. Although suffering is a part of human life, the state’s position that illness could justify ending one’s life implies that it considers life under suffering conditions to be devoid of value.\n\nLiberal: UFT Winning Mayoral Primary\n\nJoe Klein, writing on Substack, points out that despite an enormous expenditure of $36,000 per student—about double the national average—New York schools are underperforming. The National Assessment of Educational Progress shows only 28% of students proficient in reading, with slightly higher numbers in math. One major issue is that teachers in the city, like other municipal employees, have job security that makes it difficult to dismiss them. Education is crucial for New York’s future success, yet it’s largely ignored in the Democratic mayoral primary discussions. A report by the Manhattan Institute graded most candidates poorly, except for Whitney Tilson, who received criticism from the teachers’ union for his moderate views. The union has withheld its endorsement likely because it’s confident the winner will adhere to its preferences.\n\nFrom the right: LA Needed Trump’s Help\n\n“Gov. Gavin Newsom told Defense Secretary Pete Hegseth that local law enforcement officers were ‘sufficient to maintain order’ ” in Los Angeles, yet LAPD officers tell Heather Mac Donald at The Wall Street Journal, “We don’t have s— under control.” She cites numerous instances of violence that, by “sheer luck,” weren’t life-threatening. “Should Trump have waited to see if the locals” would eventually control the situation? The answer’s clear: “Police Chief Jim McDonnell put the LAPD on tactical alert” and canceled all time off. Yet days later, Mayor Karen Bass nonetheless had to order a curfew. “Still the disorder continued.” Fact is, “There is more danger from tolerating” lawlessness than from responding to it “with all legal means.”\n\nLibertarian: Cut the F-35\n\n“As the U.S. grapples with ballooning federal budgets and increasingly necessary spending cuts, the military remains ripe for austerity,” blares Joe Lancaster at Reason. The F-35 jet is a perfect example of a “program that deserves to be scrapped.” Since its inception after 9/11, “the jet has proven itself not ready from prime time, both more expensive and less functional than promised.” Too bad “the House Appropriations Committee’s proposed Defense Appropriations Bill for 2026 would spend $8.5 billion on F-35s,” and “President Donald Trump has called the F-35 ‘the greatest fighter jet in the world.’” “The F-35 means to replace previous-generation aircraft like the F-16, but instead, the obsolete models are running circles around their intended replacement.” Every new thing we hear about the F-35, “proves that it’s long past time to kill the program.”\n\n— Compiled by The Post Editorial Board","summary":"Internewscast Journal\n\nInternewscast\n\n\nFrom the right: Don Just Changed the Future Commentary’s John Podhoretz finds&#8230;\n\n\nThis Post: How Trump&#8217;s Actions Shaped the Future: Defeating the Suicide Bill and More Insights first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/how-trumps-actions-shaped-the-future-defeating-the-suicide-bill-and-more-insights/","image":"https://internewscast.com/wp-content/uploads/2025/06/How-Trump-changed-the-future-kill-the-suicide-bill-and.jpg","video":null,"publish_date":"2025-06-23 00:24:39","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.182},{"id":334125220,"title":"Donald Trump Iran plan: US President suggests ‘regime change’ could ‘Make Iran Great Again’","text":"Camera IconUS President Donald Trump has revealed what could help ‘Make Iran Great Again’. Credit: AAP\n\nDonald Trump Iran plan: US President suggests ‘regime change’ could ‘Make Iran Great Again’\n\nMax CorstorphanThe NightlyJune 23, 2025 8:23AMComments","summary":"US President Donald Trump has revealed what may be needed to ‘Make Iran Great Again’ after B-2 pilots dropped bombs on Iranian nuclear targets and called for peace.","url":"https://www.perthnow.com.au/news/world/donald-trump-iran-plan-us-president-suggests-regime-change-could-make-iran-great-again-c-19123537","image":"https://images.perthnow.com.au/publication/C-19123537/33bd36c12f74d01921072e479eba520601828dd0-16x9-x0y22w800h450.jpg?imwidth=1200","video":null,"publish_date":"2025-06-23 00:23:48","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.483},{"id":334126402,"title":"Donald Trump Iran plan: US President suggests ‘regime change’ could ‘Make Iran Great Again’","text":"US President Donald Trump says a “regime change” may be needed to “Make Iran Great Again”.\n\nAfter authorising B-2 pilots to drop an enormous payload of bombs on Iranian nuclear targets as part of Operation Midnight Hammer, the US President issued a warning to the Middle Eastern nation, saying peace was needed to avoid “future attacks”.\n\n“Iran, the bully of the Middle East, must now make peace,” Mr Trump said from the White House on Saturday (local time).\n\n“If they do not, future attacks would be far greater and a lot easier.”\n\nAs the region grapples with the intensity of the US strike and the direct involvement of the leader of the free world, Mr Trump has suggested Iran’s Government may need to be toppled.\n\n“It’s not politically correct to use the term, ‘Regime Change’, but if the current Iranian regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a regime change???” Mr Trump wrote on Truth Social, adding “MIGA!”.\n\nMr Trump in another post confirmed that the pilots who dropped the bombs on Iran were back on US soil.\n\n“The GREAT B-2 pilots have just landed, safely, in Missouri. Thank you for a job well done!” he wrote.\n\nThe posts come as the United States and the world waits for signs of potential retaliation from Iran after Mr Trump said key nuclear sites in Tehran had been “obliterated”, joining Israel in the biggest Western military action against the Islamic Republic since its 1979 revolution.\n\nUN nuclear watchdog chief Rafael Grossi told the Security Council that while craters were visible at Iran’s enrichment site buried into a mountain at Fordow, “no one - including the IAEA - is in a position to assess the underground damage”.\n\nMr Grossi said entrances to tunnels used for the storage of enriched material appear to have been hit at Iran’s sprawling Isfahan nuclear complex, while the fuel enrichment plant at Natanz has been struck again.\n\n“Iran has informed the IAEA there has been no increase in off-site radiation levels at all three sites,” said Mr Grossi, who heads the International Atomic Energy Agency.\n\nIran requested the UN Security Council meeting, calling on the 15-member body “to address this blatant and unlawful act of aggression, to condemn it in the strongest possible terms.”\n\nIsrael’s UN Ambassador Danny Danon said in a statement on Sunday that the US and Israel “do not deserve any condemnation, but rather an expression of appreciation and gratitude for making the world a safer place.”\n\nMr Danon told reporters before the council meeting that it was still early when it came to assessing the impact of the US strikes. When asked if Israel was pursuing regime change in Iran, Mr Danon said: “That’s for the Iranian people to decide, not for us.”\n\n- With Reuters.","summary":"US President Donald Trump has revealed what may be needed to ‘Make Iran Great Again’ after B-2 pilots dropped bombs on Iranian nuclear targets and called for peace.","url":"https://thewest.com.au/news/world/donald-trump-iran-plan-us-president-suggests-regime-change-could-make-iran-great-again-c-19123537","image":"https://images.thewest.com.au/publication/C-19123537/33bd36c12f74d01921072e479eba520601828dd0-16x9-x0y22w800h450.jpg?imwidth=1200","video":null,"publish_date":"2025-06-23 00:23:48","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.167},{"id":334131186,"title":"Toxic threat from 'forever chemicals' sparks resistance in Georgia towns","text":"Sasha and Jamie Cordle thought their small farm in rural Georgia would be a ladder out of working-class struggle, and a gift for their children and grandchildren.\n\nInstead, it may be poisoning them.\n\nTests show their spring water is laced with toxic \"forever chemicals\" at levels tens of thousands of times above federal safety guidelines, likely from nearby carpet factories.\n\n\"It scares us,\" said Sasha, a 38-year-old dispatcher whose husband drives long hauls across the country. She's worried about their five children, two-year-old granddaughter, and a grandson due in October.\n\nPFAS -- or per- and polyfluoroalkyl substances -- are a group of more than 10,000 human-made chemicals that repel heat, water, oil, and stains.\n\nDeveloped in the 1940s, they're still used in nonstick pans, firefighting foams and stain-proof carpets, yet are now linked to hormonal disruption, immune suppression and cancers.\n\nTheir ultra-tough carbon-fluorine bonds take millennia to break down in the environment, linger in bodies for years, and are now found in the blood of nearly every living creature on Earth.\n\n– 'Carpet capital of world' –\n\nHere in Dalton, Georgia, which calls itself the \"Carpet Capital of the World,\" mills run by giants Mohawk Industries and Shaw Industries are widely blamed for making the region one of America's most PFAS-laden.\n\nThey're accused of spewing the chemicals into the air, flushing them into sewers unequipped to remove them, and indirectly contaminating farmland through sludge byproducts later spread as fertilizer.\n\nThe Cordles have joined other landowners in suing the carpet makers, seeking damages to \"remediate\" their properties -- a process they estimate could cost about $1 million per acre -- plus punitive damages.\n\nMohawk, Shaw, and chemical giant 3M declined to comment on the complaint. Chemical maker Chemours, another chemical maker and defendant, says it has no factories in Georgia and denies culpability.\n\nIn a complex web of lawsuits, Dalton Utilities, which manages the local water system, has also sued the carpet makers, while Mohawk has sued 3M over the same issue.\n\nThe Biden administration last year enacted the first enforceable national drinking water standards for six PFAS chemicals.\n\nBut under President Donald Trump, the federal government has since rolled back limits on four of the chemicals and delayed the compliance deadline for the remaining two.\n\n Test cases \n\nMeanwhile, the Cordles have seen alarming signs, in both humans and animals.\n\nSasha, who moved to the property after marrying Jamie in 2020, soon developed two autoimmune conditions, as well as high blood pressure and chronic fatigue.\n\n\"Sometimes getting out of bed, I feel like I'm 80,\" she said.\n\nHer grown children also report various ailments -- and some goat kids didn't survive their birth defects.\n\nAttorney Ben Finley is leading a wave of damages claims, recruiting new clients at buoyant town halls.\n\nSo far, his firm has filed suits for 18 lead plaintiffs.\n\n\"We're drawing a direct line between contamination, lost property value and cleanup cost,\" Finley said.\n\n– Entering the food web –\n\nWhile the lawyers work the crowds, water expert Bob Bowcock takes water, soil and dust samples to help build the scientific case behind the legal one.\n\n\"We've got springs emitting into ponds that are discharging to creeks at over 180,000 parts per trillion,\" he said. The national guideline for drinking water is just four parts per trillion, and local creeks are often seen frothing with pollution.\n\nPFAS in the soil move up the protein chain and into the food web -- contaminating eggs, milk, beef, and leafy greens that find themselves on store shelves nationwide.\n\nThe carpet makers are the area's main economic lifeline, yet many are now turning against them.\n\nMary Janet Clark, 62, toiled for the carpet makers, had her ovaries removed after cancer, and now has a tumor in her brain.\n\n\"We helped them build their business and make all that money,\" said her son, David Wray, 40. \"It's just cruel.\"\n\n– Lost dreams –\n\nOthers share similar grief.\n\nHuman-resources manager Teresa Ensley, 57, lost her brother, father and husband to cancer in just a few years.\n\nStudies have linked PFAS to elevated colon cancer rates, the disease that killed her brother and husband. She and her 81-year-old mother both suffer severe thyroid problems and have had hysterectomies.\n\nEven for those not yet sick, the toll is palpable.\n\nGreg and Sharon Eads hoped to retire on farmland they bought in 2019, but it has since tested hot for PFAS, unraveling their dream.\n\nThey own $50,000 worth of cattle now off-limits for milk or meat.\n\nIt's become \"basically a petting zoo,\" said Greg. \"I can't do anything with them, not in good conscience.\"\n\nDuring a recent visit, the couple led AFP through bucolic pastures where the herd huddled around a healthy newborn calf -- a welcome moment of hope after several others were lost to deformities.\n\nSource: AFP","summary":"Sasha and Jamie Cordle thought their small farm in rural Georgia would be a ladder out of working-class struggle, and a gift for their children and grandchildren. Sasha, who moved to the property after marrying Jamie in 2020, soon developed two autoimmune conditions, as well as high blood pressure and chronic fatigue.","url":"https://www.legit.ng/business-economy/economy/1660889-toxic-threat-chemicals-sparks-resistance-georgia-towns/","image":"https://cdn.legit.ng/images/1200x675/cac9743383ed546f.jpeg?v=1","video":null,"publish_date":"2025-06-23 00:22:05","author":"Bayo Olupohunda","authors":["Bayo Olupohunda"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.311},{"id":334123902,"title":"India debunks claims of U.S. using Indian airspace for Iran strikes, PIB Fact Check confirms","text":"India on Sunday (June 22, 2025) dismissed as “fake” claims by certain social media handles that the U.S. fighter jets used Indian airspace to launch strikes against Iran.\n\nAlso read: Israel-Iran conflict updates\n\nThe U.S. bombed three nuclear sites in Iran on Sunday (June 22, 2025), with U.S. President Donald Trump warning of additional strikes if Iran retaliates.\n\n“Several social media accounts have claimed that Indian airspace was used by the United States to launch aircraft against Iran during Operation #MidnightHammer. This claim is fake,” PIB Fact Check said in a post on X.\n\n“Indian Airspace was NOT used by the United States during Operation #MidnightHammer,” said the fact check unit of the Press Information Bureau that functions under the Ministry of Information and Broadcasting.\n\nIt said that the Joint Chiefs of Staff Chair Gen. Dan Caine had explained the route used by U.S. aircraft during a press briefing.","summary":"It said that the Joint Chiefs of Staff Chair Gen. Dan Caine had explained the route used by U.S. aircraft during a press briefing","url":"https://www.thehindu.com/news/national/india-debunks-claims-of-us-using-indian-airspace-for-iran-strikes-pib-fact-check-confirms/article69725760.ece","image":"https://th-i.thgim.com/public/incoming/4it30/article69726040.ece/alternates/LANDSCAPE_1200/iStock-1182207660.jpg","video":null,"publish_date":"2025-06-23 00:17:00","author":null,"language":"en","source_country":"in","sentiment":-0.697},{"id":334126784,"title":"World News | PIB Fact Check Debunks Claims of US Using Indian Airspace for Strikes on Nuke Sites in Iran, Calls Them 'fake'","text":"New Delhi [India], June 23 (ANI): The Fact Check unit of the Press Information Bureau (PIB) has debunked claims circulating on social media that the US military used Indian airspace to carry out their Operation Midnight Hammer, launched against Iran's nuclear infrastructure. In a post on X on Sunday, the PIB Fact Check unit labelled the assertion as \"FAKE\" and clarified, \"Indian Airspace was NOT used by the United States during Operation Midnight Hammer.\" Also Read | US War Is With Nuclear Programme, Not Iran; Washington Still Open to Diplomacy: JD Vance After ‘Operation Midnight Hammer’ Attacking Tehran's 3 Nuclear Facilities.\nThe misinformation alleged that US forces utilised Indian airspace to conduct military strikes on Iran's nuclear infrastructure.\nThe fact-checking body cited a press briefing by the Chairman of the US Joint Chiefs of Staff, General Dan Caine, who detailed the alternative routes taken by US aircraft, dismissing the claims as baseless.\nAlso Read | 'This Is Fake': India Debunks Social Media Posts Claiming US Aircraft Used Indian Airspace to Launch Strikes Against Iran During Operation Midnight Hammer.\n\"Several social media accounts have claimed that Indian Airspace was used by the United States to launch aircrafts against Iran during Operation Midnight Hammer. This claim is FAKE. Indian Airspace was NOT used by the United States during Operation Midnight Hammer. During the Press Briefing Joint Chiefs of Staff Chair Gen. Dan Caine explained the route used by US aircraft,\" the Fact Check unit stated in its post on X.\nEarlier on Sunday, after the strikes on nuclear facilities in Iran, the Chairman of the US Joint Chiefs of Staff, General Dan Caine, said Operation Midnight Hammer was designed to \"severely degrade Iran's nuclear weapons infrastructure\".\nWhile holding a press briefing at the Pentagon, General Caine presented a detailed map and timeline of the operation, which showed that none of the US aircraft entered the Indian airspace.\nDetailing the operation, General Caine stated, \"At approximately 6:40 PM EST, 2:10 am Iran time, the lead B-2 two dropped GBU 57 MOP (Massive Ordnance Penetrator) weapons on the first of several aim points at Fordow.\"\n\"As the President stated last night, the remaining bombers then hit their targets as well, with a total of 14 MOPs dropped against two nuclear target areas. All three Iranian nuclear infrastructure targets were struck between 6:40 PM and 7:05 PM EST (2:10 AM local time Iran), with the Tomahawk missiles being the last to strike at Isfahan to ensure we retain the element of surprise throughout the operation,\" he added.\nThe US military employed \"several deception tactics\", including decoys, to maintain tactical surprise, he said.\n\"As the Operation Midnight Hammer strike package entered Iranian airspace, the US employed several deception tactics, including decoys, as the 4th and 5th generation aircraft pushed out in front of the strike package at high altitude and high speed, sweeping in front of the package for enemy fighters and surface Air missile threats,\" he added.\nFurther, Caine stated that \"at midnight Friday and Saturday morning, a large B2 strike package comprised of bombers launched from the continental United States. As part of the plan to maintain tactical surprise, part of the package proceeded to the West and into the Pacific as a decoy, a deception effort known only to an extremely small number of planners and key leaders here in Washington and in Tampa.\"\n\"The main strike package, comprised of seven B2 Spirit bombers, each with two crew members, proceeded quietly to the East with minimal communications,\" he added.\nThe operation was executed by US Central Command under the command of General Erik Kurilla.\nEarlier in the day, US President Donald Trump said the \"very successful\" strikes had hit the Natanz, Fordow and Isfahan underground nuclear sites in Iran.\nSpeaking from the White House, Trump announced that America carried out \"massive precision\" strikes on Iran and warned Tehran of further retaliation if peace was not achieved.\nIran condemned the attacks, calling them a violation of international law and vowed to continue its nuclear program. A statement issued by the Atomic Energy Organisation of Iran (AEOI) confirmed that early on Sunday morning, Iran's nuclear sites were \"subjected to savage aggression--an act in violation of international laws, particularly the NPT.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  In a post on X on Sunday, the PIB Fact Check unit labelled the assertion as &quot;FAKE&quot; and clarified, &quot;Indian Airspace was NOT used by the United States during Operation Midnight Hammer.&quot;","url":"https://www.latestly.com/agency-news/world-news-pib-fact-check-debunks-claims-of-us-using-indian-airspace-for-strikes-on-nuke-sites-in-iran-calls-them-fake-6945773.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250622205207.jpg","video":null,"publish_date":"2025-06-23 00:16:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.268},{"id":334123076,"title":"Trump suggests regime change to ‘Make Iran Great Again’ after US 'monumentally strikes Iran","text":"Trump suggests regime change to ‘Make Iran Great Again’ after US 'monumentally strikes IranTrump made the post shortly after writing on his social media platform that \"The damage to the Nuclear sites in Iran is said to be 'monumental.' (illustrative) US President Donald Trump over a satellite image of Iran's Fordow nuclear site.(photo credit: REUTERS/Kent Nishimura, Maxar Technologies/Handout)ByJERUSALEM POST STAFFJUNE 23, 2025 00:31Updated: JUNE 23, 2025 01:32See more onIran|islamic regime|Middle East|Donald Trump|Islamic RepublicRECOMMENDED STORIESTop Gun over Tehran: An IAF fighter pilot shares his journey on the way to IranJUNE 20, 2025US moving B-2 stealth bombers toward Guam, American officials confirmJUNE 21, 2025'Killed in their sleep': Inside Operation Narnia, Israel's strikes on Iran's nuclear scientistsJUNE 20, 2025Cluster bomb fragments spark fear Iran’s missile carried multiple bombsJUNE 19, 2025Hot OpinionIsrael cannot afford to lose focus to win against Iran and secure the hostages' releaseByJPOST EDITORIALFor his Jewish grandchildren and a ‘never again’ vow, Trump shatters Iran’s nuclear core - analysisByZVIKA KLEINNetanyahu bet big and brought the US-Israel alliance to a whole new levelByYAAKOV KATZThe Iranian strategists' failure lies in the Ayatollah's historic blindnessByAMOTZ ASA-EL","summary":"Trump made the post shortly after writing on his social media platform that \"The damage to the Nuclear sites in Iran is said to be 'monumental.'","url":"https://www.jpost.com/middle-east/iran-news/article-858626","image":"https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/669327","video":null,"publish_date":"2025-06-23 00:16:06","author":null,"language":"en","category":"politics","source_country":"il","sentiment":-0.345},{"id":334126124,"title":"Kamala Harris Considers Running in California Governor’s Race","text":"Kamala Harris is leaning toward entering the California gubernatorial race, sources familiar with the former vice president’s thinking tell The Hill.\n\nWhile the sources caution that Harris hasn’t made a final decision yet and is still considering all her options, they say she has made it clear that she is not done with public service and is giving the race strong consideration.\n\nThose who have spoken to Harris about the possibility of entering the race say it has given her a renewed sense of excitement and, as one source put it, “a glimmer in her eyes.”\n\n“She has a lot of people in her ear telling her that it makes the most sense and she can do the most good,” said one source who has spoken to Harris about a potential run. \n\nBut another source close to Harris pushed back on the idea that she is inclined to enter the contest. The source said the topic of the gubernatorial race is dominating many of the conversations she is having simply because of the fast-approaching 2026 match-up. \n\nEither way, the sources say Harris is sticking to a self-imposed end-of-summer deadline in deciding whether to wade into the already-crowded governor’s race, where the contest includes former Los Angeles Mayor Antonio Villaraigosa and former California Attorney General Xavier Becerra, who was also a member of the Biden administration as secretary of Health and Human Services.\n\nThe former vice president is planning to take some time off in July, when sources say she hopes to further reflect on the next step in her political career. \n\nHarris’s office did not comment for this story.\n\nIn recent weeks, Harris has been participating in a string of conversations about the political climate in the state and the issues on the minds of Californians, the sources say. She has been particularly interested in the issues facing younger voters and has been holding lengthy discussions about the future of artificial intelligence (AI). \n\nHarris has kept a relatively low profile in recent months after a devastating loss in the 2024 presidential election a race she thought she could win. While California has been in the headlines for a rash of news events, including the protests over Immigration and Customs Enforcement (ICE) raids in Los Angeles earlier this month and the wildfires that ravaged major swaths of the state in January, the extent of Harris’s public involvement has been posts on social platform X. \n\n“Los Angeles is my home,” Harris wrote in a statement earlier this month on the protests. “And like so many Americans, I am appalled at what we are witnessing on the streets of our city. Deploying the National Guard is a dangerous escalation meant to provoke chaos.” \n\n“In addition to the recent ICE raids in Southern California and across our nation, it is part of the Trump administration’s cruel, calculated agenda to spread panic and division,” she added. \n\nThose close to the former vice president say she has been appalled by the Trump administration’s bold moves, like deploying the National Guard. Harris has told confidants that she feels the president is governing by loyalty and retribution and that such actions will propel her to reenter public service. \n\n“This moment almost requires her to do it,” one source close to Harris said. \n\nAt the same time, if she chooses to enter the race, her confidants know she will have to contend with looming narratives about whether she helped conceal former President Biden’s decline, something Republicans continue to press her on.\n\nEven one of her would-be opponents, Villaraigosa, has made it a talking point.\n\n“Voters deserve to know the truth, what did Kamala Harris and Xavier Becerra know, when did they know it, and most importantly, why didn’t either of them speak out? This cover up directly led to a second Donald Trump term,” Villaraigosa wrote in a post on X last month that took aim at two potential rivals.\n\nAgainst the backdrop of these questions, there’s a thought among some Democrats that a run for governor would be “a consolation prize” with Harris having been close to winning the presidency less than a year ago. Her confidants cringe at that sentiment, and they say Harris brushes off such commentary.\n\nA decision by Harris to run for governor would be significant, political observers say, because it could take a 2028 presidential run off the table. \n\n“I don’t think she could, with a straight face, run for governor in 2026 without making an absolute pledge that she would not run for president in 2028,” said Garry South, a California-based Democratic strategist.\n\nAn Emerson College poll in April revealed that 50 percent of Democratic voters in California would support Harris in a gubernatorial run. A separate survey from Politico/UC Berkeley Citrin Center also released in April revealed that 33 percent of Democratic voters in California would be “joyful” about a Harris bid and 41 percent would be “mostly excited.” \n\nThough those polls show she would be the clear front-runner in the race, some Democrats say they don’t think that’s enough for her to maintain a clear field.\n\n“She would start out, at least initially, as the front-runner. There’s no doubt about it because she has 100 percent name ID in California,” South said. “I think there are real mixed feelings about her among California Democrats, and I think those mixed feelings would grow if she actually got into the race.” \n\n“She doesn’t come into this as an 800-pound gorilla,” he added.\n\nEven as some close to her say she’s leaning toward running, some former aides and longtime observers in the state say they doubt Harris will run for governor because she has been, as one former aide put it, “absent” from the events that have dominated the state. \n\nIn the face of this month’s protests in Los Angeles, for example, Harris was in the Hamptons attending the wedding of Huma Abedin and Alex Soros two big names within Democratic circles. In April, Harris spoke at a gala before hundreds of donors in San Francisco and made no mention of state issues or political affairs. \n\n“She’s the kind of person that if she’s going to do something, she’s very serious about it, focused on it,” said Elizabeth Ashford, a California-based communications adviser who served as Harris’s chief of staff when she was the state’s attorney general. “It just seems to me that this would be a summer of reintroducing herself as a Californian to Californians if that were really front of mind.”\n\nIn the months since she left office, Harris has made most of her public appearances outside of California. \n\nLast month, the former vice president spoke at a closed-room real estate conference in Australia following a surprise Met Gala appearance in New York. She was in Las Vegas for a conference on AI in March and engaged with students at a Maryland community college in December. \n\nHer loss of the presidency in November raises questions for some California Democrats about how she will address the issue they say Democratic voters in the state care most about.\n\n“I think California Democrats right now want somebody who’s going to get in Trump’s face,” said South, the California-based Democratic strategist. “But I’m not sure that someone who just lost pretty badly to Donald Trump can posit themselves as the best counter against Donald Trump if they were to be governor of California.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nKamala Harris is leaning toward entering the California gubernatorial race, sources familiar&#8230;\n\n\nThis Post: Kamala Harris Considers Running in California Governor&#8217;s Race first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/kamala-harris-considers-running-in-california-governors-race/","image":"https://internewscast.com/wp-content/uploads/2025/06/rewrite-this-title-Kamala-Harris-gives-California-governors-race-a.jpg","video":null,"publish_date":"2025-06-23 00:13:32","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.191},{"id":334126110,"title":"Australia Backs US Military Action on Iran Nuclear Sites, Confirms Wong","text":"Support Our Cause\n\nSupport Our Cause\n\n Search for:\n\n HomeNewsAUAustralia Backs US Military Action on Iran Nuclear Sites, Confirms Wong\n\nAustralia Backs US Military Action on Iran Nuclear Sites, Confirms Wong\n\n \n\n Up next \n\n \n\n \n\nKamala Harris Considers Running in California Governor’s Race\n\n Published on 23 June 2025\n\n Internewscast \n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\nForeign Minister Penny Wong has expressed the government’s backing for the United States’ military actions against Iran’s nuclear sites.\n\nIn her statements this morning on Today, Wong indicated that the United States specifically targeted locations pertinent to Iran’s nuclear activities.\n\n“We support action to prevent Iran getting a nuclear weapon,” Wong said.\n\n“We are aware of the UN nuclear watchdog’s reports … indicating that Iran is refining uranium to near-military grade levels … sufficient for producing multiple nuclear arms.”\n\nDonald Trump confirmed the US strikes on Iran on Sunday.(Maxar Technologies)\n\nWong also noted the difficult situation of thousands of Australians who remain stranded in both Israel and Iran, affirming that Australia continues its efforts to assist in their evacuation.\n\n“Obviously, this is a highly risky and precarious situation, and my heart goes out to Australians in Iran and in Israel, and to their friends and families in Australia who are so deeply worried about them,” Wong said.\n\nThe security situation in Israel meant land crossing were not possible, but the government was working on trying to arrange contingency flights, Wong said.\n\n“There are reports … of airspace opening for Israel for a limited period. We are working on contingency arrangements to see if we can get a flight in to collect people, and we have notified people on the ground about that.” \n\nThe situation in Iran was even worse and more serious, Wong said.\n\nWe obviously have had to make the difficult decision to close our embassy,” she said.\n\nThere was a possibility that Australian officials may be able to provide some assistance to Australians who were able to make it to the Azerbaijani border, Wong said.\n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\n You May Also Like \n\n \n\nAU \n\nUS Aims to Avoid Conflict Following Unexpected Attack on Iran, According to Hegseth \n\n US Defence Secretary Pete Hegseth has stated that America “does not seek…\n\nInternewscast\nJune 22, 2025\n\n“‘Cop-out’: Urging Educators to Self-Educate on Australian History” \n\n Aunty Jackie Huggins had a transformative experience in primary school in Brisbane…\n\nInternewscast\nJune 22, 2025\n\n \n\nAU \n\nTrump Announces ‘Remarkable Achievement’ Following US Strikes on Iran \n\n President Donald Trump confirmed the US carried out an attack on Iran…\n\nInternewscast\nJune 22, 2025\n\n \n\nAU \n\n“Devastated or Superficial? The True Condition of Iran’s Nuclear Sites” \n\n Warplanes. Submarines. Cruise missiles. Bombs that weigh more than 13 tons. After…\n\nInternewscast\nJune 22, 2025\n\n \n\nAU \n\nThe Remarkable Crane Designed to Transport Bayesian: Custom-Built Lifter to Gently Relocate £25 Million Superyacht Safely \n\n This is the specially built cradle that will hold the wreck of…\n\nInternewscast\nJune 22, 2025\n\nThe US Strikes Iran’s Nuclear Sites: Events and Consequences Unfolded \n\n President Trump’s decision to strike three key Iranian nuclear facilities has drawn…\n\nInternewscast\nJune 23, 2025\n\n \n\nAU \n\nMissiles Strike Israel Following Iran’s Counterattacks \n\n Israeli officials indicated that over 80 individuals experienced mostly minor injuries, along…\n\nInternewscast\nJune 22, 2025\n\nUnderstanding the Strait of Hormuz: Implications of a Potential Blockade by Iran \n\n Key Points Iran may close Strait of Hormuz after US strikes on…\n\nInternewscast\nJune 22, 2025\n\nThe Group That’s Moving to Los Angeles in Big Numbers \n\n Los Angeles is a sprawling city that has long attracted artists, migrants,…\n\nInternewscast\nJune 22, 2025\n\n \n\nAU \n\n“Iran’s Nuclear Facilities: Are They Truly Destroyed or Just Lightly Damaged?” \n\n Warplanes. Submarines. Cruise missiles. Bombs that weigh more than 13 tons. After…\n\nInternewscast\nJune 22, 2025\n\n \n\nAU \n\nIran Confirms U.S. Attacks on Three Nuclear Facilities \n\n In the early hours of Sunday, Iran’s state-run news agency, IRNA, referenced…\n\nInternewscast\nJune 22, 2025\n\n \n\nAU \n\nTrump’s Actions on Iran Might Face Increased Backlash from MAGA’s Anti-Interventionists \n\n Interestingly, right after Trump’s Saturday announcement of the strike, even some former…\n\nInternewscast\nJune 22, 2025\n\nTrump’s $400 Million Impact on Australia’s International Strategy: ‘Projects Are Unraveling’ \n\n The reduction in foreign aid by the Trump administration has led to… \n\nInternewscast\nJune 23, 2025 \n\n \n\nThe Collapse of Operation ‘Midnight Hammer’: A Mission Founded on Deception \n\n The ‘Invisible Defenders’ rolled from aircraft hangers into the muggy Missouri air… \n\nInternewscast\nJune 23, 2025 \n\n \n\nLocal news \n\nDetermined Mahmoud Khalil Commits to Advancing the Palestinian Agenda \n\n () A defiant Mahmoud Khalil told supporters Sunday that his time in… \n\nInternewscast\nJune 23, 2025 \n\n \n\nLocal news \n\nStorm Team 3: Potential Fog on Monday Morning; Expect a Hot Week \n\n The heat is about to lock in for the new week. First,… \n\nInternewscast\nJune 23, 2025 \n\n \n\n \nInternewscast Journal\n\nPrivacy Policy\n\nDMCA Notice\n\nTerms and Conditions\n\nSupport Our Cause\n\n \n\n Copyright 2023. All Right Reserverd.","summary":"Internewscast Journal\n\nInternewscast\n\n\nForeign Minister Penny Wong has expressed the government&#8217;s backing for the United&#8230;\n\n\nThis Post: Australia Backs US Military Action on Iran Nuclear Sites, Confirms Wong first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/australia-backs-us-military-action-on-iran-nuclear-sites-confirms-wong/","image":"https://internewscast.com/wp-content/uploads/2025/06/Australia-supports-US-strikes-on-Iran-nuclear-sites-Wong-says.jpg","video":null,"publish_date":"2025-06-23 00:11:37","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.118},{"id":334125988,"title":"5 Timely Ideas To Improve Medicare Advantage","text":"WASHINGTON, DC - MARCH 14: Dr. Mehmet Oz, arrives for his confirmation hearing with the Senate ... More Finance Committee in the Dirksen Senate Office Building on March 14, 2025 in Washington, DC. Oz is U.S. President Donald Trump’s nominee to be administrator of the Centers for Medicare and Medicaid Services. (Photo by Anna Moneymaker/Getty Images)\nGetty Images\n\nIn April, Dr. Mehmet Oz became Administrator of the Centers for Medicare & Medicaid Services (CMS). While his appointment generated a buzz, it is the work ahead that truly matters, especially when it comes to Medicare Advantage (MA), the program that provides care to about 33 million people, or 54 percent of the Medicare population.\n\nThough MA is poised to provide the best outcomes for the most Americans, the program is also ripe for reform, and there are several critical areas Oz could focus on to drive meaningful improvement.\n\nHere are five:\n\n1. Pilot Multiyear Enrollment in Plans. MA plans looking to make investments in prevention and effective treatment face a conundrum: people under our care drop out of our plans on an annual basis. One way to fix this is to move away from annual enrollment and create options for people to enroll in plans for several years at a time. Dr. Oz has called for “shifting the paradigm for health care from a system that focuses on sick care to one that fosters prevention, wellness, and chronic disease management.” Multiyear enrollment would provide the necessary incentives to achieve this worthy goal because you can’t really invest in improving health in 1-year increments.\n\n2. Standardize Plan Benefits. Plans should be competing based on excellence and their proven abilities to drive outcomes, not edge benefits and giveaways like cash rebates. By adopting standardized plan benefits and requiring them to address genuine health needs, CMS could ensure that when consumers choose plans on the basis of plan quality and health outcomes—which should be the most important metric in their decision-making process.\n\n3. Reform Broker Commissions. Lately, there’s been a lot of talk about reforming the way MA brokers are compensated. Last year, CMS issued a rule capping broker compensation, but that rule was blocked by a judge before it took effect. And recently, the Department of Justice alleged in a lawsuit that insurers were paying kickbacks to brokers in return for steering beneficiaries toward their plans.\n\nMORE FOR YOU\n\nAmid these developments, we too rarely discuss ways to encourage brokers to steer people toward higher-quality plans. It’s time to align broker commissions with plan ratings. Under this approach, a broker who enrolls a client in a higher-rated plan would receive a larger commission than one who steers a client toward a lower-rated plan. CMS estimates that last year almost 38% of MA enrollment was in plans with fewer than four stars. We owe it to plan members to create a system that provides their brokers with every incentive to help them choose plans of the highest quality.\n\n4. Reform the Broker Industry to Focus More on Clinical Support. While we’refocusing on brokers, let’s also provide them with incentives to use their expertise more expansively to improve health. I’ve spoken to brokers who help clients find care and navigate medical bureaucracies, locate the best prices on medications, and even connect them with life-saving social services.\n\nBrokers earn renewal fees when their clients sign up annually for MA plans. Those renewal fees should be earned by annually providing clients with care navigation and other health services that drive positive clinical outcomes. Brokers who don’t offer such services should receive reduced renewal fees—or maybe not continue to serve seniors at all. Either way, it’s worth noting how many outstanding brokers already do this work and are among the most trusted members of their communities—exactly the kind of behaviors that should be rewarded.\n\n5. Incentivize Integration Between Health Plans and Provider Organizations. There’s a lot of friction in our healthcare system, especially between health plans and provider organizations. Plans allege providers drive up costs with unnecessary procedures, tests and prescription medications; providers say plans are inflexible and stand in the way of appropriate patient care.\n\nIt’s beyond time to change the dynamic between these two groups. Many have already discovered that the best way to do this is to enter into global capitation arrangements by which providers receive a fee to manage all of a plan member’s healthcare expenses. The benefit of these arrangements is that they encourage each group to focus on what they do best: payers manage risk while providers make decisions about direct care. The best of these arrangements are true partnerships in which payers and providers transparently design products together that play to both groups’ strengths with an orientation toward improving outcomes. Going forward, it would be in patients’ interests for CMS to offer a standardized framework for payers and providers to collaborate in this way.\n\nThe appointment of a new CMS Administrator presents a unique opportunity to enact substantial and lasting changes. That’s certainly the case with Dr. Mehmet Oz. By focusing on these five key areas, he can help unleash the full potential of Medicare Advantage, benefiting older adults across the country.\n\nEditorial StandardsReprints & Permissions","summary":"Medicare Advantage is due for a refresh.  The column describes five timely ideas to improve the administration of the program.","url":"https://www.forbes.com/sites/sachinjain/2025/06/22/5-timely-ideas-to-improve-medicare-advantage/","image":"https://imageio.forbes.com/specials-images/imageserve/6838b9b60ab479715b70a4fc/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-23 00:09:13","author":"Anna Moneymaker,Contributor,Sachin H. Jain","authors":["Anna Moneymaker","Contributor","Sachin H. Jain"],"language":"en","source_country":"US","sentiment":0.103},{"id":334124284,"title":"Judge orders Kilmar Abrego Garcia’s release from jail before trial, but ICE plans to detain him","text":"A Tennessee judge on Sunday ordered the release of Kilmar Abrego Garcia, whose mistaken deportation has become a flashpoint in President Donald Trump’s immigration crackdown, while he awaits a federal trial on human smuggling charges. But he is not expected to be allowed to go free. \n\nAt his June 13 detention hearing, prosecutors said U.S. Immigration and Customs Enforcement would take Abrego Garcia into custody if he were released on the criminal charges, and he could be deported before he has a chance to stand trial. \n\nU.S. Magistrate Judge Barbara Holmes has scheduled a hearing for Wednesday to discuss the conditions of Abrego Garcia's release. The U.S. government has already filed a motion to appeal the judge’s release order.\n\nHolmes acknowledged in her ruling Sunday that determining whether Abrego Garcia should be released is “little more than an academic exercise” because ICE will likely detain him. But the judge wrote that everyone is entitled to the presumption of innocence and “a full and fair determination of whether he must remain in federal custody pending trial.”\n\nHolmes wrote that the government failed to prove that Abrego was a flight risk, that he posed a danger to the community or that he would interfere with proceedings if released.\n\n“Overall, the Court cannot find from the evidence presented that Abrego’s release clearly and convincingly poses an irremediable danger to other persons or to the community,” the judge wrote. \n\nAbrego Garcia has pleaded not guilty to the smuggling charges that his attorneys have characterized as an attempt to justify the deportation mistake after the fact.\n\nThe acting U.S. attorney for the Middle District of Tennessee, Rob McGuire, argued on June 13 that the likely attempt by ICE to try to deport him was one reason to keep him in jail.\n\nBut Holmes said then that she had no intention of “getting in the middle of any ICE hold.”\n\n“If I elect to release Mr. Abrego, I will impose conditions of release, and the U.S. Marshal will release him.” If he is released into ICE custody, that is “above my pay grade,” she said.\n\nThe judge suggested that the Department of Justice and the Department of Homeland Security could work out between themselves whether the government’s priority is to try him on the criminal charges or deport him. No date has been set for the trial.\n\nWill Allensworth, an assistant federal public defender representing Abrego Garcia at the detention hearing, told Holmes that “it’s not necessarily accurate that he would be immediately deported.”\n\nA 2019 immigration judge’s order prevents Abrego Garcia, who had been living in Maryland, from being deported to his home country of El Salvador, Allensworth said in court. That’s because he faces a credible threat from gangs there, according to court papers. \n\nThe government could deport him to a third country, but immigration officials would first be required to show that third country was willing to keep him and not simply deport him back to El Salvador, Allensworth said.\n\nThe smuggling charges stem from a 2022 traffic stop for speeding in Tennessee during which Abrego Garcia was driving a vehicle with nine passengers. Although officers suspected possible smuggling, he was allowed to go on his way with only a warning. He has pleaded not guilty. \n\nAt the detention hearing, McGuire said cooperating witnesses have accused Abrego Garcia of trafficking drugs and firearms and of abusing the women he transported, among other claims. Although he is not charged with such crimes, McGuire said they showed Abrego Garcia to be a dangerous person who should remain in jail pretrial.\n\nAbrego Garcia’s attorneys have characterized the smuggling case as a desperate attempt to justify the mistaken deportation. The investigation was launched weeks after the U.S. government deported Abrego Garcia and the Supreme Court ordered the administration to facilitate his return amid mounting public pressure. \n\nThe U.S. is now expected to try to deport him again with much of the world watching and the outcome hard to predict. \n\nMost people in ICE custody who are facing criminal charges are not kept in the U.S. for trial but deported, Ohio State University law professor César Cuauhtémoc García Hernández said.\n\nThe U.S. will likely try to deport Abrego Garcia quickly without going before an immigration judge, the professor said. The government would not need a conviction to deport him because Abrego Garcia came to the U.S. illegally.\n\n“The legal standard is laxer,” García Hernández said. “The government’s argument is on stronger legal footing.”\n\nHowever an immigration judge rules, the decision can be appealed to the Board of Immigration Appeals, García Hernández said. And the board’s ruling can then be contested in a federal appeals court.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"A Tennessee judge on Sunday ordered the release of Kilmar Abrego Garcia, whose mistaken deportation has become a flashpoint in President Donald Trump’s immigration crackdown, while he awaits…","url":"https://japantoday.com/category/world/judge-orders-kilmar-abrego-garcia%E2%80%99s-release-from-jail-before-trial-but-ice-plans-to-detain-him","image":"https://media.japantoday.com/img/store/45/be/dd5f8b9c7e548bb9aae738c1a44781a567ca/download/_w1700.jpeg","video":null,"publish_date":"2025-06-23 00:07:36","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.397},{"id":334122370,"title":"UNSC to meet on Iran as Pakistan, Russia and China push for a ceasefire","text":"UNITED NATIONS: The UN Security Council will meet Sunday to discuss US strikes on Iran’s nuclear sites as Russia, China and Pakistan proposed the 15-member body adopt a resolution calling for an immediate and unconditional ceasefire in the Middle East. \n\nIt was not immediately clear when it could be put to a vote. The three countries circulated the draft text, said diplomats, and asked members to share their comments by Monday evening. A resolution needs at least nine votes in favor and no vetoes by the United States, France, Britain, Russia or China to pass. \n\nThe US is likely to oppose the draft resolution, seen by Reuters, which also condemns attacks on Iran’s nuclear sites and facilities. The text does not name the United States or Israel. \n\nThe world awaited Iran’s response on Sunday after President Donald Trump said the US had “obliterated” Tehran’s key nuclear sites, joining Israel in the biggest Western military action against the Islamic Republic since its 1979 revolution. \n\nIran requested the UN Security Council meeting, calling on the 15-member body “to address this blatant and unlawful act of aggression, to condemn it in the strongest possible terms.” \n\nIsrael’s UN Ambassador Danny Danon said in a statement on Sunday that the US and Israel “do not deserve any condemnation, but rather an expression of appreciation and gratitude for making the world a safer place.” \n\nUN Secretary-General Antonio Guterres on Saturday branded the US strikes on Iran as a “dangerous escalation in a region already on the edge – and a direct threat to international peace and security.” \n\n“At this perilous hour, it is critical to avoid a spiral of chaos. There is no military solution. The only path forward is diplomacy. The only hope is peace,” Guterres said in a statement.","summary":"UNITED NATIONS: The UN Security Council will meet Sunday to discuss US strikes on Iran’s nuclear sites as Russia, China and Pakistan proposed the 15-member body adopt a resolution calling for an immediate and unconditional ceasefire in the Middle East. \n\n\n\nIt was not immediately clear when it could be put to a vote. The three countries circulated the draft text, said diplomats, and asked members to share their comments by Monday evening. A resolution needs at least nine votes in favor and no vetoes by the United States, France, Britain, Russia or China to pass. \n\n\n\nThe US is likely to oppose the draft resolution, seen by Reuters, which also condemns attacks on Iran’s nuclear sites and facilities. The text does not name the United States or Israel. \n\n\n\nThe world awaited Iran’s response on Sunday after President Donald Trump said the US had “obliterated” Tehran’s key nuclear sites, joining Israel in the biggest Western military action against the Islamic Republic since its 1979 revolution. \n\n\n\nIran requested th","url":"https://www.brecorder.com/news/40369131/unsc-to-meet-on-iran-as-pakistan-russia-and-china-push-for-a-ceasefire","image":"https://i.brecorder.com/large/2025/06/68589a358f736.jpg","video":null,"publish_date":"2025-06-23 00:05:35","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.309},{"id":334123102,"title":"Pope Leo condemns Trump's bombing in Iran, warns of 'irreparable abyss'","text":"Pope Leo XIV has passionately called for peace in his Sunday Angelus prayer at St. Peter's Square, urging for global diplomatic efforts. On Saturday June 21, Trump gave the green light for U.S. forces to launch strikes on Iran's key nuclear sites , in sync with an Israeli offensive. This move marks a serious uptick in Middle East tensions , with Iran vowing to defend its turf. \"Every member of the international community has a moral responsibility: to stop the tragedy of war before it becomes an irreparable abyss,\" Pope Leo declared during his weekly address to the faithful in the Piazza San Pietro. After recognising the dire circumstances, the first American pope stressed that \"now, more than ever, humanity calls out for peace, a plea that requires rational attention and should not be silenced. \"No armed victory can compensate for the pain of mothers, the fear of children, the stolen future. Let diplomacy silence the weapons, let nations chart their future with peace efforts, not with violence and bloody conflict.\" Pope Leo didn't shy away from highlighting the ongoing strife between Israel and Palestine. \"In this dramatic scenario, which includes Israel and Palestine, the daily suffering of the population, especially in Gaza and other territories, risks being forgotten, where the need for adequate humanitarian support is becoming increasingly urgent,\" he pointed out. In Iran, there's a growing fear that escalating tensions could plunge the country into an even deadlier and more chaotic conflict in the region, after over a week of hostilities with Israel. Iranian Foreign Minister Abbas Araghchi slammed the United States on Sunday, saying it \"opted for a dangerous military operation and aggression against the people of Iran,\" and he also ominously cautioned of \"everlasting consequences.\" At a quick-fire press briefing last night, Trump gave a shout-out to the armed forces and made a pointed nod to the Almighty following the U.S. mission's wrap-up. \"And I want to just thank everybody, and in particular, God. I want to just say we love you, God, and we love our great military. Protect them,\" Trump declared. Before becoming pope, Leo didn't hold back on his views about Donald Trump , often slinging critical tweets at the former US president and Vice President JD Vance on X in recent times. The Vatican has not verified whether the pope owned the X account, which was under the handle @drprevost and was deactivated following his election. The departed Pope Francis, who held the papacy for 12 years, blasted the president's mass deportation plan as a travesty. He had previously argued that Trump's hardline immigration policies meant he couldn't be counted among Christians. \"A person who thinks only about building walls, wherever they may be, and not building bridges, is not Christian,\" he commented when asked about Trump in 2016. For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletter by clicking here .","summary":"Pope Leo XIV warned of an &quot;irreparable abyss&quot; as US forces continue to bomb Iran after President Donald Trump made the decision to attack the Middle Eastern nation's key nuclear sites","url":"https://www.dailystar.co.uk/news/latest-news/pope-leo-condemns-trumps-bombing-35435231","image":"https://i2-prod.dailystar.co.uk/article35245618.ece/ALTERNATES/s1200b/4_Pope-Leo-XIV.jpg","video":null,"publish_date":"2025-06-23 00:05:13","author":"Alexandra Snow","authors":["Alexandra Snow"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.098},{"id":334125202,"title":"Michigan Student Arrested By ICE While On School Trip Deported","text":"Maykol Bogoya Duarte, an 18-year-old former Detroit high school student who was arrested by Border Patrol agents whilst on his way to a field trip on May 20, has been deported back to his native Columbia according to Department of Homeland Security (DHS) records seen by the Detroit Free Press. Newsweek reached out to DHS via email on Sunday for comment.Why It MattersPresident Donald Trump's administration has made cracking down on illegal immigration one of its top policy priorities, with U.S. Immigration and Customs Enforcement (ICE) personnel carrying out an intensified series of raids across the United States.Beginning on June 6 several days of largescale anti-ICE demonstrations took place in Los Angeles, some of which turned violent. In response the Trump administration deployed 4,000 California National Guard troops and 700 Marines, against the wishes of California Governor Gavin Newsom.What To KnowThe Detroit Free Press reported that DHS records indicate Duarte was deported back to Columbia on June 19.On May 20, whilst on the way to a high school trip to Lake Erie Metropark, Duarte was pulled over by local police officers who said he was tailgating an unmarked police vehicle. Due to language barriers the police called Border Patrol agents who took Duarte into custody after checking his immigration status.At the time of his detention, Duarte was a student at Detroit's Western International High School and only three and a half credits away from graduation. Detroit House Democrats Shri Thanedar and Rashida Tlaib both asked for Duarte to be allowed to stay in the U.S. until he graduated, but this request was turned back by ICE on June 11.Records from ICE's Executive Office for Immigration Review show Duarte and his mother applied for asylum on January 29, 2024; after entering the U.S. saying they were trying to escape violence in Columbia.Duarte was refused asylum, and his appeal was rejected on June 25, 2024, at which point \"he was in the country illegally, having ignored a judge's removal order and lost his appeal\" according to a spokesperson for Customs and Border Protection.What People Are SayingSpeaking to the Detroit Free Press Duarte's attorney Ruby Robinson said: \"We're concerned that for anybody who contacts the police or are interacting with police — whether somebody suspected of committing a crime or whether it's a victim coming forward — if local law enforcement is going to rely on federal officials to do interpreting, that's going to have a chilling effect on people trusting law enforcement.\"Western International High School teacher Kristen Schoettle said: \"The police did not have to call Border Patrol, but they did.\"Speaking earlier this year to NPR Tricia McLaughlin, assistant secretary for public affairs at the Department of Homeland Security, said: \"We know that our ICE agents across the country are following proper protocol and proper procedures, and we are working every day to make ourselves excellent for the American people.\"What Happens NextTrump's crackdown on suspected illegal migrants is likely to continue with more ICE raids taking place across the country. There could be further tensions with Democratic governors who object to federal government policy.","summary":"President Trump has overseen a crackdown on illegal immigration across the United States.","url":"https://www.newsweek.com/michigan-student-arrested-ice-while-school-trip-deported-2089104","image":"https://d.newsweek.com/en/full/2668634/ice.jpg","video":null,"publish_date":"2025-06-23 00:05:07","author":"James Bickerton","authors":["James Bickerton"],"language":"en","source_country":"US","sentiment":-0.164},{"id":334124254,"title":"Planning around global tensions","text":"For import-dependent Pakistan, already grappling with its worst crisis in recent history, another conflict in the neighbourhood is deeply alarming. Outside the Middle East, Pakistan may be among the countries hardest hit by the ongoing Iran-Israel war, facing significant economic and social repercussions.\n\nAny widening of the conflict would multiply Pakistan’s economic and diplomatic challenges many times over. An indirect reassurance, late last week, from President Donald Trump, promising not to directly target Iran for the next two weeks, has sparked hopes that a ceasefire and a peace deal, possibly brokered by concerned partners, may still be within reach. \n\nThe timing of the war, breaking out just as Pakistan was finalising its budget, has compounded challenges. It diverted focus from pressing domestic issues and disrupted key assumptions underlying the budget proposals, rendering several key projections unrealistic. \n\nOn query if the government is considering redrafting the budget, Khurram Schehzad, a member of Prime Minister Shehbaz’s economic team was categorical, “although temporary disruptions may affect localised informal trade, inflation and investor confidence remain stable, and budget planning is anchored in prudence, with built-in buffers to absorb external shocks. Flexibility will be maintained, but there is no immediate need to revise projections unless global conditions deteriorate significantly.” \n\n The Iran-Israel conflict may drive up oil prices and shipping costs, factors that budget makers had assumed would remain stable or decline\n\nThe conflict is likely to drive up oil prices and shipping costs, factors that budget makers had assumed would remain stable or decline. The extent of the impact will depend on how prices move, but analysts agree that a prolonged conflict would almost certainly lead to significant increases. \n\nThis would derail inflation targets, revive fiscal and current account pressures, strain foreign exchange reserves and weaken the rupee. It could also force the government to revisit or roll back revenue measures such as higher petroleum development levy and the proposed carbon tax. \n\nHigher import costs and expensive oil will raise the government’s subsidy burden and push up commodity prices for consumers, not only due to pricier imported goods but also because local products often rely heavily on imported inputs. In this scenario, inflation, which has fallen from historic highs of 38 per cent in May 2023 to just 3.5pc by May 2025, is likely to surge again. \n\nThis will also disrupt the downward trend in interest rates that have gradually been lowered from 22pc in June 2023 to 11pc by May 2025 by the State Bank of Pakistan (SBP), but market expectations for further reductions were dashed when, following the Iran-Israel conflict, the SBP opted to steady rates in its monetary policy announcement last Monday.\n\nThe investment rate is unlikely to pick up, further undermining GDP growth projections that were already considered ambitious even before the war. As private investors grow more cautious and the government’s capacity to invest is constrained by likely cuts to the development budget to meet the IMF’s stabilisation conditions, any meaningful increase in growth seems improbable. \n\nRising risk perceptions, global uncertainty, high borrowing costs and fears of additional direct taxes to offset the reversal of indirect revenue measures will further dampen investor confidence, already fragile to begin with. \n\nCommenting on the situation, Dr Manzoor Ahmed, a trade expert and former Pakistan World Trade Organisation representative, said: “The immediate impact is a sharp rise in global oil prices, up nearly 7pc since hostilities began. For Pakistan, where imported energy accounts for 30pc of total imports, this is deeply concerning. Past crises, such as the 2008 Iraq war and 2022 Russia-Ukraine conflict, saw oil prices soar above $120 to $145 per barrel, triggering severe inflation, balance of payment crises and political upheaval, even toppling governments.”\n\nHe added, “If Iran closes the Strait of Hormuz, which handles a fifth of global oil trade, it would disrupt supply chains, spike freight and insurance costs, risk pushing major economies into recession. Such shocks would hit Pakistan’s exports and derail any fragile progress towards economic stability and growth.”\n\nMr Schehzad responded to queries by saying, “While regional tensions warrant close monitoring, it’s important not to overstate their immediate economic impact on Pakistan.” He explained that the government is actively tracking developments and devising a strategy via a dedicated team and the situation remains manageable for now. \n\nYounus Dagha, former federal secretary and Sindh minister and current Chairman of the Policy Research Advisory Council (PRAC), noted: “Wars and natural disasters can’t be fully accounted for during budget planning; provisions are made as events unfold. It’s impossible to predict whether the Iran-Israel conflict will end quickly or drag on for months. While PRAC has already questioned the growth and revenue targets in the 2025–26 budget, it remains too early to gauge how this crisis on our western border will affect the economy.”\n\nSharing a detailed note responding to queries, Ehsan Malik, CEO of the Pakistan Business Council, articulated the opinion of the business elite. “Middle East tensions are pushing up fuel costs and threatening supply through the Strait of Hormuz, which carries 15pc of global oil and 20pc of gas. The region supplies half the world’s energy. Brent crude has climbed to a five-month high at $77.2 per barrel. \n\n“For Pakistan, which spends about $20 billion on oil and gas [a third of imports], a 7–10pc price hike could strain the external account by $1.5–2bn and weaken the rupee, especially against the euro. Higher fuel costs will fuel inflation, but fiscal space is too tight to lower the Petroleum Development Levy. There’s no need to delay the budget; any adjustments can be made through mini-budgets if needed,” his note stated in essence.\n\nAn additional dimension with far-reaching implications for Pakistan’s politics and economy is the impact on the restive and underdeveloped province of Balochistan, which hosts some of the country’s largest China-Pakistan Economic Corridor infrastructure projects and rich mineral deposits, including the gold and copper reserves at Reko Diq. \n\nThe ongoing conflict risks further destabilising the region, whose economy, lacking significant industry or agriculture, depends heavily on cross-border informal trade for livelihood. In response to security concerns, Pakistan has already tightened controls on the Afghanistan border and, following the Israel attack, sealed the key entry and exit points along its 560 miles border with Iran. \n\nBalochistan shares a 724-miles border with Afghanistan. The halt in informal trade with Iran has been felt nationwide, as Iran is a relatively affordable source for products like toiletries, cigarettes, confectionaries, chocolates, snacks, powdered milk, woollens, plastic goods and petroleum products. \n\nMajyd Aziz, former president of the Karachi Chamber of Commerce and Industry remarked, “Lessons must be learned from Yemen’s recent Suez Canal blockade — Pakistan typically holds only three weeks of oil reserves. Another risk is a potential influx of Iranian refugees into Balochistan, echoing the lasting challenges Pakistan faced with millions of Afghan refugees. Furthermore, disruptions in sea routes could hamper exports, triggering factory closures if shipping lines reroute vessels.\n\n“Challenging days lie ahead for the country and its people, so the government must proactively develop contingency plans rather than rely on ad hoc or stopgap measures to tackle the looming crises,” he ended.\n\nPublished in Dawn, The Business and Finance Weekly, June 23rd, 2025","summary":"For import-dependent Pakistan, already grappling with its worst crisis in recent history, another conflict in the neighbourhood is deeply alarming. Outside the Middle East, Pakistan may be among the countries hardest hit by the ongoing Iran-Israel war, facing significant economic and social repercussions.\n\n\n\nAny widening of the conflict would multiply Pakistan’s economic and diplomatic challenges many times over. An indirect reassurance, late last week, from President Donald Trump, promising not to directly target Iran for the next two weeks, has sparked hopes that a ceasefire and a peace deal, possibly brokered by concerned partners, may still be within reach.   \n\n\n\nThe timing of the war, breaking out just as Pakistan was finalising its budget, has compounded challenges. It diverted focus from pressing domestic issues and disrupted key assumptions underlying the budget proposals, rendering several key projections unrealistic. \n\n\n\nOn query if the government is considering redrafting the budget, Khurram Schehz","url":"https://www.dawn.com/news/1918792/planning-around-global-tensions","image":"https://i.dawn.com/large/2025/06/68574466cfb43.jpg","video":null,"publish_date":"2025-06-23 00:04:32","author":"Afshan Subohi","authors":["Afshan Subohi"],"language":"en","source_country":"pk","sentiment":-0.209},{"id":334124256,"title":"PTI wants all-parties moot  to frame policy on Israel","text":"ISLAMABAD: The Pakistan Tehreek-i-Insaf (PTI) on Sunday vehemently denounced the US strikes on Iran’s key nuclear facilities and urged the government to immediately convene an all-parties conference (APC) to thoroughly discuss the rapidly deteriorating regional situation and formulate a consensus-based, clear-cut policy on belligerent Israel which is pushing the entire region to the brink of a devastating war.\n\nPTI Central Information Secretary Sheikh Waqqas Akram, in a sharply-worded statement issued on Sunday, expressed alarm that the regional situation was fast changing and the government’s approach could prove disastrous.\n\nHe said the government’s current policy of burying heads in the sand, hoping the storm will pass is futile, as flames of war have already reached Pakistan’s doorstep.\n\nMr Akram underlined that Pakistan can undoubtedly weather the storm, just as it did against India, but the ruling elite must take the nation into confidence and forge a consensus-driven approach because Pakistan is currently caught between a rock and a hard place.\n\n Flames of war have reached Pakistan’s doorstep, says PTI leader Sheikh Waqqas\n\nIn the light of the escalating crisis, the PTI leader demanded immediate release of PTI leader Imran Khan and his inclusion in the strategic decision-making regarding the situation arising from the Israel’s unprovoked attack on Iran and the subsequent Washington strikes on Tehran’s nuclear sites.\n\nMr Akram praised the jailed PTI leader’s foresight, noting that a week earlier, he had sent a message through his sisters to postpone the protest for two weeks due to the Iran-Israel conflict. \n\nHe also criticised the US president’s deceptive policy towards Iran and said the US President Donald Trump recently claimed the US would not be involved in the Iran-Israel war for the next two weeks, but the US launched the attack within a couple of days later and the US president himself announced the attack.\n\nMr Akram said the jailed PTI leader Khan’s famous quote, “No one understands the West better than me” has proved to be true.\n\nThe PTI leader said that the US has not only violated Iran’s sovereignty, but it has also breached the UN Charter — an act that may have far-reaching and catastrophic consequences at both regional and international levels.\n\nHe said the excuse for the Israeli attack on Iran was even more absurd than India’s recent strike on Pakistan under the pretext of the Pahalgam attack. He said the US and the International Atomic Energy Agency (IAEA) have adopted a blatantly contradictory and biased approach towards the Muslim world as far as the nuclear issue is concerned as they have been conspicuously silent about Israel’s widely acknowledged nuclear arsenal.\n\nHe said the UN and OIC must demand the IAEA to inspect Israel’s nuclear sites and it must work towards a nuclear-free Middle East. Mr Waqas said that Iran has consistently maintained that its nuclear programme is intended solely for peaceful purposes.\n\nPublished in Dawn, June 23rd, 2025","summary":"ISLAMABAD: The Pakistan Tehreek-i-Insaf (PTI) on Sunday vehemently denounced the US strikes on Iran’s key nuclear facilities and urged the government to immediately convene an all-parties conference (APC) to thoroughly discuss the rapidly deteriorating regional situation and formulate a consensus-based, clear-cut policy on belligerent Israel which is pushing the entire region to the brink of a devastating war.\n\n\n\nPTI Central Information Secretary Sheikh Waqqas Akram, in a sharply-worded statement issued on Sunday, expressed alarm that the regional situation was fast changing and the government’s approach could prove disastrous.\n\n\n\nHe said the government’s current policy of burying heads in the sand, hoping the storm will pass is futile, as flames of war have already reached Pakistan’s doorstep.\n\n\n\nMr Akram underlined that Pakistan can undoubtedly weather the storm, just as it did against India, but the ruling elite must take the nation into confidence and forge a consensus-driven approach because Pakistan is ","url":"https://www.dawn.com/news/1919229/pti-wants-all-parties-moot-to-frame-policy-on-israel","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-06-23 00:04:24","author":"Ikram Junaidi","authors":["Ikram Junaidi"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.304},{"id":334124236,"title":"Politicos want govt to take back Trump Nobel nomination","text":"JUI-F chief questions US president’s peace credentials\n• Mushahid says Trump ‘unleashed an illegal war’ \n\nISLAMABAD: Raising concerns over the government’s decision to recommend US President Donald Trump for Nobel Peace Prize, JUI-F chief Maulana Fazlur Rehman on Sunday demanded the decision be withdrawn, Dawn.com reported.\n\nThe demand came a day after the government said it has decided to formally recommend President Donald J. Trump for the 2026 Nobel Peace Prize, in recognition of his decisive diplomatic intervention and pivotal leadership during the recent India-Pakistan crisis.\n\n“President Trump’s claim of peace has proven to be false, the proposal for the Nobel Prize should be withdrawn,” the JUI-F chief told workers at a party meeting in Murree, according to the party’s statement. \n\nHe said that Trump’s recent meeting and lunch with Chief of Army Staff (COAS) Field Marshal Asim Munir “pleased Pakistani rulers so much” that they recommended nominating the US president for the Nobel prize.\n\n“With the blood of Afghans and Palestinians on America’s hands, how can he claim to be a proponent of peace?” the JUI-F chief asked.\n\nHe said President Trump won the presidential election with the slogan of peace but was “proven false in his claim”.\n\nThe JUI-F chief further said US president has supported the Israeli attacks on Palestine, Syria, Lebanon, and Iran. So how can this be a sign of peace?\n\nHe claimed that when Pakistan destroyed India’s defense force, Trump intervened and said, “I have declared a ceasefire.” \n\nHe said his party is in favour of friendship with the US but not of its slavery. \n\n“National sovereignty, the right of the people to govern themselves, and economic freedom should be maintained in relations with America,” he asserted and pointed out that in the last three months, the US delegation had visited him thrice, after which he attended their diplomatic ceremony in Islamabad. \n\nHe was of the view that the attack on Iran is an attempt to stop China’s economic growth as Beijing is the largest importer of Iranian oil.\n\n‘No longer a potential peacemaker’\n\nMeanwhile, former senator Mushahid Hussain wrote on X: “Since Trump is no longer a potential peacemaker, but a leader who has willfully unleashed an illegal war, [the] Pakistan government must now review, rescind and revoke his Nobel nomination!”\n\nHe said Trump had been “trapped by Netanyahu and Israeli war lobby, committing [the] biggest blunder of his presidency”.\n\n“Trump will now end up presiding over [the] decline of America!”\n\nMr Hussain, former chairman of the Senate Standing Committee on Defence, had previously said that if the nomination “panders to Trump’s ego, so be it”.\n\nPTI MNA Ali Muhammad Khan wrote “RECONSIDER” on his X account, highlighting the “US attack on Iran and continuous US support of Israeli killings in Gaza”.\n\nIn a separate post, the opposition PTI condemned the “unprovoked” US strikes and voiced “total support” for Iran’s sovereignty.\n\nFormer senator Afrasiab Khattak said, “The sycophancy adopted by [the] Pakistani ruling elite in nominating President Trump for Nobel Peace Prize is not part of normative conduct in international diplomacy.”\n\nMaleeha Lodhi, Pakistan’s former ambassador to the US, has termed the move “unfortunate” and said it did not reflect the public’s views. \n\nPublished in Dawn, June 23rd, 2025","summary":"• JUI-F chief questions US president’s peace credentials\n\n• Mushahid says Trump ‘unleashed an illegal war’                 \n\n\n\nISLAMABAD: Raising concerns over the government’s decision to recommend US President Donald Trump for Nobel Peace Prize, JUI-F chief Maulana Fazlur Rehman on Sunday demanded the decision be withdrawn, Dawn.com reported.\n\n\n\nThe demand came a day after the government said it has decided to formally recommend President Donald J. Trump for the 2026 Nobel Peace Prize, in recognition of his decisive diplomatic intervention and pivotal leadership during the recent India-Pakistan crisis.\n\n\n\n“President Trump’s claim of peace has proven to be false, the proposal for the Nobel Prize should be withdrawn,” the JUI-F chief told workers at a party meeting in Murree, according to the party’s statement. \n\n\n\nHe said that Trump’s recent meeting and lunch with Chief of Army Staff (COAS) Field Marshal Asim Munir “pleased Pakistani rulers so much” that they recommended nominating the US president for the N","url":"https://www.dawn.com/news/1919230/politicos-want-govt-to-take-back-trump-nobel-nomination","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-06-23 00:04:24","author":"Dawn Report","authors":["Dawn Report"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.26},{"id":334126116,"title":"Trump Commits to Visiting Kentucky to Oppose Rep. Thomas Massie in Campaign Efforts","text":"President Donald Trump blasted Rep. Thomas Massie (R-KY) Sunday after the libertarian-leaning Congressman partnered with Democrats to oppose Trump’s strike on Saturday eliminating Iran’s nuclear capabilities.\n\nTrump harshly criticized Massie and promised to personally campaign against him in the Republican primary.\n\n“Congressman Thomas Massie of Kentucky is not MAGA, even though he likes to say he is,” Trump posted on Truth Social. “Actually, MAGA doesn’t want him, doesn’t know him, and doesn’t respect him. He is a negative force who almost always Votes ‘NO,’ no matter how good something may be.”\n\nMassie is one of the few Republicans – and the most vocal – expressing disapproval of Trump’s successful strikes against Iran, even going as far as calling for Congress to vote on a War Powers Act resolution to handcuff Trump.\n\nMassie voted against Trump’s big, beautiful bill in May and against a Trump-backed continuing resolution to freeze spending levels – with supplemental border security funding – through the end of the fiscal year in March.\n\nTrump appears to have had enough, calling Massie “a simple minded ‘grandstander’” and a “lightweight.”\n\n“We had a spectacular military success yesterday, taking the ‘bomb’ right out of their hands (and they would use it if they could!) but, as usual, and despite all of the praise and accolades received, this ‘lightweight’ Congressman is against what was so brilliantly achieved last night in Iran,” Trump said. “Massie is weak, ineffective, and votes ‘NO’ on virtually everything put before him (Rand Paul, Jr.), no matter how good something may be.”\n\nTrump said Massie will “undoubtedly” vote against the Senate-amended big, beautiful bill, “even though non-passage means a 68% Tax Increase for everybody, and many things far worse than that.” That near-certainty that Massie will continue voting against Trump’s legislative priorities could be what pushed Trump to call for his supporters to “drop this pathetic LOSER, Tom Massie, like the plague!”\n\n“The good news is that we will have a wonderful American Patriot running against him in the Republican Primary, and I’ll be out in Kentucky campaigning really hard,” Trump pledged. “MAGA is not about lazy, grandstanding, nonproductive politicians, of which Thomas Massie is definitely one. Thank you to our incredible military for the AMAZING job they did last night. It was really SPECIAL!!! MAKE AMERICA GREAT AGAIN.”\n\nBradley Jaye is Deputy Political Editor for – News. Follow him on X/Twitter and Instagram @BradleyAJaye","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump blasted Rep. Thomas Massie (R-KY) Sunday after the libertarian-leaning&#8230;\n\n\nThis Post: Trump Commits to Visiting Kentucky to Oppose Rep. Thomas Massie in Campaign Efforts first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-commits-to-visiting-kentucky-to-oppose-rep-thomas-massie-in-campaign-efforts/","image":"https://internewscast.com/wp-content/uploads/2025/06/rewrite-this-title-Trump-Pledges-to-Travel-to-Kentucky-to.jpg","video":null,"publish_date":"2025-06-23 00:01:30","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.006},{"id":334126778,"title":"World News | Afghanistan Condemns US Airstrikes on Iran's Nuclear Sites","text":"New Delhi [India], June 23 (ANI): Spokesperson of Afghanistan's Ministry of Foreign Affairs, Abdul Qahar Balkhi, has condemned the United States' airstrikes on Iran's nuclear facilities. In a post on X, Balkhi also expressed concern over the growing instability in the region. Also Read | US War Is With Nuclear Programme, Not Iran; Washington Still Open to Diplomacy: JD Vance After ‘Operation Midnight Hammer’ Attacking Tehran's 3 Nuclear Facilities.\nhttps://x.com/QaharBalkhi/status/1936779705761300519\n\"The Ministry of Foreign Affairs of the Islamic Emirate of Afghanistan, in continuation of the Israeli regime's attacks, condemns the United States' strikes on the nuclear facilities of the Islamic Republic of Iran, & expresses concern over the growing instability in the region,\" Balkhi posted. Also Read | 'This Is Fake': India Debunks Social Media Posts Claiming US Aircraft Used Indian Airspace to Launch Strikes Against Iran During Operation Midnight Hammer.\n\"IEA-MOFA deems the violation of the national sovereignty & territorial integrity of the Islamic Republic of Iran as unacceptable, & calls on all involved sides to give diplomacy a chance in order to resolve the issue,\" he added. Meanwhile, after the US airstrikes on its nuclear installations, Iran is considering closing the Strait of Hormuz, one of the most strategically vital chokepoints in the world, and any blockade by Tehran would pose serious risks for Europe, EuroNews reported on Sunday. Revolutionary Guard commander Sardar Esmail Kowsari told local media in an interview that closing the Strait of Hormuz \"is under consideration, and Iran will make the best decision with determination,\" as per EuroNews.\n\"Our hands are wide open when it comes to punishing the enemy, and the military response was only part of our overall response,\" added Kowsari, who is a member of the Iranian parliament in addition to his military position.\nEarlier on Sunday, US President Donald Trump said the \"very successful\" strikes had hit the Natanz, Fordow and Isfahan underground nuclear sites in Iran.\nAccording to EuroNews, Iran's short- and medium-range missiles would be capable of targeting oil infrastructure platforms, pipelines in the Strait, or even attacking commercial vessels, and surface-to-surface missiles could target tankers or ports along the Gulf. Airstrikes using aircraft and drones could disable navigation or radar equipment at major shipping ports in the region.\nUnmanned drones like Iran's Shahed models could potentially be used to attack specific shipping lanes or infrastructure in the Strait. Iran could attempt to deploy warships to block access to the Strait physically. In 2012, Iran launched a cyberattack on Saudi Arabia's oil industry, showing its growing capability in this domain, as per EuroNews. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  &quot;The Ministry of Foreign Affairs of the Islamic Emirate of Afghanistan, in continuation of the Israeli regime's attacks, condemns the United States' strikes on the nuclear facilities of the Islamic Republic of Iran, &amp; expresses concern over the growing instability in the region,&quot; Spokesperson of Afghanistan's Ministry of Foreign Affairs, Abdul Qahar Balkhi, said.","url":"https://www.latestly.com/agency-news/world-news-afghanistan-condemns-us-airstrikes-on-irans-nuclear-sites-6945759.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250622185331.jpg","video":null,"publish_date":"2025-06-23 00:00:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.076},{"id":334123110,"title":"Can bad publicity be good persuasion?","text":"When great work is presented, it’s often met with resistance. People can find a new idea radical, scary or even off-kilter. Yet, the acceptance or rejection of an idea has little to do with the merits of the idea itself and more to do with what is considered normal or standard for any given situation. The proposed idea is often judged on the basis of what came before it – as opposed to what will come after it in terms of impact or memorability.\n\nWhich means you often end up with two sides facing off each other. You have those who are strongly for the motion and those who are against it. Two camps, both at loggerheads with each other. So how do you help bridge the divide? How do you sell an idea to those who will never see eye to eye despite your best intentions?\n\nHint: Just open the window.\n\nThe Overton Window, developed by policy analyst Joseph Overton, refers to the range of subjects and arguments acceptable to the mainstream population at any given time. It’s also known as the window of discourse.\n\nOverton explains that in order to make extreme ideas go mainstream, you have to persuade people to see the viability of your idea. One would think that reason and logic should help achieve this. But that would be wrong. Surprisingly, it often means proposing something so pathologically illogical, even briefly, that the less ‘illogical’ alternative suddenly seems more viable.\n\nThe Overton Window showcases how extremities veer incrementally towards consensus. The middle is what most people would consider “normal” (and what most marketers would consider “safe”), but anything beyond “acceptable” is where things begin to break down. And yet, creative individuals know in their bones that ideas borne of these fringes are actually the ones that work. Ideas that cater to the middle may be widely accepted but are also wildly ignored.\n\nWhich is why Overton suggests applying ‘normalising’ techniques that will help your ideas sound more acceptable. One way is to take the long and winding road to improve the desired idea, harnessing feedback and adjusting the perceived value of your proposition — give or take 10 years. Or you can take a cue from Donald Trump, who is a media-savvy master of the technique.\n\nWhen Trump wanted to improve border security by reducing migration and increasing deportation, he anticipated backlash (both from reasonable, law-abiding people and the American constitution). So, to get his radical ideas accepted, he proposed even more outlandish ideas: “Let’s build a wall and get the Mexicans to pay for it!” he rallied. The media went wild. This was crazy and unacceptable. How could anyone support something so unthinkable? But, during this public outrage, Trump passed several border control policies that sounded more acceptable compared to some of his unthinkable conjectures – of which there are many.\n\nAt the other extreme, even Greta Thunberg shamed and admonished policymakers long enough to ensure that the EU passes legislation for a 55% cut in emissions, which, she complained, is still not enough. Without her extremities, however, even a 10% cut would have sounded reasonable to most people.\n\nOr take the CEO of Ryanair, Michael O’Leary, who famously said, “Bad publicity sells far more seats than the good.” In order to mitigate complaints from passengers about his low-cost, no-frills airline, he suggested putting coin slots on toilet doors. “People might actually have to spend a pound to pay the penny,” he said. In the aftermath, passengers eventually settled for the lousy service – so long as the toilets were free. The genius, of course, is that O’Leary was never going to execute such an outrageous idea. But, in comparison, it did help make his current offering look palatable.\n\nIn short, if you want your best creative ideas to go from extreme to mainstream, simply radicalise before you prophesise.\n\nOver to you.\n\nFaraz Maqsood Hamidi is CCO and CEO, The D’Hamidi Partnership, a worldwide partner agency of WPI.","summary":"https://aurora.dawn.com/news/1145484/how-to-make-the-extreme-mainstream","url":"https://aurora.dawn.com/news/1145484/how-to-make-the-extreme-mainstream","image":"https://i.dawn.com/large/2025/04/241319497392fca.png?r=132000","video":null,"publish_date":"2025-06-23 00:00:04","author":"Faraz Maqsood Hamidi","authors":["Faraz Maqsood Hamidi"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.131},{"id":334126162,"title":"South Korea June 1-20 exports +8.3% y/y, US shipments rise - TradingView","text":"South Korea's exports for the first 20 days of June rose 8.3% from a year earlier, after falling in May for the first time in four months, early data showed on Monday. \n\nExports of semiconductors rose 21.8%, while cars and ships gained 9.2% and 47.9%, respectively, according to the customs agency. \n\nShipments to the U.S. rose 4.3%, despite President Donald Trump's sweeping tariffs, but those to China fell 1.0%.","summary":"South Korea June 1-20 exports +8.3% y/y, US shipments rise  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3S009N:0-south-korea-june-1-20-exports-8-3-y-y-us-shipments-rise/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-06-23 00:00:00","author":null,"language":"en","source_country":"gb","sentiment":-0.199},{"id":334122088,"title":"How Trump changed the future, kill the suicide bill and other commentary","text":"From the right: Don Just Changed the Future\n\n“In the case of the Middle East what Trump said about himself is true,” marvels Commentary’s John Podhoretz. “He said he doesn’t start wars. Trump said he ends wars” — and Saturday night “was Trump ending this evil war of Iran’s, either right now or after more pain causes the mullahs to cry uncle. For Israel didn’t start this war either. It was launched, by Iran and its catamites, on Oct. 7.” The strike’s “impact is potentially so enormous, and so world-historic, we needn’t rush into interpreting its larger meaning.” But: “Trump has said since the assassination attempt in Butler, Pa., that he believes God spared him for a reason. And now, so do I.”\n\nConservative: Kill the Suicide Bill\n\nGov. Hochul should veto “The Medical Aid in Dying Act, which passed the State Assembly in April,” and “would allow people diagnosed with terminal illnesses to request a prescription for lethal drugs,” urges City Journal’s John Hirschauer. Besides moving to “effectively recognize suicide as a human right,” “the bill has relatively few safeguards,” as “it does not require that the person requesting the drugs be psychiatrically evaluated.” “And the bill’s drafters declined to include a residency requirement,” meaning people from across the country could come to New York and euthanize themselves. “Human life is marked by terrible suffering.” “But once the state decides that anyone, on account of illness, has the ‘right’ to kill himself, it has decided that suffering can render life worthless.”\n\nLiberal: UFT Winning Mayoral Primary\n\nNew York schools are “worse today” despite “an incredible $36,000 spent per pupil — about twice the national average — with National Assessment of Educational Progress scores of 28% proficient in reading and a few points more in math,” grumbles Joe Klein at Substack. One problem: Teachers, like other city workers, are “unable to be fired.” Although education “is the absolute key to future success for New York,” it “hasn’t been much discussed in the Democratic mayoral primary.” In a Manhattan Institute report, all of the candidates “received D’s and F’s, except one” — Whitney Tilson, “an obscure Wall Street moderate” despised by the teachers union. The UFT hasn’t endorsed any candidate, likely due to its “utter confidence that the winner will abide by its wishes.”\n\nFrom the right: LA Needed Trump’s Help\n\n“Gov. Gavin Newsom told Defense Secretary Pete Hegseth that local law enforcement officers were ‘sufficient to maintain order’ ” in Los Angeles, yet LAPD officers tell Heather Mac Donald at The Wall Street Journal, “We don’t have s— under control.” She cites numerous instances of violence that, by “sheer luck,” weren’t life-threatening. “Should Trump have waited to see if the locals” would eventually control the situation? The answer’s clear: “Police Chief Jim McDonnell put the LAPD on tactical alert” and canceled all time off. Yet days later, Mayor Karen Bass nonetheless had to order a curfew. “Still the disorder continued.” Fact is, “There is more danger from tolerating” lawlessness than from responding to it “with all legal means.”\n\nLibertarian: Cut the F-35\n\n“As the U.S. grapples with ballooning federal budgets and increasingly necessary spending cuts, the military remains ripe for austerity,” blares Joe Lancaster at Reason. The F-35 jet is a perfect example of a “program that deserves to be scrapped.” Since its inception after 9/11, “the jet has proven itself not ready from prime time, both more expensive and less functional than promised.” Too bad “the House Appropriations Committee’s proposed Defense Appropriations Bill for 2026 would spend $8.5 billion on F-35s,” and “President Donald Trump has called the F-35 ‘the greatest fighter jet in the world.’” “The F-35 means to replace previous-generation aircraft like the F-16, but instead, the obsolete models are running circles around their intended replacement.” Every new thing we hear about the F-35, “proves that it’s long past time to kill the program.”\n\n— Compiled by The Post Editorial Board","summary":"“In the case of the Middle East what Trump said about himself is true,” marvels Commentary’s John Podhoretz. “He said he doesn’t start wars. Trump said he ends wars” — and Saturday night “was Trump ending this evil war of Iran’s, either right now or after more pain causes the mullahs to cry uncle.","url":"https://nypost.com/2025/06/22/opinion/how-trump-changed-the-future-kill-the-suicide-bill-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/2025-us-military-carried-successful-106939236-e1750636671502.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-22 23:58:13","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.239},{"id":334123156,"title":"Florida to open 'Alligator Alcatraz' to house immigrants surrounded by 200,000 gators","text":"The Sunshine State's undocumented immigrants might soon find themselves detained at a facility chillingly nicknamed 'Alligator Alcatraz', situated dangerously near Florida's treacherous Everglades. As a direct result of former President Donald Trump's mass deportation drive, surging numbers of undocumented migrants are cramming into ICE detention facilities, which are now bursting at the seams and condemned as \"hellish\" by a certain charitable body. Taking to social media, Florida’s Attorney General James Uthmeier floated the idea of creating the unnervingly titled \"Alligator Alcatraz\" in the heart of the alligator-infested Everglades National Park on Thursday. Uthmeier pinpointed the largely abandoned Dade-Collier Training and Transition Airport lying within Big Cypress Wildlife Management Area as the prime spot for this form of detainment compound, unveiling his proposal after Governor Ron DeSantis challenged state lawmakers to scout for viable locales for makeshift immigration holds. \"I think this is the best one,\" Uthmeier confidently expressed during his broadcast announcement, reports the Mirror US . Depicting the possible creation of \"Alligator Alcatraz\", Florida's lead law officer praised the site as both a cost-effective and resourceful option, with the natural boundary of the Everglades potentially slashing the need for heavy spending on security measures. \"If people get out, there's not much waiting for them other than alligators and pythons,\" Uthmeier warned. \"Nowhere to go, nowhere to hide.\" Uthmeier revealed that the facility could be up and running between 30 to 60 days after construction is finished, with capacity to house up to 1,000 individuals. \"This presents a great opportunity for the state of Florida to work with Miami-Dade and Collier counties,\" he announced during his speech. However, Uthmeier didn't speculate on the financial impact of transforming the old complex into an immigration detention centre . The site, originally built in 1968 as the Everglades JetPort, had its construction stopped due to environmental concerns. Environmental activist Marjory Stoneman Douglas founded Friends of the Everglades in 1969, which played a key role in preventing the JetPort's completion. According to its website, the property falls under the jurisdiction of Miami-Dade County and currently features a single runway, mainly used for pilot training exercises. Eve Samples, the executive director of Friends of the Everglades, voiced her opposition to WPTV, primarily objecting to the proposed location of the development. Samples criticised the proposal to media outlets, saying: \"It really strikes you as a clueless idea that was off the cuff,\" and added, \"This site is really important to Friends of the Everglades. It's actually the reason Friends of the Everglades was founded by Marjory Stoneman Douglas in 1969, to stop what would have been the world's largest airport from being built right there. It's really ironic that the state attorney general is characterizing this as a largely abandoned site. It was abandoned because the people of Florida, including Friends of the Everglades, rose up to stop it back in 1969, 1970.\" She also raised concerns about the future, pointing out, \"Think about what could happen if we bring in a 1,000-bed prison, all the ancillary development you would need,\" and urged action by stating, \"We call on the governor to put a stop to this proposal right now. It's a terribly bad idea, and it could totally undermine any Everglades credibility he has remaining.\"","summary":"Florida Attorney General James Uthmeier proposed the creation of a new detention centre called 'Alligator Alcatraz' to detain undocumented migrants near the Everglades","url":"https://www.mirror.co.uk/news/us-news/florida-open-alligator-alcatraz-house-35435223","image":"https://i2-prod.mirror.co.uk/article35435222.ece/ALTERNATES/s1200b/0_6eb81e03-5c76-438d-9244-51a394c9c86ejpeg.jpg","video":null,"publish_date":"2025-06-22 23:57:09","author":"Anthony Orrico,Michael D. Carroll","authors":["Anthony Orrico","Michael D. Carroll"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.121},{"id":334124960,"title":"Trump: U.S. Strikes on Iran's Nuclear Sites Caused 'Monumental' Damage","text":"President Donald Trump declared that U.S. airstrikes on three key Iranian nuclear facilities were “hard and accurate,” and led to “monumental” damage.\n\n“The damage to the Nuclear sites in Iran is said to be ‘monumental,'” Trump wrote in a post on Truth Social. “The hits were hard and accurate. Great skill was shown by our military. Thank you!”\n\nDuring a live address to the nation on Saturday evening, Trump explained that “massive precision strikes” were carried out as part of an effort to destroy Iran’s three key nuclear facilities: Fordow, Isfahan, and Natanz uranium enrichment sites.\n\nTrump explained during his address that the “key nuclear enrichment facilities have been completely and totally obliterated.”\n\nWhile Trump has said the sites have been “totally obliterated,” several U.S. and Israeli officials told the New York Times that Fordow nuclear site was left “severely damaged,” and not totally destroyed:\n\nThe Israeli military, in an initial analysis, believes the heavily fortified nuclear site at Fordo has sustained serious damage from the American strike on Sunday, but has not been completely destroyed, according to two Israeli officials with knowledge of the matter. The officials also said it appeared Iran had moved equipment, including uranium, from the site.\nA senior U.S. official similarly acknowledged that the American strike on the Fordo site did not destroy the heavily fortified facility but said the strike had severely damaged it, taking it “off the table.” The person noted that even 12 bunker-busting bombs could not destroy the site.\n\nIn another post on Truth Social, Trump suggested that “if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN,” then it should be time for a regime change.\n\n“It’s not politically correct to use the term, ‘Regime Change,’ but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!” Trump wrote.\n\nTrump’s post comes after Secretary of Defense Pete Hegseth clarified that the “mission was not, has not been about regime change,” and added that the Trump administration would pursue a path to peace.\n\n“This mission was not, has not been about regime change,” Hegseth said on Sunday. “The President authorized a precision operation to neutralize the threats to our national interests posed by the Iranian nuclear program and the collective self defense of our troops and our ally Israel.”","summary":"President Donald Trump declared that U.S. airstrikes on three key Iranian nuclear facilities were \"hard and accurate,\" and led to \"monumental\" damage.\n\n\nThe post Trump: U.S. Strikes on Iran&#8217;s Nuclear Sites Caused &#8216;Monumental&#8217; Damage appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/06/22/trump-u-s-strikes-on-irans-nuclear-sites-caused-monumental-damage/","image":"https://media.breitbart.com/media/2025/06/trump-situation-room-640x335.jpg","video":null,"publish_date":"2025-06-22 23:54:35","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","source_country":"US","sentiment":-0.489}]}