{"offset":0,"number":50,"available":11755,"news":[{"id":330505800,"title":"‘Dangerous place’: US pulls some Middle East staff as Iran tensions rise","text":"Washington/Baghdad: US President Donald Trump said personnel were being moved out of the Middle East because “it could be a dangerous place”, adding that America would not allow Iran to have a nuclear weapon.\n\nThe US is preparing a partial evacuation of diplomatic staff at its Iraqi embassy and will allow military dependents to leave locations around the Middle East due to heightened security risks in the region. The State Department had also authorised voluntary departures from Bahrain and Kuwait.\n\nThe personnel moves come amid signs the sputtering nuclear diplomacy between the US and Iran may end in conflict. Trump’s efforts to reach a deal with Tehran appear to be deadlocked and US intelligence indicates Israel has been making preparations for a strike against Iran’s nuclear facilities.\n\nIran, meanwhile, has warned it would retaliate against US bases in the Middle East if any failure of nuclear talks led to conflict.","summary":"The personnel moves come amid heightened security risks in the region and signs the sputtering nuclear diplomacy between Washington and Tehran could end in conflict.","url":"https://www.theage.com.au/world/middle-east/dangerous-place-us-pulls-out-some-middle-east-staff-as-iran-tensions-rise-20250612-p5m6ud.html","image":"https://static.ffx.io/images/$zoom_0.5798%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_442%2C$y_208/t_crop_custom/q_86%2Cf_auto/1c83ea0c8b6eee8586f4e7c0597c8fd1220787a0","video":null,"publish_date":"2025-06-12 01:16:21","author":null},{"id":330505218,"title":"Trump's brutal message to actors who boycotted his Kennedy Center appearance as president and Melania attend Les Miserables","text":"President Donald Trump entered the Kennedy Center Wednesday night with first lady Melania Trump at his side and struck a defiant tone when asked about cast members from Les Miserables boycotting his appearance. \n\n'I couldn't care less. Honestly, I couldn't,' said Trump. 'All I do is run the country well.' \n\nThere were reports ahead of Wednesday night's opener that the Trumps, along with Vice President J.D. Vance and wife Usha, would see the storied musical performed by some understudies. \n\nAdditionally, there were threats that drag queens could interrupt and heckle the president during the performance. \n\nSeveral drag queens were gathered a block away from the Kennedy Center as the presidential motorcade drove by. \n\nWhen the Trumps did enter the theater, there were cheers and applause and a USA chant - and also some boos. \n\nThe president took over the John F. Kennedy Center for the Performing Arts in February in an unprecedented way. \n\nJust 19 days into his second term, Trump announced that he would be firing the board of the Kennedy Center - named for the late Democratic president - and naming himself chairman. \n\nSince then, he's made Richard Grenell, who served as the acting Director of National Intelligence during Trump's first term, interim Kennedy Center executive director. Grenell also serves as a envoy for special missions. \n\nTrump applauded Grenell's tenure thus far - with the 2025–2026 season heavily featuring musicals including Les Miserables, Chicago, Moulin Rouge! The Musical, Mrs. Doubtfire, Monty Python's Spamalot and Back to the Future: The Musical. \n\nA number of artists and celebrities who had been associated with the Kennedy Center cut ties, including singer and piano player Ben Folds, Grey's Anatomy creator Shonda Rhimes and Insecure star Issa Rae. \n\n'The new era here is going to be something,' Trump said on the red carpet, as Grenell stood at the top. 'The bones of this facility are really incredible, we're going to make it really great.' \n\nDuring a dinner last month with the new Kennedy Center board members - which now include Attorney General Pam Bondi, Chief of Staff Susie Wiles and singer Lee Greenwood - Trump went off about the look of the Kennedy Center's modern addition. \n\n'It's the last time I'll take a job without looking at it,' the president cracked. \n\nWhile walking on the red carpet, Trump - a native New Yorker - was asked what play he first saw in a theater. \n\n'Well a long time ago, I would say maybe it was Cats,' the president answered. \n\nMelania Trump answered that her first show was, 'Phantom of the Opera.' \n\nMrs. Trump told the Daily Mail she was a Les Mis fan. \n\n'I am, thank you.' \n\nThe president also said he's seen the French Revolution-era musical on multiple occasions. \n\n'I've seen it, we've seen it, a number of times, it's fantastic. It was just about our first choice. That's what we got and we've got other ones coming, other great ones coming,' Trump said. \n\nBut when a reporter asked the president whether he felt more in line with Inspector Javert or the former convict Jean Valjean, he seemed miffed. \n\n'Oh that's a tough one, the last part of that question, that's tough I think,' Trump said laughing. 'You better answer that one honey, I don't know.'\n\nMelania Trump didn't say.","summary":"Donald Trump entered the Kennedy Center Wednesday with Melania at his side and struck a defiant tone when asked about cast members from Les Miserables boycotting his appearance.","url":"https://www.dailymail.co.uk/news/article-14803425/Trumps-brutal-message-actors-boycotted-Kennedy-Center-appearance-president-Melania-attend-Les-Miserables.html","image":"https://i.dailymail.co.uk/1s/2025/06/12/01/99284543-0-image-a-31_1749687625317.jpg","video":null,"publish_date":"2025-06-12 01:09:39","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":0.171},{"id":330502782,"title":"World News | Google Offers Buyouts to More Workers Amid AI-driven Tech Upheaval and Antitrust Uncertainty","text":"Mountain View (California), Jun 12 (AP) Google has offered buyouts to another swath of its workforce across several key divisions in a fresh round of cost cutting coming ahead of a court decision that could order a breakup of its internet empire. The Mountain View, California, company confirmed the streamlining that was reported by several news outlets. It is not clear how many employees are affected, but the offers were made to staff in Google's search, advertising, research and engineering units, according to The Wall Street Journal. Google employs most of the nearly 1,86,000 workers on the worldwide payroll of its parent company, Alphabet Inc. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. \"Earlier this year, some of our teams introduced a voluntary exit programme with severance for US-based Googlers, and several more are now offering the programme to support our important work ahead,\" a Google spokesperson, Courtenay Mencini, said in a statement. \"A number of teams are also asking remote employees who live near an office to return to a hybrid work schedule in order to bring folks more together in-person,\" Mencini said. Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. Google is offering the buyouts while awaiting a federal judge to determine its fate after its ubiquitous search engine was declared an illegal monopoly as part of nearly five-year-old case by the US Justice Department. The company is also awaiting remedy action in another antitrust case involving its digital ad network. US District Judge Amit Mehta is weighing a government proposal seeking to ban Google paying more than USD 26 billon annually to Apple and other technology companies to lock in its search engine as the go-to place for online information, require it to share data with rivals and force a sale of its popular Chrome browser. The judge is expected to rule before Labour Day, clearing the way for Google to pursue its plan to appeal last year's decision that labelled its search engine as a monopoly. The proposed dismantling coincides with ongoing efforts by the Justice Department to force Google to part with some of the technology powering the company's digital ad network after a federal judge ruled that its digital ad network has been improperly abusing its market power to stifle competition to the detriment of online publishers. Like several of its peers in Big Tech, Google has been periodically reducing its headcount since 2023 as the industry began to backtrack from the hiring spree that was triggered during pandemic lockdowns that spurred feverish demand for digital services. Google began its post-pandemic retrenchment by laying off 12,000 workers in early 2023 and since then as been trimming some divisions to help bolster its profits while ramping up its spending on artificial intelligence — a technology driving an upheaval that is starting to transform its search engine into a more conversational answer engine. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Google has offered buyouts to another swath of its workforce across several key divisions in a fresh round of cost cutting coming ahead of a court decision that could order a breakup of its internet empire. The Mountain View, California, company confirmed the streamlining that was reported by several news outlets.","url":"https://www.latestly.com/agency-news/world-news-google-offers-buyouts-to-more-workers-amid-ai-driven-tech-upheaval-and-antitrust-uncertainty-6921739.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:58:19","author":null,"language":"en","source_country":"in","sentiment":-0.47},{"id":330502780,"title":"World News | First Person of Indian Origin Elected Head of American Medical Association","text":"Washington, DC [US], June 12 (ANI): Srinivas Mukkamala was elected President of the American Medical Association, the first person of Indian origin to lead the organisation in its 178-year history.\n\"To call this moment humbling doesn't capture it,\" said Bobby Mukkamala, MD, an otolaryngologist and the AMA's newly inaugurated 180th President. \"It's moving. It's awe-inspiring,\" he said.\nAlso Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested.\nFor many in attendance at the AMA presidential inauguration in Chicago, that inspiration was reciprocal. Last November, a magnetic resonance imaging (MRI) exam revealed an 8-cm temporal lobe tumour on the left side of Mukkamala's brain. Three weeks after the startling discovery, the 53-year-old father of two underwent surgery, as per a statement by AMA.\nThe removal of 90 per cent of the tumor was a best-case scenario for Mukkamala. During his decades working in organised medicine, Mukkamala has been a fierce advocate for patients. His cancer battle reaffirmed the purpose of his position--to use his platform and lived experience to advocate for a better, more equitable US health system.\nAlso Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'.\nMukkamala went on to highlight that he, without question, benefited from the best possible treatment. But for many patients, the process of getting care comes with far more troubling questions than reassuring answers: whether insurance will cover a procedure, how much a medication costs, or how long they will wait to see a specialist for something as serious as a lump in their neck, as per the statement.\n\"Our health system needs the input of many skilled physicians--physician leaders across every state and specialty--who are working together with incredible purpose and urgency,\" he said. \"It needs the AMA more than ever, with leaders in our profession speaking with one firm and commanding voice.\"\nAMA House of Delegates' meeting ran from June 6- June 11, as per the statement.\nThe AMA has adopted a new policy aimed at promoting public awareness and education about the differences between unhealthful, ultraprocessed foods and healthful foods, as well as the benefits of minimally processed and unprocessed foods. As part of this effort, the policy encourages the integration of nutrition education into all levels of medical education to empower physicians to best counsel patients on reducing unhealthful consumption of ultraprocessed foods. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  &quot;To call this moment humbling doesn't capture it,&quot; said Bobby Mukkamala, MD, an otolaryngologist and the AMA's newly inaugurated 180th President. &quot;It's moving. It's awe-inspiring,&quot; he said.","url":"https://www.latestly.com/agency-news/world-news-first-person-of-indian-origin-elected-head-of-american-medical-association-6921736.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250611234309.jpg","video":null,"publish_date":"2025-06-12 00:56:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.253},{"id":330504000,"title":"INEC: When An Umpire Becomes The Kingmaker! (2)","text":"Nobody can now come out tell us about “glitches” which is just an excuse to return to the old, easily corruptible way of con-ducting elections. In fact, we can even conduct paperless elections. All it would require would be to provide laptops connected to the internet at every polling unit. Once somebody thumbs on the face or party log of his preferred candidate, it will register at the appropriate section on the INEC server. This will even gratify the long sought opportunity for Ni-gerians abroad to participate in our elections.\n\nWhy do I prefer a “reputable foreign software development company”? Many foreign compa-nies are now wary of indulging in unethical practices overseas. We all were witnesses some years ago when some foreign companies, like Siemens, Willbros, etc., were involved in ugly bribe scandals in Nigeria. The companies were tak-en to court in their various home countries and huge fines were im-posed on them. But, sadly, after some noise in the media here, no-body heard anything again about any punishment meted out to the Nigerian officials that received those huge bribes from the for-eign companies.\n\nI don’t care who wins in any election as long as he is the peo-ple’s choice. Recently in America, we saw how Donald Trump who was disliked by the vocal minori-ty swept the polls. Nobody went to court because the Americans trust their electoral system and they know that Trump’s victory indeed represents the will of the majority. Even in many countries in Africa now, free and fair elec-tions are taken for granted. How long shall Nigeria continue to embarrass itself, the continent of Africa and entire black race with the kind of crude, horrible elections which INEC conducts every now and again? Why must everyone continue to watch pas-sively as a few vile characters at INEC and base politicians con-tinue to ruin the credibility of our electoral system and the ju-diciary (with disputes over elec-tion results) and stagnate growth and progress of the country? How long should Nigeria’s politics re-main the dirtiest in the world?\n\nNigerians can no longer af-ford to allow an insignificant minority made up of morally bankrupt politicians and unpa-triotic and corrupt INEC staff to destroy our organized systems and hold the country to ransom. Every Nigerian must now insist on transparent elections as the first step in the effort to sanitize the country. If the National As-sembly members are unwilling to push for a law that removes hu-man interventions from the elec-toral process, members of their constituencies should organize themselves and recall them – a very simple process, by the way. It is because their determination to remain insensitive to the peo-ple’s feelings has so far brought no consequences to them that they persist in it.\n\nDuring the 2023 elections, INEC went to the National As-sembly with so much flourish to get the lawmakers to enact a law making electronic transmis-sion of results mandatory. The successful passing of the bill sparked off jubilations across the nation. Many Nigerians abroad were so excited that the country was going to experience real democracy for the first time. Several of them bought air tick-ets and flew to Nigeria to be part of the very exciting experience that signaled the emergence of a new Nigeria. They posted pic-tures of themselves brandishing their flight tickets on the social media. But at the end of the day, it was the same INEC that invent-ed “glitches” and used that as an excuse to relapse into the same old, easily corruptible process of manual transmission and colla-tion of results, thus dashing the hope of the people. That is why I insist that any election that would allow INEC officials to ma-nipulate the process is not worth anybody’s time. Nigerians must insist on that. Who conferred the right on INEC officials to choose our public officers for us? Is that not a huge insult? Why are we suddenly witnessing a rash of defections that is threatening to turn Nigeria into a One-Par-ty state? Is it not because of the crushing fear that the ruling party, not INEC, would probably decide who wins or loses in the next elections? Is that not egre-gious enough in a supposedly democratic country?\n\nI know there are other inhibit-ing factors like threats, violence and inducements during elections. That can easily be handled for now by cancelling the elections wherever they occur, but let us fix the core problem first, which is, retrieving from INEC the power to impose leaders on us! Indeed, credible elections are richly re-warding. Nigerians deserve a taste of it and should no longer hang their hopes on the ethical config-urations of INEC officials. Let reli-able technology help us. Certainly, a new Nigeria is possible.\n\n*Ejinkeonye, a journalist and writer, is the author of Nigeria: Why Looting May Not Stop (scruples2006@yahoo. com)","summary":"&#160;Nobody can now come out tell us about “glitches” which is just an excuse to return to the old, easily corruptible way of con­ducting elections. In fact, we can even&#8230;","url":"https://independent.ng/inec-when-an-umpire-becomes-the-kingmaker-2/","image":"https://independent.ng/wp-content/uploads/1-153.png","video":null,"publish_date":"2025-06-12 00:56:00","author":"Ugochukwu Ejinkeonye","authors":["Ugochukwu Ejinkeonye"],"language":"en","source_country":"ng","sentiment":-0.117},{"id":330504384,"title":"Here are 12 ‘No Kings’ protests against Trump set for June 14 across Southern California","text":"More than two dozen protests planned across Southern California on Saturday, June 14 — part of a national demonstration against President Donald Trump and his policies — will be watched closely by local organizers and officials following unrest this past week in the Los Angeles area.\n\nThe “No Kings Day” demonstrations across the country coincide with a military parade the Trump administration is organizing on Flag Day in Washington, D.C., to mark the U.S. Army’s 250th birthday. At more than 1,500 planned anti-Trump demonstrations Saturday, which is also Trump’s birthday, his critics will send a clear message: “In America, we don’t do kings,” according to Indivisible, the progressive organization behind “No Kings Day.”\n\nIn a news release, Indivisible organizers said the demonstrations are a way to bring “pro-democracy and pro-worker” allies together to “reject corrupt, authoritarian politics” in the U.S. Protests are planned in communities across Southern California, from Woodland Hills to Pasadena and Anaheim and from Claremont to Riverside and Temecula.\n\n“The majority of us are not OK with what’s going on right now,” Melissa Follstad, a group leader with Indivisible Inland Empire, said Wednesday. “We do not want a king.”\n\nThe protests come on the heels of Trump’s deployment of 700 Marines and 2,000 California National Guard troops to Los Angeles to confront protesters who have gathered to condemn Immigration and Customs Enforcement raids across the region. At least 40 people were arrested during anti-ICE protests in Los Angeles Sunday night, June 8, and into Monday morning, June 9, authorities said.\n\nProtests set for Saturday — many of them organized weeks ago — will continue as planned, according to Follstad and other organizers.\n\n“It will be a peaceful protest and people need to get out there and be seen,” Follstad said. “We want our government to be functional. We don’t want our federal employees being fired for no reason. We don’t want our neighbors being picked up by ICE.”\n\nAll No Kings events are expected to adhere to a shared commitment to nonviolent protest and community safety, organizers say. Ahead of the Indivisible Inland Empire protest in Rancho Cucamonga, for example, organizers have added more safety marshals, Follstad said, and trained leaders in de-escalation tactics while outfitting them with megaphones, whistles and identification vests.\n\nIndivisible also offers safety training videos to those who register to attend protests, shares information on social media, hands out fliers with safety information at protests and encourages people to take deep breaths and stay calm.\n\nFollstad said organizers also communicate with local law enforcement in advance, and will keep communication open at the event to “stay on the same page as police.” At the end of the protest, organizers work to disperse the crowd, Follstad said.\n\n“We’re going to have every single safety marshal helping people to get going, so that they don’t loiter,” Follstad added. “A lot of times, it is those people who stay after the official event that can potentially get rowdy — and we want to prevent that.”\n\nIn Riverside, protesters led by Indivisible Riverside and Riverside Resistance Revival Chorus, will gather on Market Street, filling the area with flags, signs and life-size George Washington cardboard cutouts.\n\n“We’re aware of the upcoming protest and will have officers there to help keep everyone safe, whether you’re protesting, passing through, or just nearby,” Riverside police spokesperson, Officer Ryan Railsback, said Wednesday. “We are firmly committed to upholding First Amendment rights, maintaining public order, and protecting people and property.”\n\nIt will be a fun atmosphere, according to Kris Lovekin, a volunteer spokesperson for Indivisible Riverside, and safety monitors will ensure traffic is not blocked in the area. Protesters will be on the sidewalks and cross at green lights, Lovekin added.\n\n“We’ve been working a long time with Riverside Police Department on our demonstration,” Lovekin said. “We will work with them if there’s any trouble, but we don’t expect trouble.”\n\n‘No Kings’ protests\n\nMore than 1,500 demonstrations against the Trump administration are planned nationwide on Saturday, June 14. Some of the more than two dozen protests planned in Southern California are listed below. A full list is available at nokings.org.\n\nAnaheim: 4-7:30 p.m., La Palma Park, 1151 N. La Palma Parkway\nClaremont: 2-4 p.m., Foothill and North Indian Hill boulevards\nLong Beach: 9-11 a.m., Bixby Park Annex at East Ocean Boulevard and Junipero Avenue\nLos Angeles: 10 a.m., Los Angeles City Hall, 200 N. Spring St. Carlos Álvarez-Aranyos, founder of American Opposition, is expected to join the protest.\nPasadena: 2-4 p.m., Lake Avenue and Colorado Boulevard intersection\nRancho Cucamonga: 5-7 p.m., City Hall, Civic Center Drive and Haven Avenue\nRiverside: 5:30-7:30 p.m., downtown Riverside at Market Street\nTorrance: 11 a.m.-1 p.m., City Hall, 3031 Torrance Blvd.\nTemecula: 11 a.m.-1 p.m., Temecula Duck Pond, Rancho California Road and Ynez Road\nWhittier: 2-5 p.m., City Hall, 13230 Penn St.\nWoodland Hills: 11 a.m.-1 p.m., northeast corner of Topanga Canyon and Victory boulevards","summary":"The demonstrations coincide with a Flag Day military parade in Washington honoring the U.S. Army's 250th birthday.","url":"https://www.ocregister.com/2025/06/11/here-are-12-no-kings-protests-against-trump-set-for-june-14-across-southern-california/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/sut-l-trump-protest08.jpg?w=1024&h=667","video":null,"publish_date":"2025-06-12 00:55:22","author":"Madison Hart","authors":["Madison Hart"],"language":"en","category":"politics","source_country":"US","sentiment":0.233},{"id":330505194,"title":"Voters reveal Trump's latest approval rating as LA riots mayhem shakes the nation","text":"A new poll shows that President Donald Trump's approval rating has ticked up slightly in the days following his dramatic crackdown in response to the Los Angeles riots.\n\nTrump's approval rating is now at 48 percent, according to the latest Daily Mail tracking poll conducted with J.L. Partners, up one point from last week's 47 percent, when the president was in the middle of a nasty public feud with billionaire and former close friend Elon Musk. The change falls within the survey's 2.3 percent margin of error.\n\nThe president continues to win the majority of voters support for his approach to illegal immigration, even as the administration's aggressive posture toward deporting illegal immigrants has sparked protests in major cities across the United States. \n\nFifty-five percent of voters favor his approach to illegal immigration while 45 percent disapprove. \n\n'Trump might be inviting criticism on the airwaves, but these numbers show that voters are behind him on his approach to illegal migration,' J.L. Partners co-founder James Johnson told the Daily Mail. \n\nThe poll included 1,807 registered voters and was conducted between June 10-11. \n\nTrump and his administration continue pursuing an aggressive approach to the deportation of illegal immigrants and the subsequent rioting that took place in the streets of Los Angeles. \n\n'If our troops didn’t go into Los Angeles, it would be burning to the ground right now, just like so much of their housing burned to the ground,' Trump wrote on social media on Wednesday. 'The great people of Los Angeles are very lucky that I made the decision to go in and help!!!' \n\nTrump's decision to send in National Guard troops and United States Marines drew angry condemnation from California Governor Gavin Newsom and Los Angeles Mayor Karen Bass. \n\nBut the president remains committed to a forceful response from the federal government, as he has repeatedly condemned Newsom as 'incompetent.' \n\n'The INCOMPETENT Governor of California was unable to provide protection in a timely manner when our Ice Officers, GREAT Patriots they are, were attacked by an out of control mob of agitators, troublemakers, and/or insurrectionists,' he wrote. \n\nNewsom has mounted a significant effort to challenge Trump's authority to send in federal troops to quell the riots, filing lawsuits to block his efforts. \n\nHe also delivered a major address to Californians on Tuesday night, warning them that the very nature of American democracy was at stake . \n\n'Democracy is under assault right before our eyes – the moment we’ve feared has arrived,' he said. 'He’s taking a wrecking ball to our founding fathers’ historic project.","summary":"A new poll shows that President Donald Trump's approval rating has ticked up in the days following his emphatic crackdown in response to the Los Angeles riots.","url":"https://www.dailymail.co.uk/news/article-14803593/donald-trump-poll-approval-rating-la-riots.html","image":"https://i.dailymail.co.uk/1s/2025/06/11/21/99276241-0-image-m-6_1749674630987.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/10/4521213827849536111/1024x576_MP4_4521213827849536111.mp4","publish_date":"2025-06-12 00:54:48","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":-0.125},{"id":330502808,"title":"World News | Colombia's President Bypasses Lawmakers and Issues Decree to Let Voters Decide on Labour Reform","text":"Bogota (Colombia), Jun 12 (AP) Colombian President Gustavo Petro on Wednesday bypassed legislative opposition and signed a decree summoning voters to the polls in August to decide changes to the country's labour laws, including whether work days should be limited to eight hours. The decree fulfilled Petro's threat to Congress to put his labour system overhaul before voters should senators not approve the 12-question referendum themselves. He issued the measure in a tense political climate following the Saturday shooting of opposition senator and presidential candidate Miguel Uribe Turbay during a public event. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. The referendum has become the crux of long-running tensions between the executive and legislative branches. After Congress rejected Petro's labour reform twice, most recently in March, he sent lawmakers a 12-question referendum proposal on May 1 as Colombian law requires that the Senate rule on the advisability of referendums. The legislative body two weeks later voted 49-47 against the measure, prompting Petro to accuse lawmakers of fraud. Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. Petro, Colombia's first leftist president, has accused Congress of working against the interest of workers and has asked them to demonstrate across the country. The referendum's questions include whether workers should receive double pay if they work during holidays; whether daytime workdays should end at 6 pm; and whether open-ended contracts should be offered to workers to prioritise job stability. The disagreements between Petro and Congress date back to the start of his term in 2022, but they have heightened as he seeks to consolidate his legacy ahead of next year's legislative and presidential elections. Uribe remained in critical condition on Wednesday following his shooting in broad daylight Saturday during a political rally in the capital, Bogota. Authorities investigating the motive have not ruled out the possibility that it was a targeted attack on the opposition. They are also considering whether it was an attempt to destabilise the current government, or retaliation by illegal armed groups. In anticipation of court challenges, Petro on Wednesday said his government will send the decree to Colombia's Constitutional Court for review. At the same time, the Council of State is considering a lawsuit seeking to annul the Senate's vote. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Colombian President Gustavo Petro on Wednesday bypassed legislative opposition and signed a decree summoning voters to the polls in August to decide changes to the country's labour laws, including whether work days should be limited to eight hours.","url":"https://www.latestly.com/agency-news/world-news-colombias-president-bypasses-lawmakers-and-issues-decree-to-let-voters-decide-on-labour-reform-6921732.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:54:10","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.237},{"id":330502790,"title":"World News | Australia, Canada, New Zealand, Norway, UK Announce Sanctions Against Israel Ministers","text":"Canberra [Australia], June 12 (ANI): The Foreign Ministers of Australia, Canada, New Zealand, Norway and the United Kingdom collectively announced sanctions and other measures targeting Israel ministers Itamar Ben-Gvir and Bezalel Smotrich for inciting violence against Palestinians in the West Bank, a statement by the Australian Minister for Foreign Affairs, Senator Penny Wong said.\nhttps://x.com/SenatorWong/status/1932770103638327673\nAlso Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested.\n\"Settler violence is incited by extremist rhetoric which calls for Palestinians to be driven from their homes, encourages violence and human rights abuses, and fundamentally rejects the two-state solution. Settler violence has led to the deaths of Palestinian civilians and the displacement of whole communities,\" the statement read.\n\"We are steadfastly committed to the two-state solution, which is the only way to guarantee security and dignity for Israelis and Palestinians and ensure long-term stability in the region, but it is imperiled by extremist settler violence and settlement expansion,\" it added.\nAlso Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'.\nFurther, Itamar Ben-Gvir and Bezalel Smotrich have incited extremist violence and serious abuses of Palestinian human rights. Extremist rhetoric advocating the forced displacement of Palestinians and the creation of new Israeli settlements is appalling and dangerous. These actions are not acceptable. \"We have engaged the Israeli Government on this issue extensively, yet violent perpetrators continue to act with encouragement and impunity. This is why we have taken this action now - to hold those responsible to account, as per the statement,\" the statement added. It insisted that the Israeli government must uphold its obligations under international law and take meaningful action to end extremist, violent and expansionist rhetoric.\nThe measures announced today do not deviate from our unwavering support for Israel's security and we continue to condemn the horrific terror attacks of 7 October by Hamas. Today's measures are targeted towards individuals who in our view undermine Israel's own security and its standing in the world. We continue to want a strong friendship with the people of Israel based on our shared ties, values and commitment to their security and future, the joint statement said.\n\"Today's measures focus on the West Bank, but of course this cannot be seen in isolation from the catastrophe in Gaza. We continue to be appalled by the immense suffering of civilians, including the denial of essential aid. There must be no unlawful transfer of Palestinians from Gaza or within the West Bank, nor any reduction in the territory of the Gaza Strip,\" it emphasised. \"We will continue to work with the Israeli government and a range of partners. We will strive to ensure an immediate ceasefire, the release now of the remaining hostages and for the unhindered flow of humanitarian aid including food. We want to see a reconstructed Gaza no longer run by Hamas and a political pathway to a two-state solution,\" the statement concluded. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Foreign Ministers of Australia, Canada, New Zealand, Norway and the United Kingdom collectively announced sanctions and other measures targeting Israel ministers Itamar Ben-Gvir and Bezalel Smotrich for inciting violence against Palestinians in the West Bank.","url":"https://www.latestly.com/agency-news/world-news-australia-canada-new-zealand-norway-uk-announce-sanctions-against-israel-ministers-6921730.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250611230546.jpg","video":null,"publish_date":"2025-06-12 00:50:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.076},{"id":330502810,"title":"World News | An Omaha Food Plant Owner Says He Followed Rules for Hiring Immigrants. It Was Raided Anyway","text":"Omaha (Nebraska), Jun 12 (AP) The owner of an Omaha food packaging company says his business has been unfairly hamstrung by federal immigration officials, who raided the plant and arrested more than half its workforce. The raid took place despite the company meticulously following the government's own system for verifying the workers were in the country legally, owner Gary Rohwer said on Wednesday. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. Glenn Valley Foods now is operating at about 30 per cent of capacity as the business scrambles to hire more workers, Rohwer said as he stood outside the plant. Asked how upsetting the raid was, Rohwer replied, \"I was very upset, ma'am, because we were told to e-verify, and we e-verified all these years, so I was shocked.\" Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. \"We did everything we could possibly do,\" he said. E-Verify is an online US Department of Homeland Security system launched in the late 1990s that allows employers to quickly check if potential employees can work legally in the US, often by using Social Security numbers. Some of America's largest employers use it, including Starbucks and Walmart, but the vast majority of employers do not. Critics say the system is fairly easy to cheat, particularly with false documents. Rohwer noted that federal officials have said his company was a victim of those using stolen identities or fake IDs to get around the E-Verify system, which lead agents conducting the raid described as \"broken\" and \"flawed\" to Glenn Valley executives. But that does nothing to repair the company's bottom line, Rohwer said. \"I'd like to see the United States government ... come up with a programme that they can communicate to the companies as to how to hire legitimate help. Period,\" he said. US Immigration and Customs Enforcement confirmed that more than 70 people were arrested during the Glenn Valley Foods raid on Tuesday. It also said one of the workers, described as a Honduras national, assaulted federal agents as he was being detained. The Omaha raid comes amid an immigration crackdown under President Donald Trump. The administration has been intensifying its efforts in recent weeks, and Trump deployed more than 4,000 National Guard troops and 700 Marines this week to respond to ongoing protests in Los Angeles over his immigration policies. The raid, in the southeastern section of Omaha where nearly a quarter of residents are foreign born according to the 2020 census, led to hundreds of people turning out to protest Tuesday evening. But it also had a chilling effect on the south Omaha community. The Metropolitan Community College's South Omaha campus and an Omaha library branch in the area closed Tuesday afternoon, and several businesses along south Omaha's normally bustling 24th Street closed as news of the raid spread. Several of them remained closed Wednesday, said Douglas County Board of Commissioners Chairman Roger Garcia, whose district covers south Omaha. \"Everybody's still on alert, waiting to see what happens today and in the coming days,\" Garcia said. \"So there's still a lot of anxiety and fear out there.\" That fear will show up in the form of a weakened economy in Omaha, he added. \"You know, when products are not being sold, taxes are not being collected, and people are not able to get their goods as well. So it affects all of us,\" he said. An aunt of Garcia's wife was among those taken away by ICE (Immigration and Customs Enforcement) during the Omaha raid, he said. They have been unable to determine where she is being held. The raid came on the same day of the inauguration of newly elected Omaha Mayor John Ewing, a Democrat who unseated three-term Republican Jean Stothert last month. During a news conference on Wednesday to address the raid, Ewing declined to speculate on whether the timing of it was intended to distract from his swearing-in. But he denounced the action by federal authorities, saying, \"My message to the public is that we are with them.\" Omaha Police Chief Todd Schmaderer also declared that his department will play no part in checking immigration or the legal status of residents in the community. \"That is not our mission. Our mission is public safety,\" the chief said. \"I need victims to come forward. They will not come forward if they're fearful of Omaha Police Department being immigration officers.\" (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   The owner of an Omaha food packaging company says his business has been unfairly hamstrung by federal immigration officials, who raided the plant and arrested more than half its workforce.","url":"https://www.latestly.com/agency-news/world-news-an-omaha-food-plant-owner-says-he-followed-rules-for-hiring-immigrants-it-was-raided-anyway-6921727.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:48:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.523},{"id":330501804,"title":"Russia Carries Out Lethal Strike in Eastern Ukraine as Peace Talks Stall","text":"Recent Russian strikes in Ukraine’s northeastern city of Kharkiv have resulted in the deaths of three individuals and injuries to 60 others, including children, according to authorities. This comes as Moscow continues its offensive despite dismissing calls for an unconditional ceasefire.\n\nUkraine reported receiving the remains of over 1,200 soldiers from Moscow, as part of a repatriation agreement reached during talks last week.\n\nIn recent weeks, Russia has launched an unprecedented number of drones and missiles against Ukraine, intensifying three years of relentless bombardment while presenting hardline demands—deemed “ultimatums” by Kyiv—to end its prolonged invasion.\n\nThe city of Kharkiv, located just 30 kilometers from the Russian border, has again faced significant attacks.\n\nA burnt car in front of a blazing home following a Russian drone strike on Kharkiv, Ukraine\n\nOleg Synegubov, the regional governor of Kharkiv, reported three fatalities.\n\n“Each new day brings fresh cowardly strikes from Russia, and nearly every attack is deliberate,” he stated.\n\nUkrainian President Volodymyr Zelensky expressed on social media, “Russia deserves heightened pressure,” following the latest shelling in Kharkiv.\n\nJournalists from AFP in the city observed damaged apartment buildings, charred vehicles, and debris scattered across the streets in the aftermath of the strikes.\n\nOlena Khoruzheva recounted seeking refuge in a hallway with her two children when the drones approached.\n\nDamage to buildings and vehicles after attacks on Kharkiv\n\n“The younger one lay on the floor, arms over his head. I shielded him,” said the 41-year-old pharmacist.\n\n“We heard it coming, followed by silence, and then we were thrown against the wall… there were further explosions, then we could hear people crying for help.”\n\nHer 65-year-old neighbor was among those killed.\n\nThis morning, an AFP reporter witnessed first responders retrieving one deceased individual from an apartment block, placing the body in a black bag.\n\nStalled peace negotiations\n\nUkraine’s air force reported that Russia launched 85 drones overnight—less than in prior days.\n\nOn the front lines, Russian troops have been steadily advancing.\n\nThe Russian defense ministry announced the deployment of additional units into the Dnipropetrovsk region, initiating an offensive for the first time during its 40-month invasion.\n\nUS President Donald Trump has been advocating for a peace agreement between the two nations, but progress has been minimal.\n\nIn response, Zelensky has urged the West to impose stringent economic sanctions on Russia, which he believes would curtail its ability to wage war.\n\nHe is expected to reiterate this message to Trump and European leaders at the G7 summit in Canada, scheduled to begin on Sunday.\n\nPresident Volodymyr Zelensky has called on the West to intensify pressure on Russia (file image)\n\nLeaders from several southeastern European countries were anticipated in the port city of Odesa, mere hours after it faced Russian attacks.\n\nTwo rounds of peace negotiations between Russia and Ukraine have failed to produce a resolution to the conflict.\n\nRussia has rejected calls for an unconditional ceasefire, demanding that Ukraine relinquish significant territories and drop its NATO aspirations.\n\nHowever, both sides agreed to exchange over 1,000 prisoners of war and return the bodies of deceased soldiers.\n\nUkraine stated that Russia had returned the remains of 1,212 deceased soldiers and is in the process of identifying them.\n\nReturned bodies\n\nVladimir Medinsky, Russia’s chief negotiator, confirmed the exchange, stating that Russia received “the remains of 27 Russian soldiers.”\n\nUkraine did not specify how many bodies it returned to Russia, which contends that Western estimates regarding its casualty figures are inaccurate.\n\nMoscow spent several days accusing Kyiv of refusing to collect the bodies after stating they had been delivered to the border in refrigerated trucks on Saturday.\n\nUkrainian military personnel under the age of 25 released from Russian captivity on Monday\n\nThe two nations carried out groups of prisoner swaps on Monday and Tuesday, though neither disclosed the number freed.\n\nA new exchange of “severely wounded” individuals has been scheduled for tomorrow, Medinsky indicated.\n\nFollowing Russia’s assaults, Kyiv retaliated with drone strikes. Russia’s defense ministry claimed to have intercepted 32 Ukrainian drones overnight.\n\nBoth parties have downplayed the likelihood of significant headway at talks in Istanbul.\n\nWhile open to diplomacy, Zelensky deemed further discussions with the current Russian delegation “pointless,” previously labeling them as “empty heads” due to their inability to agree on a ceasefire.\n\nRussian President Vladimir Putin labeled Kyiv a “terrorist” regime and questioned the rationale for negotiating with them.","summary":"Recent Russian strikes in Ukraine&#8217;s northeastern city of Kharkiv have resulted in the deaths of three individuals and injuries to 60 others, including children, according to authorities. This comes as Moscow continues its offensive despite dismissing calls for an unconditional ceasefire. Ukraine reported receiving the remains of over 1,200 soldiers from Moscow, as part of [&#8230;]","url":"https://www.jowhar.com/world-news/russia-carries-out-lethal-strike-in-eastern-ukraine-as-peace-talks-stall.html","image":"https://www.jowhar.com/wp-content/uploads/2025/06/0022b2fc-1600.jpg","video":null,"publish_date":"2025-06-12 00:47:25","author":"Hanad","authors":["Hanad"],"language":"en","category":"politics","source_country":"so","sentiment":-0.161},{"id":330502928,"title":"No agreements on Putin-Trump meeting so far — envoy to Washington","text":"WASHINGTON, June 12. /TASS/. No specific agreements on a meeting between Russian and US presidents, Vladimir Putin and Donald Trump, have been reached yet, with preparatory work being underway, Russian Ambassador to Washington Alexander Darchiev told reporters.\n\n\"Preparatory work is apparently underway though there are no specific agreements,\" he said when asked whether the Russian and American parties were discussing the possibility of holding a meeting between the leaders.\n\nAsked whether the issue of a meeting between the two presidents was raised at the presentation of credentials by the Russian ambassador to Trump earlier on Wednesday, Darchiev said: \"No. It couldn’t be raised. That was a protocol event,\" he said.\n\nThe diplomat answered reporters’ questions at a reception at the Russian embassy in the US on the occasion of Russia Day.\n\nEarlier he handed over his credentials to Trump. Darchiev assured Trump of the Russian embassy’s intention to do everything to restore the relations between the two countries, returning them to normal.\n\n\"US President found a window in his packed schedule to accept the originals of my credentials and meet me in person on the eve of Russia Day,\" the diplomat said. \"It was a great honor for me as the Russian ambassador to speak with President Trump, assuring him that I and the embassy under my leadership will do everything to restore the Russian-American relations, returning them to normality and common sense,\" Darchiev stressed.\n\nHe noted that the improvement of cooperation between Moscow and Washington \"would become easier after originals of credentials were handed over to the US president.\"\n\nThe decree appointing Darchiev as ambassador to Washington was signed by Russian President Vladimir Putin on March 6.","summary":"Russian Ambassador to Washington Alexander Darchiev answered reporters’ questions at a reception at the Russian embassy in the US on the occasion of Russia Day","url":"https://tass.com/politics/1972113","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-06-12 00:46:12","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.123},{"id":330501212,"title":"Jesus polished luxury vehicles at an LA car wash for a decade. Then ICE showed up","text":"Jesus Cruz, who has worked at the car wash for more than a decade and lived in the US for more than 30 years, was among the six men who were arrested over the course of two raids. \n\nHis wife, Noemi, told the BBC she was shopping with her daughter when she spotted a social media post about a possible raid. It included a photo of the car wash, so she dropped her daughter at home and raced there.\n\nBy the time she arrived, however, she was too late. She has not been able to reach her husband since. \n\n\"You are so used to having a partner there, just to help you out, to be the backbone… now it's like - how am I going to do it?\" she said.\n\n\"My husband has no criminal background. He's never gotten a ticket before. We pay our taxes. We're up to date on everything.\"\n\nThe Department of Homeland Security (DHS) did not respond to an inquiry about Mr Cruz's legal status or the goal of the operation at the car wash.\n\nThe raid at the car wash, and similar ones across Los Angeles, represent a significant escalation in the White House's strategy to round up and deport undocumented migrants. \n\nOn the campaign trail, President Donald Trump repeatedly said he would prioritise deporting noncitizens accused of violent crimes. That promise received widespread support, even among Hispanic immigrant groups. \n\nBut in recent weeks, the administration has stepped up its targets, pushing to increase their arrests from about 660 to 3,000 a day. \n\nTo do that, they have widened their net, targeting not just criminals but workplaces where many undocumented workers do jobs that are vital for the economy - from farming to factory work - and pay taxes.\n\n\"Just go out there and arrest illegal aliens,\" Stephen Miller, a top White House adviser, reportedly told Immigration and Customs Enforcement officials before they launched the recent LA raids. \n\nAccording to the Wall Street Journal, he told them they did not need to produce target lists of suspected illegal immigrants, a longstanding practice, and should instead raid major businesses to arrest as many as possible.","url":"https://www.bbc.com/news/articles/czxylvq392xo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/08d7/live/0262a570-4715-11f0-8237-9166e28c0c6f.jpg","video":null,"publish_date":"2025-06-12 00:43:51","author":"Christal Hayes, Max Matza, John Sudworth & Alex Lederman","authors":["Christal Hayes, Max Matza, John Sudworth & Alex Lederman"],"language":"en","source_country":"gb","sentiment":-0.024},{"id":330503592,"title":"Exclusive: Houthis Warn US and Israel of 'War' If Iran Attacked","text":"A source within the Ansar Allah movement, also known as the Houthis, has shared with Newsweek a warning to Israel and the United States amid reports of a potential Israeli attack being planned against Iran.Reports Wednesday of U.S. nonessential personnel and family members being evacuated from regional countries, including Iraq, Bahrain and Kuwait, were followed by a Washington Post article citing unnamed officials indicating that the moves were being undertaken in anticipation of an imminent Israeli strike against Iran.Israel's Channel 14 news outlet also reported that the country was preparing to soon launch a major operation against Iran.The soaring tensions follow an Israeli naval strike conducted Tuesday against Ansar Allah, a member of the Iran-led Axis of Resistance coalition that has been engaged in missile and drone attacks against Israel since the outbreak of the war between Israel and the Palestinian Hamas movement in October 2023.Reacting to the reports, an Ansar Allah source told Newsweek that the group had adopted a heightened state of readiness as it was already \"essentially in a state of war with the Zionist enemy entity due to its aggression and siege on Gaza, followed by its aggression against Yemen.\"\"In this regard, we are in a state of constant readiness and are working to escalate our operations against the usurping entity, against the backdrop of the escalating massacres in Gaza and the worsening humanitarian situation there,\" the Ansar Allah source said.The Ansar Allah source also issued a warning to the U.S. should it pursue actions targeting the group or its Iranian ally.\"We are also at the highest level of preparedness for any possible American escalation against us,\" the Ansar Allah source said. \"Any escalation against the Islamic Republic of Iran is also dangerous and will drag the entire region into the abyss of war.\"\"America has no right to attack the countries of our community and our region in service of the Zionist enemy entity, which is considered the primary security threat to the region,\" the source added. \"It is certainly not in the interest of the American people to become involved in a new war in service of the Zionist entity.\"Newsweek has reached out to the Iranian Mission to the United Nations, the Israel Defense Forces and U.S. Central Command for comment.The developments come amid new uncertainties surrounding ongoing nuclear negotiations between Washington and Tehran, which were set to enter their sixth round in Oman on Sunday.Iranian officials were expected to counter an existing U.S. offer at the meeting, with Iranian Foreign Ministry spokesperson Esmaeil Beghaei calling the current terms \"unacceptable\" on Monday.That same day, President Donald Trump also indicated that Iran's response thus far had been \"unacceptable.\" He then told the \"Pod Force One\" podcast that he was becoming \"less confident\" in the likelihood of reaching a successful deal.Yet sources cited by Axios and CNN indicated that Trump had once again discouraged Israeli Prime Minister Benjamin Netanyahu from taking military action against Iran when they spoke on Monday.Trump has indicated on at least two previous occasions that he had called on the Israeli premier not to conduct attacks on Iran while negotiations were ongoing.The U.S. leader also reached a bilateral agreement with Ansar Allah last month, after which the Yemeni group halted an unprecedented maritime campaign targeting international civilian vessels and U.S. military warships on hundreds of occasions.Yet Ansar Allah has pressed on with direct attacks against Israel, most recently launching a ballistic missile Wednesday just hours after the Israeli Navy targeted Yemen's Al-Hodeidah port in response to earlier attacks from the group.Iranian Foreign Minister Abbas Araghchi struck a more positive note regarding nuclear talks on Tuesday, saying that Trump's repeated vow to prevent Iran from obtaining a nuclear weapon \"is actually in line with our own doctrine and could become the main foundation for a deal.\"\"As we resume talks on Sunday, it is clear that an agreement that can ensure the continued peaceful nature of Iran's nuclear program is within reach—and could be achieved rapidly,\" Araghchi, who is leading the Iranian delegation at the talks, said in a statement published to X, formerly Twitter.\"That mutually beneficial outcome relies on the continuation of Iran's enrichment program, under the full supervision of the IAEA [International Atomic Energy Agency], and the effective termination of sanctions,\" he added.The statement came as the Iranian Intelligence Ministry threatened to release a trove of documents purported to be tied to Israel's own nuclear weapons, an arsenal that Israeli officials have for decades neither confirmed nor denied possessing. Iran's Supreme National Security Council warned Israeli nuclear sites would be targeted in the event that Iran's nuclear infrastructure was subject to attack.On Wednesday, Iranian Defense Minister Aziz Nasirzadeh warned U.S. military positions would also be hit in the event of a preemptive strike.\"Some officials on the other side threaten conflict if negotiations don't come to fruition,\" Nasirzadeh said, as cited by Reuters. \"If a conflict is imposed on us ... all U.S. bases are within our reach and we will boldly target them in host countries.\"","summary":"A Houthi source told Newsweek that any attack on Iran \"will drag the entire region into the abyss of war\" amid escalation tension.","url":"https://www.newsweek.com/exclusive-houthis-warn-us-israel-war-if-iran-attacked-2084306","image":"https://d.newsweek.com/en/full/2661425/houthi-fighters-march-yemen.jpg","video":null,"publish_date":"2025-06-12 00:43:26","author":"Tom O'connor","authors":["Tom O'connor"],"language":"en","category":"politics","source_country":"US","sentiment":0.071},{"id":330501948,"title":"Star Wars, Simpsons and Spy Kids: Trump and Gavin Newsom locked in bizarre LA protests meme battle","text":"The Los Angeles protests have prompted a number of highly unusual developments — from the president sending in the Marines and National Guard troops for a domestic law enforcement mission over California’s objections, to the White House flirting with invoking the Insurrection Act — but few have been stranger than the meme war underway between California and the Trump administration. \n\nIn recent days, both sides have posted a flurry of memes on X mocking the other, in parallel with more serious clashes like California suing the administration over the National Guard deployment. \n\nFor his part, California Governor Gavin Newsom’s office has shared posts mocking Homeland Security Secretary Kristi Noem’s love of wearing law-enforcement tactical gear, as well as memes comparing Donald Trump and White House deputy Stephen Miller to villains from the Star Wars franchise, and brushing off a critical video from Trump ally and actor Jon Voight using a common meme from The Simpsons, featuring an image of a newspaper with the headline, ‘Old Man Yells At Cloud.’\n\nThe Trump administration, which regularly bashes critics online from government accounts, has used similar tactics.\n\nIn one post, the Department of Homeland Security borrowed a GIF featuring high-tech magnifying sunglasses from the Spy Kids movies to insinuate they would try to deport a popular fashion writer who has criticized the administration’s position towards undocumented migrants.\n\nIn another, in a response to a Star Wars-themed meme from Newsom, DHS drew from The Simpsons using a common meme format with the caption, ‘Don’t make me tap the sign,’ in this case pointing to an X post that read, “Liberals don’t know things. They don’t read history, they don’t obsess over stats, the few data points they do see they forget.”\n\nThe online jousting is part of a more serious and alarming divide between state and federal Republican officials over the direction of the crisis. \n\nLos Angeles Mayor Karen Bass and Los Angeles Police Chief Jim McDonnell have described being shut out of regular communications around federal troop movements in response to the protests, while Newsom’s office is suing over the Guard deployment.\n\nNewsom, when he’s not trolling, has alternated between grave warnings that two branches of government have been “lost to Trumpism“ and dares to “tough guy” federal officials to arrest him, after White House border czar Tom Homan said anyone who impedes immigration enforcement could end up behind bars.\n\nOn Capitol Hill, meanwhile, House Speaker Mike Johnson has said Newsom should be “tarred and feathered” over his handling of the protests and accused Newsom of being more interested in appearances than maintaining law and order. The California governor is widely thought to be interested in a 2028 presidential campaign.\n\nInside the White House, administration officials are reportedly thrilled with how the standoff has played out before the nation, believing images from the protests reinforce their claims that migrants are dangerous and Democrats are weak on law and order issues.\n\n“We couldn’t have scripted this better,” a senior White House aide told The Atlantic of the dynamic inside the Oval Office. “It’s like the 2024 election never ended: Trump is strong while Democrats are weak and defending the indefensible.”\n\nTrump has raised the temperature in other ways, including giving a fiery partisan speech about the crisis before cheering active-duty soldiers at Fort Bragg, which critics said broke with longstanding norms separating the military from politics.\n\nThe mocking clashes, while highly unusual for taking place during a national crisis, likely grow from both sides’ increasing attempts to win over the media landscape as a means of dominating the political one.\n\nDonald Trump has long used social media as his main mouthpiece — he owns his own platform, after all — and his administration has embraced memes and AI throughout its second term, including hopping on the Studio Ghibli-style AI cartoon trend to mock a Dominican woman it was deporting. \n\nNewsom, perhaps the most prominent Democrat outside of Washington, also has long used media to position himself as a key face squaring off against Trump and other top Republicans, whether it was debating Florida Governor Ron DeSantis on Fox News on Fox News, or launching a podcast this year where he has sparred with influential conservative voices.\n\nWhatever the rationale behind the strategy, it seems protests over the administration’s immigration policies are here to stay. \n\nThey’ve spread to at least 35 cities across the U.S. and have resulted in hundreds of arrests.","summary":"The administration and the governor have locked horns in courts, in back-and-forth statements, and, increasingly, with memes","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-gavin-newsom-la-protest-memes-b2768466.html","image":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/15/in-fact.jpg?width=1200","video":null,"publish_date":"2025-06-12 00:40:07","author":"Emma Snaith,Josh Marcus","authors":["Emma Snaith","Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":0.297},{"id":330502812,"title":"World News | Troops Begin Detaining Immigrants in National Defense Zone at Border in Escalation of Military Role","text":"El Paso (Texas), Jun 12 (AP) US troops have begun directly detaining immigrants accused of trespassing on a recently designated national defence zone along the southern US border, in an escalation of the military's enforcement role, authorities said on Wednesday. US Army Lieutenant Colonel Chad Campbell described in detail the first detentions by troops last week of three immigrants accused of trespassing in a national defence area near Santa Teresa, New Mexico. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. Those migrants were quickly turned over to US Customs and Border Protection and are now among more than 1,400 migrants to have been charged with illegally entering militarised areas along that border, under a new border enforcement strategy from President Donald Trump's administration. Troops are prohibited from conducting civilian law enforcement on US soil under the Posse Comitatus Act. But an exception known as the military purpose doctrine allows it in some instances. Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. Authorities \"noticed three individuals crossing the protective barrier into the United States,\" Campbell said. \"“A Department of Defense response went to interdict those three individuals, told them to sit down. ... In a matter of three minutes, border patrol agents came in to apprehend. So that three minutes is that temporary detention\" by the military. Trump has designated two national military defence areas along the southern US border for New Mexico and a 97-kilometre stretch of western Texas, from El Paso to Fort Hancock, while transferring much of the land from the Interior Department to oversight by the Department of Defense for three years. The Trump administration plans eventually to add more militarised zones along the border, a military spokesman said on Wednesday at a news conference in El Paso. \"We have been very clear that there will be additional National Defence Areas across the southern border,\" said Geoffrey Carmichael, a spokesperson for an enforcement task force at the southern border. \"I won't speculate to where those are going to be.\" Proponents of the militarised zones, including federal prosecutors, say the approach augments traditional efforts by Customs and Border Protection and other law enforcement agencies to secure the border. \"These partnerships and consequences exist so that we can promote the most humane border environment we've ever had,\" El Paso sector Border Patrol Chief Agent Walter Slosar said. \"We are dissuading people from entering the smuggling cycle ... to make sure that smugglers cannot take advantage of individuals who are trying to come into the United States.\" Defence attorneys — and judges in some instances — are pushing back against the novel application of national security charges against immigrants who enter through those militarised zones — and carry a potential sentence of 18 months in prison on top of a possible six-month sentence for illegal entry. A judge in New Mexico has dismissed more than 100 national security charges against immigrants, finding little evidence that immigrants knew about the national defence areas. Those migrants still confronted charges of illegal entry to the US. In Texas, a Peruvian woman who crossed the US border illegally was acquitted of unauthorised access to a newly designated militarised zone in the first trial under the Trump administration's efforts. US Attorney Justin Simmons, who oversees western Texas, vowed to press forward with more military trespassing charges. \"We're gonna keep going forward on these NDA charges,\" Simmons said. \"We are gonna still bring them, we may win on them, we may not. ... At the end of the day, you are not going to be allowed to stay in this country if you enter this country illegally.\" Greater military engagement at the border takes place at the same time dozens of mayors from across the Los Angeles region banded together on Wednesday to demand that the Trump administration stop the stepped-up immigration raids that have spread fear across their cities and sparked protests across the US. Trump has authorised the deployment of an additional 2,000 National Guard members to respond to immigration protests in LA. That directive brings the total number of Guard put on federal orders for the protests to more than 4,100. The Pentagon had already deployed about 700 Marines to the protests to the city. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   US troops have begun directly detaining immigrants accused of trespassing on a recently designated national defence zone along the southern US border, in an escalation of the military's enforcement role, authorities said on Wednesday.","url":"https://www.latestly.com/agency-news/world-news-troops-begin-detaining-immigrants-in-national-defense-zone-at-border-in-escalation-of-military-role-6921719.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:40:07","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.072},{"id":330505156,"title":"It was always going to be a tightrope walk... Now Albo has everything on the line when he meets Donald Trump this weekend: PETER VAN ONSELEN","text":"It was always going to be a tightrope walk... Now Albo has everything on the line when he meets Donald Trump this weekend: PETER VAN ONSELEN\n\nREAD MORE: AUKUS plan at risk \n\nBy PETER VAN ONSELEN, POLITICAL EDITOR FOR DAILY MAIL AUSTRALIA\n\nPublished: 01:35 BST, 12 June 2025 | Updated: 01:35 BST, 12 June 2025\n\nAnthony Albanese is expected to meet US President Donald Trump during the G7 Leaders’ Summit in Canada, starting in three days time. And boy are there some big issues likely to be on the agenda, starting with the AUKUS agreement. \n\nAustralia’s ambitious plan to enhance its naval capabilities through the AUKUS partnership faces renewed uncertainty as the United States launches a comprehensive review of the agreement. \n\nAssuming their meeting still happens it will be the first face-to-face encounter between the PM and Trump since the US President was elected.\n\nIt’s only been a matter of months since Trump has been back in charge, and he’s already seeking to reassert a combative vision of American power globally. How Albo reacts to Trump when they meet will test the PM’s ability to defend national interests without undermining the alliance.\n\nUnder the AUKUS pact, Australia is set to acquire between three and five Virginia-class nuclear-powered submarines from the US. \n\nHowever, questions have arisen about the US industrial base’s capacity to produce the subs without compromising its own needs.\n\nThe review is being led by Under Secretary of Defense Elbridge Colby, a known skeptic of the pact. Its terms of reference include assessing whether the AUKUS agreement aligns with President Trump’s America First policy.\n\nColby has previously questioned the wisdom of transferring critical assets like the Virginia-class submarines to US allies, suggesting it could weaken America’s naval strength.\n\nDonald Trump shocked the Australian defence establishment with his administration announcing a review into the AUKUS submarines project\n\nAnthony Albanese has nothing short of the future of the defence of Australia on his plate when he meets Trump in person - in a meeting expected this weekend \n\nDeputy PM and Defence Minister Richard Marles has attempted to downplay the significance of the review, describing it as a natural step to ensure alignment with US defence priorities. \n\nBut it will certainly be on the top of the agenda when Albo and Trump meet. The PM will want to be able to say that he has received assurances that the agreement is iron clad. \n\nThe question of defence spending also isn't clear cut. Trump’s supporters in the US have floated a 3.5 per cent of GDP benchmark they want Australia’s defence spending to rise to. \n\nGiven that it’s currently only at 2.4 per cent (including across forward estimates stretching all the way out to 2034), to lift our defence spending in line with US expectations would be fiscally reckless without cuts being made elsewhere.\n\nThe Australian budget is already forecast to be in deficit for the coming decade, with gross national debt at the trillion dollar mark.\n\nWhile some domestic foreign policy hawks are independently pushing for higher defence spending, the figure team Trump wants us to meet is unrealistic for a country that faces no direct military threat and is unlikely to anytime soon.\n\nEqually, social spending pressures are mounting. The recent election campaign included a raft of new spending promises, with recurrent spending on policies such as the NDIS already a strain on the budget. To increase defence spending in that climate is unlikely to be popular.\n\nBesides, Australia’s commitment to spend $368 billion on the AUKUS submarine program should be more than enough to signal that we take our defence and alliance duties seriously. \n\nAustralia has committed to spend $368 billion on the submarine program. You would think that would be enough to signal the country is taking its defence obligations seriously\n\nAnother volatile topic expected to come up at Albo’s meeting with Trump is trade. The US President’s across-the-board 10 per cent tariff on imports is economic vandalism dressed up as nationalism, and Australia currently isn’t exempt. It’s a regressive policy that punishes allies and undermines the very order the US once built.\n\nAlbanese has been unusually forthright on this issue, condemning the move and seeking exemptions. Whether he can actually secure them is another matter, and depends less on the logic of his arguments than it does on Trump’s whims. \n\nIf the meeting achieves anything it will be to gauge whether the President is open to pragmatism rather than simply doubling down on his new found protectionism.\n\nFinally, the beef issue is deceptively niche but symbolically important for Australia. For decades, we have maintained biosecurity restrictions on US beef imports, particularly those involving supply chains running through countries with a history of mad cow disease.\n\nWashington wants access to the Australian market but the government is firm in saying no way. Albanese has so far been unequivocal that protecting Australia’s disease-free status is non-negotiable.\n\nThe blunt rejection of US demands for access is all about Australia retaining its access to high-value export markets like Japan and Korea, which is dependent on our gold-standard reputation for safe meat.\n\nIn all of these areas of discussion the real test for Albanese when he meets Trump Mark II for the very first time is to show resolve in the face of Trump's tendency to dominate and distract. \n\nVoters won’t necessarily remember every talking point, or the finer details of what gets discussed. But they will notice if their Prime Minister looks like he blinked and Trump got the better of him.\n\nShare or comment on this article:\nIt was always going to be a tightrope walk... Now Albo has everything on the line when he meets Donald Trump this weekend: PETER VAN ONSELEN\n\nAdd comment","summary":"Assuming it happens it will be the first face-to-face meeting between the pair since Trump's return to the presidency.","url":"https://www.dailymail.co.uk/news/article-14796395/albanese-trump-meeting.html","image":"https://i.dailymail.co.uk/1s/2025/06/12/01/99285021-0-image-a-10_1749688258023.jpg","video":null,"publish_date":"2025-06-12 00:35:23","author":"Editor,Peter van Onselen","authors":["Editor","Peter van Onselen"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.164},{"id":330502804,"title":"World News | Oregon Wildfire Closes Nearly 20 Miles of Interstate in Columbia River Gorge","text":"The Dalles (Oregon), Jun 12 (AP) A wildfire in Oregon prompted officials to close nearly 32 kilometres of an interstate in the Columbia River Gorge on Wednesday as smoke obscured visibility and fire crews responded to the blaze. The Oregon Department of Transportation said Interstate 84 was closed between Hood River and The Dalles. Hood River, a popular tourist destination about 89 kilometres east of Portland, is home to some 8,000 people, and more than 15,000 people live in The Dalles further east. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. Photos shared by the department showed flames burning alongside and in the median of the highway as wind gusts fanned smoke. A water-dropping helicopter and a plane dropping fire retardant helped fight the fire from above. The fire broke out on Wednesday. Department spokesperson David House said in an email that the interstate will be closed indefinitely, \"due not only to the wildfires but also due to the extreme danger of driving in smoke.\" Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. Evacuations were ordered northwest of The Dalles, including along I-84 and areas further inland, according to the Wasco County Sheriff's Office. Two temporary shelters, including one at a middle school, are set to be opened in The Dalles, the sheriff's office said. Washington state's transportation department said a separate brush fire has closed 13 kilometres of State Route 14, which also runs along the Columbia River. Authorities urged people travelling in the area to use alternate routes. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A wildfire in Oregon prompted officials to close nearly 32 kilometres of an interstate in the Columbia River Gorge on Wednesday as smoke obscured visibility and fire crews responded to the blaze.","url":"https://www.latestly.com/agency-news/world-news-oregon-wildfire-closes-nearly-20-miles-of-interstate-in-columbia-river-gorge-6921713.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:32:08","author":null,"language":"en","source_country":"in","sentiment":-0.407},{"id":330504370,"title":"Another nuclear renaissance, even as San Onofre is torn down?","text":"Before we delve into detail on the teardown of the San Onofre Nuclear Generation Station (and the community meeting on same slated for Thursday, June 12), let’s pull back for an ironic wide shot, shall we?\n\nIn May, as workers were cutting the machinery inside San Onofre’s iconic domes to pieces, President Donald Trump was signing four executive orders to goose the growth of nuclear power in the United States.\n\nThe EO titled “Reinvigorating the Nuclear Industrial Base” aims to secure energy independence and strengthen national security by speeding up reactor licensing and expanding the domestic nuclear fuel supply chain.\n\nAnother, “Deploying Advanced Nuclear Reactor Technologies for National Security,” requires “the rapid development, deployment and use of advanced nuclear technologies” such as next-generation, small modular- and micro- reactors, including at U.S. military bases.“Ordering the Reform of the Nuclear Regulatory Commission” launches a top-to-bottom review of regulations, attacking the agency and, one could argue, the science it’s built on: “Instead of efficiently promoting safe, abundant nuclear energy, the NRC has instead tried to insulate Americans from the most remote risks without appropriate regard for the severe domestic and geopolitical costs of such risk aversion….”\n\nAnd, finally, “Reforming Nuclear Reactor Testing at the Department of Energy” seeks to jump-start the national laboratory process for testing next-generation reactors, speeding up review and approval for those under the DOE’s jurisdiction.\n\nAnother nuclear renaissance! A “hot industry… a brilliant industry,” Trump said upon signing the orders. Don’t feel too bad if you missed all this; there are far too many rings in our political circus as of late, and it’s unclear if this nuclear renaissance will be any more successful than past nuclear renaissances. It may be worth noting, however, that the NRC approved NuScale Power LLC’s US460 small modular reactor design just days after the executive orders were signed.\n\nAnyway, we’ve been heading in the exact opposite direction since San Onofre’s reactors powered down in 2012. The volunteer San Onofre Community Engagement Panel meets from 5:30 to 7:30 p.m. Thursday June 12 for an update on all that, and you can stream it via the Microsoft Teams link at https://bit.ly/44c0A4X.\n\nEmergency preparedness is top of the agenda, but since atoms are no longer being split at San Onofre — it’s essentially a waste storage site — the realm of imaginable emergencies has shrunken considerably.\n\n“With the reactors retired and all spent nuclear fuel in a passive dry storage facility, there are no credible accident scenarios that would result in an offsite release of radiological material,” operator Southern California Edison says in a slide presentation released prior to the June 12 meeting. “Even with the lower risk profile, a robust emergency plan remains in place at San Onofre with support from state and local agencies.”\n\nAt that meeting, officials from the Orange County Emergency Management Division, San Diego County Office of Emergency Services and Edison are expected to walk folks through response plans and April’s emergency drills.\n\nIn other safety news, Edison reassessed the depth of the largest scratch on a waste canister, which is now entombed in its Holtec dry storage system. The scratch was caused by contact with seismic restraints.\n\nInspection back in 2019 estimated the scratch to be about 0.026 inches deep — not deep enough to require remediation. Last year, it inspected the scratch again, and found it to be less than half as deep — 0.011 inches, Edison said.\n\n“Scratches are still bright and shiny, no evidence of corrosion or chloride-induced stress corrosion cracking precursor activity,” it said. “Scratches are all shallow and not a challenge to the integrity of the canisters. No action required.”\n\nEdison will inspect its test canister, which does not contain nuclear waste, in 2027, and will inspect the test canister and two more canisters in 2029.\n\nOn the seismic front, the April 14 earthquake in Julian rated 0.0135g — which is to say not much — at San Onofre, Edison said. San Onofre’s dry storage system is built to withstand more than 100 times the force of that (1.5g).\n\nLow levels of tritium were found in ground water last year, and the latest monitoring showed that concentrations have declined along the western side of Unit 2. The suspected source is Unit 2’s main steam isolation valve trench, Edison said, which is no longer used for water with tritium in it. Remediation isn’t warranted, and enhanced monitoring will continue until levels fall below detection limits, Edison said.\n\nDemolition update\n\nThe tear-down is on track to wrap up in 2028 or thereabouts.\n\nA recent accounting showed that 46 of the site’s 62 buildings have been demolished; 474 million pounds of waste have been shipped offsite; 107 million pounds of decommissioning material have been recycled; and 1,787 rail cars have been used.\n\nMost large components inside the iconic domes have been removed, and final cut-up of steam generators and reactor vessels will be complete by year end. Then, those domes will come down, with that slated for completion in mid-2027.\n\nWe asked Edison if it had any thoughts to share about the new push for nuclear power, even as San Onofre is dismantled.\n\nNone of that really impacts California, spokesperson Liese Mosher said, because California’s moratorium on new nuclear power includes even small nuclear reactors. While Edison does believe nuclear generation can provide a small footprint, and has the flexibility to be sited close to demand, “next-generation technologies need stronger state and federal support to scale, resolve permitting issues, and address safety concerns including waste disposal,” she said.\n\n“The executive orders do include direction for the relevant agencies to develop a national strategy to deal with spent nuclear fuel, which could aid in the eventual removal of spent fuel from SONGS (San Onofre Nuclear Generation Station) and restoring the site and returning it to the Navy and Marines.”\n\nThe sooner that 3.6 million pounds of waste leaves the bluff over the blue Pacific the better. But we won’t hold our breath.","summary":"Columnist Teri Sforza: Emergency preparedness, canister scratches, earthquake safety on Community Engagement Panel agenda","url":"https://www.ocregister.com/2025/06/11/another-nuclear-renaissance-even-as-san-onofre-is-torn-down/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/songs-slide-3-e1749674408550.jpg?w=950&h=605","video":null,"publish_date":"2025-06-12 00:30:55","author":"Teri Sforza","authors":["Teri Sforza"],"language":"en","category":"politics","source_country":"US","sentiment":-0.266},{"id":330501282,"title":"California Governor Gavin Newsom Using Fight Against Trump Over LA Riots To Bolster 2028 Battle?","text":"California Governor Gavin Newsom Using Fight Against Trump Over LA Riots To Bolster 2028 Battle?California Governor Gavin Newsom Using Fight Against Trump Over LA Riots To Bolster 2028 Battle?\n\nLast Updated:June 12, 2025, 06:00 IST Crux WorldPresident Donald Trump’s recent order to deploy thousands of National Guard troops and Marines to Los Angeles marks a stark escalation in his ongoing political battle against California’s Democratic Governor Gavin Newsom. This move is not merely about immigration enforcement - it is a calculated political gambit designed to energize Trump’s base by exploiting immigration as a potent issue. Simultaneously, Trump is also undermining a key Democratic foil in a deeply blue state. n18oc_world n18oc_crux\n\nGet breaking news, in-depth analysis, and expert perspectives on everything from geopolitics to diplomacy and global trends. Stay informed with the latest world news only on News18. Download the News18 App to stay updated!\n\nRelated Videos Trump Says LA Would Be 'Burning To The Ground' Without Troops, Marines And National Guard Move In ‘Clashes Were Limited Until…’ Newsom Accuses Trump of ‘Militarising’ LA Amid Anti-ICE Protests | US Los Angeles Imposes Curfew Amid Rising Protests Over Trump’s Immigration Crackdown California Governor Plans To Sue \"Dictator\" Trump Over National Guard Deployment In Riot-Hit LA | US Trump Deploys 2,000 National Guard To LA Over Governor’s Objections To Quell Anti-ICE Protests | US Trump Says LA Would Be 'Burning To The Ground' Without Troops, Marines And National Guard Move In ‘Clashes Were Limited Until…’ Newsom Accuses Trump of ‘Militarising’ LA Amid Anti-ICE Protests | US Los Angeles Imposes Curfew Amid Rising Protests Over Trump’s Immigration Crackdown California Governor Plans To Sue \"Dictator\" Trump Over National Guard Deployment In Riot-Hit LA | US Trump Deploys 2,000 National Guard To LA Over Governor’s Objections To Quell Anti-ICE Protests | US Trump Says LA Would Be 'Burning To The Ground' Without Troops, Marines And National Guard Move In ‘Clashes Were Limited Until…’ Newsom Accuses Trump of ‘Militarising’ LA Amid Anti-ICE Protests | US Los Angeles Imposes Curfew Amid Rising Protests Over Trump’s Immigration Crackdown\n\nhomevideosCalifornia Governor Gavin Newsom Using Fight Against Trump Over LA Riots To Bolster 2028 Battle?","summary":"President Donald Trump’s recent order to deploy thousands of National Guard troops and Marines to Los Angeles marks a stark escalation in his ongoing political battle against California’s Democratic Governor Gavin Newsom. This move is not merely about immigration enforcement - it is a calculated political gambit designed to energize Trump’s base by exploiting immigration as a potent issue. Simultaneously, Trump is also undermining a key Democratic foil in a deeply blue state. n18oc_world n18oc_crux","url":"https://www.news18.com/videos/world/california-governor-gavin-newsom-using-fight-against-trump-over-la-riots-to-bolster-2028-battle-9380981.html","image":"https://images.news18.com/ibnlive/uploads/2025/06/1749688802_17d1a174-7c97-4dbd-9d85-a8a8b3f6f382.jpeg","video":null,"publish_date":"2025-06-12 00:30:21","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.107},{"id":330501304,"title":"US trade pact set for early finish: Piyush Goyal","text":"India and the US are on track to seal a trade agreement before the deadline of fall 2025 set by PM Narendra Modi and President Donald Trump, commerce and industry minister Piyush Goyal told ET in an interview. Goyal, who is on a four-day visit to Switzerland and Sweden, said the rare earth magnet supply squeeze by China is a wakeup call. Edited excerpts: Trade has now acquired a geopolitical dimension. How can India secure its interests? Today, India is sitting on the high table. We have free trade agreements (FTAs) with most developed nations—Japan and Korea, Australia, UAE, the four EFTA (European Free Trade Association) countries.The FTA with the UK has already closed. We are in active dialogue with the US for a bilateral trade agreement, with the European Union for a free trade agreement… with Peru, Chile, and Oman. The entire world recognises India’s growing strength.'Perfect Opportunity'The world recognises the decisive leadership Prime Minister Modi brings to the table and the opportunity of associating with the fastest growing large economy, which is expected to grow from $4 trillion to $5 trillion. It’s a perfect opportunity. And, I think, no country would like to miss it.India is in talks for multiple FTAs, some with advanced economies. How is the government preparing Indian industry to ensure that they can take advantage of these agreements? Also, are there policy interventions that are required to help them do so?For the last 11 years of the Modi government, focus has been on ease of doing business, deregulating the economy, making it less difficult to meet regulatory compliances, and decriminalising our laws. He launched Make in India to encourage investments in the manufacturing sector. We have created a framework within the country with strong macroeconomic fundamentals. The government is ensuring that demand in the country remains robust and grows so that investors from around the world feel interested in working in India. I think the perfect foundation has been laid. Now with these free trade agreements, continuity, stability and predictability of policy will be available for our industry in advanced and developed economies, which is important for investment or business.A case in point is the global capability centres (GCCs). During Covid, the nimbleness with which Prime Minister Modi adapted policy to ensure continuity of business earned India the tag of a trusted partner. All the work that people realised could be done working from home can also be done working from India. That's opened up a plethora of opportunities in terms of jobs. Millions of Indians are now working in GCCs. They're earning us billions of dollars of foreign exchange, adding to our construction and real estate ecosystem, providing tertiary jobs. Nearly 2,000 of them are in India today. Where are we on the US trade agreement and is the baseline 10% tariff a sticking point?We don’t negotiate through the press. We negotiate on the negotiating table.When can we expect the deal to come through?We (US and India) are both committed to a bilateral trade agreement. Our leaders have set a task of completing the BTA by fall 2025. We are well on track to complete it before that.Supply chains are facing new challenges. The rare earth magnet issue has again brought into focus the issue of secure supply chains. What is India planning to do to ring-fence its industry?It is a wake-up call not just for Indian businesses but for businesses around the world. And this wake-up call will help all supply chains to reassess their resilience and their dependability on certain geographies. This will prompt them to look for trusted partners. For India, while we may have a problem with permanent magnets in the short run, we are already engaged with industry and with our startup ecosystem to find solutions. Even during the course of my stay in Switzerland, we discussed with some companies how they are coming around to address this problem. And I assure you that we are solving this problem. But this wake-up call will help people reassess the resilience of their supply chains and surely attract business to India. IT services exports have helped make up the goods trade deficit. Is AI a threat to our services exports?Certainly, some work and jobs will get impacted by AI. We cannot deny that. But we cannot cry over that, we have to find solutions. We have to adopt AI. We have to learn and retrain our people to be able to engage with AI. We have to leverage AI to our advantage so that instead of the current work that we are doing, we’ll probably do even higher value-added work. At the end of the day, I believe the human mind is always supreme, because AI is largely dependent on what you feed into the system. I think there will be a rejig in the way work is done. There will be a need to retrain and reskill our people, but end of the day, I can assure you, India will come out the winner even in this.The budget had announced an export promotion mission. How soon is it likely to be unveiled?We have already worked out the areas which will be the focus of the available resources with the ministry. The effort is to promote new exporters, look at new markets and new products. The budget and the resources will help, particularly our MSME sector, our job generating sectors, our farmers, and to expand in the international markets.(The reporter was in Switzerland and Sweden at the invitation of the commerce and industry ministry)","summary":"India and the US are progressing towards a trade agreement. The target is before fall 2025. Piyush Goyal highlights India's strong position with existing FTAs with various nations. Discussions are ongoing with the US, EU, Peru, Chile, and Oman for further trade agreements. Goyal notes the world recognizes India's growing economic strength.","url":"https://economictimes.indiatimes.com/news/economy/foreign-trade/us-trade-pact-set-for-early-finish-piyush-goyal/articleshow/121786863.cms","image":"https://img.etimg.com/thumb/msid-121786859,resizemode-4,width-1200,height-900,imgsize-45810,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-12 00:30:00","author":"Deepshikha Sikarwar","authors":["Deepshikha Sikarwar"],"language":"en","source_country":"in","sentiment":0.162},{"id":330499884,"title":"US authorizes partial evacuation of Middle East embassies amid Iran tensions","text":"The US has begun evacuating non-essential personnel and family members from its embassies and military bases in the Middle East amid escalating tensions with Iran.\n\nThe move follows President Donald Trump’s accusation that Tehran is “slow-walking” negotiations.\n\n“Based on our latest analysis, we decided to reduce the footprint of our Mission in Iraq,” the State Department said in an emailed statement to the media on Wednesday. Reuters cited a US official as saying that voluntary departures had also been authorized at the embassies in Kuwait and Bahrain.\n\nThe Pentagon has likewise approved the departure of family members from military installations in the region. “CENTCOM is working in close coordination with our Department of State counterparts, as well as our allies and partners in the region, to maintain a constant state of readiness to support any number of missions around the world at any time,” a defense official told reporters.\n\nAccording to the Washington Post, American intelligence officials are concerned that Israel may strike Iranian nuclear facilities without US consent. Prime Minister Benjamin Netanyahu’s office dismissed reports last month that Israel was discussing potential strikes with Trump as “fake news.”\n\nIn an interview with the New York Post aired on Wednesday, Trump said he was “less confident” about reaching a deal with Iran, after five rounds of negotiations mediated by Oman failed to produce a breakthrough. The president has previously said he wants to completely dismantle Iran’s nuclear program – something Tehran has firmly rejected.\n\n“Iran is not seeking a nuclear weapon, and US militarism only fuels instability,” the Iranian mission to the UN said in a statement on X. Defense Minister Aziz Nasirzadeh warned that Iran would “target all US bases across the region without hesitation” if attacked.\n\nTrump withdrew the US from the 2015 UN-backed nuclear agreement during his first term, accusing Iran of secretly violating its terms. Tehran has denied the allegations but has since scaled back its commitments and expanded its stockpile of enriched uranium.","summary":"The US is partially evacuating its embassies and military outposts in the Middle East \nRead Full Article at RT.com","url":"https://www.rt.com/news/618990-us-evacuates-embassies-bases/","image":"https://mf.b37mrtl.ru/files/2025.06/article/684a1eed2030277dc772d938.jpg","video":null,"publish_date":"2025-06-12 00:29:44","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":0.305},{"id":330504008,"title":"Trump And Musk Feud: A Case For Keeping Business And Politics Separate (2)","text":"T his dramatic endorsement was part of Trump’s attempt to shield Musk from the backlash he faced after heading the Department of Government Efficiency (DOGE)—an agency created to cut government costs. Musk’s involvement in laying off public sector workers had angered many Americans, some of whom responded by boycotting and even vandalizing Tesla cars. This public outrage con-tributed significantly to Tesla’s financial decline.\n\nOn one particularly devastating day, Musk reportedly lost $34 billion in market value, and Tesla’s total losses since Musk became directly involved in politics are estimated at over $150 billion. His decision to blend business with poli-tics—becoming an active player in public gover-nance—appears to have backfired, both for his companies and his personal wealth.\n\nDespite his high-profile role and disruptive efforts, Musk’s agency, DOGE, was only able to reduce U.S. government spending by a mere 1%. Likewise, Trump’s relentless attempts to reverse Tesla and SpaceX’s downward trajectory yielded little success. The damage to Musk’s public image as the face of mass layoffs and agency closures proved too great to overcome.\n\nDOGE, as the name implies, was Trump’s initiative to curb federal spending as part of his broader goal to reduce America’s ballooning bud-get deficit and national debt—now estimated at over $36 trillion. However, this ambition is not new. Past presidents like Ronald Reagan (40th) and Bill Clinton (42nd) also established similar budget reform initiatives.\n\nIn the end, the Trump-Musk clash offers far more than tabloid drama. It serves as a caution-ary tale about the dangers of blurring the lines between politics and business, and highlights the global double standards that often disadvantage less powerful nations. The same Western systems that lecture developing countries on austerity and public subsidies are themselves deeply in-tertwined with state-backed corporate interests.\n\nNotably, the efforts by past U.S. administra-tions to reduce the cost of governance mirror the current situation between Trump and Musk. Under President Ronald Reagan, a similar initia-tive was launched with the creation of the Grace Commission—officially called the President’s Private Sector Survey on Cost Control. It was led by J. Peter Grace, a prominent CEO of W.R. Grace and Company. The commission aimed to identify ways to make the federal government more efficient and claimed it could save over $424 billion within three years.\n\nDespite the high expectations, the commis-sion’s recommendations were not fully imple-mented, and critics argue that the actual impact on government efficiency and cost savings was modest at best.\n\nLikewise, during President Bill Clinton’s tenure, his administration introduced a major reform program known as the National Perfor-mance Review (NPR), led by Vice President Al Gore. The NPR was a comprehensive effort to restructure the federal government with a fo-cus on improving efficiency, cutting waste, and delivering better services to citizens. Its vision was to build a government that “works better and costs less.” The initiative resulted in 119 key recommendations, including downsizing agen-cies and eliminating redundant programs. The NPR ultimately claimed to have saved $108 billion and improved government operations while also reducing overhead staffing.\n\nClearly, Trump and Musk are not the first high-profile figures—one from the political world and the other from business—to attempt reforming the American government’s spending habits. Yet, despite their intentions, their part-nership has turned acrimonious. The tension between Trump, intent on “Making America Great Again,” and Musk, determined to inject private-sector efficiency into public service, has spiraled into a toxic feud.\n\nBoth men should recognize that even past col-laborations between top political and business minds—such as Reagan and Grace, or Clinton and Gore—fell short of achieving the kind of transformational government efficiency they envisioned.\n\nTheir failure should offer some perspective and encourage both Trump and Musk to de-esca-late their conflict and move beyond their mutual frustration over their unmet goals.\n\nFollowing their fallout, Tesla’s stock has taken a significant hit. As of last Thursday, it’s reported that Tesla has lost up to $150 billion in market val-ue over the last six months. Meanwhile, Musk’s businesses have reportedly benefited from up to $34 billion in U.S. government contracts—sup-port that could be jeopardized if the feud with Trump continues.\n\nThis raises an important question now be-ing asked by political observers in the U.S.: Can these two power players—once close allies just six months ago, and now adversaries—repair their relationship?\n\nOn what was Musk’s last day in the White House as a government adviser, Trump symbol-ically handed him the “Keys to the White House.” But any illusion of a cordial parting quickly shat-tered when Musk publicly condemned Trump’s signature tax and spending plan—the so-called “Big Beautiful Bill”—as a “disgusting abomina-tion.” Musk’s critique struck a nerve, especially since the bill contradicted the aims of the De-partment of Government Efficiency (DOGE), which Musk had headed in a failed attempt to streamline public spending. His aggressive role in implementing job cuts drew widespread crit-icism, particularly since Musk was unelected and seen as wielding unchecked influence over government workers’ livelihoods.\n\nThis political-business breakdown in the U.S. brings to mind a similar episode in Nige-ria, which illustrates why mixing business with politics is a risky endeavor. After former Vice President Atiku Abubakar left office (1999–2007), his business interests, particularly in Intels—an oil and gas logistics firm he co-founded—suffered a steep decline. Intels had thrived under favor-able government patronage, operating a lucrative private port in Port Harcourt. But after Atiku’s party lost power to the opposition APC in 2015, government contracts dried up.\n\nAs the firm’s financial standing deteriorated, Atiku was forced to sell his equity stake in a bid to keep it afloat. Following his divestment, his spokesman issued a statement to the press, con-firming the exit.\n\n“Yes, he has divested from Intels and redi-rected his investments into other sectors of the economy to generate returns and create jobs.”\n\nReflecting on the ongoing fallout between Donald Trump and Elon Musk, one is reminded of the tragic political journey of Nigerian bil-lionaire-turned-politician, Chief Moshood Kashi-mawo Abiola (MKO). Although the circumstanc-es differ, there are thematic similarities. Abiola, who amassed his fortune primarily through gov-ernment telecommunications contracts—much like Musk’s ties to U.S. government contracts in the tech sector—entered the political arena in 1993 by contesting the presidency. Sadly, his po-litical aspirations ended in tragedy, resulting in the loss of both his wealth and ultimately his life.\n\nWhile Musk hasn’t directly pursued the pres-idency, his veiled threat to back the Democrats in the upcoming election as retaliation against Republicans for passing Trump’s “Big Beautiful Bill” has raised eyebrows. It suggests the possibil-ity that Musk may be positioning himself to in-fluence the outcome of the 2028 elections in favor of the Democrats—just as he was instrumental in helping Trump and the Republicans secure victory in 2024. If so, Musk could be transitioning from a politically interested entrepreneur into an active political player.\n\nIn the present feud between two former al-lies—President Trump, who may have a fragile ego, and Musk, known for his confrontational ap-proach—the stakes are high. Trump, a seasoned political fighter, is unlikely to back down easily, while Musk’s endurance in the face of sustained political and financial pressure remains to be seen. Whether he can absorb continuous blows to his businesses, including Tesla and SpaceX, could determine if the two men will reconcile or drift permanently apart.\n\nPresident Trump, now in his final term, argu-ably has less to lose. However, he still needs the Senate to pass his flagship legislation, the Big Beautiful Bill. Musk’s opposition to the bill is al-ready casting doubt on its swift approval. Encour-agingly, Musk seems to be stepping back from his confrontational stance, as evidenced by his decision to delete a provocative post in which he threatened to begin decommissioning SpaceX’s Dragon spacecraft in response to Trump’s com-ments about canceling government contracts.\n\nThough the U.S. is no Russia, the Trump– Musk standoff evokes parallels with the dra-matic falling-out between Russian President Vladimir Putin and Yevgeny Prigozhin, the late mercenary leader of the Wagner Group. Once close allies, their power struggle escalated into an armed confrontation and ended with Prigozhin’s untimely death in a plane explosion.\n\nThe conflict also mirrors Putin’s past clash-es with influential Russian oligarchs, many of whom were jailed or had their assets seized after falling out with the Kremlin. One such exam-ple is Mikhail Khodorkovsky, the former owner of Yukos Oil, who was imprisoned on charges of tax evasion and other offenses. In response, several Russian oligarchs fled the country, in-vesting their wealth in the West—particularly in the U.K., where Roman Abramovich famously bought Chelsea Football Club. He eventually lost the club following Western sanctions on Russia after its 2022 invasion of Ukraine.\n\nDespite these grim parallels, there is still hope for reconciliation between Trump and Musk. Their personal and political futures would both benefit from de-escalating tensions. Continued verbal and written hostilities—no matter how indirect—could prove damaging to both men, especially as mere words can spark consequences that are irreversible in both business and politics.\n\nDrawing from Nigeria’s own political-busi-ness landscape, we’ve seen high-profile feuds eventually resolved. A case in point is the past fallout between Africa’s richest man, Aliko Dangote, and Nigeria’s third-richest business-man, Femi Otedola. Though their dispute was acrimonious, the two have since rekindled their friendship and now enjoy a closer relationship than before. That precedent gives reason to be-lieve Trump and Musk—two powerful figures who still need each other—might also find a path to reconciliation.\n\nThis optimism is further supported by com-ments from Musk’s father, Errol Musk, who revealed that Elon suffers from Post-Traumatic Stress Disorder (PTSD). If the fallout was, in part, driven by psychological distress and frustration over unmet expectations, healing could begin once emotions settle and rational interests take over.\n\nYet a broader concern remains: If Musk is eventually barred—by legal, institutional, or moral constraints—from using his vast wealth to influence electoral outcomes in the U.S., what prevents him from trying the same approach in other countries, especially in Europe? If he refrains, will other billionaires emulate his strategy, leveraging wealth to influence political outcomes under the maxim that “what money cannot do, more money can”?\n\nUltimately, the Trump–Musk saga offers a valuable lesson for democracies everywhere. It underscores the dangers of blurring the lines between business and politics and raises critical questions about the future of political financing, influence, and accountability in democratic sys-tems.\n\n• Magnus Onyibe, an entrepreneur, public policy analyst, author, democracy advocate, development strategist, an alumnus of the Fletcher School of Law and Diplomacy, Tufts University, Massachu-setts, USA, a Commonwealth Institute scholar and a former commissioner in the Delta State govern-ment, sent this piece from Lagos, Nigeria.","summary":"T his dramatic endorsement was part of Trump’s attempt to shield Musk from the backlash he faced after heading the Department of Government Efficiency (DOGE)—an agency created to cut government&#8230;","url":"https://independent.ng/trump-and-musk-feud-a-case-for-keeping-business-and-politics-separate-2/","image":"https://independent.ng/wp-content/uploads/Untitled-1-410.jpg","video":null,"publish_date":"2025-06-12 00:25:00","author":"Magnus Onyibe","authors":["Magnus Onyibe"],"language":"en","source_country":"ng","sentiment":-0.133},{"id":330504378,"title":"Here’s how current protests compare with those in the past","text":"Tempers flare\n\nA look at the similarities and differences of civil unrest in Southern California over the years.\n\nImmigration raid protests, 2025\n\nMarines and additional National Guard troops arrived in the Los Angeles area on Tuesday, June 10, sent in by President Donald Trump in response to protests over immigration raids despite the objections of the governor and local leaders.\n\nLos Angeles leaders imposed a downtown curfew Tuesday on the fifth day of protests, it is still in place.\n\nAfter persistent questioning from members of Congress on Tuesday, Defense Secretary Pete Hegseth turned to his acting comptroller, Bryn Woollacott MacDonnell, who said it would cost $134 million to send the National Guard and Marines to Los Angeles. She said the money will come from operations and maintenance accounts.\n\nOn Sunday, Los Angeles police said some protesters had thrown concrete projectiles, bottles and other items at police. Los Angeles police say they made more than 100 arrests Monday evening and two officers were injured.\n\nSeveral self-driving cars were set ablaze on a downtown street on Sunday evening as well as several businesses being looted. No fatalities have been reported.\n\nImmigration Customs Enforcement posted the names and convictions of 11 arrested undocumented immigrants in the Los Angeles raids Sunday.\n\nYou can find ICE’s list of what they say are the worst offenders here and here.\n\nIn sanctuary cities, local law enforcement doesn’t notify federal immigration enforcement when those who have been convicted of crimes are set free.\n\nLos Angeles Mayor Karen Bass said in a news conference the ICE raids could continue for the next 30 days. “It’s a sense of intimidation and fear that is just so unnecessary and so corrosive to our city,” Bass said.\n\nYou can find the complete Pew Research Center survey from March on Latino adults fears of deportation here.\n\nOther more violent protests\n\nZoot suit riots, 1943\n\nIn early June, young men who had enlisted to fight in World War II clashed with other young locals in Los Angeles, kicking off what became known as the Zoot Suit Riots. Most of the youth in “zoot suits” were people of color, and their baggy outfits were depicted negatively by the media and the military. Local papers framed the racial attacks as a vigilante response to an immigrant crime wave, and most of the people arrested during the fighting were Latino. The riots didn’t die down until June 8, when military personnel were ordered to stay in their barracks. The week of conflict resulted in no deaths.\n\nMore than 500 arrests.\n\nWatts riots, 1965\n\nThousands of Black people moved to Los Angeles during World War II, often to work in aerospace and other manufacturing jobs. But when the war ended, unemployment — particularly in the Black community — exploded. By the mid-1960s, race relations in the area were strained, as they were in the rest of the nation. A state-mandated investigation after the riots found that the conflict was driven, in part, by long-standing grievances in Watts about high unemployment rates, substandard housing and inadequate schools.\n\nHere’s how it unfolded:\n\nA routine arrest\n\n1. On the night of Aug. 11, near Watts, a White police officer was flagged down by a Black man who told him a man in a white Buick was driving recklessly. Officer Lee W. Minikus pulled over Marquette Frye, a young Black man, on suspicion of driving while intoxicated. Frye failed several sobriety tests and was taken into custody. But as Frye’s mother, Rena, and his brother, Ronald, arrived at the scene, so did a crowd of onlookers that grew to about 300 people.\n\nBackup officers arrived and Marquette, Ronald and Rena all were arrested, along with an onlooker who allegedly spit on the officers.\n\nSoon, riots spread in the commercial section of Watts, followed by widespread looting.\n\n2. On Aug. 12, community members and police met at Athens Park, prompting leaders and a member of the Frye family to issue a public request for peace. But that request went unheeded and rioting continued, prompting state leaders to call for 14,000 California National Guard troops to go to South Los Angeles to work with police.\n\n3. On Aug. 13, a stretch of 103rd Street in Watts burned to the ground, an area later known to locals as “Charcoal Alley.” Looting and rioting spread from South L.A. to other areas, with Pasadena, Pacoima, Monrovia, Long Beach and Wilmington all seeing some conflict.\n\nThirty-four people died, about 2,000 others were injured and more than 600 buildings were damaged.\n\nLos Angeles uprising, 1992\n\nOn April 29, after a jury acquitted four Los Angeles police officers (three of whom were White) of crimes connected to the widely seen beating of a Black man, Rodney King, rioting broke out in South Los Angeles and quickly spread to other parts of Southern California lasting for six days. Billions of dollars of property was damaged or destroyed. The conditions that led to the violence, including police interaction with minority communities, economic inequality and racial injustice, became part of a national conversation that continues today.\n\nFifty-three people were killed, about 2,000 others were injured.\n\nGeorge Floyd riots, 2020\n\nProtests began in Minneapolis on May 26, a day after videos surfaced showing the death of an unarmed Black man, George Floyd, under the knee of a White Minneapolis Police Department officer, Derek Chauvin. Within a day, demonstrations were held in dozens of cities across the country. By May 30, Los Angeles and at least 12 other major cities declared curfews. Governors in 24 states and Washington, D.C., had called in the National Guard, with over 17,000 troops activated.\n\nNationally, at least 19 people died and an estimated 11,000 were arrested. No deaths reported in Los Angeles.\n\nSources: The Associated Press, Pew Research Center, History.com, SCNG Archives, Immigration Customs Enforcement","summary":"Southern California is no stranger to civil unrest.","url":"https://www.ocregister.com/2025/06/11/heres-how-current-protests-compare-with-those-in-the-past/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/LDN-L-LA-PROTEST-0611-KB25.jpg?w=1024&h=665","video":null,"publish_date":"2025-06-12 00:20:31","author":"Kurt Snibbe","authors":["Kurt Snibbe"],"language":"en","source_country":"US","sentiment":-0.112},{"id":330498954,"title":"UK issues unusual 'rising tensions' warning as US orders diplomatic evacuations","text":"The UK has issued an \"unusual warning\" to its commercial ships in the Middle East amid \"rising tensions\". The Maritime Trade Operations (UKMTO) fears \"an escalation of military activity\" is on the cards across the region, and believs security may be at risk. It says vessels must use the Arabian Gulf, Gulf of Oman and Straits of Hormuz, all of which pass Iran, with caution for the forseeable future. Iran publicly threatened to attack US military bases in the Middle East if they were attacked first. Donald Trump added fuel to the fire yesterday, crassly stating the country will never have a nuclear weapon whether a deal is reached or not. “UKMTO has been made aware of increased tensions within the region which could lead to an escalation of military activity having a direct impact on mariners. Vessels are advised to transit the Arabian Gulf, Gulf of Oman and Straits of Hormuz with caution,\" the UKMTO said today. The Trump administration has issued evacuation orders for non-essential personnel at the US Embassy in Iraq , and its diplomatic facilities in Bahrain and Kuwait. Secretary of Defense Pete Hegseth also told FOX News there would be voluntary departure for dependents of military personnel serving in the Central Command (CENTCOM) area of operations across the Middle East. This discourse led to the UKMTO advisory today as regional tensions surged. Iranian officials appeared to be responding to calls from hawks in the US to dismantle Iran's nuclear program by force if necessary. But Mr Trump was pessimistic when interviewed earlier this week. The US President said: \"I don’t know. I’m less confident now than I would have been a couple of months ago. Something happened to them, but I am much less confident of a deal being made.\" He spoke on the podcast Pod Force One on Monday, which explored in depth the tense situation across the Middle East. Meanwhile, suspected US airstrikes on Iran-backed Houthi rebels in Yemen killed at least three people recently. Yemeni rebels said they shot down a £25m Reaper attack drone during April's onslaught, which indicated a possible US attack on Iran. It happened after the US moved six of its prized B-2 Strategic Stealth bombers to the secretive Indo-Pacific island base of Diego Garcia. Hours after the surprise announcement of the Washington-Tehran talks, Iran's foreign minister said the conversation in Oman would be \"indirect\" but could be \"as much an opportunity as... a test.\" Mr Trump - who pulled the US out a 2015 nuclear deal between Iran and world powers during his first term - said discussions would be at \"very high level,\" as he delivered his warning to Tehran.","summary":"The Maritime Trade Operations (UKMTO), a British maritime security agency, has taken measures following Donald Trump's move to issue evacuation orders for non-essential personnel","url":"https://www.mirror.co.uk/news/world-news/uk-issues-unusual-rising-tensions-35377875","image":"https://i2-prod.mirror.co.uk/article35377879.ece/ALTERNATES/s1200b/1_FILES-BRITAIN-US-IRAN-GULF-SHIPPING.jpg","video":null,"publish_date":"2025-06-12 00:17:19","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.141},{"id":330500650,"title":"PBS, NPR funding on the line as House nears final vote on $9.4 billion in DOGE-backed cuts","text":"The House on Wednesday moved a step closer to approving President Donald Trump's $9.4 billion spending cut package, which would codify some cuts originally proposed by the Department of Government Efficiency.\n\nThe package would grant permission to the White House not to spend billions of dollars that had already been approved by Congress. The money would be clawed back from specific agencies like the U.S. Agency for International Development (USAID) and the Corporation for Public Broadcasting, which distributes federally appropriated grants to National Public Radio (NPR) and Public Broadcasting Service (PBS). \n\nAlthough the Wednesday procedural vote passed largely along party lines, a final vote expected Thursday could see some resistance from House Republicans who are uneasy about the popular programs that are being targeted, like PBS and National Public Radio.\n\nGiven House Speaker Mike Johnson's narrow Republican majority, he can only afford to lose a handful of votes and still push the package over the finish line on a party-line vote.","summary":"Passage would solidify DOGE-backed cuts, but some Republicans are uneasy about the programs being targeted, including the Corporation for Public Broadcasting.","url":"https://www.cnbc.com/2025/06/11/house-republicans-doge-cuts-trump.html","image":"https://image.cnbcfm.com/api/v1/image/108156743-17494961332025-06-09t190724z_1935393566_rc27zea0os3j_rtrmadp_0_usa-trump.jpeg?v=1749496163","video":null,"publish_date":"2025-06-12 00:15:16","author":"Erin Doherty","authors":["Erin Doherty"],"language":"en","source_country":"US","sentiment":-0.226},{"id":330502826,"title":"World News | Los Angeles-area Mayors Demand That Trump Administration Stop Stepped-up Immigration Raids","text":"Los Angeles, Jun 12 (AP) Dozens of mayors from across the Los Angeles region banded together on Wednesday to demand that the Trump administration stop the stepped-up immigration raids that have spread fear across their cities and sparked protests across the US But there were no signs President Donald Trump would heed their pleas. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. About 500 of the National Guard troops deployed to the Los Angeles protests have been trained to accompany agents on immigration operations, the commander in charge said on Wednesday. And while some troops have already gone on such missions, he said it is too early to say if that will continue even after the protests die down. \"We are expecting a ramp-up,” said Maj Gen Scott Sherman said, noting that protests across the nation were being discussed. \"I'm focused right here in LA, what's going on right here. But you know, I think we're very concerned.\" Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. The LA-area mayors and city council members urged Trump to stop using armed military troops alongside immigration agents during the raids. \"I'm asking you, please listen to me, stop terrorising our residents,\" said Brenda Olmos, vice mayor of Paramount, who said she was hit by rubber bullets over the weekend. \"You need to stop these raids.\" Speaking alongside the other mayors at a news conference, Los Angeles Mayor Karen Bass said the raids spread fear at the behest of the White House. Los Angeles started a nightly curfew on Tuesday that will remain in effect as long as necessary in a 2.5-square-kilometre section of downtown. The city of Los Angeles encompasses roughly 1,295 square kilometres. \"If there are raids that continue, if there are soldiers marching up and down our streets, I would imagine that the curfew will continue,\" Bass said. Those who have been caught up in the nationwide raids include asylum seekers, people who overstayed their visas and migrants awaiting their day in immigration court. The administration has cited the protests in its decision to deploy the military. Referring to the demonstrations, which have been mostly concentrated in the LA business district, the Democratic mayor added, \"If you drive a few blocks outside of downtown, you don't know that anything is happening in the city at all.\" California's Democratic governor, Gavin Newsom, has asked a federal court to put an emergency stop to the military helping immigration agents in the nation's second-largest city. This week, guardsmen began standing protectively around agents as they carry out arrests. A judge set a hearing for Thursday. The military is now closer to engaging in law enforcement actions such as deportations, as Trump has promised in his crackdown. The Guard has the authority to temporarily detain people who attack officers, but any arrests must be made by law enforcement. The president posted on the Truth Social platform that the city \"would be burning to the ground\" if he had not sent in the military. Some 2,000 National Guard soldiers are in Los Angeles, and are soon to be joined by 2,000 more along with about 700 Marines, Sherman said. Speaking in an interview with The Associated Press and ABC, Sherman initially said that National Guard troops had already temporarily detained civilians in the Los Angeles protests over immigration raids. He later said he based his comments on photos and footage he had seen that turned out not to be a representation of Guard members in Los Angeles. LA curfew will continue in downtown Police detained more than 20 people, mostly on curfew violations, on the first night of the curfew in downtown Los Angeles and used crowd-control projectiles to break up hundreds of protesters. But there were fewer clashes than on previous nights, and by daybreak, the downtown streets were bustling with residents walking dogs and commuters clutching coffee cups. Los Angeles police have made nearly 400 arrests and detentions since Saturday, the vast majority of which were for failing to leave the area at the request of law enforcement, according to the police department. There have been a handful of more serious charges, including for assault against police officers and for possession of a Molotov cocktail and a gun. Nine police officers have been hurt, mostly with minor injures. Some were transported to a hospital and released. Protests have spread nationwide Demonstrations have also spread to other cities nationwide, including Dallas and Austin in Texas, Chicago and New York, where thousands rallied and more arrests were made. In New York City, police said they took 86 people into custody during protests in lower Manhattan that lasted into Wednesday morning. Police Commissioner Jessica Tisch said the majority of demonstrators were peaceful. A 66-year-old woman in Chicago was injured when she was struck by a car during downtown protests Tuesday evening, police said. Video showed a car speeding down a street where people were protesting. In Texas, where police in Austin used chemical irritants to disperse several hundred demonstrators Monday, Republican Gov. Greg Abbott's office said Texas National Guard troops were \"on standby\" in areas where demonstrations are planned. Guard members were sent to San Antonio, but Police Chief William McManus said he had not been told how many troops were deployed or their role ahead of planned protests Wednesday night and Saturday. The protests began Friday after federal immigration raids arrested dozens of workers in Los Angeles. Protesters blocked a major freeway and set cars on fire over the weekend, and police responded with tear gas, rubber bullets and flash-bang grenades. Thousands of people have peacefully rallied outside City Hall and hundreds more protested outside a federal complex that includes a detention center where some immigrants are being held following workplace raids. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Dozens of mayors from across the Los Angeles region banded together on Wednesday to demand that the Trump administration stop the stepped-up immigration raids that have spread fear across their cities and sparked protests across the US","url":"https://www.latestly.com/agency-news/world-news-los-angeles-area-mayors-demand-that-trump-administration-stop-stepped-up-immigration-raids-6921699.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:14:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.167},{"id":330500492,"title":"Richard Marles downplays Trump administration's review of AUKUS","text":"Defence Minister Richard Marles has downplayed concerns the United States will review the AUKUS agreement, insisting it is a \"natural\" step and will not threaten the acquisition of nuclear-powered submarines.\n\nThe Pentagon review of the security pact will assess its alignment with Donald Trump's \"America-first\" agenda and will be led by senior official Elbridge Colby, regarded as an AUKUS sceptic.\n\nIt follows US Defense Secretary Pete Hegseth's public call for Australia to boost defence spending by tens of billions of dollars in the near term, which was brushed off by Prime Minister Anthony Albanese.\n\nA defence official said the purpose of the review was to ensure \"allies step up fully to do their part for collective defence\".\n\nMr Marles said he remained \"very confident\" AUKUS would be delivered and suggested an American review was no different to Australia's defence strategic review, which took AUKUS as a given, and a recent UK review.\n\n\"It's something that it's perfectly natural for an incoming administration to do … It's exactly what we did,\" he told ABC Melbourne.\n\n\"There is a plan here, we are sticking to it, and we're going to deliver it.\"\n\nThe prime minister has yet to finalise arrangements for his first face-to-face meeting with Mr Trump on the sidelines of next week's G7 summit but has had two disagreements with his administration in recent days, also provoking its anger for sanctioning two Israeli ministers.\n\nBut Mr Marles said Australia had been briefed in advance about the review and a spokesperson said the government remained confident of the Trump administration's \"clear and consistent\" support for AUKUS.\n\n\"I'm very confident that this is going to happen, there's a treaty-level agreement between our three countries [and] it's an agreement that we have been pursuing at a pace,\" he said.\n\nMove emboldens AUKUS critics, worries supporters\n\nThe review has sparked concern in official circles and emboldened AUKUS critics.\n\nFormer prime minister Malcolm Turnbull, who is avowedly anti-AUKUS, said it was \"time to wake up\" and renewed calls for Australia to hold its own review, accusing the major parties of a \"denial of reality\" about the prospects of the submarine deal.\n\nGreens senator David Shoebridge also repeated calls for an inquiry and said \"every rational observer\" would conclude that AUKUS was \"sinking\".\n\nMr Colby, who is the Pentagon's undersecretary in charge of policy, last year labelled himself an AUKUS \"agnostic\", saying he supported the idea \"in principle\" but was \"very sceptical in practice\".\n\nHours before news broke of the review, he tweeted comments from his superior, Mr Hegseth, calling for US allies in the Indo-Pacific to boost defence spending.\n\nMr Colby was more ambivalent about AUKUS in his confirmation hearings, saying the US government should \"do everything we can to make this work\" and that it would be \"great\" to provide the submarines as planned.\n\nBut he added it would be \"a very difficult problem\" for the US if it was not possible to make enough submarines to service both American and Australian needs.\n\n\"We don't want our service men and women to be in a weaker position and more vulnerable and, God forbid, worse because [the submarines] are not in the right place in the right time,\" he said at the time.\n\nA US government source also told the ABC it was \"crystal clear\" the Trump administration was trying to link the review with its push to get Australia to lift defence spending.\n\nJoe Hockey, a former Australian ambassador to the US who is now a defence industry consultant, said he suspected Mr Colby had capitalised on the recent disagreement over defence spending to set up this review.\n\n\"[Colby] is a bit of a sceptic … He would have seen that as an opportunity,\" he told ABC Radio National, adding the review was a reminder Australia needed to remain \"vigilant\".\n\n\"I keep suggesting to the Australian government in various ways that you can't ignore the Trump administration. You need to deeply engage with it,\" he said.\n\n\"Now, [current ambassador] Kevin Rudd has been doing that at various levels, but ultimately it is really important that the prime minister and the president, when they meet next week, have a detailed discussion.\"\n\nMr Hockey said the deal was \"all or nothing\" for Australia.\n\n\"If we do not get the Virginia-class submarines in 2032, we have no options left. We have no submarines … If you're not going to partner with the United States, who do you partner with?\"\n\nNo cause for concern, says Scott Morrison\n\nFormer prime minister Scott Morrison, who pioneered the AUKUS deal, said the review \"should not be over interpreted\".\n\n\"The focus of the review is not new and rightly centres on US submarine production rates,\" he said, adding that recent discussions between Mr Hegseth and Mr Marles were \"reasons for continued confidence.\"\n\n\"Now is the time for Australia to make the case again. We have a good case to make,\" he said in a post on LinkedIn.\n\nRichard Spencer, a former secretary of the US Navy and now the chair of defence company Austal, told ABC Radio National he was confident the review would affirm the merits of AUKUS.\n\n\"I have nothing but respect for Bridge Colby's ability to analyse complex situations … I am one of the believes that thinks AUKUS is one of the best bits of state-craftery in recent years,\" he said.\n\n\"I think it's completely normal for the Trump administration to do a review … I actually welcome the review, because every time something is reviewed, questioned and answered, I believe it strengthens the actual precepts of the agreement itself.\"\n\nAngus Taylor, the Coalition's defence spokesperson, said the review was \"deeply concerning\" and added to \"a growing list of issues in Australia's relationship with the United States\".\n\n\"If this review has been triggered by the Albanese government's refusal to commit to increased defence spending and its sanctioning of two Israeli ministers, then the government has very serious questions to answer,\" he said.","summary":"Australia's defence minister insisted he was not concerned about the country's prospects of acquiring nuclear-powered submarines after the US government announced a review of the security pact.","url":"https://www.abc.net.au/news/2025-06-12/marles-downplays-trump-review-of-aukus/105406896","image":"https://live-production.wcms.abc-cdn.net.au/637ca868973fb63dbb9cc6c6de92b746?impolicy=wcms_crop_resize&cropH=1152&cropW=2048&xPos=0&yPos=211&width=862&height=485","video":null,"publish_date":"2025-06-12 00:07:21","author":"Stephen Dziedzic,Tom Crowley","authors":["Stephen Dziedzic","Tom Crowley"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.205},{"id":330502818,"title":"World News | Trump's Mass Deportations Leave Democrats More Ready to Fight Back","text":"Washington, Jun 12 (AP) California Governor Gavin Newsom looked straight into the camera and staked out a clear choice for his Democratic Party. The governor positioned himself as not only a leader of the opposition to President Donald Trump's mass deportation agenda, but a de facto champion of the immigrants now being rounded up in California and across the country. Many of them, he said in the video address, were not hardened criminals, but hard-working people scooped up at a Home Depot lot or a garment factory, and detained by masked agents assisted by National Guard troops. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. It is a politically charged position for the party to take, after watching voter discontent with illegal immigration fuel Trump's return to the White House. It leaves Democrats deciding how strongly to align with that message in the face of blistering criticism from Republicans who are pouring billions of dollars into supporting Trump's strict immigration campaign. Senate Democratic Leader Chuck Schumer of New York said on Wednesday he is proud of Newsom, \"he's refusing to be intimidated by Donald Trump.\" Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. From the streets of Los Angeles to the halls of Congress, the debate over Trump's mass deportation agenda is forcing the US to reckon with core values as a nation of immigrants, but also its long-standing practice of allowing migrants to live and work in the US in a gray zone while not granting them full legal status. More than 11 million immigrants are in the US without proper approval, with millions more having arrived with temporary protections. As Trump's administration promises to round up some 3,000 immigrants a day and deport 1 million a year, the political stakes are shifting in real time. The president rode to the White House with his promise of mass deportations — rally crowds echoed his campaign promise to \"build the wall.\" But Americans are watching as Trump deploys the National Guard and active US Marines to Los Angeles, while pockets of demonstrations erupt in other cities nationwide, including after agents raided a meat processing plant in Omaha, Nebraska. Joel Payne, a Democratic strategist, said the country's mood appears to be somewhere between then-President Barack Obama's assertion that America is \"a nation of immigrants, we're also a nation of laws\" and Trump's \"more aggressive\" deportation approach. \"Democrats still have some work to do to be consistently trustworthy messengers on the issue,\" he said. At the same time, he said, Trump's actions as a \"chaos agent\" on immigration when there's already unrest over his trade wars and economic uncertainty, risk overreaching if the upheaval begins to sow havoc in the lives of Americans. Republicans have been relentless in their attacks on Democrats, portraying the situation in Los Angeles, which has been largely confined to a small area downtown, in highly charged terms as \"riots,\" in a preview of campaign ads to come. Police said more than 200 people were detained for failing to disperse on Tuesday, and 17 others for violating the 8 pm curfew over part of Los Angeles. Police arrested several more people for possessing a firearm, assaulting a police officer and other violations. Two people have been charged for allegedly throwing Molotov cocktails toward police during LA protests. House Speaker Mike Johnson said Newsom should be \"tarred and feathered\" for his leadership in the state, which he called \"a safe haven to violent criminal illegal aliens.\" At a private meeting of House Republicans this week with White House Press Secretary Karoline Leavitt, Rep Richard Hudson, the chairman of the GOP's campaign arm, framed the situation as Democrats supporting rioting and chaos while Republicans stand for law and order. \"Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend,\" wrote Senator Tom Cotton, R-Ark, earlier this week in the Wall Street Journal, suggesting it may be time to send in military troops. \"The American people elected Donald Trump and a Republican Congress to secure our border and deport violent illegal aliens. That's exactly what the president is doing.\" But not all rank-and-file Republicans are on board with such a heavy-handed approach. GOP Rep David Valadao, who represents California's agriculture regions in the Central Valley, said on social media he remains \"concerned about ongoing ICE operations throughout CA\" and was urging the administration \"to prioritise the removal of known criminals over the hardworking people who have lived peacefully in the Valley for years.\" Heading into the 2026 mid-term election season, with control of the House and Senate at stake, it is a repeat of past political battles, as Congress has failed repeatedly to pass major immigration law changes. The politics have shifted dramatically from the Obama era, when his administration took executive action to protect young immigrants known as Dreamers under the landmark Deferred Action for Childhood Arrivals programme. Those days, lawmakers were considering proposals to beef up border security as part of a broader package that would also create legal pathways, including for citizenship, for immigrants who have lived in the country for years and paid taxes, some filling roles in jobs Americans won't always take. With Trump's return to the Oval Office, the debate has turned toward aggressively removing immigrants, including millions who were allowed to legally enter the US during the Biden administration, as they await their immigration hearings and proceedings. \"This anniversary should be a reminder,\" said Senator Dick Durbin, D-Ill, at a Wednesday event at the US Capitol championing DACA's 13th year, even as protections are at risk under Trump's administration. \"Immigration has many faces.\" Despite their challenges in last year's election, Democrats feel more emboldened to resist Trump's actions than even just a few months ago, but the political conversation has nonetheless shifted in Trump's direction. While Democrats are unified against Trump's big tax breaks bill, with its USD 150 billion for new detention facilities, deportation flights and 10,000 new Immigration and Customs Enforcement agents, they talk more openly about beefing up border security and detaining the most dangerous criminal elements. Rep Suzan DelBene, D-Wash, chair of the Democratic Congressional Campaign Committee, points to the example of Democratic Rep Tom Suozzi, who won a special election in New York last year when he addressed potential changes to the immigration system head-on. At one point, he crashed a GOP opponent's news conference with his own. \"Trump said he was going to go after the worst of the worst, but he has ignored the laws, ignored due process, ignored the courts — and the American people reject that,\" she told The Associated Press. \"People want a president and a government that is going to fight for the issues that matter most to them, fight to move our country forward,\" she said. \"They want a Congress that is going to be a coequal branch of government and a check on this president.\" (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   California Governor Gavin Newsom looked straight into the camera and staked out a clear choice for his Democratic Party.","url":"https://www.latestly.com/agency-news/world-news-trumps-mass-deportations-leave-democrats-more-ready-to-fight-back-6921690.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-12 00:06:10","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.067},{"id":330504376,"title":"Troops begin detaining immigrants in national defense zone at border in escalation of military role","text":"By MORGAN LEE\n\nEL PASO, Texas (AP) — U.S. troops have begun directly detaining immigrants accused of trespassing on a recently designated national defense zone along the southern U.S. border, in an escalation of the military’s enforcement role, authorities said Wednesday\n\nU.S. Army Lieutenant Colonel Chad Campbell described in detail the first detentions by troops last week of three immigrants accused of trespassing in a national defense area near Santa Teresa, New Mexico.\n\nThose migrants were quickly turned over to U.S. Customs and Border Protection and are now among more than 1,400 migrants to have been charged with illegally entering militarized areas along that border, under a new border enforcement strategy from President Donald Trump’s administration.\n\nTroops are prohibited from conducting civilian law enforcement on U.S. soil under the Posse Comitatus Act. But an exception known as the military purpose doctrine allows it in some instances.\n\nAuthorities “noticed three individuals crossing the protective barrier into the United States,” Campbell said. “A Department of Defense response went to interdict those three individuals, told them to sit down. … In a matter of three minutes, border patrol agents came in to apprehend. So that three minutes is that temporary detention” by the military.\n\nTrump has designated two national military defense areas along the southern U.S. border for New Mexico and a 60-mile stretch of western Texas, from El Paso to Fort Hancock, while transferring much of the land from the Interior Department to oversight by the Department of Defense for three years.\n\nThe Trump administration plans eventually to add more militarized zones along the border, a military spokesman said Wednesday at a news conference in El Paso.\n\n“We have been very clear that there will be additional National Defense Areas across the southern border,” said Geoffrey Carmichael, a spokesperson for an enforcement task force at the southern border. “I won’t speculate to where those are going to be.”\n\nProponents of the militarized zones, including federal prosecutors, say the approach augments traditional efforts by Customs and Border Protection and other law enforcement agencies to secure the border.\n\n“These partnerships and consequences exist so that we can promote the most humane border environment we’ve ever had,” El Paso sector Border Patrol Chief Agent Walter Slosar said. “We are dissuading people from entering the smuggling cycle … to make sure that smugglers cannot take advantage of individuals who are trying to come into the United States.”\n\nDefense attorneys — and judges in some instances — are pushing back against the novel application of national security charges against immigrants who enter through those militarized zones — and carry a potential sentence of 18 months in prison on top of a possible six-month sentence for illegal entry.\n\nA judge in New Mexico has dismissed more than 100 national security charges against immigrants, finding little evidence that immigrants knew about the national defense areas. Those migrants still confronted charges of illegal entry to the U.S.\n\nIn Texas, a Peruvian woman who crossed the U.S. border illegally was acquitted of unauthorized access to a newly designated militarized zone in the first trial under the Trump administration’s efforts.\n\nU.S. Attorney Justin Simmons, who oversees western Texas, vowed to press forward with more military trespassing charges.\n\n“We’re gonna keep going forward on these NDA charges,” Simmons said. “We are gonna still bring them, we may win on them, we may not. … At the end of the day, you are not going to be allowed to stay in this country if you enter this country illegally.”\n\nGreater military engagement at the border takes place at the same time dozens of mayors from across the Los Angeles region banded together Wednesday to demand that the Trump administration stop the stepped-up immigration raids that have spread fear across their cities and sparked protests across the U.S.\n\nTrump has authorized the deployment of an additional 2,000 National Guard members to respond to immigration protests in LA. That directive brings the total number of Guard put on federal orders for the protests to more than 4,100. The Pentagon had already deployed about 700 Marines to the protests to the city.","summary":"Trump has designated two national military defense areas along the southern U.S. border.","url":"https://www.ocregister.com/2025/06/11/immigration-border-enforcement-military/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Immigrant_Acquitted_Texas_79745_0052b8.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-12 00:05:27","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.193},{"id":330502724,"title":"Troops begin detaining immigrants in national defense zone at border in escalation of military role","text":"By MORGAN LEE\n\nEL PASO, Texas (AP) — U.S. troops have begun directly detaining immigrants accused of trespassing on a recently designated national defense zone along the southern U.S. border, in an escalation of the military’s enforcement role, authorities said Wednesday\n\nU.S. Army Lieutenant Colonel Chad Campbell described in detail the first detentions by troops last week of three immigrants accused of trespassing in a national defense area near Santa Teresa, New Mexico.\n\nThose migrants were quickly turned over to U.S. Customs and Border Protection and are now among more than 1,400 migrants to have been charged with illegally entering militarized areas along that border, under a new border enforcement strategy from President Donald Trump’s administration.\n\nTroops are prohibited from conducting civilian law enforcement on U.S. soil under the Posse Comitatus Act. But an exception known as the military purpose doctrine allows it in some instances.\n\nAuthorities “noticed three individuals crossing the protective barrier into the United States,” Campbell said. “A Department of Defense response went to interdict those three individuals, told them to sit down. … In a matter of three minutes, border patrol agents came in to apprehend. So that three minutes is that temporary detention” by the military.\n\nTrump has designated two national military defense areas along the southern U.S. border for New Mexico and a 60-mile stretch of western Texas, from El Paso to Fort Hancock, while transferring much of the land from the Interior Department to oversight by the Department of Defense for three years.\n\nThe Trump administration plans eventually to add more militarized zones along the border, a military spokesman said Wednesday at a news conference in El Paso.\n\n“We have been very clear that there will be additional National Defense Areas across the southern border,” said Geoffrey Carmichael, a spokesperson for an enforcement task force at the southern border. “I won’t speculate to where those are going to be.”\n\nProponents of the militarized zones, including federal prosecutors, say the approach augments traditional efforts by Customs and Border Protection and other law enforcement agencies to secure the border.\n\n“These partnerships and consequences exist so that we can promote the most humane border environment we’ve ever had,” El Paso sector Border Patrol Chief Agent Walter Slosar said. “We are dissuading people from entering the smuggling cycle … to make sure that smugglers cannot take advantage of individuals who are trying to come into the United States.”\n\nDefense attorneys — and judges in some instances — are pushing back against the novel application of national security charges against immigrants who enter through those militarized zones — and carry a potential sentence of 18 months in prison on top of a possible six-month sentence for illegal entry.\n\nA judge in New Mexico has dismissed more than 100 national security charges against immigrants, finding little evidence that immigrants knew about the national defense areas. Those migrants still confronted charges of illegal entry to the U.S.\n\nIn Texas, a Peruvian woman who crossed the U.S. border illegally was acquitted of unauthorized access to a newly designated militarized zone in the first trial under the Trump administration’s efforts.\n\nU.S. Attorney Justin Simmons, who oversees western Texas, vowed to press forward with more military trespassing charges.\n\n“We’re gonna keep going forward on these NDA charges,” Simmons said. “We are gonna still bring them, we may win on them, we may not. … At the end of the day, you are not going to be allowed to stay in this country if you enter this country illegally.”\n\nGreater military engagement at the border takes place at the same time dozens of mayors from across the Los Angeles region banded together Wednesday to demand that the Trump administration stop the stepped-up immigration raids that have spread fear across their cities and sparked protests across the U.S.\n\nTrump has authorized the deployment of an additional 2,000 National Guard members to respond to immigration protests in LA. That directive brings the total number of Guard put on federal orders for the protests to more than 4,100. The Pentagon had already deployed about 700 Marines to the protests to the city.","summary":"Trump has designated two national military defense areas along the southern U.S. border.","url":"https://www.sandiegouniontribune.com/2025/06/11/immigration-border-enforcement-military/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Immigrant_Acquitted_Texas_79745_0052b8.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-12 00:05:27","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.193},{"id":330502646,"title":"US National Guard ‘expecting a ramp-up’ in immigration protests: official","text":"The National Guard members deployed to the protests in Los Angeles have been trained to temporarily detain civilians if necessary, according to the troops’ commander.\n\nNevertheless, as of Wednesday, Major General Scott Sherman clarified that no troops have detained any protester, despite an earlier statement that suggested otherwise.\n\nThe National Guard’s deployment came in response to protests against United States President Donald Trump’s push for mass deportation, which recently targeted hardware stores and other businesses in southern California, prompting outrage.\n\nProtesters flooded the streets starting on Friday to denounce the immigration raids. Trump responded by sending the military to the scene, denouncing what he considered “third-world lawlessness” in the city. Since then, however, the protests have spread beyond Los Angeles, to major cities in other parts of the country.\n\nSpeaking to reporters on Wednesday, Sherman said authorities “are expecting a ramp-up” in national unrest in the coming days.\n\n“I’m focused right here in LA, what’s going on right here. But you know, I think we’re very concerned,” he said.\n\nSherman explained that 500 of the more than 4,000 National Guard members deployed to Los Angeles have also received training to assist Immigration and Customs Enforcement (ICE) in the immigration raids.\n\nHis remarks came as condemnation continues to grow over Trump’s decision to deploy the National Guard to California without the permission of the state’s governor, Gavin Newsom.\n\nSince the National Guard arrived on Sunday, Trump has sent nearly 700 Marines to the Los Angeles area as well.\n\nLos Angeles Mayor Karen Bass on Wednesday accused the Trump administration of using the military to escalate tensions in the city, where the protests first broke out on Friday.\n\n“We started off by hearing the administration wanted to go after violent felons, gang members, drug dealers,” Bass said of Trump’s deportation push.\n\n“But when you raid Home Depots and workplaces, when you tear parents and children apart, and when you run armoured caravans through our streets, you are not trying to keep anyone safe. You’re trying to cause fear and panic.\n\n“And when you start deploying federalised troops on the heels of these raids, it is a drastic and chaotic escalation and completely unnecessary.”\n\nNewsom, meanwhile, filed an emergency motion on Tuesday to block Trump from expanding the military presence in Los Angeles beyond federal buildings, with a court hearing set for Thursday.\n\nBass and Governor Newsom have maintained that local law enforcement were able to handle the situation before Trump intervened and that the military presence prompted more unrest, not less.\n\nSpeaking alongside 30 other California mayors and city leaders on Wednesday, Bass questioned if Trump was seeing how far he could push his presidential power.\n\n“This was provoked by the White House. The reason why? We don’t know,” said Bass.\n\n“I posit that maybe we are part of a national experiment to determine how far the federal government can go in reaching in and taking over power from a governor, power from a local jurisdiction.”\n\nSo far, Trump has maintained that the soldiers’ deployment was needed to protect federal property and agents — and was therefore within his executive authority.\n\nHe has not yet invoked the Insurrection Act of 1807, a federal law that would suspend prohibitions against the military directly taking part in domestic law enforcement. Until that happens, the troops are generally barred from making arrests.\n\nSpeaking during a news conference on Wednesday, White House spokesperson Karoline Leavitt repeated Trump’s claims that sending in the National Guard and Marines had prevented Los Angeles from spiralling into chaos.\n\nShe charged that Bass and Newsom had “shamefully failed to meet their sworn obligations to their citizens”.\n\n“They’re attempting to use a violent mob as a weapon against their own constituents to prevent the enforcement of immigration law,” she said. “This is deeply un-American and morally reprehensible.”\n\nQuestions about ‘migrant invasion’\n\nAmid the unrest, the Trump administration has pledged to continue its aggressive immigration raids, with officials last month setting a quota of 3,000 arrests a day.\n\nAdvocates say the pressure has motivated ICE agents to take increasingly drastic measures, targeting anyone in the country without documentation, even those who have not committed criminal offences and those with deep community ties.\n\nReporting from Los Angeles, Al Jazeera’s Phil Lavelle said authorities have been conducting blanket raids at Home Depot hardware stores, where undocumented day labourers often gather to find work.\n\nAt one location, labourers told Lavelle “that they will continue to come even though they know that these stores are being targeted – even though they know that they will be targets – because quite simply, they’ve got to work”.\n\n“These are people who are communicating by WhatsApp and other methods,” Lavelle added. “If anybody is seen in the area who looks like an ICE agent, straight away, there are reports so that people know that they have to leave.”\n\nSo far, 61 Mexican nationals had been detained in Los Angeles during the recent raids, according to Mexican President Claudia Sheinbaum.\n\nTrump has repeatedly claimed that the influx of migrants into the US constitutes an “invasion”, which in turn necessitates emergency actions.\n\nSpeaking on Tuesday from the Fort Bragg military base in North Carolina, he called the protests in California a “full-blown assault on peace, on public order and our national sovereignty carried out by rioters bearing foreign flags with the aim of continuing a foreign invasion of our country”.\n\nBut during a congressional hearing on Wednesday, the Chairman of the Joint Chiefs of Staff General Dan Caine was asked whether he believed the US was being invaded by a foreign power. His answer appeared to contradict Trump.\n\n“I don’t see any foreign state-sponsored folks invading, but I’ll be mindful of the fact that there have been some border issues,” he said.","summary":"Major General Scott Sherman says National Guard troops have been trained to make detentions but have not done so yet.","url":"https://www.aljazeera.com/news/2025/6/12/national-guard-expecting-a-ramp-up-in-immigration-protests-says-official?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/06/AP25162060800681-1749674511.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-06-12 00:03:35","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.198},{"id":330499784,"title":"Trump news at a glance: government ‘dragnet’ widens as undocumented farm workers targeted in fresh raids","text":"With limited access to immigrants in detention, US attorneys are scrambling to understand the scope of California’s immigration raids, and the extent to which the Department of Homeland Security has violated immigrants’ rights.\n\nImmigration lawyers have said some detainees – including families with small children – were held in a stuffy office basement for days without sufficient food and water.\n\nElsewhere, US immigration officials carried out further “enforcement activity” in California’s agricultural heartland, with one advocacy group saying agents pursued workers through blueberry fields.\n\nThe raids have sparked ongoing protests in Los Angeles and led to demonstrations in other cities across the country.\n\nHere are the key stories:\n\nUS immigration officials raid California farms as Trump ramps up conflict\n\nAn estimated 255,700 farm workers are undocumented and the raids have been sharply criticized by advocacy groups and local officials, who said they were “outraged and heartbroken by Ice activities targeting immigrant families”.\n\nThe increasing raids come as Ice ramps up its efforts to meet a reported quota of 3,000 detentions a day set by Stephen Miller, Trump’s White House deputy chief of staff.\n\nFamilies arrested in LA Ice raids held in basements with little food or water, lawyers say\n\nThe children, the youngest of whom is three years old, were provided a bag of chips, a box of animal crackers and a mini carton of milk as their sole rations for a day. Agents told the family they did not have any water to provide during the family’s first day in detention; on the second day, all five were given a single bottle to share.\n\nThe one fan in the room was pointed directly towards a guard, rather than towards the families in confinement, they told lawyers.\n\nWorld’s biggest TikTok star Khaby Lame leaves US after Ice agents detain him over visa\n\nThe world’s most followed TikToker, Khaby Lame, has left the US after being briefly detained by immigration agents for allegedly overstaying his visa. The Italian-Senegalese influencer is now one of the most high-profile people to be swept up in Donald Trump’s crackdown on immigration.\n\nThe social media star, whose legal name is Seringe Khabane Lame, was detained last Friday at an airport in Las Vegas. He was released the same day and has since left the US, a spokesperson for US Immigration and Customs Enforcement (Ice) told the Guardian in a statement.\n\nTrump says China will face 55% tariffs as he endorses trade deal\n\nDonald Trump has endorsed the US-China trade deal struck in London that will ramp up supplies of rare earth minerals and magnets needed for the automotive industry, saying it will take total tariffs on Beijing to 55%.\n\nAcknowledging that his Chinese counterpart, Xi Jinping, still needed to give his final approval on the terms agreed late on Tuesday night at Lancaster House, the US president disclosed the pact would also facilitate Chinese students’ access to US colleges.\n\nJudge rules Trump administration can no longer detain Mahmoud Khalil\n\nA federal judge has ruled that the Trump administration can no longer detain Columbia University graduate and Palestinian activist Mahmoud Khalil on the basis of federal claims that he is a threat to US foreign policy.\n\nIn his order on Wednesday, Judge Michael E Farbiarz said that the ruling will come into effect at 9.30am on Friday, adding: “This is to allow the respondents to seek appellate review should they wish to.”\n\nMajor US climate website likely to be shut down after almost all staff fired\n\nA major US government website supporting public education on climate science looks likely to be shuttered after almost all of its staff were fired, the Guardian has learned.\n\nClimate.gov, the gateway website for the National Oceanic and Atmospheric Administration (Noaa)’s Climate Program Office, will no longer publish new content, according to multiple former staff responsible for the site’s content whose contracts were recently terminated.\n\nPentagon launches review of US-UK-Australia security alliance\n\nThe Pentagon has launched a review of the Aukus submarine agreement to make sure it is aligned with Trump’s “America first” agenda, throwing the $240bn defense pact with Britain and Australia into doubt.\n\nThe review may trigger more allied anxiety over the future of the trilateral alliance designed to counter China’s military rise.\n\nEPA announces major rollbacks to power plant pollution limits\n\nUS power plants will be allowed to pollute nearby communities and the wider world with more unhealthy air toxins and an unlimited amount of planet-heating gases under new regulatory rollbacks proposed by Donald Trump’s administration, experts warned.\n\nTrump plans to ‘phase out’ Fema after hurricane season\n\nPresident Donald Trump said on Tuesday he planned to start “phasing out” the Federal Emergency Management Agency after the hurricane season and that states would receive less federal aid to respond to natural disasters.\n\nMusk says he regrets some of his posts about Trump\n\nElon Musk has expressed contrition for some of his tweets about Donald Trump last week, in an apparent effort to retreat from an explosive falling out that has threatened to damage the Tesla boss’s business interests.\n\nWhat else happened today:\n\nBarely one-third of people polled across 24 countries say they have confidence in Donald Trump as a world leader, with most describing the US president as “arrogant” and “dangerous”, and relatively few as “honest”.Donald Trump’s administration is discouraging governments around the world from attending a UN conference next week on a possible two-state solution between Israel and the Palestinians, according to a US cable seen by Reuters.US prices continued to rise in May as companies and consumers grappled with Donald Trump’s tariffs. Annualized inflation ticked higher to 2.4% in May, up from 2.3% in April.\n\nCatching up? Here’s what happened 10 June.","url":"https://uk.news.yahoo.com/trump-news-glance-government-dragnet-000137435.html","image":"https://media.zenfs.com/en/theguardian_763/8d8a7a958fb3839e07f4660db583c28e","video":null,"publish_date":"2025-06-12 00:01:37","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.128},{"id":330504380,"title":"Trump’s mass deportations leave Democrats more ready to fight back","text":"By LISA MASCARO\n\nWASHINGTON (AP) — California Gov. Gavin Newsom looked straight into the camera and staked out a clear choice for his Democratic Party.\n\nThe governor positioned himself as not only a leader of the opposition to President Donald Trump’s mass deportation agenda, but a de facto champion of the immigrants now being rounded up in California and across the country. Many of them, he said in the video address, were not hardened criminals, but hard-working people scooped up at a Home Depot lot or a garment factory, and detained by masked agents assisted by National Guard troops.\n\nIt’s a politically charged position for the party to take, after watching voter discontent with illegal immigration fuel Trump’s return to the White House. It leaves Democrats deciding how strongly to align with that message in the face of blistering criticism from Republicans who are pouring billions of dollars into supporting Trump’s strict immigration campaign.\n\nSenate Democratic Leader Chuck Schumer of New York said Wednesday he’s proud of Newsom, “he’s refusing to be intimidated by Donald Trump.”\n\nFrom the streets of Los Angeles to the halls of Congress, the debate over Trump’s mass deportation agenda is forcing the U.S. to reckon with core values as a nation of immigrants, but also its long-standing practice of allowing migrants to live and work in the U.S. in a gray zone while not granting them full legal status. More than 11 million immigrants are in the U.S. without proper approval, with millions more having arrived with temporary protections.\n\nAs Trump’s administration promises to round up some 3,000 immigrants a day and deport 1 million a year, the political stakes are shifting in real time. The president rode to the White House with his promise of mass deportations — rally crowds echoed his campaign promise to “build the wall.” But Americans are watching as Trump deploys the National Guard and active U.S. Marines to Los Angeles, while pockets of demonstrations erupt in other cities nationwide, including after agents raided a meat processing plant in Omaha, Nebraska\n\nJoel Payne, a Democratic strategist, said the country’s mood appears to be somewhere between then-President Barack Obama’s assertion that America is “a nation of immigrants, we’re also a nation of laws” and Trump’s “more aggressive” deportation approach.\n\n“Democrats still have some work to do to be consistently trustworthy messengers on the issue,” he said.\n\nAt the same time, he said, Trump’s actions as a “chaos agent” on immigration when there’s already unrest over his trade wars and economic uncertainty, risk overreaching if the upheaval begins to sow havoc in the lives of Americans.\n\nRepublicans have been relentless in their attacks on Democrats, portraying the situation in Los Angeles, which has been largely confined to a small area downtown, in highly charged terms as “riots,” in a preview of campaign ads to come.\n\nPolice said more than 200 people were detained for failing to disperse on Tuesday, and 17 others for violating the 8 p.m. curfew over part of Los Angeles. Police arrested several more people for possessing a firearm, assaulting a police officer and other violations. Two people have been charged for allegedly throwing Molotov cocktails toward police during LA protests.\n\nHouse Speaker Mike Johnson said Newsom should be “tarred and feathered” for his leadership in the state, which he called “a safe haven to violent criminal illegal aliens.”\n\nAt a private meeting of House Republicans this week with White House Press Secretary Karoline Leavitt, Rep. Richard Hudson, the chairman of the GOP’s campaign arm, framed the situation as Democrats supporting rioting and chaos while Republicans stand for law and order.\n\n“Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend,” wrote Sen. Tom Cotton, R-Ark., earlier this week in the Wall Street Journal, suggesting it may be time to send in military troops.\n\n“The American people elected Donald Trump and a Republican Congress to secure our border and deport violent illegal aliens. That’s exactly what the president is doing.”\n\nBut not all rank-and-file Republicans are on board with such a heavy-handed approach.\n\nGOP Rep, David Valadao, who represents California’s agriculture regions in the Central Valley, said on social media he remains “concerned about ongoing ICE operations throughout CA” and was urging the administration “to prioritize the removal of known criminals over the hardworking people who have lived peacefully in the Valley for years.”\n\nHeading into the 2026 midterm election season, with control of the House and Senate at stake, it’s a repeat of past political battles, as Congress has failed repeatedly to pass major immigration law changes.\n\nThe politics have shifted dramatically from the Obama era, when his administration took executive action to protect young immigrants known as Dreamers under the landmark Deferred Action for Childhood Arrivals program.\n\nThose days, lawmakers were considering proposals to beef up border security as part of a broader package that would also create legal pathways, including for citizenship, for immigrants who have lived in the country for years and paid taxes, some filling roles in jobs Americans won’t always take.\n\nWith Trump’s return to the Oval Office, the debate has turned toward aggressively removing immigrants, including millions who were allowed to legally enter the U.S. during the Biden administration, as they await their immigration hearings and proceedings.\n\n“This anniversary should be a reminder,” said Sen. Dick Durbin, D-Ill., at a Wednesday event at the U.S. Capitol championing DACA’s 13th year, even as protections are at risk under Trump’s administration. “Immigration has many faces.”\n\nDespite their challenges in last year’s election, Democrats feel more emboldened to resist Trump’s actions than even just a few months ago, but the political conversation has nonetheless shifted in Trump’s direction.\n\nWhile Democrats are unified against Trump’s big tax breaks bill, with its $150 billion for new detention facilities, deportation flights and 10,000 new Immigration and Customs Enforcement agents, they talk more openly about beefing up border security and detaining the most dangerous criminal elements.\n\nRep. Suzan DelBene, D-Wash., chair of the Democratic Congressional Campaign Committee, points to the example of Democratic Rep. Tom Suozzi, who won a special election in New York last year when he addressed potential changes to the immigration system head-on. At one point, he crashed a GOP opponent’s news conference with his own.\n\n“Trump said he was going to go after the worst of the worst, but he has ignored the laws, ignored due process, ignored the courts — and the American people reject that,” she told The Associated Press.\n\n“People want a president and a government that is going to fight for the issues that matter most to them, fight to move our country forward,” she said. “They want a Congress that is going to be a coequal branch of government and a check on this president.”\n\nAssociated Press writer Matt Brown contributed to this story.","summary":"Democrats feel more emboldened to resist Trump’s actions than even just a few months ago.","url":"https://www.ocregister.com/2025/06/11/immigration-democrats/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Trump_Newsom_40480-1.jpg?w=1024&h=684","video":null,"publish_date":"2025-06-11 23:58:09","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.104},{"id":330502726,"title":"Trump’s mass deportations leave Democrats more ready to fight back","text":"By LISA MASCARO\n\nWASHINGTON (AP) — California Gov. Gavin Newsom looked straight into the camera and staked out a clear choice for his Democratic Party.\n\nThe governor positioned himself as not only a leader of the opposition to President Donald Trump’s mass deportation agenda, but a de facto champion of the immigrants now being rounded up in California and across the country. Many of them, he said in the video address, were not hardened criminals, but hard-working people scooped up at a Home Depot lot or a garment factory, and detained by masked agents assisted by National Guard troops.\n\nIt’s a politically charged position for the party to take, after watching voter discontent with illegal immigration fuel Trump’s return to the White House. It leaves Democrats deciding how strongly to align with that message in the face of blistering criticism from Republicans who are pouring billions of dollars into supporting Trump’s strict immigration campaign.\n\nSenate Democratic Leader Chuck Schumer of New York said Wednesday he’s proud of Newsom, “he’s refusing to be intimidated by Donald Trump.”\n\nFrom the streets of Los Angeles to the halls of Congress, the debate over Trump’s mass deportation agenda is forcing the U.S. to reckon with core values as a nation of immigrants, but also its long-standing practice of allowing migrants to live and work in the U.S. in a gray zone while not granting them full legal status. More than 11 million immigrants are in the U.S. without proper approval, with millions more having arrived with temporary protections.\n\nAs Trump’s administration promises to round up some 3,000 immigrants a day and deport 1 million a year, the political stakes are shifting in real time. The president rode to the White House with his promise of mass deportations — rally crowds echoed his campaign promise to “build the wall.” But Americans are watching as Trump deploys the National Guard and active U.S. Marines to Los Angeles, while pockets of demonstrations erupt in other cities nationwide, including after agents raided a meat processing plant in Omaha, Nebraska\n\nJoel Payne, a Democratic strategist, said the country’s mood appears to be somewhere between then-President Barack Obama’s assertion that America is “a nation of immigrants, we’re also a nation of laws” and Trump’s “more aggressive” deportation approach.\n\n“Democrats still have some work to do to be consistently trustworthy messengers on the issue,” he said.\n\nAt the same time, he said, Trump’s actions as a “chaos agent” on immigration when there’s already unrest over his trade wars and economic uncertainty, risk overreaching if the upheaval begins to sow havoc in the lives of Americans.\n\nRepublicans have been relentless in their attacks on Democrats, portraying the situation in Los Angeles, which has been largely confined to a small area downtown, in highly charged terms as “riots,” in a preview of campaign ads to come.\n\nPolice said more than 200 people were detained for failing to disperse on Tuesday, and 17 others for violating the 8 p.m. curfew over part of Los Angeles. Police arrested several more people for possessing a firearm, assaulting a police officer and other violations. Two people have been charged for allegedly throwing Molotov cocktails toward police during LA protests.\n\nHouse Speaker Mike Johnson said Newsom should be “tarred and feathered” for his leadership in the state, which he called “a safe haven to violent criminal illegal aliens.”\n\nAt a private meeting of House Republicans this week with White House Press Secretary Karoline Leavitt, Rep. Richard Hudson, the chairman of the GOP’s campaign arm, framed the situation as Democrats supporting rioting and chaos while Republicans stand for law and order.\n\n“Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend,” wrote Sen. Tom Cotton, R-Ark., earlier this week in the Wall Street Journal, suggesting it may be time to send in military troops.\n\n“The American people elected Donald Trump and a Republican Congress to secure our border and deport violent illegal aliens. That’s exactly what the president is doing.”\n\nBut not all rank-and-file Republicans are on board with such a heavy-handed approach.\n\nGOP Rep, David Valadao, who represents California’s agriculture regions in the Central Valley, said on social media he remains “concerned about ongoing ICE operations throughout CA” and was urging the administration “to prioritize the removal of known criminals over the hardworking people who have lived peacefully in the Valley for years.”\n\nHeading into the 2026 midterm election season, with control of the House and Senate at stake, it’s a repeat of past political battles, as Congress has failed repeatedly to pass major immigration law changes.\n\nThe politics have shifted dramatically from the Obama era, when his administration took executive action to protect young immigrants known as Dreamers under the landmark Deferred Action for Childhood Arrivals program.\n\nThose days, lawmakers were considering proposals to beef up border security as part of a broader package that would also create legal pathways, including for citizenship, for immigrants who have lived in the country for years and paid taxes, some filling roles in jobs Americans won’t always take.\n\nWith Trump’s return to the Oval Office, the debate has turned toward aggressively removing immigrants, including millions who were allowed to legally enter the U.S. during the Biden administration, as they await their immigration hearings and proceedings.\n\n“This anniversary should be a reminder,” said Sen. Dick Durbin, D-Ill., at a Wednesday event at the U.S. Capitol championing DACA’s 13th year, even as protections are at risk under Trump’s administration. “Immigration has many faces.”\n\nDespite their challenges in last year’s election, Democrats feel more emboldened to resist Trump’s actions than even just a few months ago, but the political conversation has nonetheless shifted in Trump’s direction.\n\nWhile Democrats are unified against Trump’s big tax breaks bill, with its $150 billion for new detention facilities, deportation flights and 10,000 new Immigration and Customs Enforcement agents, they talk more openly about beefing up border security and detaining the most dangerous criminal elements.\n\nRep. Suzan DelBene, D-Wash., chair of the Democratic Congressional Campaign Committee, points to the example of Democratic Rep. Tom Suozzi, who won a special election in New York last year when he addressed potential changes to the immigration system head-on. At one point, he crashed a GOP opponent’s news conference with his own.\n\n“Trump said he was going to go after the worst of the worst, but he has ignored the laws, ignored due process, ignored the courts — and the American people reject that,” she told The Associated Press.\n\n“People want a president and a government that is going to fight for the issues that matter most to them, fight to move our country forward,” she said. “They want a Congress that is going to be a coequal branch of government and a check on this president.”\n\nAssociated Press writer Matt Brown contributed to this story.","summary":"Democrats feel more emboldened to resist Trump’s actions than even just a few months ago.","url":"https://www.sandiegouniontribune.com/2025/06/11/immigration-democrats/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Trump_Newsom_40480-1.jpg?w=1024&h=684","video":null,"publish_date":"2025-06-11 23:58:09","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.104},{"id":330496546,"title":"Trump’s mass deportations leave Democrats more ready to fight back","text":"By LISA MASCARO\n\nWASHINGTON (AP) — California Gov. Gavin Newsom looked straight into the camera and staked out a clear choice for his Democratic Party.\n\nThe governor positioned himself as not only a leader of the opposition to President Donald Trump’s mass deportation agenda, but a de facto champion of the immigrants now being rounded up in California and across the country. Many of them, he said in the video address, were not hardened criminals, but hard-working people scooped up at a Home Depot lot or a garment factory, and detained by masked agents assisted by National Guard troops.\n\nIt’s a politically charged position for the party to take, after watching voter discontent with illegal immigration fuel Trump’s return to the White House. It leaves Democrats deciding how strongly to align with that message in the face of blistering criticism from Republicans who are pouring billions of dollars into supporting Trump’s strict immigration campaign.\n\nSenate Democratic Leader Chuck Schumer of New York said Wednesday he’s proud of Newsom, “he’s refusing to be intimidated by Donald Trump.”\n\nFrom the streets of Los Angeles to the halls of Congress, the debate over Trump’s mass deportation agenda is forcing the U.S. to reckon with core values as a nation of immigrants, but also its long-standing practice of allowing migrants to live and work in the U.S. in a gray zone while not granting them full legal status. More than 11 million immigrants are in the U.S. without proper approval, with millions more having arrived with temporary protections.\n\nAs Trump’s administration promises to round up some 3,000 immigrants a day and deport 1 million a year, the political stakes are shifting in real time. The president rode to the White House with his promise of mass deportations — rally crowds echoed his campaign promise to “build the wall.” But Americans are watching as Trump deploys the National Guard and active U.S. Marines to Los Angeles, while pockets of demonstrations erupt in other cities nationwide, including after agents raided a meat processing plant in Omaha, Nebraska\n\nJoel Payne, a Democratic strategist, said the country’s mood appears to be somewhere between then-President Barack Obama’s assertion that America is “a nation of immigrants, we’re also a nation of laws” and Trump’s “more aggressive” deportation approach.\n\n“Democrats still have some work to do to be consistently trustworthy messengers on the issue,” he said.\n\nAt the same time, he said, Trump’s actions as a “chaos agent” on immigration when there’s already unrest over his trade wars and economic uncertainty, risk overreaching if the upheaval begins to sow havoc in the lives of Americans.\n\nRepublicans have been relentless in their attacks on Democrats, portraying the situation in Los Angeles, which has been largely confined to a small area downtown, in highly charged terms as “riots,” in a preview of campaign ads to come.\n\nPolice said more than 200 people were detained for failing to disperse on Tuesday, and 17 others for violating the 8 p.m. curfew over part of Los Angeles. Police arrested several more people for possessing a firearm, assaulting a police officer and other violations. Two people have been charged for allegedly throwing Molotov cocktails toward police during LA protests.\n\nHouse Speaker Mike Johnson said Newsom should be “tarred and feathered” for his leadership in the state, which he called “a safe haven to violent criminal illegal aliens.”\n\nAt a private meeting of House Republicans this week with White House Press Secretary Karoline Leavitt, Rep. Richard Hudson, the chairman of the GOP’s campaign arm, framed the situation as Democrats supporting rioting and chaos while Republicans stand for law and order.\n\n“Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend,” wrote Sen. Tom Cotton, R-Ark., earlier this week in the Wall Street Journal, suggesting it may be time to send in military troops.\n\n“The American people elected Donald Trump and a Republican Congress to secure our border and deport violent illegal aliens. That’s exactly what the president is doing.”\n\nBut not all rank-and-file Republicans are on board with such a heavy-handed approach.\n\nGOP Rep, David Valadao, who represents California’s agriculture regions in the Central Valley, said on social media he remains “concerned about ongoing ICE operations throughout CA” and was urging the administration “to prioritize the removal of known criminals over the hardworking people who have lived peacefully in the Valley for years.”\n\nHeading into the 2026 midterm election season, with control of the House and Senate at stake, it’s a repeat of past political battles, as Congress has failed repeatedly to pass major immigration law changes.\n\nThe politics have shifted dramatically from the Obama era, when his administration took executive action to protect young immigrants known as Dreamers under the landmark Deferred Action for Childhood Arrivals program.\n\nThose days, lawmakers were considering proposals to beef up border security as part of a broader package that would also create legal pathways, including for citizenship, for immigrants who have lived in the country for years and paid taxes, some filling roles in jobs Americans won’t always take.\n\nWith Trump’s return to the Oval Office, the debate has turned toward aggressively removing immigrants, including millions who were allowed to legally enter the U.S. during the Biden administration, as they await their immigration hearings and proceedings.\n\n“This anniversary should be a reminder,” said Sen. Dick Durbin, D-Ill., at a Wednesday event at the U.S. Capitol championing DACA’s 13th year, even as protections are at risk under Trump’s administration. “Immigration has many faces.”\n\nDespite their challenges in last year’s election, Democrats feel more emboldened to resist Trump’s actions than even just a few months ago, but the political conversation has nonetheless shifted in Trump’s direction.\n\nWhile Democrats are unified against Trump’s big tax breaks bill, with its $150 billion for new detention facilities, deportation flights and 10,000 new Immigration and Customs Enforcement agents, they talk more openly about beefing up border security and detaining the most dangerous criminal elements.\n\nRep. Suzan DelBene, D-Wash., chair of the Democratic Congressional Campaign Committee, points to the example of Democratic Rep. Tom Suozzi, who won a special election in New York last year when he addressed potential changes to the immigration system head-on. At one point, he crashed a GOP opponent’s news conference with his own.\n\n“Trump said he was going to go after the worst of the worst, but he has ignored the laws, ignored due process, ignored the courts — and the American people reject that,” she told The Associated Press.\n\n“People want a president and a government that is going to fight for the issues that matter most to them, fight to move our country forward,” she said. “They want a Congress that is going to be a coequal branch of government and a check on this president.”\n\nAssociated Press writer Matt Brown contributed to this story.","summary":"Democrats feel more emboldened to resist Trump’s actions than even just a few months ago.","url":"https://www.bostonherald.com/2025/06/11/immigration-democrats/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Trump_Newsom_40480-1.jpg?w=1024&h=684","video":null,"publish_date":"2025-06-11 23:58:09","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.104},{"id":330502796,"title":"World News | US Reduces Presence of Staffers Not Deemed Essential in the Middle East as Tensions Rise","text":"Washington, Jun 12 (AP) The United States is drawing down the presence of staffers who are not deemed essential to operations in the Middle East and their loved ones due to the potential for regional unrest, the State Department and military said on Wednesday. The State Department said it has ordered the departure of all nonessential personnel from the US Embassy in Baghdad based on its latest review and a commitment \"to keeping Americans safe, both at home and abroad.\" The embassy already had been on limited staffing, and the order will not affect a large number of personnel. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. The department, however, also is authorising the departure of nonessential personnel and family members from Bahrain and Kuwait. That gives them the option of leaving those countries at government expense and with government assistance. Defense Secretary Pete Hegseth \"has authorised the voluntary departure of military dependents from locations\" across the region, US Central Command said in a statement. The command \"is monitoring the developing tension in the Middle East.\" Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. Speaking at the Kennedy Center in Washington on Wednesday evening, President Donald Trump said, \"They are being moved out, because it could be a dangerous place, and we'll see what happens. We've given notice to move out, and we'll see what happens.\" Tensions in the region have been rising in recent days as talks between the US and Iran over its rapidly advancing nuclear programme appear to have hit an impasse. The talks seek to limit Iran's nuclear programme in exchange for the lifting of some of the crushing economic sanctions that the US has imposed on the Islamic Republic. Iran insists its nuclear programme is peaceful. The next round of talks — the sixth — had been tentatively scheduled for this weekend in Oman, according to two US officials, who spoke on condition of anonymity to discuss diplomatic matters. However, those officials said on Wednesday that it looked increasingly unlikely that the talks would happen. Trump, who has previously said Israel or the US could carry out airstrikes targeting Iranian nuclear facilities if negotiations failed, gave a less-than-optimistic view about reaching a deal with Iran, telling the New York Post's \"Pod Force One\" podcast that he was \"getting more and more less confident about\" a deal. \"They seem to be delaying, and I think that's a shame. I'm less confident now than I would have been a couple of months ago. Something happened to them,\" he said in the interview recorded on Monday and released on Wednesday. Iran's mission to the UN posted on social media that \"threats of overwhelming force won't change the facts.\" \"Iran is not seeking a nuclear weapon, and US militarism only fuels instability,\" the Iranian mission wrote. Iranian Defence Minister Gen Aziz Nasirzadeh separately told journalists on Wednesday that he hoped talks with the US would yield results, though Tehran stood ready to respond. \"If conflict is imposed on us, the opponent's casualties will certainly be more than ours, and in that case, America must leave the region, because all its bases are within our reach,\" he said. \"We have access to them, and we will target all of them in the host countries without hesitation.\" Meanwhile, the Board of Governors at the International Atomic Energy Agency was potentially set to vote on a measure to censure Iran. That could set in motion an effort to snap back United Nations sanctions on Iran via a measure in Tehran's 2015 nuclear deal with world powers that is still active until October. Trump withdrew from that agreement in his first term. Earlier on Wednesday, a statement from the United Kingdom Maritime Trade Operations centre, a Mideast-based effort overseen by the British navy, issued a warning to ships in the region that it \"has been made aware of increased tensions within the region which could lead to an escalation of military activity having a direct impact on mariners.\" It urged caution in the Persian Gulf, the Gulf of Oman and the Strait of Hormuz. It did not name Iran, though those waterways have seen Iranian ship seizures and attacks in the past. The top US military officer for the Middle East, Gen Erik Kurilla, was scheduled to testify before the Senate Armed Services Committee on Thursday, but that testimony has now been postponed, according to the committee's website. The Pentagon has not commented on the postponement. Meanwhile, Iraq's state-run Iraqi News Agency said in a statement attributed to an unnamed government official that the evacuation of some nonessential employees from the US Embassy in Baghdad was part of \"procedures related to the US diplomatic presence in a number of Middle Eastern countries, not just Iraq\" and that Iraqi officials \"have not recorded any security indicators that warrant an evacuation.\" \"We reiterate that all security indicators and briefings support the escalating assessments of stability and the restoration of internal security,\" the statement said. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   The United States is drawing down the presence of staffers who are not deemed essential to operations in the Middle East and their loved ones due to the potential for regional unrest, the State Department and military said on Wednesday.","url":"https://www.latestly.com/agency-news/world-news-us-reduces-presence-of-staffers-not-deemed-essential-in-the-middle-east-as-tensions-rise-6921684.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-11 23:58:07","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.354},{"id":330502420,"title":"US immigration, border agents to be deployed at Club World Cup","text":"Fifa boss Gianni Infantino dismissed security concerns over ICE agents being deployed to Club World Cup matches. (AP pic)LOS ANGELES: US immigration and border agents will be deployed at venues hosting Fifa Club World Cup games when the tournament kicks off this weekend, a US media report said Wednesday.NBC television’s Miami affiliate reported that members of US Immigration and Customs Enforcement (ICE) along with US Customs and Border Protection (CBP) would be on duty at Saturday’s opener between Lionel Messi’s Inter Miami and Egypt’s Al Ahly.The report cited a CBP post on social media – since deleted – that said agents would be on the ground during the first round of games in the tournament.“Let the games begin! The first Fifa Club World Cup games start on June 14th in Miami,” the post on X read. “CBP will be suited and booted and ready to provide security for the first round of games.”ICE raids carried out in Los Angeles last week as part of President Donald Trump’s immigration crackdown have triggered angry protests in the city.The NBC report did not state what role ICE and CBP agents would have at Club World Cup games, nor did it give any indication of how many agents would be deployed.An ICE spokesman did not immediately respond to a request for comment when contacted by AFP.Fifa president Gianni Infantino meanwhile played down any concerns about ICE agents being deployed to Club World Cup matches.“No, I don’t have any concerns about anything in the sense that we are very attentive on any security question,” Infantino told reporters at an event in Miami.“Of course, the most important for us is to guarantee security for all the fans who come to the games. This is our priority. This is the priority of all the authorities who are here. And we want everyone who comes to the games to pass a good moment.”","summary":"US media said enforcement officers would be 'suited and booted' for Inter Miami’s opener against Egypt’s Al Ahly.","url":"https://www.freemalaysiatoday.com/category/world/2025/06/12/us-immigration-border-agents-to-be-deployed-at-club-world-cup/","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/06/1adffe44-fifa-club-world-cup.jpg","video":null,"publish_date":"2025-06-11 23:57:49","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.049},{"id":330505064,"title":"Donald Trump and Melania Trump Make Rare Red Carpet Appearance","text":"Ivana Trump\n\nIvana Trump was the first wife of President-elect Donald Trump. Born in Gottwaldov, Czechoslovakia—now Zlín of the Czech Republic—in 1949, she rose to fame as a competitive skier. And, thanks to her marriage to Austrian ski instructor Alfred Winklmayr in 1971, Ivana was able to travel often outside of Czechoslovakia.According to her book Raising Trump, the model met Donald three years after her 1973 divorce during a New York trip, where she'd traveled for a Canadian fashion show ahead of the Montreal Olympics. They wed in 1977 and welcomed three kids: Donald Trump Jr. born in 1977, Ivanka Trump born in 1981 and Eric Trump born in 1984.The pair's divorce was finalized in 1992 following his affair with Marla Maples, whom he later married. However, Ivana—who then married Riccardo Mazzucchelli for two years followed by Rossano Rubicondi for less than a year—and Donald remained on good terms.“Donald during the divorce was brutal,” she told ABC News in 2017. “He took the divorce as a business deal, and he cannot lose. He has to win. So he took about two years. And after the final situation was straightened up, we would just talk and we are friends.”Ivana died in 2022 at age 73. According to NBC News, the New York City Medical Examiner said she died of “blunt impact injuries” and that her manner of death was an accident. A senior NYC official with direct knowledge added the circumstances were consistent with a fall on the stairs in her New York apartment.","summary":"Donald Trump and Melania Trump have left the White House. \nThe POTUS and first lady stepped out at the John F. Kennedy Center for the Performing Arts ahead of the Opera House&#x27;s presentation of the...","url":"https://www.eonline.com/news/1418516/donald-trump-melania-trump-attend-kennedy-centers-les-miserables?cmpid=rss-syndicate-genericrss-us-top_stories","image":"https://akns-images.eonline.com/eol_images/Entire_Site/20250426/50dba18b-93e8-4d9a-a334-2848b8e7a27f_1745659095.jpg?fit=around%7C1200:1200&output-quality=90&crop=1200:1200;center,top","video":null,"publish_date":"2025-06-11 23:55:04","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.268},{"id":330500916,"title":"China Has Secret Police in the US. This Congresswoman is Trying to Stop It.","text":"In December 2024, Chen Jinping, a 60-year-old Manhattan resident, pleaded guilty to opening and operating a secret Chinese police station for China’s Ministry of Public Security in Manhattan’s Chinatown neighborhood. Chen was arrested with “Harry” Lu Jianwang in April 2023, following an FBI investigation into the outpost.\n\nThough these arrests were the first of their kind, according to Justice Department officials, American authorities suspect that China has these kinds of outposts all over the country. \n\nAnd China’s nefarious activities in New York City hardly scratch the surface. For decades, Chinese operatives have infiltrated American universities and companies, smuggled drugs and human beings across America’s borders, and stolen American intellectual property and technology—even corn seeds from fields in Iowa. \n\nPresident Donald Trump was one of the first to see the threat of China clearly. Under the president’s leadership, Republicans in Congress are trying to prevent and punish this malign Chinese activity. This week, one of the House Republicans spearheading that effort, Rep. Ashley Hinson, R-Iowa, joins “The Signal Sitdown” to discuss.\n\n“My passion for this policy started in my district,” Hinson said. The aforementioned seed-stealing spies were operating in Hinson’s backyard. “There was actually a Chinese spy ring busted stealing seeds out of a cornfield in Dysart, Iowa.”\n\n“They wanted to take them back to China. They want to cheat,” Hinson explained. “It’s all about reverse engineering because there is so much R&D that has gone into seed technology so that we can grow the most resilient, best yielding plants in the world.”\n\nChina’s unfair trade practices can often be more subtle than outright theft, however. “[The Chinese] are using tactics like transnational shipment,” Hinson told The Daily Signal.\n\n“So, especially in the auto-parts industry, for example,” Hinson explained, “something coming in from China is gonna be tariffed, so then they ship it through Singapore or Vietnam or someplace with a lesser tariff to get around our tariff laws.”\n\n“They’re economically cheating and getting a better deal,” Hinson continued. “Meanwhile, you’ve got American producers trying to play on that same playing field and it’s not level.”\n\nHinson has introduced the Protecting American Industry and Labor from International Trade Crimes Act with Select Committee on the Chinese Communist Party Chairman John Moolenaar, R-Mich., and Ranking Member Raja Krishnamoorthi, D-Ill., to provide federal law enforcement more capacity to crack down on these trade practices.\n\n“What we’re trying to do is make sure that President Trump’s Department of Justice… [will have] the resources and a specific task force to be able to go after these malign actors who are, again, intentionally cheating,” she explained.\n\n“We think this cost is hundreds of billions of dollars every year on the low end,” Hinson said. “This has been decades in the making, right? You’ve got entire industries that have been ceded and now China owns them.”","summary":"In December 2024, Chen Jinping, a 60-year-old Manhattan resident, pleaded guilty to opening and operating a secret Chinese police station for China’s Ministry of Public... Read More\n\n\nThe post China Has Secret Police in the US. This Congresswoman is Trying to Stop It. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/11/china-has-secret-police-us-this-congresswoman-trying-stop-it/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/Untitled-1.png","video":null,"publish_date":"2025-06-11 23:52:19","author":"Bradley Devlin,Wide Margin","authors":["Bradley Devlin","Wide Margin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.44},{"id":330504368,"title":"Vance made a brief trip to Montana to speak to Murdochs, other Fox News executives, AP sources say","text":"By MICHELLE L. PRICE\n\nWASHINGTON (AP) — Vice President JD Vance on Tuesday made a brief trip to Montana, where he spoke to media mogul Rupert Murdoch; his son Lachlan Murdoch, the head of Fox News and News Corp.; and a group of other Fox News executives, according to two people familiar with the trip.\n\nVance met with the group at the Murdoch family ranch in southwest Montana near Dillon, according to the people. They confirmed the visit to The Associated Press on condition of anonymity because they were not authorized to speak publicly about it.\n\nIt’s not clear why the vice president addressed the group or what they spoke about.\n\nA spokesperson for Fox News Channel did not respond to a message seeking comment.\n\nThe vice president’s office does not release a schedule for Vance and did not offer advance notice of the trip, so the surprise arrival of Air Force Two in Butte, Montana, set off local speculation as his motorcade was seen driving away.\n\nThe Murdoch ranch near Dillon is roughly 70 miles south of Butte. The ranch, which Murdoch purchased in 2021, is spread across two valleys and a mountain range and has some 12,000 cattle. It sits near Yellowstone National Park along the Montana-Idaho border.\n\nAccording to flight restrictions issued by the Federal Aviation Administration, the vice presidential aircraft was only on the ground for a matter of hours.\n\nVance was scheduled to have lunch with President Donald Trump on Wednesday, according to the president’s publicly released schedule, meaning the vice president presumably returned to Washington shortly after meeting the Murdochs 2,200 miles away on Tuesday night.\n\nRupert Murdoch and his media organization have long been friendly with Republicans and have, for the most part, had a friendly relationship with Trump. He appeared at Trump’s inauguration and was spotted earlier this year in the Oval Office.\n\nRupert Murdoch, 94, stepped down as the head of Fox News and News Corp. in 2023 and handed control over to son Lachlan.\n\nMontana state Auditor James Brown told the Montana Talks radio show that he helped Vance’s staff arrange the trip.\n\nBrown, who did not respond to a message Wednesday from the AP, said he met the vice president when Vance landed at the airport and then helped escort Vance’s entourage on an hourlong drive by driving second lady Usha Vance’s staff.\n\nAssociated Press writers Zeke Miller in Washington and Matthew Brown in Billings, Montana, contributed to this report.","summary":"It’s not clear why the vice president addressed the group or what they spoke about.","url":"https://www.ocregister.com/2025/06/11/vance-fox-montana/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Vance_88703-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-11 23:51:34","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.16},{"id":330502718,"title":"Vance made a brief trip to Montana to speak to Murdochs, other Fox News executives, AP sources say","text":"By MICHELLE L. PRICE\n\nWASHINGTON (AP) — Vice President JD Vance on Tuesday made a brief trip to Montana, where he spoke to media mogul Rupert Murdoch; his son Lachlan Murdoch, the head of Fox News and News Corp.; and a group of other Fox News executives, according to two people familiar with the trip.\n\nVance met with the group at the Murdoch family ranch in southwest Montana near Dillon, according to the people. They confirmed the visit to The Associated Press on condition of anonymity because they were not authorized to speak publicly about it.\n\nIt’s not clear why the vice president addressed the group or what they spoke about.\n\nA spokesperson for Fox News Channel did not respond to a message seeking comment.\n\nThe vice president’s office does not release a schedule for Vance and did not offer advance notice of the trip, so the surprise arrival of Air Force Two in Butte, Montana, set off local speculation as his motorcade was seen driving away.\n\nThe Murdoch ranch near Dillon is roughly 70 miles south of Butte. The ranch, which Murdoch purchased in 2021, is spread across two valleys and a mountain range and has some 12,000 cattle. It sits near Yellowstone National Park along the Montana-Idaho border.\n\nAccording to flight restrictions issued by the Federal Aviation Administration, the vice presidential aircraft was only on the ground for a matter of hours.\n\nVance was scheduled to have lunch with President Donald Trump on Wednesday, according to the president’s publicly released schedule, meaning the vice president presumably returned to Washington shortly after meeting the Murdochs 2,200 miles away on Tuesday night.\n\nRupert Murdoch and his media organization have long been friendly with Republicans and have, for the most part, had a friendly relationship with Trump. He appeared at Trump’s inauguration and was spotted earlier this year in the Oval Office.\n\nRupert Murdoch, 94, stepped down as the head of Fox News and News Corp. in 2023 and handed control over to son Lachlan.\n\nMontana state Auditor James Brown told the Montana Talks radio show that he helped Vance’s staff arrange the trip.\n\nBrown, who did not respond to a message Wednesday from the AP, said he met the vice president when Vance landed at the airport and then helped escort Vance’s entourage on an hourlong drive by driving second lady Usha Vance’s staff.\n\nAssociated Press writers Zeke Miller in Washington and Matthew Brown in Billings, Montana, contributed to this report.","summary":"It’s not clear why the vice president addressed the group or what they spoke about.","url":"https://www.sandiegouniontribune.com/2025/06/11/vance-fox-montana/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Vance_88703-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-11 23:51:34","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.16},{"id":330496542,"title":"Vance made a brief trip to Montana to speak to Murdochs, other Fox News executives, AP sources say","text":"By MICHELLE L. PRICE\n\nWASHINGTON (AP) — Vice President JD Vance on Tuesday made a brief trip to Montana, where he spoke to media mogul Rupert Murdoch; his son Lachlan Murdoch, the head of Fox News and News Corp.; and a group of other Fox News executives, according to two people familiar with the trip.\n\nVance met with the group at the Murdoch family ranch in southwest Montana near Dillon, according to the people. They confirmed the visit to The Associated Press on condition of anonymity because they were not authorized to speak publicly about it.\n\nIt’s not clear why the vice president addressed the group or what they spoke about.\n\nA spokesperson for Fox News Channel did not respond to a message seeking comment.\n\nThe vice president’s office does not release a schedule for Vance and did not offer advance notice of the trip, so the surprise arrival of Air Force Two in Butte, Montana, set off local speculation as his motorcade was seen driving away.\n\nThe Murdoch ranch near Dillon is roughly 70 miles south of Butte. The ranch, which Murdoch purchased in 2021, is spread across two valleys and a mountain range and has some 12,000 cattle. It sits near Yellowstone National Park along the Montana-Idaho border.\n\nAccording to flight restrictions issued by the Federal Aviation Administration, the vice presidential aircraft was only on the ground for a matter of hours.\n\nVance was scheduled to have lunch with President Donald Trump on Wednesday, according to the president’s publicly released schedule, meaning the vice president presumably returned to Washington shortly after meeting the Murdochs 2,200 miles away on Tuesday night.\n\nRupert Murdoch and his media organization have long been friendly with Republicans and have, for the most part, had a friendly relationship with Trump. He appeared at Trump’s inauguration and was spotted earlier this year in the Oval Office.\n\nRupert Murdoch, 94, stepped down as the head of Fox News and News Corp. in 2023 and handed control over to son Lachlan.\n\nMontana state Auditor James Brown told the Montana Talks radio show that he helped Vance’s staff arrange the trip.\n\nBrown, who did not respond to a message Wednesday from the AP, said he met the vice president when Vance landed at the airport and then helped escort Vance’s entourage on an hourlong drive by driving second lady Usha Vance’s staff.\n\nAssociated Press writers Zeke Miller in Washington and Matthew Brown in Billings, Montana, contributed to this report.","summary":"It’s not clear why the vice president addressed the group or what they spoke about.","url":"https://www.bostonherald.com/2025/06/11/vance-fox-montana/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Vance_88703-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-11 23:51:34","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.16},{"id":330502824,"title":"World News | Hundreds of Laid-off CDC Employees Are Being Reinstated","text":"New York, Jun 12 (AP) More than 460 laid-off employees at the nation's top public health agency received notices on Wednesday that they are being reinstated, according to a union representing the workers. The US Department of Health and Human Services confirmed reinstatement notices went out to the former Centres for Disease Control and Prevention employees, but provided few details. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. About 2,400 CDC employees lost their jobs in a wave of cuts across federal health agencies in early April, according to a tally at the time. Whole CDC programmes were essentially shut down, including some focused on smoking, lead poisoning, gun violence, asthma and air quality, and workplace safety and health. The entire office that handles Freedom of Information Act requests was shuttered. Infectious disease programmes took a hit, too, including programmes that fight outbreaks in other countries, labs focused on HIV and hepatitis in the US, and staff trying to eliminate tuberculosis. Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. An estimated 200 of the reinstated workers are based in the CDC's National Centre for HIV, Viral Hepatitis, STD, and Tuberculosis Prevention, HHS officials confirmed. Staffers at a CDC lab that does testing for sexually transmitted diseases are being brought back, said one CDC employee who was not authorised to discuss what happened and spoke to The Associated Press on condition of anonymity. Also reinstated are an estimated 150 employees at the CDC's National Centre for Environmental Health, including people staffing a lab that works on lead poisoning, according to the union and employees. Layoffs at federal agencies were challenged in lawsuits, with judges in some cases ordering federal agencies to halt terminations of employees. Officials at HHS have never detailed how they made the layoff decisions in the first place. And they did not answer questions about why the notices went out, or how decisions were made about who to bring back. HHS spokesperson Andrew Nixon said the agency was streamlining operations and that \"the nation's critical public health functions remain intact and effective.\" \"The Trump Administration is committed to protecting essential services — whether it is supporting coal miners and firefighters through NIOSH, safeguarding public health through lead prevention, or researching and tracking the most prevalent communicable diseases,\" he said. The reinstatements do not undo the damage being done by Kennedy and the Trump administration to federal public health, said members of Fired But Fighting, a group of affected CDC workers who have helped organise rallies in Atlanta. The most recent was in the rain on Tuesday, at which some attendees called for Kennedy to resign. \"Bringing a few hundred people back to work out of thousands fired is a start, but there are still countless programmes at CDC that have been cut, which will lead to increased disease and death,\" one of the group's founding members, Abby Tighe, said in a statement. This is not the first time that employees at the Atlanta-based agency were told they were being terminated only to then be told to come back. After an earlier round of termination notices went out in February, about 180 CDC employees in March were told to come back. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   More than 460 laid-off employees at the nation's top public health agency received notices on Wednesday that they are being reinstated, according to a union representing the workers.","url":"https://www.latestly.com/agency-news/world-news-hundreds-of-laid-off-cdc-employees-are-being-reinstated-6921683.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-11 23:48:07","author":null,"language":"en","source_country":"in","sentiment":-0.44},{"id":330502722,"title":"Trump is expected to sign a measure blocking California’s nation-leading vehicle emissions rules","text":"By MICHELLE L. PRICE and SOPHIE AUSTIN\n\nWASHINGTON (AP) — President Donald Trump is expected to sign a measure Thursday that blocks California’s first-in-the-nation rule banning the sale of new gas-powered cars by 2035, a White House official told The Associated Press.\n\nThe resolution Trump plans to sign, which Congress approved last month, aims to quash the country’s most aggressive attempt to phase out gas-powered cars. He also plans to approve measures to overturn state policies curbing tailpipe emissions in certain vehicles and smog-forming nitrogen oxide pollution from trucks.\n\nThe timing of the signing was confirmed Wednesday by a White House official who spoke on condition of anonymity to share plans not yet public.\n\nThe development comes as the Republican president is mired in a clash with California’s Democratic governor, Gavin Newsom, over Trump’s move to deploy troops to Los Angeles in response to immigration protests. It’s the latest in an ongoing battle between the Trump administration and heavily Democratic California over everything from tariffs to the rights of LGBTQ+ youth and funding for electric vehicle chargers.\n\n“If it’s a day ending in Y, it’s another day of Trump’s war on California,” Newsom spokesperson Daniel Villaseñor said in an email. “We’re fighting back.”\n\nAccording to the White House official, Trump is expected to sign resolutions that block California’s rule phasing out gas-powered cars and ending the sale of new ones by 2035. He will also kill rules that phase out the sale of medium- and heavy-duty diesel vehicles and cut tailpipe emissions from trucks.\n\nThe president is scheduled to sign the measures and make remarks during an event at the White House on Thursday morning.\n\nNewsom, who is considered a likely 2028 Democratic presidential candidate, and California officials contend that what the federal government is doing is illegal and said the state plans to sue.\n\nTransportation Secretary Sean Duffy, Energy Secretary Chris Wright and Environmental Protection Agency Administrator Lee Zeldin are expected to attend, along with members of Congress and representatives from the energy, trucking and gas station industries.\n\nThe signings come as Trump has pledged to revive American auto manufacturing and boost oil and gas drilling.\n\nThe move will also come a day after the Environmental Protection Agency proposed repealing rules that limit greenhouse gas emissions from power plants fueled by coal and natural gas. Zeldin said it would remove billions of dollars in costs for industry and help “unleash” American energy.\n\nCalifornia, which has some of the nation’s worst air pollution, has been able to seek waivers for decades from the EPA, allowing it to adopt stricter emissions standards than the federal government.\n\nIn his first term, Trump revoked California’s ability to enforce its standards, but President Joe Biden reinstated it in 2022. Trump has not yet sought to revoke it again.\n\nRepublicans have long criticized those waivers and earlier this year opted to use the Congressional Review Act, a law aimed at improving congressional oversight of actions by federal agencies, to try to block the rules.\n\nThat’s despite a finding from the U.S. Government Accountability Office, a nonpartisan congressional watchdog, that California’s standards cannot legally be blocked using the Congressional Review Act. The Senate parliamentarian agreed with that finding.\n\nCalifornia, which makes up roughly 11% of the U.S. car market, has significant power to sway trends in the auto industry. About a dozen states signed on to adopt California’s rule phasing out the sale of new gas-powered cars.\n\nThe National Automobile Dealers Association supported the federal government’s move to block California’s ban on gas-powered cars, saying Congress should decide on such a national issue, not the state.\n\nThe American Trucking Associations said the rules were not feasible and celebrated Congress’ move to block them.\n\nChris Spear, the CEO of the American Trucking Associations, said in a statement Wednesday: “This is not the United States of California.”\n\nIt was also applauded by Detroit automaker General Motors, which said it will “help align emissions standards with today’s market realities.”\n\n“We have long advocated for one national standard that will allow us to stay competitive, continue to invest in U.S. innovation, and offer customer choice across the broadest lineup of gas-powered and electric vehicles,” the company said in a statement.\n\nDan Becker with the Center for Biological Diversity, in anticipation of the president signing the measures, said earlier Thursday that the move would be “Trump’s latest betrayal of democracy.”\n\n“Signing this bill is a flagrant abuse of the law to reward Big Oil and Big Auto corporations at the expense of everyday people’s health and their wallets,” Becker said in a statement.\n\nAustin reported from Sacramento, Calif.","summary":"It’s the latest in an ongoing battle between the Trump administration and heavily Democratic California.","url":"https://www.sandiegouniontribune.com/2025/06/11/trump-california-emission-rules/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Congress_California_Emission_Rules_04075_0732d8.jpg?w=1024&h=685","video":null,"publish_date":"2025-06-11 23:44:54","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.057},{"id":330499326,"title":"Trump is expected to sign a measure blocking California’s nation-leading vehicle emissions rules","text":"By MICHELLE L. PRICE and SOPHIE AUSTIN\n\nWASHINGTON (AP) — President Donald Trump is expected to sign a measure Thursday that blocks California’s first-in-the-nation rule banning the sale of new gas-powered cars by 2035, a White House official told The Associated Press.\n\nThe resolution Trump plans to sign, which Congress approved last month, aims to quash the country’s most aggressive attempt to phase out gas-powered cars. He also plans to approve measures to overturn state policies curbing tailpipe emissions in certain vehicles and smog-forming nitrogen oxide pollution from trucks.\n\nThe timing of the signing was confirmed Wednesday by a White House official who spoke on condition of anonymity to share plans not yet public.\n\nThe development comes as the Republican president is mired in a clash with California’s Democratic governor, Gavin Newsom, over Trump’s move to deploy troops to Los Angeles in response to immigration protests. It’s the latest in an ongoing battle between the Trump administration and heavily Democratic California over everything from tariffs to the rights of LGBTQ+ youth and funding for electric vehicle chargers.\n\n“If it’s a day ending in Y, it’s another day of Trump’s war on California,” Newsom spokesperson Daniel Villaseñor said in an email. “We’re fighting back.”\n\nAccording to the White House official, Trump is expected to sign resolutions that block California’s rule phasing out gas-powered cars and ending the sale of new ones by 2035. He will also kill rules that phase out the sale of medium- and heavy-duty diesel vehicles and cut tailpipe emissions from trucks.\n\nThe president is scheduled to sign the measures and make remarks during an event at the White House on Thursday morning.\n\nNewsom, who is considered a likely 2028 Democratic presidential candidate, and California officials contend that what the federal government is doing is illegal and said the state plans to sue.\n\nTransportation Secretary Sean Duffy, Energy Secretary Chris Wright and Environmental Protection Agency Administrator Lee Zeldin are expected to attend, along with members of Congress and representatives from the energy, trucking and gas station industries.\n\nThe signings come as Trump has pledged to revive American auto manufacturing and boost oil and gas drilling.\n\nThe move will also come a day after the Environmental Protection Agency proposed repealing rules that limit greenhouse gas emissions from power plants fueled by coal and natural gas. Zeldin said it would remove billions of dollars in costs for industry and help “unleash” American energy.\n\nCalifornia, which has some of the nation’s worst air pollution, has been able to seek waivers for decades from the EPA, allowing it to adopt stricter emissions standards than the federal government.\n\nIn his first term, Trump revoked California’s ability to enforce its standards, but President Joe Biden reinstated it in 2022. Trump has not yet sought to revoke it again.\n\nRepublicans have long criticized those waivers and earlier this year opted to use the Congressional Review Act, a law aimed at improving congressional oversight of actions by federal agencies, to try to block the rules.\n\nThat’s despite a finding from the U.S. Government Accountability Office, a nonpartisan congressional watchdog, that California’s standards cannot legally be blocked using the Congressional Review Act. The Senate parliamentarian agreed with that finding.\n\nCalifornia, which makes up roughly 11% of the U.S. car market, has significant power to sway trends in the auto industry. About a dozen states signed on to adopt California’s rule phasing out the sale of new gas-powered cars.\n\nThe National Automobile Dealers Association supported the federal government’s move to block California’s ban on gas-powered cars, saying Congress should decide on such a national issue, not the state.\n\nThe American Trucking Associations said the rules were not feasible and celebrated Congress’ move to block them.\n\nChris Spear, the CEO of the American Trucking Associations, said in a statement Wednesday: “This is not the United States of California.”\n\nIt was also applauded by Detroit automaker General Motors, which said it will “help align emissions standards with today’s market realities.”\n\n“We have long advocated for one national standard that will allow us to stay competitive, continue to invest in U.S. innovation, and offer customer choice across the broadest lineup of gas-powered and electric vehicles,” the company said in a statement.\n\nDan Becker with the Center for Biological Diversity, in anticipation of the president signing the measures, said earlier Thursday that the move would be “Trump’s latest betrayal of democracy.”\n\n“Signing this bill is a flagrant abuse of the law to reward Big Oil and Big Auto corporations at the expense of everyday people’s health and their wallets,” Becker said in a statement.\n\nAustin reported from Sacramento, Calif.","summary":"It’s the latest in an ongoing battle between the Trump administration and heavily Democratic California.","url":"https://www.denverpost.com/2025/06/11/trump-california-emission-rules/","image":"https://www.denverpost.com/wp-content/uploads/2025/06/Congress_California_Emission_Rules_04075_0732d8.jpg?w=1024&h=685","video":null,"publish_date":"2025-06-11 23:44:54","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"US","sentiment":0.057},{"id":330496544,"title":"Trump is expected to sign a measure blocking California’s nation-leading vehicle emissions rules","text":"By MICHELLE L. PRICE and SOPHIE AUSTIN\n\nWASHINGTON (AP) — President Donald Trump is expected to sign a measure Thursday that blocks California’s first-in-the-nation rule banning the sale of new gas-powered cars by 2035, a White House official told The Associated Press.\n\nThe resolution Trump plans to sign, which Congress approved last month, aims to quash the country’s most aggressive attempt to phase out gas-powered cars. He also plans to approve measures to overturn state policies curbing tailpipe emissions in certain vehicles and smog-forming nitrogen oxide pollution from trucks.\n\nThe timing of the signing was confirmed Wednesday by a White House official who spoke on condition of anonymity to share plans not yet public.\n\nThe development comes as the Republican president is mired in a clash with California’s Democratic governor, Gavin Newsom, over Trump’s move to deploy troops to Los Angeles in response to immigration protests. It’s the latest in an ongoing battle between the Trump administration and heavily Democratic California over everything from tariffs to the rights of LGBTQ+ youth and funding for electric vehicle chargers.\n\n“If it’s a day ending in Y, it’s another day of Trump’s war on California,” Newsom spokesperson Daniel Villaseñor said in an email. “We’re fighting back.”\n\nAccording to the White House official, Trump is expected to sign resolutions that block California’s rule phasing out gas-powered cars and ending the sale of new ones by 2035. He will also kill rules that phase out the sale of medium- and heavy-duty diesel vehicles and cut tailpipe emissions from trucks.\n\nThe president is scheduled to sign the measures and make remarks during an event at the White House on Thursday morning.\n\nNewsom, who is considered a likely 2028 Democratic presidential candidate, and California officials contend that what the federal government is doing is illegal and said the state plans to sue.\n\nTransportation Secretary Sean Duffy, Energy Secretary Chris Wright and Environmental Protection Agency Administrator Lee Zeldin are expected to attend, along with members of Congress and representatives from the energy, trucking and gas station industries.\n\nThe signings come as Trump has pledged to revive American auto manufacturing and boost oil and gas drilling.\n\nThe move will also come a day after the Environmental Protection Agency proposed repealing rules that limit greenhouse gas emissions from power plants fueled by coal and natural gas. Zeldin said it would remove billions of dollars in costs for industry and help “unleash” American energy.\n\nCalifornia, which has some of the nation’s worst air pollution, has been able to seek waivers for decades from the EPA, allowing it to adopt stricter emissions standards than the federal government.\n\nIn his first term, Trump revoked California’s ability to enforce its standards, but President Joe Biden reinstated it in 2022. Trump has not yet sought to revoke it again.\n\nRepublicans have long criticized those waivers and earlier this year opted to use the Congressional Review Act, a law aimed at improving congressional oversight of actions by federal agencies, to try to block the rules.\n\nThat’s despite a finding from the U.S. Government Accountability Office, a nonpartisan congressional watchdog, that California’s standards cannot legally be blocked using the Congressional Review Act. The Senate parliamentarian agreed with that finding.\n\nCalifornia, which makes up roughly 11% of the U.S. car market, has significant power to sway trends in the auto industry. About a dozen states signed on to adopt California’s rule phasing out the sale of new gas-powered cars.\n\nThe National Automobile Dealers Association supported the federal government’s move to block California’s ban on gas-powered cars, saying Congress should decide on such a national issue, not the state.\n\nThe American Trucking Associations said the rules were not feasible and celebrated Congress’ move to block them.\n\nChris Spear, the CEO of the American Trucking Associations, said in a statement Wednesday: “This is not the United States of California.”\n\nIt was also applauded by Detroit automaker General Motors, which said it will “help align emissions standards with today’s market realities.”\n\n“We have long advocated for one national standard that will allow us to stay competitive, continue to invest in U.S. innovation, and offer customer choice across the broadest lineup of gas-powered and electric vehicles,” the company said in a statement.\n\nDan Becker with the Center for Biological Diversity, in anticipation of the president signing the measures, said earlier Thursday that the move would be “Trump’s latest betrayal of democracy.”\n\n“Signing this bill is a flagrant abuse of the law to reward Big Oil and Big Auto corporations at the expense of everyday people’s health and their wallets,” Becker said in a statement.\n\nAustin reported from Sacramento, Calif.","summary":"It’s the latest in an ongoing battle between the Trump administration and heavily Democratic California.","url":"https://www.bostonherald.com/2025/06/11/trump-california-emission-rules/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Congress_California_Emission_Rules_04075_0732d8.jpg?w=1024&h=685","video":null,"publish_date":"2025-06-11 23:44:54","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.057},{"id":330495214,"title":"Calm returns to Los Angeles after hundreds arrested","text":"An uneasy calm has descended over Los Angeles after the first night of a curfew lifted on Wednesday, as cities across the US brace for more protests.\n\nIn Los Angeles, nearly 400 people have so far been arrested, including 330 undocumented migrants and 157 people arrested for assault and obstruction, including one for the attempted murder of a police officer.\n\nFederal prosecutors have so far charged two men for throwing Molotov cocktails at police officers in two separate incidents.\n\nA total of 4,000 National Guard troops and 700 Marines have been deployed to help quell the unrest.\n\nSpeaking alongside 30 regional mayors at a news conference on Wednesday, LA Mayor Karen Bass blamed the protests on US President Donald Trump's immigration raids, which she said \"provoked\" residents by causing \"fear\" and \"panic\".\n\n\"A week ago, everything was peaceful,\" she said. \"Things began to be difficult on Friday when raids took place.\"\n\nBass suggested Los Angeles was \"part of a national experiment to determine how far the federal government can go in taking over power from a local government, from a local jurisdiction\".\n\nShe has previously called on the administration to end the raids.\n\nOvernight, Los Angeles police said they made \"mass arrests\" after a fifth day of protests over the immigration action.\n\nIn a series of statements, the city's police department said that those detained included 203 people arrested for failure to disperse, 17 for curfew violations, three for possession of a firearm, and one for assault with a deadly weapon on a police officer.\n\nTwo officers were injured in the skirmishes, the statement added.\n\nOn Tuesday, Bass declared an overnight curfew within a relatively small area of the city's downtown district, saying businesses were being vandalised and looted.\n\nAfter the LA curfew came into force at 20:00 local time on Tuesday (03:00 GMT on Wednesday), police moved through downtown areas, firing rubber bullets to try to disperse crowds.\n\nExplaining the curfew on Tuesday, Bass said she wanted \"to stop the vandalism, to stop the looting\", saying the city had reached a \"tipping point\".\n\nThe curfew order affects an area of about one square mile in the second-largest city in the US.\n\nPolice chief Jim McDonnell said: \"Some of the imagery of the protests and the violence gives the appearance as though this is a city-wide crisis, and it is not.\"\n\nPam Bondi, the US attorney general, told reporters at the White House on Wednesday that the curfew \"helped a bit\".\n\nElsewhere, the immigration raids have continued, alongside the National Guard troops.\n\nThe National Guard and Marine Corps forces deployed to Los Angeles do not have the authority to make arrests, only to detain protesters.\n\n\"They are strictly used for the protection of the federal personnel as they conduct their operations and to protect them to allow them to do their federal mission,\" said Major General Scott Sherman, who is leading the deployment, on Wednesday.\n\nTrump's row with state officials ramped up after he deployed troops to LA. The president has now vowed to \"liberate\" the city, but has been accused by California Governor Gavin Newsom of an \"assault\" on democracy.\n\nTrump earlier this week defended his decision to send troops, saying it was to prevent the city being \"conquered by a foreign enemy\".\n\nNewsom hit back at the president: \"He again chose escalation; he chose more force.\"\n\nThe California governor, who is seen as a potential presidential contender for the Democratic Party, warned that \"other states are next\".\n\nOn Wednesday, Defence Secretary Pete Hegseth backed Trump's move, telling a Senate hearing that sending the troops to Los Angeles was \"lawful and constitutional\".\n\nChaotic protests also sprung up on Tuesday in several other US cities:\n\nIn Atlanta, Georgia, riot police used tear gas on protesters who set off fireworks towards officers at a demonstration attended by hundreds\n\nPolice in New York told the BBC dozens were arrested for blocking vehicular traffic after several thousand marched into lower Manhattan\n\nTexas Governor Greg Abbott sent National Guard troops to San Antonio, where immigration rallies are planned\n\nThe military deployment to the LA area will cost $134m (£99m), the Pentagon said.\n\nTrump described the protests as a \"full-blown assault on peace and public order\" while addressing troops at the Fort Bragg military base in North Carolina.\n\nThe Republican president said he plans to use \"every asset at our disposal to quell the violence\".\n\nMeanwhile, Trump's political row with state officials has intensified. The president has described the protesters as \"animals\" and vowed that \"this anarchy will not stand\".\n\nHe urged troops to boo the names of Newsom and Joe Biden, his presidential predecessor, during his Fort Bragg speech.\n\nIn televised remarks of his own on Tuesday night, Newsom again criticised the president's rare deployment of the US military without a request from state officials. He accused Trump of a \"brazen abuse of power\".\n\n\"California may be first – but it clearly won't end here,\" he said. \"Other states are next. Democracy is next. Democracy is under assault right before our eyes.\"\n\nEarlier in the day, a federal court denied an emergency request from California to block the use of troops sent to LA.\n\nDistrict Judge Charles Breyer scheduled a hearing on the motion for Thursday.\n\nTrump has set a goal for border agents of at least 3,000 daily arrests as he seeks to ramp up mass deportations, a signature pledge of his re-election campaign.\n\nSince assuming office, the president has drastically reduced illegal crossings at the US-Mexico border to historically low levels.\n\nA CBS News/YouGov poll conducted in early June, before the protests kicked off, found 54% of Americans saying they approved of Trump's deportation policy, and 50% approved of how he was handling immigration.\n\nThat compares with smaller numbers of 42% who gave approval to his economic policy and 39% for his policy on tackling inflation.","summary":"An uneasy calm has descended over Los Angeles after the first night of a curfew lifted on Wednesday, as cities across the US brace for more protests.","url":"https://www.myjoyonline.com/calm-returns-to-los-angeles-after-hundreds-arrested/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/06/image-538.png","video":null,"publish_date":"2025-06-11 23:44:00","author":"Abubakar Ibrahim,California Governor Gavin","authors":["Abubakar Ibrahim","California Governor Gavin"],"language":"en","source_country":"gh","sentiment":-0.241},{"id":330505200,"title":"Homeland Security turns on Kim Kardashian after reality star is mocked over ICE criticism","text":"The Department of Homeland Security joined the growing number of voices hitting out at Kim Kardashian for her criticism of the Immigration and Customs Enforcement actions in Los Angeles.\n\nThe 44-year-old reality television star took to Instagram on Tuesday night to advocate for the immigrants being torn apart from their families in President Donald Trump's ongoing crackdown on those in the country illegally.\n\n'When we're told that ICE exists to keep our country safe and remove violent criminals - great,' the mother-of-four wrote as riots in the city continued.\n\n'But when we witness innocent, hardworking people being ripped from their families in inhumane ways, we have to speak up. We have to do what's right.'\n\nAssistant Homeland Security Secretary Tricia McLaughlin slammed the reality star for her comment as she doubled down on the Trump administration's assertions that the ICE operations in Los Angeles are targeting convicted criminals. \n\n'@KimKardashian, which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the country,' McLaughlin posted on X, sharing photos of four individuals she said ICE arrested in recent days from the City of Angels.\n\n'These are just a few of the convicted illegal criminals who have been picked up in the last 72 hours.'\n\nOthers accused the billionaire - who is good friends with Ivanka Trump - of virtue signaling. \n\n'Eh not buying it,' one Reddit user said.\n\n'She needs to call out her friend Trump by name directly if she wants people think she's being genuine. \n\n'These deportations have been going on for years since the first Trump admin and she only decides to speak up when it's convenient, when people will question her silence if she doesn't.'\n\n'Why doesn't she just call up her bestie Ivanka?!' another asked. 'C'mon Kim - get your a** up and WORK.'\n\nA third blasted: 'This is for public perception only. She has a direct line to the Trump/Kushner clan. Wtf is she telling us for? Call up your bestie, Kimberly.'\n\n'She's got Ivanka on speed dial,' a fourth agreed. 'She could easily go that route, if need be.' \n\n'Every time I see Kim K virtue signal I die a little inside,' added another.\n\n'You say \"damned if you do\" as if she's \"doing\" anything,' said a sixth. 'She has a direct line to the Trumps and could call that f**ker out by name if she really cared. But she doesn't. Her words are meaningless.'\n\nA seventh pointed out: 'She has actual ability to do a whole lot more.'\n\nKim has never spoken publicly about who she endorsed in the 2024 Presidential election, in which Donald Trump triumphed over Democrat candidate Kamala Harris.\n\nHowever, she has a close friendship with Trump's daughter Ivanka.\n\nKim and Ivanka's friendship traces back several years, and it only strengthened after the pair began working on prison reforms together.\n\nThe duo first crossed paths in 2014 at the Met Gala, where it was said that they bonded over motherhood.\n\nA source told Us Weekly in 2023, 'Kim and Ivanka have been friends for years and have hung out on a number of occasions.\n\n'They initially bonded nearly a decade ago at the Met Gala over motherhood and being new moms. But they continued to connect numerous times over the years.'\n\nSince their initial meeting a decade ago, the women have been spotted together on numerous occasions.\n\nIn 2018, the pair was seen posing side by side at the White House, where Kim was petitioning Ivanka's father, then-President Trump, to commute the life sentence of drug offender Alice Marie Johnson.\n\nThe duo worked closely together to reduce and clear prison sentences - with Kim often confiding in Ivanka while attending dinner parties at her house.\n\nAnd by 2020, the reality star was gushing about Ivanka's dad online.\n\n'President Trump commuted the sentences of three really deserving women. I didn't hear much about it in the news, so I wanted to share with you their stories,' she wrote on X (formerly Twitter).\n\n'I have the pleasure of spending the day with these women today along with Alice Marie Johnson, who helped to pick these women.'\n\nMeanwhile, the White House has said its deportation efforts in Los Angeles are continuing - despite Kardashian's comments and photos and videos showing protesters wearing face masks confronting police in riot gear.\n\n'The Trump Administration will fulfill the President’s promise to deport illegal aliens and no one – not even violent left-wing rioters – will get in the way of our mission,' White House spokeswoman Abigail Jackson told the Daily Mail on Wednesday.\n\n'ICE is arresting illegal aliens and will continue to do so all around the country no matter what radical liberals do, the safety of the American people depends on it,' she said in a statement.\n\n'Radical liberal rioters, enabled by weak politicians like Gavin Newsom, are using violence to try and stop the American people’s agenda from being implemented. It won’t work,' Jackson told the Daily Mail. \n\n'In November, the American people gave President Trump a mandate: deportations.' \n\nAnd according to migrant arrest data exclusively provided to the Daily Mail, ICE's Los Angeles team is continuing to act on the president's orders.","summary":"The Department of Homeland Security joined the growing number of voices hitting out at Kim Kardashian for her criticism of the Immigration and Customs Enforcement actions in Los Angeles.","url":"https://www.dailymail.co.uk/news/article-14803871/Homeland-Security-turns-Kim-Kardashian-ICE-criticism.html","image":"https://i.dailymail.co.uk/1s/2025/06/12/00/99282851-0-image-m-41_1749683696916.jpg","video":null,"publish_date":"2025-06-11 23:43:15","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.094},{"id":330502806,"title":"World News | Trump is Expected to Sign a Measure Blocking California's Nation-leading Vehicle Emissions Rules","text":"Washington, Jun 12 (AP) President Donald Trump is expected to sign a measure on Thursday that blocks California's first-in-the-nation rule banning the sale of new gas-powered cars by 2035, a White House official told The Associated Press. The resolution Trump plans to sign, which Congress approved last month, aims to quash the country's most aggressive attempt to phase out gas-powered cars. He also plans to approve measures to overturn state policies curbing tailpipe emissions in certain vehicles and smog-forming nitrogen oxide pollution from trucks. Also Read | US: Toddler Dies of Suspected Heat Stroke After Drunk Man Leaves Her in Hot Car for 9 Hours in Louisiana, Arrested. The timing of the signing was confirmed on Wednesday by a White House official who spoke on condition of anonymity to share plans not yet public. The development comes as the Republican president is mired in a clash with California's Democratic governor, Gavin Newsom, over Trump's move to deploy troops to Los Angeles in response to immigration protests. It is the latest in an ongoing battle between the Trump administration and heavily Democratic California over everything from tariffs to the rights of LGBTQ+ youth and funding for electric vehicle chargers. Also Read | Elon Musk Backs Off From Feud With US President Donald Trump, Says 'Social Media Posts Went Too Far'. \"If it is a day ending in Y, it is another day of Trump's war on California,\" Newsom spokesperson Daniel Villaseñor said in an email. \"We're fighting back.\" According to the White House official, Trump is expected to sign resolutions that block California's rule phasing out gas-powered cars and ending the sale of new ones by 2035. He will also kill rules that phase out the sale of medium- and heavy-duty diesel vehicles and cut tailpipe emissions from trucks. The president is scheduled to sign the measures and make remarks during an event at the White House on Thursday morning. Newsom, who is considered a likely 2028 Democratic presidential candidate, and California officials contend that what the federal government is doing is illegal and said the state plans to sue. Transportation Secretary Sean Duffy, Energy Secretary Chris Wright and Environmental Protection Agency Administrator Lee Zeldin are expected to attend, along with members of Congress and representatives from the energy, trucking and gas station industries. The signings come as Trump has pledged to revive American auto manufacturing and boost oil and gas drilling. The move will also come a day after the Environmental Protection Agency proposed repealing rules that limit greenhouse gas emissions from power plants fuelled by coal and natural gas. Zeldin said it would remove billions of dollars in costs for industry and help \"unleash\" American energy. California, which has some of the nation's worst air pollution, has been able to seek waivers for decades from the EPA, allowing it to adopt stricter emissions standards than the federal government. In his first term, Trump revoked California's ability to enforce its standards, but President Joe Biden reinstated it in 2022. Trump has not yet sought to revoke it again. Republicans have long criticised those waivers and earlier this year opted to use the Congressional Review Act, a law aimed at improving congressional oversight of actions by federal agencies, to try to block the rules. That is despite a finding from the US Government Accountability Office, a nonpartisan congressional watchdog, that California's standards cannot legally be blocked using the Congressional Review Act. The Senate parliamentarian agreed with that finding. California, which makes up roughly 11 per cent of the US car market, has significant power to sway trends in the auto industry. About a dozen states signed on to adopt California's rule phasing out the sale of new gas-powered cars. The National Automobile Dealers Association supported the federal government's move to block California's ban on gas-powered cars, saying Congress should decide on such a national issue, not the state. The American Trucking Associations said the rules were not feasible and celebrated Congress' move to block them. Chris Spear, the CEO of the American Trucking Associations, said in a statement Wednesday, \"This is not the United States of California.\" It was also applauded by Detroit automaker General Motors, which said it will \"help align emissions standards with today's market realities.\" \"We have long advocated for one national standard that will allow us to stay competitive, continue to invest in US innovation, and offer customer choice across the broadest lineup of gas-powered and electric vehicles,\" the company said in a statement. Dan Becker with the Centre for Biological Diversity, in anticipation of the president signing the measures, said earlier on Thursday that the move would be \"Trump's latest betrayal of democracy.\" \"Signing this bill is a flagrant abuse of the law to reward Big Oil and Big Auto corporations at the expense of everyday people's health and their wallets,\" Becker said in a statement. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump is expected to sign a measure on Thursday that blocks California's first-in-the-nation rule banning the sale of new gas-powered cars by 2035, a White House official told The Associated Press.","url":"https://www.latestly.com/agency-news/world-news-trump-is-expected-to-sign-a-measure-blocking-californias-nation-leading-vehicle-emissions-rules-6921682.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-11 23:42:08","author":null,"language":"en","source_country":"in","sentiment":-0.066}]}