{"offset":0,"number":50,"available":14716,"news":[{"id":291941602,"title":"Battle of the chambers: Trump budget test vote cleared in Senate as House GOP lags behind","text":"The Senate pressed on with its effort to pass a key President Donald Trump agenda item before the Republicans in the House of Representatives get a chance to do it their way. Republicans advanced a budget resolution in a 50-47 vote to tackle part of Trump&apos;s goals on Tuesday night after moving it through the all-important budget committee last week. \"It’s time to act on the decisive mandate the American people gave to President Trump in November. Securing the border, rebuilding our defense, and unleashing American energy. That starts this week with passing Chairman [Sen. Lindsey Graham&apos;s] budget. Let’s get it done,\" Senate Majority Leader John Thune, R-S.D., wrote in a post on X ahead of the vote. MCCONNELL&apos;S MENTAL ACUITY TARGETED BY TRUMP AFTER EX-SENATE LEADER JOINS DEMS AGAINST CABINET NOMINEES The progress on the Senate GOP&apos;s preferred two-pronged budget reconciliation approach adds fuel to the growing dispute between the upper and lower chambers on how to proceed. The House and Senate GOP&apos;s have favored different ways to use the crucial reconciliation process to achieve Trump&apos;s priorities quickly, and up until recent weeks, the lower chamber was expected to take the lead. The reconciliation process lowers the threshold to advance a bill in the Senate from 60 votes to just 51. And with a 53-vote majority in the upper chamber, Republicans are poised to push policies through with only support from the GOP conference. In the Senate Republicans&apos; plan, the first reconciliation bill would include Trump&apos;s priorities for border security, fossil fuel energy and national defense. The second bill, drawn up later in the year, would focus on extending Trump&apos;s tax policies from the Tax Cuts and Jobs Act (TCJA). The cuts begin to expire at the end of 2025. DEMS TORCHED OVER DOGE SECURITY CLAIMS AFTER ALLOWING &apos;WIDE-OPEN&apos; BORDER, &apos;EMPOWERING IRAN&apos; House Republicans have long-favored one large reconciliation bill that includes all of Trump&apos;s agenda items, from border security to tax cuts. However, the lower chamber failed to move before its Senate counterpart. \"I&apos;m afraid it&apos;s a nonstarter over here. And, you know, I&apos;ve expressed that to him. And there is no animus or daylight between us. We all are trying to get to the same achievable objectives. And there&apos;s just, you know, different ideas on how to get there,\" House Speaker Mike Johnson, R-La., previously said of the Senate&apos;s bill. Ahead of the Senate&apos;s Tuesday test vote, House Majority Leader Steve Scalise, R-La., called on Republicans to pass the House bill, \"It’s time to act on ALL of the powerful mandates the American people gave to [Trump] in November: Securing the border, opening up American energy to lower costs, keeping tax rates low (including no tax on tips), strengthening our national defense, a two-year extension of the debt ceiling, and passing into law DOGE&apos;s identified waste in government.\" \"All of Trump’s priorities in one big, beautiful bill start moving when we pass [Budget Committee Chairman Jodey Arrington&apos;s] budget. Let’s go Make America Great Again!\" Scalise added. TRUMP AGRICULTURE PICK CONFIRMED AS PRESIDENT RACKS UP CABINET WINS In the upper chamber, facing pressure as the Senate Budget Committee chairman, Lindsey Graham, R-S.C., brought up the first bill of two in his committee last week as Trump officials stressed an urgent need for border funding to Congress. The House GOP recently moved its own large bill through committee. Republicans in the lower chamber have held that taking on two bills as opposed to one would leave them vulnerable to failure when it comes to passing tax cuts later in the year. With a slim and sometimes unruly Republican majority, the House Republicans expect they would have better odds with a one-bill reconciliation approach. Despite this, the Senate appears to be pressing forward on its two-pronged bid, setting up a potential \"vote-a-rama\" in the coming days. CLICK HERE TO GET THE FOX NEWS APP The Senate budget vote triggered a 50-hour clock for debate on the reconciliation measure. A marathon of votes on an unlimited number of amendments is expected to follow at some point during the days-long debate. Senators can offer up as many amendments as they want to the resolution, forcing Republicans to take a large number of potentially uncomfortable votes. As long as senators keep offering amendments, the Senate has to keep voting on them, one after another. Once the budget debate clock runs out, the Senate can vote on actually passing the reconciliation resolution.","summary":"The Senate maneuvered past a procedural hurdle on its preferred Trump budget bill after leapfrogging the House Republicans, who were expected to take the lead on the process.","url":"https://www.foxbusiness.com/fox-news-politics/battle-chambers-trump-budget-test-vote-cleared-senate-house-gop-lags-behind","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/02/mike-johnson-and-john-thune.jpg","video":null,"publish_date":"2025-02-19 01:00:08","author":"Aubrie Spady,Chad Pergram,Elizabeth Elkind,Julia Johnson,Tyler Olson","authors":["Aubrie Spady","Chad Pergram","Elizabeth Elkind","Julia Johnson","Tyler Olson"],"language":"en","category":"politics","source_country":"us","sentiment":0.047},{"id":291941226,"title":"EastEnders fans FINALLY discover who attacked Cindy Beale as the Queen Vic goes up in flames in nail-biting episode - but who will live to tell the tale?","text":"Black Friday\n\nBritain's Got Talent\n\nLove Island All Stars\n\nDancing On Ice\n\nPrivacy Policy\n\nWednesday, Feb 19th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nEastEnders fans FINALLY discover who attacked Cindy Beale as the Queen Vic goes up in flames in nail-biting episode - but who will live to tell the tale?\n\nHave YOU got a story? Email tips@dailymail.com \nBy SEAN O'GRADY \n Published:00:53 GMT, 19 February 2025 |Updated:00:57 GMT, 19 February 2025 \n\nEastEnders fans finally learned who attacked Cindy Beale during Tuesday's nail-biting episode.\nDuring last year's Christmas special, Cindy (Michelle Collins) was left for dead after someone picked up a shovel and moments later, she was seen lying face down on the floor. \nWith nine suspects potentially responsible, it was at last revealed that Cindy's attacker was none other than Kathy Beale (Gillian Taylforth).\nCindy confronted Ian (Adam Woodyatt) with Phil Mitchell's gun after finding out he had their daughter Lucy's locket which was taken during the attack.\nCindy believed this confirmed her ex-husband was responsible but he pinned the blame on their son Peter.\nBut then Kathy arrived into the home and - begging Cindy to leave Ian alone - revealed she was the culprit.\n\nEastEnders fans finally learned who attacked Cindy Beale during Tuesday's nail-biting episode\n\nThis set off a chain of events that led to the car crashing into the Queen Vic which exploded, with the fate of those left inside unknown\n\nKathy ceme face to face with Cindy and revealed herself as the culprit\n\nThose nearby fled the exposion which will undoubtedly send shockwaves through Walford\n'It was me,' she said. 'I saw what you did to him. I saw him throw you out. Out in the snow. And I thought that was it. That you were gone, that all of this was finally over.\n'Ian, he just fell to pieces. He went crazy. And I had to stand there and watch that. Watch what you had done to him.'\nChillingly, Kathy added: 'My only regret? That you are still breathing.'\nA scuffle ensued with Ian shot in the arm. Cindy eventually shoved Ian into murderer Reiss Colwell's moving car.\nThis set off a chain of events that led to the car crashing into the Queen Vic which exploded, with the fate of those left inside unknown. \nViewers took to X to react to the dramatic episode, with many expressing doubt Kathy is the real attacker and instead might be covering for someone.\nThey wrote: 'I'm a little in disbelief about it being Kathy'... 'Tonight's EastEnders was brilliant. Don't believe Kathy.'\n\nViewers took to X to react to the dramatic episode, with many expressing doubt Kathy is the real attacker and instead might be covering for someone\n\nOthers praised the dramatic explosion at the Queen Vic, writing: 'what a brilliant episode with great acting, storytellling and stunts!'\n'Could Kathy be covering for Bobby, Jane or Cindy Jnr?'... 'Not convinced it's Kathy.'\nOthers praised the dramatic explosion at the Queen Vic, writing: 'what a brilliant episode with great acting, storytellling and stunts!'\n'This is incredible. EastEnders you need the NTA for this episode. The Queen Vic holy smokes, literally.' \nEastendersMichelle CollinsAdam Woodyatt\n\nShare or comment on this article: \nEastEnders fans FINALLY discover who attacked Cindy Beale as the Queen Vic goes up in flames in nail-biting episode - but who will live to tell the tale?\n\nAdd comment\n\nEnter search term:\n\nPete Doherty reveals doctors have warned him he is at risk of having his toes amputated amid his fight with Type 2 diabetes\n\nMindy Kaling gives telling hint about relationship with rumored baby daddy BJ Novak at Walk Of Fame ceremony\n\nSmooth-faced Courteney Cox looks sizzling at 60 in tiny bikini during Australian holiday with daughter Coco, 20\n\nAre Taylor Swift and Blake Lively over? Best pals no longer speaking after explosive Justin Baldoni scandal shook decade-long friendship\n\nBREAKING NEWS\nPlayboy model Ariane Bellamar dead at 46 after heart complications\n\n'The results are unbelievable': Women are so obsessed with this beauty gummy they've chewed 30MILLION of them!\n\nGordon Ramsay breaks cover with his glamorous wife Tana and daughter Holly as they attend F1 75 Live event amid Gino D'Acampo controversy\n\nValerie Bertinelli says she 'fumbled the last good man' after tough split from Mike Goodnough\n\nMax George is forced to cancel The Wanted 2.0's upcoming Manchester gig after his second heart operation\n\nLooking to boost your gut health? It's all about knowing where to start! What to keep front of mind when supporting your microbiome\n\nThe Jam legend Rick Buckler dies aged 69 as bandmate Paul Weller leads tributes\n\nMelanie Sykes blasts Gino D'Acampo as she admits 'the industry has created monsters' while urging bosses to 'clean out misogynistic' talent\n\nBraless Maura Higgins shows off new bob haircut as she attends star-studded F1 75 Live event after splitting from Pete Wicks\n\nEastEnders fans FINALLY discover who attacked Cindy Beale as the Queen Vic goes up in flames in nail-biting episode - but who will live to tell the tale?\n\nRange revolution: How four drivers got from Eastbourne to Aberdeen on one tank of fuel thanks to the JAECOO 7 SHS's clever new tech\n\nWinnie Harlow is engaged! Model will wed basketball star Kyle Kuzma after he presented an 8.5 carat diamond ring\n\nJustin Baldoni's lawyer responds to THAT Ryan Reynolds' SNL joke as he returned to spotlight with Blake Lively\n\nLove Island star Whitney Adebayo goes braless in a VERY risqué outfit as she arrives at the 2025 MOBO Awards\n\nLinkin Park star Chester Bennington's trans child Draven has barbed message for haters after coming out\n\nUp-to-date on the latest, must-have tech? Get yourself gadget-ed up with this month's top 10 devices\n\nMOBO Awards 2025 WINNERS: Central Cee scores Best Male Act for third year in a row while Ayra Starr triumphs over Kendrick Lamar and Beyoncé \n\nCristiano Ronaldo's £61MILLION private jet is 'grounded' at Manchester Airport - after a 'crack is discovered in the window of the plane'\n\nBaywatch babe! Australia's 'most sexually active woman' Annie Knight channels Pamela Anderson in skimpy red swimsuit \n\nAmerican Idol finalist sparks concern as fans worry she looks 'unwell' in new photos: 'Is she ok?'\n\nLove is in the air: 10 top brands to help you celebrate your special someone with style, from roses to jewellery\n\nNicole Kidman and Keith Urban's Beverly Hills mansion burglarized amid wave of celebrity home break-ins\n\nMOBOs founder Kanya King, 56, emotionally admits she didn't know if she'd make it to the 2025 awards after terminal cancer diagnosis\n\nJason Kelce reveals huge change in brother Travis amid Taylor Swift romance\n\nJustin Baldoni's lawyer claims star is losing 'substantial amount of work' amid Blake Lively feud\n\nEDEN CONFIDENTIAL: Prince Harry's ex Chelsey Davy scraps debt-laden luxury travel firm\n\nUS rap star Lil Baby announces Australia and New Zealand tour to support his new album\n\nDrew Barrymore reveals she and ex Luke Wilson were once detained over unsavory act at Beck concert\n\nNicola Hughes is pregnant! Made In Chelsea star confirms she is expecting her second child with husband Charlie Tupper\n\nBillie Eilish fans raise concerns as singer announces she's sick during Brisbane show... after she was sporting a face mask when flying into Melbourne\n\nThis £31 beauty buy loved by Victoria Beckham and Zendaya is so good one is sold every MINUTE - now you'll donate £5 to charity with every purchase\n\nKevin Spacey hits back at Guy Pearce in scathing video after actor said he was 'scared' of disgraced Oscar-winner\n\nMOBOs host Indiyah Polack looks incredible in a naked-look dress as she joins chic Vick Hope and Leomie Anderson in leading the arrivals at music awards\n\nBritish star makes history at 2025 Oscars with milestone nominations - but you've probably never heard of them\n\nWhy Meghan Markle's 'messy' rebrand 'raises questions,' according to PR expert\n\nJustin Baldoni's lawyer gives candid update on actor's mental health amid Blake Lively feud\n\nA-list Hollywood actress looks unrecognizable with shaggy bleached blonde hair in LA\n\nKim Kardashian's mother Kris Jenner calls herself Paris Hilton's 'auntie' as she wishes the star a happy 44th birthday\n\nWhat was she thinking? Blake Lively invited Justin Baldoni to her trailer as she 'openly breastfed' son \n\nBenny Blanco makes very sad admission about his relationship with fiancée Selena Gomez as he opens up about their future together\n\nCalling all fashion lovers! You're about to see this £15 tote bag everywhere - and it's all for a good cause\n\nTom Hanks BLASTED by ex Saturday Night Live star over portrayal of MAGA supporter on 50th anniversary special\n\nBritney Spears is back with lawyer Mathew Rosengart amid worrying on-again romance with ex-convict Paul Soliz\n\nStill Game actor Jimmy Martin dies aged 93: Co-stars pay tribute to 'wonderful' late actor\n\nQueen Camilla chats with A-listers Cate Blanchett, Andrew Garfield and Prince Harry's pal James Corden at Buckingham Palace reception\n\nLewis Hamilton is joined by Christian Horner and wife Geri on the red carpet as they celebrate Formula One's 75th birthday at London's O2 Arena\n\nCall the Midwife star Helen George, 40, is dating divorced dad of two, 51, after meeting on dating app Raya\n\nMachine Gun Kelly posts rare comment about ex Megan Fox and their pregnancy as due date approaches\n\nLogo of Meghan Markle's new brand As Ever may be a subtle nod to Prince Harry... and Queen Elizabeth II\n\nJason Segel touches his girlfriend Kayla Radomski's shoulder as he carries his dog in a crossbody purse\n\nPop star reveals he has been hospitalised with nasty leg injury as he predicts long 'road to recovery'\n\nDanielle Lloyd is seen for the first time since her devastating skin cancer diagnosis as she catches a train\n\nInside Patrick Schwarzenegger's dating history from Miley Cyrus to Abby Champion after White Lotus nude scene\n\nMartha Stewart fans slam her controversial new business venture\n\nLove Island star Olivia Hawkins' photoshopped picture of her face on Harriett Blackmore's body with Ronnie Vint is FINALLY exposed\n\nThis pinup, 50, was a Playboy model then did Baywatch, and she still looks hot today, can you guess who?\n\nCynthia Erivo to play JESUS in new stage show... but Wicked star's casting divides fans\n\nKanye West risks the wrath of ex Kim Kardashian by taking a swipe at one of Nike's new designs just as she announces NikeSkims brand\n\nZoe Ball lands new Radio 2 show two months after stepping down from her breakfast slot to 'focus on family'\n\nNicola Coughlan reveals she vowed to get cosmetic surgery to overcome her biggest insecurity as a teen: 'I thought it was so ugly':\n\nKaia Gerber has her hands full as she leaves a workout class in LA amid new Lewis Pullman romance\n\nBig Brother stars in shock SPLIT after whirlwind three-month romance\n\nMeghan and Melania are two of the most divisive women in America. They couldn't be more different. But there's a clever trick they both depend on, writes JANE TIPPETT\n\nChef Jason Atherton says his words were 'taken out of context' amid furious backlash from female chef after saying he didn't see sexism in the industry\n\nStrictly's Amy Dowden reveals she discussed chemotherapy with King Charles as she receives an MBE for raising awareness for Crohn's and Colitis UK\n\nMark Wahlberg, 53, shows off his hunky shirtless physique as he enjoys a hearty 4AM breakfast - after revealing he has scaled back his gruelling daily regime\n\nInside Vogue Williams and Spencer Matthews' luxurious £4.7M London pad - as fans notice one 'annoying detail' in the décor\n\nLove Island All Stars highest earners REVEALED as couple are predicted to earn over £1 million each - but it is NOT the winners\n\nQueen Máxima of the Netherlands oozes glamour as she visits the post-Covid Expertise Centre in Rotterdam\n\nLove Island: All Stars winner Gabby Allen is shocked to discover she will collect £50,000 cash prize with Casey O'Gorman: 'I didn't even know that was a thing!'\n\nTom Brady bonds with daughter Vivian in selfie as ex Gisele Bundchen tends to newborn with Joaquim Valente\n\nMaya Jama dances back to her villa in South Africa after drinking a 'bottle of wine' on a solo lunch as she celebrates Love Island All Stars ending\n\nEx BBC star looks unrecognisable as he shows off new beard in recent Instagram snap - but can you guess who it is?\n\nQueen Mathilde and King Philippe lead Belgian royals at annual mass in Brussels\n\nRenee Zellweger, 55, looks very casual with messy hair... after going glam for months to promote Bridget Jones 4\n\nInfluencers mourn their 'second home' Chiltern Firehouse as it closes after fire - and moan they'll have to take 'mirror selfies' in normal pubs and bars\n\nGorgeous in grey! Queen Letizia of Spain stuns in charcoal as she attends meeting at Royal Collections Gallery Museum in Madrid\n\nMaura Higgins is seen for the first time since taking a public swipe at ex Pete Wicks following their split after his pals insisted he DIDN'T cheat on her\n\nFans rejoice as BBC confirms legendary TV series is returning to screens after 15 years off air\n\nLove Island: All Stars runner up Grace Jackson reveals the truth behind THOSE exposed messages after she hit back at Olivia Hawkins \n\nKatie Price's ex Kieran Hayler 'SPLITS from fiancée Michelle Penticost after seven years - as they continue to co-parent son Apollo, three'\n\nTyla reveals she was bullied for her skin tone and hair texture at 'very white' primary school in South Africa as she poses for striking Vogue shoot\n\nLottie Moss dazzles in a racy skintight catsuit on night out at a strip club after she pleaded with Donald Trump to lift her 'ban' on entering America\n\nThe 'woke' storylines that have left once popular Doctor Who 'on the verge of being cancelled'\n\nWendy Williams reunites with her aging father, 94, in rare public outing in Miami amid guardianship battle\n\nNetflix fans left devastated and 'furious' by new Gabby Petito documentary\n\nNicole Scherzinger flaunts her jaw-dropping figure in a blue bikini as she shares an array of beach snaps from her Hawaii getaway\n\nCarry On legend Julian Holloway dead: Stars pay tribute as Sophie Dahl's actor father passes away aged 80\n\nKim Kardashian announces SKIMS collaboration with Nike... but ex Kanye does not seem happy about it\n\nTori Spelling, 51, flashes her tummy in tight crop top as she struggles to carry shopping bags out of Trader Joe's\n\nAnother brand disaster for Meghan? Duchess's merchandise empire in crisis as American Riviera Orchard is renamed days before Netflix launch\n\nThe VERY awkward moment Love Island star Curtis Pritchard and new girlfriend Ekin-Su Cülcülolu are interviewed by his ex Amy Hart\n\nEscape To The Country couple 'blown away' by unique 'upside down' property converted from a garage - but would you pay £500k for it?\n\nMargaret Qualley holds hands with Ethan Hawke before cradling a dog at photocall for upcoming musical drama Blue Moon in Berlin\n\nTeddi Mellencamp and Edwin Arroyave's divorce 'off the table' as he helps her recover from brain surgery months after affair was exposed\n\nAngelina Jolie and Brad Pitt's daughter Shiloh, 18, takes a dance class weeks after parents' divorce\n\nAllison Kuch reveals why she hates Taylor Swift's new nickname\n\nNikki Lund snaps up $330K Ferrari after wishing pal Paris Hilton a happy 44th birthday\n\nThis beauty worked with Robert De Niro and Leonardo DiCaprio, who is she?\n\nWendy Williams moved to memory unit 'after getting drunk at restaurant' of assisted living facility\n\nRob Beckett quits his BBC Radio 2 show amid tour commitments after replacing Paul O'Grady\n\nKimberly Wyatt, 43, shows off her very smooth visage as she steps out in a glam ensemble to attend the InterTalent post BAFTA Breakfast\n\nJames Argent shares a passionate kiss with girlfriend Nicoline Artursson as besotted couple pack on the PDA during romantic ski getaway\n\nWatch jaw-dropping moment Coronation Street's Rob Donovan falls over balcony in accident dubbed 'most ridiculous in soap history'\n\nThis Morning fans fume 'this is abuse!' as mum doubles down on giving her teenage daughter skinny jabs\n\nWhy privacy-loving Sussexes are now sharing more glimpses of their children\n\nAll the actors who have played Doctor Who amid fears fifteenth Time Lord Ncuti Gatwa 'could quit' the show after a drop in ratings\n\nChart-topping singer manages to go undetected as he takes the tube to his sold out show at the O2 Arena - do YOU know who it is?\n\nKanye West claims he had idea for Nazi hate symbol shirt 'for 8 years'... as ex Kim continues to stay mum on his rants\n\nDirector Judd Apatow slammed for 'delusional' opinion about comedy films\n\nChannel 4 viewers brand Joe Swash-fronted cooking show Batch From Scratch 'dumbest' ever and cringe over 'disgusting' ingredients\n\nDoctor Who 'faces the axe while Time Lord Ncuti Gatwa is on the verge of quitting amid a drop in ratings over fan fury at woke storylines'\n\nSerena Williams shows off her toned figure in a leopard-print cut-out swimsuit as she poses on the beach with her 18-month-old daughter Adira\n\nAnne-Marie celebrates daughter Seven's first birthday with sweet Instagram post: 'A year with the most beautiful soul'\n\nLove Island: All Stars 2025 final down 100,000k viewers since last year's ending - as Gabby and Casey shock with win over Grace and Luca\n\nPedro Pascal grabs lunch in NYC after delighting fans with 'hilarious' SNL 50th anniversary appearance\n\nBargain Hunt star Charles Hanson promised to 'never lay a finger on his wife again' after she told him she wanted to separate, court hears\n\nHow The White Lotus doubled down on full-frontal male nudity in every single series - with solo sex acts and prosthetic penises sending shockwaves through fans\n\nIt runs in the family! Royals from all generations have flexed their creative muscles from a young age\n\nLooks good on Prue! TV star shows age is just a number as she wows in black swimsuit while celebrating her 85th birthday over in Australia \n\nFears for Ariana Grande as chilling image emerges of star looking painfully thin - 'it's sad to watch it happen'\n\nChannel 4 star guilty of five-year campaign of terror against girlfriend where he broke her jaw, pulled out her hair and threatened to burn her\n\nChloe Madeley shares candid postpartum snap and reveals how she transformed back into her toned self - two years after having daughter Bodhi\n\nAntiques Roadshow crowd gasp as guest learns life-changing value of his guitar with 'absolutely incredible' connection to music legends\n\nHarry Styles' ex Taylor Russell beams with happiness as she walks arm-in-arm with a female friend - months after her 'split' from One Direction star\n\nJack Fincham sparks engagement rumours as he is spotted ring shopping after girlfriend Chloe Brockett shared Valentine's Day tribute amid star's legal woes\n\nEuphoria star Barbie Ferreira shows off her incredible weight loss with sexy bikini-clad snap following fan speculation she has taken Ozempic\n\nThe Love Island winners that flew under the radar: Gabby Allen and Casey O'Gorman's shock victory costs bookmakers thousands\n\nEmmerdale fans 'rumble' who's trapped under the ice after horror limo crash thanks to blink-and-you'll-miss-it clue \n\nThe Real Housewives of Cheshire to celebrate 10-year anniversary with special All Stars series with show legends tipped to make shock returns\n\nSon of huge US boyband star is set to appear on the new series of American Idol - but can YOU guess who the nepo baby is?\n\nAriana Grande covers up in a huge black padded jacket as she touches down in Japan just hours after attending the BAFTAs as a nominee\n\nJess Wright reveals her 'lifeless' son Presley, two, was rushed to hospital in an ambulance after terrifying health scare\n\nLoose Women star 'rushed to hospital' in 'the worst pain ever' but spends 24 hours waiting for a bed as star shares health update\n\nZara McDermott puts on a VERY leggy display in a tiny sequin skirt as she poses for sizzling snaps in Thailand following split from Sam Thompson\n\nMeghan's social media headache: Instagram handles for As Ever are quickly snapped up after Duchess' hasty rebrand\n\nMaya Jama shows off her incredible figure in a behind-the-scenes clip while getting ready for the Love Island: All Stars final\n\nLove Island's Samie Elishi shares fun snaps at the All Stars final after crush Luca Bish and Grace Jackson were 'sabotaged' by their co-stars\n\nMeghan rebrands American Riviera Orchard with a subtle dig at the Royal family\n\nA high society city celebration! Heiress Phoebe Knatchbull, 29, ties the knot with her investment banker husband in stylish London wedding\n\n'I miss her tremendously': EastEnders star Pam St Clements breaks down as she reminisces on friendship with Barbara Windsor \n\nRyan Reynolds 'distanced' himself from Blake Lively and 'minimised' her experience with SNL50 joke about Justin Baldoni\n\nThe Hangover's Zach Galifianakis signs autographs in rare sighting after his incredible act of kindness for homeless woman went viral\n\nBen Affleck's middle child Fin, 16, rocks new hairstyle while visiting aquarium with famous father and pal\n\nUniversity Challenge fans seriously distracted by contestant's 'nonsensical' habit - and realise it isn't his first time pulling focus\n\nThe right to remain ripped! Judge Robert Rinder, 46, shows off his muscular physique in shirtless 'thirst trap' as he shares cheeky exchange with Rylan\n\nDoes Meghan Markle's story add up? Previous comments from locals cast doubt on Duchess's U-turn explanation\n\nNew WHITE LOTUS leading lady LESLIE BIBB reveals the most challenging part of filming the hit series in Thailand \n\nThe sweet detail in Kate portrait you probably didn't spot- and shows how much Louis adores her\n\nEastEnders fans left reeling as iconic part of soap is overhauled in 40th anniversary twist - and are convinced they've rumbled the brutal death \n\nNick Cave defends his love of Kanye West's music following criticism from fans after the rapper labelled himself a Nazi in antisemitic Twitter rant\n\nPregnant Michelle Keegan enjoys a lavish candle lit 'girls only' dinner in London ahead of welcoming her first child with husband Mark Wright\n\nNoughties pop star hasn't aged a day as she makes a huge comeback 17 years after hit single\n\nChloe Ferry breaks down in tears as she reveals she was suicidal after hitting 'rock bottom' following botched cosmetic surgeries\n\nEastEnders star Cheryl Fergison announces a 'return to the BBC' 13 years after being axed as Heather Trott \n\nMaisie Williams shares picture of herself on the toilet as she attends star-studded British Vogue x GQ BAFTA afterparty\n\nUnforgotten viewers blast ITV for 'ruining' acclaimed crime drama - predicting it will be AXED next year after 'woke and nonsensical' storylines\n\nMeghan reveals glimpse of Lilibet, three, as the pair frolic in the Californian sunshine for Duchess's As Ever rebrand\n\nGuy Pearce admits he was 'scared of Kevin Spacey' when they worked together on 1997's LA Confidential as controversial actor is hit by another sexual abuse claim\n\nCall The Midwife star Helen George enjoys candle lit Valentine's date with new man as she debuts romance\n\nThe skinny influencer I saw spitting cake into a flowerpot and the A-listers who barely even LOOK at food: how stars avoid getting fat at glitzy parties, by MOLLY CLAYTON\n\nShocking moment Mark Hamill's trousers fall down while he's presenting an award at the BAFTAs - leaving front row stars 'horrified'\n\nThe REAL reason Charles and Diana's marriage started to 'deteriorate' - and the cheeky joke 'bored' Princess said to her husband\n\nTop Gear's James May gives a rare insight into his 25 year relationship with his partner Sarah Frater\n\nBikini-clad Kelly Brook shows off her eye-popping curves as she continues romantic holiday with husband Jeremy Parisi in the Caribbean\n\nJessica Alba, 43, shows off bikini body in Cabo as she makes first solo trip with son Hayes, seven, amid her divorce from Cash Warren\n\nLove Island: All Stars Gabby Allen and Casey O'Gorman are crowned WINNERS after he appeared on the show three times - beating Luca and Grace\n\nMeghan's heartfelt tribute to her best friend: Duchess dons £2,500 pendant designed by model pal's charity for her late son\n\nRobbie Williams and wife Ayda's daughter, Teddy, 12, is seen filming Tinsel Town with Rebel Wilson - after landing first Hollywood role\n\nSimon Cowell admits he doesn't find 'superstars' on Britain's Got Talent anymore ahead of show's return\n\nITV drops first Celebrity Big Brother teaser - as star-studded reality show prepares to hit screens again in Spring\n\nBritish rock star charged after calling the Italian prime minister a 'fascist' and 'Nazi' during show\n\nJack Nicholson, 87, uses a cane as he leaves hotel in NYC after rare SNL 50th anniversary appearance\n\nDoes Holly Willoughby have royal aspirations? From copying Kate Middleton's best looks to matching with Meghan Markle\n\nPatrick Schwarzenegger responds to strong fan reaction to White Lotus after full frontal scene and 'creepy' incest storyline\n\nSimone Biles shares terrifying encounter on honeymoon in South Africa with NFL star husband Jonathan Owens\n\nKatie Thurston's gal pal urges fans to 'flood her DMs with love' after breast cancer diagnosis\n\nMaya Jama leaves VERY little to the imagination in a busty gold cut-out midi dress as she steals the show hosting Love Island: All Stars final\n\nBozoma Saint John opens up about becoming fast friends with Dorit Kemsley on Real Housewives of Beverly Hills\n\nKristen Bell reveals secret to 11-year marriage to Dax Shepard... despite their steamy scenes with actors\n\n'Read the room!' Damson Idris mercilessly mocked by fans over 'out of touch' prices in his jewellery collection - including pieces costing £50,000\n\nWendy Williams reveals new hairdo on rare outing in Miami as new details about guardianship battle emerge\n\nMegan Thee Stallion unveils new tequila label for the 'hotties' as part of her 30th birthday celebrations\n\nMiley Cyrus' response to backlash over Sinead O'Connor tribute during SNL 50th anniversary show... years after their nasty feud\n\nThe Brutalist director makes stunning admission about earning 'zero income' from film despite 10 Oscar nominations\n\nSister Wives' Janelle Brown reveals whether she would ever date again after two divorces\n\nA Hard Day's Night, Macca? Paul McCartney, 82, lets out a big yawn while arriving at party in New York City \n\nLove Island fans all say the same thing after Casey O'Gorman is crowned winner of All Stars series 2 with Gabby Allen on his third stint in the villa\n\nTeddi Mellencamp's girls visit her in hospital amid reality star's 'horrific' brain tumor surgery as estranged husband shares update on her recovery\n\nLove Island All Stars final RECAP: Gabby Allen and Casey O'Gorman crowned winners in drama-filled finale as couple scoop £50,000\n\nRadiant Tiger Lily Hutchence is seen for the first time with boyfriend Ben Archer since appearing to confirm her pregnancy in artistic post\n\nIsla Fisher returns to Australia and starts filming new movie on the Gold Coast after 'flirty' exchange with ex-husband Sacha Baron Cohen amid their 'messy' $120M divorce\n\nMatt Damon dons armor in first look at Christopher Nolan's The Odyssey as fans react: 'Good Home Hunting'\n\nIconic '80s heartthrob who is still a beloved TV star is pictured in rare yearbook photos... can you guess who?\n\nLove Island All Stars final gets off to fiery start as Grace Jackson hits back at Olivia Hawkins after THAT accusation she was desperate to win \n\nLove Island viewers notice VERY awkward moment for one couple during opening minutes of the final\n\nShakira seen for FIRST TIME after being rushed to ER as she reveals tour update following show cancellation\n\nCoronation Street's Ken Barlow clutches his chest after collapsing as he is rushed to hospital in shock upcoming health scare scenes\n\nStacey Solomon looks radiant as she poses in the snow with son Rex on lavish family ski trip\n\nMadonna, 66, shares rare unfiltered video of herself in pink slip and stockings to hype album rerelease\n\nStephen Graham reveals how he helped other men confront their own issues after actor struggled with depression\n\nSelena Gomez and Benny Blanco purchase $35M LA home after engagement and joint album\n\nDame Mary Berry reveals she is 'delighted' to support Comic Relief's Red Nose Day as she joins Angela Scanlon, Judi Love, and more\n\nKerry Katona said she loved me but dumped me the day of The Vivienne's funeral: Chef Jameson Stocks reveals romance with star \n\nDrake puts on an Australian accent and helps a fan quit their job at McDonald's by gifting them $30,000 during Sydney concert\n\n90s teen star who played a Sweet Valley High nerd looks unrecognizable in recent posts... can you guess who he is?\n\nThe White Lotus' 'overwhelmingly beautiful' locations revealed as show returns with 'bigger in scope' third season\n\nSimon Cowell reveals Cheryl was supposed to be an original BGT judge until she 'freaked out and quit' at the last minute throwing the show into chaos\n\nHow The White Lotus director had to recast major role at the last minute after controversial actor openly supported Putin's invasion\n\nWynne Evans' BBC travel series with Joanna Page pulled off air in schedule shake-up after he was axed from Strictly Coming dancing tour\n\nCharli XCX reveals terrifying encounter with a huge snake in Australia during Laneway Festival Brat tour\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"During last year's Christmas special, Cindy ( Michelle Collins ) was left for dead after someone picked up a shovel and moments later she was seen lying face down on the floor.","url":"https://www.dailymail.co.uk/tv/article-14411297/EastEnders-fans-FINALLY-discover-attacked-Cindy-Beale-Queen-Vic-goes-flames-nail-biting-episode-live-tell-tale.html","image":"https://i.dailymail.co.uk/1s/2025/02/19/00/95350935-0-image-a-115_1739926157997.jpg","video":null,"publish_date":"2025-02-19 00:57:28","author":"Editor,Sean O'grady","authors":["Editor","Sean O'grady"],"language":"en","source_country":"gb","sentiment":-0.173},{"id":291940432,"title":"Oil Steadies After Gain With OPEC+ and Russian Supply in Focus","text":"Top officials from the US and Russia met in the Saudi capital Riyadh for a first round of talks over the war in Ukraine, but the exclusion of President Volodymyr Zelenskiy raised concerns in Europe and may slow an agreement. At the same time, the Group of Seven is considering tightening the oil price cap on Russian exports.\n\n“The probability of a further postponement of OPEC+ output restoration may be a reason” for price support, said Vishnu Varathan, head of economics and strategy for Mizuho Bank Ltd. “The bigger picture for prices though will be contingent on non-OPEC ramp-up in production and eventual pressures on OPEC+ to phase-in restoration.”\n\nMeanwhile, flows from Kazakhstan to the Black Sea could decline 30% during the months of repairs on a key Russian pumping station targeted by Ukrainian drones. \n\nCrude has traded in a relatively narrow range of about $5 a barrel this month, with a gauge of implied volatilty declining to around the lowest since July. That followed a tumultuous start to the year that saw futures rise on cold weather and a tightening of sanctions, and then fall as US President Donald Trump’s tariff actions spooked markets.\n\nTrump said he would likely impose duties on automobile, semiconductor and pharmaceutical imports of around 25%, with an official announcement coming as soon as April 2. The US leader previously announced 25% tariffs on steel and aluminum, which are set to take effect in March.\n\nElsewhere, President Trump said Chevron Corp.’s ability to continue exporting crude from Venezuela is under review, underscoring continued tensions between the nations that could spill over to energy.\n\nTo get Bloomberg’s Energy Daily newsletter in your inbox, click here.","summary":"Oil held advances on the possible postponement of OPEC+ supply increases and uncertainty around flows from Russia.","url":"https://financialpost.com/pmn/business-pmn/oil-steadies-after-gain-with-opec-and-russian-supply-in-focus","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/776267994-2.jpg","video":null,"publish_date":"2025-02-19 00:55:47","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"ca","sentiment":-0.078},{"id":291938030,"title":"Mixed feelings of sadness and joy for family members of Israeli hostages ahead of next release","text":"Family members of Israeli hostages being held in Gaza by Hamas expressed both happiness and grief ahead of the next release scheduled for this Thursday and Saturday.Hamas announced that it will free six living Israeli hostages on Saturday and return the bodies of four others on Thursday, a surprise acceleration in releases apparently in trade for Israel’s allowing mobile homes and construction equipment into the devastated Gaza Strip.The six are the last living hostages set to be freed during the ceasefire’s first phase in exchange for hundreds of Palestinians held in Israeli prisons.Herut Nimrodi, mother of hostage Tamir Nimrodi who is not slated to be released in the first phase of the ceasefire, said she had strong mixed emotions about the news.\"The feeling of going from being so sad to being so happy, and it's all mixed up together. I don't know. This is really something you don't know how exactly to react to,\" said Nimrodi.\"My son is not in this deal, and I have no idea if he survived or not, and I'm still hanging there with no information and I'm scared I won't get to the point where I can hug him and feel him again and start our lives again,\" she added.'Bibas family' to be among returned bodiesThe announcement by Hamas leader Khalil al-Hayya, in pre-recorded remarks released Tuesday, said the dead would include the “Bibas family” — two young boys and their mother who for many Israelis have come to symbolise the plight of those taken captive. Israel has not confirmed their deaths, and the prime minister's office urged the public not to distribute “photos, names and rumours” after the announcement by Hamas.\"In the past few hours, we have been in turmoil,” surviving members of the Bibas family said in a statement released Tuesday by a group representing the relatives of hostages. “Until we receive definitive confirmation, our journey is not over.”Israel has long expressed grave concern about Shiri Bibas and her sons, Kfir and Ariel, who Hamas claimed had been killed in an Israeli airstrike early in the war. Husband and father Yarden Bibas was kidnapped separately and released this month.Kfir, who was 9 months old at the time, was the youngest hostage taken in Hamas’ 7 October 2023 attack.The six living hostages slated for release are Eliya Cohen, Tal Shoham, Omer Shem Tov, Omer Wenkert, Hisham Al-Sayed, and Avera Mengistu, the Hostages and Missing Families Forum said Tuesday.Palestinians maintain hope for second phase of ceasefireAn Israeli official, speaking on condition of anonymity in line with regulations, said Prime Minister Benjamin Netanyahu had agreed to allow long-requested mobile homes and construction equipment into Gaza as part of efforts to accelerate the hostages' release.Hamas last week threatened to hold up releases, citing the refusal to allow in mobile homes and heavy equipment among other alleged violations of the truce.Indeed, Israel began allowing entry of rubble-removing equipment on Tuesday. Two bulldozers were seen clearing rubble in an area near the Palestinian side of the Rafah border crossing. An Egyptian driver told the Associated Press that dozens of bulldozers and tractors were at another crossing, awaiting Israeli permission to enter.The ceasefire's current phase runs until the beginning of March, and there are fears that fighting will resume. The warring sides have yet to negotiate the second and more difficult phase, in which Hamas would release dozens more hostages in exchange for a lasting ceasefire and an Israeli withdrawal.Palestinians in Gaza expressed hope that the ceasefire will hold into the next phase. \"We have been very patient, and we hope that the truce will continue, as we have witnessed death and destruction,\" said Raafat Azzam, a resident of Jabaliya in northern Gaza. \"We want a permanent truce. Our generation was executed, the young generation has been executed.\"The ceasefire that began in mid-January paused fighting that has killed more than 48,000 Palestinians, mostly women and children, according to Gaza’s Health Ministry.But Israel's government still says it wants to eliminate Hamas as a military and governing force in Gaza. And U.S. President Donald Trump's proposal to permanently remove Gaza's 2 million residents and redevelop the territory, though rejected by the Arab world and the Palestinians, has stirred even more uncertainty. Egypt is working on a counter-plan to rebuild without moving Palestinians.","summary":"After Hamas said it will release six living Israeli hostages and return four bodies, family members expressed both happiness and grief ahead of the release, while Palestinians in Gaza maintain hope that the ceasefire will hold.","url":"https://www.euronews.com/2025/02/19/mixed-feelings-of-sadness-and-joy-for-family-members-of-israeli-hostages-ahead-of-next-rel","image":"https://static.euronews.com/articles/stories/09/06/57/82/1440x810_cmsv2_78b8b3a5-dc73-56b6-ada0-e0f79193821c-9065782.jpg","video":null,"publish_date":"2025-02-19 00:38:47","author":"Emma de Ruiter","authors":["Emma de Ruiter"],"language":"en","source_country":"fr","sentiment":-0.126},{"id":291941148,"title":"Trump speaks to journalists after US-Russia talks","text":"President Donald Trump spoke to reporters hours after high-profile US-Russia talks on how to end the Ukraine conflict ended in Riyadh on Tuesday. He remained optimistic about brokering a peace deal and criticized Ukrainian leader Vladimir Zelensky. \n\nTrump said he felt “much more confident” about the prospects of a lasting peace and reiterated that his immediate goal was to “save lives.” \n\nOn cash for Ukraine\n\nTrump said that NATO countries and Kiev must make sure that aid provided to Ukraine is not wasted. “They have to pay. They have to find out where the money is going,” he said.\n\n“President Zelensky said last week that he doesn’t know where half of the money is that we gave him,” Trump stated. “Where is it going? I’ve never seen an accounting of it.’ \n\nThe president was apparently referring to Zelensky’s interview with podcaster Lex Fridman last month, where he said that Kiev had “not received the half” of the funds promised by Washington. \n\nOn negotiations \n\nTrump argued that Zelensky and other Ukrainian officials were in no position to complain about not being invited to the talks in Riyadh. He said he was “very disappointed” with Kiev. \n\n“Today I heard, ‘We weren’t invited.’ Well, you’ve been there for three years, you should’ve ended it… You should’ve never started it. You could’ve made a deal,” he said. \n\nOn Zelensky\n\nThe US president described Zelensky as deeply unpopular at home. “The leader in Ukraine – I hate to say it – but he’s down at a 4% approval rating,” Trump claimed. \n\n“When they want a seat at the [negotiating] table, you could say – wouldn’t the people of Ukraine have to say, ‘It’s been a long time since we’ve had an election,” Trump stated. \n\nAccording to the New York Times, Zelensky’s approval rating has dipped to around 50% from the 90% he enjoyed during the first months of the conflict in 2022. Zelensky’s five-year presidential term expired in May 2024 and he has refused to call new elections, citing martial law.\n\nOn peacekeepers\n\nTrump said he would welcome an EU peacekeeping force in Ukraine in case of a ceasefire between Moscow and Kiev. “If they want to do it, that’s great. I’m all for it. I would not object to it at all,” he said. Trump stressed that US troops would not be involved in any peacekeeping arrangement.","summary":"Trump has spoke to journalists about negotiations with Russia over Ukraine \nRead Full Article at RT.com","url":"https://www.rt.com/news/612986-trump-speaks-ukraine-riyadh/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67b526752030274b6a3bab28.jpg","video":null,"publish_date":"2025-02-19 00:34:50","author":null,"language":"en","source_country":"ru","sentiment":-0.228},{"id":291939954,"title":"Vatican says Pope Francis suffering from pneumonia in both lungs","text":"The Vatican said Tuesday (Feb 18) that Pope Francis is suffering from pneumonia in both lungs and the 88-year-old's clinical situation remains \"complex\". The Holy See has cancelled his events until the end of the weekend. Advertisment Francis, who has been pontiff since 2013, was last week admitted to the Gemelli hospital in Rome with bronchitis. He was suffering from breathing difficulties. Also read: US President Donald Trump and Elon Musk's first joint interview to air today - Know all details inside In a statement, the Vatican said that the \"laboratory tests, chest X-ray, and the Holy Father's clinical condition continue to present a complex picture\" as a \"polymicrobial infection\" which has come on top of \"bronchiectasis and asthmatic bronchitis, and which required the use of cortisone antibiotic therapy, makes therapeutic treatment more complex\". Advertisment\"The follow-up chest CT scan which the Holy Father underwent this afternoon... demonstrated the onset of bilateral pneumonia, which required additional drug therapy,\" it said. Also read: Key takeaways from US-Russia talks in Saudi Arabia as two nations discuss Ukraine war in its absence \"Nevertheless, Pope Francis is in good spirits,\" said the Vatican, further adding that Francis spent his fifth day in the hospital alternating rest with prayer and reading texts. Advertisment \"He gives thanks for the closeness he feels at this time and asks, with a grateful heart, that we continue to pray for him\", it added. Francis has had influenza and other health problems several times over the past two years. Also read: Talks conclude in Saudi Arabia HIGHLIGHTS: Russia says there is \"mutual desire\" to start Ukraine peace talks What is the polymicrobial infection and what do the experts say? Massimo Andreoni, who is a professor of infectious diseases at the University of Rome Tor Vergata and scientific director of the Italian Society of Infectious and Tropical Diseases, said that to have a better idea of the response to treatment, it will be necessary to wait 24 or 48 hours. While speaking to the news agency Reuters, Andreoni said, \"In this case, we have bronchitis that is complicated in pneumonia, and this happened due to a polymicrobial infection. So we have a lot of different bacteria that infect the patients, and we need different drugs to cure this case.\" Also read: \"Mistakes must be avoided\": Zelensky slams US, Russia talks in Riyadh, postpones his Saudi trip \"And also, another important point is that in this case, it's an older patient more than 88 years old, and so in these cases, the progression of the disease and the necessity of the therapy is more difficult than in patients who are more young,\" he added. Andreoni said that the terminology used in this case is basically linked to an infection of the lower respiratory tract, so that is evolving possibly into pneumonia, which means an involvement of the lung, not just the bronchi and upper respiratory tract. The term polymicrobial, which is the other term that has been used, is the fact that different germs have been isolated, so it's not an infection due to one germ, but multiple germs are competing in this infection. (With inputs from agencies)","summary":"The Vatican said Tuesday (Feb 18) that Pope Francis is suffering from pneumonia in both lungs and the 88-year-old's clinical situation remains \"complex\". The Holy See has cancelled his events until the end of the weekend. \n\n\nFrancis, who has been pontiff since 2013, was last week admitted to the Gemelli hospital in Rome with bronchitis. He was suffering from breathing difficulties. \n\n\nAlso read: US President Donald Trump and Elon Musk's first joint interview to air today - Know all details inside\n\n\nIn a statement, the Vatican said that the \"laboratory tests, chest X-ray, and the Holy Father's clinical condition continue to present a complex picture\" as a \"polymicrobial infection\" which has come on top of \"bronchiectasis and asthmatic bronchitis, and which required the use of cortisone antibiotic therapy, makes therapeutic treatment more complex\". \n\n\n\"The follow-up chest CT scan which the Holy Father underwent this afternoon... demonstrated the onset of bilateral pneumonia, which required additional drug thera","url":"https://www.wionews.com/world/vatican-says-pope-francis-suffering-from-pneumonia-in-both-lungs-8734267","image":"https://img-cdn.thepublive.com/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/01/21/aNnJY0xFbqFLzu0ow3Z0.jpg","video":null,"publish_date":"2025-02-19 00:32:10","author":"Srishti Sisodia","authors":["Srishti Sisodia"],"language":"en","source_country":"in","sentiment":-0.123},{"id":291938808,"title":"Trump Admin. Spends Big Taxpayer Money on Ads Thanking Trump","text":"Donald Trump and Elon Musk’s administration has been firing federal workers en masse, pausing and shuttering whole federal agencies, and furiously hunting for examples of waste, fraud, and abuse that they can show their supporters to prove all the destruction is necessary and good. \n\n At the same time, Trump’s Department of Homeland Security has now budgeted as much as $200 million on anti-immigrant ads — and the first round of them make clear his administration intends to use this immense amount of public money to very specifically promote Trump, both in America and around the globe. \n\n While the ads, which feature Homeland Security Secretary Kristi Noem, are ostensibly designed to convince undocumented immigrants to self-deport from the United States or avoid coming here at all, the domestic and international version of the ad feature Noem repeatedly lavishing praise on Trump.\n\n “Thank you, President Donald J. Trump, for securing our border, for deporting criminal illegal immigrants, and for putting America first,” Noem says in the domestic ad. “President Trump has a clear message for those that are in our country illegally, leave now, if you don’t, we will find you and we will deport you.” She adds that “under President Trump, America’s borders are closed to law-breakers.”\n\n In the international version of the ad, Noem again directly thanks Trump “for securing our border and putting America first,” before delivering “a message from President Trump to the world.” The message: “If you are considering entering America illegally, don’t even think about it.” \n\n She continues, “Under President Trump, we are defending American families and restoring their safety.” In closing, she adds, “President Trump is making America safe again.”\n\n The 60-second ads are part of an administration-wide propaganda blitz to show that Trump is cracking down on immigrants. The ads also happen to look, sound, and feel exactly like campaign ads. \n\n Both ad versions include soaring music and feature numerous snippets of Trump in action — saluting troops, waving around, signing executive orders, speaking at podiums — to the point where the casual viewer would likely have no idea they are watching their tax dollars being burned on these TV ads. \n\n According to a Homeland Security Department press release, “This series of ads will run on radio, broadcast, and digital, in multiple countries and regions in various dialects. Ads will be hyper-targeted, including through social media, text message and digital to reach illegal immigrants in the interior of the United States, as well as internationally.”\n\n Not mentioned in that press release: As Semafor reported Tuesday, the Trump administration has budgeted up to $200 million for this new anti-immigrant ad campaign. \n\n If there was any question whether Trump and the wrecking ball that is Musk’s so-called Department of Government Efficiency, or DOGE, intend to root out wasteful spending whatsoever, this ad campaign should provide a definitive answer: no, absolutely not.","summary":"Amid mass firings and a supposed hunt for waste, Trump officials are now burning your money on anti-immigrant ads that repeatedly praise the president","url":"https://www.rollingstone.com/politics/politics-news/trump-musk-admin-ads-immigration-homeland-security-noem-1235271900/","image":"https://www.rollingstone.com/wp-content/uploads/2025/02/trump-dhs-ads.jpg","video":null,"publish_date":"2025-02-19 00:31:01","author":"Andrew Perez","authors":["Andrew Perez"],"language":"en","category":"politics","source_country":"us","sentiment":0.191},{"id":291937022,"title":"India, US complement each other; can give mutual concessions in trade: Goyal","text":"NEW DELHI, Feb 18 : With India and the US preparing to start negotiations for a bilateral trade agreement, Commerce and Industry Minister Piyush Goyal on Tuesday said the two countries can offer concessions and duty reductions, as their economies complement each other.\n\nDuring the recent visit of Prime Minister Narendra Modi to Washington, India and the US announced their commitment to more than double the two-way commerce to USD 500 billion by 2030 and negotiate the first tranche of a mutually beneficial, multi-sector bilateral trade agreement (BTA) by fall of 2025.\n\n“We complement each other, we can give mutual concessions to each other, tariff reductions and make it easier to export and import between the two countries,” he said, adding, “We have started working on different ideas, engaging with different stakeholders within and outside the government and preparing ourselves for discussions, (which) we hope we will start soon.”\n\nHe added that the agreement will open opportunities for the domestic industry to expand trade with the US to USD 500 billion by 2030.\n\n“We look at this opportunity as a way to make India more competitive, come out with quality products, look at mutual concessions and attractive trading conditions which will support growth both in America and in India,” Goyal said at the NDTV Profit Conclave 2025.\n\nOn reciprocal tariffs, the minister said India’s tariffs are there to protect domestic industry from imports from non-market economies.\n\n“What we are working on is for mutual benefit resolving these issues for both our countries… Our situation with the US is different from the situation of many other countries,” he said.\n\nFurther, he said that there should be no cause of concern to the domestic industry from the trade negotiations with the US, and India should enter these negotiations from a position of strength.\n\n“I do not see any cause of concern…this is a golden opportunity for business and will open floodgates of new business opportunities. My sense is that those who are panicking today will regret tomorrow,” he said.\n\nEarlier in the day at a CII event, Goyal said that India and the US are committed to increasing bilateral trade to USD 500 billion and negotiating a “strong” trade agreement within the next 6-8 months.\n\nGoyal said once his US counterpart takes charge, both countries will discuss the contours of the pact.\n\n“…In the next 6-8 months, by establishing a strong trade agreement, we are committed to increasing trade to USD 500 billion,” Goyal told reporters here on the sidelines of CII’s India-Qatar Business Forum meet.\n\nWhen asked if the pact would have chapters related to goods, services and investments, he said, “My counterpart has not yet confirmed in the US…After the (confirmation), we will do talks and then only we can decide the way forward.”\n\nNormally in a free trade agreement, two trading partners either eliminate or significantly reduce customs duties on the maximum number of goods traded between them. Besides, they ease norms to promote trade in services and boost investments.\n\nDuring the first term of US President Donald Trump, the two countries had discussed a mini trade deal, but it was shelved by the Joe Biden administration as they were not in favour of such pacts.\n\nIn 2023, the US-India bilateral trade in goods and services stood at USD 190.08 billion (USD 123.89 billion in goods and USD 66.19 billion in services trade). In that year, India’s merchandise exports to the US stood at USD 83.77 billion, while imports were USD 40.12 billion, leaving a trade gap of USD 43.65 billion in favour of India.\n\nThe country’s services export to America was USD 36.33 billion in 2023, while imports were aggregated at USD 29.86 billion. The trade gap (difference between imports and exports) was USD 6.47 billion in favour of New Delhi.\n\nDuring 2021-24, America was the largest trading partner of India. The US is one of the few countries with which India has a trade surplus.\n\nIn 2023-24, the US was the largest trading partner of India with USD 119.71 billion bilateral trade in goods (USD 77.51 billion worth of exports, USD 42.19 billion of imports and USD 35.31 billion trade surplus).\n\nIndia received USD 67.8 billion in foreign direct investments from America during April 2000 and September 2024. (PTI)","summary":"NEW DELHI, Feb 18 : With India and the US preparing to start negotiations for a bilateral trade agreement, Commerce and Industry Minister Piyush Goyal on Tuesday said the two countries can offer concessions and duty reductions, as their economies complement each other. During the recent visit of Prime Minister Narendra Modi to Washington, India and the US announced their commitment to more than double the two-way commerce to USD 500 billion by 2030 and negotiate the first tranche of [&#8230;]\n\n\nThe post India, US complement each other; can give mutual concessions in trade: Goyal appeared first on Daily Excelsior.","url":"https://www.dailyexcelsior.com/india-us-complement-each-other-can-give-mutual-concessions-in-trade-goyal/","image":"https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2025/02/Piyush_goyal.jpg","video":null,"publish_date":"2025-02-19 00:29:11","author":"Daily Excelsior","authors":["Daily Excelsior"],"language":"en","source_country":"in","sentiment":-0.059},{"id":291937238,"title":"Jon Stewart says the media cried wolf with its 'fascist' attacks on Trump","text":"\"Daily Show\" host Jon Stewart sounded off on the media's constant \"fascist\" attacks towards President Donald Trump, saying they've \"numbed\" the country as a result. In an off-air clip shared by the show on X, Stewart was asked by an audience member about what he would say to critics who accused him of being \"light on the fascist message recently.\" \"Oh, well, I'd tell my critics- shut up! You're a fascist!\" Stewart jokingly responded. Stewart told the audience he appreciated the question and understood the \"desire\" of calling Trump a \"fascist,\" but went on to explain why he himself has refrained from using such rhetoric. JON STEWART ASKS DEMS TO STOP ‘TROTTING SCHUMER OUT’ TO COUNTER TRUMP AFTER AVOCADO, BEER RESPONSE TO TARIFFS \"I'm very big on- and I know it's annoying, but specificity and nuance,\" Stewart said. \"And I think if you cry 'fascism' at every administrative overreach, even the ones that are constitutionally OK, you will find yourself out of fascism bullets when the time really comes.\" \"I think what the media has done over the past ten years is cry wolf, to the point where they numbed everybody,\" he continued. \"It was an anesthetic, and it got to where- what was the thing they litigated throughout this campaign? 'He's a fascist, he's a terrible person, democracy is on the ballot.' Guess what lost at the [ballot box]? If you told us democracy was on the ballot, democracy got its ass kicked by a majority vote.\" \"So I am very cautious about when to know, like, yeah- hopefully I won't do it the night after Kristallnacht… but it's like when you put your dog down. It's one of those things, like, you're not quite sure, but I do understand how annoying that is,\" Stewart added. BILL MAHER DOESN'T RULE OUT TRUMP'S GAZA STRIP PLAN, SAYS WAR-TORN TERRITORY ‘COULD BE SOMETHING ELSE’ Stewart isn't the only one to question the left's use of the \"fascist\" label for Trump. \"Breakfast Club\" co-host Charlamagne Tha God called out Democrats for their sudden change of heart after Trump won the presidential election. \"Don’t y’all find it strange that now that he’s won, they’re not calling him a threat to democracy? They’re not calling him a fascist. I mean, damn, on Monday, they was just calling him that,\" Charlamagne said in November. CLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS CLICK HERE TO GET THE FOX NEWS APP \"I would think that, you know, if you really believe that, then somebody’s speech would be about how America effed up and how things are about to be really bad. It just makes you wonder how much of it did they really believe, or how much of it was just politics. That’s all,\" he added.","summary":"Liberal comedian Jon Stewart pumped the breaks on the media&apos;s &quot;fascist&quot; attacks towards President Trump during an exchange with a &quot;Daily Show&quot; audience member.","url":"https://www.foxnews.com/media/jon-stewart-says-media-cried-wolf-fascist-attacks-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/02/931/523/Jon-Stewart.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 00:24:24","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.377},{"id":291934854,"title":"Clive Palmer launches Aussie MAGA party","text":"The mining magnate shared details of the new political party, called Trumpet of Patriots, at a press conference in Canberra at 11am on Wednesday. \n\nThe full-house press conference, featured a show reel of US commentator Tucker Carlson’s glowing review of Mr Palmer. \n\nParty president Glen O’Rourke confirmed Mr Palmer had been elected as chairman and spokesman for Trumpet of Patriots and said he would “drain the swamp in Canberra”.\n\nSpeaking to a packed room, Mr Palmer praised US President Donald Trump, and said his party would “Make Australia Great Again. \n\nHe said party policies would include sizeable reduction in immigration, banning trans-athletes, and rescinding Kevin Rudd’s posting as Australians ambassador to the US.\n\n“The Party believes in the policies of Donald Trump, which is shown to be effective in bringing management back on track,” he said. \n\n“Peter Dutton has stated the he’s no Donald Trump, and we agree with him. Albanese presided over declining standard of living for our country in each and every year he served as prime minister.\n\n“Australia needs Trump policies. Australia’s want them.”\n\nThe party will be led by NSW Hunter candidate Suellen Wrightson, who will challenge Labor incumbent Dan Repacholi.\n\nAccording to the party’s temporary website, Trumpet of Patriots is promising “commonsense policies for Australia” and will be critical of the “Labor and Liberal duopoly” as well as the Greens and teal independents.\n\nThe website also features candidate nomination forms for both lower house and senate seats. \n\n“The simple reason your cost of living is so high is because Australians are being ripped off by the political system, unelected bureaucrats and the lobbyists who support them,” the website says. \n\n“Enough is enough! We will drain the swamp!”\n\nUnited Australia Party gone\n\nMr Palmer’s political pitch follows the voluntary deregistration of his former United Australia Party (UAP) in late 2022, which was unable to be re-registered despite a failed High Court challenge.\n\nThe Queensland-based rich lister has also previously spent $123m on the 2022 federal election, which installed his candidate Ralph Babet in the Senate. \n\nAnthony Albanese dashed the political effectiveness of Mr Palmer’s new party while acknowledging people were entitled to run. \n\n“A bloke who spends over $100 million to deliver one senate seat with a bloke who sits in the corner and just engages in conspiracy theories I don’t think represents value for money,” the Prime Minister said. \n\n“I’m not sure what the objective of them is, but people are entitled to put themselves forward in an election, but if you’re a serious political party, then you have to have serious policies.” \n\nMore to come","summary":"The billionaire will announce his new political party, dubbed the Trumpet of Patriots, which promises to offer “commonsense policies for Australia”.","url":"https://www.news.com.au/national/politics/clive-palmer-to-announce-his-new-political-party-trumpet-of-patriots/news-story/53230d924ffa37a22cde947969209eb4?from=rss-basic","image":"https://content.api.news/v3/images/bin/63983745f23464e3d08357898bcba3b5","video":null,"publish_date":"2025-02-19 00:23:51","author":"Jessica Wang","authors":["Jessica Wang"],"language":"en","source_country":"au","sentiment":-0.096},{"id":291938156,"title":"The Fluctuating Price Of PMS","text":"We do not know who or what to commend or blame for the un-steady price of Pre-mium Motor Spirit (petrol) sold by Dangote Refinery, Nigerian National Petroleum Company Limited and others. Well, except to assume that the Petroleum In-dustry Act has finally unleashed petroleum sector market forces.\n\nAs soon as petrol from Dangote Refinery hit the market at a high price in 2024, and imported pet-rol came in at a lower price, many compatriots – rightly or wrongly – assumed that Aliko Dangote, pro-prietor of Dangote Refinery, had finally showed his true colour as a monopolist.\n\nThis accusation further trended with media reports that Dangote Refinery instituted a N100 billion law suit at an Abuja Federal High Court to stop Nigerian National Petroleum Company Limited and petrol marketers from importing petrol into Nigeria.\n\nThe accusation against Aliko Dangote gained more credence when Dangote Refinery described the Federal Competition and Con-sumer Protection Commission, that asked to be joined as co-de-fendant with NNPCL, as a med-dlesome interloper.\n\nTowards the end of 2024, Dan-gote Refinery suddenly reduced the price of its petrol to N899. Nigerians were happy, and emer-gency analysts came out, beating their chests, claiming that market forces were finally coming to play in the Nigerian petrol market.\n\nThe analysts, however, went quiet and lost their equilibrium, when, on 19th January, 2025, Dan-gote Refinery reversed itself, and raised the price of its petrol to N950, with the justification that the price of crude petroleum in the international market rose by 15 per cent.\n\nBut on 1st February, 2025, a pleasant surprise came when Dangote Refinery announced yet another downward review of the price of its petrol: It shaved the price from N950 to N850. Again, Dangote Refinery explained that its action was due to a significant decline in international crude prices.\n\nWhen Nigerians wondered why changes in the price of crude pe-troleum at the international mar-ket was almost always immediate-ly reflected in price of petroleum products, the (plausible) explana-tion that was offered was that Ni-geria had no strategic reserve of crude petroleum and petroleum products.\n\nThere is the argument that be-cause crude petroleum is an “in-ternational citizen,” that is al-ways traded in the US dollar, any fluctuation in the naira-dollar exchange rate must be swiftly re-flected in the price of petroleum products.\n\nBut we think that there is prob-ably a price war of sort going on among Dangote Refinery, NNP-CL, which practically insists on importing petrol, other domestic refineries and the cartel of pe-troleum products importers and marketers.\n\nMedia reports indicate that Dangote Refinery’s sudden drop of petrol is not looking good for marketers with inventory that was bought at the previous high-er price. They fear an impending bleeding of red ink of losses that may run into tens of millions.\n\nHammed Fashola, Vice Presi-dent of Independent Petroleum Marketers Association of Nige-ria, laments: “A marketer who stocked up… may still have un-sold fuel before the price cut (by Dangote Refinery)… (And) if you don’t reduce your price, nearby marketers, who buy at the new rate, will. Within days, you’ll lose customers unless you adjust.” He then rationalizes, “This is a part of the deregulation.”\n\nAnother media report indicates that some marketers or dealers are coming to terms with the new market realities by replacing the NNPCL logo after dumping its franchise that previously enabled their petrol stations to trade as NNPCL stations.\n\nWith this step, they effectively substituted NNPCL, that has lost its authorisation and monopoly as exclusive importer of petroleum products, with Dangote Refinery, the obvious game changer, or any of the other suppliers within Ni-geria or abroad.\n\nIt is interesting to note that NNPCL’s public communications group is hardly forthcoming with the official explanations or responses of the oil behemoth to what appears to be a “civil war” by the erstwhile NNPCL market-ers.\n\nIt looks as if the jungle of free market, that seeks to deregulate the midstream and downstream sub-sectors of the Nigerian petrol trade, is maturing. We can only hope that it will lead to significant price reductions and regular sup-ply of petroleum products.\n\nAmidst all these is the uncon-firmed good news report that is emanating from Petroleum Re-tails Outlet Owners Association of Nigeria, which is to the effect that its members can now load petroleum products, including petrol, diesel and kerosene, from NNPCL refineries in Port Har-court and Warri.\n\nWhile these developments may be true beginnings of the full reign of market forces in Nigeria’s downstream petroleum sub-sec-tor, we fear that President Donald Trump’s erratic imposition of tar-iffs on shipment of Iranian crude petroleum to China may tailspin the price of petroleum products.\n\nTherefore, we suggest that as Nigeria’s refineries become reg-ular producers and suppliers of petroleum products, players in the petroleum industry should be thinking about strategic crude and petroleum products reserves.","summary":"We do not know who or what to commend or blame for the un­steady price of Pre­mium Motor Spirit (petrol) sold by Dangote Refinery, Nigerian National Petroleum Company Limited and others. Well, except to assume that the Petroleum In­dustry Act has finally unleashed petroleum sector market forces. As soon as petrol from Dangote Refinery hit [&#8230;]","url":"https://independent.ng/the-fluctuating-price-of-pms/","image":"https://independent.ng/wp-content/uploads/Petrol-subsidy-.webp","video":null,"publish_date":"2025-02-19 00:22:44","author":"Editorial","authors":["Editorial"],"language":"en","source_country":"ng","sentiment":-0.413},{"id":291939242,"title":"Trump’s eldest son says US should avoid ‘poking the dragon’ in China-focused commentary","text":"Donald Trump Jr., the eldest son of US President Donald Trump, called for “avoiding poking the dragon in the eye unnecessarily” as he outlined on Tuesday how China fits in his father’s “America First” foreign policy and why lawmakers should unite behind the president’s nominee for Pentagon policy chief.\nIn an opinion piece for Human Events, a conservative US news outlet, the younger Trump urged Republican lawmakers to back long-time China hawk, Elbridge Colby.\nColby served in the Pentagon for about a year during Trump’s first administration, where he advocated for strengthening military deterrence to prevent future conflicts – especially with Beijing. In December, Trump nominated him for the position of under secretary of defence for policy.\nWhile other Trump nominees have been confirmed or are in the process of getting green lights from the US Senate, a confirmation hearing has not yet been scheduled for Colby. Some Republican lawmakers are opposed to Colby’s push for reduced involvement in the Middle East to focus on the threat that China poses.\nTrump Jr. argued in his piece that those opposing Colby were “hostage to an ideological approach to foreign policy”.\n\n“When you consider that the American people would benefit most from a balance of power with China that avoids war, it makes perfect sense,” added Trump Jr., who has reportedly replaced the president’s son-in-law, Jared Kushner, in building support for some foreign policy figures in the new administration.\nThe younger Trump also played the role of his father’s unofficial envoy during a trip to Greenland in January, conveying to residents of the mineral-rich autonomous territory of Denmark that “we’re going to treat them well” if they agree to become a US territory, as desired by the elder Trump.\nTrump Jr. called Colby a “realist” like Trump and US Vice-President J.D. Vance, those who “recognise how uniquely powerful China is compared to other nations” and urge focusing military strength and attention on “balancing” China in Asia.\n“But at the same time, [Colby] supports my father in his openness to negotiation with [Chinese President] Xi Jinping and avoiding poking the dragon in the eye unnecessarily,” he said.\nIn a Wall Street Journal article in September, Colby argued that Taiwan “isn’t of itself of existential importance to America.” Instead, “our core interest is in denying China regional hegemony over Asia. Taiwan is very important for that goal, but not essential”.\nLast week, the US Department of State removed a line from its website stating that the US does not support Taiwan independence, angering Beijing.\nChina’s Foreign Ministry urged the US on Monday to “immediately correct its mistakes” or risk “further serious damage” to bilateral ties.\nBeijing sees Taiwan as part of China to be reunited by force if necessary. Most countries, including the US, do not recognise Taiwan as an independent state, but Washington is opposed to any attempt to take the self-governed island by force and is committed to supplying it with weapons.\nTrump has urged Taiwan to contribute more to its defence while sidestepping questions about whether he would defend the island from Beijing’s military aggression.\nHe has also criticised Taiwan for “taking away” the computer chip industry from the US and threatened to impose tariffs on chip companies that do not manufacture domestically.\nSpeaking alongside visiting Indian Prime Minister Narendra Modi last week at the White House, Trump referred to China as a “very important player in the world.”\nTrump added that his next planned meeting would be with Xi to discuss denuclearisation, something he claimed both Russia and China were open to during his first term as US president.\nHowever, the two leaders have not spoken since the US president imposed new 10 per cent tariffs on Chinese imports and Beijing retaliated with 10-15 per cent levies on American coal and gas earlier this month.\nTrump has also announced plans to impose reciprocal tariffs on major US trade partners following an ongoing assessment of trade and non-trade barriers against American exports, which is expected to conclude by April 2. In addition, nearly 25 per cent tariffs on auto imports are planned to be announced around the same time.\nOn Tuesday Trump Jr. criticised previous administrations for leading America into “unnecessary and costly wars” and “deindustrialisation,” describing his father as “essentially alone” for “many years” in his effort to restore an “America First” foreign policy.\nHe said the US president required the “right people” to implement his policy vision, adding that Colby’s view fit well, as he is more concerned about the interests of the American people rather than “abstractions like ‘the rules-based international order’ or spreading democracy in the Middle East”.","summary":"The younger Trump pushes support for the president’s Pentagon policy nominee – a China hawk, who is also open to talks with Xi Jinping.","url":"https://www.scmp.com/news/china/military/article/3299226/trumps-eldest-son-says-us-should-avoid-poking-dragon-china-focused-commentary","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/19/965e5988-6134-4844-a36b-ad98f05a9e2d_b303a4c7.jpg","video":null,"publish_date":"2025-02-19 00:19:14","author":"Khushboo Razdan","authors":["Khushboo Razdan"],"language":"en","category":"politics","source_country":"cn","sentiment":0.049},{"id":291936056,"title":"Judge denies Trump’s effort to dismiss Biden appointee","text":"A federal judge on Tuesday reinstated, for now at least, a member of the Merit Systems Protection Board after she sued to regain her position following her removal by President Donald Trump.\n\nOn Feb. 10, the 45th and 47th president sent Cathy Harris packing without an explanation. This would-be firing, however, came with a conclusive termination letter that did not offer an explanation.\n\nUnder federal law, members of the MSPB are appointees who serve from their appointment until the end of their term unless they are removed “for inefficiency, neglect of duty, or malfeasance in office.”\n\nIn a 21-page memorandum opinion and order, U.S. District Judge Rudolph Contreras, a Barack Obama appointee, determined that the statute’s three firing mechanisms simply do not cover “differences of political opinion.” Moreover, the court ruled, the federal worker board must maintain a certain level of independence from politics.\n\nAt a basic level, the judge credits the words of the originating statute, the Civil Service Reform Act of 1978 (CSRA), as fully controlling when it comes to determining how membership on the MSPB pans out.\n\n“Any member may be removed by the President only for inefficiency, neglect of duty, or malfeasance in office,” Contreras recites the statute.\n\nIn order to determine the extent of what this phrase in the statute means, however, the judge turns to case law.\n\nHere, the removal language in question falls under the purview of a 1935 U.S. Supreme Court case that keeps quasi-legislative and quasi-judicial agencies largely insulated from the whims of the president.\n\n“Because the MSPB falls within the scope of [the high court case], Congress has the power to specify that members of the MSPB may serve for a term of years, with the President empowered to remove those members only for inefficiency, neglect of duty, or malfeasance in office,” the court’s order reads. “The President did not indicate that any of these reasons drove his decision to terminate Harris. The Court thus concludes that Harris has demonstrated that she is likely to show her termination as a member of the MSPB was unlawful.”\n\nThe court also cites another case in which the U.S. president was found to have “no such power” to remove and stack an adjudicatory body “merely because he wanted his own appointees on such a Commission.”\n\nThe work of the MSPB itself is integral to how the court views the removal language in light of precedent.\n\nThe court helpfully sums the agency up:\n\nThe Board reviews federal employee appeals of adverse actions “which [are] appealable to the Board under any law, rule, or regulation,” including those related to removal or suspension for periods greater than fourteen days. It may order federal agencies and employees to comply with its decisions and conduct studies “relating to the civil service” for the President and Congress. The MSPB also reviews “rules and regulations of the Office of Personnel Management.” The MSPB’s final decisions are generally subject to judicial review.\n\n“In enacting the CSRA, Congress exercised its power to regulate the civil service,” the order goes on. “It defined certain prohibited personnel practices, to include discrimination, loyalty oaths, coercion to engage in political activity, and retaliation against whistleblowers.”\n\nThe thrust of the ruling is that the board is more or less a creature of statute — or something not entirely unlike an adjunct of Congress which answers to Congress through appropriations, to the president through appointments, and to the courts through judicial review.\n\n“[T]he MSPB’s mission and purpose require independence,” Contreras writes. “Direct political control over the MSPB would have limited effect on the President’s implementation of his policy agenda. It would instead neuter the CSRA’s statutory scheme by allowing high-ranking government officials to engage in prohibited practices and then pressure the MSPB into inaction. The MSPB’s independence is therefore structurally inseparable from the CSRA itself.”\n\nThe judge elaborates, at length:\n\nThe CSRA envisions that the Board “is to be nonpartisan; and it must, from the very nature of its duties, act with entire impartiality.” The CSRA also “fixes a term of office.” The MSPB’s duties are “quasi judicial,” in that it conducts preliminary adjudication of federal employees’ claims, which may then be appealed to the Federal Circuit. Although the MSPB lacks its own rulemaking authority, Congress intended the agency to aid its legislative goals by regularly transmitting reports to Congress regarding the Board’s functions. It is additionally evident that Congress hoped to “preclude the President from influencing the [Board] in passing on a particular claim.”\n\nHarris was appointed to her current term in June 2022 and her commission expires in March 2028.\n\nThe temporary restraining order puts the plaintiff back in her job as chair and enjoins the relevant administration officials “from removing Harris from her office or in any way treating her as having been removed, denying or obstructing Harris’s access to any of the benefits or resources of her office, placing a replacement in Harris’s position, or otherwise recognizing any other person as a member of the MSPB in Harris’s position.”\n\nThe court anticipates Harris will also file for a preliminary injunction. If she does, a hearing on that motion will be held on March 3.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump listens during a news conference with Japanese Prime Minister&#8230;\n\n\nThis Post: Judge denies Trump&#8217;s effort to dismiss Biden appointee first appeared on Internewscast Journal","url":"https://internewscast.com/crime/judge-denies-trumps-effort-to-dismiss-biden-appointee/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-02-19 00:17:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.349},{"id":291938326,"title":"If you need a new laptop, you might want to buy it now - here's why","text":"Acer has become the first laptop manufacturer to announce that it is increasing laptop prices in the United States due to President Donald Trump's economic tariffs. Company CEO and chairman Jason Chen told The Telegraph that costs could go up by 10%.\n\nAlso: The best laptops under $1,000 you can buy\n\nIf you're unfamiliar with the situation, President Trump imposed multiple tariffs on various countries in early February, including a 10% tariff on all imports from China. Electronic products and machinery make up half of China's exports to the US, totaling around $207 billion. In fact, 80% of all laptops imported into the nation are made in China, according to the Telegraph.\n\nThe price hike will not happen immediately, nor will it apply to Acer laptops that arrived in the United States last month. Instead, the increase will begin taking effect in March once a new wave of products hits retail channels.\n\nLet's look at the company's catalog to put this into perspective. Acer's Swift 14 AI currently sells for about $1,300, though it's currently on sale. If a new model with a similar price point is released, that laptop will cost roughly $1,430 with the tariff increase. Acer could possibly charge nearly $3,500 for a gaming laptop.\n\nAlso: This 16-inch Dell Inspiron is one of the most versatile laptops I've tested (and it's still $400 off)\n\nJason Chen has said he is considering \"shifting manufacturing out of China,\" possibly to the United States, to avoid charging more. That could align with President Trump's goal of moving electronic manufacturing to the US and bolstering the nation's economy by bringing in new jobs. However, nothing is set in stone at the moment. And even if it is, moving an entire production line to another country is no walk in the park. It'll take a long time, and consumers are stuck with the bill.\n\nOther laptop companies may follow suit. Asus and Dell could take a page from Acer's playbook and begin charging more, but this remains unknown. It's important to mention that when Donald Trump was elected last November, Microsoft, HP, and Dell ordered suppliers to speed up production ahead of the tariffs.\n\nAlso: This 16-inch Dell Inspiron is one of the most versatile laptops I've tested (and it's still $400 off)\n\nAccording to a report from Wccftech, the three tech giants started \"stockpiling components to prevent paying additional costs\". Microsoft apparently told suppliers to \"move out of nations that will receive the tariff imposition.\" If they managed to store enough resources, other laptop brands may be able to stave off price increases while supplies last.\n\nI contacted Lenovo, Asus, Dell, and HP to ask if they plan to implement their own price hikes. I also reached out to Acer requesting more infomation and to ask if the increase will apply to non-laptop products like monitors. I haven't heard back at the time of this writing, but I will update this story if they respond.","summary":"Acer has announced new price hikes for laptops in response to US tariffs - and other companies could follow suit.","url":"https://www.zdnet.com/article/if-you-need-a-new-laptop-you-might-want-to-buy-it-now-heres-why/","image":"https://www.zdnet.com/a/img/resize/c563ab0e83c2a03806133d5d6b746474825d9ba3/2025/01/06/43a14675-22b2-4905-b30d-d808699c9b16/img-9053.jpg?auto=webp&fit=crop&height=675&width=1200","video":null,"publish_date":"2025-02-19 00:16:51","author":"Cesar Cadenas","authors":["Cesar Cadenas"],"language":"en","source_country":"US","sentiment":-0.307},{"id":291934116,"title":"Trump says to introduce 25% tariffs on autos, pharmaceuticals and chips","text":"PALM BEACH, Florida: US President Donald Trump said on Tuesday (Feb 19) he intends to impose auto tariffs \"in the neighbourhood of 25 per cent\" and similar duties on semiconductors and pharmaceutical imports, the latest in a series of measures threatening to upend international trade.\n\nOn Friday, Trump said levies on automobiles would come as soon as Apr 2, the day after members of his cabinet are due to deliver reports to him outlining options for a range of import duties as he seeks to reshape global trade.\n\nTrump has long pointed to what he calls unfair treatment of US automotive exports in foreign markets.\n\nThe European Union, for instance, collects a 10 per cent tariff on vehicle imports, four times the US passenger car tariff rate of 2.5 per cent. The US, though, collects a 25 per cent tariff on imported pickup trucks from countries other than Mexico and Canada, a tax that makes the vehicles highly profitable for Detroit automakers.\n\nPHARMA, CHIPS DUTIES\n\nTrump told reporters on Tuesday that sectoral tariffs on pharmaceuticals and semiconductor chips would also start at \"25 per cent or higher, and it will go very substantially higher over the course of a year.\"\n\nHe did not provide a date for announcing those duties and said he wanted to provide some time for drug and chip makers to set up US factories so that they can avoid tariffs.\n\nSince his inauguration four weeks ago, Trump has imposed a 10 per cent tariff on all imports from China, on top of existing levies, over China's failure to halt fentanyl trafficking. He also announced, and then delayed for a month, 25 per cent tariffs on goods from Mexico and non-energy imports from Canada.\n\nHe has also set a Mar 12 start date for 25 per cent tariffs on all imported steel and aluminium, eliminating exemptions for Canada, Mexico, the European Union and other trading partners. Trump also announced that these tariffs would apply to hundreds of imported downstream products made of steel and aluminium, from electrical conduit tubing to bulldozer blades.\n\nLast week, he directed his economic team to devise plans to impose reciprocal tariffs that match the tariff rates of every country product-by-product.","summary":"","url":"https://www.channelnewsasia.com/world/donald-trump-introduce-25-tariffs-autos-pharmaceuticals-chips-4945911","image":"https://dam.mediacorp.sg/image/upload/s--sqq6gZ2Y--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-02-18t180433z_2_lynxnpel1h0n0_rtroptp_3_usa-trump-workers.jpg?itok=","video":null,"publish_date":"2025-02-19 00:16:18","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0},{"id":291938818,"title":"Trump’s Friday firings leave EPA Chicago office with fewer scientists, staff","text":"In her short time at the Environmental Protection Agency, Nyla McCranie helped a central Ohio woman who complained that someone was burning lithium batteries near her rural home, creating an air pollution hazard.\n\nA scientist who is part of an environmental justice team in Chicago, McCranie put the woman in touch with the agency’s enforcement officials earlier this month, and the problem is being dealt with, she said.\n\n“She called us because she didn’t know where else to turn,” McCranie said of the woman.\n\nOn Friday, less than three months after she started at EPA, McCranie lost her job as part of President Donald Trump’s mass firing of federal employees.\n\nMcCranie, who moved to Chicago after working at a nonprofit in Alabama, was a probationary employee who lacked the job protections of veteran union workers.\n\nShe was one of dozens of EPA scientists and other staff in Chicago to lose their jobs Friday.\n\nIn all, union officials estimate that more than 100 Chicago-area EPA workers resigned, retired, were fired or have been put on forced administrative leave as Trump looks to thin the ranks of the environmental agency responsible for protecting public health.\n\nAmerican Federation of Government Employees Local 704 estimated it represented about 1,000 Chicago-region employees before reductions. The regional office oversees six states.\n\nAround 200 EPA and other federal employees rallied midday Tuesday at Federal Plaza in support of the targeted workers.\n\nAs a scientist in the EPA’s Office of Air and Radiation, Nicole Smith was working on a few projects in her new job, including analysis of state pollution reports.\n\nOn Friday, she was informed that she would also lose her job after just starting in late December.\n\nEarlier this year, Smith received her master’s of public health from Yale. The Michigan native was looking forward to putting her environmental health training to use.\n\n“This was the dream for me,” Smith said.\n\nAt the Tuesday rally in Federal Plaza, Smith held a sign that said “I was illegally terminated while protecting Americans from poisoned air.”\n\nBridget Lynch, a scientist focused on ground water and drinking water, began her job a month ago.\n\nA Chicago-area native and graduate of Wellesley College, Lynch said she received a form email around 4:30 p.m. Friday that said that she was “failing to demonstrate that my qualifications fit the role, even though I’m a highly qualified recent graduate, and I was doing my best.”\n\nHer access to email was cut off at 5 p.m.","url":"https://chicago.suntimes.com/environment/2025/02/18/trump-fires-epa-chicago-scientists-staff-environmental-protection-agency","image":"https://cst.brightspotcdn.com/dims4/default/2009998/2147483647/strip/true/crop/6696x3822+0+322/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F69%2F63%2F11d03f05460fb60af4163b99ed36%2Fepar","video":null,"publish_date":"2025-02-19 00:16:15","author":"Brett Chase","authors":["Brett Chase"],"language":"en","source_country":"us","sentiment":-0.309},{"id":291937006,"title":"Trump hints Ukraine election may be needed for peace – as he addresses Kyiv being left out of Russia talks","text":"Donald Trump has suggested Russia’s war in Ukraine could have been “settled very easily” as he criticised Kyiv’s negotiation skills.\n\nIn comments after an extraordinary meeting between senior American and Russian officials on Tuesday morning in Saudi Arabia, the US president said of Ukraine: “They’ve had a seat [at the table] for three years and a long time before that.\n\n“This could have been settled very easily. Just a half-baked negotiator could have settled this years ago without, I think, the loss of much land and without the loss of any lives and without the loss of cities that are just laying on their side.”\n\nWhile touting his own negotiation skills, Mr Trump also said he was “more confident” about a peace deal after Tuesday’s talks, attended by US secretary of state Marco Rubio.\n\nFollow live: Lavrov tells US that NATO troops in Ukraine is ‘unacceptable’\n\nWhile speaking from Mar-a-Lago in Florida, Mr Trump also said he would not oppose seeing European peacekeeping troops stationed in Ukraine as part of a peace deal with Russia.\n\nHe also repeated a proposal that Ukrainian leader Volodymyr Zelenskyy hold elections in Ukraine as a condition of peace.\n\n‘Not a Russian thing’\n\n“We have a situation where we haven’t had elections in Ukraine, where we have martial law, essentially martial law in Ukraine, where the leader in Ukraine, I mean, I hate to say it, but he’s down to 4% approval rating.”\n\nHe added: “If Ukraine wants a seat at the table, wouldn’t the people have to say – it has been a long time since they had an election?\n\n“That’s not a Russian thing, that’s something coming from me and coming from many other countries also.”\n\nMr Trump also told reporters he and Russian leader Vladimir Putin had discussed Ukraine before the full-scale invasion in 2022.\n\n👉 Listen to Sky News Daily on your podcast app 👈\n\n“President Putin and I would talk about Ukraine, and it was the apple of his eye, I will tell you that,” he said.\n\n“But he never, there was never a chance of him going in. And I told him: ‘You better not go in, don’t go in, don’t go in.’ And he understood that and he understood it fully.”\n\nUS and Russia ‘need vibrant diplomatic missions’\n\nMr Trump added he will probably meet with Mr Putin before the end of the month.\n\nAt Tuesday morning’s talks, US and Russian officials agreed to restore embassy staffing and establish a high-level team to negotiate peace in Ukraine in another sign of the significant American change in diplomatic relations with Moscow.\n\nMr Rubio said the two countries “need to have vibrant diplomatic missions that are able to function normally”. The US and Russia also agreed to explore closer relations and economic cooperation at the meeting.\n\n“Should this conflict come to an acceptable end, the incredible opportunities that exist to partner with the Russians geopolitically on issues of common interest and frankly, economically, on issues that hopefully will be good for the world and also improve our relations in the long term,” Mr Rubio said.\n\nRead more from Sky News:Trump’s ‘diplomacy’ does not look good for Ukraine – analysisStarmer wants US ‘backstop’ to deter RussiaWho is attending Russia and US peace talks?\n\nHe added ending Russia’s war in Ukraine would require concessions from all sides.\n\nThe comments came as talks between Russian and US officials in Saudi Arabia ended – part of a remarkable US policy reversal after years of former president Joe Biden leading international efforts to isolate Moscow.\n\n‘Very useful’ talks, Lavrov says\n\nSpeaking to reporters after the meeting, Russian foreign minister Sergei Lavrov said “the conversation was very useful”.\n\n“We not only listened, but also heard each other,” Mr Lavrov said.\n\n“And I have reason to believe that the American side has started to better understand our position, which we have once again outlined in detail, using specific examples, based on President Putin’s repeated speeches.”\n\nUS State Department spokesperson Tammy Bruce said even though Ukraine was not at the table on Tuesday, any actual peace negotiations will include the country.\n\nMeanwhile, President Volodymyr Zelenskyy said his country will not accept any outcome from this week’s talks if Kyiv does not take part. No Ukrainian officials were present at the meeting.\n\nUkraine losing ground to Russia\n\nThe talks came as Ukraine is slowly but steadily losing ground against more numerous Russian troops in a grinding war that began nearly three years ago.\n\nThe Ukrainian air force said Russian troops launched a barrage of 176 drones at Ukraine on Monday night, most of which were destroyed or disabled by jamming.\n\nOne Russian drone struck a residential building in Dolynska in the Kirovohrad region, wounding a mother and her two children and prompting an evacuation of 38 apartments, the regional administration reported.\n\nFour more residential buildings were damaged by drone debris in the Cherkasy region of Ukraine, according to local officials.\n\nEuropean allies left scrambling\n\nTies between Russia and the US had fallen to their lowest level in decades in recent years – a rift that had been widening since Russia annexed Crimea from Ukraine in 2014 and worsened after Moscow’s full-scale invasion in 2022.\n\nAt that point, the US, along with European nations, imposed a raft of sanctions on Russia and the allies have repeatedly expanded the measures to damage the Russian economy.\n\nBut the recent US diplomatic blitz on the war has sent Mr Zelenskyy and key European allies scrambling to ensure a seat at the table amid concerns that Washington and Moscow could press ahead with a deal that will not be favourable to Ukraine.\n\nOn Monday, France called an emergency meeting of European nations, including the UK, to discuss the war.\n\nSaudi Arabia seeks to be diplomatic player\n\nThe meeting between the US and Russia on Tuesday at the Diriyah Palace in the Saudi capital of Riyadh also highlights de facto leader Crown Prince Mohammed bin Salman’s efforts to be a major diplomatic player, burnishing a reputation severely tarnished by the 2018 killing of Washington Post journalist Jamal Khashoggi.\n\nSaudi state media described the talks as happening at the prince’s direction. Saudi Arabia has also helped in prisoner negotiations and hosted Mr Zelenskyy for an Arab League summit in 2023.\n\nMr Zelenskyy had been due to travel to Saudi Arabia this week but rescheduled it to 10 March, suggesting he wanted to avoid his visit being linked to the US-Russia talks since Ukrainian officials were not invited.","summary":"Donald Trump has suggested Russia&#8217;s war in Ukraine could have been &#8220;settled very easily&#8221; as he criticised Kyiv&#8217;s negotiation skills. In comments after an extraordinary meeting between senior American and Russian officials on Tuesday morning in Saudi Arabia, the US president said of Ukraine: &#8220;They&#8217;ve had a seat [at the table] for three years and &#8230;\n\n\nThe post Trump hints Ukraine election may be needed for peace &#8211; as he addresses Kyiv being left out of Russia talks appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/trump-hints-ukraine-election-may-be-needed-for-peace-as-he-addresses-kyiv-being-left-out-of-russia-talks/","image":"https://e3.365dm.com/25/02/1600x900/skynews-marco-rubio-saudi-arab_6832165.jpg?20250218075211","video":null,"publish_date":"2025-02-19 00:16:12","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.122},{"id":291934288,"title":"Palantir CEO Criticizes Democrats’ Resistance to DOGE","text":"As many Democrats challenge Elon Musk’s Department of Government Efficiency (DOGE), a major tech leader and frequent donor to Democrats has raised questions about their opposition—the latest in a line of criticisms from the tech world directed at a political party with which it once was comfortably aligned.\n\nPalantir Technologies CEO Alex Karp aired his concerns with a party he often supports in an interview broadcast on Feb. 17 on CNBC’s Squawk Box program.\n\nKarp co-founded the software firm Palantir Technologies, a top defense contractor, with Peter Thiel, one of Silicon Valley’s most outspoken conservative libertarians.\n\nHe took issue with progressive leftists’ general opposition to DOGE, saying most Americans support its identification of fraud, waste, and abuse in federal spending.\n\n“I just view this as yet another example of the progressive left boxing themselves into a suicide dance,” he continued, questioning whether this group was seeking to communicate with Musk in good faith.\n\n“Why is it that we do not know where every penny of our money goes? How do you explain that to people?” he asked, adding that DOGE’s use of artificial intelligence (AI) is a powerful means of bringing transparency to government spending.\n\n“It feels like the people criticizing Elon don’t want it to happen. And this is going to destroy those people,” Karp said.\n\nSen. Richard Blumenthal (D-Conn.), a frequent participant in protests against DOGE, told The Epoch Times that engagement between progressive Democrats and Musk is difficult because “it’s hard to engage with an oligarch who’s trying to tear apart our democracy.”\n\n“There’s just a host of conflicts of interest that ought to deeply trouble progressives,” Blumenthal said of Musk’s effort, citing possible access to data of Musk’s business competitors.\n\nYet, Blumenthal said, he would be glad to speak with Karp, “or anyone else.”\n\nKarp, a self-described socialist with a Ph.D. in philosophy, has donated tens of thousands to the Democratic Senatorial Campaign Committee and the Democratic Congressional Campaign Committee. His money has also backed various individual Democrats, including Sen. Chris Coons (D-Del.) and Rep. Jason Crow (D-Colo.).\n\nIn recent years, he has stepped up his donations to the GOP, including to Rep. Elise Stefanik (R-N.Y.), President Donald Trump’s pick for U.S. ambassador to the United Nations.\n\nKarp said a turning point for him was Hamas’s Oct. 7, 2023, attack on Israel, the latest massive escalation in a decades-long tit-for-tat between that state and Palestinian leadership.\n\nSeveral months into the conflict, he flew his company’s board to Israel in a show of support. The firm maintains an office in that country.\n\nKarp, who is Jewish, took other tech leaders to task for failing to back Israel in as public a way as he had.\n\n“I think so few people speak out because they believe they can skirt by with no opinion, but there is no one who doesn’t have an opinion on Israel, especially if you are a big company,” the tech CEO said at the time.\n\nIn the months leading up to the 2024 election, Karp said he would be “voting against Trump” despite his reservations with Democrats, backing the candidacies of both former President Joe Biden and former Vice President Kamala Harris.\n\nOther tech leaders have backed away from the party that found ready allies in Silicon Valley during President Barack Obama’s administration.\n\nMeta CEO Mark Zuckerberg donated to Trump’s inaugural fund and, on a recent episode of the Joe Rogan Experience, said that the Biden administration pressured Facebook to censor COVID-19-related content.\n\nThe Epoch Times has also reached out to Rep. Jared Moskowitz (D-Fla.) a Democrat on the House DOGE Caucus, for comment on Karp’s remarks.","summary":"‘This is going to destroy those people,’ Alex Karp says of DOGE opponents.","url":"https://www.theepochtimes.com/us/palantir-ceo-criticizes-democrats-resistance-to-doge-5812338","image":"https://img.theepochtimes.com/assets/uploads/2023/09/14/id5491884-musk-ai-GettyImages-1678319113-300x180.jpg","video":null,"publish_date":"2025-02-19 00:14:47","author":"Nathan Worcester","authors":["Nathan Worcester"],"language":"en","category":"politics","source_country":"us","sentiment":-0.364},{"id":291941582,"title":"Donald Trump’s direction of travel in diplomacy does not look good for Ukraine | World News","text":"That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe.\n\nVolodymyr Zelenskyy, the Ukrainian president, has consistently warned that Kyiv must have a seat at the negotiating table for any discussions about ending Vladimir Putin‘s war to have a chance of success. His European allies also want to have a voice.\n\nYet these requests were ignored by Donald Trump and his strongman approach to diplomacy, with the president instead dispatching his top diplomat and two other senior envoys to meet Russian counterparts in Saudi Arabia on Tuesday.\n\nUkraine war latest: Trump says he’s ‘more confident’ of peace deal\n\nMr Zelenskyy, apparently by chance, had been due to embark on a pre-planned trip to the kingdom later that same day.\n\nHowever, he decided to delay the visit to avoid the appearance of giving any kind of legitimacy to the bilateral encounter between Moscow and Washington.\n\nUnfortunately for Kyiv, beyond noisy protest, it has very limited options when it comes to channelling the disruptive force of the Trump White House in its favour.\n\n👉 Listen to Sky News Daily on your podcast app 👈\n\nThe Ukrainian military remains hugely reliant on US weapons to fight Russia’s invasion and Mr Zelenskyy has made clear he would want an American element in any international security force that might be agreed upon to monitor a ceasefire – even though this is a role the US appears reluctant to fill and the Kremlin has said would be “unacceptable”.\n\nIt means Mr Trump has significant leverage over his Ukrainian counterpart which he will surely use to try to force through negotiations even on terms less favourable to Kyiv.\n\nRead more:Analysis – Russia tries to appeal to Trump’s business background\n\nThe US has already reportedly tried to make Ukraine sign away a large portion of its natural resources to pay for US support – an uncomfortable offer that Mr Zelenskyy has so far declined but an indication of the new transactional approach to US foreign policy.\n\nMr Trump has repeatedly vowed to end Russia’s war in Ukraine – even claiming during the US election campaign that he would do this within 24 hours.\n\nBut he never spelled out how.\n\nThe past week, however, has offered an indication of the direction of travel and it does not look good for Ukraine.\n\nFrom unilaterally picking up the phone to Vladimir Putin to sanctioning such a high-level meeting with the Russians in Riyadh, the only currency that seems to matter to the White House is power and right now both Kyiv and its European partners are looking all too weak.","summary":"That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe. Volodymyr Zelenskyy, the Ukrainian president, has consistently warned that Kyiv must have a seat at the negotiating table for any discussions about ending Vladimir Putin&#8216;s war [&#8230;]\n\n\nThe post Donald Trump&#8217;s direction of travel in diplomacy does not look good for Ukraine | World News appeared first on Ghana Latest News.","url":"https://ghananewss.com/donald-trumps-direction-of-travel-in-diplomacy-does-not-look-good-for-ukraine-world-news/","image":"https://e3.365dm.com/25/02/768x432/skynews-steve-witkoff-marco-rubio_6832576.jpg?20250218140706","video":null,"publish_date":"2025-02-19 00:13:34","author":"Donald Trump,Ghana News","authors":["Donald Trump","Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.301},{"id":291934282,"title":"Howard Lutnick Confirmed as Trump’s Commerce Secretary","text":"Howard Lutnick, President Donald Trump’s pick to lead the Department of Commerce, has been confirmed by the Senate in a 51–45 vote.\n\nPrior to the upper chamber vote, Senate Majority Leader John Thune (R-S.D.) touted Lutnick’s success on Wall Street and his work with Sept. 11 survivors.\n\n“I am glad President Trump has chosen an outcome-driven leader,” Thune said in prepared remarks.\n\n“Howard Lutnick’s greatest business achievement is not building his own success or building up a company; it was rebuilding Cantor Fitzgerald.” The headquarters of the financial services firm was in the North Tower of the World Trade Center, just above the impact site of one of the Sept. 11, 2001, terrorist attacks. All of its 658 employees in the office that day died.\n\nThune called Lutnick’s story inspiring as he gave surviving staff an option: either attend 20 funerals a day for the next month or work hard to rebuild the firm. Employees agreed to donate a quarter of their salaries to the 658 families of their colleagues with no limit and no expectations to be repaid.\n\n“It’s a lesson in resilience, determination in the American spirit, and it demonstrates the type of person Howard Lutnick is, and the type of public servant that he'll be,” Thune said.\n\nLutnick passed a crucial procedural vote in the upper chamber on Feb. 13 as senators advanced his nomination in a 52-45 vote.\n\nA week earlier, the Senate Commerce, Science, and Transportation Committee voted 16-12 to send the billionaire CEO to the procedural vote. Sen. John Fetterman (D-Pa.) voted with all Republicans in support of Lutnick.\n\n“They treat us poorly,” Lutnick told lawmakers of U.S. trading partners. “We are treated horribly by the global trading environment. They all have higher tariffs, non-tariff trade barriers, and subsidies.”\n\nLutnick, chairman and CEO of Cantor Fitzgerald, advocated for across-the-board tariffs instead of targeted levies. He believes a targeted approach would result in “picking on farmers.”\n\n“I think when you pick one product in Mexico, they’ll pick one product [to retaliate],” he said. “We pick avocados, they pick white corn; we pick tomatoes, they pick yellow corn.”\n\nThis comes as Trump announced reciprocal tariffs on foreign nations, a strategy that could go into effect as early as April.\n\n“I have decided, for purposes of fairness, that I will charge a reciprocal tariff being whatever countries charge the United States of America,” Trump said from the Oval Office on Feb. 13.\n\n“We will charge them no more, no less. In other words, they charge us a tax or tariff, and we charge them the exact same tax or tariff. Very simple.”\n\nA key component of the latest tariff plans will be focusing on the European Union’s value-added tax (VAT), which administration officials liken to a tariff.\n\nVATs are consumption taxes levied on the value added to goods and services, and are collected at each stage of production and distribution. While the standard VAT rate must be at least 15 percent, the average EU rate is 21.8 percent.\n\nLutnick criticized the VAT because “when they sell to us, of course, they drop that 20 percent right away.”\n\n“So, it’s sort of an export subsidy, if you will,” he said. “We are going to address each country one by one.”\n\nLutnick is expected to lead studies to determine the appropriate tariff rates for each nation. He told reporters he anticipates the studies will be finished by April 1.","summary":"The Wall Street billionaire executive will lead a study on reciprocal tariffs as one of his first duties.","url":"https://www.theepochtimes.com/us/howard-lutnick-confirmed-as-trumps-commerce-secretary-5810170","image":"https://img.theepochtimes.com/assets/uploads/2025/01/29/id5800830-Howard-Lutnick-Howard-Lutnick_1-300x180.jpg","video":null,"publish_date":"2025-02-19 00:12:20","author":"Andrew Moran","authors":["Andrew Moran"],"language":"en","category":"politics","source_country":"us","sentiment":0.229},{"id":291932800,"title":"President of NYU's College Republicans Forced to Resign After Calling Barron Trump an 'Oddity on Campus'","text":"Kaya Walker, the president of NYU's College Republicans, was forced to resign after calling Barron Trump an \"oddity on campus.\"\n\n Walker's resignation letter to the New York Federation of College Republicans was shared by NYU's College Republicans in a post on X on Tuesday, Feb. 18.\n\n The resignation occurred days after Vanity Fair published an article that examined the college life of President Donald Trump's 18-year-old son.\n\n \"He's sort of like an oddity on campus,\" Walker told the outlet in a story about Barron published on Wednesday, Feb. 12. \"He goes to class, he goes home.\"\n\n She claimed in her resignation letter that her comments were \"ridiculously misconstrued to suggest that I found Barron Trump's commuter status to be unusual when in reality the majority of NYU's student body-including myself-are commuters.\"\n\n According to Walker, her complete statement to Vanity Fair showed her \"disappointment in the spectacle that the media and individuals on campus have created through the online circulation of gossip, articles, memes and even photos taken of Barron in class with no respect whatsoever for his privacy.\"\n\n Walker noted that she is not an acquaintance of Barron and has never seen him on campus. She said the \"oddity\" she spoke about was the \"unhealthy fascination that people have with a teenager just minding his business by going to college.\"\n\n The college student used Dylan & Cole Sprouse's time at NYU as an example of the \"ugly side of our culture on campus and worldwide that delights in forming parasocial relationships with celebrities\" and said she does \"not apologize for trying to denouce the campus hysteria.\"\n\n \"I do apologize to everyone that I love and respect that was caught in the crosshairs of this willful and malicious misreading of my comment,\" Walker said.\n\n College Republicans of America, however, noted in a press release that Walker's statement to Vanity Fair \"does not align with the values and principles upheld by our organization.\"\n\n They said that although what Walker said was \"unfairly framed,\" a review of her comments found them to be \"inappropriate.\"\n\n The organization said its goal is to \"reaffirm CRA's dedication to the ideals of the Republican Party and conservative movement in a manner that reflects honorably upon our organization and its mission.\"\n\n In response to the incident, they invited Barron to join them in \"reshaping the Republican Party.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories.\n\n \"Barron Trump represents the future of the conservative movement, and we would be honored to have him join College Republicans. Strong leadership is built on resilience, courage, and the humility to rise above petty hostility–qualities that Barron has already demonstrated,\" said College Republicans of America president Will Donahue in a statement on X.","summary":"Kaya Walker said her comments were \"ridiculously misconstrued\" in her resignation letter to the New York Federation of College Republicans","url":"https://people.com/president-of-nyu-college-republicans-forced-to-resign-after-calling-barron-trump-an-oddity-on-campus-11681892","image":"https://people.com/thmb/9rHYFc4mkqM6BGGGJbHV-VaXUkE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/barron-trump-inauguration-012025-f4981b6407fa4384a60c7604cf17d942.jpg","video":null,"publish_date":"2025-02-19 00:10:47","author":"Ingrid Vasquez","authors":["Ingrid Vasquez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.193},{"id":291934290,"title":"Trump Signals Auto, Chip, Pharmaceutical Tariffs May Sit Around 25 Percent","text":"The United States may impose a 25 percent tariff on imports of automobiles, semiconductors, and pharmaceuticals as part of a reciprocal tariff plan, President Donald Trump said on Feb. 18.\n\nOn Tuesday, Trump told reporters at a press conference at his Mar-a-Lago home in Palm Beach, Florida, that the United States may impose a tariff of “in the neighborhood of 25 percent” on automobiles.\n\nHowever, he added that additional information would be provided on April 2.\n\nOn Feb. 13, Trump signed a plan to enact sweeping tariffs on U.S. trading partners.\n\nA preliminary study is due to be completed on April 2 before the reciprocal tariffs are implemented.\n\nRepresentatives of the White House did not immediately respond to a request for clarification from The Epoch Times.\n\nAs for semiconductors and pharmaceuticals, Trump said the rate would be 25 percent “and higher” and that “it will go very substantially higher over the course of a year.”\n\nOn Feb. 13, the White House said it will examine each country’s tariff and non-tariff trade barriers, including tariff rates, foreign exchange rate policies, regulations and taxes, and other practices the U.S. Trade Representative determines to be unfair.\n\nThe Epoch Times previously reported that Russ Vought, director of the Office and Management Budget (OMB), will assess the fiscal impact of these levies within 180 days.\n\nTrump was asked about the role of the European Union’s (EU) value-added tax in the tariff calculations and if there is anything the economic and political bloc could do to avoid or reduce a reciprocal tariff.\n\nIn response, Trump said that the EU has already reduced what he called its “car tariff” to “what we have.”\n\n“The EU had a 10 percent tax on cars, and now they have a 2.5 percent tax, which is the exact same as us,” Trump said.\n\n“So already we’ve saved a tremendous amount. That would be great if everybody would do that, Then we'd all be on the same playing field.”\n\nAt the same Feb. 13 announcement, Trump said the reciprocal tariffs could amount to 100 percent on products imported from the so-called BRICS countries: Brazil, Russia, India, China, and South Africa.\n\nThat amount will be charged in response to what Trump called playing “games with the dollar.”","summary":"A preliminary study is due to be completed on April 2 before the reciprocal tariffs are implemented.","url":"https://www.theepochtimes.com/us/trump-signals-auto-chip-pharmaceutical-tariffs-may-sit-around-25-percent-5812356","image":"https://img.theepochtimes.com/assets/uploads/2025/02/04/id5803967-GettyImages-1151712645-LSedit-300x180.jpg","video":null,"publish_date":"2025-02-19 00:09:19","author":"Austin Alonzo","authors":["Austin Alonzo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.296},{"id":291941184,"title":"Judge questions motives for Trump's order banning transgender troops","text":"A federal judge on Tuesday questioned President Donald Trump's motives for issuing an executive order that calls for banning transgender troops from serving in the U.S. military, describing a portion of the directive as “frankly ridiculous.”U.S. District Judge Ana Reyes indicated that she won't rule before early March on whether to temporarily block the Trump administration from enforcing the order, which plaintiffs' attorneys have said illegally discriminates against transgender troops.But her questions and remarks during Tuesday's hearing suggest that she is deeply skeptical of the administration's reasoning for ordering a policy change. Reyes also lauded the service of several active-duty troops who sued to block the order.“If you were in a foxhole, would you care about these individuals' gender identity?” the judge asked a government attorney, who answered that it “would not be a primary concern of mine.”Trump’s Jan. 27 order claims the sexual identity of transgender service members “conflicts with a soldier’s commitment to an honorable, truthful, and disciplined lifestyle, even in one’s personal life” and is harmful to military readiness. It requires Defense Secretary Pete Hegseth to issue a revised policy.Six transgender people who are active-duty service members and two others seeking to join the military sued to block the Trump administration from enforcing the order. In a court filing, plaintiffs' lawyers argued that Trump's order openly expresses \"hostility” and constitutionally impermissible “animus” toward transgender people.RELATED STORY | As the military changes policy, the Army will no longer accept transgender service membersReyes said the order's language smears thousands of transgender troops as dishonest, dishonorable and undisciplined.She asked Justice Department attorney Jason Lynch: “How is that anything other than showing animus?”“I don’t have an answer for you,” Lynch responded.“No, you have an answer. You just don’t want to give it,” the judge shot back.Trump's order also says that “use of pronouns that inaccurately reflect an individual’s sex” is inconsistent with a government policy to \"establish high standards for troop readiness, lethality, cohesion, honesty, humility, uniformity, and integrity.”Reyes said it is “frankly ridiculous” to suggest that pronoun usage could impact the military readiness of the U.S. armed forces.\"Because it doesn't. Because any common sense, rational person would understand that it doesn’t,” said Reyes, who was nominated by President Joe Biden, a Democrat.Reyes peppered Lynch for several hours with questions about the executive order. They disagreed on whether the language of the executive order explicitly bans transgender people from serving in the military.Reyes asked Lynch if Trump himself would call it a ban, then added, “He would say, ‘Of course it is,’ because he calls it a transgender ban.” Lynch said the order itself doesn’t require the discharge of service members while Hegseth crafts a policy that reflects it.“Everyone knows a change is coming. I’m not denying that,” Lynch said.Reyes is expected to hear more arguments on Wednesday and again on March 3.Plaintiffs’ attorneys contend Trump's order violates transgender people’s rights to equal protection under the Fifth Amendment, marking them as “unequal and dispensable, demeaning them in the eyes of their fellow service members and the public.”“The ban is an irrational and prejudicial attack on service members who have risked their lives to serve their country,” they wrote in a court filing.Government attorneys say the plaintiffs are prematurely challenging an order that doesn’t immediately require transgender troops to be discharged. The Justice Department also argues that the constitutional right to equal protection “requires only that similarly situated persons be treated alike.”“A transgender individual identifying as a woman is not similarly situated to a biological female, nor is a transgender individual identifying as a man similarly situated to a biological male,” they wrote.During Trump’s first term, the Republican issued a directive directive to ban transgender service members. The Supreme Court allowed the ban to to take effect. Biden scrapped it when he took office.Thousands of transgender people serve in the military, but they represent less than 1 percent of all active-duty service members.The plaintiffs include an Army Reserves platoon leader, an Army major who was awarded a Bronze Star for service in Afghanistan and a Sailor of the Year award winner serving in the Navy. They are represented by attorneys for the National Center for Lesbian Rights and GLAD Law.","summary":"A federal judge on Tuesday questioned President Donald Trump's motives for issuing an executive order that calls for banning transgender troops from serving in the U.S. military.","url":"https://www.scrippsnews.com/us-news/lgbtq/judge-questions-motives-for-trumps-order-banning-transgender-troops","image":"https://ewscripps.brightspotcdn.com/dims4/default/36aa4f0/2147483647/strip/true/crop/3009x1580+0+233/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fbd%2F8d%2Fb1730eca48d8a607dd384d7a7ab4%2Fap24321673341221.jpg","video":null,"publish_date":"2025-02-19 00:09:16","author":"AP via Scripps News","authors":["AP via Scripps News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.402},{"id":291936986,"title":"Trump is making Europe squirm — to force a lasting peace in Ukraine","text":"Secretary of State Marco Rubio and a team of negotiators met Tuesday with their Russian counterparts in Riyadh, unthawing US-Russian relations in a dramatic diplomatic turnabout and kicking off talks on the war in Ukraine.\n\nConspicuously absent were representatives from Europe.\n\nThat meeting capped off a dizzying week of transatlantic diplomacy by the United States, punctuated by Vice President JD Vance’s remarks at the Munich Security Conference that mentioned Ukraine only twice, and only in passing.\n\nVance said he avoided publicly outlining a Ukraine peace strategy to “preserve the president’s negotiating leverage,” and to set no red lines ahead of the meetings in Saudi Arabia.\n\nBut Vance’s choice can also be seen as a move designed to shock Europe into action — a perspective consistent with President Trump’s own views on transatlantic relations and military burden-shifting.\n\nTo be sure, Vance’s planting of a rhetorical MAGA flag in Europe channels a belief held by many Trump supporters that European elites, especially in Germany, are allied outright with progressives in the United States.\n\nBut the VP’s speech was also a new twist on a time-tested Trump specialty: exposing US allies to the specter of a threat from a hostile power — in this case Russia — to prod them into sharing responsibility for their own security.\n\nVance administered this push in a way that will be remembered for years to come — not because of anything he said about NATO’s security guarantee or the future of Ukraine, but for his remarks questioning Europe’s commitment to democracy itself.\n\nWhen he lamented “the retreat of Europe from some of its most fundamental values, values shared with the United States of America,” progressives who believe their own values must dictate foreign relations no doubt blanched.\n\nWhen he argued, “If you’re running in fear of your own voters, there is nothing America can do for you,” more than a few EU officials felt a pang of anxiety for the future of relations between Washington and Brussels.\n\nAnd when Vance ended his speech with the lukewarm peroration, “Good luck to you all,” many even-keeled, sober-minded analysts raced to the grim conclusion that Europe would be forced to face Russia alone.\n\nThe meetings in Riyadh caused those fears to metastasize into outright alarm.\n\nTo the Trump administration, however, Europe’s collective handwringing is proof of concept rather than a sign of any misstep.\n\nVance’s speech was intended to make Europe squirm — and to push it into action: If Europe wishes to shape US strategy toward Russia, it will have to field a level of military capabilities commensurate with its economic power.\n\nPerhaps the past week can serve as the wake-up call that will finally rouse Europe from its slumber.\n\nOn Sunday, ahead of an emergency meeting of major European powers in Paris, British Prime Minister Keir Starmer announced that he is “ready and willing to contribute to security guarantees to Ukraine by putting our own troops on the ground if necessary.”\n\nOn Monday, as the flash summit convened, NATO Secretary General Mark Rutte declared that many European states are “wanting to put troops in Ukraine post a peace deal” — perhaps in reference to comments from Ulf Kristersson, the Swedish prime minister, who told reporters that such a move “is absolutely a possibility.”\n\nFor his part, Polish Prime Minister Donald Tusk posted on X, “If we, Europeans, fail to spend big on defense now, we will be forced to spend 10 times more if we don’t prevent a wider war.”\n\nEurope should expect more pressure from the Trump team in the months to come as Washington searches for a path to settle the war in Ukraine, where the situation is dire.\n\nRegardless of how its talks with Russia unfold, the Trump administration will expect Europe to take the lead in supporting Kyiv — and will remind them of the consequences of holding back.\n\n“An underlying principle here is that the Europeans have to own this conflict going forward,” as National Security Adviser Mike Waltz stated earlier this month.\n\nDefense Secretary Pete Hegseth reinforced that point at his first meeting of the Ukraine Defense Contact Group in Brussels last week when he declared that “as part of any security guarantee, there will not be US troops deployed to Ukraine” — and, more broadly, that America would no longer be “primarily focused on the security of Europe.”\n\nLiberals may argue that playing hardball with Europe will only antagonize US allies and embolden Vladimir Putin. But Trump and Vance are willing to run those risks.\n\nIf Europe does not get its act together — their not-so-subtle message — the US will simply ignore it.\n\nTrump and the rest of the administration reason the Kremlin is far likelier to respect an alliance that wields power through its military than through anodyne summit declarations.\n\nFor all his swagger, Putin is not immune to the logic of deterrence. The Europeans shouldn’t be either.\n\nActing on that fact is the key to their getting a seat at the table.\n\nPeter Rough is a senior fellow and director of the Center on Europe at Hudson Institute.","summary":"Europe should expect more pressure from the Trump team as it seeks to settle the war in Ukraine — because military deterrence is the only language Russia understands.","url":"https://nypost.com/2025/02/18/opinion/trump-is-making-europe-squirm-to-force-true-peace-in-ukraine/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-y45duxaia-1739923654728.jpg?quality=75&strip=all&1739905679&w=1200","video":null,"publish_date":"2025-02-19 00:08:44","author":"Peter Rough","authors":["Peter Rough"],"language":"en","category":"politics","source_country":"us","sentiment":0.233},{"id":291938342,"title":"US Lawmakers Confirm Howard Lutnick As Commerce Secretary","text":"The US Senate voted Tuesday to confirm Wall Street billionaire Howard Lutnick as commerce secretary, a key step towards the rollout of President Donald Trump's \"America First\" trade policy, which uses tariffs as a broad negotiation tool.Trump has threatened sweeping levies on US allies and competitors alike, looking to tariffs not only as a way to raise revenue but also pressure other countries to act on US priorities.Lutnick, chief executive of financial services firm Cantor Fitzgerald, is a close ally of Trump's and has been a defender of imposing tariffs on US imports.On Tuesday, he was confirmed by a vote of 51-45.He takes the helm at a department that advocates for US business interests and oversees an apparatus restricting the export of certain technology -- including semiconductors -- to adversaries, including China and Russia.The role will place him at the frontier of Washington's tariff and trade agenda too, working with the US Trade Representative's office.The Commerce Department is in charge of a nearly $53 billion program involving subsidies to stimulate the US chipmaking sector, which Lutnick earlier called an \"excellent downpayment\" despite stressing the need to review investments.During his confirmation hearing last month, Lutnick backed sweeping tariffs targeting countries rather than specific products and signaled a hawkish approach to Beijing.\"We can use tariffs to create reciprocity, fairness and respect,\" he told lawmakers.He also denied that tariffs would cause widespread inflation, despite economists' concerns that duties could add to consumer costs in the short term and weigh on growth in the longer haul.The commerce secretary has a broad agenda to implement, and negotiations with some of the United States' biggest trading partners to contend with.Trump has unveiled blanket duties of up to 25 percent on immediate US neighbors Canada and Mexico, threatening to snarl supply chains in key sectors like automobiles and setting off a flurry of negotiations.The levies, which Trump said were imposed over immigration and drug smuggling concerns, are due to take effect in early March after a month-long pause as talks continue.Separately, Trump also announced 25-percent tariffs on steel and aluminum imports from March 12, which officials said would pile atop the hefty rates threatened on Canada and Mexico.Looking ahead, Lutnick has signaled his willingness for broad \"reciprocal tariffs\" against US trading partners to start as early as April 2.These levies, which Washington said are aimed at correcting \"longstanding imbalances\" in trade, would be tailored to each country.Officials would consider both the tariffs countries impose on US goods as well as taxes seen as \"discriminatory\" -- such as value-added taxes.","summary":"The US Senate voted Tuesday to confirm Wall Street billionaire Howard Lutnick as commerce secretary, a key step towards the rollout of President Donald Trump's \"America First\" trade policy, which uses tariffs as a broad negotiation tool.","url":"https://www.ibtimes.com/us-lawmakers-confirm-howard-lutnick-commerce-secretary-3764174","image":"https://d.ibtimes.com/en/full/4583319/us-president-donald-trump-announces-reciprocal-tariffs-white-house-oval-office-february-13-2025.jpg","video":null,"publish_date":"2025-02-19 00:06:19","author":"Beiyi Seow","authors":["Beiyi Seow"],"language":"en","category":"politics","source_country":"US","sentiment":0.115},{"id":291939392,"title":"Kanye West Claims His Swastika T-Shirt Was 8 Years in the Making—But Is It Enough to Defend Himself?","text":"Popular rapper and producer Kanye West is undoubtedly controversy’s favorite child! Despite his recent Grammy Awards drama, followed by abrupt social media stunts, Kanye went offline from social media after a string of anti-Semitic comments, which received backlash and left fans and critics stunned. Moreover, West’s remarks have sparked outrage, notably after he asserted “dominion” over his wife, Bianca Censori.\n\nIn recent news, the rapper made his social media comeback on Monday with a fresh rant. West addressed the recent incident involving a swastika-adorned T-shirt, which led to the suspension of his Shopify account as his garment brand Yeezy was dropped from it. The shirt, which was widely criticized for its offensive symbol, comes amid an ongoing string of polarizing actions and statements from Kanye that have left not only his fans utterly disappointed but also affected his professional space. \n\nAs per Hip Hop, in his latest rant, Kanye then turned his attention to his swastika T-shirt, saying, “I’ve Had My Swastika T-Shirt Idea For Over 8 Years. It Was So Intriguing To Me That A Symbol Had So Much Programming In It.”. He further added that he had visited Japan and witnessed it for the first time, only to find out that the symbol had many different meanings attached to it. Kanye’s rant seemed quite disturbing as it saw him attack Jewish people, praise Hitler and Nazism, and defend violence and sexual abuse against women.\n\nThe swastika is an ancient sign that has been used in diverse cultures for thousands of years, often with positive representations; it also became a core part of the Nazi regime in the 20th century, which contributed to Adolf Hitler’s reign of the Holocaust and brutal atrocities in Germany. \n\nView this post on Instagram\n\nFans have been upset as the symbol today represents hate and racism in much of the world. Furthermore, Kanye West also addressed the fact that he reportedly lost Malcom, who happened to be a designer at his brand who also tailored his Grammy dress. He expressed that one day fans would understand his thought process and consider it. However, he did not clarify the context behind his shocking admission. Given his history of controversial comments, people aren’t surprised.\n\nView this post on Instagram\n\nA post shared by # Everything Kanyeezy (@kanyeunlimited) \n\nHowever, like the rest of his posts, this was also deleted; meanwhile, the swastika T-shirt isn’t the only one that got dropped from his website and caused chaos, as per sources. After requesting Donald Trump to free Diddy Combos from jail after his nasty ongoing drama, which went viral last year, Kanye began selling the same hoodie that was worn by Cassie when she was severely attacked by the disgraced in 2016. \n\nCreepy right? Well, not for Kanye! The rapper later bragged that he had made over $30,000 in revenue from sales of the hoodie and even attempted to justify the horrific assault, calling it an act of “true love.”","summary":"Kanye West made his social media comeback on Monday with a fresh rant. The rapper addressed the recent incident involving the swastika-adorned T-shirts, which sparked backlash.","url":"https://www.inquisitr.com/kanye-west-claims-his-swastika-t-shirt-was-8-years-in-the-making-but-is-it-enough-to-defend-himself","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/West.png","video":null,"publish_date":"2025-02-19 00:04:52","author":"Sweta Choudhury","authors":["Sweta Choudhury"],"language":"en","category":"politics","source_country":"US","sentiment":-0.131},{"id":291934278,"title":"Trump Orders Agencies to Disclose Details of Wasteful Spending","text":"President Donald Trump signed on Feb. 18 a memorandum ordering agencies to publicize information about wasteful spending in a move described as enhancing government transparency.\n\n“The American people have a right to see how the federal government has wasted their hard-earned wages.”\n\nThis comes as the Trump administration, largely through audits conducted by the Department of Government Efficiency, or DOGE, has cut what it has deemed as wasteful spending in the executive branch by canceling funding for programs and initiatives.\n\nExamples of spending the administration has canceled include a $50 million grant to an environmental group that believes in “climate justice travels through a Free Palestine” and a $1.5 million grant to “advance diversity equity and inclusion in Serbia’s workplaces and business communities.”\n\nAfter signing the order, Trump cited Social Security payments going to those too old to still be alive.\n\nThis included more than 3.4 million payments to people between the ages of 120 and 129; 121,000 payments to those listed between 160 and 169 years old; and 6,087 payments to those between 170 and 179 years old.\n\n“I haven’t met any of them, and if I did, I would bless them,” he said, adding, “I would worship the ground they walk on.”\n\nThe administration, in its fact sheet, said it has canceled $881 million in Department of Education contracts—such as one worth $4.6 million that went toward organizing Zoom and in-person conferences.\n\nWhile talking to reporters, Trump cited other instances of what his administration has deemed as wasteful spending such as voluntary medical male circumcisions in Mozambique, “$10 million for circumcisions in another country,” and the Prague Civil Society Center getting $32 million.","summary":"While talking to reporters, President Donald Trump cited other instances of what his administration has described as wasteful spending.","url":"https://www.theepochtimes.com/us/trump-orders-agencies-to-disclose-details-of-wasteful-spending-5812311","image":"https://img.theepochtimes.com/assets/uploads/2025/02/14/id5810390-Trump-signs-EO-GettyImages-2198926708-300x180.jpg","video":null,"publish_date":"2025-02-19 00:04:49","author":"Jackson Richman","authors":["Jackson Richman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.264},{"id":291938426,"title":"US lawmakers confirm Howard Lutnick as commerce secretary","text":"The US Senate voted Tuesday to confirm Wall Street billionaire Howard Lutnick as commerce secretary, a key step towards the rollout of President Donald Trump's \"America First\" trade policy, which uses tariffs as a broad negotiation tool.\n\nTrump has threatened sweeping levies on US allies and competitors alike, looking to tariffs not only as a way to raise revenue but also pressure other countries to act on US priorities.\n\nLutnick, chief executive of financial services firm Cantor Fitzgerald, is a close ally of Trump's and has been a defender of imposing tariffs on US imports.\n\nOn Tuesday, he was confirmed by a vote of 51-45.\n\nHe takes the helm at a department that advocates for US business interests and oversees an apparatus restricting the export of certain technology -- including semiconductors -- to adversaries, including China and Russia.\n\nThe role will place him at the frontier of Washington's tariff and trade agenda too, working with the US Trade Representative's office.\n\nThe Commerce Department is in charge of a nearly $53 billion program involving subsidies to stimulate the US chipmaking sector, which Lutnick earlier called an \"excellent downpayment\" despite stressing the need to review investments.\n\nDuring his confirmation hearing last month, Lutnick backed sweeping tariffs targeting countries rather than specific products and signaled a hawkish approach to Beijing.\n\n\"We can use tariffs to create reciprocity, fairness and respect,\" he told lawmakers.\n\nHe also denied that tariffs would cause widespread inflation, despite economists' concerns that duties could add to consumer costs in the short term and weigh on growth in the longer haul.\n\nThe commerce secretary has a broad agenda to implement, and negotiations with some of the United States' biggest trading partners to contend with.\n\nTrump has unveiled blanket duties of up to 25 percent on immediate US neighbors Canada and Mexico, threatening to snarl supply chains in key sectors like automobiles and setting off a flurry of negotiations.\n\nThe levies, which Trump said were imposed over immigration and drug smuggling concerns, are due to take effect in early March after a month-long pause as talks continue.\n\nSeparately, Trump also announced 25-percent tariffs on steel and aluminum imports from March 12, which officials said would pile atop the hefty rates threatened on Canada and Mexico.\n\nLooking ahead, Lutnick has signaled his willingness for broad \"reciprocal tariffs\" against US trading partners to start as early as April 2.\n\nThese levies, which Washington said are aimed at correcting \"longstanding imbalances\" in trade, would be tailored to each country.\n\nOfficials would consider both the tariffs countries impose on US goods as well as taxes seen as \"discriminatory\" -- such as value-added taxes.\n\nSource: AFP","summary":"The US Senate voted Tuesday to confirm Wall Street billionaire Howard Lutnick as commerce secretary, a key step towards the rollout of President Donald Trump's \"America First\" trade policy, which uses tariffs as a broad negotiation tool. The commerce secretary has a broad agenda to implement, and negotiations with some of the United States' biggest trading partners to contend with.","url":"https://yen.com.gh/business-economy/277738-us-lawmakers-confirm-howard-lutnick-commerce-secretary/","image":"https://cdn.yen.com.gh/images/1200x675/f83c5469d270c7d8.jpeg?v=1","video":null,"publish_date":"2025-02-19 00:04:03","author":"Samuel Obour","authors":["Samuel Obour"],"language":"en","category":"politics","source_country":"gh","sentiment":0.165},{"id":291935402,"title":"Former Chino Valley school board member running in California’s 40th Congressional District","text":"Former Chino Valley Unified School District board member Christina Gagnier has launched a bid for California’s 40th Congressional District in the 2026 election.\n\nGagnier, a technology attorney, said she’s running to push back against President Donald Trump and billionaire Elon Musk, a “special government employee” in the Trump administration who leads the so-called Department of Government Efficiency cost-cutting initiative. Gagnier said she believes their proposed federal funding freezes and budget cuts are threatening the security of families and small businesses in her district.\n\n“We really need someone in Congress standing up to these bullies and making sure that these harmful policies and actions and cuts don’t happen,” she said.\n\nGagnier pointed to the economy as what she considers the most pressing issue for California’s 40th Congressional District.\n\n“In talking to the business owners … over the last couple of weeks, some of the longtime business owners who found their stride after a global recession and worked really hard to get their businesses back, they’re finding themselves looking at similar economic conditions now,” said Gagnier, who chairs the Chino Valley Chamber of Commerce.\n\nGagnier also positioned herself as a strong advocate for public education. Elected to the Chino Valley Unified School board in 2018, Gagnier led the opposition to the conservative members of the board, who gained control after she was ousted by Sonja Shaw in 2022.\n\nReferring to the board’s decision last year to require school staff to inform parents if their child wanted to change their pronouns or gender — a policy that led to legal battles and was later blocked by a judge — Gagnier said education policy should focus on real issues, not “culture wars.”\n\n“The kitchen table issues for public school parents are, ‘Do they have good quality teachers? Are there good programs at their schools? Are they getting college and career ready?’ These are the things that public school parents care about, and these are the things that are getting jeopardized with cuts to the Department of Education,” she said.\n\nIn 2023, Gagnier founded Our Schools USA, a nonprofit that encourages parental involvement in local school boards and works to elect candidates who oppose conservative policies. Gagnier also teaches about intellectual property as a lecturer at UC Irvine.\n\nIf Gagnier advances past the June primary, she faces a tough challenge in trying to unseat incumbent Rep. Young Kim, R-Anaheim Hills.\n\nDemocrats have targeted the 40th Congressional District since Kim was first reelected in 2022. In November, Kim won a third term by defeating Democrat Joe Kerr with 55.3% of the vote.\n\nGagnier has run for Congress before. In 2014, she ran against Rep. Norma Torres for California’s 35th District but lost by nearly 17,000 votes.\n\nKim is running for reelection in 2026. And art dealer Esther Kim Varet, a Democrat, has also announced a run for the district. Kerr in January also filed to run again for the seat.\n\nThe 40th District spans western San Bernardino and Riverside counties and eastern Orange County.\n\nRepublicans, according to the secretary of state’s latest tally of voter registration data from late October, make up 38.29% of registered voters, while Democrats are at 33.46% and 21.98% have no party preference.","summary":"California's 40th Congressional District is represented by Rep. Young Kim and is already eyed by national Democrats as a potential pickup in 2026.","url":"https://www.ocregister.com/2025/02/18/former-chino-valley-school-board-member-running-in-californias-40th-congressional-district/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/IDB-L-ELEX-CVUSD-Gagnier.jpeg?w=1024&h=683","video":null,"publish_date":"2025-02-19 00:03:12","author":"Hanna Kang","authors":["Hanna Kang"],"language":"en","source_country":"US","sentiment":-0.107},{"id":291933210,"title":"10% of NASA Workforce Laid Off Amid Trump Administration Cuts: Report","text":"NASA has laid off 10 percent of its workforce as part of a broader federal government downsizing initiative led by President Donald Trump's administration, according to a report from ABC News that cited unnamed sources at the space agency.The layoffs—reportedly affecting probationary employees and those accepting buyouts, according to ArsTechnica—come as Trump's administration implements workforce reductions across multiple federal agencies with the Department of Government Efficiency (DOGE) being tasked with identifying cost-cutting measures.The Trump administration's workforce reductions extend beyond NASA, with other federal agencies also facing significant layoffs.Why It MattersThe layoffs at NASA have raised concerns about their impact on the agency's ability to maintain critical projects. The Houston Chronicle reported that NASA's Johnson Space Center in Houston has informed employees still in their probationary period to prepare for dismissal. The Planetary Society, a space advocacy group, estimated that more than 1,000 scientists and engineers will be affected, with the agency's workforce potentially shrinking to its lowest level since 1961, which was during the start of the Apollo program.The American Federation of Government Employees (AFGE) condemned the layoffs, with AFGE President Everett Kelley telling the Houston Chronicle: \"This administration has abused the probationary period to conduct a politically driven mass firing spree, targeting employees not because of performance, but because they were hired before Trump took office.\"What To KnowAccording to the Houston Chronicle, nearly 3,000 full-time employees work at NASA's Johnson Space Center, and NASA employs approximately 18,000 civil servants nationwide. According to reports, the buyout program implemented by the Trump administration has led to 750 employees voluntarily resigning, while around 1,000 probationary employees have been terminated.\"NASA is complying with the guidance and direction provided by the Office of Personnel Management (OPM),\" sources at NASA told ABC News in a statement. \"It's premature to discuss the impact to our agency, at this time.\"Additionally, NASA Acting Administrator Janet Petro confirmed recently that members of DOGE had arrived to review contracts and spending at the agency, according to NASAWatch.com.What People Are SayingCasey Dreier, chief of space policy for the Planetary Society, told the Houston Chronicle: \"There's nothing in these layoffs that is designed to make NASA more effective. It is taking the desire of a lower head count as the most important thing.\"White House press secretary Karoline Leavitt posted to X (formerly Twitter) on Tuesday: \"For decades, leaders in America have pledged to address the rampant waste, fraud, and abuse in our federal government—only to end up doing nothing while watching the crisis grow even worse. But where others failed—President Trump is delivering. Major reforms are underway!\"What Happens NextFederal workforce reductions are expected to continue, with the Trump administration justifying the moves as part of a broader strategy to reduce government spending. Meanwhile, unions and advocacy groups are preparing legal challenges, arguing that the terminations violate established civil service protections.","summary":"Sources from NASA told ABC News that the organization was hit with layoffs as the Trump administration continues reeling back government spending.","url":"https://www.newsweek.com/nasa-layoffs-workforce-donald-trump-doge-admin-cuts-2032981","image":"https://d.newsweek.com/en/full/2591019/nasas-johnson-space-center.jpg","video":null,"publish_date":"2025-02-19 00:03:03","author":"Jenna Dejong","authors":["Jenna Dejong"],"language":"en","source_country":"US","sentiment":-0.4},{"id":291931202,"title":"DOGE wins massive victory after judge slams liberals' latest attempt to stop Trump's federal overhaul","text":"A federal judge appointed by Barack Obama denied liberals' last ditch attempt to stop 'First Buddy' Elon Musk from accessing government data in a huge victory for the Department of Government Efficiency. \n\nThe lawsuit was filed by 14 states' attorneys general, launched as a coordinated effort to strip the 'First Buddy' of his power.\n\nBut while U.S. District Judge Tanya Chutkan found that there are legitimate questions about Musk's authority, she said there isn't evidence of the kind of grave legal harm that would justify a temporary restraining order.\n\nThe attorneys general argued that Musk is wielding the kind of power that the Constitution says can only be held by those who are elected or confirmed by the Senate.\n\nThe Trump administration, for its part, has maintained that layoffs are coming from agency heads, and asserted that despite his public cheering of the effort Musk isn't directly running DOGE's day-to-day operations himself. \n\nDOGE has tapped into computer systems across multiple agencies with the blessing of President Donald Trump, digging into budgets and searching for what he calls waste, fraud and abuse, even as a growing number of lawsuits allege DOGE is violating the law.\n\nChutkan recognized the concerns about the 'unpredictable actions' from the group of states, which include New Mexico and Arizona.\n\n'DOGE's unpredictable actions have resulted in considerable uncertainty and confusion,' she wrote. \n\nTheir questions about Musk's apparent 'unchecked authority' and lack of Congressional oversight for DOGE are legitimate and they may be able to successfully argue them later.\n\nStill, at this point, it remains unclear exactly how DOGE's work will affect the states, and judges can only issue court only issue orders to block specific, immediate harms, she found.\n\nChutkan, who was nominated by Obama, previously oversaw the now-dismissed criminal election interference case against Trump in Washington, D.C.\n\nThe lawsuit was filed in federal court in Washington DC last Thursday, accusing the billionaire of performing tasks that should be well out of his remit.\n\nAs part of the complaint, the group hope Musk will be banned from accessing sensitive information or having the power to make staffing decisions and wipe out entire departments.\n\nThey simultaneously have asked the court to declare that Musk's actions have no legal impact. \n\nIt comes as Musk and his newly formed army of young engineers dismantle federal departments in an effort to cut costs and reduce waste.\n\nMusk's efforts have enraged Democrats and federal employees who have taken to the streets to protest his access and cuts. \n\nPresident Trump continues to back Musk's efforts, describing it as a key step in fulfilling his campaign promises. \n\nThe Democratic Attorneys general, however, challenged Musk's authority to act on Trump's behalf. \n\n'We are asking the court to invalidate his directives and actions and to issue a restraining order,' Michigan Attorney General Dana Nessel said in a press conference alongside attorneys general from Arizona and New Mexico.\n\nCalifornia, Connecticut, Hawaii, Maryland, Massachusetts, Minnesota, Nevada, Oregon, Rhode Island, Vermont and Washington attorneys general also joined the lawsuit. \n\nNew Mexico Attorney General Raúl Torrez warned President Trump that he is demonstrating 'weakness' by giving Musk unchecked power.\n\nHe suggested that the President should instead be advancing his agenda through a Republican-controlled Congress.\n\n'Move fast and breaking things may work in Silicon Valley for a tech company,' Torrez said. 'It's not good governance and it's unconstitutional.'\n\nThe group of high-powered Musk critics are now urging the court to identify ways that 'any data obtained through unlawful agency access was used' and remove access that Musk and his team already have.\n\nThey also want the court to prevent DOGE from making any more changes to the use of public funds, or government contracts. \n\nMusk's DOGE, along with the Office of Personnel Management (OPM), has also been granted sweeping powers to assert greater control over the hiring of any federal employee.\n\nPresident Trump put in place a 90-day hiring freeze when he returned to the White House for his second term.\n\n'The people voted for major government reform and that's what the people are going to get,' Musk said on Tuesday, from the Oval Office. 'They're going to get what they voted for.'\n\nOne the tactics includes ridding departments of employees who are still in their probationary periods - which can last up to two years in some agencies.\n\nOn Wednesday, Trump said that Musk's group had gone from 20 people to as many as 100. \n\n'He's a successful guy,' Trump said about Musk. 'That's why we want him doing this. We don't want an unsuccessful guy doing this.' \n\nThe DOGE team updated their government website Wednesday promising to release publicly available data on Friday of the savings that they had uncovered. \n\nThe team of technology experts have been terrifying government employees by entering department buildings and combing through public data looking for potential cuts. \n\nCurrently DOGE has saved the federal government $45.44 billion dollars, according to a tally conducted by doge-tracker.com. \n\nTrump signed an executive order on Tuesday ordering federal agencies to coordinate with DOGE to make 'large-scale reductions in force.' \n\n'He's a successful guy,' Trump said about Musk. 'That's why we want him doing this. We don't want an unsuccessful guy doing this.' \n\nThe DOGE team updated their government website Wednesday promising to release publicly available data on Friday of the savings that they had uncovered. \n\nThe team of technology experts have been terrifying government employees by entering department buildings and combing through public data looking for potential cuts. \n\nCurrently DOGE has saved the federal government $45.44 billion dollars, according to a tally conducted by doge-tracker.com. \n\nTrump signed an executive order on Tuesday ordering federal agencies to coordinate with DOGE to make 'large-scale reductions in force.' \n\nThe mass layoffs are taking place amid multiple lawsuits to stop DOGE's efforts at reshaping federal agencies.\n\nOn Wednesday, a federal judge lifted the temporary freeze on President Trump's 'buyout' offer to federal workers as the administration looks to shrink the workforce.\n\nA union which represents hundreds of thousands of federal workers and others had sued last week to stop the deferred buyout offer's February 6 deadline.\n\nDOGE estimated between five and 10 percent of government workers would take the offer and that it would save an estimated $100 billion a year.\n\nPresident Trump has repeatedly expressed satisfaction with the work that Musk and his team are undertaking.\n\n'I want to commend Elon because he's done a fantastic job - he doesn't need this,' Trump said earlier this week. \n\n'He's abused by you people every day. He's found more things than anybody could find. He's got the credibility to do it.\n\n'His group of people, they started off with 12, I call them 12 geniuses. They started off with 12, they went to 20, and 25 and now they're up to almost 100. People are joining to help them. This is a massive fraud that's taken place.","summary":"A federal judge appointed by Barack Obama denied liberals' final attempt to stop 'First Buddy' Elon Musk from accessing government data in a huge victory for the Department of Government Efficiency.","url":"https://www.dailymail.co.uk/news/article-14411247/doge-access-government-data-fire-workers-trump.html","image":"https://i.dailymail.co.uk/1s/2025/02/18/23/95350373-0-image-a-9_1739922435800.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/14/6098213651575716664/1024x576_MP4_6098213651575716664.mp4","publish_date":"2025-02-19 00:02:30","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.179},{"id":291934444,"title":"Defence Secretary to meet Norwegian counterpart amid security turmoil in Europe","text":"Defence Secretary John Healey will travel to meet his Norwegian counterpart as Europe is thrown into turmoil over the future of Ukraine and the continent’s wider security.\n\nMr Healey and Tore Sandvik will meet as European leaders plot their next steps to ramp up defence spending in the face of pressure from the US.\n\nAmerica and Russia have kicked off talks to broker a peace in Ukraine, led by US secretary of state Marco Rubio and Russia’s foreign minister Sergei Lavrov.\n\nUkraine was not invited to the negotiations which took place in Riyadh, Saudi Arabia, and concluded with ground rules set for further diplomacy.\n\nEuropean countries were also locked out of the gathering, and are facing calls from US President Donald Trump and his defence secretary Pete Hegseth to increase their defence spending and shoulder more of the financial burden of supporting Kyiv.\n\nFollowing an emergency meeting of European leaders, Sir Keir Starmer urged Mr Trump to provide a security guarantee to any Ukraine peace settlement, insisting it is the only way to deter Russia from attacking the country again.\n\nThe Prime Minister said he is prepared to deploy British troops as part of a peacekeeping force.\n\nBut other countries at Monday’s gathering, including Germany, resisted calls for European forces to be deployed to monitor a ceasefire.\n\nOn Tuesday, Defence Secretary Mr Healey said details of a US security guarantee for Ukraine are “being developed” and decisions made in the next few weeks will define “the security of our world for a generation”.\n\nHe added: “We’re in a new era of threat, and that demands a new era for defence, and in the middle of everything else, last week, the new defence secretary, Pete Hegseth from the US and I, made time to discuss the aims we share on defence reform.”\n\nThe Defence Secretary further stated that European nations know they “need to step up” on spending and have been “doing just that”.\n\nEconomists at the Institute for Fiscal Studies have warned that increasing the UK’s defence spending while maintaining other public services is likely to require additional tax rises by the Government.\n\nMinisters have repeatedly said they will wait until the conclusion of the strategic defence review before they outline how they will meet their commitment to raise defence spending to 2.5% of gross domestic product, a measure of national economic output.","summary":"John Healey’s trip comes amid American calls for Nato allies to ramp up defence spending.","url":"https://www.standard.co.uk/news/politics/john-healey-ukraine-donald-trump-norwegian-europe-b1211971.html","image":"https://static.standard.co.uk/2025/02/19/00/ed91a78233ef88c0963dd58c0991aa4eY29udGVudHNlYXJjaGFwaSwxNzM5OTgwNzEz-2.78780755.jpg?width=1200","video":null,"publish_date":"2025-02-19 00:01:18","author":"David Lynch","authors":["David Lynch"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.039},{"id":291931528,"title":"David Dickinson: ‘I said I need to go on Loose Women – this is b******t’","text":"David Dickinson likes to personally set the records straight (Picture: Ken McKay/ITV/Shutterstock)\n\nIt’s hard to imagine Dickinson’s Real Deal without David Dickinson.\n\nThe separation of the two isn’t just difficult because it would mean dropping one-third of the words from the title, but because his spirit makes the ITV series what it is.\n\nHowever, in recent years there have been some reports that they are considering a replacement. \n\nTo stop the rumour mill from continuing, David, 83, came up with a grand plan to stop the mutterings after being certain someone had planted the story.\n\n‘It would have been fed by somebody for some particular reason. Why? I don’t know.\n\n‘Perhaps the agent of a replacement person would have an interest to do that,’ David theorised, while speaking to Metro through an iD Mobile campaign.\n\n Dickinson’s Real Deal began in 2006 and he has no plans to leave it yet (Picture: ITV)\n\nNot being one to stand back and let things happen he told his agent: ‘Well, this is b******t, I need to go on Loose Women or on This morning, and I need to say I am not retiring.’\n\nThat’s exactly what happened, in 2023 he sat down on the ITV lunchtime show and told viewers: ‘Fake news as Donald Trump would say!’\n\nDavid informs us that 20-30 new episodes of the show will likely be made this year. The episodes see the public bringing their antiques to dealers, who make cash offers for the items. David gently guides proceedings to ensure everyone gets a price they can be happy with.\n\nOn top of Dickinson’d Real Deal he is also dreaming of taking on something completely new – a travel show.\n\n‘Perhaps I could get a hint to someone that I’d like to do a travel show with somebody interesting,’ he marveled. Hoping to help him on his mission, we ask who his vacay buddy could be.\n\nDavid leans back in his chair, sitting comfortably in silence as he ponders the question. After a moment of reflection he leans forward once more with his prepared answer. ‘Shirley Ballas!’ he proclaimed, as if finally cracking a difficult equation. He explains that the Strictly Come Dancing judge is an ideal option as she’s a glamorous Northern girl with a sense of fun.\n\n David would like to make a travel show with Shirley Ballas (Picture: Ian West/PA)\n\nIn recent times, we’ve seen a myriad of random celebrity combinations from Katherine Ryan and Joe Wilkinson testing bargain holidays to Mel Giedroyc and Martin Clunes exploring Britain, so commissioners could be open to David’s pitch.\n\nThose who love The Traitors (so everyone?) could also be happy to hear David has already told his agent that he ‘fancies that show’. Despite our best prying, he doesn’t want to divulge yet whether his preference is faithful or traitor just in case a potential co-star reads. ‘I actually want to win it,’ he explained as justification for his withholding.\n\nWhatever the future holds, David does not wish for retirement, instead hoping to continue on TV for as long as he’s healthy. However, he also acknowledged the fickle nature of his job could prevent that. ‘TV has changed dramatically over the last 18 months due to streaming.’ \n\nDavid is in agreement with Beyoncé, pointing out that nobody is irreplaceable. ‘Never get the idea you can’t be replaced because you can,’ he warned. That may be true, but he’s pretty close. Who else could proclaim ‘cheap as chips’ and ‘real Bobby Dazzler’ with such honest enthusiasm. His trademark look of a deep tan and luscious locks also ensure he stands out from the crowd.\n\n‘I’ve got all my own hair. A lot of men of my age lose their hair early. I seem to have been very fortunate,’ he proudly shared. ‘My grandfather was Armenian, and I’ve just been lucky that I’ve got the right genes. I just keep plodding along. I look okay for my age.’\n\n A valuable piece of advice has guided David (Picture: David Fisher/Shutterstock)\n\nSince bursting onto our screens on Antiques Roadshow in 1998, David has been plodding well and has consistently been in work (Bargain Hunt, The David Dickinson Show and Name Your Price have all had him at the helm) and he puts this largely down to one piece of valuable advice.\n\n‘When I started 28 years ago I was very lucky to work with a young producer, who said: “Listen, David, when that camera turns on and looks at you it can spot a fake every day of the week, be yourself, don’t try and be something you’re not.” \n\n‘And believe you me, that camera will catch you out. The camera isn’t a living thing, but it sees all.’\n\nThere’s also the matter of being someone that others want around, and he partly credits this to his happy upbringing. David was adopted by a ‘wonderful, normal, working into middle class family’.\n\n‘A lot of adopted children have difficult times but I had a wonderful childhood. I was loved by many and so I grew up very positive and happy,’ he shared with a smile.\n\n‘I learned early on that it doesn’t cost anything to be nice. I was taught if a lady got on a bus you stood up to give up your seat, to open the door for people and help the elderly with their bags. They were kind of normal everyday things.’\n\n David and Lorne married in 1968 (Picture: Cliff Kent/Shutterstock)\n\nWith wife Lorne Lesley, David has raised children of his own, Robert and Katrina, whom he adopted from Lesley’s previous marriage. He is also a grandfather to four, including to Myles, 21, who briefly joining David in the TV world.\n\nThe entrepreneur appeared on Dragons’ Den and successfully gained investment in his stylish personalised credit cards business. Steven Bartlett gave £35,000 in return for a 35% share in his company.\n\nDavid by his own admission has made ‘a good living’ so we ask whether Myles came directly to him for cash injection.\n\n Myles secured investment on Dragons’ Den (Picture: BBC)\n\n‘You’ve got to find your own way. I’ve always gone by the rule there are no free lunches in life.\n\n‘Also, to be honest with you, when he told me about his business I was a little bit skeptical. I didn’t think he’d be allowed to change the look of a credit card, but apparently you can do that,’ he admitted with a laugh. \n\n‘I really wasn’t that informed, shall we say. But now he’s doing well, and hopefully, fingers crossed, he’ll do well in the future, but not as well as me,’ David joked. ‘I am trying to give him advice now and he keeps saying, “Gramps, leave it to me. I know what I’m doing”.’ But there are definitely worse people to take advice from than David Dickinson.\n\n David Dickinson's partnership with iD Mobile \n\n David Dickinson has partnered with iD Mobile (Picture: WILL_IRELAND)\n\nDavid Dickinson has partnered with iD Mobile to highlight the incredible quality and value of refurbished mobile phones, helping savvy shoppers save hundreds of pounds on popular devices. \nFully tested and warranty-assured for performance and reliability, these pre-loved phones are a smart choice for bargain hunters. With iD Mobile, you can save an average of £250 a year (compared to major networks), making it easier than ever to stay connected without breaking the bank. \nA national poll revealed that many Britons are reluctant to consider preloved phones and remain unaware of the quality and savings that they offer.\n‘It’s a super idea,’ David told Metro. ‘The refurbished mobile phones have gone through the factory, and have been completely overhauled, looked at, cleaned and put out as a second hand mobile. They are virtually new.’ \n\nSorry, this video isn't available yet.\n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"He won't let rumours gather pace.","url":"https://metro.co.uk/2025/02/19/david-dickinson-i-said-need-go-loose-women-this-b-t-22458743/","image":"https://metro.co.uk/wp-content/uploads/2025/02/SEI_151797570-710d.jpg?quality=90&strip=all","video":null,"publish_date":"2025-02-19 00:01:00","author":"Josie Copson","authors":["Josie Copson"],"language":"en","source_country":"gb","sentiment":0.032},{"id":291939244,"title":"US F-35 or Russian Su-57? India weighs its fighter jet options","text":"India faces a decision that could reshape its defence future. Will it embrace the United States’ offer of the most advanced F-35 stealth fighters, or will it lean on its historic ties with Moscow and opt for Russia’s rival fifth-generation Su-57 instead?\nThe proposed American sale would represent a huge leap in the capabilities of the Indian Air Force, but analysts said concerns in both Washington and Moscow about military technology leaks could compel New Delhi to pick one over the other.\nDuring a meeting between Donald Trump and Indian Prime Minister Narendra Modi in Washington on Thursday, the US president announced that America would sell F-35 planes to India. If the deal were to go through, India would join an exclusive group of nations with access to the cutting-edge aircraft.\n“Starting this year, we’ll be increasing military sales to India by many billions of dollars. We’re also paving the way to ultimately provide India with the F-35 stealth fighters,” Trump said at a joint news conference.\nHe did not provide a timeline, but Indian Foreign Secretary Vikram Misri later told reporters that it was just a “proposal” for now.\nThe announcement follows Moscow’s offer last week to sell its fifth-generation Sukhoi Su-57 stealth fighters to the Indian Air Force, according to Russian and Indian officials. The aircraft could go into production this year if India accepted the offer, Russian state arms exporter Rosoboronexport said.\nRussia has been the main weapons supplier to India, the world’s largest arms importer, for years. Among the Russian weapons Delhi has acquired are the Su-30MKI, India’s primary combat aircraft, and the S-400 surface-to-air missile system.\nNeither Washington nor Moscow will feel comfortable with the Indian Air Force operating both aircraft. India will have to choose\nOlli Pekka Suorsa, defence analyst\nBut Russia’s ability to export military hardware in recent years has been hobbled by the war in Ukraine, making Delhi look westward. According to a report by the Stockholm International Peace Research Institute released last year, Russia’s share of India’s arms imports fell to 36 per cent in 2023 from 76 per cent in 2009.\nOlli Pekka Suorsa, an assistant professor at the UAE-based Rabdan Academy whose research focuses on Asian security and defence, said India would not be allowed to acquire both the F-35 and Su-57.\n“Neither Washington nor Moscow will feel comfortable with the Indian Air Force operating both aircraft. India will have to choose,” Suorsa said.\nIf Delhi were to pick the Russian Su-57, it might lead to the US invoking its Counter American Adversaries Through Sanctions Act (CAATSA) against India, he added.\nThe act was previously used to sanction Turkey, which was removed from the F-35 programme after Ankara tried to acquire the Russian S-400 air defence system, raising US concerns over potential espionage targeting the American aircraft.\n“Much like in the case of Turkey, the US would be very hesitant to share sensitive information on the aircraft and its secretive systems with New Delhi,” Suorsa said.\nWashington’s concerns that the Turkish S-400 systems would be partly run by Russian contractors, who could gather information about the F-35, applied to India as well, Suorsa added.\n\n“Trump’s hint on the chance of New Delhi getting access to the state-of-the-art F-35 is likely a bargaining chip in his efforts to veer India further away from Moscow’s influence and ask for major economic concessions in return,” Suorsa said.\nAcquiring the F-35 would provide “a substantial step in capability for the Indian Air Force” as India continued to diversify its arms acquisitions to include suppliers such as the US and France, Suorsa said. Among its acquisitions from the West in recent years, India bought the Dassault Rafale, a French multirole fighter aircraft.\nRupakjyoti Borah, a senior research fellow at the Japan Forum for Strategic Studies in Tokyo, said the US wanted India to reduce its military dependence on Russia.\n“The US sees India as a major defence export market with defence sales from the US having boomed” in recent years, Borah said.\nKriti Upadhyaya, vice-president of strategic advisory at C2Ci Inc, a company providing global defence solutions, said it would not make sense for India to buy both aircraft.\nAt some point, the Indian Air Force would have to pick one model to ensure operational efficiency and cost-effectiveness, she said.\n“India has pursued a policy of diversification in its military procurements, steadily reducing its reliance on Russia while increasing acquisitions from the US and its allies like Israel and France. This trajectory is likely to continue,” Upadhyaya said.\n“The Su-57 is comparatively newer, Russia’s first experiment with stealth technology, and remains largely untested in operational deployments outside Russia,” she added – noting that India had traditionally been cautious about adopting “unproven platforms”.\n\nIn contrast, the F-35 has a more established track record as it has been used by countries including Israel, Italy, Japan, the UK, Australia, Denmark and South Korea.\nIf India were to pick the F-35, it would have to address Washington’s “very real and understandable concerns” over possible military data leaks, Upadhyaya said.\n“India understands these sensitivities and is likely to create separate operational environments, a model it has already used to balance diverse defence suppliers,” she added.\nTrump’s proposal to supply India with the F-35 goes beyond a desire to upgrade the capabilities of its military, according to Upadhyaya.\n“It is in the US national interest to have a strong India,” she said. “The move to review US policy to offer the F-35 to India is a significant policy change and shows how far the US-India relationship has come.\nAdditional reporting by Reuters and Bloomberg","summary":"New Delhi’s decision on next-generation advanced stealth fighters will have to factor in military data leak concerns, analysts say.","url":"https://www.scmp.com/week-asia/politics/article/3299212/us-f-35-or-russian-su-57-india-weighs-its-fighter-jet-options","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/18/ad29d9f7-52a0-4d97-8b91-88de21b7f94a_16488edc.jpg","video":null,"publish_date":"2025-02-19 00:00:17","author":"Maria Siow","authors":["Maria Siow"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.248},{"id":291934280,"title":"Mexico Invites US Green Berets to Train Its Marines Amid Tariff Threats","text":"Mexico is welcoming a small delegation of U.S. Green Berets to train the country’s marine corps for over a month.\n\nThe U.S. Special Operations Command (SOCOM), in response to a request for comments, described the mission as part of the “normal routine, pre-planned military training with the Mexican Marine Infantry as part of long-standing U.S.-Mexico defense cooperation.”\n\nWhile the initiative received broad support in Mexico’s Senate, some lawmakers argued that Mexico should go beyond merely welcoming U.S. military advisers for training missions.\n\nSen. Lilly Téllez, a member of the opposition National Action Party, argued that the government should formally invite U.S. military forces to fight alongside Mexican troops on Mexican soil in the battle against organized crime.\n\nShe said Mexico, on its own, has been unable to defeat the cartels. “If it could, it would have already done so, wouldn’t it?” she said.\n\nThe training program will occur as Mexico faces pressure from the United States to step up efforts against cross-border crime. Earlier this month, Mexico convinced President Donald Trump to implement a 30-day delay on a 25 percent tariff on all exports by pledging to deploy 10,000 additional National Guard troops to its northern border to curb the flow of illegal immigrants and illicit drugs, particularly the deadly fentanyl.\n\nMeanwhile, the U.S. military has confirmed an increase in aerial intelligence, surveillance, and reconnaissance (ISR) operations that use crewed aircraft to support anti-cartel and border security efforts.\n\n“We do have intelligence sharing with Mexico to show them what we have,” he said.","summary":"Some Mexican lawmakers have argued for inviting U.S. military forces to Mexico not just to train but to fight against cartels.","url":"https://www.theepochtimes.com/world/mexico-invites-us-green-berets-to-train-its-marines-amid-tariff-threats-5812154","image":"https://img.theepochtimes.com/assets/uploads/2021/04/17/mexico-guatemala-border-300x180.jpg","video":null,"publish_date":"2025-02-18 23:59:48","author":"Bill Pan","authors":["Bill Pan"],"language":"en","source_country":"us","sentiment":0.251},{"id":291931590,"title":"Arrestos en la frontera caen un 39% en enero; primer indicio de las políticas migratorias de Trump","text":"Los arrestos por cruces ilegales en la frontera de Estados Unidos con México cayeron un 39% en enero en comparación con el mes anterior, informaron el martes las autoridades estadounidenses, en lo que representa un primer indicador del endurecimiento de las políticas migratorias por parte del gobierno del presidente Donald Trump.\n\nLa Patrulla Fronteriza realizó 21.593 arrestos durante el mes, una disminución respecto a los 47.316 realizados en diciembre y la cifra más baja desde mayo de 2020, cerca del punto más álgido de la pandemia de COVID-19, según la Oficina de Aduanas y Protección Fronteriza (CBP, por sus siglas en inglés).\n\n“Llamémoslo el ‘Efecto Trump’”, dijo la Casa Blanca en un comunicado.\n\nLos arrestos en la frontera cayeron drásticamente mucho antes de que Trump asumiera el cargo, desde un máximo histórico de 250.000 registrado en diciembre de 2023. Las autoridades mexicanas aumentaron la aplicación de la ley dentro de sus propias fronteras y el entonces presidente Joe Biden implementó duras restricciones al asilo en junio.\n\nLas detenciones disminuyeron aún más después de que Trump asumió el cargo el 20 de enero y emitió una serie de órdenes sobre inmigración, incluida una para suspender el asilo bajo el argumento de que Estados Unidos está bajo “invasión” en la frontera sur.\n\nEl zar fronterizo de Trump, Tom Homan, dijo el lunes que se registraron 229 arrestos en la frontera en un periodo de 24 horas, la cifra más baja que recordaba desde que se convirtió en agente de la Patrulla Fronteriza en 1984. Funcionarios del Departamento de Seguridad Nacional señalaron que quieren reducir esa cifra a cero.\n\nEl jefe de la Patrulla Fronteriza, Michael Banks, dijo el viernes en Edinburg, Texas, que “no estará satisfecho hasta que tengamos control operativo de nuestra frontera, lo que significa que cualquiera que cruce ilegalmente sea detenido o que nadie cruce”.\n\nEl Departamento de Seguridad Nacional anunció el martes que lanzó una campaña publicitaria en video de varios millones de dólares en Estados Unidos y a nivel internacional, en la que la secretaria Kristi Noem advierte a las personas que se vayan o que no vengan al país. “Si estás aquí ilegalmente, te encontraremos y te deportaremos. Nunca regresarás”, dice en el video.","summary":"La Patrulla Fronteriza realizó 21.593 arrestos durante el mes, una disminución respecto a los 47.316 realizados en diciembre","url":"https://www.sandiegouniontribune.com/2025/02/18/arrestos-en-la-frontera-caen-un-39-en-enero-1er-indicio-de-las-polticas-migratorias-de-trump/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/02/EEUU-FRONTERA-ARRESTOS_86987.jpg?w=1024&h=682","video":null,"publish_date":"2025-02-18 23:59:17","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.467},{"id":291933116,"title":"Zelensky critical of U.S.-Russia peace talks, meets with Turkey's Erdogan","text":"Feb. 18 (UPI) -- As officials in Washington, D.C., and Moscow prepare to negotiate an end to the war in Ukraine, Ukrainian President Volodymyr Zelensky is critical of negotiations that exclude his nation.\n\nZelensky on Tuesday said efforts to end the war must involve European nations, Turkey and the United Kingdom, and must include Ukrainian negotiators to ensure a \"fair\" negotiations process, France 24 reported.\n\n\"Ukraine, Europe in a broad sense, and this includes the European Union, Turkey and the U.K., should be involved in conversations and the development of the necessary security guarantees with America regarding the fate of our part of the world,\" Zelensky said.\n\nHe criticized preliminary peace talks between the United States and Russia in Riyadh, Saudi Arabia, to end the war that began when Russia invaded Ukraine in February 2022.\n\nZelensky met with Turkish President Recep Tayyip Erdogan in Ankara, Turkey, on Tuesday to open a new Ukrainian Embassy and discuss possible prisoner exchanges between Ukraine and Russia and other matters, the Kyiv Post reported.\n\nTurkey is a member of NATO and has continued its diplomatic ties with Ukraine and Russia during the Ukraine war.\n\nTurkey also has supplied Ukraine with drones while Erdogan has acted as a mediator between Ukraine and Russia, including negotiating prior prisoner exchanges between the two combatants.\n\nFollowing Tuesday's talks with Erdogan, Zelensky was scheduled to travel to Riyadh on Wednesday for matters unrelated to the talks between the United States and Russia.\n\nHe postponed the trip to Riyadh to March 10 and said he was not invited to participate in the Riyadh peace talks.\n\nU.S. Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov met in Riyadh on Tuesday as officials in the Kremlin attempt to re-establish diplomatic ties with the United States.\n\nThe meeting between Rubio and Lavrov has raised concerns with Zelensky and leaders in Europe regarding the potential for the United States and Russia concluding a deal to end the war in Ukraine without input from Ukrainian officials or the European Union.\n\nThe concerns largely are focused on the possibility of President Donald Trump forcing Ukraine to end the war on terms established by Russian President Vladimir Putin and others in the Kremlin.\n\nErdogan said Turkey is the ideal location for peace talks and previously hosted talks between Ukrainian and Russian officials in Istanbul weeks after Russia invaded Ukraine.\n\n\"Turkey will be an ideal host for the possible talks between Russia, Ukraine and America in the near future,\" Erdogan said, adding that the prior talks in Istanbul so far have come the closest to ending the war.","summary":"As officials in Washington, D.C., and Moscow prepare to negotiate an end to the war in Ukraine, Ukrainian President Volodymyr Zelensky is critical of negotiations that exclude his nation.","url":"https://www.upi.com/Top_News/World-News/2025/02/18/turkey-zelensky-erdogan-peace-talks/6571739920759/","image":"https://cdnph.upi.com/ph/st/th/6571739920759/2025/upi/fdf693a30fc6daff67980a29c453840b/v1.2/Zelensky-critical-of-US-Russia-peace-talks-meets-with-Turkeys-Erdogan.jpg","video":null,"publish_date":"2025-02-18 23:58:31","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":0.296},{"id":291931198,"title":"Trump digs his heels in on Associated Press ban over Gulf of America drama: 'That's the way life works'","text":"BREAKING NEWSTrump digs his heels in on Associated Press ban over Gulf of America drama: 'That's the way life works'\n\nLISTEN: Elon’s baby mama drama, Tom Hank’s SNL backlash, plus more DOGE cuts – on Daily Mail podcast Welcome to MAGALand\n\nBy NIKKI SCHWAB, CHIEF CAMPAIGN CORRESPONDENT FOR DAILYMAIL.COM IN WEST PALM BEACH, FLORIDA\n\nPublished: 23:49 GMT, 18 February 2025 | Updated: 00:03 GMT, 19 February 2025\n\nPresident Donald Trump dug his heels in as his White House has banned the Associated Press over the wire service's refusal to use the term 'Gulf of America.'\n\n'They're doing us no favors and I guess I'm not doing them any favors - that's the way life works,' he quipped on Tuesday. \n\nOn Friday deputy chief of staff Taylor Budowich announced on X that the AP would not be welcome in the Oval Office or Air Force One as long as the outlet's influential style guide continued to use Gulf of Mexico. \n\nAP reporters and photographers were barred from entering White House events all week over the style guide drama. \n\nBut White House staff upped the ante by blocking longtime AP White House reporter Darlene Superville and photographer Ben Curtis from boarding Air Force One ahead of Trump's Florida departure.\n\nDuring an executive order signing event at Mar-a-Lago on Tuesday, Trump was asked what it would take for him to reconsider the controversial ban. \n\nTrump complained to reporters that the AP 'refuses to go with what the law is and what is taking place.' \n\n'It's called the Gulf of America now. It's not called the Gulf of Mexico any longer,' Trump said. 'I have the right to do it.' \n\nPresident Donald Trump dug his heels in Tuesday as his White House has banned the Associated Press over the wire service's refusal to use the term 'Gulf of America.' He suggested the ban would continue as long as AP used Gulf of Mexico \n\nAssociated Press White House reporter Darlene Superville and AP photographer Ben Curtis continued to be barred from the White House pool over the weekend after Trump aides prevented them from boarding Air Force One on Friday\n\nThe president mentioned his effort to again name the Alaska peak Mount McKinley after it was changed to Denali - the name used by native Alaskans - during the Obama years. \n\nTrump pointed out that nobody was 'challenging' that name change. \n\n'I just say that we're going to keep them out until such time that they agree that it's the Gulf of America,' he said of the AP ban. \n\n'We're very proud of this country, we want it to be the Gulf of America,' the president added. \n\nSince Trump arrived in Florida, the AP's Superville and Curtis have made an effort to join the White House pool, the rotating group of reporters who follow the president, and were denied. \n\nAs a wire service, the AP has a spot for a reporter and photographer every day in the presidential pool. \n\nTrump was also asked if he objected to some of the AP's terminology that conservatives object to and claim skews liberal. \n\nTerms like 'gender-affirming care' - how the AP says reporters should refer to sex changes for transgender people - have received complaints from conservatives. \n\nAssociated Press White House reporter Darlene Superville and AP photographer Ben Curtis were supposed to fly from Joint Base Andrews to West Palm Beach with President Donald Trump on Friday but were barred due to the AP's refusal to use 'Gulf of America' \n\nThe two empty seats are showin the press cabin of Air Force One for the Friday flight between Joint Base Andrews and West Palm Beach. Trump has remained in Florida since Friday to mark a long Presidents' Day weekend\n\nAdditionally the style choice of capitalizing the word 'Black' for African-Americans, but leaving 'white' down-style, has irritated Trump allies, as has the AP frowning on journalists using the term 'illegal immigrant' in their stories.\n\n'Well I do think some of the phrases that they want to use are ridiculous,' Trump chimed in on Tuesday. \n\n'And I think, frankly, they've become obsolete,' he continued. 'Especially in the last three weeks. Because many things have happened in the last three weeks.'\n\nTrump also hinted that he still has a bone to pick with the AP over the 2020 election, which he still contends he won but was robbed a second term due to widespread Democratic fraud.\n\n'Now the Associated Press, as you know, has been very, very wrong on the election, on Trump, on the treatment of Trump and other things having to do with Trump and Republicans and conservatives,' the president compained. \n\nFloridaPoliticsDonald TrumpWhite House\n\nShare or comment on this article:\nTrump digs his heels in on Associated Press ban over Gulf of America drama: 'That's the way life works'\n\nAdd comment","summary":"President Donald Trump dug his heels in as his White House has banned the Associated Press over the wire service's refusal to use the term 'Gulf of America.'","url":"https://www.dailymail.co.uk/news/article-14410743/trump-backs-ban-associated-press-gulf-america.html","image":"https://i.dailymail.co.uk/1s/2025/02/18/23/95350465-0-image-m-21_1739922291839.jpg","video":null,"publish_date":"2025-02-18 23:58:04","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.181},{"id":291931194,"title":"Trump orders the firing of ALL 'Biden Era' top prosecutors to 'restore confidence' in DOJ","text":"BREAKING NEWSTrump orders the firing of ALL 'Biden Era' top prosecutors to 'restore confidence' in DOJ\n\nLISTEN: Elon’s baby mama drama, Tom Hank’s SNL backlash, plus more DOGE cuts – on Daily Mail podcast Welcome to MAGALand\n\nBy KATELYN CARALLE, SENIOR U.S. POLITICAL REPORTER IN WASHINGTON, D.C.\n\nPublished: 23:25 GMT, 18 February 2025 | Updated: 23:56 GMT, 18 February 2025\n\nDonald Trump ordered all 'Biden Era' U.S. Attorneys be fired in an attempt to 'restore confidence' at the Department of Justice.\n\nThe surprise announcement came Tuesday night after thousands of federal workers have already faced layoffs under the president's efforts to cut-back taxpayer spending. \n\n'Over the past four years, the Department of Justice has been politicized like never before. Therefore, I have instructed the termination of ALL remaining ''Biden Era'' U.S. Attorneys,' Trump wrote on his Truth Social account.\n\nHe demanded: 'We must ''clean house'' IMMEDIATELY, and restore confidence. America's Golden Age must have a fair Justice System - THAT BEGINS TODAY!'\n\nTrump's declaration comes as Attorney General Pam Bondi continues her shake-up of the DOJ. \n\nBondi has been tasked with making more Americans trust the U.S. Justice system. \n\nThis includes an ongoing overhaul of the DOJ that Trump claims will end 'weaponization' against Americans and persecutions against political rivals. \n\nDonald Trump has ordered the firing of all 'Biden Era' U.S. Attorneys as he attempts to 'restore confidence' at the Department of Justice\n\nTrump's declaration comes as Pam Bondi has completely shaken up the DOJ\n\nTrump believes the trust will begin returning to DOJ once any judges who were appointed by former President Joe Biden are fired from their posts. \n\nSome judges were already forced to vacate their positions after Trump got back into the Oval Office last month. \n\nFor example, Tara K. McGrath was appointed by Biden and served as the U.S. attorney for the Southern District of California since October 2023. \n\nLast week she was notified directly by the White House that she lost her job. The administration extended gratitude for her service. \n\nAnd some others fled from their jobs before Trump had the chance to fire them. \n\nFormer U.S. attorney for the District of Columbia, also a Biden appointee, resigned on January 16 – just days before Trump was sworn in for his second term. \n\nAnd Jill Steinberg, who was U.S. attorney for the Southern District of Georgia, left her post on January 17.\n\nTrump vowed to overhaul the Justice Department, and it started with getting Bondi confirmed as his AG. \n\nThis week, the Senate is voting on the confirmation of Trump's FBI Director pick Kash Patel, who has also vowed to bring big changes to the principal law enforcement arm of the federal government that falls within the DOJ. \n\nPoliticsDonald Trump\n\nShare or comment on this article:\nTrump orders the firing of ALL 'Biden Era' top prosecutors to 'restore confidence' in DOJ\n\nAdd comment","summary":"Donald Trump has ordered the firing of all 'Biden Era' U.S. Attorneys as he attempts to 'restore confidence' at the Department of Justice.","url":"https://www.dailymail.co.uk/news/article-14411237/donald-trump-orders-firing-biden-prosecutors-doj.html","image":"https://i.dailymail.co.uk/1s/2025/02/18/23/95349739-0-image-a-78_1739921098506.jpg","video":null,"publish_date":"2025-02-18 23:56:56","author":"Editor,Katelyn Caralle","authors":["Editor","Katelyn Caralle"],"language":"en","source_country":"gb","sentiment":-0.268},{"id":291931024,"title":"The resignation decision tree: From the Politics Desk","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail. We hope you enjoyed your federal holiday on Monday. Today, we’ve got the latest on how orders from President Donald Trump’s appointees are cleaving off career government officials who are uneasy about carrying them out. Plus, New York Gov. Kathy Hochul faces political peril and political opportunity over the question of what to do about New York City Mayor Eric Adams. — Scott Bland Veteran federal prosecutor resigns over bank freeze order from Trump appointee Another Justice Department resignation on Tuesday continued a theme in President Donald Trump’s second administration: concern over orders coming from the top. A veteran prosecutor in the D.C. U.S. Attorney’s Office wrote in her resignation letter that she’d been asked by superiors to take actions — specifically, telling a bank there was probable cause to seize assets under potential investigation — that she saw as unsupported by evidence, Ryan J. Reilly reported. “As I shared with you, at this juncture, based upon the evidence I have reviewed, I still do not believe that there is sufficient evidence to issue the letter you described, including sufficient evidence to tell the bank that there is probable cause to seize the particular accounts identified,” Denise Cheung, a 24-year Justice Department prosecutor who was the chief of the criminal division at the U.S. Attorney’s Office, wrote in the letter to Interim U.S. Attorney Ed Martin, a Trump appointee. “Because I believed that I lacked the legal authority to issue such a letter, I told you that I would not do so. You then asked for my resignation,” Cheung wrote. The Justice Department responded via a spokesperson that “refusing a basic request to pause an investigation so officials can examine the potential waste of government funds is not an act of heroism — just a failure to follow chain of command.” It’s the latest in a string of departures from the Justice Department stemming from concerns about orders. Last week, the U.S. Attorney’s Office handling the case against New York City Mayor Eric Adams and the Public Integrity section at the Justice Department in Washington saw a round of resignations, as attorneys refused to comply with acting Deputy Attorney General Emil Bove’s orders to dismiss the charges against Adams. What to know from the Trump presidency today Secretary of State Marco Rubio said that the U.S. and Russia had agreed to re-establish “the functionality of our respective missions in Washington and Moscow,” as top officials from the countries met in Saudi Arabia building toward talks over ending the war in Ukraine.Trump appeared to blame Ukrainian President Volodymyr Zelenskyy for the Russian invasion of his country in 2022. “Today I heard, ‘Oh, well, we weren’t invited,’” Trump said of Ukrainian concern about U.S.-Russia talks in Saudi Arabia. “Well, you’ve been there for three years. You should have ended it — three years. You should have never started it.”Trump signed two executive orders and a presidential memorandum. One order, on in-vitro fertilization, directs White House advisers to study how to make IVF and other fertility treatments more affordable, while the other directs the Office of Management and Budget to take on a stronger “oversight” role of independent agencies in the executive branch.The memorandum directs “the heads of executive departments and agencies to take all appropriate actions to make public” details of the “waste, fraud and abuse” that the Trump administration is uncovering. Follow live updates → Kathy Hochul's political dilemma over Eric Adams By Steve Kornacki New York Gov. Kathy Hochul is in a politically dangerous moment as she considers what to do about New York City Mayor Eric Adams. A decision to remove the mayor from office would mark the first time a New York governor has ever exercised this power. It would spark a furious outcry from Adams and his backers, who are now seeking to rally support from Black voters — a group that helped propel Adams to office in 2021. And it would risk a broader backlash from Black leaders who might object to the removal of a duly elected Black mayor by a unilateral action. Alienating Black voters would threaten Hochul’s standing in her own potential Democratic primary next year, in which 20% to 25% of the electorate will be Black. But there may also be a significant political opportunity for Hochul here. First, it’s actually uncertain whether a move against Adams would incur this kind of blowback, with recent polling showing Adams broadly unpopular among New York City voters — including Black voters. The numbers could shift if Hochul actually goes through with ousting Adams, but right now, there’s not much residual goodwill toward the mayor among what had been his political base. Moreover, Hochul’s 2026 challenges extend well beyond the Democratic Party, and taking decisive action against an unpopular figure like Adams could give her a badly needed boost among general election swing voters. In 2022, Hochul scored a decidedly underwhelming victory, beating her Republican foe, then-Rep. Lee Zeldin, by just 6 points — two years after Joe Biden carried New York by 23 points. Then-Gov. Andrew Cuomo also won the state by 23 points in 2018. Hochul’s position hasn’t improved since 2022. A Siena College poll two weeks ago showed her with a 44% job approval rating and upside-down personal popularity (39% favorable, 47% unfavorable). Already, a potentially formidable Republican candidate, Rep. Mike Lawler, is laying the groundwork for a campaign against her next year. One way of measuring Hochul’s weakness is to compare the results of three recent elections in New York: the Biden landslide in 2020; Hochul’s much narrower win in 2022; and Kamala Harris’ surprisingly modest (11 points) victory last November. Here are the results from New York’s seven largest counties. A major story in New York last November was the shift of Hispanic, Asian American and some Jewish voters toward Donald Trump. This can be seen in the numbers for the New York City boroughs of Brooklyn, Manhattan, Queens and the Bronx, where Harris badly underperformed compared to Biden’s 2020 showing. Notably, though, outside of the Bronx, Hochul also experienced the same decline in 2022. What stands out here are the three counties where Hochul’s drop-off from Biden was far worse than Harris’: Westchester, Nassau and Suffolk. All three of these counties are majority-white, with large suburban swaths. And in all three, the share of the white population with a college degree is at or above the statewide average. Both in New York and nationally, this demographic — white suburbanites with college degrees — has been the most dug in against Trump. But the results suggest that a chunk of them were willing to vote against Hochul and for the Republican in the 2022 gubernatorial race. A recent Siena poll showed that Hochul’s standing in the suburbs and among white voters hasn’t improved since that election. If she is the Democratic nominee next year, Hochul’s fate could be in the hands of voters who deeply dislike Trump but are also troubled by New York’s direction and Hochul’s leadership. We obviously don’t know how these voters would react to her removing Adams. Polling outside New York City is scant. Perhaps they’d see it as overreach. But if a decision to remove Adams is going to resonate anywhere, the Trump-phobic suburbs would be an obvious place to look. That’s all From the Politics Desk for now. Today’s newsletter was compiled by Scott Bland and Faith Wardwell. If you have feedback — likes or dislikes — email us at politicsnewsletter@nbcuni.com And if you’re a fan, please share with everyone and anyone. They can sign up here.","summary":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail.","url":"https://www.nbcnews.com/politics/resignation-decision-tree-politics-desk-rcna192609","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-02/250218-donald-trump-ew-647p-89ea8d.jpg","video":null,"publish_date":"2025-02-18 23:55:23","author":"The Politics Desk","authors":["The Politics Desk"],"language":"en","category":"politics","source_country":"us","sentiment":-0.285},{"id":291934276,"title":"Capitol Report Full Broadcast (Feb. 18)","text":"Feb-18-2025\n\nThe United States and Russia agree to start improving diplomatic relations again, aimed at ending the war in Ukraine.\n\nPresident Donald Trump is requiring more transparency from government agencies. How will his latest executive order work? Plus, what’s in his new mandate on in vitro fertilization?\n\nThe White House clarifies tha...","summary":"The United States and Russia agree to start improving diplomatic relations again, aimed at ending the war in Ukraine. President Donald Trump is requiring more transparency from government agencies. How will his latest executive order work? Plus, what&#8217;s in his new mandate on in vitro fertilization? The White House clarifies that Elon Musk&#8217;s authority is [&#8230;]","url":"https://www.theepochtimes.com/epochtv/capitol-report-full-broadcast-feb-18-post-5812380","image":"https://img.theepochtimes.com/assets/uploads/2025/02/18/id5812395-Captiol_0218_v1.jpg","video":null,"publish_date":"2025-02-18 23:54:29","author":"Steve Lance","authors":["Steve Lance"],"language":"en","source_country":"us","sentiment":-0.643},{"id":291938338,"title":"Republican Lawmaker Wants Trump's Work to Be 'Forever Enshrined' By Making His Birthday a Federal Holiday","text":"New York Rep. Claudia Tenney has introduced a bill proposing that June 14—President Donald Trump's birthday—become a federal public holiday, alongside Flag Day.The Trump's Birthday and Flag Day Holiday Establishment Act seeks to recognize Trump's contributions to what Tenney calls \"America's Golden Age.\"\"Just as George Washington's birthday is codified as a federal holiday, President Trump's birthday should also be celebrated to recognize him as the founder of America's Golden Age,\" she posted to social media on President's Day, February 17.This proposal is one of several Republican-led efforts to honor Trump in a lasting, symbolic way. Ahead of Trump's inauguration, Rep. Marjorie Taylor Greene (R-GA) introduced the successful bill to rename the Gulf of Mexico as the Gulf of America based on Trump's suggestion.Last month, Rep. Addison McDowell (R-NC) introduced a bill to rename Washington Dulles International Airport after Trump, while Rep. Buddy Carter (R-GA) put forward a proposal to rename Greenland \"Red, White, and Blueland\" as Trump renews interest in acquiring the island.\"No modern president has been more pivotal for our country than Donald J. Trump,\" Tenney wrote in a post on Friday, echoing the enthusiasm of many of her colleagues just four weeks into Trump's second presidency. By making Trump's birthday a holiday, Tenney hopes that his \"contributions to American greatness\" will be \"forever enshrined into law.\"While it is unclear how much traction the bill will gain in Congress, its introduction demonstrates the continued influence of the president within the Republican Party.","summary":"Rep. Claudia Tenney (R-NY) has introduced a bill proposing that June 14—President Donald Trump's birthday—become a federal public holiday, alongside Flag Day.","url":"https://www.ibtimes.com/republican-lawmaker-wants-trumps-work-forever-enshrined-making-his-birthday-federal-holiday-3764169","image":"https://d.ibtimes.com/en/full/4583366/republican-lawmaker-wants-trumps-work-forever-enshrined.jpg","video":null,"publish_date":"2025-02-18 23:54:13","author":"Morgan Music","authors":["Morgan Music"],"language":"en","category":"politics","source_country":"US","sentiment":0.059},{"id":291931600,"title":"JFK’s Grandson Freaks Out After Trump Order Closes Kennedy Library","text":"Skip to Main Content\n\nNewsletters\n\nCSCHEAT SHEET\nNEWSLETTERS\n\nCheat Sheet\n\nManage Newsletters\nSubscription Offers\n\nJFK’s Grandson Freaks Out After Trump Order Closes Kennedy Library\n\n‘EAT S*** BUDDY’\n\n32-year-old Jack Schlossberg made his return to social media Tuesday to protest the latest casualty of Donald Trump’s federal downsizing.\n\nKenneal Patterson\nUpdated Feb. 18 2025 6:55PM EST / Published Feb. 18 2025 6:52PM EST \n\nMike Segar/Mike Segar/ REUTERS \n\nKenneal Patterson\n\nGot a tip? Send it to The Daily Beast here.\nTrending Now\n\nPoliticsWhite House Claims Elon Musk Isn’t Running DOGE After All\n\nPoliticsNYU College Republicans Ditch President in Bid for Barron\n\nWilliam Vaillancourt\n\nentertainmentA White Supremacist Holds an Entire American City Hostage\n\nU.S. NewsElon Musk Finds DOGE’s Next Target: Gold Reserves at Fort Knox\n\nJulia Ornedo\n\nPoliticsI Only Fired Hundreds at the FAA, Sean Duffy Boasts Amid Safety Crisis\n\nWilliam Vaillancourt\n\nTrending Now\n\nPoliticsWhite House Claims Elon Musk Isn’t Running DOGE After All\n\nPoliticsNYU College Republicans Ditch President in Bid for Barron\n\nWilliam Vaillancourt\n\nentertainmentA White Supremacist Holds an Entire American City Hostage\n\nU.S. NewsElon Musk Finds DOGE’s Next Target: Gold Reserves at Fort Knox\n\nJulia Ornedo\n\nPoliticsI Only Fired Hundreds at the FAA, Sean Duffy Boasts Amid Safety Crisis\n\nWilliam Vaillancourt\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nBACK TO TOP ↑\n\nCheat Sheet\n\nSUBSCRIPTIONCROSSWORDNEWSLETTERSPODCASTS\n\nGET THE APP\n\nCode of Ethics & Standards\n\nTerms & conditions\nCopyright & Trademark\n\nCookie Settings\n© 2024 The Daily Beast Company LLC","summary":"Mike Segar / Mike Segar/ REUTERSJohn F. Kennedy’s only grandson returned to social media on Tuesday to throw a fit over the closure of Boston’s JFK Presidential Library and Museum—a move the institution said was due to a recent executive order signed by President Donald Trump.\n\n“Due to an Executive Order concerning a ‘reduction in force (RIF),’ the JFK Library and Museum will be closed to the public until further notice,” a sign posted on the building’s door read, according to CBS. \n\nIn a video posted to X just two weeks after dramatically quitting social media, Jack Schlossberg issued a dire warning for the American public.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/jfks-grandson-freaks-out-after-trump-order-closes-kennedy-library/","image":"https://www.thedailybeast.com/resizer/v2/ABIZW4VFQJFG3DSSGW7TMWC7DA.JPG?smart=true&auth=c2bb837d1b13128d0e6f387f05dc9bf3e8902efd037b6206c8cc1c44d20f31bb&width=1440&height=1080","video":null,"publish_date":"2025-02-18 23:52:06","author":"Kenneal Patterson","authors":["Kenneal Patterson"],"language":"en","source_country":"us","sentiment":-0.103},{"id":291930968,"title":"RICHARD KAY: The latest Murdoch revelations shows the family is deep in an ideological knife fight","text":"It's awards season in the US and for the past seven years the glittering prizes have gone to the HBO series Succession, with its brutal storyline of a disintegrating, dysfunctional media company seeming to win virtually every accolade going until its final episode in 2023 was aired.\n\nHow its brilliant show-runners must today be yearning to turn back the clock as the bitter divides ripping apart the Rupert Murdoch dynasty, said to be the real-life inspiration for the fictional drama, run deeper and more preposterously than anything its creative sparks would dare to dream up for TV.\n\nSurely, not even in their version of rich people being dreadful could the scriptwriters have conjured up the extraordinary scene which unfolded in a New York conference room last March.\n\nAs revealed this week, James Murdoch – once his father’s heir apparent, now cast as the family black sheep – faced a barrage of ‘withering’ questions from a lawyer suggesting that he and his sisters were ‘white, privileged, multi-billionaire trust-fund babies’.\n\n‘Have you done anything successful on your own?’ was one.\n\n‘Why were you too busy to say Happy Birthday to your father when he turned 90?’ was another.\n\nAnd ‘Does it strike you, that in your account, everything that goes wrong is always somebody else’s fault?’\n\nThe questions, it soon dawned on him, were not really coming from the attorney at all but were being silently texted to counsel by his father from across the table.\n\n‘How f*****g twisted is that?’ the younger man observed after leaving the meeting in which he was also obliged to listen to a passage from a book about the clan which suggested that James was ‘a conniving saboteur’.\n\nAs with all great empires, the saga of the feuding Murdochs has been beset by hubris, accusations and blame and – just like the scheming Roys in Succession – its family members are turning bitterly on one another.\n\nEven so, revelations in the US-based Atlantic magazine have revealed an eyebrow-raising litany of betrayals, leaks, conspiracies, humiliations and tears, while plunging into the mind games that have brought the once close family into open feuding.\n\n‘He is a misogynist,’ it quotes James saying of his father.\n\nWhile Rupert’s beloved Fox News channel is labelled by his son as a blight on his family’s name, a ‘menace’ to American democracy.\n\nFor Murdoch senior, now 93, securing his legacy has become an all-consuming life-and-death struggle. He believed that James was plotting with his sisters, Prudence and Elisabeth, to seize control of the family’s News Corp companies as soon as he died, ousting his elder son Lachlan – whom he anointed his chosen successor – and in the process changing the editorial stance of outlets such as the Donald Trump-supporting Fox News .\n\nHe feared they would destroy his life’s work. This belief drove him to attempt to overturn the terms of a long-standing family trust that would bequeath his vast conglomerate to his four elder children equally, which had been devised, said James, because ‘it would incentivise us to co-operate’.\n\nBut Murdoch, fearing a diluting of his outlets’ robust views would be commercially disastrous, had decided that Lachlan, who was said to share his conservative viewpoint, should inherit.\n\nThe proposal had been put in a piquant but ultimately woefully misleadingly-named document called ‘Project Family Harmony’. It didn’t achieve that; it only offered discord. In December last year, matters turned again when Murdoch lost a subsequent court battle to force the proposals through and hand the reins to Lachlan.\n\nAs the case in Reno, Nevada, got more and more acrimonious, James and his sisters offered their father an olive branch, however.\n\nIn the spirit of Thanksgiving and Christmas they wrote to Murdoch: ‘We are asking you with love to find a way to put an end to this destructive judicial path so that we can have a chance to heal as a collaborative and loving family.’ According to The Atlantic, Murdoch replied that he had read his children’s testimony from the trial twice over, ‘only to conclude that I was right’.\n\nDevastatingly, he added that they should contact his lawyers if they wanted to talk to him. His reply ended, ‘Much love, Dad.’\n\nShortly afterwards, the judge issued his ruling: Rupert and Lachlan had lost.\n\nThe explosive revelations in The Atlantic reveal a rift so deep that many observers believe it can never be healed. Few in the dramatis personae escape unscathed from what a friend of James’s ex-model wife Kathryn describes as an ‘ideological knife fight’.\n\nThe magazine reports how both James and Lachlan had objected to their father’s marriage to his third wife, Wendi Deng – after divorcing their mother Anna in 1999. It reports that the brothers believed Ms Deng, an executive at a News Corp subsidiary in Hong Kong, ‘couldn’t be trusted, and suspected that she might even have ties to Chinese intelligence’.\n\nMs Deng, said The Atlantic had denied this but James’s suspicions persisted. ‘More than two decades later, Kathryn would joke that Deng used “CCP[Chinese Communist Party]-issued burner phones” to evade a subpoena in the trust litigation,’ the article said.\n\nThe family were also said to be wary of Elisabeth’s former husband and public relations company boss Matthew Freud, described in the article as ‘an intense, unnervingly slick PR executive from London’, because of his constant ‘flaunting of social connections and his gleeful loutishness’.\n\nKathryn is quoted as saying of Freud: ‘I cannot exaggerate what a terrible person he is.’\n\nShe told the magazine that when they first met Freud tried to convince her ‘that it was morally defensible for a man to cheat on his pregnant wife’.\n\nEven the dynastic drama portrayed in Succession was woven into this extraordinary family meltdown. The show’s popularity had led to speculation about the real-life scheming among the Murdochs, which in turn appeared to induce near paranoia among the family.\n\nThe Atlantic writer, McKay Coppins, discloses how he heard endless speculation about which family members might have leaked to the show’s writers: ‘James and Kathryn, I was told, thought his sister Liz was responsible. Liz swore she wasn’t, though for a while she was convinced her ex-husband was talking with the writers – and in fact she later learned that he’s repeatedly offered his services, but the show-runner Jesse Armstrong had declined.’\n\nAs for James, he was said to have found the drama ‘too painful’ and only watched one episode. ‘But other members of the Murdoch clan were obsessed with the show; certain storylines seemed uncannily true to life.’\n\nIn a near 14,000-word article, The Atlantic provides a tantalising glimpse of a family rarely seen beyond them stepping from private jets or emerging from limousines to board luxury yachts. James claimed that at one stage one of his father’s lawyers had included a quote from King Lear in a document – ‘How sharper than a serpent’s tooth it is to have a thankless child.’\n\nBut the truth is this epic drama has more in common with Greek tragedy than Shakespeare.\n\nOver the years, power and control over the various parts of the empire had shifted between Lachlan and James as both were seen as possible heirs.\n\nAt certain times James was the golden boy, not Lachlan. Their sisters were never considered serious contenders to run the business, according to James, because his father didn’t believe his adult daughters ‘are capable of making decisions’. It was this that triggered James’s ‘misogynist’ claim.\n\nCoppins’s interview details all the family struggles, including James’s discomfort with the company’s support for Brexit and Donald Trump. Naturally, it is sympathetic to the conflicts James confronted over the way his father’s outlets dealt with other issues such as the climate crisis and Fox News’s embrace of Right-wing conspiracy theories.\n\nAs James’s relationship with his father disintegrated, The Atlantic reports that father and son had barely spoken for years. But it then quotes a handwritten note from Rupert delivered along with the legal documents: ‘Dear James, is there still time to talk? Love, Dad. PS: I would love to see my grandchildren someday.’\n\nThe magazine notes: ‘James, who could not remember the last time Rupert had taken an interest in his grandchildren, did not bother to respond.’\n\nThere had been other attempts to solve family disagreements. In 2010, Murdoch invited his children to a counselling retreat at his ancestral ranch in Australia with a specially hired therapist. The purpose was not to discuss succession-planning but rather how they all behaved with one another.\n\nA leak to Vanity Fair magazine described it as a ‘loving, supportive’ experience. But Coppins reports that the session ‘devolved into posturing, gaslighting and recriminations’. James tells him: ‘It was a car crash. Everyone was more alienated from each other at the end.’\n\nHis father, he added, ‘was always trying to pull everyone into the company so that he could manipulate them against each other’.\n\nAll the same, at the end of the retreat the family agreed to sign a draft of a ‘family constitution’, an attempt to codify Murdoch family values. All four siblings signed it.\n\nThe document talked of them communicating with one another with ‘trust and humility’ and being ‘vigilant’ to ‘defend against divisiveness’. All very noble but, as The Atlantic reports, within months ‘the Murdochs would be at each other’s throats’.\n\nYet, according to the article, instead of James, Murdoch senior could have become estranged from Lachlan. Angered by his father’s 2019 plan to sell 21st Century Fox film and TV studios to Disney – a deal that earned Murdoch £54 billion – he told him that, if it went through: ‘You won’t have a son.’ And, turning to James, added: ‘And you won’t have a brother.’ In the end, a son and brother were lost – but not the one they thought.\n\nA spokesperson for Murdoch and Lachlan described James’s claims in the interview as a ‘litany of falsehoods . . . from a person who no longer works for the companies but still benefits financially’.\n\nAs for the controversial trust, a review of 3,000 pages of evidence from the Nevada trial, has, intriguingly, revealed that it will expire in 2030, when Murdoch is 99.\n\nAt that point – or at the tycoon’s death – the brothers (and sisters) will have to decide what to do.","summary":"As revealed this week, James Murdoch - once his father's heir apparent, now cast as the family black sheep - faced a barrage of 'withering' questions from a lawyer","url":"https://www.dailymail.co.uk/debate/article-14411265/RICHARD-KAY-Murdoch-knife-fight.html","image":"https://i.dailymail.co.uk/1s/2025/02/18/23/95350585-0-image-m-72_1739922222490.jpg","video":null,"publish_date":"2025-02-18 23:51:42","author":"Editor,Richard Kay","authors":["Editor","Richard Kay"],"language":"en","source_country":"gb","sentiment":0.001},{"id":291933224,"title":"Trump Orders DOJ to Fire All Remaining Biden-Appointed US Attorneys","text":"President Donald Trump announced Tuesday that he directed the Justice Department to dismiss all remaining U.S. attorneys from former President Joe Biden's era, claiming unprecedented politicization.The president posted on Truth Social, \"Over the past four years, the Department of Justice has been politicized like never before. Therefore, I have instructed the termination of ALL remaining \"Biden Era\" U.S. Attorneys. We must \"clean house\" IMMEDIATELY, and restore confidence. America's Golden Age must have a fair Justice System - THAT BEGINS TODAY!\"Last week, the White House issued termination notices to multiple U.S. attorneys appointed by former Democratic President Joe Biden.On Monday, several Biden-appointed U.S. attorneys announced their resignations, while others had already left the government the previous week.While it is standard for U.S. attorneys to resign following a change in administration, Justice Department lawyers—both current and former—note that incoming administrations typically request resignations rather than issuing abrupt termination letters, according to reporting by Reuters.The dismissal of U.S. attorneys, who serve as the top federal law enforcement officials in their districts, marks the latest upheaval at the Justice Department since Trump took office last month.While career Justice Department officials typically remain in their roles across administrations, dozens in cities like Washington and New York have either resigned or been fired since Trump's inauguration.Trump campaigned on a promise to end what he calls the Justice Department's \"weaponization,\" claiming it was used against him during his years out of power.Update: 2/18/25, 7:01 p.m. ET: This article has been updated with additional information.This is a developing news story and will be updated as more information is available.","summary":"President Trump announced Tuesday that he directed the Justice Department to dismiss all remaining U.S. attorneys from Biden era.","url":"https://www.newsweek.com/trump-orders-doj-fire-all-remaining-biden-appointed-us-attorneys-2032998","image":"https://d.newsweek.com/en/full/2591038/trump-mar-lago.jpg","video":null,"publish_date":"2025-02-18 23:51:32","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.354},{"id":291941182,"title":"Here's how a new executive order will expand IVF access","text":"President Donald Trump signed an executive order Tuesday to promote an expansion of in vitro fertilization.The order directs administration agencies to suggest policy that will \"protect IVF access and aggressively reduce out-of-pocket and health plan costs for such treatments.\" It is also meant to address existing legislation that may increase the cost of the procedure.The procedure can cost as much as $25,000 per attempt, according to the order, and only a quarter of health insurance providers offer coverage.The order is a continuation of policies from President Trump's first term that expanded resources for families having new babies.\"I think the women and families, husbands, are very appreciative of\" IVF, President Trump said when he signed the order.RELATED STORY | Trump administration deletes Biden's reproductive rights website hours after taking office President Trump has signaled support for IFV access since Alabama ruled in 2024 that frozen embryos should be considered children. Trump campaigned on expanding IVF access, saying it was a way to build families.\"We want to make it easier for mothers and fathers to have babies, not harder!\" He wrote at the time.","summary":"President Donald Trump signed an executive order Tuesday to promote an expansion of in vitro fertilization. Here's how it will work.","url":"https://www.scrippsnews.com/politics/president-trumps-first-100-days/heres-how-a-new-executive-order-will-expand-ivf-access","image":"https://ewscripps.brightspotcdn.com/dims4/default/5c10f08/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F46%2F62%2Fa4d4a72e41b7aa58637d548a8793%2F1711144940-jxp23q.jpg","video":null,"publish_date":"2025-02-18 23:50:59","author":"Scripps News Group","authors":["Scripps News Group"],"language":"en","source_country":"us","sentiment":-0.211},{"id":291935928,"title":"Senate confirms Howard Lutnick as commerce secretary, a key role for Trump’s trade agenda","text":"By PAUL WISEMAN\n\nWASHINGTON (AP) — The Senate confirmed wealthy financier Howard Lutnick as commerce secretary Tuesday, putting in place a staunch supporter of President Donald Trump’s hardline trade polices.\n\nAt the Commerce Department, Lutnick, who was CEO at the investment firm Cantor Fitzgerald, will oversee 50,000 employees who do everything from collecting economic statistics to running the census to issuing weather reports. But he’s likely to spend a lot of time — along with Jamieson Greer, Trump’s nominee to be the top U.S. trade negotiator — managing the president’s aggressive plans to impose import taxes on U.S. trading partners, including allies and adversaries alike.\n\nThe Senate vote to confirm Lutnick was 51-45.\n\nTrump views the tariffs as a versatile economic tool. They can raise money to finance his tax cuts elsewhere, protect U.S. industries and pressure other countries into making concessions on such issues as their own trade barriers, immigration and drug trafficking. Mainstream economists mostly view tariffs as counterproductive: They are paid by import companies in the United States, which try to pass along the higher costs to consumers and can thereby add to inflationary pressures throughout the economy.\n\nAt his confirmation hearing last month, Lutnick dismissed as “nonsense” the idea that tariffs contribute to inflation. He expressed support for deploying across-the-board tariffs ”country by country” to strong-arm other countries into lowering barriers to American exports.\n\nTrump last week announced plans for “reciprocal” tariffs — raising U.S. import tax rates to match the higher taxes that other countries impose on goods from the U.S. The move would shatter the rules that have governed world trade for decades. Since the 1960s, tariff rates have mostly emerged from negotiations between dozens of countries. Trump is commandeering the process.\n\nThe president has also imposed 10% tariffs on Chinese imports and effectively raised U.S. taxes on foreign steel and aluminum. He has threatened — and delayed until March 4 — 25% tariffs on goods from Canada and Mexico.\n\nLutnick was CEO at Cantor Fitzgerald when its offices were hit in the Sept. 11, 2001, attack on the World Trade Center. The firm lost two-thirds of its employees — 658 people — that day, including Lutnick’s brother. Howard Lutnick led the firm’s recovery and is a member of the Board of Directors of the National September 11 Memorial & Museum.\n\nLutnick has promised to sell off his business holdings. They’re complicated. His financial disclosure statement showed that he had positions in more than 800 businesses and other private organizations.","summary":"The Senate vote to confirm Lutnick was 51-45.","url":"https://www.bostonherald.com/2025/02/18/howard-lutnick-confirmed-commerce-secretary/","image":"https://www.bostonherald.com/wp-content/uploads/2025/02/Trump_23568.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-18 23:50:34","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.174},{"id":291935398,"title":"Senate confirms Howard Lutnick as commerce secretary, a key role for Trump’s trade agenda","text":"By PAUL WISEMAN\n\nWASHINGTON (AP) — The Senate confirmed wealthy financier Howard Lutnick as commerce secretary Tuesday, putting in place a staunch supporter of President Donald Trump’s hardline trade polices.\n\nAt the Commerce Department, Lutnick, who was CEO at the investment firm Cantor Fitzgerald, will oversee 50,000 employees who do everything from collecting economic statistics to running the census to issuing weather reports. But he’s likely to spend a lot of time — along with Jamieson Greer, Trump’s nominee to be the top U.S. trade negotiator — managing the president’s aggressive plans to impose import taxes on U.S. trading partners, including allies and adversaries alike.\n\nThe Senate vote to confirm Lutnick was 51-45.\n\nTrump views the tariffs as a versatile economic tool. They can raise money to finance his tax cuts elsewhere, protect U.S. industries and pressure other countries into making concessions on such issues as their own trade barriers, immigration and drug trafficking. Mainstream economists mostly view tariffs as counterproductive: They are paid by import companies in the United States, which try to pass along the higher costs to consumers and can thereby add to inflationary pressures throughout the economy.\n\nAt his confirmation hearing last month, Lutnick dismissed as “nonsense” the idea that tariffs contribute to inflation. He expressed support for deploying across-the-board tariffs ”country by country” to strong-arm other countries into lowering barriers to American exports.\n\nTrump last week announced plans for “reciprocal” tariffs — raising U.S. import tax rates to match the higher taxes that other countries impose on goods from the U.S. The move would shatter the rules that have governed world trade for decades. Since the 1960s, tariff rates have mostly emerged from negotiations between dozens of countries. Trump is commandeering the process.\n\nThe president has also imposed 10% tariffs on Chinese imports and effectively raised U.S. taxes on foreign steel and aluminum. He has threatened — and delayed until March 4 — 25% tariffs on goods from Canada and Mexico.\n\nLutnick was CEO at Cantor Fitzgerald when its offices were hit in the Sept. 11, 2001, attack on the World Trade Center. The firm lost two-thirds of its employees — 658 people — that day, including Lutnick’s brother. Howard Lutnick led the firm’s recovery and is a member of the Board of Directors of the National September 11 Memorial & Museum.\n\nLutnick has promised to sell off his business holdings. They’re complicated. His financial disclosure statement showed that he had positions in more than 800 businesses and other private organizations.","summary":"The Senate vote to confirm Lutnick was 51-45.","url":"https://www.ocregister.com/2025/02/18/howard-lutnick-confirmed-commerce-secretary/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/Trump_23568.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-18 23:50:34","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.174},{"id":291939824,"title":"Senate confirms Howard Lutnick as commerce secretary, a key role for Trump’s trade agenda","text":"By PAUL WISEMAN\n\nWASHINGTON (AP) — The Senate confirmed wealthy financier Howard Lutnick as commerce secretary Tuesday, putting in place a staunch supporter of President Donald Trump’s hardline trade polices.\n\nAt the Commerce Department, Lutnick, who was CEO at the investment firm Cantor Fitzgerald, will oversee 50,000 employees who do everything from collecting economic statistics to running the census to issuing weather reports. But he’s likely to spend a lot of time — along with Jamieson Greer, Trump’s nominee to be the top U.S. trade negotiator — managing the president’s aggressive plans to impose import taxes on U.S. trading partners, including allies and adversaries alike.\n\nThe Senate vote to confirm Lutnick was 51-45.\n\nTrump views the tariffs as a versatile economic tool. They can raise money to finance his tax cuts elsewhere, protect U.S. industries and pressure other countries into making concessions on such issues as their own trade barriers, immigration and drug trafficking. Mainstream economists mostly view tariffs as counterproductive: They are paid by import companies in the United States, which try to pass along the higher costs to consumers and can thereby add to inflationary pressures throughout the economy.\n\nAt his confirmation hearing last month, Lutnick dismissed as “nonsense” the idea that tariffs contribute to inflation. He expressed support for deploying across-the-board tariffs ”country by country” to strong-arm other countries into lowering barriers to American exports.\n\nTrump last week announced plans for “reciprocal” tariffs — raising U.S. import tax rates to match the higher taxes that other countries impose on goods from the U.S. The move would shatter the rules that have governed world trade for decades. Since the 1960s, tariff rates have mostly emerged from negotiations between dozens of countries. Trump is commandeering the process.\n\nThe president has also imposed 10% tariffs on Chinese imports and effectively raised U.S. taxes on foreign steel and aluminum. He has threatened — and delayed until March 4 — 25% tariffs on goods from Canada and Mexico.\n\nLutnick was CEO at Cantor Fitzgerald when its offices were hit in the Sept. 11, 2001, attack on the World Trade Center. The firm lost two-thirds of its employees — 658 people — that day, including Lutnick’s brother. Howard Lutnick led the firm’s recovery and is a member of the Board of Directors of the National September 11 Memorial & Museum.\n\nLutnick has promised to sell off his business holdings. They’re complicated. His financial disclosure statement showed that he had positions in more than 800 businesses and other private organizations.","summary":"The Senate vote to confirm Lutnick was 51-45.","url":"https://www.sandiegouniontribune.com/2025/02/18/howard-lutnick-confirmed-commerce-secretary/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/02/Trump_23568.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-18 23:50:34","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.174},{"id":291929448,"title":"Aussie star’s role to end golf’s war","text":"Scott, who met with US President Donald Trump as “reunification” looms, conceded there would be angst from players who stayed loyal to the PGA Tour should those who left for nine-figure LIV contracts be allowed to return.\n\nThat’s a legitimate potential outcome of talks between the PGA Tour and the Saudi Public Investment Fund, which has poured $3bn into LIV during the most tumultuous time in the game’s history. \n\nDays after revelations Scott and PGA Tour commissioner Jay Monahan had met with Mr Trump to hasten a coming together of all parties and possibly even forming “one tour”, Norman, the first LIV chief executive who helped lure players to his tour, was in Adelaide to announce a contract extension until 2031, with the event to played on a purpose-built new course designed by the Australian legend. \n\nIt was a move that even surprised Australian LIV star Cameron Smith, who said planning for the fledgling tour beyond 2030 was “crazy” and beyond all expectations.\n\nBut what form LIV exists in going into the next decade remains unclear, and Scott, who has been thrust into the forefront of these discussions since joining the PGA Tour board at the start of 2024, said there “aren’t any easy answers”.\n\nHe said reunification was “one way forward” but might not be the final answer. \n\n“But it’s not solely the tour’s decision, you know what I mean?” he said. \n\n“There’s two people in this discussion, more to be honest – the DP World Tour (European tour), a lot of other stakeholders in the pro game.\n\n“It’s not been an easy thing to solve, otherwise we’d have solved it, I believe.\n\n“There aren’t easy answers to any of this stuff.”\n\nScott also conceded that the final solution, whatever it looks like, might not “please everyone”.\n\nAfter fallout from Rory McIlroy declaring LIV players should be welcomed back to the PGA Tour they walked out on, Scott said player angst could be strong and that was a fair response. \n\n“I wouldn’t hold it against anybody if there were negative emotions attached to it, the thought of players coming back,” Scott told the Associated Press. \n\n“I wouldn’t be surprised – or I wouldn’t judge anyone, the members – if reunification happened and they weren’t happy with how it happened.\n\n“The one thing I do know is we’re not going to please everyone, but everyone should know that I will stand behind these player directors.”","summary":"After meeting with the US President in a bid to end golf’s war, an Australian major champion has revealed what the player fallout could look like.","url":"https://www.news.com.au/sport/golf/adam-scott-says-there-would-be-player-angst-should-liv-stars-return-to-pga-tour/news-story/c9d2a479a1d46f2e899f8f826e5772b5?from=rss-basic","image":"https://content.api.news/v3/images/bin/ab2f3e79dfb72c08fb6dc6837b09ed61","video":null,"publish_date":"2025-02-18 23:49:55","author":"Copy Link","authors":["Copy Link"],"language":"en","category":"entertainment","source_country":"au","sentiment":-0.182}]}