{"offset":0,"number":50,"available":5304,"news":[{"id":253625634,"title":"CRAIG BROWN: Look out! The US election's just got even more weird","text":"They say Kamala Harris chose Tim Walz as her vice presidential running mate after being impressed by his description of her rival, Donald Trump, as ‘weird’. For some reason, the insult had taken off, and had clearly rankled the one person it was meant to rankle: Trump himself. Interviewed by the radio host Clay Travis, Trump was still smouldering. ‘Nobody’s ever called me weird.’ Weirdly, he then repeated the same sentence: ‘Nobody’s ever called me weird.’ He then added: ‘I’m a lot of things, but weird I’m not.’ Walz, the governor of Midwest state Minnesota, also described the Republican vice presidential nominee, J.D. Vance, as ‘weird’, and this also upset Trump. ‘I will tell you. J.D. is not at all. They are. We’re not weird people. We’re actually just the opposite.’ It’s strange – weird, even – that everyone seems to have forgotten the first time the word ‘weird’ was publicly apTplied to Trump. It was seven years ago, on January 20, 2017, and it happened outside the Capitol Building in Washington DC. President Trump had taken his oath of office, and many imagined he would go on to deliver an inaugural address that was dignified and statesmanlike. Instead, he launched into a tirade, portraying America as broken, with ‘rusted-out factories scattered like tombstones across the landscape of our nation’. He blamed it on previous presidents, before announcing: ‘The American carnage stops right here, right now . . . From this moment on, it’s going to be America First.’ When Trump’s rant came to an end, former President George W. Bush turned to the defeated candidate, Hillary Clinton, and said the immortal words: ‘Well, that was some weird s**t.’ Appropriately enough, the word ‘weird’ is itself weird. Just look at the way it is spelt: if it were a conventional word, we would spell it ‘wierd’. But no: it is one of those odd-bod words, like ‘beige’ or ‘heist’ that refuses to obey the rule every schoolchild knows – ‘i before e except after c’. The word ‘weird’ has gone in and out of fashion. Around 1400, it was spelt ‘wierd’, developed from the Old English ‘wyrd’, and meant ‘having the power to control the fate of men’, which certainly qualifies Donald Trump as wierd or wyrd, if not weird. It then fell from favour until 1606, when various characters in Macbeth referred to the three witches as the ‘Weird Sisters’. Alas, Shakespeare neglected to pen a speech in which a witch hits back, saying: ‘Nobody’s ever called me weird. I’m a lot of things, but weird I’m not.’ Ever since its revival in Macbeth, people have used the adjective ‘weird’ to mean strange. Is it purely coincidental that Trump was born in 1946, which, according to the Oxford English Dictionary, was just three years before the adjective became the noun ‘weirdie’? By 1955, ‘weirdie’ had become ‘weirdo’, which is still popular today. Until recently, weirdos were easily identifiable as people who talked to themselves in public. If you spotted someone coming towards you talking gibberish at the top of their voice, you would swerve away and avert your eyes. But since the advent of the mobile phone, the weirdos have taken over. These days, every other person in the street is chatting at full volume, even though no one is walking alongside them. Donald Trump’s speeches have increasingly become unstructured rambles around the interior of his skull, addressed to everyone and no one. ‘I’ve got to be the cleanest – I think I’m the most honest human being, perhaps, that God has ever created,’ he told a rally in North Carolina in 2022. Last year, for no discernible reason, he rambled on about sharks to a rally in Iowa: ‘If I’m sitting down and that boat is going down and I’m on top of a battery and the water starts flooding in, I’m getting concerned. ‘But then I look ten yards to my left and there’s a shark over there, so I have a choice of electrocution or a shark. You know what I’m going to take? Electrocution. I will take electrocution every single time. Do we agree? Yeah, I will take electrocution.’ Perhaps this is why Tim Walz’s observation hit its target: because if anyone in your neighbourhood started speaking like that, you would definitely think ‘weirdo’, before walking swiftly on.","summary":"CRAIG BROWN: They say Kamala Harris chose Tim Walz as her vice presidential running mate after being impressed by his description of her rival, Donald Trump , as 'weird'.","url":"https://www.dailymail.co.uk/debate/article-13721307/CRAIG-BROWN-Look-elections-just-got-weird.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/08/08/01/88288597-0-image-m-108_1723075318747.jpg","video":null,"publish_date":"2024-08-08 00:32:52","author":"Craig Brown,Editor","authors":["Craig Brown","Editor"],"language":"en","catgory":"politics","source_country":"GB","sentiment":-0.225},{"id":253625210,"title":"Biden says he’s ‘not confident’ in peaceful transfer of power if Trump loses White House race","text":"Joe Biden says he is “not confident at all” that there will be a peaceful transfer of power if Donald Trump loses the 2024 presidential election. The president said that Trump needed to be taken seriously over his March comments that there would be a “bloodbath” for the US car industry and country should he be defeated in November. The White House claimed at the time that the former president was inciting violence, which he rejected. Biden made the comments to CBS News during his first sit-down interview since officially halting his reelection campaign and handing over the reins of the Democratic party to Kamala Harris. Asked about his confidence in a peaceful transference of power, he replied: “If Trump wins. No, I’m not confident at all.” The president quickly corrected himself, saying: “I mean, if Trump loses, I’m not confident at all. “He means what he says. We don’t take him seriously. He means it. All the stuff about ‘if we lose, there’ll be a bloodbath’. [The elections] have to be stolen, look what they’re trying to do now in the local election districts. “You can’t love your country, only when you win.” On January 6 2021, just three weeks before Biden was due to be sworn in as president, Trump gave a speech to thousands of supporters in Washington DC. Speaking from behind bulletproof glass he declared that he would \"never concede\" the election, which he claimed had been stolen from him, criticized the media and called for his own vice president, Mike Pence, to overturn the election results. Supporters of the former president then marched to the United States Capitol Building and stormed the building, aiming to prevent a joint session of Congress from counting the Electoral College votes to formalize Biden’s victory. Within 36 hours of the insurrection, five people died: one was shot by Capitol Police, another died of a drug overdose, and three died of natural causes, including a police officer. Many people were injured, including 174 police officers. The FBI says that in the 42 months since the attack on the Capitol, more than 1,470 individuals have been charged in nearly all 50 states for crimes related to the breach, including more than 530 individuals charged with assaulting or impeding law enforcement.","summary":"The president said that his former political rival needed to be taken seriously over his previous incendiary rhetoric","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-trump-transfer-power-election-b2593017.html","image":"https://static.independent.co.uk/2024/08/08/00/newFile-1.jpg?width=1200","video":null,"publish_date":"2024-08-08 00:29:59","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.493},{"id":253625230,"title":"Harris, Walz Duel With Vance in Midwest Rallies","text":"Vice President Kamala Harris and her newly designated running mate, Minnesota Gov. Tim Walz, stumped in Eau Claire, Wisconsin. The pair made a stop at Detroit-Wayne County airport that evening. Sen. JD Vance (R-Ohio), Republican presidential nominee former President Donald Trump’s running mate, spoke outside the Shelby Township Police Department in Michigan on Wednesday morning before hosting his own event in Eau Claire that afternoon. At the Harris–Walz rally in Eau Claire, Walz leaned into his Midwestern roots, touting his upbringing in small-town Nebraska, his 24-year military service, and his experience as a high school teacher and coach. “I have to say, this idea of caring for our neighboring kindness and [a] hand up when somebody needs it, or just the sense of that people go through things and to be able to be there when they need it, that’s who we are,” Walz told the packed crowd in Eau Claire. Vance’s Shelby Township speech highlighted crime and illegal immigration, keying on an alleged rape committed by an illegal immigrant in that community. The suspect had previously been deported from the United States. In Eau Claire, Vance visited a Wollard International manufacturing plant to underscore the importance of American manufacturing. “I’m one of these guys who believes that it’s important that we make more things right here in the USA,” Vance said, appealing to voters in the country’s manufacturing hub. “Come on, that’s not who Wisconsin is, that’s not who Minnesota is,” Walz said. Harris, speaking after Walz, pledged to ensure a future where “every worker has the freedom to join a union,” drawing cheers from the crowd. The vice president called herself and her running mate “joyful warriors.” The Midwest, particularly Michigan and Wisconsin, is seen as crucial to securing the White House. The states have 15 and 10 electoral college votes, respectively. Democrats won both in 2020 with narrow margins after Republicans carried them in 2016. They are often referred to as the “Blue Wall,” along with Minnesota and Illinois, but have become swing states in recent elections. As Harris and Trump remain neck and neck in the Midwest, Walz’s potential appeal to this region and swing state voters is seen as one reason he may have been given the vice presidential nod over Pennsylvania Gov. Josh Shapiro.","summary":"Both campaigns made stops in Wisconsin and Michigan, Vance stumped on immigration and manufacturing, Harris and Walz on labor.","url":"https://www.theepochtimes.com/us/harris-walz-duel-with-vance-in-midwest-rallies-5701730","image":"https://img.theepochtimes.com/assets/uploads/2024/08/07/id5701766-GettyImages-2165252210-300x180.jpg","video":null,"publish_date":"2024-08-08 00:24:05","author":"Jacob Burg","authors":["Jacob Burg"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.233},{"id":253625110,"title":"Former Colorado clerk was shocked after computer images were shared online, employee testifies","text":"DENVER (AP) — An employee of former Colorado clerk Tina Peters who says she was present when her boss allowed an outsider posing as a county employee to breach her voting system’s computer testified Wednesday that Peters was shocked when images from the computer appeared online. In the summer of 2021, former elections manager Sandra Brown said Peters called her after seeing the photos and videos she took of the Dominion Voting Systems’ hard drive and said, “I don’t know what to do,” using an obscenity to express her distress over the possible consequences. Soon after that, as authorities began investigating what had happened, Peters and her attorney advised Brown and another employee to buy disposable cellphones known as burner phones so their conversations with her and lawyers could not be discovered by investigators and urged them not to talk to law enforcement, Brown said. After Brown was indicted and turned herself in, Peters came to visit her at jail the same day, she said. “She came in and she said, ‘I love you, you have support, and don’t say anything,’” said Brown, who said Peters also gave her the number of an attorney who could represent her in court for her bail hearing. Brown eventually got another attorney and pleaded guilty under a plea deal that required her to testify against Peters. Peters’ attorneys argue she only wanted to preserve election data before the system got a software update and did not want that information shared with the world. They say she was acting under her authority as clerk and did not break any laws. Prosecutors, meanwhile, have portrayed Peters as someone who had become “fixated” on voting problems after becoming involved with activists who had questioned the accuracy of the 2020 presidential election results, including Douglas Frank, an Ohio math teacher who worked for MyPillow founder Mike Lindell. The defense says she was a responsive public official who wanted to be able to answer questions about the election in her community in western Colorado’s Mesa County, a Republican stronghold that voted for Donald Trump in the election. Prosecutors allege the plan to take an image of the voting system’s hard drive was hatched during an April 2021 meeting with Frank, Peters and others in her office when he was in town to give a presentation on voting fraud. On a secret recording made by another elections employee, Frank told Peters that uncovering corruption in her voting system and cleaning it up would be “a feather in your cap.” Peters invited Frank to come back the following month for the software update for the county’s voting machines. Frank said he could instead send a team that’s “the best in the country.” According to prosecutors, Frank sent a retired surfer from California and fellow Lindell associate, Conan Hayes, to take an image of the hard drive before and after the software update. Peters is accused of passing Hayes off as an elections employee using another person’s badge, a person she allegedly pretended to hire only so she could use the badge to get Hayes in to also observe the update. The Colorado Secretary of State’s office, which facilitated the update being done with Dominion, had denied Peters’ requests to have an outside computer expert to be in the room. Hayes has not been charged with a crime. He did not respond messages left at telephone numbers listed for him and to an email seeking comment about the allegations. The defense claims that Peters thought Hayes was working as a government informant and that he only agreed to help her if his identity was concealed. Judge Matthew Barrett has barred the defense from discussing that claim in front of jurors. Prosecutors say there’s no evidence to support that Hayes was an informant. Barrett has also ruled that, even if Peters believed he was, it is not an excuse for what she is accused of doing. After lawyer Amy Jones, a former Ohio judge, suggested that Peters believed Hayes was an informant during opening statements, Barrett told jurors to “put that out of your minds.” After the jury left, he scolded the defense for bringing it up despite his prior order not to introduce it. Peters is charged with three counts of attempting to influence a public servant, criminal impersonation, two counts of conspiracy to commit criminal impersonation, one count of identity theft, first-degree official misconduct, violation of duty and failing to comply with the secretary of state. The trial is expected to continue through early next week. Colleen Slevin, The Associated Press","summary":"DENVER (AP) — An employee of former Colorado clerk Tina Peters who says she was present when her boss allowed an outsider posing as a county employee to breach her voting system&#8217;s computer testified Wednesday that Peters was shocked when images from the computer appeared online. In the summer of 2021, former elections manager Sandra [&#8230;]","url":"https://toronto.citynews.ca/2024/08/07/former-colorado-clerk-was-shocked-after-computer-images-were-shared-online-employee-testifies/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/88a6ab2e4219a26e8c5b9a13f2eaaea268be5e4ff4d634815f5224739c2efee7.jpg","video":null,"publish_date":"2024-08-08 00:23:04","author":"Colleen Slevin,News Staff","authors":["Colleen Slevin","News Staff"],"language":"en","source_country":"ca","sentiment":-0.312},{"id":253624692,"title":"JD Vance's 'Rags to Riches' Story Ripped in Home State Newspaper","text":"The \"rags to riches\" story that Ohio Republican Senator JD Vance presented in his 2016 memoir Hillbilly Elegy has been panned as an endorsement of \"endless resentment\" in an opinion article published by The Columbus Dispatch.Vance, now the 2024 running mate of former President Donald Trump, describes his upbringing in \"an Ohio steel town that has been hemorrhaging jobs and hope for as long as I can remember\" in the book, while attempting to explain white working class voters in similar areas shifting support from Democrats to Republicans in recent decades.In the opinion piece published by the Dispatch on Wednesday, Ohio Northern University English professor Douglas Dowland argues that the book, which also details Vance's rise from a poor background to Yale Law School, \"lacks the charitable embrace of those in need.\"\"Instead, Vance uses his rags-to-riches story to write an America of 'us' versus 'them,' a world of endless resentment,\" Dowland writes. \"In his younger years, Vance was well aware of the power of resentment ... Yet as the memoir unfolds, the danger of resentment is something that he gradually forgets.\"\"In one of his first jobs, he comes to see fellow co-workers as 'immune to hard work,'\" he continues. \"And as he slowly moves from rags to riches himself, his resentment only multiplies ... As he grows richer, he seems to find more flaws in his fellow citizens.\"Dowland goes on to tie Hillbilly Elegy to Vance's transformation after the memoir was published, when the future senator went from pondering whether Trump was \"America's Hitler\" to frequently praising the former president as his running mate.After writing that the book presents \"a vision of America as a nation of 'us' versus 'them' makes it impossible for him to extend a hand, to help another up the ladder,\" Dowland argues that \"Vance is so fascinated by identifying foes that he is uninterested in finding friends.\"Dowland then mentions Vance's \"childless cat ladies\" comment as an example of the senator offering \"gambits of gratuitous generalization\" to advance his political pursuits, before warning that \"the end of the American story\" could come if the Republican ticket wins in November.\"'Hillbilly Elegy' was the prelude to this,\" Dowland writes. \"It shows the limits of an American story. And, worryingly, that story, as it is shaped and resentfully reshaped by the hands of the now-candidate for vice president, may very well be the prelude to the end of the American story.\"Newsweek reached out for comment to Vance's office and the Trump/Vance campaign via email on Wednesday evening.While Hillbilly Elegy was a bestseller when it was published and has gone on to enjoy further success following Vance's Republican Party ascendancy, Dowland is far from the only critic to take issue with both the book and the senator's political messaging.In an opinion article published by Newsweek late last month, Arick Wierson, television producer and ex-adviser to former New York City Mayor Michael Bloomberg, argued that Vance was paying \"hollow lip service\" to \"rural voters and small town America,\" while asserting that Minnesota Governor Tim Walz—whom Vice President Kamala Harris announced as her running mate on Tuesday—would be the perfect antidote.\"Walz is the real deal,\" Wierson wrote. \"In fact, it's not hard to see Tim Walz as the very guy who, if selected as Harris' VP pick, could effectively turn Vance's Hillbilly Elegy into Vance's very own hillbilly political eulogy.\"","summary":"The 2024 Republican vice presidential nominee was denounced for pushing a narrative of \"endless resentment\" in his 2016 memoir.","url":"https://www.newsweek.com/jd-vances-rags-riches-story-ripped-home-state-newspaper-1936212","image":"https://d.newsweek.com/en/full/2445544/jd-vance-hillbilly-elegy-ripped-ohio-newspaper.jpg","video":null,"publish_date":"2024-08-08 00:16:16","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.262},{"id":253625320,"title":"Former Colorado clerk was shocked after computer images were shared online, employee testifies","text":"An employee of former Colorado clerk Tina Peters who says she was present when her boss allowed an outsider posing as a county employee to breach her voting system's computer testified Wednesday that Peters was shocked when images from the computer appeared online. In the summer of 2021, former elections manager Sandra Brown said Peters called her after seeing the photos and videos she took of the Dominion Voting Systems' hard drive and said, “I don’t know what to do,\" using an obscenity her distress over the possible consequences. Soon after that, as authorities began investigating what had happened, Peters and her attorney advised Brown and another employee to buy disposable cellphones known as burner phones so their conversations with her and lawyers could not be discovered by investigators and urged them not to talk to law enforcement, Brown said. After Brown was indicted and turned herself in, Peters came to visit her at jail the same day, she said. “She came in and she said, ‘I love you, you have support, and don’t say anything,’” said Brown, who said Peters also gave her the number of an attorney who could represent her in court for her bail hearing. Brown eventually got another attorney and pleaded guilty under a plea deal that required her to testify against Peters. Peters’ attorneys argue she only wanted to preserve election data before the system got a software update and did not want that information shared with the world. They say she was acting under her authority as clerk and did not break any laws. Prosecutors, meanwhile, have portrayed Peters as someone who had become “fixated” on voting problems after becoming involved with activists who had questioned the accuracy of the 2020 presidential election results, including Douglas Frank, an Ohio math teacher who worked for MyPillow founder Mike Lindell. The defense says she was a responsive public official who wanted to be able to answer questions about the election in her community in western Colorado's Mesa County, a Republican stronghold that voted for Donald Trump in the election. Prosecutors allege the plan to take an image of the voting system's hard drive was hatched during an April 2021 meeting with Frank, Peters and others in her office when he was in town to give a presentation on voting fraud. On a secret recording made by another elections employee, Frank told Peters that uncovering corruption in her voting system and cleaning it up would be “a feather in your cap.” Peters invited Frank to come back the following month for the software update for the county’s voting machines. Frank said he could instead send a team that’s “the best in the country.” According to prosecutors, Frank sent a retired surfer from California and fellow Lindell associate, Conan Hayes, to take an image of the hard drive before and after the software update. Peters is accused of passing Hayes off as an elections employee using another person’s badge, a person she allegedly pretended to hire only so she could use the badge to get Hayes in to also observe the update. The Colorado Secretary of State’s office, which facilitated the update being done with Dominion, had denied Peters’ requests to have an outside computer expert to be in the room. Hayes has not been charged with a crime. He did not respond messages left at telephone numbers listed for him and to an email seeking comment about the allegations. The defense claims that Peters thought Hayes was working as a government informant and that he only agreed to help her if his identity was concealed. Judge Matthew Barrett has barred the defense from discussing that claim in front of jurors. Prosecutors say there's no evidence to support that Hayes was an informant. Barrett has also ruled that, even if Peters believed he was, it is not a valid legal defense. After lawyer Amy Jones, a former Ohio judge, suggested that Peters believed Hayes was an informant during opening statements, Barrett told jurors to “put that out of your minds.\" After the jury left, he scolded the defense for bringing it up despite his prior order not to introduce it. Peters is charged with three counts of attempting to influence a public servant, criminal impersonation, two counts of conspiracy to commit criminal impersonation, one count of identity theft, first-degree official misconduct, violation of duty and failing to comply with the secretary of state. The trial is expected to continue through early next week.","summary":"An employee of former Colorado clerk Tina Peters who says she was present when her boss allowed an outsider posing as a county employee to breach her voting system’s computer says Peters was shocked when images from the computer appeared online","url":"https://www.independent.co.uk/news/ap-colorado-denver-amy-jones-dominion-voting-systems-b2593022.html","image":"https://static.independent.co.uk/2024/08/08/01/Election_Security_Colorado_Clerk_46581.jpg?width=1200","video":null,"publish_date":"2024-08-08 00:11:12","author":"Colleen Slevin","authors":["Colleen Slevin"],"language":"en","source_country":"gb","sentiment":-0.306},{"id":253625154,"title":"Steve Mnuchin calls for a culling of the 20-year Treasury bond he reintroduced","text":"This isn’t just some minor aesthetic for traders to fret about. It costs the American taxpayer money. Since the Treasury re-introduced the 20-year bond in monthly auctions four years ago, their sale has tacked on roughly $2 billion a year in interest expenses on top of what the government would have otherwise paid, a simple back-of-the-envelope calculation shows. That’s some $40 billion over the life of the bonds. This is, at some level, peanuts for a government that spends almost $7 trillion annually. And yet, $2 billion goes a long way. It’s the same amount the government spends each year to operate the national park system, and more than what goes to home-buying assistance for military veterans. Raise the matter with most bond-market experts and they’ll hem and haw about whether to eliminate the 20-year bond to save money. It’s more complicated than it seems, they say. But one person — out of the roughly a dozen interviewed for this story — stated without hesitation or stipulation that it should be killed. That person, tellingly, is the very man who brought the bond back to life in 2020: Steven Mnuchin. “I would not keep issuing them,” Mnuchin, who served as Treasury Secretary under then-President Donald Trump, said when contacted by Bloomberg News. The conceit — to create another maturity to help lock in low borrowing costs for decades — made sense at the time, he contends, but things simply haven’t worked out as planned. “It’s just costly to the taxpayer.” Mnuchin’s about-face echoes, in some ways, the go-fast-and-break-things approach to policy making that Trump and his team preferred. The Biden administration, by contrast, is taking a more conventional approach and sticking with the 20-year bond — albeit at a scaled-back size — to ensure continuity and stability in the government’s debt sale program. (A spokesperson for the Treasury declined to comment.) Whichever party takes the White House in November, the takeaway from the rollout of the 20-year is clear: Managing the government’s ballooning deficit is becoming increasingly tricky. At almost $2 trillion, it’s double the level of just five years ago. And investors aren’t necessarily going to eagerly snap up some new bond just because the Treasury dangles it in front of them. This is simply the grim new reality of America’s finances, bond-market experts say. The country needs as many creditors willing to lend it money as possible. And for those experts who are hesitant to recommend a quick end to the 20-year auctions, that need is paramount — even if it means paying up to lure buyers to a new security in the market. “Having another maturity point,” says Brian Sack, the head of macro strategy at multi-strategy hedge fund Balyasny Asset Management, “gives them some additional flexibility.” The US resumed selling 20-year bonds in May 2020 following a more than three-decade hiatus. There were signs from the beginning that the debt would be expensive. Bond-market advisers who gave the new maturity their blessing warned the Treasury not to overestimate demand. Yet initial auction sizes were significantly larger than recommended. “We wanted to issue as much long-term debt as possible to extend our maturities and lock in the very low rates that existed at the time,” said Mnuchin, who now runs private equity firm Liberty Strategic Capital. He had even wanted to introduce super long-term debt — securities due in 50 or 100 years — but settled on 20 years when advisers discouraged that idea. The 20-year bonds really began to falter following a series of auction size increases and soon became the highest-yielding US government security. Today, even after auctions have been reduced, it remains the most expensive form of financing beyond short-term T-bills. Analysts point to a variety of reasons why the 20-year bond continues to struggle. Prominent among them: it’s not as liquid as the 10-year and it offers less duration, or interest-rate risk, than the 30-year. At 4.34%, the 20-year yield is currently 0.23 percentage point above the average of the 10- and 30-year securities. It can be difficult to measure alternative financing costs with precision because yields on 10- and 30-year bonds could be a tick higher today if the Treasury had sold more of them rather than issuing the 20-year notes. But that yield gap, when calculated at the time of issuance over the past four years, generates an added-cost estimate of $2 billion annually. A more conservative calculation of the added cost, based on the gap between yields on Treasuries and interest-rate swaps, puts the figure at about half that amount. “From the taxpayer perspective, the most important thing is, over time, can you minimize the cost of borrowing?” says Ed Al-Hussainy, a rates strategist at Columbia Threadneedle Investments in New York. “It’s not clear we got that.” Al-Hussainy is one of the few in the market who shares Mnuchin’s view. The whole thing has been a “mistake,” he says. “There’s not much demand for these particular bonds. It doesn’t make sense.” To try to better match supply with demand, the Treasury has dramatically scaled back issuance of the maturity in recent years. Quarterly sales of 20-year debt now stand at $42 billion, down from a peak of $75 billion. “The Treasury has brought 20-year bonds to a more appropriate size,” Sack says. He used to sit on the Treasury Borrowing Advisory Committee, a panel of bond dealers and investors that advises the government on issuance strategy. In 2020, the committee supported the launch of the 20-year bond. “The market for that security is now in better balance than it was a few years ago.” And Amar Reganti, a former deputy director of the Treasury’s Office of Debt Management, said the market will likely look even better in a few years. It can take a while, Reganti stressed, for new securities to draw the sort of consistent demand that other maturities attract. While the four years since their debut seem “like a long period of time in capital markets,” said Reganti, who is now a fixed-income strategist at Hartford Funds, “it’s actually quite a short period of time from a debt management perspective.” Not for Mnuchin. The market, he said, has had more than enough time to render a verdict. Meanwhile, one group already has stopped selling 20-year bonds: corporate America. At first, CFOs across the country boosted sales of 20-year bonds when the Treasury reintroduced the maturity. This was one of the positive side effects that policymakers were seeking. That pickup quickly faded, though, and today the market is all but dead. New offerings totaled just $3 billion through the first half of the year, down from $82 billion over the course of 2020. The maturity accounts for less than 1% of the combined sales of 10-year and 30-year bonds, down from about 10% previously, according to data compiled by Bloomberg. “We always say that in the corporate market, supply follows demand and there’s just not a lot of demand for 20-year bonds in general,” said Winnie Cisar, global head of credit strategy at CreditSights. “It’s just a weird tenor.”","summary":"“I would not keep issuing them,” Mnuchin, who served as Treasury Secretary under then-President Donald Trump. “It’s just costly to the taxpayer.”","url":"https://fortune.com/2024/08/07/steve-mnuchin-bond-treasury-cost-taxpayers/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/GettyImages-1257483609-e1723075713908.jpg","video":null,"publish_date":"2024-08-08 00:10:07","author":"Bloomberg,Liz Capo McCormick,Saleha Mohsin,Ye Xie","authors":["Bloomberg","Liz Capo McCormick","Saleha Mohsin","Ye Xie"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.081},{"id":253625660,"title":"Feds arrest rioter for threatening Justice Barrett on Jan. 6","text":"A Nevada man awaiting trial for criminal charges tied to the Jan. 6 attack on the U.S. Capitol, has been arrested once more following violent threats he made targeting U.S. Supreme Court Justice Amy Coney Barrett and U.S. Attorney General Merrick Garland. A bond revocation hearing for Bradley Nelson will be held on Aug. 14 in Washington, D.C., before U.S. District Judge John Bates, according to a minute entry on the docket reviewed Wednesday by Law&Crime. Court records show following Nelson’s March 2023 arrest, he was released with conditions including no drugs, guns, or any travel to Washington, D.C., but did not specify restrictions for his social media use. Now prosecutors say they have found a litany of disturbing and threatening social media posts from Nelson concerning a variety of public officials and that he should be put back in jail since he poses a danger to the public. In August 2023, prosecutors allege Nelson posted an image online of a Georgia state judge handling the Donald Trump election interference case with “apparent crosshairs drawn on his head.” The judge handling the currently waylaid racketeering case in Georgia alleging Trump and several others engaged in a “fake electors” scheme is Fulton County Superior Court Judge Scott McAfee, who is not named in the detention order for Nelson. In February 2024, prosecutors allege Nelson posted an image of New York Attorney General Letitia James — who handled Trump’s civil fraud prosecution — with crosshairs on her head too. This time, the photo was accompanied by threatening commentary from Nelson allegedly including: “give every [expletive] thing I have to watch that [expletive]’s head explode, or at least the back of her head blowout.” And then, in June, mere hours after the Supreme Court issued its decision in Fischer v. United States agreeing to narrow the application of an obstruction statute used to prosecute Jan. 6 rioters, Nelson allegedly set eyes on Supreme Court Justice Amy Coney Barrett. Barrett, appointed by former President Donald Trump, broke with her conservative colleagues in a sharply written dissenting opinion in Fischer v. United States. She wrote, as Law&Crime reported, that it was clear the certification of the election on Jan. 6, 2021, by Congress was an “official proceeding” under the meaning of the obstruction statute at challenge. Attempts by the high court’s majority to narrow the statute by suggesting that it only applied to the obstruction of official documents or records struck Barrett as nonsensical. She called out the majority for engaging in “textual backflips” to reach its conclusion. “I pray to God with all my [expletive] heart that somebody cuts your [expletive] throat from ear to ear you worthless piece of [expletive],” Nelson allegedly wrote hours after that dissent was published. That post also included an image of the justice. The alleged threat against Attorney General Garland came in July. Nelson posted a photo of Garland with crosshairs on his head too, according to prosecutors. There were videos from June 28 that he posted online less than 10 minutes apart as well, according to prosecutors, and in each, he lashed out at the FBI, even offering in one clip to “get into ‘the MMA ring with you two pieces of [expletive].” MMA is an abbreviation for mixed martial arts. In one of those alleged threats, he also referred to the “FBI [expletive] math teacher.” “The government proffers that the lead case agent in this investigation was a math teacher before joining the FBI,” an Aug. 6 opinion and order to detain Nelson notes. Nelson referred to a second FBI agent who interviewed him following his initial March 2023 arrest as well. Notably, Nelson referred to that agent as a “Stabler-looking person,” referring to a character on the television show “Law&Order: SVU” known as Elliot Stabler. Nelson was described by agents as being so aggressive with them following his first March 2023 interview that a U.S. Marshal had to escort one of the FBI agents to their car due to safety concerns. Nelson was ordered into detention on Tuesday and will be held until his bond revocation hearing next week. It seems unlikely he would be granted release in the wake of increasing threats against public officials like Vice President Kamala Harris and a recent assassination attempt on Donald Trump. Law&Crime reported on Monday that a man who threatened to “personally pluck out” the vice president’s eyes was arrested in Virginia. Nelson was set to go to trial on Sept. 18 until prosecutors had requested proceedings be continued for at least 45 days so the case and pretrial discovery could be tweaked in light of the Supreme Court’s ruling in Fischer. Now a pretrial conference is set for Nov. 21 with a trial date of Dec. 10. He has pleaded not guilty to the Jan. 6 charges which include: 18 U.S.C. § 1752(a)(1)- Entering and Remaining in a Restricted Building or Grounds; 18 U.S.C. § 1752(a)(2)- Disorderly and Disruptive Conduct in a Restricted Building or Grounds; 40 U.S.C. § 5104(e)(2)(D)- Disorderly Conduct in a Capitol Building; and 40 U.S.C. § 5104(e)(2)(G)- Parading, Demonstrating, or Picketing in a Capitol Building.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOn the left side of the image, Bradley Nelson is seen at&#8230;\n\n\nThis Post: Feds arrest rioter for threatening Justice Barrett on Jan. 6 first appeared on Internewscast Journal","url":"https://internewscast.com/crime/feds-arrest-rioter-for-threatening-justice-barrett-on-jan-6/","image":"https://internewscast.com/wp-content/uploads/2024/08/Jan-6-rioter-arrested-after-threat-to-Justice-Barrett-Feds.jpg","video":null,"publish_date":"2024-08-08 00:09:02","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.361},{"id":253625214,"title":"Democrats push back as Trumpworld dusts off ‘swift boat’ attack on Walz","text":"Two decades after false allegations of stolen valor against his opponent helped George W Bush win a second term in the White House, Vice President Kamala Harris’s campaign isn’t letting the same thing happen to her or her running-mate, Minnesota Governor Tim Walz. The Harris campaign is defending Walz, an Army veteran who spent nearly a quarter-century in the Minnesota National Guard, from Republicans who are claiming he deserted to avoid deployment to Iraq and falsely accusing him of claiming to be a combat veteran. His GOP opponent, Trump running-mate and Ohio senator JD Vance, made the disturbing allegations during a media availability in Wisconsin ahead of a massive Harris-Walz rally in the Badger State. He told reporters that Walz, who retired from the Minnesota guard after 24 years of service to run for Congress in the 2006 election, had “dropped out of the army and allowed his unit to go [to Iraq] without him.” Vance also accused Walz of falsely claiming to have seen combat, citing comments the Minnesotan had made about not wanting “weapons of war” to be available on American streets. The Ohio senator’s accusation that his opponent ditched his guard unit rather than deploy to combat is patently false. According to military records, Walz officially retired from the Minnesota National Guard in May 2005, two months before his unit received word that it would be deployed, four months before deployment preparations began and ten months before the unit deployed. In a statement, a Harris-Walz campaign spokesperson strongly pushed back against Vance’s claim that Walz had “dropped out” rather than deploy with the men he led, instead accurately describing the governor’s separation from service as a normal retirement after nearly a quarter-century in uniform. “After 24 years of military service, Governor Walz retired in 2005 and ran for Congress, where he chaired Veterans Affairs and was a tireless advocate for our men and women in uniform - and as Vice President of the United States he will continue to be a relentless champion for our veterans and military families,” they said. According to Army records, Walz’s nearly two and a half decades in the Minnesota Guard began at age 17 and ended with him holding the rank of Command Sergeant Major, the highest possible rank for an enlisted soldier. Like most National Guard soldiers, he was frequently deployed in response to national disasters, but he also was sent overseas to Italy in support of Operation Enduring Freedom, the US mission to Afghanistan that toppled the Taliban in the wake of the September 11 attacks. The campaign spokesperson also pushed back on Vance’s claim that Walz had falsely claimed to have carried arms against the enemy by noting that he never claimed to have seen combat. “The Governor carried, fired and trained others to use weapons of war innumerable times,” they said, including by specializing in heavy artillery to the point of suffering hearing damage as a result of exposure to decades of heavy gun blasts. They added that Walz “would never insult or undermine any American’s service to this country” and said he thanks Vance for having “put his life on the line” by deploying to Iraq as a public affairs specialist with the US Marine Corps. The attacks against the governor appear to be the brainchild of Chris LaCivita, one of the two GOP operatives who run former president Donald Trump’s 2024 campaign. Twenty years ago, he was one of the consultants who orchestrated a smear campaign against John Kerry, then a Massachusetts senator and the Democratic challenger who sought to deny Bush a second term in the White House. The campaign was the work of a GOP group called “Swift Boat Veterans for Truth,” ostensibly made up of Vietnam veterans who served with Kerry, a US Navy veteran who earned a Purple Heart and a Bronze Star while commanding small riverine craft in the Vietnamese jungles. It was 2004, just three years removed from the September 11, 2001 terror attacks, and Kerry was running against Bush — and in opposition to the US-led war in Iraq — by invoking his military service. Opinion polls at the time showed that Americans saw Kerry’s record as a positive and put him ahead of Bush after the party nominating conventions that year. The “Swift Boat Veterans” group responded by airing television ads in which purported veterans who claimed to have served with Kerry criticized him and accused him of being dishonest about his service record. It wasn’t true. Only one of the people in the ad had actually served alongside Kerry, and the claims they made about Kerry’s alleged dishonesty didn’t hold up to independent fact-checking. But the damage was done, and Kerry would go on to lose the 2004 election to Bush. Two decades later, with Trump foundering in the polls against Harris and Walz, LaCivita began telegraphing his intention to dust off his “Swift Boat” playbook just minutes after Walz was announced as Harris’s running-mate. In response to a post on X (formerly Twitter) noting that Walz — a former Command Sergeant Major in the Minnesota guard — was the highest-ranking enlisted soldier to ever serve in the US Congress during his decade in the House of Representatives, LaCivita wrote that the would-be vice president “deserted his men and quit before they went to combat.” A person close to the Harris-Walz campaign told The Independent that the vice president and a host of surrogates plan to push back hard against any attempt to “swift boat” the Minnesota governor and said LaCivita’s playbook “will not work this time.” “It’s a tired, old strategy and the American people are too smart to fall for that, especially from anyone allied with a draft dodger like Donald Trump,” they said. Rick Wilson, a former GOP operative who founded and runs the anti-Trump Lincoln Project super PAC, told The Independent that LaCivita’s decision to go after Walz’s military record is a sign that he’s increasingly desperate and trying to keep from being fired by Trump as the ex-president loses ground to Harris and Walz. “Chris is worried about getting fired right now, so obviously he’s going to do everything and can to play the LaCivita greatest hits album. If Donald Trump wasn’t bunkered down in Mar-a-Lago hiding like a f*****g psychopath, it might be more effective,” Wilson said. He added that the attacks against Walz have “a fat Elvis imitator vibe” from “some guy playing in a casino/gas station 27 miles out of Elko, Nevada.” “Chris and Susie are in real trouble in Trump world, and it’s not getting any better,” he said. LaCivita did not respond to a request for comment from The Independent.","summary":"Attacks on Tim Walz’s military service echo false smears leveled against John Kerry in 2004","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrats-push-back-as-trumpworld-dusts-off-swift-boat-attack-on-walz-b2593010.html","image":"https://static.independent.co.uk/2024/08/07/01/newFile.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/mZjP8sH4-4VHSaSK0.mp4","publish_date":"2024-08-08 00:06:23","author":"Andrew Feinberg","authors":["Andrew Feinberg"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.228},{"id":253624274,"title":"Donald Trump Spox Makes Shock Comment About ‘Smell’ on Harris Plane","text":"TCF vendors Exponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Roq.ad GmbHCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Index Exchange Inc. Cookie duration: 395 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch QuantcastCookie duration: 396 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch BeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Sovrn, Inc.Cookie duration: 365 (days).Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch AdikteevDoesn't use cookies.Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Users’ profiles, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch RTB House S.A.Cookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch The UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Nexxen Inc.Cookie duration: 180 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EpsilonCookie duration: 184 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Yahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch ADventori SASCookie duration: 90 (days).Data collected and processed: Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Triple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Xandr, Inc.Cookie duration: 90 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch NEORY GmbHCookie duration: 90 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Nexxen Group LLCCookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch NEURAL.ONECookie duration: 365 (days).Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch ADITION (Virtual Minds GmbH)Cookie duration: 365 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Active Agent (Virtual Minds GmbH)Cookie duration: 365 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Taboola Europe LimitedCookie duration: 366 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EquativCookie duration: 396 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Adform A/SCookie duration: 3650 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Magnite, Inc. Cookie duration: 365 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch RATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreView details | Storage details | Privacy policylaunch Sift Media, IncDoesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, IP addressesmoreView details | Privacy policylaunch Rakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Lumen Research LimitedDoesn't use cookies.Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, IP addressesmoreView details | Privacy policylaunch Amazon Ad ServerCookie duration: 396 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch OpenXCookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Yieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Roku Advertising ServicesCookie duration: 396 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Nano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction datamoreView details | Privacy policylaunch Simplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: Precise location data, Device identifiers, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch PubMatic, IncCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Comscore B.V.Cookie duration: 720 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch FlashtalkingCookie duration: 730 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreView details | Privacy policylaunch PulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Smaato, Inc.Cookie duration: 21 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Semasio GmbHCookie duration: 366 (days).Data collected and processed: Device identifiers, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Crimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Genius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Criteo SACookie duration: 390 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Adloox SADoesn't use cookies.Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Blis Global LimitedCookie duration: 400 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Lotame Solutions, IncCookie duration: 274 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch LiveRampCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch GroupM UK LimitedCookie duration: 395 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch LoopMe LimitedCookie duration: 90 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Dynata LLCCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Ask LocalaDoesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Privacy choices, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch AziraDoesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch DoubleVerify Inc.​Doesn't use cookies.Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreView details | Privacy policylaunch BIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch IPONWEB GmbHCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch NextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Teads France SASCookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Ströer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch OS Data Solutions GmbH & Co. KGCookie duration: 90 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Permodo GmbHDoesn't use cookies.Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Platform161 B.V.Cookie duration: 396 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Basis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch SMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Bombora Inc.Cookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EASYmedia GmbHCookie duration: 365 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Remerge GmbHDoesn't use cookies.Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch advanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Magnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Delta Projects ABCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreView details | Storage details | Privacy policylaunch usemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: Users’ profiles, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch emetriq GmbHCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Publicis Media GmbHCookie duration: 1825 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch M.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreView details | Storage details | Privacy policylaunch OneTag LimitedCookie duration: 396 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Cloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Smartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Improve DigitalCookie duration: 90 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Adobe Advertising CloudCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device identifiers, Privacy choices, IP addressesmoreView details | Storage details | Privacy policylaunch Bannerflow ABCookie duration: 366 (days).Data collected and processed: Device characteristics, Non-precise location data, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch TabMo SASDoesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Integral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreView details | Privacy policylaunch WizalyCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch WeboramaCookie duration: 393 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Jivox CorporationCookie duration: 30 (days).Data collected and processed: Precise location data, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Vistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policylaunch On Device Research LimitedCookie duration: 30 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, User-provided data, IP addressesmoreView details | Storage details | Privacy policylaunch Rockabox Media LtdDoesn't use cookies.Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, IP addressesmoreView details | Storage details | Privacy policylaunch Exactag GmbHCookie duration: 180 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Celtra Inc.Doesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiers, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch mainADV SrlCookie duration: 30 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, User-provided data, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Gemius SACookie duration: 1825 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch The Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Nielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Solocal SACookie duration: 396 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Pixalate, Inc.Doesn't use cookies.Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, IP addressesmoreView details | Storage details | Privacy policylaunch Oracle AdvertisingCookie duration: 180 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch NumberlyCookie duration: 180 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch AudienceProject A/SCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Demandbase, Inc.Cookie duration: 730 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Effiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Arrivalist Co.Cookie duration: 365 (days).Data collected and processed: Non-precise location data, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Seenthis ABDoesn't use cookies.Data collected and processed: Device characteristics, IP addressesmoreView details | Privacy policylaunch Commanders ActCookie duration: 365 (days).Data collected and processed: Device identifiers, IP addressesmoreView details | Storage details | Privacy policylaunch travel audience GmbHCookie duration: 397 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch HUMANDoesn't use cookies.Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Probabilistic identifiers, IP addressesmoreView details | Privacy policylaunch Adludio Ltd.Doesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiersmoreView details | Privacy policylaunch Blendee srlCookie duration: 366 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Innovid LLCCookie duration: 90 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Papirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policylaunch Neustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Verve Group Europe GmbHDoesn't use cookies.Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Otto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Adobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Localsensor B.V.Doesn't use cookies.Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Privacy choices, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Online SolutionCookie duration: 365 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Relay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, Probabilistic identifiers, IP addressesmoreView details | Storage details | Privacy policylaunch GP One GmbHCookie duration: Uses session cookies.Data collected and processed: Device characteristics, Non-precise location data, Browsing and interaction data, Privacy choices, User-provided data, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch The MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch MindTake Research GmbHCookie duration: 180 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Probabilistic identifiers, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Cint ABCookie duration: 730 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Privacy choices, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Google Advertising ProductsCookie duration: 396 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreUses other forms of storage.View details | Storage details | Privacy policylaunch GfK GmbHCookie duration: 730 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, User-provided data, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch RevJetCookie duration: 730 (days).Data collected and processed: Device identifiers, Non-precise location data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Protected Media LTDDoesn't use cookies.Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Probabilistic identifiers, IP addressesmoreView details | Privacy policylaunch Clinch Labs LTDCookie duration: 730 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Oracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: Non-precise location data, IP addressesmoreView details | Privacy policylaunch Hearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Amazon AdvertisingCookie duration: 396 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Users’ profiles, Privacy choices, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Moloco, Inc.Cookie duration: 730 (days).Data collected and processed: Device characteristics, Device identifiers, Non-precise location data, IP addressesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Adtriba GmbHCookie duration: 730 (days).Data collected and processed: Authentication-derived identifiers, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Objective Partners BVCookie duration: 90 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch EnsightenCookie duration: 1825 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, Privacy choices, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch eBay IncCookie duration: 90 (days).Data collected and processed: Device characteristics, Privacy choices, IP addressesmoreView details | Storage details | Privacy policylaunch MetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Hurra Communications GmbHCookie duration: 366 (days).Data collected and processed: Authentication-derived identifiers, Precise location data, Device characteristics, Device identifiers, Non-precise location data, Browsing and interaction data, Probabilistic identifiers, IP addressesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Ad partners AkamaiPrivacy policylaunch MetaPrivacy policylaunch AunicaPrivacy policylaunch Booking.comPrivacy policylaunch C3 MetricsPrivacy policylaunch IBMPrivacy policylaunch EvidonPrivacy policylaunch AdacadoPrivacy policylaunch intelliAdPrivacy policylaunch DstilleryPrivacy policylaunch MediaMathPrivacy policylaunch ZMSPrivacy policylaunch Omnicom Media GroupPrivacy policylaunch ResonatePrivacy policylaunch SojernPrivacy policylaunch Tradedoubler ABPrivacy policylaunch TrustArcPrivacy policylaunch TruEffectPrivacy policylaunch Travel Data CollectivePrivacy policylaunch advolution.controlPrivacy policylaunch LifeStreetPrivacy policylaunch AdMaximPrivacy policylaunch Batch MediaPrivacy policylaunch Vodafone GmbHPrivacy policylaunch MagnitePrivacy policylaunch ScenestealerPrivacy policylaunch NetquestPrivacy policylaunch Manage.comPrivacy policylaunch CloudflarePrivacy policylaunch Salesforce DMPPrivacy policylaunch NetflixPrivacy policylaunch ebuildersPrivacy policylaunch AppLovin Corp.Privacy policylaunch Fractional MediaPrivacy policylaunch RackspacePrivacy policylaunch LiftoffPrivacy policylaunch MSI-ACIPrivacy policylaunch AdmetricsPrivacy policylaunch NaveggPrivacy policylaunch AdmedoPrivacy policylaunch KochavaPrivacy policylaunch MobitransPrivacy policylaunch ADEXPrivacy policylaunch ImpactPrivacy policylaunch SpotadPrivacy policylaunch AarkiPrivacy policylaunch SFRPrivacy policylaunch CablatoPrivacy policylaunch WaystackPrivacy policylaunch TreSensaPrivacy policylaunch gskinnerPrivacy policylaunch CUBEDPrivacy policylaunch OptomatonPrivacy policylaunch AnalightsPrivacy policylaunch Dentsu Aegis NetworkPrivacy policylaunch DigisegPrivacy policylaunch Haensel AMSPrivacy policylaunch BDSK Handels GmbH & Co. KGPrivacy policylaunch Marketing Science Consulting Group, Inc.Privacy policylaunch DENTSUPrivacy policylaunch KoblerPrivacy policylaunch WidespacePrivacy policylaunch VimeoPrivacy policylaunch","summary":"Marco Bello/ReutersTrump campaign spokesman Steven Cheung rushed to defend J.D. Vance for bizarrely storming Air Force 2 to unsuccessfully confront Kamala Harris Wednesday evening with an unsavory comment regarding the smell of the plane. “Make sure AF2 is deep...","url":"https://nation.lk/online/donald-trump-spox-makes-shock-comment-about-smell-on-harris-plane-273083.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-08 00:00:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":0.241},{"id":253624272,"title":"Biden Gives Chilling Trump Warning in First Interview Since Leaving Race","text":"President Joe Biden said he was “not confident at all” that there would be a peaceful transition of power if former President Donald Trump were to lose the presidential election in November. Biden gave the startling warning during a promotional clip following his first sit-down interview since suspending his reelection campaign on July 21. The full interview with veteran political correspondent Robert Costa will air on CBS News Sunday Morning on August 11. “If Trump wins, no I’m not confident at all,” Biden told Costa, before quickly correcting himself. “I mean, if Trump loses I’m not confident at all. He means what he says, we don’t take him seriously. He means it—all that stuff about ‘if we lose, it will be a bloodbath.’”","summary":"AARON SCHWARTZ/Getty ImagesPresident Joe Biden said he was “not confident at all” that there would be a peaceful transition of power if former President Donald Trump were to lose the presidential election in November.Biden gave the startling warning during...","url":"https://nation.lk/online/biden-gives-chilling-trump-warning-in-first-interview-since-leaving-race-273082.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-08 00:00:03","author":null,"language":"en","source_country":"lk","sentiment":-0.508},{"id":253624192,"title":"Meghan Markle's famous interview 'severed ITV star's friendship with Prince William'","text":"Was Meghan Markle's famous ITV interview the final nail in the coffin for their royal reporter's relationship with Prince William? Correspondent Tom Bradby is the man behind the memorable moment which saw the Duchess of Sussex taken aback when asked if she was OK. It was the same interview in which Prince Harry admitted he and his estranged brother were on \"different paths\". Bradby had been close friends with William and Harry for years, attending both brothers' royal nuptials, as well as being a trusted contact in their phonebooks. Harry called regal reporters \"just an extended PR arm of the Royal Family \" in his documentary on Netflix. But Tom was different, they were good friends. Now it's reported that bond is now gone, from William's perspective anyway. When covering the Sussexes' trip to southern Africa in 2019, it would be the last time he'd hold a close bond with William who reportedly felt 'blindsided' by his interview with Harry and his wife Meghan before they left The Firm. Royal advisors felt his chat took advantage of Harry's \"clear vulnerability\" and Bradby later admitted feeling \"caught in the middle\" of the pair after once behind a close friend with them both. The ITV presenter said it was \"a deeply uncomfortable place to be\". \"The friendship between William and Tom is over. The Prince feels let down by Bradby and the way he has acted over the past few months,\" a source told MailOnline at the time. \"William is a sensitive soul and believes it's in times of crisis when you find out who your true friends are. It would be fair to say Bradby hasn't been one of them,\" they concluded. The royals were not happy with the 'vulnerability' displayed in the interview, it was the first time Meghan was seen expressing those negative emotions on TV before the couple's exit. It's not the only controversy surrounding the couple's relationship with the press. Meghan was reportedly left \"hysterical\" after breaking strict rules Harry had set for her during another interview. Royal expert Tom Bower reveals in his book, Revenge: Meghan, Harry and the War between the Windsors, that when Meghan gave her 2017 interview to Vanity Fair, Harry had specifically asked her not to discuss three particular topics. The interview with journalist Sam Kashner took place two months before Meghan and Harry announced their engagement and was supposed to focus on her role in the popular TV series Suits and her mixed-race heritage. Bower claims Meghan tried to steer the conversation away from her relationship with Harry as per his request. He wrote: \"Kashner arrived at Meghan's home and was told that his interviewee had been given strict instructions by both Harry and Keleigh Thomas Morgan [a publicist at PR firm Sunshine Sachs]. Knowing that Diana and Sarah Ferguson had ruined their reputations in interviews, Harry had asked Meghan to keep quiet about sensitive subjects - Donald Trump, race, their relationship and especially himself. He was not to be mentioned.\" However, despite these precautions, things didn't go as planned when Meghan appeared on the magazine cover with the headline \"She's Just Wild About Harry.\" Bower added how Meghan was left in tears after seeing the piece, and \"within hours, Meghan called Ken Sunshine [founder of Sunshine Sachs Consultants] and Keleigh Thomas Morgan.\" He added: \"Hysterically, she described Buckingham Palace's fury at 'Wild About Harry'. Sunshine Sachs said Meghan should have ensured that her comments about Harry were removed. Why wasn't the focus on her philanthropy and activism?\" Follow Mirror Celebs on TikTok , Snapchat , Instagram , Twitter , Facebook , YouTube and Threads .","summary":"ITV's royal reporter Tom Bradby famously asked Meghan Markle is she was doing OK as Prince Harry admitted he and his brother Prince William were on 'different paths'","url":"https://www.mirror.co.uk/3am/celebrity-news/meghan-markles-famous-interview-severed-33415881","image":"https://i2-prod.mirror.co.uk/incoming/article33415892.ece/ALTERNATES/s1200/0_Harry-Meghan-An-African-Journey.jpg","video":null,"publish_date":"2024-08-08 00:00:00","author":"Harry Rutter","authors":["Harry Rutter"],"language":"en","catgory":"entertainment","source_country":"gb","sentiment":0.131},{"id":253624108,"title":"Biden \"not confident\" of peaceful transfer of power if Trump loses in November","text":"Biden \"not confident\" of peaceful transfer of power if Trump loses in November In an interview with CBS News' Robert Costa, President Biden said he is \"not confident\" there will be a peaceful transfer of power if former President Donald Trump were to lose the upcoming general election. The full interview will air on \"CBS News Sunday Morning\" on Sunday, Aug. 11.","summary":"In an interview with CBS News' Robert Costa, President Biden said he is \"not confident\" there will be a peaceful transfer of power if former President Donald Trump were to lose the upcoming general election. The full interview will air on \"CBS News Sunday Morning\" on Sunday, Aug. 11.","url":"https://www.cbsnews.com/video/biden-not-confident-of-peaceful-transfer-of-power-if-trump-loses-in-november/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/07/753edcbc-b82d-433a-9af0-2be6afad3d48/thumbnail/1200x630/66b7c8fa8cc84c4cb9b90c0e441a6ae9/0807-en-costa.jpg?v=0a0c17d349635d55704afd4e16e28fc6","video":null,"publish_date":"2024-08-07 23:59:00","author":null,"language":"en","source_country":"US","sentiment":-0.141},{"id":253623752,"title":"Kamala Harris’ Campaign Offers Second Rally with Free Concert in Wisconsin to Attract Attendees","text":"Is there anything about Kamala Harris and her presidential campaign that is… you know… genuine? OK, we already know the answer to that; there is very little about Harris that is genuine other than her word salads and her grating laugh; her running mate Tim Walz is no better. And while campaign events are frequently, as Ed Sullivan would have put it, a “really big show,” with opening acts and so on, it sure seems like Kamala Harris can’t fill up a broom closet, much less a major venue, without some kind of draw – because the people sure don’t seem to be coming out to see her. In the latest such instance, in Eau Claire, Wisconsin, she held a rally and her campaign ballyhooed the line of people waiting to get in. Here’s the catch: They were waiting to get in to see a local celebrity musician, one Bon Iver, who gave a free concert as an in-kind campaign contribution (which I am sure will be properly reported as such – right? Right?): OMG! The Kamala Harris Rally Line in Eau Claire, Wisconsin is soooo long!What’s not being reported is that they got Bon Iver, who is a local from Eau Claire, Wisconsin, a Grammy-Award winning music artist to perform at the rally.So basically, it’s another free concert..… pic.twitter.com/wRui7ELdkw— MJTruthUltra (@MJTruthUltra) August 7, 2024 Yeah, another free show – and another instance in which the folks walk out when the band is done? My friend and colleague Brandon Morse described another such event on Wednesday, July 31st: Brandon wrote: Moreover, when she was done and Harris took the stage, people began leaving. — John Basham (@JohnBasham) July 31, 2024 Now on that last bit – as far as leaving when Harris took the stage; I can’t blame the folks for that. Indeed, it shows uncommon good sense, especially for Democrats, to bail the heck out on an appearance by the Queen of Word Salads. But the non-genuine image-mongering just gets more and more – and I hate using this word, but it’s just so apt – cringe. There’s just nothing genuine about any of this. Whatever one thinks of Donald Trump, there can be no doubt that the man can fill a venue, or that he knows how to fire up a crowd; I saw him speak at CPAC last February, and the excitement in the room was palpable; I admit that I got caught up in it myself. While he has performers at his rallies from time to time, there is no doubt that Donald Trump is the main attraction, and people are lining up to see Trump – not “Megan Thee Stallion.” (Shouldn’t that really be “Megan Thee Mare?) And I think that’s a big part of the man’s appeal. There’s no shilly-shallying, no pretense; what you see is what you get. Is it really surprising, though, that so many lefties are taken in by this outpouring of astroturf? We could always ask Bob Hope.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIs there anything about Kamala Harris and her presidential campaign that is&#8230;&#8230;\n\n\nThis Post: Kamala Harris&#8217; Campaign Offers Second Rally with Free Concert in Wisconsin to Attract Attendees first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/kamala-harris-campaign-offers-second-rally-with-free-concert-in-wisconsin-to-attract-attendees/","image":"https://media.townhall.com/cdn/hodl/2024/214/0b80bf61-8f52-4f6a-b78a-24153303b961.jpg","video":null,"publish_date":"2024-08-07 23:49:34","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.158},{"id":253625042,"title":"Biden ‘not confident’ in peaceful transfer of power if Trump loses in November","text":"President Joe Biden doesn’t believe there will be a peaceful transfer of power if former President Donald Trump loses the election. In an excerpt of a CBS interview set to air Sunday, reporter Robert Costa asked Biden if he was confident there would be a peaceful transfer of power in January 2025. “If Trump loses, I’m not confident at all,” Biden told Costa after first mistakenly saying, “If Trump wins.” During the first presidential debate in June, Trump said he would “absolutely” accept the results “if it’s a fair and legal and good election.” Biden said he’s worried about comments Trump has made about fears Democrats will rig the election against Republicans. “He means what he says. We ought to take him seriously; he means it. All this stuff about ‘If we lose, it’ll be a bloodbath, stuff will happen, there will be a stolen election,’” Biden said. “Look at what they’re trying to do now in the local elections where people count the votes. Electors are putting people in place in states where they’re going to count the votes, right?” Trump made the “bloodbath comments” during a campaign appearance in Ohio earlier this spring. As he mourned the decline of U.S. auto manufacturing to China, the GOP leader told rally attendees he would put a “100% tariff on every car” China sells Americans and said Beijing wouldn’t “be able to sell those cars if I get elected.” “Now if I don’t get elected, it’s going to be a bloodbath for the whole … it’s going to be a blood bath for the country,” Trump told Ohioans. The GOP leader has claimed Democrats took his blood bath comments out of context. Later in March, Trump railed against “the Fake News Media, and their Democrat Partners” in a post to Truth Social, saying that they “pretended to be shocked at my use of the word BLOODBATH, even though they fully understood that I was simply referring to imports allowed by Crooked Joe Biden, which are killing the automobile industry.”","summary":"President Joe Biden doesn’t believe there will be a peaceful transfer of power if former President Donald Trump loses the election. In an excerpt of a CBS interview set to air Sunday, reporter Robert Costa asked Biden if he was confident there would be a peaceful transfer of power in January 2025. “If Trump loses, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3114599/biden-not-confident-peaceful-transfer-power-trump-loses-november/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Biden.-.webp","video":null,"publish_date":"2024-08-07 23:36:54","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.603},{"id":253623578,"title":"Biden ‘not confident’ of peaceful power transition if Trump loses","text":"WASHINGTON >> President Joe Biden said on Wednesday he was not confident about a peaceful transfer of power in the United States if Republican Donald Trump loses the Nov. 5 presidential election. “If Trump loses, I’m not confident at all,” Biden said in an interview with CBS News when asked whether he thought there would be a peaceful transfer of power after the vote. “He means what he says. We don’t take him seriously. He means it. All this stuff about if we lose there’d be a bloodbath,” Biden added. During a March campaign appearance in Ohio, Trump warned of a “bloodbath” if he fails to win the election. At the time Trump was discussing the need to protect the U.S. auto industry from overseas competition, and Trump later said he was referring to the auto industry when he used the term. Trump has falsely claimed he won the 2020 election against Biden and was criminally charged in Washington, D.C., and Georgia with illegally trying to overturn the results. Biden dropped out of the campaign last month after fellow Democrats called for him to step aside following a poor debate performance against Trump that raised questions about the Democratic president’s age and health. Biden’s vice president, Kamala Harris, has since captured the Democratic nomination and is running against Trump.","summary":"WASHINGTON >> President Joe Biden said on Wednesday he was not confident about a peaceful transfer of power in the United States if Republican Donald Trump loses the Nov. 5 presidential election.","url":"https://www.staradvertiser.com/2024/08/07/breaking-news/biden-not-confident-of-peaceful-power-transition-if-trump-loses/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-07T220048Z_97975267_RC2H59AUMOSE_RTRMADP_3_USA-ELECTION-BIDEN.JPG","video":null,"publish_date":"2024-08-07 23:33:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.591},{"id":253623186,"title":"US House speaker campaigns for Theriault at Auburn Mall","text":"AUBURN — U.S. House Speaker Mike Johnson told a crowd Wednesday at the Auburn Mall that Maine’s 2nd District congressional race “will decide the fate of our freedom.” “We’re going to flip this seat,” said Johnson, a Louisiana Republican who’s on a national tour of districts the GOP hopes to win in November. Johnson said the road to a continued Republican majority runs through Maine. Held since 2018 by U.S. Rep. Jared Golden, a Lewiston Democrat, the sprawling and rural district is widely considered one of the most likely to swing to the GOP because it has backed Donald Trump for president twice already. The 42-year-old Golden, though, has proven the least loyal member of his party in the House during the past two years. He easily fended off challengers in 2020 and 2022. This time around, 30-year-old Austin Theriault of Fort Kent, a first-term state representative, is angling to snatch the seat back for the Republicans, who held it from 2014 to 2018. “The future of our country literally runs through us being successful” in knocking “flip flopper Jared Golden” out of office, Theriault told the cheering crowd. The message resonated with many of the more than 400 people who packed into a former store to hear from party leaders as they formally opened what they called a “battle station” intended to serve as headquarters for a big get-out-the-vote push. “We need new blood,” said Rachel Trainer of Mount Vernon, one of the first Republicans to arrive. “He’s young. He’s enthusiastic.” Golden’s campaign took aim at the Republicans. “Austin Theriault was hand-picked by GOP insiders like Mike Johnson because they know he’ll rubber stamp their harmful, extreme agenda,” a Wednesday press release from Golden said. “Now he’s kissed the ring.” The Democrat’s campaign said that “Mainers need independent leadership in Congress. Austin Theriault is just another follower.” The Maine Democratic Party said Theriault “is being bought and paid for by national GOP special interests including Mike Johnson’s leadership PAC. Washington Republicans know that Austin will walk the party line and be a rubber stamp for their policies.” Theriault, said Democrats, “will bow down to Party bosses and special interest groups” and adopt a Republican agenda that will “hurt Maine workers and families, including their extreme anti-choice agenda to ban abortion nationwide.” Theriault said, however, that he’s in the race to represent people who feel forgotten and left behind. “Too many people have forgotten what it’s like to struggle in rural America,” Theriault said. Theriault incorrectly said the nation is facing record inflation and gasoline prices — it is far from either record — and has a government that “is always in the way of progress.” “Austin is fantastic,” said Johnson. He called him “the model for all of us right now.” Pointing to Theriault’s record as a race car driver for a decade when he lived in North Carolina, Johnson said, “A NASCAR driver? We get the cool guys.” He hailed the many Republicans who showed up for the event, insisting it drew the biggest crowd any of the three-dozen other battle station openings had achieved. Looking at the packed headquarters across from a bookstore inside the mall, Johnson called it “the best use of a shoe store” he’d ever seen. Johnson, a Louisiana lawyer first elected to Congress in 2016, has served as House speaker for 10 months. He took the job after a conservative rebellion ousted Speaker Kevin McCarthy, a California Republican. Golden helped Johnson stave off a bid in May to remove him as speaker for pushing through military aid to Ukraine, Israel and Taiwan. At the time, Golden said that “McCarthy was an untrustworthy leader” but Johnson didn’t deserve ouster “for doing the right thing.” Besides, he said, “removing the Speaker would mean weeks or months of time lost to a chaotic House GOP infighting” that should be spent on issues reducing “illegal crossings” of the U.S. border, fighting fentanyl importation, improving internet access and fighting corruption. “Our politics are broken enough,” Golden said. “I will not vote for more chaos or to waste the precious time we have left to do the people’s work.” In his speech, Johnson never mentioned Golden by name or took issue with him on any positions. He focused instead on the necessity of winning Republican races and maintaining control of the House. “I’m an ambassador of hope,” Johnson said. “We are going to win.”","summary":"Mike Johnson touts Republican congressional hopeful Austin Theriault, who seeks the 2nd Congressional District seat held by U.S. Rep. Jared Golden.","url":"https://www.centralmaine.com/2024/08/07/us-house-speaker-campaigns-for-theriault-at-auburn-mall/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2024/08/39266714_SJ.CITjohnsonvisit.080806-1723073407.jpg?w=1024","video":null,"publish_date":"2024-08-07 23:29:13","author":"Steve Collins","authors":["Steve Collins"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.037},{"id":253622956,"title":"Tim Walz’s lies about his service embody his leadership failures and Kamala  Harris’","text":"It took less than a day for Tim Walz to start unraveling: It turns out Kamala Harris’ running mate lied for years about leaving the National Guard with the high rank of Command Sgt. Major. In fact, he was demoted after bugging out when his unit was called up to serve in Iraq in 2005. That’s the opposite of real leadership, and all too fitting for the Harris-Walz ticket. He “slithered out the door,” charge two of his former Guard colleagues, Command Sgts. Major Thomas Behrends and Paul Herr (both now retired), leaving the unit “hanging without its senior Non-Commissioned Officer, as the battalion prepared for war.” Yes, Walz had every legal right to leave when he did, after two decades of peacetime service, but countless other Guardsmen (and reservists) didn’t bow out when the call came. More: Despite multiple claims to the contrary over the years, Walz never served in combat. Yet he keeps mocking his GOP counterpart, J.D. Vance — who did come under fire as a Marine in Iraq. Kudos to Vance for trying to confront Walz and Kamala Harris on a Wisconsin tarmac Wednesday — and for needling his opponents and the press over Harris’ teleprompter-only record since moving to the top of the Democratic ticket. “I also thought you guys might get lonely because the vice president doesn’t answer questions from reporters and hasn’t for 17 days,” he told the traveling campaign reporters. And: “Have they given you guys an explanation for why she won’t take questions from reporters?” That gets directly to Harris’ leadership failures: No one can point to anything she’s achieved as vice president, especially in her role as “border czar.” Nor has she outlined any ways in which she’ll break with Joe Biden’s disastrous policies on the economy or the border — the voters’ top two issues. Heck, she still has to fill in any policies on her campaign website. And four-minute off-the-record “gaggles” on Air Force Two don’t count. Meanwhile, Vance and Donald Trump take questions regularly. They’re not afraid to face the press and Trump has never failed to confront a challenge facing the nation. The Harris strategy seems to be to coast to Election Day on not being Biden, hoping the voters keep treating her as a fresh face — the only two factors that explain how she’s narrowed the Trump-Vance lead in the polls. With the national media largely in the tank, this may buy her another week or two, but the voters aren’t that stupid. Walz isn’t getting away with lying about his service, and Harris won’t get away with hiding forever from live interviews and tough questions. Americans recognize leadership — and its opposite.","summary":"It took less than a day for Tim Walz to start unraveling: It turns out Kamala Harris’ running mate lied for years about leaving the National Guard with the high rank of Command Sgt. Major.","url":"https://nypost.com/2024/08/07/opinion/tim-walzs-lies-about-his-service-embody-his-leadership-failures-and-kamala-harris/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-uyguuubbt-1723072548766.jpg?quality=75&strip=all&1723058199&w=1200","video":null,"publish_date":"2024-08-07 23:26:37","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.485},{"id":253622954,"title":"NY Jewish leaders blast ‘ugly, antisemitic campaign’ against Josh Shapiro in veepstakes","text":"Jewish leaders in New York fumed that Josh Shapiro was “vilified” in an “ugly, antisemitic campaign” as Vice President Kamala Harris whittled down her veep contenders — ultimately passing over the Pennsylvania governor in favor of Minnesota Gov. Tim Walz. Shapiro, who is Jewish, faced more scrutiny and criticism than other contenders because he’s pro-Israel, they claimed. “No one should dismiss that Gov. Shapiro was subjected to an ugly, antisemitic campaign to delegitimize him,” said Mark Treyger, CEO of the Jewish Community Relations Council of New York and a former Brooklyn councilman. “No one should take the Jewish community’s vote for granted.” Treyger, the son of Ukrainian Jewish refugees and grandson of Holocaust survivors, said Shapiro was unfairly targeted because of his stance. “There was not much daylight between Josh Shapiro and the other contenders on policy. But he was singled out, he was vilified,” Treyger said. Maury Litwack, the founder and CEO of the Teach Coalition, a group that works with Jewish voters, noted, “You can be excited about the Walz pick but also be sad that an outright antisemitic campaign was waged against Shapiro.” Leftist Democrats and Israel critics labeled Shapiro “genocide Josh” for his support of Israel amid the war with Hamas in Gaza. The left-leaning magazine Jacobin even railed in a headline, “Josh Shapiro’s Palestine Record Should Disqualify Him as VP.” Rabbi Joseph Potasnik, executive vice president of the New York Board of Rabbis, said the chatter about Shapiro’s viability as a vice presidential candidate was “poor commentary.” “The fact that some people are talking about whether a proud Jewish, pro-Israel candidate can be on the ticket is very disheartening,” he said. The Harris campaign said her selection of Walz was not a knock on Shapiro and denied that his Jewish identity was a factor in the decision. Harris’ husband, Doug Emhoff, is Jewish. Rep. Dan Goldman (D-Manhattan/Brooklyn) slammed “the public antisemitic campaign from some within the Democratic Party” against Shapiro as “unacceptable and regrettable” — but was persuaded by Harris’ campaign that it did not influence her VP pick. Pro-Israel Republicans, including Jewish politicians, sought to turn Shapiro’s rejection into a campaign issue. “Antisemitism is un-American. Not picking Gov Shapiro because he is observant Jewish is wrong,” said Nassau County Executive Bruce Blakeman, who is also Jewish. “If Harris’ boycott of Prime Minister Netanyahu’s address before Congress left doubts about Harris’ contempt for Jews and Israel, the dismissal of Governor Shapiro from Vice Presidential consideration should eviscerate those doubts. Shame on Kamala Harris for bending to the extreme anti-Semitic forces in her Party,” he said. But New York State Democratic Party chairman Jay Jacobs accused Republicans of engaging in “gutter politics.” “That the Vice President did not select a qualified, excellent Governor from the state of Pennsylvania, who is an observant Jew, but chose someone else who is not, does not justify the conclusion that it was BECAUSE of his religion,” said Jacobs, who is Jewish. “Does Donald Trump’s decision to skip over Tim Scott, a black Republican when selecting J.D. Vance as his VP nominee mean that Trump is a bigot or that he was ‘caving in’ to the growing bigotry in the Republican Party? Nonsense!”","summary":"Shapiro, who is Jewish, faced more scrutiny and criticism than other contenders because he's pro-Israel, they claimed.","url":"https://nypost.com/2024/08/07/us-news/ny-jewish-leaders-say-josh-shapiro-was-vilified-in-veepstakes/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87280800.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/F01ZpC15-RyIcpnTz.mp4","publish_date":"2024-08-07 23:22:13","author":"Carl Campanile","authors":["Carl Campanile"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.476},{"id":253622876,"title":"Harris and Walz trade fire with Trump running mate Vance at dueling events in Blue Wall states battle","text":"EAU CLAIRE, WI - Speaking in front of a sea of supporters in rural Wisconsin, Vice President Kamala Harris on Wednesday declared that \"the path to the White House wins right through this state and with your help, we will win in November.\" Wisconsin is part of the so-called blue wall of states - along with neighboring Michigan as well as Pennsylvania - that the Democrats reliably won in presidential elections for nearly a quarter-century before former President Donald Trump narrowly carried them in capturing the White House eight years ago. But in 2020, President Biden won back all three states with razor-thin margins as he defeated Trump, and the states remain extremely competitive as Harris and Trump face off in the 2024 presidential election. So it was no surprise that Harris held her first rally with Minnesota Gov. Tim Walz - her newly named running mate - in Pennsylvania on Tuesday, with stops Wednesday in Wisconsin and Michigan. And staying in close proximity was Trump's running mate, Sen. JD Vance of Ohio. KAMALA HARRIS AND HER NEWLY NAMED RUNNING MATE KICK OFF A BATTLEGROUND STATE SWING Walz took aim at Trump at Wednesday afternoon's rally, charging that the former President \"sees the world differently than we see it. He has no understanding of service. Because he's too busy serving himself again and again and again.\" \"This guy weakens our country to strengthen his own hands. He mocks our laws. He sows chaos and division amongst the people. And that's to say nothing of the job he did as president,\" Walz argued. Hours earlier, Trump – in an interview on \"Fox and Friends\" – belittled the naming to the Democrats' ticket of Walz, a former high school teacher and football coach turned Democratic congressman in a red district before winning election and re-election as governor. VICE PRESIDENT HARRIS NAMES MINNESOTA GOV TIM WALZ AS HER RUNNING MATE \"I could not be more thrilled,\" Trump said when asked about the announcement from Harris on Tuesday that she chose Walz as her running mate, after also seriously considering Pennsylvania Gov. Josh Shapiro and Sen. Mark Kelly of Arizona. \"I was shocked when, when it came down to the final two, that she didn't pick Shapiro. I was very surprised,\" Trump said. But the naming of a running mate has been lucrative for the Harris campaign, which highlighted that it had hauled in $36 million in fundraising in the 24 hours since the Walz announcement. At the rally, which the Harris campaign said attracted a crowd of over 12,000 people to a festival field amid farmland outside this small northwest Wisconsin city, Walz once again argued that Trump and Vance \"are creepy and weird as hell.\" Vance, at a campaign event miles away, pushed back on the \"weird\" label, saying that he and Trump are \"normal guys who want to make this country great.\" In a viral moment, Vance appeared to try and troll the vice president, as he approached Air Force Two at Chippewa Valley Regional Airport, where the senator's campaign plane was also parked. CLICK HERE TO GET THE FOX NEWS APP \"I figured that I would come by and get a good look at the plane because hopefully it’s going to be my plane in a few months,\" Vance said in front of Air Force Two. And once again pointing out that Harris has yet to sit for a major interview or hold a press conference in the two and a half weeks since she replaced President Biden at the top of the Democrats' national ticket, Vance told reporters \"I also thought you guys may get lonely, because the VP doesn’t answer questions from reporters.\" Biden dropped his re-election bid on July 21, after a disastrous debate performance against Trump in late June prompted increased questions over whether the 81-year-old president had the physical and mental abilities to serve another four years in the White House. It also sparked a rising chorus of calls from fellow Democrats for Biden to end his re-election bid. Harris didn't mention her boss at a large rally in Atlanta last week, nor did she or Walz reference the president at their rally Tuesday night in Philadelphia. But Harris, in her sixth visit to Wisconsin so far this year, praised the president at the top of her comments. \"I want to bring greetings from our incredible president, Joe Biden,\" Harris said. \"He loves Wisconsin, and I know we are all deeply grateful for his lifetime of service to our nation and for all he continues to do.\" After the crowd broke out in a chant of \"Thank you, Joe! Thank you, Joe!,\" the vice president responded \"that's right. I’m gonna tell him what you said.\" Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Kamala Harris and Tim Walz hold a large rally in battleground Wisconsin at the same time that Trump running mate JD held a dueling event just miles away","url":"https://www.foxnews.com/politics/harris-walz-trade-fire-trump-running-mate-vance-dueling-events-blue-wall-states-battle","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Kamala-Harris-Tim-Walz-Eau-Claire-WI-August-7-2024-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-07 23:16:36","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","source_country":"US","sentiment":-0.271},{"id":253625744,"title":"CISA Director Says Election Officials Are Ready for Challenges","text":"Things will go wrong and mistakes will be made when Americans head to the polls in November, but that doesn't mean the election is insecure, the head of the Cybersecurity and Infrastructure Security Agency said Wednesday. CISA Director Jen Easterly said US elections are incredibly complex, with an estimated 150 million voters expected to head to the polls on Nov. 5. And it's inevitable that there will be problems, whether it's a poll worker forgetting her key, a big storm or even a cyber attack. But while those problems will be disruptive, they won't affect the security and integrity of the vote casting and counting process, despite what America's foreign adversaries will claim in attempts to undermine it, she said. \"We should expect that, we should prepare for it, and Americans should not allow that,\" Easterly said. \"It's really up to all of us to preserve democracy.\" Easterly made the comments during the opening keynote panel of the Black Hat conference in Las Vegas. The annual event brings together thousands of hackers and other security officials from around the world. Read more: How Artificial Intelligence Could Power Election Disinformation Election security has been a major topic for the past two presidential elections. Much was made during the 2016 election about the possibility that a foreign government, such as Russia's, could \"hack\" the election, either changing results and winners without anyone knowing or changing them to be so obviously improbable that it would destroy trust in the system. But little evidence of meddling was found, and over the next four years many states shored up their systems and replaced the kinds of voting technology that experts were worried about. There were worries about potential hacking ahead of the 2020 election, but officials found no evidence of any kind of widespread election fraud. Chris Krebs, then the director of the Cybersecurity and Infrastructure Security Agency, the federal agency charged with protecting the nation's critical infrastructure from cyberthreats, declared the 2020 vote the \"most secure election\" in American history. But that didn't stop former President Donald Trump from claiming that it wasn't. To this day, he and many of his supporters continue to falsely claim that the 2020 election was fixed despite the absence of any evidence. Easterly and the other panelists, who included Hans de Vries, chief cybersecurity and operations officer at the European Union's Agency for Cybersecurity, and Felicity Oswald, who leads the United Kingdom's National Cyber Security Centre, didn't mention Trump during the event, instead focusing on external nation-state threats. Regardless of whether the US is attacked by technological means or by disinformation operations, Easterly said state and local elections officials will be ready. By their nature, she says, they're extremely capable of handling whatever crisis they may face. And CISA has been doing its part to help them. Since the beginning of the current election cycle, Easterly says her agency has conducted hundreds of physical and cybersecurity assessments, table-top exercises, and training events with state and local officials -- all with the goal of reducing the risks posed by any kind of potential attack. If anyone still has concerns about election security, Easterly encouraged them to reach out to their local elections officials for more information, or better yet, sign up to be a poll worker and get a first-hand look at the process. And if what you're hearing about an election doesn't match up with what your local election officials tell you, \"then it's probably just noise\" she said.","summary":"Officials have undergone hundreds of training exercises and assessments ahead of the election.","url":"https://www.cnet.com/news/politics/cisa-director-says-election-officials-are-ready-for-challenges/","image":"https://www.cnet.com/a/img/resize/7a27bb53072bda23dffcb74fd60cc996defb4fab/hub/2024/08/07/b87655d9-de34-44eb-8a41-2d6468ec146d/img-8299.jpg?auto=webp&fit=crop&height=675&width=1200","video":null,"publish_date":"2024-08-07 23:16:00","author":"Bree Fowler","authors":["Bree Fowler"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.436},{"id":253622688,"title":"in 2020, Trump ‘fully’ agreed with Walz’s handling of Floyd protests","text":"By Alayna Treene, Michael Williams and Kristen Holmes | CNN (CNN) — Republicans are attacking Tim Walz’s response to unrest in Minneapolis in 2020, but at the time, then-President Donald Trump said he “fully” agreed with how the Minnesota governor handled rioting in the aftermath of George Floyd’s murder, undercutting a key line of GOP attack this week after Walz was named Vice President Kamala Harris’ 2024 running mate. “I fully agree with the way he handled it the last couple of days,” Trump said of Walz on a June 1, 2020, call during which he also described the Democratic governor as “an excellent guy.” The call was led by Trump, who was joined by then-Attorney General Bill Barr, then-Chairman of the Joint Chiefs of Staff Mark Milley and then-Defense Secretary Mark Esper, and included a series of governors as protests across the country, some of which devolved into violent rioting, were breaking out following the police killing of Floyd on May 25. Details from the call, during which Trump implored governors across the country to “dominate” protesters, have previously been reported, and CNN published the call’s full transcript the day it happened in 2020. It’s not uncommon for even the most bitter of political rivals to offer tempered praise toward one another in the aftermath of a natural disaster or serious nationwide crisis – especially ones that require cooperation in responses between state and federal governments. But more than four years later, Trump’s praise for Walz takes on new meaning as the GOP nominee and his allies have sought to jolt Americans’ memories of the nationwide unrest that summer, linking Walz to pictures of Minneapolis engulfed in flames and the aftermath of the destruction. “You’ve got a big National Guard out there that’s ready to come in and fight like hell. I tell you, what they did in Minneapolis was incredible. They went in and dominated. And it happened immediately,” Trump told the governors. “Tim Walz. Again, I was very happy with the last couple of days. Tim, you called up big numbers and the big numbers knocked them out so fast it was like bowling pins.” The call took place a week after Floyd was killed. At the time, and in the years since, Republicans publicly criticized Walz over whether he waited too long to call in Minnesota’s National Guard. Trump’s 2024 campaign, responding to CNN’s request about his 2020 praise for Walz and the details of the call, said that he was only complimentary of the Minnesota governor given that by June 1, Walz “had acted.” They argued, however, that Trump had always been frustrated that Walz hadn’t taken more action sooner. Walz first activated the Guard on May 28, three days after Floyd was killed, and the same day protesters lit the outside of the Minneapolis Police Department’s Third Precinct on fire. “The important thing here is the timing and context for these remarks. He was complimenting a governor that finally, after days of madness, had finally done something. So it wasn’t in real time. It was after Walz finally did something about it,” a senior Trump campaign adviser told CNN. A second Trump adviser reiterated the point, telling CNN the call came “in the context of what President Trump encouraged a lot of these governors and local leaders to do, in finally stopping or doing something about these riots. It had been seven days, or however long, days that Minneapolis had been burning, where President Trump, is essentially saying, finally, you guys, finally, the burning and looting and rioting have stopped.” Allies close to Trump echoed the adviser’s sentiment, noting the panic among government officials at the time on how to curb the riots, and the urgency to reach across the aisle to stop the violence. During the 2020 call, Walz also offered some words of thanks for the Trump administration’s response, thanking Esper for his “strategic guidance.” He also asked the Trump administration to help with messaging surrounding the role of National Guard troops. But in the hours after Walz was announced as Democrats’ vice presidential candidate on Monday, Republicans attacked his tenure as governor — with much of the criticism focused on the timing of his decision to call in his state’s National Guard. Trump’s running mate, Ohio Sen. JD Vance, told reporters earlier this week that Walz “allowed rioters to burn down Minneapolis in the summer of 2020.” Walz “sat by and let Minneapolis burn,” Florida Gov. Ron DeSantis wrote on X. Texas Gov. Greg Abbott echoed that accusation. Arkansas Sen. Tom Cotton said Walz “could have stopped” the rioting, “if he wanted to,” while the Republican Party’s research arm accused Walz of fleeing “like a coward” while Minneapolis burned. A spokesperson for Cotton’s Senate campaign said Walz “should have immediately sent in the Guard, the state police, and restored order instead of letting violent criminals destroy a huge portion of the city, before they were bailed out of jail by Kamala Harris,” alluding to a tweet Harris posted in support of a Minnesota bail fund. “As Tim Walz has admitted, his handling of the riots was an ‘abject failure,’” Cotton’s spokesperson said, referencing remarks the governor made about the city’s response to the riots. Spokespeople for Abbott and DeSantis did not immediately respond to a request for comment Wednesday afternoon. Even before Harris selected Walz, Trump criticized the governor on the subject. “Every voter in Minnesota needs to know that when the violent mobs of anarchists and looters and Marxists came to burn down Minneapolis four years ago … Remember me? I couldn’t get your governor to act,” Trump told the crowd at his rally in St. Cloud, Minnesota, last month, before falsely claiming that he, not Walz, activated the National Guard in response to the unrest. “I sent in the National Guard to save Minneapolis, while Kamala Harris sided with the arsonist and rioters and raised money to bail out the criminals,” Trump said. Walz, who first activated the Guard after peaceful protests had devolved into instances of rioting, looting and violence, said in 2020 he did so in response to requests from the mayors of Minneapolis and St. Paul. During the June 2020 call, Trump said he had directed Walz to call in the National Guard, before lauding the way the officers performed. “I said you gotta use the National Guard,” Trump said, referring to Minneapolis. “They didn’t at first, then they did, and I’ll tell you that’s true, I don’t know what it was … those guys, third night, fourth night, they walked through that stuff like it was butter. They walked right through and you haven’t had any problems since.” The governor faced some bipartisan criticism for the timing of his order to activate the Guard. Minneapolis Mayor Jacob Frey, a Democrat who was facing scrutiny over chaos in his city, said in August 2020 that he had verbally asked Walz on the evening of May 27 to send in the Guard but that the governor hesitated. Walz refuted Frey’s account at the time, saying the ask did not constitute an official request, which he said came the next day. (Any tension between the two seems to have cooled.) Some of the most notable instances of violence in Minneapolis, including the ransacking and burning of a city police precinct, took place the night of May 28 – after Walz had already activated a portion of the Guard. Walz and Trump spoke the same day. The governor activated the entire guard on May 30. In the June 1 call with Walz and the other governors, Trump seemed to acknowledge that he was satisfied with how the state Guard responded to the protests: “Yesterday and the day before, compared to the first few days, was just – never seen anything like it,” Trump said. Walz responded: “Absolutely.” Trump said he believed that was a good idea, though he added he thought “that the people wouldn’t have minded an occupying force.” “I wish they had an occupying force in there,” Trump added. Later that day, federal law enforcement would forcibly clear peaceful protesters from a park outside the White House, making way for Trump to cross the park and pose for a photo op with a Bible outside St. John’s Church.","summary":"“I fully agree with the way he handled it the last couple of days,” Trump said of Walz on a June 1, 2020, call during which he also described the Democratic governor as “an excellent guy.”","url":"https://www.mercurynews.com/2024/08/07/in-2020-trump-fully-agreed-with-walzs-handling-of-floyd-protests/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/sjm-6231891.jpg?w=1024","video":null,"publish_date":"2024-08-07 23:13:28","author":"Cnn.com Wire Service","authors":["Cnn.com Wire Service"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.136},{"id":253625814,"title":"Rapper Nelly is arrested for suspected drug possession at St. Louis-area casino","text":"CTVNews.ca Top Stories Two Flair passengers in B.C. were told a bird strike cancelled their flight. Then they did their own research Flair Airlines was ordered to compensate two passengers after a B.C. tribunal found there was no evidence a bird strike actually caused a flight cancellation. Crew of Titan sub knew they were going to die before implosion, according to more than US$50M lawsuit The family of a French explorer who died in a submersible implosion has filed a more than US$50 million lawsuit, saying the crew experienced 'terror and mental anguish' before the disaster and accusing the sub's operator of gross negligence. Organizers cancel Taylor Swift concerts in Vienna over fears of an attack Organizers of three Taylor Swift concerts in Vienna this week called them off on Wednesday after officials announced arrests over an apparent plot to launch an attack on an event in the Vienna area such as the concerts. What we know about a fatal shooting by armed suspects east of Calgary The man shot and killed by two armed suspects east of Calgary on Tuesday is believed to be an employee of Rocky View County, where the incident occurred. Two former NHLers charged in world junior sexual assault case sign with KHL teams Two of the five former Team Canada world junior hockey players awaiting trial for an alleged group sexual assault in 2018 have signed contracts with teams in the Kontinental Hockey League (KHL), according to the league. Harris and Walz say they're 'joyful warriors,' narrowly miss tarmac confrontation with Vance U.S. Vice-President Kamala Harris and Minnesota Gov. Tim Walz got an idea of just how hotly contested the Midwest will be when they overlapped on a Wisconsin tarmac with Republican vice-presidential nominee JD Vance. Plant-based beverages linked to listeria recall were produced in Pickering, Ont.: officials The plant-based milk beverages recalled due to a listeria outbreak that killed two people and hospitalized 13 others were produced in the Greater Toronto Area, health officials say. Regatta a 'go,' bringing thousands to Quidi Vidi Lake in St. John's Mother Nature smiled on St. John's Wednesday morning, allowing a volunteer committee to give the go-ahead for the city's unique weather-dependent holiday, the Royal St. John's Regatta. Rapper Nelly is arrested for suspected drug possession at St. Louis-area casino Rapper Nelly was arrested early Wednesday for suspected illegal drug possession at a St. Louis-area casino after Missouri Highway Patrol officers found what the patrol said were four ecstasy pills on him. Canada Ottawa's Capital Pride draws backlash following pledge to stand in solidarity with Palestinians Capital Pride, the LGBTQ2S+ organization that puts on Ottawa's annual pride parade, is drawing backlash from Jewish community groups following a statement this week expressing solidarity with Palestinians. Stricter outdoor water restrictions to return to Calgary as urgent feeder main repairs needed Calgary will return to Stage 4 outdoor water restrictions later this month as city crews begin repair work on 16 new sites on a feeder main affected by a major break two months ago. Regatta a 'go,' bringing thousands to Quidi Vidi Lake in St. John's Mother Nature smiled on St. John's Wednesday morning, allowing a volunteer committee to give the go-ahead for the city's unique weather-dependent holiday, the Royal St. John's Regatta. Plant-based beverages linked to listeria recall were produced in Pickering, Ont.: officials The plant-based milk beverages recalled due to a listeria outbreak that killed two people and hospitalized 13 others were produced in the Greater Toronto Area, health officials say. Two Flair passengers in B.C. were told a bird strike cancelled their flight. Then they did their own research Flair Airlines was ordered to compensate two passengers after a B.C. tribunal found there was no evidence a bird strike actually caused a flight cancellation. What we know about a fatal shooting by armed suspects east of Calgary The man shot and killed by two armed suspects east of Calgary on Tuesday is believed to be an employee of Rocky View County, where the incident occurred. World Harris and Walz say they're 'joyful warriors,' narrowly miss tarmac confrontation with Vance U.S. Vice-President Kamala Harris and Minnesota Gov. Tim Walz got an idea of just how hotly contested the Midwest will be when they overlapped on a Wisconsin tarmac with Republican vice-presidential nominee JD Vance. British police prepared for far-right agitators. They found peaceful anti-racism protesters instead Far-right demonstrations that had been anticipated by police in dozens of locations across Britain failed to materialize Wednesday as peaceful anti-racism protesters instead showed up in force. FBI: California woman brought sword, whip and other weapons into Capitol during Jan. 6 riot A California woman is charged with taking a cache of weapons, including a sword, a steel whip and a knife into the U.S. Capitol during the Jan. 6, 2021, attack by a mob of Donald Trump supporters, according to court records unsealed Wednesday. Putin accuses Ukraine of a 'large-scale provocation' with its raid in southwestern Russia Russian President Vladimir Putin on Wednesday described a Ukrainian incursion into the country's southwestern Kursk region as a 'large-scale provocation' as his officials asserted that they were fighting off cross-border raids for a second day. Ukrainian officials remained silent about the scope of the operation. A Berlin doctor has been arrested on suspicion of killing 4 elderly patients and setting fire to their homes A doctor has been arrested in Berlin on suspicion of killing four elderly patients and trying to cover up the evidence by setting fires at their homes, authorities said Wednesday. The son of Norway's crown princess faces preliminary charges of bodily harm and criminal damage The eldest son of Norway's Crown Princess Mette-Marit is under suspicion for causing bodily harm and criminal damage, Oslo police said Wednesday. Politics National Defence announces new military housing complex in B.C. The Department of National Defence has awarded a contract to design a new, 480-unit military housing complex at Canadian Forces Base Esquimalt, near Victoria, as part of a nationwide effort to build and upgrade thousands of housing units for the Canadian Armed Forces. Conservatives deny claim they are behind bot posts after Poilievre rally The Conservatives say they have no connection to a rash of conspicuously similar social-media posts that flooded the X platform following a Pierre Poilievre event in northern Ontario last week. RCMP arrest man in Ontario for allegedly making violent threats against Trudeau RCMP officers in the Greater Toronto Area have arrested a 33-year-old man for allegedly threatening Prime Minister Justin Trudeau in a video posted online Health 'We've seen an explosion': 75 per cent of Canadian dental care providers now partaking in federal plan More than 2.3 million Canadians have been approved to receive coverage, and now more than 75 per cent of dental care providers are now participating in the federal government's dental-care program. Can you get rid of allergies forever? One specialist gives her advice If you suffer from allergies, frequent itchiness, rashes, sneezing and a stuffy nose can be the bane of your existence. But there's hope for allergy sufferers beyond antihistamines, says a pediatric allergist. Colin Farrell launches foundation in honour of son, who has a rare neurogenetic disorder Colin Farrell’s 20-year-old son James has Angelman syndrome, a rare neurogenetic disorder. Diagnosed as a child, James is nonverbal and receives live-in care, according to Farrell, who opened up for the first time in depth about his son’s condition in a new interview with People magazine. Sci-Tech Boeing Starliner astronauts have now been in space more than 60 days with no end in sight Butch Wilmore and Suni Williams — two veteran NASA astronauts piloting the first crewed test flight of Boeing’s Starliner spacecraft — have now been in space for 63 days, roughly seven weeks longer than initially expected. Fossils suggest even smaller 'hobbits' roamed an Indonesian island 700,000 years ago Twenty years ago on an Indonesian island, scientists discovered fossils of an early human species that stood at about three-and-a-half feet (1.07 metres) tall — earning them the nickname \"hobbits.\" Canada's poor record predicting tornadoes must be improved to save lives: researchers On July 24, Environment Canada issued a tornado warning for the area around Lachute, Que., northwest of Montreal, urging people to take shelter. The warning was accurate: a tornado touched down outside Lachute about an hour after the alert. But three other twisters that day slipped past forecasters. Entertainment Colin Farrell launches foundation in honour of son, who has a rare neurogenetic disorder Colin Farrell’s 20-year-old son James has Angelman syndrome, a rare neurogenetic disorder. Diagnosed as a child, James is nonverbal and receives live-in care, according to Farrell, who opened up for the first time in depth about his son’s condition in a new interview with People magazine. Organizers cancel Taylor Swift concerts in Vienna over fears of an attack Organizers of three Taylor Swift concerts in Vienna this week called them off on Wednesday after officials announced arrests over an apparent plot to launch an attack on an event in the Vienna area such as the concerts. Hundreds of extras needed for movie starring Bob Odenkirk, Christopher Lloyd filming in Manitoba The sequel to a popular movie shot in Winnipeg is looking for hundreds of extras as it returns to Manitoba. Business Two Flair passengers in B.C. were told a bird strike cancelled their flight. Then they did their own research Flair Airlines was ordered to compensate two passengers after a B.C. tribunal found there was no evidence a bird strike actually caused a flight cancellation. FAA has doubled its enforcement cases against Boeing since a door plug blew off a 737 Max A U.S. federal Aviation Administration official said Wednesday that the agency has 16 pending enforcement cases against Boeing, half of which have been opened since a door plug blew off a 737 Max in midflight. WestJet says 10 per cent of fleet grounded after Calgary pummelled by hail WestJet says 16 of its planes have been grounded after a massive hailstorm hit Calgary earlier this week. Lifestyle Old Edmonton streetcar line found during Valley Line West LRT construction Construction crews working on the Valley Line West LRT line have unearthed a piece of Edmonton's history. Operating theatres, bowling alleys and home cinemas: Not happy with safe rooms, the super-rich are building luxury fortresses Few things appear to soothe the existential anxieties of the super-rich like a bunker designed to withstand anything short of total nuclear Armageddon. Manitoba cheese producer considered one of the best in North America following competition What started as a trip to learn and get better at making cheese turned into an award-winning experience for a Manitoba cheese producer. Sports Canada's Marina Stakusic wins National Bank Open debut; Rebecca Marino eliminated Marina Stakusic has advanced to the second round of the National Bank Open. Canada's Newman wins bronze in Olympic women's pole vault Canada's Alysha Newman has won the bronze medal in the women's pole vault at the Paris Olympics. Canadian sprinter De Grasse fails to qualify for Olympic 200-metre final Andre De Grasse will not be defending his Olympic title in the men's 200-metre final. The 29-year-old from Markham, Ont., was officially eliminated from Thursday's final when the third and fourth finishers in the next semifinal finished with better times Wednesday at Stade de France. Autos U.S. auto safety agency seeks information from Tesla on fatal Cybertruck crash and fire in Texas U.S. federal safety authorities say they are seeking information on a crash and fire involving a Tesla Cybertruck that killed a driver of the futuristic new pickup. After a rash of stolen cars, Hyundai and Kia's new anti-theft software is showing results More than a year after Hyundai and Kia released new anti-theft software updates, thefts of vehicles with the new software are falling — even as thefts overall remain astoundingly high, according to a new analysis of insurance claim data. Japan's Nissan is developing 'cool paint' for cars to keep drivers cooler Nissan showed Tuesday what it called a \"cool paint\" to keep people inside vehicles cooler, although the coating is six times thicker, making commercialization still a challenge. Local Spotlight Maritimers mark 10th anniversary of ALS Ice Bucket Challenge with calls to bring it back A whole decade later, there are calls to bring back a trend which brought attention and donations to a good cause. Sask. woman writes children's book about role of service dogs After two years of owning a service dog, Charlene Izuka was inspired to share her experience and teach others about service dogs through a children's book. Living out of his car, Quebec man chronicles experience as he pays off debt A Quebec man swimming in debt has been living out of his car for the last month, chronicling the experience on TikTok. N.S. artist transforms cloud formations into clay art Judy Gordon was travelling in Newfoundland last spring, looking for inspiration. The Nova Scotia-based artist was booked for a solo exhibition in Halifax in August and she needed a subject or idea to transform into something eye-catching and striking for patrons. Online trading platforms appear to go dark during huge market sell-off Several online brokerage firms including Charles Schwab, Fidelity and Vanguard appeared to be down for thousands of users early Monday during one of the biggest stock markets sell-offs of 2024. B.C. man takes public transit all the way to Mexico William Hui did not cheat. He set his own rules and then planned his route carefully, determined to make it all the way to Tijuana without flying or using Greyhound and Amtrak. Jasper residents who lost homes in wildfire can register for bus tours online The Alberta government launched a registration portal for Jasper residents to tour the townsite on buses \"in the coming days.\" Two Ont. hunters fined $9,750 for moose hunting scheme Two Ontario men are facing $9,750 in fines after they tried to cover up that a bull moose was shot by mistake last October. Burger Wars competition returns to Sudbury in support of charity A friendly food war is happening in Sudbury during the month of August among 30 local restaurants in an effort to support a new home for people with developmental disabilities. Vancouver 2 homes destroyed, others saved as embers spread from massive Vancouver fire Firefighters scrambled to protect more than half a dozen homes that caught fire as a result of the massive blaze that erupted at an under-construction apartment building in Vancouver's Dunbar-Southlands neighbourhood on Tuesday. $75M lawsuit against Facebook by 'spiritual influencer' can be amended, B.C. court rules A woman's bid to sue Facebook for $75 million over a variety of alleged misconduct – including copyright and trademark infringement, harassment and breach of privacy – has been mostly dismissed in B.C. Supreme Court. National Defence announces new military housing complex in B.C. The Department of National Defence has awarded a contract to design a new, 480-unit military housing complex at Canadian Forces Base Esquimalt, near Victoria, as part of a nationwide effort to build and upgrade thousands of housing units for the Canadian Armed Forces. Toronto Senior Toronto police officer who allowed nephew to leave collision found guilty of misconduct A senior Toronto police officer has been found guilty of two professional misconduct charges after allowing her nephew to leave the scene of a single-vehicle crash in 2022. Air passenger rights group sues WestJet over 'misleading information' A lawsuit has been launched against WestJet over a 'cap' the airline has put in place on how much it will pay passengers if they need meals and hotel stays, which a passenger rights group says is illegal. Plant-based beverages linked to listeria recall were produced in Pickering, Ont.: officials The plant-based milk beverages recalled due to a listeria outbreak that killed two people and hospitalized 13 others were produced in the Greater Toronto Area, health officials say. Calgary Stricter outdoor water restrictions to return to Calgary as urgent feeder main repairs needed Calgary will return to Stage 4 outdoor water restrictions later this month as city crews begin repair work on 16 new sites on a feeder main affected by a major break two months ago. What we know about a fatal shooting by armed suspects east of Calgary The man shot and killed by two armed suspects east of Calgary on Tuesday is believed to be an employee of Rocky View County, where the incident occurred. 'A lot of damage': Research team surveying destruction left by Calgary hail storm A team of researchers is on the ground in Calgary assessing the damage caused by a recent destructive hail storm. Ottawa Ottawa's Capital Pride draws backlash following pledge to stand in solidarity with Palestinians Capital Pride, the LGBTQ2S+ organization that puts on Ottawa's annual pride parade, is drawing backlash from Jewish community groups following a statement this week expressing solidarity with Palestinians. More than 700 bikes reported stolen in Ottawa so far this year More than 1,000 bicycles are stolen in Ottawa each year and one Ottawa man knows just how quickly it can happen, after he left his garage door open. Proposed changes for dogs at Owl Park in Ottawa's south end The days of dogs running off-leash at a park in Ottawa's south end may be coming to an end. Owl Park has been a popular spot for off-leash dogs for years, but the city is considering changing the rules to require canines on a leash during certain periods. Montreal Montreal father injured while protecting family from gunfire; accused appears in court A Montreal father of three was scheduled to go into surgery Wednesday after being injured while trying to protect his family from gunfire on the West Island last weekend. Last week's shooting in Verdun now a homicide after man, 31, dies: police A 31-year-old man who was shot in Verdun last week has died of his injuries, Montreal police confirmed on Wednesday. Auger-Aliassime bounced in Montreal singles opener; Shapovalov, Pospisil also out Fans at IGA Stadium gave Felix Auger-Aliassime a lengthy standing ovation before his opening singles match in the National Bank Open on Wednesday. Edmonton Old Edmonton streetcar line found during Valley Line West LRT construction Construction crews working on the Valley Line West LRT line have unearthed a piece of Edmonton's history. Edmonton Fringe facing $200K shortfall ahead of festival kickoff next week With just over a week until the Edmonton International Fringe Theatre Festival (EIFTF) kicks off for 2024, organizers are still looking for donations to help keep the festival afloat. 'We're very happy': Edmonton Folk Fest ready to welcome music fans on the hill For the next four days, the hills at Gallagher Park are going to be packed with folk music fans. Atlantic The latest on tropical storm Debby and the Maritimes Tropical storm Debby strengthened over the last 24 hours. Racist bullying reported at Salisbury, N.B., school: principal The principal of Salisbury Regional School sent an email to parents describing a reported “act of racism, hatred and bullying” toward a student on Tuesday night. Lawsuit launched by family of Indigenous woman in N.S. claims negligence in her death The family of an Indigenous woman who died in hospital has filed a lawsuit against the Nova Scotia health authority and four doctors who treated her, claiming they were negligent in caring for the 22-year-old woman with fungal meningitis. Winnipeg COVID-19 cases beginning to rise in Manitoba: Roussin Though summer doesn’t seem like the usual time to catch a cold or virus, COVID-19 is currently circulating in Manitoba and cases are beginning to rise. Hundreds of extras needed for movie starring Bob Odenkirk, Christopher Lloyd filming in Manitoba The sequel to a popular movie shot in Winnipeg is looking for hundreds of extras as it returns to Manitoba. Study paints grim picture of polar bear survival in the Arctic A new study featuring experts from the University of Manitoba is shedding light on the possible survival of polar bears in the Arctic. Regina 'We've been getting sick from it': Compost odour causing issues for Regina business It's now been over a year since the City of Regina introduced its composting program and one Regina resident is raising concerns over a major drawback – the smell. 'It's very scary': Melville couple deals with business damage costs after break-in A Melville couple is reflecting after their business, the Waverley Bar and Grill, was damaged following a break-in. QCX attendance up from 2023, security incidents significantly down, REAL says Regina Exhibition Association Limited (REAL) says attendance was up and security incidents were down significantly at this year's Queen City Ex (QCX). Kitchener Kitchener baseball team seeks new owner with 'deep pockets' The Kitchener Panthers believe new ownership will help them compete at the same level as other teams in the league. Researchers confirm EF-1 tornado touched down in Fort Erie, Ont. An EF-1 tornado touched down in Fort Erie, Ont. earlier this week, researchers confirmed Wednesday. Real estate in Waterloo Region: Home sales and prices increased in July Home sales in the Region of Waterloo jumped 4.6 per cent in July 2024. Saskatoon Manitoba looks to learn from Trottier case as it plans landfill search for victims of killer Jeremy Skibicki Saskatoon's landfill search is setting an example for Manitoba. The province to the east is preparing to search the Prairie Green Landfill, north of Winnipeg, for the remains of two Indigenous women who were killed by convicted serial killer Jeremy Skibicki. Saskatoon strikes tentative deal with operator of future downtown arena The City has struck a tentative 25-year deal with Oakview Group to operate Saskatoon's planned downtown arena and convention centre. 'Heart of gold': Prince Albert rallies behind homicide victim, calling for justice Dozens of Prince Albert residents rallied outside the provincial court Wednesday morning to call for justice in the city’s latest homicide. Northern Ontario Forest fire near Temiskaming Shores not under control yet Officials with the Ministry of Natural Resources and Forestry continue to work on putting out Kirkland Lake 5, a forest fire burning near Temiskaming Shores. Vehicle forced into a ditch near where kids were playing in North Bay road rage incident A 25-year-old man has been charged with assault and driving offences after what police are calling a road rage incident in North Bay. Northern medical school receives funding to research occupational cancer A research team at Greater Sudbury's NOSM University has received $200,000 in funding to examine occupational-related cancer caused by radon inhalation. London London Police Service changing how femicide cases are handled Fighting back tears, Linda Davidson said, “I didn’t want to do this (get emotional),” as she tries to come up with an answer to how she’s feeling knowing changes are coming to the way London Police handle future cases of femicide. Safety concerns on Hamilton Road following councillor’s pitch for reduction to three lanes Demands for greater safety might mean fewer traffic lanes along the busiest stretch of Hamilton Road. Municipalities call on province to help solve encampment crisis Municipalities are calling for new funding and tools from the province to help deal with urban encampments. This comes as the city of Sarnia continues to grapple with the expanding tent-city population at Rainbow Park, just south of the downtown. Barrie Deshawn Davis apprehended in California Just days after being placed on the U.S. Marshals 15 most wanted list, Deshawn Davis was apprehended in the small town of Redway, California, on Monday, roughly three and a half hours north of San Francisco. Tay woman busted for open liquor in the pickup Tay Twp. woman busted for impaired driving in Midland. Midland appoints new town councillor The Town of Midland appointed a new councillor on Wednesday. Windsor ‘It's something that we really have to look at’: City councillors teaming up to enact Vacant Storefront Tax A couple of municipal councillors from Windsor and Ottawa are teaming up to engage all Members of Provincial Parliament about a proposed Vacant Storefront Tax as a way to revitalize downtown cores across Ontario. Pro bono law firm discovers more than 100 COVID-era tickets were withdrawn The Democracy Fund (DF), established during the pandemic to fight for constitutional freedom, recently discovered dozens of tickets in Mississauga were withdrawn. CTV News Windsor’s Sanjay Maru and wife welcome first baby to the world Our CTV News Windsor family just got larger by one on Aug. 6th, 2024. Vancouver Island National Defence announces new military housing complex in B.C. The Department of National Defence has awarded a contract to design a new, 480-unit military housing complex at Canadian Forces Base Esquimalt, near Victoria, as part of a nationwide effort to build and upgrade thousands of housing units for the Canadian Armed Forces. B.C. provides $20M to expand travel, accommodation funding for cancer patients The British Columbia government is providing $20 million over two years to support travel and lodging for cancer patients in the province. Woman arrested for starting forest fire on Vancouver Island, police say Police in Port Alberni say they will be recommending charges against a woman they believe set a fire in a forested area Tuesday evening. Kelowna Thieves used pickup truck to break into Lululemon store in Kamloops, RCMP say Mounties in Kamloops are investigating after thieves used a pickup truck to break into a Lululemon store at the Aberdeen Mall early Monday morning. South Okanagan police seek help identifying person of interest in string of thefts Mounties in the South Okanagan are asking for the public’s help to identify a person of interest they say may be connected with a series of thefts in the region. After a week of decreased activity, Shetland Creek wildfire prompts new evacuation alert in B.C. Interior After more than a week of mostly scaling back evacuation orders and alerts related to the Shetland Creek wildfire, the Thompson-Nicola Regional District changed course Saturday. Lethbridge Protesters not guilty of conspiring to kill Mounties at Coutts blockade A jury returned a verdict of not guilty late Friday for two men accused of conspiring to kill RCMP officers at the border blockade at Coutts, Alta. Businesses in Lethbridge seeing boost in business as heat warning remains in effect With a heat warning re-issued for Lethbridge and parts of southern Alberta, businesses that depend on the sunshine are taking full-advantage of it. Dawgs topple Bulls 9-7 in opener of season’s final home stand Jarrett Burney extended his hitting streak to nine games Tuesday, leading the Okotoks Dawgs to a 9-7 victory over Lethbridge Tuesday night at Seaman Stadium. Sault Ste. Marie Northern medical school receives funding to research occupational cancer A research team at Greater Sudbury's NOSM University has received $200,000 in funding to examine occupational-related cancer caused by radon inhalation. Sault police presence on Peoples Road related to man missing since 2023 Police in Sault Ste. Marie said there will be a significant police presence around Peoples Road on Wednesday related to the search for Jake Corbiere. Sault suspect charged with committing an indecent act near beach change rooms A 54-year-old from the Sault has been charged with exposing their genitals to people near the change rooms at Pointe Des Chenes beach. N.L. Regatta a 'go,' bringing thousands to Quidi Vidi Lake in St. John's Mother Nature smiled on St. John's Wednesday morning, allowing a volunteer committee to give the go-ahead for the city's unique weather-dependent holiday, the Royal St. John's Regatta. Number of inmates released into homelessness is climbing in Newfoundland and Labrador More people are being released from Newfoundland and Labrador's largest correctional facility with nowhere to go home to, and experts say housing shortages, unco-ordinated community supports and a high number of inmates on pretrial detention are to blame. Hearing denial for man held for tweet shows complaints system favours police: experts A University of Alberta criminologist says the recent denial of a public hearing for a Labrador man detained by police over a social media post shows the province's police complaints system is set up to protect officers. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks This Rechargeable Book Light Will Make Reading At Night So Much Easier On Your Eyes If You Have No Idea What To Get Them For Their Birthday, Try One Of These Gifts 15 Home Products With Near-Perfect Reviews On Amazon Canada (And You'll Want Every Single One) Home How to Organize Your Kitchen Cupboards Our Guide To The Best Coffee Grinders In Canada In 2024 (And Where To Get Them) If You Have A Dog, You'll Want To Add At Least One Of These 17 Budget-Friendly Amazon Products To Your Cart Gifts The Best Anniversary Gifts For Couples Who Already Seem To Have Everything 15 Of The Best Baby Shower Gift Ideas for 2024 18 Birthday Presents They'll Love More Than A Gift Card Beauty If You Have Oily Skin, Reviewers Swear These Are The Best Setting Powders To Use 12 Holy Grail Products That Reviewers With Sensitive Skin Swear By Reviewer Favourites: The Best Moisturizers For Mature Skin Deals From Lululemon to Amazon Canada: Here Are All The Best Sales, Deals, and Discounts You'll Find Online Right Now Amazon Prime Day May Be Over, But You Can Still Take Advantage Of These 70+ Amazing Deals Amazon Prime Day Is Almost Over — Here Are 100+ Of The Best Deals And Discounts You Can Still Snag Stay Connected","summary":"Rapper Nelly was arrested early Wednesday for suspected illegal drug possession at a St. Louis-area casino after Missouri Highway Patrol officers found what the patrol said were four ecstasy pills on him.","url":"https://www.ctvnews.ca/entertainment/rapper-nelly-is-arrested-for-suspected-drug-possession-at-st-louis-area-casino-1.6992380","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/7/rapper-nelly-1-6992433-1723072080702.jpg","video":null,"publish_date":"2024-08-07 23:10:00","author":"Summer Ballentine And John Hanna,The Associated Press","authors":["Summer Ballentine And John Hanna","The Associated Press"],"language":"en","source_country":"ca","sentiment":-0.309},{"id":253622128,"title":"Kamala Harris Takes New Lead as Likely 2024 Winner, Poll Shows","text":"For the first time in nearly a year, Americans expect the Democratic presidential nominee to beat former President Donald Trump in November.According to the latest poll from The Economist/YouGov, 40 percent of U.S. adults who were surveyed between August 4 and 6 believe that Vice President Kamala Harris is the likely winner of the 2024 presidential race. Out of the 1,618 adults surveyed, 38 percent said they believed Trump would be victorious.While a small margin, it is the first time since October 2023 that Americans have indicated in an Economist/YouGov poll that they think Trump will lose his reelection bid to either Harris or President Joe Biden, who dropped out of the race as the Democratic nominee on July 21. In the survey released last week, Trump was predicted to win over Harris 42 percent to 35 percent.Harris' boosted chances of winning the election may be due to the increased enthusiasm among Democrats since she entered the race. This week, 60 percent of Democratic voters said they were \"very or extremely enthusiastic about voting\" in November, while 58 Republicans said the same.That number is a 2-point boost for Democrats compared to last week's Economist/YouGov polling, where 58 percent said they were feeling enthusiastic. Meanwhile, Republican's excitement dropped by 9 points--the poll conducted between July 27 and 30 found that 67 percent of GOP voters were feeling \"very or extremely enthusiastic\" for this fall.According to a report on Wednesday's polling, this is the first time that Democrats have been more excited about the election than Republicans since the Economist/YouGov began asking the question in March 2024.Newsweek reached out to Harris and Trump's campaigns via email for comment.Polling has shown that Harris and her recently-appointed running mate, Minnesota Governor Tim Walz, have closed the gap to Trump in just a little over two weeks since entering the 2024 race. As of Monday, Harris was leading in all major polling averages, including those compiled by RealClearPolitics, The Economist, and FiveThirtyEight.The race, however, is still incredibly close. In RealClearPolitics' report, Harris was leading Trump by just 0.2 percent. The vice president's biggest lead on average was calculated by FiveThirtyEight, which said that Harris is now 2 percentage points above Trump on average across national polling.Harris told her supporters at a rally in Philadelphia on Tuesday that her campaign is \"the underdog\" in the race but that she was ready to fight until the election.\"We have a fight ahead of us, and we are the underdogs in the race,\" she said at an event at Temple University, where she introduced Walz for the first time as her running mate. \"But this is a people-powered campaign, and we have momentum.\"","summary":"In a recent Economist/YouGov poll, more Americans predicted Harris to win in November over former President Donald Trump.","url":"https://www.newsweek.com/kamala-harris-new-lead-2024-winner-poll-1936215","image":"https://d.newsweek.com/en/full/2445537/kamalaharris-takes-new-lead-likely-2024.jpg","video":null,"publish_date":"2024-08-07 23:06:53","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","source_country":"us","sentiment":-0.381},{"id":253622490,"title":"Majority of Americans believe the First Amendment goes too far: poll","text":"(The Center Square) – Free speech suppression on college campuses and social media censorship often spur debates over how far the First Amendment should go to protect Americans’ rights to express their opinions – and who should be entrusted with those decisions. About 53% of Americans believe the First Amendment goes too far in the rights it protects, according to a new poll by the nonprofit Foundation for Individual Rights and Expression, or FIRE. The poll, conducted July 5-10, is the latest installment in the National Speech Index, a quarterly survey designed by FIRE and the Polarization Research Lab at Dartmouth College to gauge public opinion on freedom of speech. The 10-question survey consists of five permanent questions to track support for free speech and the First Amendment over time and five rotating questions to capture public opinion about topical and newsworthy speech-related issues. “Evidently, one out of every two Americans wishes they had fewer civil liberties,” said FIRE’s Chief Research Advisor Sean Stevens. “Many of them reject the right to assemble, to have a free press, and to petition the government. This is a dictator’s fantasy.” Additionally, the report states that 69% of those surveyed believe the country is on the wrong track regarding free speech. Only 5% believe their rights are “completely” secure, and 12% “not at all” secure. Approximately 65% of respondents have some level of trust in the government to fairly decide on what speech is considered threatening or indecent. However, only 32% said they were “not at all” comfortable with the government limiting the free speech of pro-Hamas protesters. “Not only do many Americans want to take a machete to the First Amendment, but it’s unclear whether they understand its bounds,” said FIRE’s press release. It also states that a plurality of respondents said this spring’s campus pro-Palestinian protests should have been allowed to continue on free speech grounds. The organization noted that while many protests were “lawful,” some included “tent encampments, vandalism, and the occupation of buildings” – which are not justifiably protectable “in the name of free speech.” “Americans have little tolerance for certain forms of protected speech and a lot of tolerance for unprotected conduct, when it should be the other way around,” Stevens said. “This poll reveals that the state of free speech in America is dire.” Pointing to previous surveys, Stevens told The Center Square that many Americans have little to no trust in the government to regulate free speech, but at the same time, other data suggest many are ready to censor views they don’t like. They want someone to do it, but don’t trust the government or social media companies to do it fairly, he said. Stevens highlighted one encouraging result: there seems to be rare bipartisan agreement between Democrats and Republicans — 61% and 52%, respectively — that they are not comfortable with the government regulating the speech of pro-Hamas protesters. “I know what’s being said probably offends a lot of people,” he said. “But that’s a strong free speech stance there.” However, half of Democrats and only one-fifth of Republicans think America is on the right track when it comes to free speech in general. Other survey work focused on the encampment protests and how campus administrations addressed them. Stevens said the results show increased concern over the state of free speech among liberals, progressives and people on the left compared to six months ago. “There is more awareness now that their ox is being gored and they see how the calls for censorship can be wielded against them just as easily,” he said. Other findings show the percentage of respondents who are “very” or “somewhat worried about being fired over complaints about their speech fell from 28% in April to 20% in July. They note that the survey was conducted prior to the assassination attempt of former President Donald Trump. The number of people who self-censor “fairly” or “very” often also decreased to 23% from 27%.","summary":"About 53% of Americans believe the First Amendment goes too far in the rights it protects, according to a new poll by the nonprofit Foundation for Individual Rights and Expression, or FIRE.","url":"https://nypost.com/2024/08/07/us-news/majority-of-americans-believe-the-first-amendment-goes-too-far-poll/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-chnwr5adz-1723063236127.jpg?quality=75&strip=all&1723048865&w=1200","video":"https://cdn.jwplayer.com/videos/c3Rt2mIH-RyIcpnTz.mp4","publish_date":"2024-08-07 23:05:53","author":"The Center Square","authors":["The Center Square"],"language":"en","source_country":"us","sentiment":-0.157},{"id":253622510,"title":"Supreme Court’s Neil Gorsuch mourns ‘too much law’ from administrative state run amok","text":"“Criminal laws have grown so exuberantly and come to cover so much previously innocent conduct that almost anyone can be arrested for something,” Supreme Court Justice Neil Gorsuch observed in 2019. Gorsuch elaborates on that theme in a new book, showing how the proliferation of criminal penalties has given prosecutors enormous power to ruin people’s lives, resulting in the nearly complete replacement of jury trials with plea bargains. “Some scholars peg the number of federal statutory crimes at more than 5,000,” Gorsuch and coauthor Janie Nitze note in “Over Ruled: The Human Toll of Too Much Law,” while “estimates suggest that at least 300,000 federal agency regulations carry criminal sanctions.” The fact that neither figure is known with precision speaks volumes about the expansion of federal law. Literally volumes: “By 2018, the U.S. Code encompassed 54 volumes and approximately 60,000 pages,” Gorsuch writes, while “the Code of Federal Regulations spanned about 200 volumes and over 188,000 pages” as of 2021. Since keeping up with all that law is a challenge even for experts, the rest of us cannot hope to know exactly which conduct is a crime, even though “fair notice” is a basic requirement of due process. The civil liberties lawyer Harvey Silverglate has suggested “the average busy professional in this country” may unwittingly commit “several federal crimes” every day. And that’s just federal law. Thanks to the vast trove of potential charges, Silverglate observes, quoting a warning from Justice Robert Jackson, “prosecutors can easily succumb to the temptation of first ‘picking the man and then searching the law books, or putting investigators to work, to pin some offense on him.'” Former President Donald Trump says that is what happened to him. His 34 felony convictions for paperwork violations stemming from his hush payment to a porn star provide evidence to support that complaint. Because the same conduct can be construed as multiple violations of state or federal law, prosecutors can pressure defendants to plead guilty by threatening to throw the book at them. Although Special Counsel David Weiss initially was prepared to drop a federal gun charge against Hunter Biden under a diversion agreement, for example, he ultimately prosecuted the president’s son for three felonies, all based on the same gun purchase, with combined maximum penalties of 25 years. Why the change? After the diversion agreement and a plea agreement resolving tax charges fell apart, Biden decided to make the government prove its case in court. Exercising his Sixth Amendment right to trial by jury came with a stiff penalty. Something similar happened to Aaron Swartz, a young computer programmer, entrepreneur and internet “hacktivist” who, apparently frustrated by limits on information he thought should be freely available, downloaded articles from JSTOR, an online academic library. When Swartz was caught, he returned the articles, and JSTOR considered the matter resolved. Federal prosecutors nevertheless “charged Aaron with wire fraud and three counts under the Computer Fraud and Abuse Act of 1986,” Gorsuch writes. And when Swartz declined to plead guilty, “prosecutors added another nine counts to their charges against him, exposing him now to decades in prison and millions in fines.” Swartz committed suicide a few months before his trial was scheduled to begin. As a result of such pressure, Gorsuch notes, about 97% of federal felony convictions and 94% of state felony convictions are based on plea agreements. Trial by jury, which the framers viewed as an essential bulwark against tyranny, plays only a marginal role in our current criminal justice system. The more juries are needed as a check on prosecutorial power, in other words, the less likely they are to serve that role. “The framers really believed in juries,” Gorsuch noted in an interview with New York Times columnist David French. “I mean, there it is in Article III. There it is in the Sixth Amendment. There it is in the Seventh Amendment.” “They really believed in juries, and we’ve lost that.” Jacob Sullum is a senior editor at Reason magazine.","summary":"\"Criminal laws have grown so exuberantly and come to cover so much previously innocent conduct that almost anyone can be arrested for something,\" Supreme Court Justice Neil Gorsuch observed in 2019.","url":"https://nypost.com/2024/08/07/opinion/justice-neil-gorsuch-mourns-over-regulation-too-much-law/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/G1N1.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-07 23:05:43","author":"Jacob Sullum","authors":["Jacob Sullum"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.369},{"id":253621996,"title":"Mugshot of Kamala Harris’ VP running mate surfaces from drink driving arrest","text":"Minnesota Governor Tim Walz’s mugshot (right) emerged after Vice President Kamala Harris (left) picked him as her running mate (Pictures: Rex) As Democratic nominee Kamala Harris’ newly picked running mate makes national headlines, a dishonorable photo from his past has emerged. Minnesota Governor Tim Walz’s mugshot from a 1995 arrest on suspicion of drink driving surfaced shortly after Harris selected him to be her vice presidential partner on the Democratic ticket. Walz’s booking photo obtained by Fox News shows him staring seemingly dazed at the camera while holding a Dawes County Sheriff’s Department placard in Nebraska. He was arrested on September 23, 1995, after driving over 80mph in a 55mph zone. The at the time 28-year-old failed a breath test with a .128 blood alcohol concentration. Walz also failed a sobriety test. Walz was booked into a county jail then released on bond. Walz reached a plea deal in which he admitted to a reduced charge of reckless driving and paid a $200 fine. The now 60-year-old reportedly does not drink alcohol anymore. Harris’ announcement on Tuesday of Walz as her running mate spurred much digging into his past. Who is Tim Walz? Walz is a Nebraska native who served as a National Guardsman. He was worked as a high school teacher and football coach at the time of his arrest on suspicion of DUI. Walz was elected to the House of Representative and from there won the Minnesota governorship in 2018. He was elected as governor in 2022. What have Donald Trump and his running mate JD Vance said about Tim Walz? Ex-President Donald Trump’s running mate JD Vance, who himself has faced scrutiny of his past since being picked, on Wednesday tried to confront Walz and Harris on a Wisconsin tarmac as their aircrafts arrived at similar times. Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.","summary":"Democratic nominee Kamala Harris' vice presidential running mate Tim Walz was arrested on suspicion of drink driving in 1995.","url":"https://metro.co.uk/2024/08/07/mugshot-kamala-harris-vp-running-mate-surfaces-dui-arrest-21382497/","image":"https://metro.co.uk/wp-content/uploads/2024/08/SEC_216408832-92cb.jpg?quality=90&strip=all","video":null,"publish_date":"2024-08-07 22:59:54","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.189},{"id":253622792,"title":"Trump-backed Jerrod Sessler advances to November election in Washington state race for US Congress","text":"SEATTLE (AP) — Donald Trump-backed candidate Jerrod Sessler advanced into the general election in Washington state’s conservative 4th Congressional District. Sessler faced off in Tuesday’s primary against U.S. Rep. Dan Newhouse, one of the last remaining House Republicans who voted to impeach Trump, as well as Tiffany Smiley, another conservative candidate endorsed by Trump. The second spot for the general election is too early to call. Under Washington’s primary system, the top two vote-getters in each of Tuesday’s races advance to the November election, regardless of party.","summary":"SEATTLE (AP) — Donald Trump-backed candidate Jerrod Sessler advanced into the general election in Washington state’s conservative 4th Congressional District.","url":"https://www.thestar.com/news/world/united-states/trump-backed-jerrod-sessler-advances-to-november-election-in-washington-state-race-for-us-congress/article_d16123f4-f40f-510f-90c8-080621b07d02.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/custom/image/f84403b8-7d76-11ee-9d02-a72a4951957f.png?resize=600%2C600","video":null,"publish_date":"2024-08-07 22:58:37","author":"The Associated Press,Wire Content","authors":["The Associated Press","Wire Content"],"language":"en","catgory":"politics","source_country":"CA","sentiment":-0.28},{"id":253623488,"title":"1 of last GOP congressmen who voted to impeach Trump advances in Washington’s US House race","text":"SEATTLE (AP) — One of the last remaining U.S. House Republicans who voted to impeach Donald Trump and a candidate endorsed by the former president have advanced in Tuesday’s primary to the general election in Washington state’s 4th Congressional District. U.S. Rep. Dan Newhouse is seeking a sixth term in the conservative Washington district that runs from the Canadian border to the Columbia River. He will face Republican Jerrod Sessler, a Navy veteran and former NASCAR driver, in November. This was a rematch for the pair from 2022, when Sessler earned a distant fourth in the primary. This time, Sessler said things have gone his way. He was endorsed by the Washington State Republican Party and nabbed Trump’s backing early on, which he called a “game change.” He said he communicates regularly with Trump’s team, referencing a text he said he received from the GOP presidential candidate this year saying, “The country is counting on you.” “In ninety days, this district is going to vote overwhelmingly for President Trump,” Sessler said in a statement. “I will work hard to make sure we also elect a member of Congress who will be his greatest ally in our fight to enact a pro-Constitution, pro-MAGA agenda and heal our nation from the disaster of the Biden-Harris administration.” Newhouse has mostly steered clear of the subject of Trump. The third-generation farmer has instead focused on agriculture and border security in a state with millions of acres of pastures, orchards and cereal grain lands where immigrant labor is extremely important. In the lead-up to the primary, Newhouse’s opponents repeatedly touted his vote to impeach Trump as a huge liability. But political experts have cautioned that it’s difficult to say whether the endorsement will sway voters who already stuck with Newhouse two years ago. Newhouse and U.S. Rep. David Valadao, of California, are the only Republican Congressional lawmakers left among the 10 who voted to impeach Trump in 2021. Others retired or were defeated by Trump-endorsed primary challengers. As of July 17, Newhouse, who was endorsed by the NRA and the National Right to Life, had raised $1.6 million – far more than the $409,000 raised by Sessler. They prevailed over Tiffany Smiley, a former nurse who entered the race after losing to U.S. Sen. Patty Murray two years ago. She received a backing from Trump just three days before the primary, marking a unique, though not unprecedented, dual endorsement by the former president. But the backing for Smiley likely came too late to impact many voters in the vote-by-mail state. Under the state’s primary system, the top two vote-getters in each of the contests advance to the November election, regardless of party. Hallie Golden, The Associated Press","summary":"SEATTLE (AP) — One of the last remaining U.S. House Republicans who voted to impeach Donald Trump and a candidate endorsed by the former president have advanced in Tuesday’s primary to the general election in Washington state’s 4th Congressional District. U.S. Rep. Dan Newhouse is seeking a sixth term in the conservative Washington district that [&#8230;]","url":"https://toronto.citynews.ca/2024/08/07/trump-backed-jerrod-sessler-advances-to-november-election-in-washington-state-race-for-us-congress/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/03/25/TitleCards_CityNews_1920x1080.jpg","video":null,"publish_date":"2024-08-07 22:58:37","author":"Hallie Golden,News Staff","authors":["Hallie Golden","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.147},{"id":253623746,"title":"Kamala Harris's Latest Free Concert: Bon Iver Performs at Wisconsin Rally","text":"In a bid to lure swing-state voters to her rallies, Kamala Harris is relying on pop stars to do her heavy lifting for her, enlisting them to perform free concerts that will act as crowd magnets to create the illusion of a grassroots political movement. Last week in Georgia, it was “Wet Ass Pussy” rapper Megan Thee Stallion, who delivered a reliably raunchy performance. This week it’s the Grammy-winning indie band Bon Iver, which appeared Wednesday at a Kamala rally in the group’s hometown of Eau Claire, Wisconsin. On Wednesday afternoon, videos went viral showing the rally venue that the Harris campaign said was filled “to the brim.” .@boniver performs at the Harris-Walz rally in Eau Claire ? pic.twitter.com/csKI6ihHjW — Kamala HQ (@KamalaHQ) August 7, 2024 Ostensibly hired to ensure that blue-haired hipsters will put down their vape pens and head to the polls on election day, Bon Iver shared the stage with Kamala Harris as part of her campaign to win Wisconsin — where, just prior to the DNC’s unprecedented coup of its own candidate, former President Donald Trump had taken a six-point lead over Joe Biden. With Kamala now abruptly installed as the party elite’s chosen favorite without having garnered a single primary vote, a new poll shows Trump virtually tied — thanks in large part to the establishment news media’s boosterism of everything Kamala. The battle over Wisconsin led to an embarrassing moment for Kamala earlier this week. On Tuesday, GOP Vice Presidential candidate JD Vance approached Air Force Two, which Harris was onboard, in a tense standoff during which the current and perhaps future vice president occupied the same Wisconsin runway. “I thought the reporters traveling with Kamala might be a little lonely given that she never answers questions from them, so I figured I’d come say hello and check out my new plane while I was at it,” Vance later wrote on social media.","summary":"In a bid to lure swing-state voters to her rallies, Kamala Harris is relying on pop stars to do her heavy lifting for her, enlisting them to perform free concerts that will act as crowd magnets to create the illusion of a grassroots political movement.\n\n\nThe post Kamala Harris&#8217;s Latest Free Concert: Bon Iver Performs at Wisconsin Rally appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2024/08/07/kamala-harriss-latest-free-concert-bon-iver-performs-at-wisconsin-rally/","image":"https://media.breitbart.com/media/2024/08/bonnier-640x335.jpg","video":null,"publish_date":"2024-08-07 22:52:01","author":"David Ng","authors":["David Ng"],"language":"en","source_country":"US","sentiment":0.002},{"id":253622496,"title":"‘Folksy’ Tim Walz has a radical record — but fakery is what the ticket is all about","text":"With the selection of Minnesota Gov. Tim Walz as Kamala Harris’ running mate, the United States now has the most radical, most extreme, most socialist ticket in this country’s history.The selection shocked almost everybody, including those on the left. The slam-dunk veep choice was obviously Pennsylvania Gov. Josh Shapiro, a relative moderate who holds an approval rating north of 60% in his most crucial of swing states.But instead of moving her party more to the center, Harris went with her soulmate in Walz. Walz doesn’t deliver a swing state (Minnesota hasn’t gone red since 1972), and his record shows he’s basically Bernie Sanders or AOC with a “Fargo” accent. But right on cue, our activist media — after debasing itself beyond recognition by pushing outright lies about Joe Biden’s health and about Harris’ policies and record — have cheered the selection of Walz while comically attempting to portray him as a moderate.“I grew up in a small town,” Walz said last month as he ramped up his bid to be named to the Democrats’ ticket. “JD Vance is dead wrong about what makes small-town America tick,” the governor said of former President Donald Trump’s running mate. “Small towns don’t work because everyone is closed-minded and prejudiced. They work because people mind their own damn business. JD Vance seems to have a real problem minding his.” Follow The Post’s coverage on Kamala Harris’ running mate Tim Walz: Kamala Harris chooses Minnesota Gov. Tim Walz as running mate Who is Tim Walz, Kamala Harris’ VP pick? Tim Walz signed laws catering to illegal migrants, giving them free healthcare, tuition Trump team says it’s relieved Kamala Harris chose ‘extremist’ Tim Walz: ‘An easy opponent’ Editorial: Kamala Harris bows to the radicals by picking lefty Tim Walz as her running mate “Mind their own damn business”? Walz actually created a COVID snitch hotline at the height of the pandemic, encouraging neighbors to rat each other out for breaking his extreme protocols. The hotline endured through 2022. That’s small-town values for you! “When somebody tells who they are, they — believe them,” Walz said Tuesday as he introduced himself to America in a folksy yet substance-free announcement speech. “[Trump] said he would ban abortion across this country, and he’ll do it whether or not Congress is there or not.” That’s just 100% false. Trump supports states’ rights on the issue, after the Dobbs ruling correctly left decisions about abortion up to the voters, not to the federal government. “I worked across the aisle on veterans issues, on agriculture and on ways to grow rural economies,” Walz claimed Tuesday about his legislative record. “I learned the art of compromise without compromising my values.” But as governor, he used a one-vote state Senate majority to force through a host of far-left policies. And media spin aside, do these sound like moderate positions? Walz supports sex changes for minors without parental permission.He’s for open borders and illegal crossings — and even told CNN in 2019 that he wanted to invest in a “ladder company” to help illegal migrants get over Trump’s border wall.He supports sanctuary cities. And a carbon-free electrical grid by 2040 for Minnesota, which has some of the coldest weather in the country. He installed tampon machines in boys’ school bathrooms. Supports free health care and free college for illegal immigrants and drivers’ licenses to boot. Supported a mandatory mask mandate in Minnesota. And of course he presided over the state during its 2020 riots, which resulted in $500 million in damage in Minneapolis, including the torching of a police precinct. Walz refused for days to quell the violence by bringing in the National Guard, then apologized when he finally pulled the trigger. But now the Harris-Walz campaign wants the country to believe that this team is riding squarely down the center lane. It’s the ultimate cheap fake marinated in spin and vibes and lies — all scripted and loaded into a Teleprompter.This pair, which has not received a single primary vote in a national contest, can get away with this, at least for now — because many in the media simply want Trump defeated, no matter what their advocacy journalism does to their irreparably broken profession.In the nearly three weeks since Harris became the Democratic nominee, she has yet to take one question on any matter of policy or substance. The same will undoubtedly be true for Walz.In the end, only a series of presidential debates will truly provide the American people with the contrast and choice that they are facing, and what is by far the most consequential election of our lifetimes. Whether those debates happen is another story, because Harris and Walz would love nothing more than to plead the Fifth all the way to November 5th.Kamala Harris and Tim Walz may be the slight favorites right now. But if this ticket somehow wins, know this: You won’t even recognize this country anymore. Joe Concha is the author of “Progressively Worse: Why Today’s Democrats Ain’t Your Daddy’s Donkeys” and a Fox News contributor.","summary":"Right on cue, our activist media cheered the selection of Walz while comically attempting to portray him as a moderate.","url":"https://nypost.com/2024/08/07/opinion/folksy-tim-walz-masks-his-radical-record-for-dems-ticket/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-u6pvbo406-1723067467685.jpg?quality=75&strip=all&1723053199&w=1200","video":null,"publish_date":"2024-08-07 22:50:28","author":"Joe Concha","authors":["Joe Concha"],"language":"en","source_country":"us","sentiment":0.02},{"id":253621708,"title":"“The Crucial Importance of the Upcoming US Election as Kamala Harris Outranks Trump in Polls”","text":"I’M beginning to get seriously worried that the poor Americans will spend the next four years doing the Kamala Walz. I know the US election maybe isn’t at the top of your list of stuff to worry about right now. But it’s deadly important. Not just for the Yanks, but for us too. And the polls right now are shifting fairly firmly in favour of the former Vice President Kamala Harris, who is denser than a sack of spanners. And her running mate — the even worse Tim “Wokey Wokey” Walz. Just a month or so ago Donald Trump looked as if he were going to cruise to victory against a senile sitting President, Joe Biden. Now, I know that in normal times that might not be something to celebrate. But boorish as Trump may be, his tenure as President was a damn sight better than anything we’ve seen from the almost dead Biden. During that time, Trump was leading in the polls, especially in the important swing states that often determine the outcome of American elections. There was a rather aggressive move by the Democrats to remove Joe Biden from his position. Some senior members of the Democratic party threatened Joe with the need to resign. They even went as far as to joke about taking away his catheter and beloved Werther’s Originals. As a result of this pressure, Biden stepped down and Kamala Harris, who many consider as an ineffective vice president chosen to please the more progressive members of the party, was sworn in as his replacement. And the bad news keeps on coming. Because now Kamala has chosen a running mate who seems to me even dimmer than she is. And even further to the left. Walz is the governor of Minnesota, which has always been a fairly left-wing state. But even the lefties are sick of him there. He was a disaster as governor. Crime has soared under his watch — not least because he takes the left-wing line that we should probably abolish the police completely and let everybody police themselves. That’s the policy which has turned all of America’s liberal cities into crime-ridden hellholes. Turns out that if you defund the police, the local crims don’t turn into saints and stop nicking stuff. They do it all the more. Anyway, folks are getting the hell out of Minnesota at a remarkable rate. Largely because of the appalling crime rate. All this in what was once one of the USA’s safer states to live in. Hostile to our interests Student achievement has also dropped alarmingly. Some say this is the consequence of “progressive” policies to increase ethnic diversity and so on. You can expect all that dangerous rubbish to be on the agenda for the Harris-Walz presidency. Every bit of right-on rubbish that has plagued the country for two decades. If that was the sum total of the problems, we could just leave the Yanks to get on with it. Sadly, though, it isn’t. The problem for us is that a Harris-Walz presidency would be hostile to our interests. Democrat presidents usually are — even the half decent ones like JF Kennedy. And the further left they are, the more hostile to the UK they become. The last thing we want in the White House is an administration which will give us trouble over trade, defence and international relations generally. So, if you have a minute to spare, offer a small prayer that the Americans wake up soon. And send Walz back to Minnesota to cause more damage there. Board of Paris olympics THE only time I’ve really been interested in the Olympics was very briefly in 1972. It was the men’s basketball final. Between the red-hot favourites, the USA. And a country who were not at that time their closest friends, the USSR. I think it must be the only time a basketball match made nuclear war more likely. The Russkies won by one point with the last throw of the game. And there was uproar – it was almost certainly a fix by the commies. Anyway, I wish we could have something like that in these games. The only other time I get excited is looking at the medal table. I like to see Britain in third place at worst, behind the USA and China. This time it will be enough for me if we beat the French, though. I don’t even care about the Aussies, for a change. Just beat the French, on their own ground. With their worm-infested food and poo-infested river. Horror holiday THE Government is drawing up plans to evacuate 16,000 Brits from Lebanon. The country looks like it might soon be at war with Israel. But even when it’s not at war with Israel, it’s hardly the safest place in the world, is it? What are the Brits doing there? Are they on some sort of special package deal holiday? “We’re sick of being hated by the Spanish, so our travel agent found a lovely little hotel. “It’s called The Hezbollah Jihadi Palms and it’s in a place called Beirut. “We can’t wait!” Lots at steak HERE’S a heart-warming story. A vet called Polly Dugmore rescued a whole herd of calves which were in danger of drowning. The animals had wandered on to a beach in Cornwall. And were trapped by the incoming tide. Bit of a mixed blessing for the calves, mind. Because these were Wagyu beef calves, prized for their succulent flavour. So probably a case of: “OK you calves. You’re all safe. Now, if you wouldn’t mind climbing up that ramp into the lorry, please. One at a time, chop chop. So to speak.” lI JUST read that some 5,700 kids are waiting for transgender care treatment in the UK. All under 18 years old and one of them younger than five. Now, hang on a minute. I thought all of this dangerous nonsense was meant to have been stopped? Remember the Cass Review of transgender services? Why is this sort of thing still taking place?","summary":"Internewscast Journal\n\nInternewscast\n\n\nI’M beginning to get seriously worried that the poor Americans will spend&#8230;\n\n\nThis Post: &#8220;The Crucial Importance of the Upcoming US Election as Kamala Harris Outranks Trump in Polls&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/the-crucial-importance-of-the-upcoming-us-election-as-kamala-harris-outranks-trump-in-polls/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/08/317c9bff-d4ef-4b32-ac62-87073db95661.jpg?strip=all&w=960","video":null,"publish_date":"2024-08-07 22:48:54","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.686},{"id":253623400,"title":"From the classroom to the White House: Walz as Harris' running mate","text":"A top Minnesota Democratic-Farmer-Labor operative said Walz is well positioned to help Harris carry those crucial states. “Tim Walz is a great pick because in addition to his blue collar background and his cultural fit with the blue wall states, as governor his accomplishments are mostly about improving the lives of middle class and working families,” said Jeff Blodgett, who was chief strategist for Sens. Paul Wellstone and Al Franken. “This ticket can now powerfully argue that they are the team that is squarely on the side of America’s working families.” Walz is married to Gwen Walz, a career educator, and is father to an adult daughter Hope and teenaged son Gus, both born with help of in vitro-fertilization. IVF, which accounts for about 2.5% of all children born in the United States, has become a potent political issue in the past year after the Alabama Supreme Court ruled that embryos created during IVF are legally classified as children; fertility clinics paused use of the technique out of fear of civil and criminal liability. “It’s not by chance that we named our daughter Hope,” Walz said in response to the IVF controversy. Walz will use his compelling biography to introduce himself to the American public, but he will also be forced to defend his five-and-a-half-year tenure as governor of the nation’s 22nd most populous state. First term: managing crisis Walz’s first term especially was marked by the management of crises, from the COVID-19 pandemic to the aftermath of the police killings of George Floyd and Daunte Wright. Republicans will almost certainly broadcast images of flaming buildings on Lake Street in Minneapolis, including the 3rd precinct headquarters of the Minneapolis Police Department. On the second night of protests, as a Lake Street Target was being looted, Minneapolis Mayor Jacob Frey called Walz’s office and requested help from the National Guard, he later told the Star Tribune, which corroborated the account with state and local records. Walz publicly assumed command Thursday morning, which is when he called up the National Guard. They were on the ground Thursday evening, but still the city burned; MPD evacuated the 3rd precinct headquarters that night, and looters and rioters ransacked it. The fires continued Friday night. Former Minnesota Senate Majority Leader Paul Gazelka alleged recently that he called the White House, then occupied by former President Donald Trump, and lobbied the administration to push Walz into action. Walz blamed outsiders for the destruction, a claim that turned out to be mostly false. Less than a year later, the Twin Cities was on edge at the outset of the trial of former police officer Derek Chauvin, accused of Floyd’s murder. That’s when Brooklyn Center officer Kim Potter killed Daunte Wright, an unarmed Black man, when she drew and fired her service weapon instead of her Taser, as she said she intended. As protests and scattered looting broke out, Walz took a much firmer line, imposing a curfew on three urban counties and bolstering the defense of the Brooklyn Center police headquarters with a massive State Patrol presence. As during the Floyd protests, journalists and demonstrators were targeted by police, who used tear gas and less-lethal projectiles to subdue crowds. Walz was criticized for the response, including by many progressive Democrats who broke with him. Even as Walz dealt with the Floyd and Wright police killings and their aftermath, he was also managing the public health crisis of COVID-19. He leaned on Minnesota’s robust public health assets, including the University of Minnesota and the Mayo Clinic. The state’s COVID-19 death rate and overall mortality rate during the pandemic were among the nation’s lowest. Republicans attacked his COVID-19 restrictions as tyrannical, including a directive to avoid large family gatherings during the holiday season of 2020. They also criticized—and in some cases filed lawsuits over—his restrictions on youth sports, which accompanied long periods of remote schooling. The administration’s aggressive posture toward the pandemic extended to getting help to people who needed it, including workers suddenly out of work and hungry children. Minnesota was the first state to get unemployment benefits out to gig workers. Critics say the Walz administration was also blind to a massive fraud happening in plain sight. Walz’s Department of Education administered a federal program intended to feed hungry children during the pandemic but instead became a cash cow for fraudsters. Legislative audits have sharply criticized the administration’s failure to stop more than $250 million in fraudulent payments in what has become known as the Feeding Our Future fraud; 70 people have been charged and nearly two dozen convicted. “Under Governor Walz’s watch, fraud and waste in our state public programs has exploded,” Demuth charged. Second term: Progressive wish list becomes reality Despite the tumultuous tenure, Walz was easily reelected in 2022 and delivered major coattails: A Democratic trifecta took command of state government in 2023 for the first time in nearly a decade. Democrats got to work on a wish list which has become the envy of progressives across the country. Walz pushed for a tax rebate that came in smaller than what he proposed but still amounted to $1,300 for a family of four. Lawmakers passed a package of $2.6 billion for infrastructure, which has allowed Walz to pose for photos at a bevy of construction projects on roads, bridges, and other key infrastructure. The deal included $300 million for nursing homes, which are newly subject to a labor-friendly sectoral bargaining system. In one of the Legislature’s first official acts, Minnesota codified abortion rights, becoming a haven in the Upper Midwest even as neighboring states enacted restrictions. Walz, who was once a fierce gun rights supporter until the 2018 massacre at Parkland High School—which happened as he campaigned for governor—signed two gun control bills in 2023. One extended background checks to all private sales, while a so-called red flag law allows a judge to take a person’s guns if he’s deemed a threat to himself or others. Walz signed a bill to restore voting rights to people leaving prison. Undocumented people can now get a driver’s license thanks to a bill Walz signed. A new law mandates a carbon-free electric grid by 2040. It’s not yet clear what impact these policies will have on the future of Minnesota. On measures like life expectancy, family income, unemployment, education attainment, and violent crime, the Minnesota metrics during Walz’s tenure have mostly risen and fallen alongside national trends, with Minnesota near the top in many of these quality-of-life metrics. Those measures don’t apply to all Minnesotans, however. The gap between white and Black homeownership in Minnesota is 48 percentage points, for instance. Walz and Democratic lawmakers say that’s precisely why they passed a robust first-time homebuyer assistance program for people with modest incomes. Walz has said his goal is to make Minnesota the best place in the nation to raise a family, including factors like cost-of-living, housing affordability, good paying jobs, education, and child care. Unfinished business: education The most troubling metric for Walz, who as a teacher was presumed to be well positioned to be an education governor, is the state’s lackluster performance on student achievement tests in recent years. Minnesota ranks in the top five best states for children, according to a scorecard compiled by the Anne E. Casey Foundation. But in the same study, Minnesota’s education system dropped to 19th. Minnesota has long struggled with some of the nation’s worst opportunity gaps, especially for Black and Indigenous students, even as the student population has become steadily more diverse over time. Walz told the Star Tribune in 2019 that his tenure should be judged by how well he closes the gaps: “It’s a reality I clearly understood and I said during the campaign that I’ll be judged and should be judged by how well we close [those disparities], as long as we’re given the tools, and I take that responsibility,” he said.","summary":"by J. Patrick Coolican, Minnesota Reformer\n\n\n\nMinnesota Gov. Tim Walz fused his everyman personality with an optimistic progressive message to win the most important audition of his political career the past few weeks, winning the quick admiration of Democratic activists—and Vice President Kamala Harris, who announced&nbsp;Walz as her running mate Tuesday.\n\n\n\nHarris’ selection of Walz rockets the former geography teacher from Midwest obscurity into the highest stratosphere of American politics, potentially joining Hubert Humphrey and Walter Mondale as Minnesotan vice presidents.\n\n\n\nWalz’s selection follows his splashy arrival on the national stage during a series of high-profile TV interviews since President Joe Biden dropped out of the race last month and threw his weight behind his vice president.","url":"https://www.dailykos.com/story/2024/8/7/2261046/-From-the-classroom-to-the-White-House-Walz-as-Harris-running-mate?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1330831/story_image/P1071064-2048x1365.jpg?1722954274","video":null,"publish_date":"2024-08-07 22:45:08","author":"Minnesota Reformer","authors":["Minnesota Reformer"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.055},{"id":253623712,"title":"Breitbart Business Digest: Democrat Economic Optimism Surges, Republican Optimism Fades","text":"Don’t Shrug Off the Kamala Surge The Kamalanomenon is having a big impact on how people view their economic prospects, but you have to look at the data closely to see it. The YouGov surveys conducted for The Economist began asking Americans in the middle of July how they saw their household’s financial prospects would fare one year from now. Given the depressed state of most surveys of consumer sentiment, you will not be surprised that just 22 percent said that they expect to be financially better off in a year. Another 35 percent said they expect their household financial situation to be mostly the same. Twenty-two percent said they thought things would get worse. And twenty-two percent said they were not sure. The most recent survey, conducted between August 4 and 6, found only small changes to those figures. Twenty-four percent said they think they’ll be better off, 20 percent said they expect to be worse off, 38 percent think things will be about the same, and 18 percent said they weren’t sure. A Big, Hidden Partisan Shift in Economic Optimism The relative stability in the shares of the pessimists and the optimists, however, masks some big changes in who is optimistic and who is pessimistic. The mid-July survey found that one-third of people who said they intend to vote for Biden expected to be better off in a year. Forty-four percent of Biden supporters expected household finances to be about the same. Just 10 percent expected to be worse off. Among Trump supporters, 19 percent said they thought they would be better off, 28 percent expected things to be about the same, and 33 percent expected to be worse off. In the survey taken a week later, there was some movement. Trump supporters became more positive about their prospects. The share of Trump supporters expecting things to get better for their household rose to 24 percent. The share expecting their household finances to worsen fell 10 points to 22 percent. The driver here was likely the collapsing chances of Biden being elected to a second term, culminating with his announcement that he was stepping down from the race and endorsing Kamala Harris. In the mid-July survey, 91 percent of Trump supporters said they expected Trump would win in November. By the third week of July, this was up to 95 percent. Among the broader public, the share saying they expected Trump would win rose from 49 percent to 52 percent. There was already a building enthusiasm for Kamala Harris among Democrats, but it was not yet seeping into the views of Trump supporters. In mid-July, only 26 percent of voters said they expected Biden would win, including 63 percent of Biden supporters. By the third week of July, 31 percent of voters said they expected Harris would win, including 75 percent of self-declared Harris supporters. Two weeks ago, the share of the broader public who expected Harris to win rose to 40 percent, and the share of Harris supporters who expected their candidate to win jumped to 80 percent. Donald Trump’s share of voters who expect him to win fell 10 points to 42 percent. Most notably, the share of Trump supporters who thought he would win fell to 87 percent—an eight point decline in a single week. There was some movement in that survey from the final week of July in the household financial prospects question—but not much. The share of Harris supporters expecting to be better off was unchanged, and the share of Trump supporters expecting to be better off ticked down two points to 22 percent. Harris Takes the Lead The big shift happened in the most recent survey. Harris now leads among voters when it comes to who they think will win, at forty percent versus Trump’s 38 percent. Among Harris supporters, 81 percent say they think she will win. Among Trump supporters, 81 percent say they think he’ll win—down another six points from the survey one week prior and down 14 points over the past week. The once wide political optimism gap between supporters of Trump and his Democrat rival has closed. In the new survey, just 15 percent of Trump supporters say they expect to be better off, a seven point decline. Forty percent of Harris supporters say they think they’ll be better off in a year, a six point increase. In other words, Harris has inspired not just confidence in her supporters that she can get elected but also that her election will improve their household finances. Meanwhile, Trump supporters have lost confidence in their candidate’s prospects and their own financial prospects. These big shifts show that the race for the president has dramatically shifted in recent weeks. It’s no wonder that has resulted in a surge in volatility both up and down in the stock market.","summary":"The Kamalanomenon is having a big impact on how people view their economic prospects, but you have to look at the data closely to see it.\n\n\nThe post Breitbart Business Digest: Democrat Economic Optimism Surges, Republican Optimism Fades appeared first on Breitbart.","url":"https://www.breitbart.com/economy/2024/08/07/breitbart-business-digest-democrat-economic-optimism-surges-republican-optimism-fades/","image":"https://media.breitbart.com/media/2024/08/kamala-harris-6-20-24-flickr-640x335.png","video":null,"publish_date":"2024-08-07 22:40:44","author":"John Carney","authors":["John Carney"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.861},{"id":253623128,"title":"Will Tim Walz’s selection as Harris’s running mate shift the US election?","text":"Washington, DC – In the United States political circles, conventional wisdom dictates that voters only care about the candidate atop the presidential ticket, not the running mate. While vice presidential picks can play a role in public opinion, voters cast ballots mostly for the headliners — or so the argument goes. In the 2024 presidential race, that means much of the attention will fall to Vice President Kamala Harris and former President Donald Trump, the Democratic and Republican nominees, respectively. But as Harris zips across the country on a campaign blitz, she is poised to put that logic to the test. She is campaigning side by side with her newly minted running mate, Minnesota Governor Tim Walz, stopping in the battleground states of Wisconsin and Michigan on Wednesday. Democratic strategists say Harris’s selection of Walz is part of an effort to pull ahead in a neck-and-neck presidential race. His avuncular personality, progressive messaging and middle-class Midwestern roots seem well-suited to answer specific Democratic needs: The party needs to shore up its progressive base and shed the shroud of coastal elitism if it hopes to reclaim the White House in November. But take that optimism about Walz with a grain — or a shaker full — of salt, said Allan Lichtman, a history professor at American University. “You can take all the punditry on the effect of the Walz pick on the election’s outcome and do with it what the great philosopher David Hume said you should do with works of superstition: Consign it to the flames,” Lichtman said. “There is no evidence that a VP pick influences the outcomes of a presidential election.” Still, with an unconventional presidential race unfolding, some analysts question how Walz’s selection might be perceived among voters over the long term — and whether he may indeed buoy Harris’s prospects. An unusual race Walz’s appointment to the Democratic ticket on Tuesday came as the latest chapter in an unusual campaign season. Less than three weeks ago, the race seemed destined to pit two of the oldest nominees in presidential history against one another on election day: Trump and the incumbent president, Democrat Joe Biden. Trump had already notched his share of firsts during the presidential race. In May, the Republican leader became the first US presidential candidate ever to be convicted on criminal charges. He is also the only former president in recent history to mount a serious effort to overturn a previous election loss. But a new twist in the election saga came on July 21, when President Biden dropped out of the race after mounting concerns about his age. Biden had been the Democratic frontrunner. Never in modern history had the presumptive nominee dropped out so late in the race. His decision upended the Democratic ticket with just months until the vote. But Biden’s departure paved the way for Vice President Harris to lead the Democratic ticket. Her choice to pick Walz as a running mate came on the same day as she was officially certified to be the party nominee. Lichtman, the American University professor, explained that Walz ticked a number of boxes for the Harris campaign. A vice presidential candidate must have at least a rudimentary compatibility with their running mate and a level of experience to show they would be able to fill the president’s seat, Lichtman said. Otherwise, the running mate could reflect poorly on the presidential candidate’s decision-making skills. Other than that, vice presidential picks are often sidelined or dismissed as less relevant to political campaigns. Trump himself espoused that view. In July, he selected JD Vance, a 40-year-old senator from Ohio, to be his running mate. But when asked about his decision last week, Trump offered a startling moment of candour. “Historically, the vice president, in terms of the election, does not have any impact,” Trump said. “You have two or three days where there’s a lot of commotion as to — like you’re having it on the Democrat side — who it’s going to be. And then that dies down. And it’s all about the presidential pick.” ‘Just enough votes’ Barbara Perry, a professor in presidential studies at the University of Virginia’s Miller Center, acknowledged Trump’s position is “not totally incorrect” historically. But she questioned whether that history will apply in a race that continues to veer into uncharted territory. Perry added that history has been an unreliable predictor in modern US presidential races, which are increasingly decided by razor-thin margins. In the last six presidential elections, just one race — 2008’s match-up between Barack Obama and John McCain — was decided by more than five percentage points nationally. In two of those last six elections, the victorious candidates lost the national popular vote, a phenomenon that had not happened since 1888, according to the Council on Foreign Relations. That includes George W Bush’s win over Al Gore and Trump’s victory over Hillary Clinton in 2016. In both cases, the Republican candidate prevailed over the Democratic one. Their wins came as a product of the Electoral College system, in which each state represents a certain number of electors. The vast majority of states award all their electors to whichever candidate wins the most votes in the state, no matter how narrowly. The candidate who earns the most electors overall becomes president. The Electoral College system has been a “concern for Democrats” in recent years, Perry said. “They can run up the score in the popular vote in places like California and New York and come out millions of votes ahead of the GOP nationally, but the Electoral College is now tipped towards the GOP,” Perry explained. Harris herself is from California, a solidly blue state. To win the presidency, she needs support in key swing states in the South and Midwest, where a lot of Electoral College votes are up for grabs. “So getting a vice president who could appeal in Michigan could appeal in Wisconsin — maybe in Pennsylvania and maybe in Arizona as well — [has become a top priority],” Perry said. “Those are key, key battleground states.” Walz could shore up “just enough votes to help Kamala Harris win”. Can Walz be a difference-maker? As with most election predictions, only time will tell if Walz can make an impact on the outcome of the race. The Minnesota governor had little in the way of a national profile until he emerged on Harris’s short list of possible vice presidential picks. That list, composed primarily of white men from battleground states, reflected the long-held political trope that a successful presidential ticket must contain a white man as a “balancing” or reassuring force. Harris herself is Black and Asian American. Kimberly Peeler-Allen, the co-founder of Higher Heights, a group that aims to support Black women in politics, described the strategy as using a white male politician as a “validator” for some voters. “It’s going to be a long time before we are, as a country, comfortable with having two people of colour on the ticket or even two women, as unfortunate as that is,” Peeler-Allen told Al Jazeera. “But this is a racist, sexist, patriarchal society that we live in, and we can’t escape that.” American University’s Perry also said the campaign tactic reflects a “paternal view of presidents going back to George Washington” and a legacy of pairing a history-making candidate with a running mate considered more palatable to those wary of change. She pointed to the 1960 presidential race, which featured John F Kennedy. He was the youngest US presidential candidate ever, and he would go on to be the first Catholic president in the country’s history. But to “balance” his ticket, Kennedy tapped Texas politician Lyndon B Johnson, a Protestant 11 years his senior, as his running mate. Walz has also drawn comparisons to Biden, when the latter was tapped as a running mate for Obama’s historic run in 2008. That election saw Obama become the country’s first Black president. Analysts say both Biden and Walz are seen as charismatic, outspoken older white politicians with ties to battleground states: Pennsylvania in Biden’s case and, in Walz’s, Minnesota. Born in Nebraska and educated at a state college, Walz’s bona fides as a former high-school teacher, American football coach and military veteran may make him a particularly appealing political asset. Some analysts see him as an antidote to the Trump campaign’s criticisms that Harris is a “radical liberal” out of step with middle America. The Harris team has already sought to portray Walz as a champion of the middle class. In their first joint appearance on Tuesday, Harris played up his image as a unifying force. “Since the day that I announced my candidacy, I set out to find a partner who can help build this brighter future — a leader who will help unite our nation and move us forward, a fighter for the middle class, a patriot who believes, as I do, in the extraordinary promise of America,” Harris said. “I am here today because I found such a leader.” Walz, in turn, has won attention for his plainspoken manner. He sparked an internet-ready meme when he described the current Republican ticket as, simply, “weird”. Arshad Hasan, a Democratic political strategist, is among those who see parallels between Walz and Biden. “The caricature of Uncle Joe is generally a beloved caricature,” Hasan said. “So now we get an Uncle Tim. We’re still seeing something like that on the ticket. This folksy Midwestern charm.” He believes Walz’s charisma could prove particularly relevant to battleground states like Michigan, Wisconsin and Pennsylvania. Winning the trio of states is considered the surest path to the White House, as has proved the case for Trump in 2016 and Biden in 2020. Hasan pointed to Walz’s embrace of Midwestern cuisine as something that is resonating with local voters in the region. “I’m already seeing memes about people bringing hotdish to the Democratic Convention,” he said, referring to a beloved Midwestern casserole. Party energiser? Hasan explained that Walz’s entrance into the race may also shore up the diverse segments of the Democratic party. After all, when Walz was named to the Democratic ticket, both progressives and centrists hailed the decision. On social media, progressive lawmaker Alexandria Ocasio-Cortez quipped that the Democratic Party was showing “disconcerting levels of array” after months of in-fighting. That is significant since some political analysts argue that the race may come down to who can turn out their base in the largest number, rather than winning over independent voters or disaffected members of the opposing party. Hasan described Walz as a skilled communicator of progressive policies and the “preferred choice” of that flank of the party. He also noted that other contenders for the running-mate slot would have roiled certain Democratic interest groups. Senator Mark Kelly of Arizona, for example, was considered a top candidate to be Harris’s running mate, but he had clashed with labour unions in the past. Another contender, Pennsylvania Governor Josh Shapiro, had received criticism for his staunch support of Israel’s war in Gaza, which has killed at least 39,677 Palestinians. In recent months, Shapiro compared pro-Palestine campus protesters to the Ku Klux Klan, making him a non-starter for some Democratic voters. Previously, as a member of Congress, Walz had also pushed for unconditional aid to Israel, but advocates say they are heartened by his appeals for a Gaza ceasefire. He has also shown support for the hundreds of thousands of voters who cast “uncommitted” ballots during the Democratic primary season to protest Biden’s stance on Israel. In a statement on Tuesday, Elianne Farhat, a senior adviser to the “uncommitted” movement, said Walz “has demonstrated a remarkable ability to evolve as a public leader”. She called on Walz to support an arms embargo. “While his past positions as a Congressman may have conflicted with anti-war voters, we hope he can evolve on this issue as he has on others,” Farhat wrote.","summary":"Harris&#039;s choice for vice president has energised Democrats. But experts are split over if it will make a difference.","url":"https://www.aljazeera.com/news/2024/8/7/will-tim-walzs-selection-as-harriss-running-mate-shift-the-us-election?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2024/08/AP24220492002505-1723052541.jpg?resize=1920%2C1440","video":null,"publish_date":"2024-08-07 22:37:34","author":"Apps Support,Joseph Stepansky","authors":["Apps Support","Joseph Stepansky"],"language":"en","catgory":"politics","source_country":"QA","sentiment":-0.069},{"id":253622072,"title":"Biden, Harris Warn Of Trump Threat To Democracy As Election Looms","text":"President Joe Biden said Wednesday he is \"not confident\" Donald Trump would concede peacefully if he loses the US election, as the Republican's rival Kamala Harris warned a Trump victory would usher in a lawless administration set on curtailing Americans' freedoms.Trump has been impeached twice and indicted twice over various alleged attempts to cheat in the 2020 election -- which he still has not acknowledged he lost -- and was convicted of 34 felonies over a hush money scheme to deceive voters in 2016.His false claims of widespread fraud in 2020 preceded the storming of the US Capitol -- and the wounding of more than 100 police officers -- by a violent mob determined to prevent the certification of his defeat.\"If Trump loses, I'm not confident at all,\" Biden told US network CBS after he was asked if he expected a peaceful transfer of power in 2025. \"He means what he says. We don't take him seriously. He means it.\"Biden's remarks, which air fully on Sunday following a brief preview by CBS, came soon after Harris had sounded the alarm over Trump's conduct in the opposite scenario -- victory for the 78-year-old billionaire.Speaking to a crowd in Eau Claire, Wisconsin as part of a multi-day tour of swing states, she used the former president's own words -- as well as his felony convictions -- to argue that a second Trump term would be a disaster for the country. She pointed to his vow to be a dictator \"on day one,\" his threats to weaponize the Justice Department against his political enemies and his 2022 comment demanding the \"termination\" of constitutional provisions over his defeat in the last election.\"Someone who suggests that we should terminate the constitution of the United States should never again have a chance to stand behind the seal of the President of the United States,\" Harris said, exhorting Americans to reject the \"chaos, fear and hate\" of Trumpism.The 59-year-old vice president was on day two of a blitz of the most closely-fought election battlegrounds as she seeks to capitalize on a surging excitement since she replaced President Joe Biden atop the Democratic ticket in July.Harris and her new running mate, Minnesota Governor Tim Walz, will take their double act later to a rally in Detroit, Michigan and there will be further stops through Saturday in the racially diverse \"Sun Belt\" states of Arizona and Nevada. In Wisconsin, she and Walz sketched out a vision of future prosperity for the middle class, repeatedly speaking of their pride in the country and making a virtue of the patriotism more associated with Republican rhetoric in the pre-Trump era. But Harris cautioned that allowing Trump back into office would take the country backwards.Recalling that while she took on frauds and sexual abusers as California's attorney general, Trump had been found liable for the sexual assault of a New York writer and had been both convicted and sued for millions of dollars for fraud. \"In this campaign, I'll tell you, I will proudly put my record against his any day of the week,\" she said.The rally came a day Harris and Walz held the biggest Democratic event of the election so far in front of a raucous crowd of around 14,000 in the crucial swing state of Pennsylvania.Seen initially as an outsider for the VP pick, Walz enjoyed viral success in distilling Democrats' attack lines against Republicans into a relatable one-word characterization -- \"weird\" -- that propelled him up Harris's shortlist.The 60-year-old former Army National Guard officer railed against the \"dangerous and backward beliefs\" of Trump and his running mate, US senator J.D. Vance, leading a chant of the Harris campaign slogan \"We're not going back.\"Harris selected Walz over Josh Shapiro, the moderate governor of the highly-prized swing state of Pennsylvania, and Republicans have sought to brand her vice presidential pick as much further left than the candidate who lost out.Trump has declined to focus on his opponents' vulnerabilities on policy, instead favoring personal attacks against Harris that have had little impact on her rise in the polls. The vice president has a 51-48 percent lead over Trump in the latest NPR/PBS News/Marist survey and has edged ahead by 0.5 percentage points in the RealClearPolitics nationwide average of polls.The organization had Trump three points ahead of Biden at the point when the president made way for Harris, 17 days ago.","summary":"President Joe Biden said Wednesday he is \"not confident\" Donald Trump would concede peacefully if he loses the US election, as the Republican's rival Kamala Harris warned a Trump victory would usher in a lawless administration set on curtailing Americans' freedoms.","url":"https://www.ibtimes.com.au/biden-harris-warn-trump-threat-democracy-election-looms-1850381","image":"https://d.ibtimes.com.au/en/full/1856132/democratic-presidential-candidate-kamala-harris-her-running-mate-tim-walz-held-biggest-democratic.jpg","video":null,"publish_date":"2024-08-07 22:36:11","author":"Kamil Krzaczynski With Frankie Taggart In Washington","authors":["Kamil Krzaczynski With Frankie Taggart In Washington"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.421},{"id":253623124,"title":"Steve Martin reportedly declines offer to play Gov. Tim Walz on ‘Saturday Night Live’","text":"News & Politics Steve Martin reportedly declines offer to play Gov. Tim Walz on ‘Saturday Night Live’ The comic legend turned down Lorne Michaels, according to the Los Angeles Times. Star Tribune August 7, 2024 at 10:33PM Steve Martin has reportedly declined \"Saturday Night Live\" creator Lorne Michaels' offer to play Minnesota Gov. Tim Walz on the show. (Patrick Harbron) “Only Murders in the Building” star Steve Martin has reportedly declined Saturday Night Live producer Lorne Michaels’ offer to play Gov. Tim Walz on the show, the Los Angeles Times reports. “I wanted to say no and, by the way, he wanted me to say no,” Martin told the newspaper. “I said, ‘Lorne, I’m not an impressionist. You need someone who can really nail the guy.’ I was picked because I have gray hair and glasses.” Social media users have obsessed over Walz since late July when he called former President Donald Trump and his running mate, Sen. JD Vance of Ohio, “weird people” during an appearance on MSNBC’s “Morning Joe.” This week, the online obsession with Minnesota’s governor reached a fever pitch when Vice President Kamala Harris chose him as her running mate. Walz’s public portrait has been fueled in large part by what some call his “big dad energy,” which can be best summed up as a uniquely midwestern blend of self-sufficiency served alongside a series of jokes that would prompt any teenager to perform an eye roll. Online commentators have pitched several other comedians who might tap into that sensibility to imitate Walz on the long-running sketch comedy show, which premieres its 50th season on Sept. 28. (Jim Gaffigan, anyone?) Maya Rudolph is set to return as Harris, the Times reports. But she cleared her calendar and even moved production of her Apple TV+ series in order to accommodate the gig. Martin didn’t want to do the same. “It’s ongoing,” he said. “It’s not like you do it once and get applause and never do it again.” Most Read News & Politics Meet the Walzes: Wife Gwen, two kids round out Minnesota’s first family News & Politics Who should play Minnesota Gov. Tim Walz on ‘Saturday Night Live’? Here are 10 picks. News & Politics Who is Tim Walz? Minnesota’s governor and Kamala Harris’ running mate, explained News & Politics Cargill billionaire’s foundation quietly closes after giving out unprecedented $500 million Most Read News & Politics Meet the Walzes: Wife Gwen, two kids round out Minnesota’s first family News & Politics Who should play Minnesota Gov. Tim Walz on ‘Saturday Night Live’? Here are 10 picks. News & Politics Who is Tim Walz? Minnesota’s governor and Kamala Harris’ running mate, explained News & Politics Cargill billionaire’s foundation quietly closes after giving out unprecedented $500 million","summary":"The comic legend turned down Lorne Michaels, according to the Los Angeles Times.","url":"https://www.startribune.com/steve-martin-mn-governor-tim-walz-snl-jim-gaffigan/600941950","image":"https://cloudfront-us-east-1.images.arcpublishing.com/startribunemedia/7UEWU6DXE5EG5NCRUIQI4ROT7A.jpg","video":null,"publish_date":"2024-08-07 22:33:10","author":null,"language":"en","source_country":"US","sentiment":-0.085},{"id":253621334,"title":"Takeaways From Tuesday’s Primaries in Michigan, Missouri, and Washington","text":"The night’s biggest news was the defeat of Rep. Cori Bush (D-Mo.) by St. Louis County district attorney Wesley Bell in the Democratic Party’s primary for Missouri’s First Congressional District. Bell won with 51.6 percent of the vote to Bush’s 45.6 percent. Several Jewish groups mobilized against Bush for allegedly “fanning the flames of anti-Semitism.” Related StoriesPolls Close for Primary Elections in Missouri and Michigan8/6/2024Vulnerable Democrat, Trump-Backed Challenger Advance in Battleground Washington Primary8/7/2024 The America Israel Public Affairs Committee (AIPAC)’s affiliated super PAC, United Democracy Project, spent more than $8.6 million to oppose Bush and support Bell’s campaign. The race became the second-most expensive House primary contest in U.S. history, with $18.2 million spent, according to AdImpact. “All they did was radicalize me, and so now they should be afraid,” Bush said in an impassioned speech after the results were declared. “AIPAC, I’m coming to tear your kingdom down.” Bush had long trailed Bell in opinion polls ahead of the primary. Bush is the second Squad member and Israel critic to lose a House Democrat primary in 2024. The first was Rep. Jamaal Bowman (D-N.Y.), who, on June 26, lost the primary in New York’s 16th Congressional District to a pro-Israel candidate.Mike Kehoe Wins Missouri Gubernatorial PrimaryLt. Gov. Mike Kehoe of Missouri won the competitive Republican gubernatorial primary, a three-way race against state Sen. Bill Eigel and Missouri Secretary of State Jay Ashcroft, the son of Missouri’s former governor, U.S. senator and Attorney General John Ashcroft. The victor of Missouri’s Republican gubernatorial primary is heavily favored to win the general election. The state leans heavily Republican, with a Cook Partisan Voting Index score of R+10. As a result, the primary was highly contested, with several national figures endorsing different candidates. Kehoe received the support of term-limited Gov. Mike Parson (R-Mo.), who appointed Kehoe to the job in 2018. Eigel was endorsed by Rep. Matt Gaetz (R-Fla.), a prominent populist Republican in Congress, while Ashcroft was supported by former Gov. Mike Huckabee (R-Ark.) of neighboring Arkansas. Former President Donald Trump endorsed all three candidates, writing on Truth Social that “I can’t hurt two of them by Endorsing one. ... Choose any one of them - You can’t go wrong!” Kehoe’s win was somewhat of an upset. Most opinion polls ahead of the primary showed Ashcroft leading, though recent polls showed Kehoe and Ashcroft evenly matched. Ashcroft ended up placing third, behind Eigel. Kehoe will face state House Minority Leader Crystal Quade in the general election.Elissa Slotkin, Mike Rogers Win MichiganIn Michigan, Rep. Elissa Slotkin (D-Mich.) and former Rep. Mike Rogers (R-Mich.) won the Democrat and Republican Senate primary elections, respectively. Their victories confirm the general election match-up in November for Michigan’s highly competitive Senate race to succeed retiring Democrat Sen. Debbie Stabenow. Recent presidential polls have shown Trump, the Republican nominee, ahead in the state by several percentage points, which Republicans believe will have a down-ballot effect that can flip the seat held by Stabenow since 2001. Slotkin, however, leads Rogers across all Senate opinion polls by several percentage points. The primary results were never in significant doubt. Rogers was endorsed by Trump for his contest against former Rep. Justin Amash (R-Mich.), a Trump critic, while Slotkin faced no significant challengers in the primary. Michigan has a Cook Partisan Voting Index score of R+1.Bob Ferguson Prevails in WashingtonIn Washington state, Democrat Attorney General Bob Ferguson placed first in the primary over dozens of candidates, with 45.5 percent of the vote. Former Rep. Dave Reichert (R-Wash.), who served seven terms in Congress, came second with 27.9 percent of the vote. Washington has a Cook Partisan Voting Index score of D+8, meaning Ferguson is likely to win in November.Re-Match for Gluesenkamp Perez and KentRep. Marie Gluesenkamp Perez (D-Wash.) and her Republican challenger Joe Kent advanced to the general election after Washington’s Third Congressional District primary. Gluesenkamp Perez placed first with 46.9 percent of the vote, followed by Kent in second place with 38.4 percent. The 2022 race between Gluesenkamp Perez and Kent was narrowly decided. Her margin of victory was 0.83 percent or 2,629 votes. Gluesenkamp Perez, a first-term member, is regarded as one of the most vulnerable House Democrats in the 2024 election cycle, representing a Republican-leaning district in southwest Washington.","summary":"Rep. Cori Bush lost her primary, Mike Parson won a three-way gubernatorial race, and general election match-ups were decided for several key seats in Congress.","url":"https://www.theepochtimes.com/us/takeaways-from-tuesdays-primaries-in-michigan-missouri-and-washington-5701508","image":"https://img.theepochtimes.com/assets/uploads/2024/04/04/id5621757-Cori-Bush-and-Wesley-Bell-LSedit-300x180.jpg","video":null,"publish_date":"2024-08-07 22:31:54","author":"Arjun Singh","authors":["Arjun Singh"],"language":"en","source_country":"us","sentiment":-0.016},{"id":253623396,"title":"What does Trump’s new nickname for Kamala Harris mean? Wrong answers only","text":"Donald Trump's proclivity for nicknames is just one of the many ways he tries to demean people. Whether it’s “Lil Marco” Rubio, “Birdbrain” Nikki Haley, or “Lyin’ Ted” Cruz, the Republican presidential nominee is notorious for his insistence on using juvenile monikers. His latest petty task: trying (and failing) to come up with a nickname for Vice President Kamala Harris. He alternated between “Crazy Kamala” and “Lyin’ Kamala,” and even tried “Laughing Kamala”—but none of those iterations have really taken off. But now, Trump is panicking—and his nickname game is weaker than ever. Enthusiasm for Harris is building and her choice of Minnesota Gov. Tim Walz as a running mate only supercharged the Democratic Party’s momentum. In response, Trump’s cap-heavy rants on his Truth Social site have begun to include references to the Democratic presidential nominee as “Kamabla.” “Kamabla Harris is afraid to Debate me on FoxNews. She will be easier to defeat on the Debate Stage than Crooked Joe Biden, just watch!” Trump wrote on Monday. That same day, he also wrote that “Kamabla is the WORST V.P.” Trump has since used this inscrutable misspelling of Harris’ first name enough times that HuffPost’s S.V. Dáte reached out to the Trump campaign, and received this equally inscrutable response. CNN’s Kaitlan Collins was puzzled enough that she asked North Dakota governor and Trump campaign surrogate Doug Burgum what the hell “Kamabla” is supposed to mean. “I cannot comment on that,” Burgum responded, before pivoting to tired GOP talking points. Reporters and online sleuths have been trying to figure out the purpose of using “Kamabla.” Theories about the nickname’s origins range from Trump trying to be racist in some clunky way, to rapid cognitive decline, to a simple typo the narcissistic Trump is unwilling to correct. What do you think? Take the poll below and if you have any other theories, share them in the comments. Let’s make sure the only nickname Kamala Harris answers to is “Madam President.” Donate now!","summary":"Donald Trump's proclivity for nicknames is just one of the many ways he tries to demean people. Whether it’s “Lil Marco” Rubio, “Birdbrain” Nikki Haley, or “Lyin’ Ted” Cruz, the Republican presidential nominee is notorious for his insistence on using juvenile monikers.\n\n\n\nHis latest petty task: trying (and failing) to come up with a nickname for Vice President Kamala Harris. He alternated between “Crazy Kamala” and “Lyin’ Kamala,” and even tried “Laughing Kamala”—but none of those iterations have really taken off.&nbsp;\n\n\n\nBut now, Trump is panicking—and his nickname game is weaker than ever. Enthusiasm for Harris is building and her choice of Minnesota Gov. Tim Walz as a running mate only supercharged the Democratic Party’s momentum. In response, Trump’s cap-heavy rants on his Truth Social site have begun to include references to the Democratic presidential nominee as “Kamabla.”","url":"https://www.dailykos.com/story/2024/8/7/2261445/-What-does-Trump-s-new-nickname-for-Kamala-Harris-mean-Wrong-answers-only?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1327928/story_image/GettyImages-2162037810.jpg?1722293820","video":null,"publish_date":"2024-08-07 22:30:05","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.512},{"id":253621668,"title":"'Easier to cheat': Election lawyer calls on Georgia GOP leaders to sue officials plotting interference","text":"Democratic election lawyer Marc Elias on Wednesday urged Georgia's Republican leaders — the ones who adamantly refused Donald Trump's request for them to overturn the 2020 election — to take further action to prevent the same ploy in November. After the Georgia State Election Board on Tuesday passed a new rule that could jeopardize the process of free and fair elections, Elias is urging voters — as well as Georgia Republican Governor Brian Kemp, and Secretary of State Brad Raffensperger — to stay vigilant. \"Donald Trump lost the popular vote in 2016 by 3 million votes,\" Elias reminded MSNBC's Nicolle Wallace during an interview. \"In 2020 he lost the popular vote by 7 million votes. He and the Republicans are running out of runway. They are running out of ways to count on the electoral college and a bunch of other structural advantages that they have to counteract the fact that more Americans want to vote for Kamala Harris than want to vote for him. READ MORE: New rule to 'threaten' possibility of 'secure election results' in Georgia: report Elias continued, \"What they are left with is making it harder to vote, and easier to cheat. And the way they tried to cheat in 2020 — when I litigated and beat Donald Trump and his allies 60 times in court — is through what ballots get counted and what ballots don't get counted. In 2022, they tried it again.\" \"[Trump] knows he's going to lose the popular vote,\" the Democratic lawyer emphasized. \"He knows he's probably going to lose the election if it's free and fair, but he doesn't care...He is willing to do, and he's built a campaign and a party that is willing to literally do anything. If they are willing to storm the Capitol to prevent certification on January 6th, what do you think they would do in a county in Georgia?\" Wallace then asked, \"What is the protection against that, Mark?\" Elias replied, \"I think it's a few things. It's the great work that you and others in the media do that call attention to this. It's one of the reasons why I started Democracy Docket. It's important for people to know this is going on because for some of these elected officials or appointed officials, they have to live in these communities. They have to look at their neighbors. And it is harder for them to do that if what they are doing is public rather than in the darkness of night.\" READ MORE: 'I didn’t vote for anybody': GA GOP gov didn’t cast ballot for Trump in primary The Democracy Docket founder added, \"The second thing is that there's a big obligation here for the legal establishment. Lawyers, like me have a big obligation here. Every lawyer who swears an oath to the law and the constitution has an obligation to fight against this kind of activity. And then finally, we talk a lot about the fact that Republicans run Georgia, but where's Brian Kemp? How about they bring a lawsuit? How about [Georgia Republican Governor] Brian Kemp brings a lawsuit? The Secretary of State? Where are they?\" Watch the video below or at this link.","summary":"Democratic election lawyer Marc Elias on Wednesday urged Georgia's Republican leaders — the ones who adamantly refused Donald Trump's request for them to overturn the 2020 election — to take further action to prevent the same ploy in November.\n\nAfter the Georgia State Election Board on Tuesday passed a new rule that could jeopardize the process of free and fair elections, Elias is urging voters — as well as Georgia Republican Governor Brian Kemp, and Secretary of State Brad Raffensperger — to stay vigilant. \n\n\"Donald Trump lost the popular vote in 2016 by 3 million votes,\" Elias reminded MSNBC's Nicolle Wallace during an interview. \"In 2020 he lost the popular vote by 7 million votes. He and the Republicans are running out of runway. They are running out of ways to count on the electoral college and a bunch of other structural advantages that they have to counteract the fact that more Americans want to vote for Kamala Harris than want to vote for him.\n\nREAD MORE: New rule to 'threaten' possibility of 'secure ","url":"https://www.alternet.org/georgia-election-interference/","image":"https://www.alternet.org/media-library/image.jpg?id=53136861&width=1200&height=600&coordinates=0%2C85%2C0%2C86","video":null,"publish_date":"2024-08-07 22:28:29","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.305},{"id":253620936,"title":"November ballot will feature question to St. Paul voters on even-year local elections","text":"Despite gaining national attention, turn-out for St. Paul’s most recent mayoral and city council elections still paled in comparison to voter participation during even years, when the governor or the president of the United States were up for election. To boost turn-out, why not move local St. Paul elections to even years? It’s logic that Peter Butler, a former city financial analyst, has been trying to convince voters to subscribe to for years, across three different ballot petitions. On Wednesday, he finally broke through his foremost obstacle — getting a question about even-year elections on St. Paul’s November ballot. “The last time I looked, out of more than 800 Minnesota cities, 25 of us are on odd-year election cycles,” Butler said. “Most are on even years. That’s the default requirement in state statute.” Turn-out down in odd years Butler, who ran last year for the Ward 2 seat on the city council, said the problem with odd-year municipal elections is readily apparent from a quick glance at ballot figures. In 2023, about 48,500 St. Paul voters went to the polls to elect the city’s first all-female city council, a sizable drop from 2021 when some 60,000 voters weighed in on whether to approve rent control. “Apparently, four open seats and a sales tax referendum did not (increase turn-out),” Butler said. “We dropped by about 12,000 voters from 2021.” In contrast, more than 152,000 voters went to the polls in 2020 to choose between President Joe Biden and former President Donald Trump. Butler and a small coalition of even-year advocates recently presented Ramsey County Elections and the city with more than 5,500 signatures from St. Paul voters, reaching the requisite threshold of 5,437 valid signatures required by state statute for a ballot petition. Even that process was torturous, said Butler, noting the city clerk asked the county to add back more than 1,000 signatures that the county had rejected. Ballot question approved — with concerns The St. Paul City Council approved Butler’s ballot question on Wednesday, but not without some members raising concerns. Council President Mitra Jalali, who had looked this month into her legal options, called approving the question for ballot “a procedural action” only and not an indication of council support for even-year elections, which would add an extra year of service for the council and one three-year term for the next mayor during the transition. She said she would soon issue a public statement in opposition, alongside other council members. “In my personal capacity, I am extremely concerned about changing (the election schedule),” said Jalali, in an interview this week. “It’s not a simple thing to reschedule an election. State law does not contemplate ranked-choice voting in the ballots that print state-year elections.” “There’s been so many implications here that I think have not been considered, and that could negatively impact our voters,” she added. Opposition from mayor, others The prospect of even-year municipal elections has drawn opposition from St. Paul Mayor Melvin Carter and other DFLers, who have expressed concern that important local races will be overshadowed by better-funded statewide and national races. If city council races get lost in the shuffle, that could have negative consequences for campaign fundraising, volunteerism, debate attendance and other aspects of municipal elections. St. Paul chooses its mayor and city council through ranked-choice election, meaning there is no political primary to whittle down the field and no limit to how many candidates can appear on an Election Day ballot. Leading up to an even-year municipal election, it’s possible that after presidential, gubernatorial and other state office campaigns have knocked on a voter’s door, another eight city council candidates or more could follow. “It’s always harder to fundraising and volunteers when there’s other races on the ballot,” Butler acknowledged. “The people who donate to Mayor Carter also probably donate to candidates in the U.S. Congress, the U.S. Senate and presidential race. But most Minnesota cities are on even years. They’re somehow getting the job done.” Signatures rejected — and added back After Butler submitted his petition for a charter amendment, Ramsey County Elections rejected 1,150 signatures last month, most of which St. Paul City Clerk Shari Moore requested they add back just a week later after reviewing some added documentation. “Most of the add-backs were because someone had included a house number and street name but not the word ‘avenue’ or ‘street,’ so very insignificant reasons to reject a signature,” Butler said. “Someone might have written ‘2020 Lincoln,’ but they forgot the word ‘Avenue’ so they were initially scratched. There was one where someone misspelled Snelling with one ‘l,’ so she had them add it back in.” “This is my third petition, and the first two never had that type of scrutiny,” Butler added. “I strongly believe there was a partisan attempt to keep us off the ballot.” If even-year elections are approved in November, Butler said the next city council would be elected in 2028, requiring the existing city council to serve one extra year. An odd-year mayoral election next year would select a mayor for a one-time, three-year term, before resuming a normal cycle on even years. Childcare, early learning also on ballot Another question on St. Paul’s November ballot will ask voters whether to approve a 10-year property tax increase to raise subsidies for childcare and early learning programs. If approved, the tax levy increase would raise $2 million in the first year, $4 million in the second year, $6 million in the third and so on for a decade to fund childcare subsidies for low-income families first, with the hope of expanding those subsidies using philanthropy or other funding sources to include a wider net of families.","summary":"The St. Paul city council and mayor would move to even years after one five-year and three-year transition term, respectively.","url":"https://www.twincities.com/2024/08/07/november-ballot-will-feature-question-to-st-paul-voters-on-even-year-local-elections/","image":"https://www.twincities.com/wp-content/uploads/2024/03/STP-L-jea-14-STATE_OF_CITY-0311.jpg?w=1024","video":null,"publish_date":"2024-08-07 22:26:12","author":"Frederick Melo","authors":["Frederick Melo"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.295},{"id":253621332,"title":"Project 2025 Leader Delays Book With Forward Written by JD Vance","text":"Heritage Foundation President Kevin Roberts, head of the Washington think tank that created the 2025 Presidential Transition Project, was due to publish the book “Dawn’s Early Light: Taking Back Washington to Save America” on Sept. 24. Sen. JD Vance (R-Ohio), Trump’s vice presidential running mate, wrote the foreword. Roberts announced Wednesday that he would delay his book’s publication until after the election amid efforts by Democrats to associate the initiative with Trump. Amazon now lists the book’s release date as Nov. 12, 2024, one week after Election Day. Related StoriesHead of Heritage Foundation’s Project 2025 Steps Down7/30/2024Trump Allies Distance Themselves From Project 20257/7/2024 Roberts took over leadership of Project 2025 after its director, Paul Dans, resigned amid criticism of the initiative. “Under Paul Dans’ leadership, Project 2025 has completed exactly what it set out to do: bringing together over 110 leading conservative organizations to create a unified conservative vision, motivated to devolve power from the unelected administrative state, and returning it to the people. This tool was built for any future administration to use,” Roberts wrote on X in a statement praising Dans’s work upon his departure. He added, “I look forward to leading this team to continued success.”Project 2025 CriticismIn recent weeks, top Democrats have asserted Project 2025’s policy ideas will be implemented by Trump’s administration if he wins this year’s presidential election. The initiative’s “Mandate for Leadership,” a 922-page policy book, advocates reclassifying many civil servants as political appointees to enable their dismissal, banning abortion drugs, abolishing the Department of Education, and significantly curbing immigration, among other proposals. “Project 2025 is run and paid for by Trump people: his top policy people, his campaign press secretary, his personal bag man in the White House, the biggest funders, and more. It was a project built for Trump,” said President Joe Biden on July 11. “Project 2025 is proof: If Donald Trump wins in November, he will continue to attack equality, take away freedoms, and undermine our democracy,” Vice President Kamala Harris, the Democratic presidential nominee, said on Aug. 5. “I know nothing about Project 2025. I have no idea who is behind it. I disagree with some of the things they’re saying, and some of the things they’re saying are absolutely ridiculous and abysmal,” Trump wrote on TruthSocial. He later wrote that efforts to tie him to Project 2025 were “pure disinformation,” and his campaign released a statement celebrating its “demise” after Dans’s resignation.","summary":"The book by Heritage Foundation President Kevin D. Roberts, who recently took over leadership of Project 2025, will be released after the election.","url":"https://www.theepochtimes.com/us/project-2025-leader-delays-book-with-forward-written-by-jd-vance-5701404","image":"https://img.theepochtimes.com/assets/uploads/2022/07/13/CPI48592-300x180.jpg","video":null,"publish_date":"2024-08-07 22:24:18","author":"Arjun Singh","authors":["Arjun Singh"],"language":"en","source_country":"us","sentiment":-0.201},{"id":253620872,"title":"Woman Brought Sword, Taser and Other Weapons Into Capitol on Jan. 6: FBI","text":"A woman allegedly brought an array of weapons such as a sword and a taser into the U.S. Capitol Building on January 6, 2021, according to the Federal Bureau of Investigation (FBI).Kennedy Lindsey of California was arrested in Los Angeles last month for her alleged actions during the January 6, 2021, Capitol riot in Washington, D.C. Her charges include disorderly conduct and possession of a dangerous weapon in a Capitol building. She was released from custody after her arrest.Lindsey had a short sword, a steel tactical whip, a collapsible baton, pepper spray, a butterfly knife and a flashlight taser in her possession when a U.S. Secret Service officer searched her, according to an FBI affidavit obtained by the Associated Press (AP).During the 2021 riot, a mob of supports of former President Donald Trump stormed the Capitol building in a failed attempt to stop Congress from certifying Joe Biden's 2020 election win. Some rioters were armed with weapons, including firearms, knives and stun guns, according to AP, while many others had makeshift weapons like flagpoles and broken pieces of furniture from the Capitol building.The riot erupted following claims from Trump that the 2020 election was stolen via widespread voter fraud, despite there being no evidence to back up such claims. The former president has not claimed any responsibility for the riot and continues to claim that the 2020 election was stolen from him.Lindsey and another woman charged for her actions surrounding the riot flew from California to Washington after Trump said on social media that there would be a \"wild\" protest on January 6, according to the FBI. Lindsey posted on social media days before the riot that she was going to D.C. because \"boss man called for us to be there,\" the agency's affidavit said.After attending Trump's \"Stop the Steal\" rally near the White House—where Trump told his supporters, \"We fight like hell. And if you don't fight like hell, you're not going to have a country anymore\"—Lindsey and her companion went to the Capitol.Trump was indicted in August 2023 on conspiracy to defraud the United States; conspiracy to obstruct an official proceeding; obstruction of and attempt to obstruct an official proceeding; and conspiracy against rights. He has pleaded not guilty to the four felony counts and claimed that the federal case against him is politically motivated.Meanwhile, over 1,488 people have been charged so far for crimes related to the Capitol riot, including almost 550 people charged with assaulting or impeding law enforcement, which is a felony. The U.S. Justice Department's investigation into the events surrounding the riot remains ongoing.The AP reached out to Lindsey and an attorney who represented her at her initial court hearing but did not immediately hear back from them.","summary":"Kennedy Lindsey of California was arrested last month for her alleged actions during the January 6 Capitol riot.","url":"https://www.newsweek.com/kennedy-lindsey-capitol-riot-january-6-weapons-sword-1936150","image":"https://d.newsweek.com/en/full/2445452/capitol-riot.jpg","video":null,"publish_date":"2024-08-07 22:24:05","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.471},{"id":253621118,"title":"JD Vance on Trump’s mass deportation plans: ‘Pack your bags’","text":"Republican vice presidential nominee Sen. J.D. Vance (R-OH) elaborated on former President Donald Trump‘s plans for fixing the broken immigration system should they win the 2024 election. “It is simple,” Vance said during a Wednesday press conference in Detroit. “The first thing President Trump will do is stop the massive inflow of illegal aliens in the first place. You gotta stop the bleeding before you can actually fix the problem here,” he said. Vance laid out that the first thing the Trump administration would do is to “reimplement deportation and finish construction of the border wall.” He said they would stop the push for “mass amnesty” for “millions of illegal aliens.” The Ohio senator told the media that these initial steps would solve “most of the problems” and reminded them that it has previously worked because “Trump already did it.” Vance then addressed what would happen to the undocumented migrants currently in the country. “Now, what do you do with the people who are already here?” he rhetorically asked. “I think it’s important that you send a message that if you have come to this country illegally, if you plowed into an innocent mom and their daughter and they lost their lives because of your actions, the message from the Trump administration is simple: Pack your bags because in four months, you are going home,” he declared. The military veteran added, “We do not consent to an invasion of the country for millions of people who shouldn’t be here and we are going to deport people.” Trump’s running mate said their administration would start deporting “the most violent criminals” and make it hard for businesses to “hire illegal aliens.” “If you are not willing to tell at least some of the people who are in this country illegally that you have to go back, then you don‘t have a real border policy. Unfortunately, that is what Kamala Harris has given this country,” Vance said. During his press conference, he implored the press to “do a better job at actually forcing Kamala Harris to answer questions” on numerous issues, including her handling of the southern border.","summary":"Republican vice presidential nominee Sen. J.D. Vance (R-OH) elaborated on former President Donald Trump&#8216;s plans for fixing the broken immigration system should they win the 2024 election. &#8220;It is simple,&#8221; Vance said during a Wednesday press conference in Detroit. &#8220;The first thing President Trump will do is stop the massive inflow of illegal aliens in [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3114517/jd-vance-trump-mass-deportation-plans-pack-your-bags/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/AP24220522124521.webp","video":null,"publish_date":"2024-08-07 22:22:43","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.199},{"id":253621794,"title":"In a 2020 flashback, Georgia’s GOP-aligned election board wants to reinvestigate election results","text":"ATLANTA (AP) — Four years after the 2020 election, a newly GOP-aligned election board in Georgia is pushing to reinvestigate the state’s largest county for its handling of the vote. Georgia’s State Election Board voted 3-2 Wednesday to ask the state’s attorney general to investigate the Fulton County government, seeking to reopen an inquiry closed in May. The action shows the degree to which Republican outrage over the 2020 election continues to animate party activists and comes on the heels of a Saturday rally in Atlanta where former President Donald Trump attempted to relitigate unproven claims that he won Georgia, which President Joe Biden won that year by a narrow margin. He praised the State Election Board at the same rally. It’s unclear if Attorney General Chris Carr, a Republican who has been opposed by Trump, will take any action. A spokesperson didn’t immediately respond to a request for comment. The resolution says that if Carr doesn’t act, the board will try to hire an outside lawyer to conduct an inquiry. It’s also unclear what could happen if an inquiry does go forward. In a hotly disputed 2021 law, the board was given the power to take over election administration in individual counties. That provision was always aimed at Fulton County in the aftermath of an election that an independent monitor said was characterized by sloppy practices and poor management but with no evidence of any intentional wrongdoing. A trio of Republican partisans aligned with Trump has taken control of the five-member regulatory board, which has no direct role in determining election results but writes rules to ensure that elections run smoothly and hears complaints about violations. Some activists who have long wanted action against Fulton County argue that officials should face criminal charges. Those activists have also long pushed for access to the paper ballots from the 2020 election, which could enable a citizen review similar to one that roiled Arizona in 2021. As part of the May resolution of the earlier inquiry, the board found that Fulton County improperly double-counted some votes. But those who brought the complaint say other issues are unresolved, such as missing electronic ballot scans. “It seems to me that somebody is moving heaven and earth to not allow anyone to get to the paper ballots,” said Dr. Janice Johnston, a retired obstetrician appointed to the board by the state Republican Party. “I don’t know why. I’m just interested in the data and interested in the numbers.” Wednesday’s decision is likely to be met with litigation. Fulton County’s election board sent a letter to the state board on Monday flatly refusing to appear, saying the May resolution is final and the board is legally prohibited from pursuing further actions on the same charges. “We will not engage in any further discussions, investigations or other action related to this case,” the local board said in a statement issued by county spokesperson Jessica Corbitt. “To do so would be a waste of taxpayer dollars and time that is best spent preparing for the upcoming general election.” The state board’s nonpartisan chair, John Fervier, tried to block the action, citing a letter from Attorney General Chris Carr that he said also warned the move would be illegal. The Associated Press wasn’t immediately able to obtain a copy of the letter. “We are putting this board in legal jeopardy by approving that motion,” Fervier said. Johnston, who led a successful effort to overturn Fervier’s ruling blocking consideration of the move, said a lawyer for the state GOP had advised her that the board could legally go ahead. “The State Election Board determines when an investigation is concluded, and in my opinion it has not been concluded,” Johnston said. It’s at least the second recent time that state Republican Party officials or employees directly advised the board on a course of action. Party Chairman Josh McKoon recently sent two proposed rules and talking points to another GOP-aligned member of the board, former state Sen. Rick Jeffares. Part of the deal made in May was that Secretary of State Brad Raffensperger, the State Election Board and Fulton County would agree on a monitoring team. On Wednesday, though, the board refused to vote on the team proposed by Raffensperger and Fulton County because it included the former chief lawyer for Raffensperger’s office and the man who monitored Fulton’s 2020 election. Raffensperger’s office declined to comment on the board’s actions. He was removed as a voting member of the board in 2021 and from his nonvoting capacity by lawmakers this year, largely driven by GOP anger at his defense of Biden’s 2020 victory in Georgia. At the Saturday rally, Trump said the three GOP-aligned board members “are all pit bulls fighting for honesty, transparency and victory” while criticizing Fervier and the Democrat on the panel. He in particular singled out Johnston, who was in the second row and stood to acknowledge Trump’s praise. “My courage was contagious?” Trump said. “Well, your courage is contagious, too.” Jeff Amy, The Associated Press","summary":"ATLANTA (AP) — Four years after the 2020 election, a newly GOP-aligned election board in Georgia is pushing to reinvestigate the state&#8217;s largest county for its handling of the vote. Georgia&#8217;s State Election Board voted 3-2 Wednesday to ask the state&#8217;s attorney general to investigate the Fulton County government, seeking to reopen an inquiry closed [&#8230;]","url":"https://toronto.citynews.ca/2024/08/07/in-a-2020-flashback-georgias-gop-aligned-election-board-wants-to-reinvestigate-election-results/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/e88dde91e328f22cc9cc015861bbab47c037bf206322c23b49e6a6f343dc90a1.jpg","video":null,"publish_date":"2024-08-07 22:21:08","author":"Jeff Amy,News Staff","authors":["Jeff Amy","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.482},{"id":253621358,"title":"Snipers watch over Harris-Walz outdoor rally, the first since gunman opened fire on Trump in Pennsylvania","text":"Secret Service snipers were positioned outside a rally for Kamala Harris and Tim Walz in Wisconsin, the first major outdoor presidential campaign event since a gunman opened fire on Donald Trump in Butler, Pennsylvania last month. Secret Service agents were positioned outside the Harris-Walz rally in Eau Claire on Wednesday, where the vice president and her running mate, other Democratic officials and musician Bon Iver appeared before 12,000 people at an outdoor event space. Last week, acting Secret Service director Ronald Rowe said that both the Republican and Democratic candidates will have similar “counter sniper coverage moving forward.” “Our campaign cadence now has obviously picked up, and we’re going to put all the resources out there to address any challenges that we have,” Rowe said from Washington on Friday. Trump’s rally in Butler, Pennsylvania marked the first time that a Secret Service counter sniper had been assigned to one of Trump’s events, according to Rowe. That counter sniper fired a single fatal shot at the 20-year-old gunman who had fired eight rounds from an AR-15 style rifle while on a rooftop outside the rally’s security perimeter. The gunman, Thomas Matthew Crooks, struck Trump’s right ear, killed one rally attendee, and critically injured two others. While the Butler rally marked the first time that Secret Service had deployed a counter sniper to Trump’s Secret Service detail, other law enforcement agencies have provided similar coverage at other campaign events, which are typically closely coordinated between Secret Service personnel and state and local police. Secret Service officials have repeatedly urged the former president to stop holding outdoor rallies, but Rowe told reporters last week that it’s “on the Secret Service to make sure we create a safe environment.” “It’s on us to figure out what we gotta do to mitigate that,” he said. In an all-caps post on Truth Social on July 27, Trump said he will “continue to do outdoor rallies, and Secret Service has agreed to substantially step up their operation.” “They are very capable of doing so,” he added. “No one can ever be allowed to stop or impede free speech or gathering!!!”","summary":"Secret Service officials have pledged counter sniper coverage for all candidates in the wake of Trump shooting","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-rally-snipers-kamala-harris-b2592944.html","image":"https://static.independent.co.uk/2024/08/07/21/a69888fd7b434e048ed39100add16897.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/mZjP8sH4-4VHSaSK0.mp4","publish_date":"2024-08-07 22:11:20","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","source_country":"gb","sentiment":-0.407},{"id":253621624,"title":"‘From our neck of the woods’: Wisconsinites welcome Walz at Harris rally","text":"Linda and Mike Kelly said they haven’t felt this excited for an election since Barack Obama was running for president in 2008. “I feel like Kamala (Harris) is bringing new energy to the party and energizing young folks again,” Linda Kelly, 68, said. “And Tim (Walz) is from our neck of the woods, so that’s even more exciting.” Mike Kelly, 70, grew up in a conservative household, but hasn’t voted for a Republican since Ronald Reagan in the 1980s. The couple drove nearly three hours from their home in Herbster, Wisconsin, to join thousands of others to attend the Harris-Walz rally in the western Wisconsin city of Eau Claire on Wednesday, Walz’s second day as Harris’ running mate. “He’s governed with humility and dignity, and he’s an honest, down-to-earth guy,” Linda Kelly said. Hundreds of freshly minted “Harris-Walz” signs dotted the Eau Claire Event District as Walz greeted attendees. “Hello, Eau Claire – Isn’t it good to have a candidate who can pronounce the name correctly?” Walz said just after reaching the podium, eliciting a roar from the Wisconsin crowd. The Eau Claire rally came just a day after Walz was officially announced as Harris’ running mate Tuesday morning, and introduced during a Philadelphia rally later that day. The Minnesota governor came out on top in a veepstakes that was whittled down to Walz, Pennsylvania Gov. Josh Shapiro and Arizona Sen. Mark Kelly over the weekend. During his remarks, which came in just shy of 16 minutes, Walz pointed to his rural roots as a Nebraska native and teacher for 20 years in southern Minnesota. Appealing to Midwestern values of respecting one’s neighbors, he framed Republican efforts to ban things like abortion and gender-affirming care as attacks on personal choices. “Even if we wouldn’t make the same choices for ourselves, we know there’s a golden rule – mind your own damn business,” Walz told the crowd. “I don’t need you telling us about our health care, I don’t need you telling us who we’re going to love and I sure the hell don’t need you telling us what book we’re going to read,” the governor said. Related | Walz won over Harris with a rare ability to reach AOC as well as Joe Manchin Walz then turned his attention to his Republican opponents, again referring to them as “weird” – an attack that has caught on in recent weeks, and prompted “they’re so weird” chants from supporters. He also criticized former President Donald Trump’s record during his time in office, and went after Ohio Sen. and Trump running mate, JD Vance’s credibility. “Just like all of us in regular America we go to Yale, then we have our careers funded by Silicon Valley billionaires, then you write a book about the place you grew up and you trash that place,” Walz said. “We’re better than that.” Much of Walz’s speech echoed the one he gave in Philadelphia. In less than three weeks, Harris moved to the top of the Democratic presidential ticket and Walz became her vice presidential nominee following President Joe Biden’s decision to drop out of the race for his reelection. The decision came on the heels of a disastrous debate performance, which inflamed concerns within the Democratic Party about whether the 81-year-old incumbent could effectively govern for another four years if he won in November. Walz touted Harris’ record as a prosecutor, California Attorney General and U.S. senator before bringing her to the stage Wednesday. Citing Trump’s felony convictions and sexual abuse allegations, Harris said she’d “proudly put my record up against his any day of the week.” “In those roles, I took on perpetrators of all kinds – predators who abused women, fraudsters who ripped off consumers, scammers who broke the rules for personal gain,” she said. “So hear me when I say I know Donald Trump’s type.” Related | Odds were definitely not zero for Walz. Here’s how Minnesota’s governor became Harris’ running mate Eau Claire resident Astreia Bauer, 45, said she’s very excited about Harris as the new Democratic nominee – excited enough that she canceled everything she had planned on Wednesday to attend the rally instead. “I think she’s (Harris) somebody who will stand up for all types of people, those who look like me, women’s rights, transgender rights, all of the above,” she said. “She hasn’t insulted anyone either, so that’s why I’m here.” Bauer admitted she doesn’t know much about Walz and wasn’t familiar with him before the announcement on Tuesday. But, she said, she’s looking forward to learning more about him before November. “Just him being a Midwesterner, she’s now got a running mate that understands the culture around here, and I think that’s pretty awesome,” Bauer said. While Harris and Walz were conducting their rally, Sen. JD Vance, Donald Trump’s running mate, appeared at an Eau Claire aviation equipment company to bash the new Democratic ticket. Vance gave a version of Trump’s standard stump speech, which recently replaced President Biden with Harris as the person to blame for inflation and an increase in undocumented immigrants to the nation, two issues that resonate with voters. He also attacked Walz, saying he “leaned into the defund the police radicalism,” and blamed Walz for the uprising in Minneapolis after George Floyd’s murder. Walz did not support a city ballot measure that would have replaced the police department with a public-health oriented Department of Public Safety. GOP attacks on Walz have just started. Vance is shadowing Harris and Walz as the new Democratic ticket tours swing states this week. He said that’s necessary because the media “refuses to ask (Harris) questions” and he had to set the record straight. Vance did take questions, but only from local reporters whom he apparently thought would be more friendly. Yet a couple of those reporters asked about Walz’s use of “weird” to describe the Trump-Vance team, a put-down that has caught on with Democrats across the nation. Vance asked event participants if they had watched Walz’s first rally with Harris in Philadelphia on Tuesday. He said that at the end of that rally Walz gave his wife Gwen “a firm handshake” instead of hugging her. “That’s pretty weird, that’s pretty weird,” he said. In reality, Walz grabbed Gwen’s outstretched hand and pulled her into a hug. Vance also showed up in front of the vice president’s plane in Eau Claire to address the awaiting media, continuing his call for Harris to take questions from the media. Walz is expected to continue alongside Harris this week on a five-day tour of several battleground states. The next stop for the duo is Michigan, followed by North Carolina, Arizona and Nevada. A planned trip to Savannah, Georgia, has since been canceled due to Hurricane Debby.","summary":"While Harris and Walz rallied their supporters, Sen. JD Vance, Donald Trump’s running mate, appeared at an Eau Claire aviation equipment company to bash the new Democratic ticket.\n\n\nThe post &#8216;From our neck of the woods&#8217;: Wisconsinites welcome Walz at Harris rally appeared first on MinnPost.","url":"https://www.minnpost.com/national/2024/08/tim-walz-touts-midwestern-values-eau-claire-wisconsin-rally-alongside-kamala-harris/","image":"https://www.minnpost.com/wp-content/uploads/2024/08/940x625-16.png","video":null,"publish_date":"2024-08-07 22:09:51","author":"Mohamed Ibrahim","authors":["Mohamed Ibrahim"],"language":"en","source_country":"us","sentiment":0.236},{"id":253624714,"title":"Biden ‘not confident at all’ in peaceful transfer of power if Trump loses race","text":"Joe Biden has said he is not confident there will be a peaceful transfer of power after the November presidential election. “If Trump wins, no, I’m not confident at all. I mean, if Trump loses, I’m not confident at all,” the president said in an interview with CBS News that is due to air in full this Sunday. It is the US president’s first media interview since he dropped out of his re-election campaign last month and endorsed his vice-president, Kamala Harris, to replace him at the top of the Democratic ticket. Harris is now the presumptive party nominee for president, with Tim Walz, the governor of Minnesota, as her running mate. They will face Donald Trump, the Republicans’ nominee, and his running mate, JD Vance, the Ohio Senator, in November. Biden added, of Trump: “He means what he says, we don’t take him seriously. He means it, all this stuff about ‘if we lose it will be a bloodbath’ … [and] ‘stolen election’, you can’t love your country only when you win.” The TV network posted the excerpt from the interview on Twitter/X. Donald Trump, who is the Republican nominee for president, said in March: “Now, if I don’t get elected, it’s gonna be a bloodbath. That’s going to be the least of it. It’s going to be a bloodbath for the country.” In the CBS interview, Biden further said of Trump and the Republicans: “Look what they’re trying to do now, in the local election districts where people count the votes.” It was unclear from the brief clip whether Biden meant that Republicans send operatives to challenge the counting of votes or that they intimidate election workers, or both. At a rally in Ohio in March, Trump also said: “I don’t think you’re going to have another election in this country, if we don’t win this election … certainly not an election that’s meaningful.” At the time his comments prompted a statement from Biden’s re-election campaign that said “this is who Donald Trump is”. Before withdrawing, Biden focused heavily in his re-election campaign on Trump as a threat to US democracy. Harris and Walz have taken up several other themes but have also criticized Trump and Vance for, among other things, being close to Project 2025, the hard-right framework drawn up by a team at the Heritage Foundation as a playbook for a second Trump presidency. The blueprint recommends dismantling features of the government it believes conflict with conservative ideology, while installing extreme, conservative policies. Harris said: “Can you believe they put that thing in writing?” Reuters contributed reporting","summary":"President says in CBS News clip that Trump ‘means what he says’ about ‘a bloodbath for the country’ if he loses election\n\nJoe Biden has said he is not confident there will be a peaceful transfer of power after the November presidential election.\n\n“If Trump wins, no, I’m not confident at all. I mean, if Trump loses, I’m not confident at all,” the president said in an interview with CBS News that is due to air in full this Sunday.\n\nReuters contributed reporting\n\n Continue reading...","url":"https://www.theguardian.com/us-news/article/2024/aug/07/biden-trump-presidential-election-transfer-of-power","image":"https://i.guim.co.uk/img/media/e65120c80a4736ae9840c4535b69ae7691469c08/0_382_5725_3435/master/5725.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2024-08-07 22:09:39","author":"Guardian staff and agency","authors":["Guardian staff and agency"],"language":"en","source_country":"us","sentiment":-0.283},{"id":253620104,"title":"Simone Biles' Most Viral Clapbacks During the 2024 Paris Olympics","text":"Simone Biles' takeover at the 2024 Olympics earned her multiple gold medals and the distinction of becoming the most decorated gymnast of all-time. As she dominated in the gym and on the world stage, Biles found herself in the white-hot glare of the spotlight — and chose to stand up for herself at every turn.Here are the 11-time Olympic medalist's most viral clapbacks at the Paris Olympics:The MyKayla Skinner ShadeMyKayla Skinner — who was teammates with Biles at the Tokyo Games in 2021 — had already incurred the wrath of her fellow gymnasts before any of them had even stepped on the mat in Paris.As she shared in her now-deleted YouTube video from July — reacting to the gymnasts who made the 2024 Olympic team — Skinner opined that apart from Biles, she felt \"like the talent and the depth [in gymnastics] just isn't like what it used to be. I mean, obviously a lot of girls don't work as hard. The girls just don't have the work ethic.\"Weeks later, after Biles, Suni Lee, Jordan Chiles, Jade Carey (all of whom competed with Skinner at the Tokyo Olympics) and Hezly Rivera won gold in the team all-around final in Paris, the GOAT seemingly shaded Skinner in her Instagram post celebrating the win.\"Lack of talent, lazy, olympic champions ❤️&#129351;&#127482;&#127480;,\" Biles wrote alongside photos of her and the rest of Team USA running across the gymnasium with the American flag.Biles Hits Back at Hair Criticsin the midst of the Olympic Games, online trolls decided to make Biles' hair their business by critiquing her messy bun.\"Gonna hold your hand when I say this,\" Biles — who won three gold medals and one silver in Paris — wrote via instagram in July. \"Next time you wanna comment on a black girl's hair. JUST DON'T.\"GOAT ThingsBiles sent a message to \"the haters\" in August while rocking a GOAT pendant alongside her gold medal after winning the individual all-around gold.\"It's a little ode,\" Biles told reporters at the time of the sparkly piece, which featured more than 360 diamonds. \"I mean, a lot of people love it. They always call me the GOAT [Greatest of All Time], so I thought it would be really special if I got one made. The haters hate it, so I love that even more.\"Biles Calls Out Racism for a Second Time During the GamesIn June, former president Donald Trump made controversial comments about how immigrants were \"taking Black jobs.\" The remarks instantly made their way to social media, where they were condemned and meme-d by the masses. in July, one person related the comment to Biles' big wins in Paris.\"Simone Biles being the GOAT, winning Gold medals and dominating gymnastics is her black job,\" they tweeted.Biles, for her part, quote-tweeted the post and replied: \"I love my black job &#128420;.\"Standing Up for Her HusbandBiles has defended her husband, Jonathan Owens, multiple times over the years. And at the 2024 Olympics, she grew exasperated that she couldn't even let Owens wear her medals without people getting mad.\"Crazy thing is, I put my medal on every single one of my family members and took pictures. So don't ever make assumptions,\" she wrote in the comments of a TikTok video in August. \"Like y'all are so f***ing miserable. Leave us alone.\"'Let Us Soak Up the Moment We've Worked Our Whole Lives For'After being repeatedly asked about her future plans after her four big wins in Paris, Biles expressed her frustration via social media.\"You guys really gotta stop asking athletes what's next after they win a medal at the Olympics,\" she wrote via X in August. \"Let us soak up the moment we've worked our whole lives for.\"","summary":"The 11-time Olympic medalist found herself in the white-hot glare of the spotlight at the 2024 Games — and chose to stand up for herself at every turn.","url":"https://www.newsweek.com/entertainment/celebrity-news/simone-biles-viral-clapbacks-2024-paris-olympics-1936194","image":"https://d.newsweek.com/en/full/2445515/simone-biles.jpg","video":null,"publish_date":"2024-08-07 22:07:21","author":"Michelle McGahan","authors":["Michelle McGahan"],"language":"en","source_country":"US","sentiment":0.335},{"id":253621142,"title":"Biden says he is 'not confident' of peaceful power transfer if Trump loses presidential election","text":"US President Joe Biden on Wednesday said he is \"not confident at all\" about a peaceful transition of power to Vice President Kamala Harris if Republican Donald Trump loses the November 5 presidential election.In a recent interview with CBS, Biden expressed his doubts about the likelihood of a smooth transition after the vote and said: \"If Trump loses, I'm not confident at all.\"\"He means what he says. We don't take him seriously. He means it. All this stuff about if we lose there'd be a bloodbath,\" Biden added.Earlier in a campaign rally held in Ohio during March, Trump warned of a \"bloodbath\" if he fails win the election. He had said, \"The date -- remember this, November 5 -- I believe it's going to be the most important date in the history of our country.\" \"Now if I don't get elected it's going to be a bloodbath for the whole, that's going to be the least of it, it's going to be a bloodbath for the country. That'll be the least of it. But they're not going to sell those cars,\" he added. Trump said the remarks were made in the context of discussing the importance of protecting the US auto industry against foreign rivals. He clarified that his use of the word \"bloodbath\" was specifically in reference to the potential impact on the auto industry.(With inputs from agencies)","summary":"US President Joe Biden expressed doubts about a smooth transition to Vice President Kamala Harris if Donald Trump loses the November 5 election. In an interview, Biden said, \"He means what he says. We don't take him seriously. He means it. All this stuff about if we lose there'd be a bloodbath,\" Biden added.\"","url":"https://timesofindia.indiatimes.com/world/us/biden-says-he-is-not-confident-of-peaceful-power-transfer-if-trump-loses-presidential-election/articleshow/112355909.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112356551/112356551.jpg","video":null,"publish_date":"2024-08-07 22:06:06","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","catgory":"politics","source_country":"in","sentiment":-0.291}]}