{"offset":0,"number":50,"available":10810,"news":[{"id":339663704,"title":"‘Are you still talking about Jeffrey Epstein?’ Trump interrupts reporter to defend Bondi","text":"Washington: President Donald Trump leaped to the defence of Attorney-General Pam Bondi on Tuesday in the face of mounting criticism from far-right influencers and conservative internet personalities over the Justice Department’s abrupt refusal to release additional documents from the Jeffrey Epstein sex-trafficking investigation.\n\nWhen a reporter attempted to ask Bondi about Epstein at a White House cabinet meeting, Trump headed off the questions and scolded the journalist: “Are you still talking about Jeffrey Epstein? This guy’s been talked about for years.”\n\n“I can’t believe you’re asking a question on Epstein at a time like this, where we’re having some of the greatest success and also tragedy with what happened in Texas – it just seems like a desecration,” he added.\n\nThe comments appeared to signal continued job security for Bondi and amounted to a striking rebuke of members of Trump’s base who have called for her resignation and mocked her for what they say is her failed commitment to release incriminating files from the Epstein investigation.","summary":"The US president’s comments amounted to a striking rebuke of members of his own base, who have called for the attorney general’s resignation.","url":"https://www.brisbanetimes.com.au/world/north-america/are-you-still-talking-about-jeffrey-epstein-trump-interrupts-reporter-to-defend-bondi-20250709-p5mdlu.html","image":"https://static.ffx.io/images/$zoom_0.23233874506362437%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_99/t_crop_custom/q_86%2Cf_auto/60566112828fa6a0957a714dcef2fcf6dcfeeec1","video":null,"publish_date":"2025-07-09 01:22:34","author":"Eric Tucker","authors":["Eric Tucker"],"language":"en","category":"politics","source_country":"au","sentiment":-0.454},{"id":339663128,"title":"Trump Reiterates BRICS of 10% Tariff, Says Dollar Will Remain King","text":"Washington DC: US President Donald Trump on Monday (local time) once again warned the BRICS group of charging an additional 10% tariff on goods from these nations. Trump alleged the BRICS group is working to weaken the US dollar.During a Cabinet meeting under his leadership, Trump issued a stern warning, stating, \"They will certainly have to pay 10% if they are in BRICS because BRICS was set up to hurt us, to degenerate our dollar...\"The BRICS bloc, comprising 11 countries including Brazil, Russia, India, China, and South Africa, has been critical of Trump's tariff policies, calling them inconsistent with World Trade Organization rules. BRICS nations collectively account for 40% of global GDP and nearly half of the world's population.Trump's administration is currently pushing for bilateral trade agreements, with new tariffs set to take effect on August 1 for countries that have not reached a deal with the United States.Reiterating his position on the strength of the US dollar, Trump said, \"The dollar is king, we gonna keep it that way. I am just saying if people wanna challenge it they can, but they have to pay a big price and I don't think any of them is willing to pay that price,\" he added.On the upcoming trade tariffs, Trump stated, \"It has always been August 1 (deadline)...Tariffs are charged by other countries at levels that are ridiculous. I called those other countries, and now everyone is willing to give us everything...For years, they ripped us off and we didn't have a President that understood it...\"When asked about India's position, considering its status as a significant US trade partner and BRICS member, Trump clarified that no exceptions would be made.\"They are members of BRICS, they can pay 10% tariff. I said this about a year ago and it largely broke up. I thought it largely broke up. We are not gonna lose the standard at any time. If you have a smart President you will never lose the standard,\" said Trump.This comes on the heels of US and India nearing a trade deal, with President Donald Trump stating they're \"close to making a deal.\" A final trade deal might be signed during a high-level bilateral meeting in Washington DC later this month or when Trump visits India in the fall. An interim or mini trade deal is likely to be announced soon, potentially excluding sensitive sectors like agriculture and dairy.The US is pushing for reduced duties on agricultural products, medical devices, and industrial goods, while India seeks preferential access for labor-intensive exports like textiles and garments. The deal aims to boost bilateral trade to $500 billion by 2030 and enhance cooperation in defense, technology, and energy.Criticising previous administrations, Trump said, \"If you have a stupid President like the last time, you would lose the standard, you won't have dollars here and we lost the world standard dollar. That would be like losing a war, a major world war. We would not be the same country any longer. I can't let that happen.\"US President Donald Trump announced on the social media platform Truth Social that tariffs will come into effect on August 1, 2025, and must be paid without any extensions.He stated, \"As per letters sent to various countries yesterday, in addition to letters that will be sent today, tomorrow, and for the next short period of time, TARIFFS WILL START BEING PAID ON AUGUST 1, 2025. There has been no change to this date, and there will be no change. In other words, all money will be due and payable starting AUGUST 1, 2025 - No extensions will be granted. Thank you for your attention to this matter!\"Clarifying the intent behind these measures, US President Donald Trump on Monday (local time) said the proposed tariff arrangements aim to ensure fairness and remain open to negotiation if other countries are willing to make a fair deal.\"We're always subject to negotiations when something is fair, but we've talked to most of the countries. Pretty much they have had their way for many, many decades. It was time that we just wanted fairness. This is not really equitable from our standpoint because this is a small token by comparison to damages been done over the years but we had no other president that was willing to do this, but I did it,\" he said.He added that his second term would outperform his first in terms of tariff collection and economic impact.\"Even in my first term with China and others. We took in hundreds and billions of dollars of tariffs. No inflation, the most successful period of time we've ever had financially in the country—the first term, I think this time's going to be much better. Even better than the last time. This is going to be substantially better, and we're on our way doing that. We have already taken in over a hundred billion dollars' worth of tariffs and we haven't even started. All I have to say to other countries—some of them want to make it real and fair. Others got a little bit spoilt. For years, they have taken advantage of the country. So ...","summary":"When asked about India's position, considering its status as a significant US trade partner and BRICS member, Trump clarified that no exceptions would be made","url":"https://www.deccanchronicle.com/world/americas/trump-reiterates-brics-of-10-tariff-says-dollar-will-remain-king-1890285","image":"https://www.deccanchronicle.com/h-upload/2025/07/09/1936107-aa-5083859.webp","video":null,"publish_date":"2025-07-09 01:21:21","author":"ANI","authors":["ANI"],"language":"en","source_country":"in","sentiment":-0.295},{"id":339662088,"title":"Girl, 8, orphaned in Texas floods after family camping trip ends in tragedy","text":"An eight-year-old girl was left orphaned after her family’s RV was swept away by the Texas floods.\n\nJenna Burgess is the sole survivor of her family-of-five after flash floods devastated central Texas, killing at least 109 people over the July 4 weekend.\n\nRescue workers waded through muddy river banks searched by air for survivors on Tuesday as the number of those missing climbed to 160, and hopes dwindled of finding further survivors.\n\n“There very likely could be more added to that list,” said Texas governor Greg Abbott.\n\nJenna’s family were staying at Blue Oak RV Park in Kerr County on Friday when the Guadalupe River burst its banks, sending a torrent of water gushing through the popular holiday area and laying waste to several children’s summer camps.\n\nHer father Jack Burgess, 39, and mother Julia Anderson Burgess, 38, were both killed as the river rose rapidly in the early hours of the morning. Her younger brothers Jack, 5, and one-year-old James are still missing and presumed dead.\n\nWitnesses reported that her father’s final moments were spent clinging to a tree in a desperate attempt to save his sons, according to MailOnline.\n\nJenna was staying at a nearby camp that was missed by the floods.\n\nShe now faces growing up alone after her entire immediate family was killed.\n\nIn the neighbouring camp site, a Texas father left a farewell voicemail to his children saying he was “not going to make it”, moments before he and his wife were swept away by flood waters.\n\nJeff Ramsey, 61, an insurance salesman from Lewisville, was staying at the HTR RV Park in Kerrville with his wife, Tanya, 46, and the couple’s dog when the deadly torrent struck.\n\n“He called me once he realised there was no hope. It was a short voicemail,” his son, Jake Ramsey, 24, told The New York Post.\n\n“He said, ‘Buddy. I love you so much. It doesn’t look like we are going to make it. Tell Rachey I love her,’” referring to Jeff’s sister, Rachel Ramsey, 23.\n\nKerr County, where search and rescue workers have recovered 87 bodies, was one of the regions worst hit by the floods.\n\nIt is home to Camp Mystic, where at least 27 children and counsellors died, with the families of Blakely McCrory, 8, and Mary Grace Baker, 8, confirming their children’s deaths over the past 24 hours.\n\n“Her giggle was contagious, as was her spirit,” Mary’s school wrote in a moving tribute.\n\nDonald Trump announced at a cabinet meeting on Tuesday that he plans to visit the state on Friday alongside the First Lady.\n\n“He could not stop talking about how sad he was for all the little girls who have lost their lives,” the Texas governor said of the president.\n\nThe Trump administration has faced criticism for staffing cuts to the National Weather Service, which saw nearly 600 employees laid off earlier this year, The New York Times reported.\n\nLocal officials have also faced questions, with Kerr County Sheriff Larry Leitha being asked at a press conference on Tuesday about authorities’ alleged “slow response” to the floods.\n\nResponding to questions about the federal relief efforts, Kristi Noem, the homeland security secretary, said that the disaster response was handled by state officials and emphasised the administration’s efforts to support disaster response workers.\n\nVisibly emotional, she said: “We’re cutting through the paperwork of the old FEMA streamlining it, much like your vision of how FEMA should operate.”","url":"https://uk.news.yahoo.com/girl-8-orphaned-texas-floods-005633165.html","image":"https://s.yimg.com/ny/api/res/1.2/PEwFKS9osYtYa22bdzYrcQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTI-/https://media.zenfs.com/en/the_telegraph_818/fb3928b0bda4c525f2b8b18066cf6fe5","video":null,"publish_date":"2025-07-09 00:56:33","author":"Cameron Henderson","authors":["Cameron Henderson"],"language":"en","source_country":"gb","sentiment":-0.321},{"id":339660898,"title":"Raskin Urges Release of Epstein Records Involving Trump, Highlights New Jack Smith Report","text":"Democratic members of the House Judiciary Committee called on the Department of Justice (DOJ) to release former special counsel Jack Smith’s report on the Mar-a-Lago investigation as well as any of the Epstein files that reference President Trump, accusing Attorney General Pam Bondi of shielding potentially damaging information.\n\n“This Administration has repeatedly claimed that President Trump is ‘the most transparent and accessible president in American history.’ So far, your DOJ has not only failed to live up to this promise, but you have also consistently hidden from the American public materials and information that may be damaging to President Trump,” Rep. Jamie Raskin (D-Md.), the top Democrat on the panel, wrote in a letter to Bondi also signed by 15 other Democrats on the committee.\n\n“Your conduct is particularly worrisome as it appears to be part of a pattern of using the DOJ to cover up evidence of criminal wrongdoing by President Trump, including information allegedly contained in the Epstein files. We write today to demand that you release the Smith report immediately, as well as any evidence mentioning or referencing Donald Trump in the Epstein files.”\n\nBondi’s office did not immediately respond to a request for comment.\n\nRaskin’s call for details from the Epstein files comes after the Justice Department on Monday released a memo concluding the financier accused of sex trafficking died by suicide and did not keep a client list.\n\nThat clashes with an accusation made by Elon Musk, who during a feud with Trump said the president “is in the Epstein files. That is the real reason they have not been made public.”\n\nThe White House in February invited social media influencers to an event where they distributed binders labeled “The Epstein Files.”\n\nBut the move sparked backlash because the binders did not contain new revelations, but rather information that has long been public, such as pages from Epstein’s address book.\n\n“This raises the question of whether the White House has moved to prevent the declassification and public release of the full Epstein files because they implicate President Trump, and whether these massive redaction efforts and the withholding of the files were intended to shield your boss from embarrassing revelations within those files,” they wrote.\n\nTrump has denied being close with Epstein and fumed over questions about the matter during a Tuesday Cabinet meeting.\n\n“Are people still talking about this guy? This creep? That is unbelievable,” Trump said.\n\nRaskin also tore into the DOJ for complying with Republican investigations into Smith’s work, including breaking tradition by allowing career prosecutors to sit for interviews.\n\nRaskin noted the department has also broken with tradition by failing to release Smith’s report on Mar-a-Lago after the case against Trump’s two co-defendants was dismissed. Trump was accused of taking and shielding from authorities more than 300 documents with classified markings.\n\nThe Justice Department typically releases special counsel reports at the conclusion of their investigations, and the Biden White House did so for Smith’s Jan. 6 report as well as former special counsel David Weiss’s report on Hunter Biden.\n\n“It is particularly instructive that you have apparently decided to allow prosecutors to testify about their yearslong investigation of President Trump, even as you refuse to release the fruit of that investigation, forcing the prosecutors to defend themselves essentially with hands tied behind their backs,” Democrats wrote.\n\n“It is not a coincidence that President Trump installed his personal legal team to top positions at the DOJ, appointing you, Todd Blanche, Emil Bove—who all served as his defense counsel at one time or another—to the three most senior positions at DOJ. … By doing so, DOJ has all but turned into President Trump’s personal law firm, ensuring that damaging information about him would remain hidden from public view. The American people deserve uncensored answers and authentic transparency from this Administration and a full understanding of Mr. Trump’s actions.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nDemocratic members of the House Judiciary Committee called on the Department of&#8230;\n\n\nThis Post: Raskin Urges Release of Epstein Records Involving Trump, Highlights New Jack Smith Report first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/raskin-urges-release-of-epstein-records-involving-trump-highlights-new-jack-smith-report/","image":"https://internewscast.com/wp-content/uploads/2025/07/rewrite-this-title-Raskin-demands-release-of-any-Epstein-files.jpg","video":null,"publish_date":"2025-07-09 00:52:19","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.22},{"id":339660874,"title":"New book reveals Biden’s team blocked reporter’s number after interview","text":"A new book reveals that aides to Joe Biden changed his personal mobile number after a reporter, Tyler Pager, managed to call him for an interview. \n\nPager, from The New York Times, obtained Biden's private number in late March and spoke with him, with Biden criticizing President Donald Trump. \n\nBiden reportedly told Pager he would be willing to speak for the book and, when asked about ending his 2024 re-election campaign, stated, “No, not now. I don’t spend a lot of time on regrets.” \n\nFollowing the call, Biden's aides repeatedly contacted Pager, expressing their anger, and subsequently blocked his number and removed Biden's number from service within two days. \n\nThe incident highlights the tightly managed nature of Biden's inner circle, contrasting with President Donald Trump's more accessible approach to reporters.","summary":"","url":"https://www.independent.co.uk/bulletin/news/joe-biden-tyler-pager-book-b2785236.html","image":"https://static.independent.co.uk/2025/06/24/14/21/GettyImages-1903200714.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/Ums55s6I-OhrQWqOm.mp4","publish_date":"2025-07-09 00:49:06","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.243},{"id":339661690,"title":"Trump reportedly was unaware of Ukraine weapons pause","text":"By Aamer Madhani, Seing Min Kim and Tara Copp | Associated Press\n\nWASHINGTON — President Donald Trump’s decision to send more defensive weapons to Ukraine came after he privately expressed frustration with Pentagon officials for announcing a pause in some deliveries last week — a move that he felt wasn’t properly coordinated with the White House, according to three people familiar with the matter.\n\nThe Pentagon, which announced last week that it would hold back some air defense missiles, precision-guided artillery and other weapons pledged to Ukraine because of what U.S. officials said were concerns that American stockpiles were in short supply. Trump said Monday that the U.S. will have to send more weapons to Ukraine, effectively reversing the move.\n\nTwo of the people, who spoke on the condition of anonymity about the sensitive internal discussions, said there was some internal opposition among Pentagon brass to the pause — coordinated by Pentagon policy chief Elbridge Colby — before it was announced.\n\nOne of the people described Trump as being caught “flat footed” by the announcement. The White House did not respond to queries about whether Trump was surprised by the Pentagon pause.\n\nPentagon press secretary Kingsley Wilson denied that Defense Secretary Pete Hegseth had acted without consulting the president.\n\n“It is the job of the Secretary of Defense to make military recommendations to the commander-in-chief. Secretary Hegseth provided a framework for the President to evaluate military aid shipments and assess existing stockpiles. This effort was coordinated across government. The Department will continue to give the President robust options regarding military aid to Ukraine, consistent with his goal of bringing this tragic war to an end and putting America first,” Wilson said in a statement to The Associated Press.\n\nThe pause in critical weapons deliveries had come at a difficult moment for Ukraine, which has faced increasing — and more complex — air barrages from Russia during the more than three-year-old war. Trump acknowledged that in announcing the reversal on Monday night, saying, “They have to be able to defend themselves. They’re getting hit very hard now.”\n\nAsked by a reporter Tuesday who approved the pause, Trump bristled at the question while he was gathered with his Cabinet. “I don’t know. Why don’t you tell me?”\n\nTrump’s change in tone on Putin\n\nThe president also laid into Russian President Vladimir Putin, suggesting he was unnecessarily prolonging the war that Trump has said he’s determined to quickly conclude. Trump has struggled to find a resolution, with talks between the sides stalled.\n\nThe Republican leader has sounded increasingly exasperated with Putin in recent days. The two spoke by phone last week.\n\n“We get a lot of bull—- thrown at us by Putin, if you want to know the truth,” Trump said during Tuesday’s Cabinet meeting. “He’s very nice all the time, but it turns out to be meaningless.”\nHe has threatened, but held off on, imposing new sanctions against Russia’s oil industry to try to prod Putin into peace talks.\n\nSen. Lindsey Graham, R-S.C., said last week that Trump has given him the go-ahead to push forward with a bill he’s co-sponsoring that calls, in part, for a 500% tariff on goods imported from countries that continue to buy Russian oil. The move would have huge ramifications for China and India, two economic behemoths that buy Russian oil.\n\nTrump said Tuesday that he’s “looking at it very strongly.”\n\nPentagon says it’s going to resume shipments to Ukraine\n\nThe weapons pause announced last week impacted shipments of Patriot missiles, precision-guided GMLRS, Hellfire missiles and Howitzer rounds and more, taking not only Ukrainian officials and other allies by surprise but also U.S. lawmakers and other parts of the Trump administration, including the State Department.\n\nThe Pentagon said late Monday that at Trump’s direction, it would resume weapons shipments to Ukraine “to ensure the Ukrainians can defend themselves while we work to secure a lasting peace and ensure the killing stops.” Still, spokesman Sean Parnell added that its review for Trump to evaluate military shipments worldwide continues as part of “America First” defense priorities.\n\nIt’s also unclear which weaponry would now be sent, though Trump said that the U.S. will primarily be assisting Ukraine with defensive weapons.\n\nCounting the weapons\n\nOn Tuesday, each of the services and the combatant commands — the multiservice organizations that spearhead U.S. military operations around the world — were still sending up information on their stockpiles of specific munitions to Pentagon leadership, a U.S. official said.\n\n“They are literally still doing the math,” the official said.\n\nThe information was being presented on a stoplight chart — where munitions were either in a red, yellow or green status, similar to slides that had been created the week before, the official said. That earlier study had concluded that some munitions were OK to keep sending to Ukraine — but others were reaching concerning levels.\n\nGetting a full visibility on the numbers of actual munitions on hand takes time, the official said, because while Patriot missiles, for example, initially belong to the Army, once they are requested and sent to a combatant command, such as U.S. Central Command, the service loses visibility on those numbers in inventory.\n\nThe vast majority of the munitions and weapons the U.S. has shipped to Ukraine have been pulled from the Army, which has monitored levels closely in recent years, particularly for high-demand items like 155mm artillery shells and Patriot missiles for air defenses.\n\nIt’s been harder for the Army to ramp up production on those items than had been planned: It was trying to hit a goal of producing 100,000 155mm shells a month by the end of 2025 but won’t meet that goal now until 2026, Army spokesman Steve Warren said.\n\nRamping up Patriot missile production also has been challenging, Warren said.\n\nSen. Mitch McConnell, R-Ky., said in a statement Tuesday that he was glad Trump was resuming deliveries to Ukraine.\n\n“This time, the President will need to reject calls from the isolationists and restrainers within his Administration to limit these deliveries to defensive weapons,” McConnell said. “And he should disregard those at DoD who invoke munitions shortages to block aid while refusing to invest seriously in expanding munitions production.”\n\nAssociated Press writers Lisa Mascaro and Matthew Lee contributed to this report.","summary":"Asked by a reporter Tuesday who approved the pause in arms shipments, President Donald Trump bristled at the question while he was gathered with his Cabinet. \"I don't know. Why don't you tell me?\"","url":"https://www.mercurynews.com/2025/07/08/trump-reportedly-was-unaware-of-ukraine-weapons-pause/","image":"https://www.mercurynews.com/wp-content/uploads/2025/07/sjm-UMP-TARIFFS-GET_231178714.jpg?w=1024&h=682","video":null,"publish_date":"2025-07-09 00:42:28","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.132},{"id":339660882,"title":"The Latest: Supreme Court will allow Trump’s plans to downsize the federal workforce to go ahead","text":"The Supreme Court cleared the way for President Donald Trump’s plans to cut down on the size of the federal workforce, despite warnings from experts that vital government services will be lost and hundreds of thousands of federal employees will be out of their jobs.\n\nThere have been no official numbers for the job cuts, which have been led by the Department of Government Efficiency, but tens of thousands of federal workers have been fired, have left their jobs via deferred resignation programs or have been placed on leave.\n\nAlso Tuesday, Israeli Prime Minister Benjamin Netanyahu was back at the White House to meet with Trump. Officials offered scant details on what the two were discussing. \n\nNetanyahu told reporters in the Capitol earlier that the two see “eye to eye” on the issue of destroying Hamas and added that the cooperation and coordination between Israel and the United States is currently the best it has ever been during Israel’s 77-year-history.\n\nThe latest:\n\n Trump Media files for ‘Crypto Blue Chip ETF’ with SEC \n\nThe president continues to expand his crypto-related offerings, this time with a planned exchange-traded fund tied to the prices of five popular cryptocurrencies.\n\nTrump Media & Technology Group, a Florida company that operates the Truth Social media platform, announced Tuesday that it filed paperwork with the Securities and Exchange Commission for approval to launch the “Crypto Blue Chip ETF” later this year.\n\nTrump Media did not immediately return a request for comment.\n\nCryptocurrency-based ETFs make it easier for investors to gain exposure to cryptocurrencies without having to buy them directly. These funds have exploded in popularity since bitcoin ETFs began trading in U.S. markets last year.\n\nThe SEC released new guidelines last week for crypto ETF issuers as part of the Trump administration’s push to create a more welcoming regulatory environment for crypto-related companies. The agency has also dropped or paused several enforcement actions against crypto companies since Trump took office.\n\n▶ Read more about Trump Media and the Crypto Blue Chip ETF\n\n Los Angeles files to join lawsuit over immigration raids \n\nThe lawsuit was filed by immigrant rights groups last week. It seeks a temporary restraining order to stop the Trump administration from targeting people in the raids based on their race and denying detainees due process.\n\n“This cannot become routine, to send militarized troops into our streets without reasonable suspicion, without probably cause, to round people up and take them away,” City Attorney Hydee Feldstein Soto said.\n\nSoto said the lawsuit does not seek to block immigration enforcement but rather the “unconstitutional manner” in which the government is doing it.\n\n“What we have experienced over these last few weeks has just been shocking,” Mayor Karen Bass said.\n\nOfficials announced the city’s filing at a Tuesday news conference.\n\n Trump teases more letters on trade being sent to US trading partners Wednesday \n\n“We will be releasing a minimum of 7 Countries having to do with trade, tomorrow morning, with an additional number of Countries being released in the afternoon,” the president said Tuesday night in a post on his social platform.\n\nTrump has for several days teased letters listing tariffs that the administration plans to impose on different countries — even as it also continues to negotiate trade deals.\n\n Trump aides meet with Qatari officials to discuss Gaza ceasefire negotiations \n\nAhead of the president's meeting with Netanyahu on Tuesday, senior administration officials met with Qatari officials at the White House to discuss details of the ceasefire and hostage negotiations.\n\nThat’s according to a White House official who was not authorized to comment publicly about the meeting and spoke on the condition of anonymity.\n\nThe Qataris have played the role of mediator with Hamas throughout the Israel-Hamas war and have played a similar role between the U.S. and Iran over the years.\n\nTrump envoy Steve Witkoff is to head to the Qatari capital of Doha later this week when the indirect negotiations with Hamas are expected to continue.\n\n Pentagon: Defense Secretary Pete Hegseth did not act without consulting Trump \n\nPentagon press secretary Kingsley Wilson issued that denial Tuesday after the president privately expressed frustration with Pentagon officials for announcing a pause in some deliveries of defensive weapons to Ukraine last week — a move that he felt wasn’t properly coordinated with the White House, according to three people familiar with the matter.\n\n“It is the job of the Secretary of Defense to make military recommendations to the commander-in-chief. Secretary Hegseth provided a framework for the President to evaluate military aid shipments and assess existing stockpiles. This effort was coordinated across government,” Wilson said in a statement to The Associated Press.\n\n“The Department will continue to give the President robust options regarding military aid to Ukraine, consistent with his goal of bringing this tragic war to an end and putting America first,” the statement continued.\n\n— Aamer Madhani, Seung Min Kim and Tara Copp\n\n Residents still shaken a day after federal authorities march through Los Angeles’ MacArthur Park \n\nAfter federal officers and National Guard troops descended on the park west of downtown LA, immigrant residents of the surrounding neighborhood were coming to grips with an operation that local officials said seemed designed to sow fear.\n\nFernando Rodriguez closed down his variety store near MacArthur Park after seeing flyers warning of immigration enforcement.\n\n“You look Latino, they take you. Even if you show papers, they say they’re fake,” he said. “What they’re doing is evil.”\n\nThe Department of Homeland Security would not say what the purpose of the operation was, why it ended abruptly or whether anyone was arrested Monday.\n\nMore than 4,000 California National Guard and hundreds of U.S. Marines have been deployed in Los Angeles since June against the wishes of Gov. Gavin Newsom. Last week the military announced that about 200 of those troops would return to their units to fight wildfires.\n\n▶ Read more about what residents are saying the day after the operation\n\n Kristi Noem says people will welcome TSA’s new shoes policy at airport checkpoints \n\n“I think most Americans will be very excited to see they will be able to keep their shoes on,” the Homeland Security secretary said, “and it will be a much more streamlined process.”\n\nEarlier in the day she announced the reversal of a policy put in place almost 20 years ago requiring people to remove their footwear at the checkpoints.\n\nNoem said a pilot program showed the Transportation Security Administration has the equipment needed to keep airports and aircraft safe while allowing people to remain shod.\n\n As US abruptly ends support, Liberia faces empty health clinics and unplanned pregnancies \n\nRoseline Phay, a 32-year-old farmer in the West African nation, and her partner have two daughters, and they barely make ends meet.\n\nDetermined not to have more children, she went to a health worker in her village, but contraception pills, implants and condoms had run out. Phay trekked for hours on red clay roads to the nearest clinic, but they had no contraceptives either. Phay repeated the trip four times.\n\nThen she got pregnant. She had to wean her daughter Pauline off breastfeeding, she said, and the girl became so badly malnourished that she almost died. The U.S. cuts left no therapeutic food to give her, and she is still ill. Meanwhile Phay must continue farming throughout her pregnancy, she said, or “I will not eat.”\n\nWeeks earlier the Trump administration suspended most foreign aid through the U.S. Agency for International Development, which paid for medications in Liberia’s public clinics.\n\nPhay is among millions across Africa who have seen their lives upended after the U.S. aid cuts. In Liberia, the American support made up almost 2.6% of the gross national income, the highest percentage anywhere in the world, according to the Center for Global Development.\n\n▶ Read more about Liberia and U.S. aid cuts\n\n Trump administration pulls back on plans to rewrite Biden-era asbestos ban \n\nThe administration is dropping plans to allow continued use of the last type of asbestos legally allowed in U.S. manufacturing after an outcry from asbestos opponents.\n\nThe Environmental Protection Agency said in a court filing Monday that it will now defend the Biden administration’s ban of chrysotile asbestos, which is used in products like brake blocks and sheet gaskets.\n\nThe carcinogenic chemical has been mostly phased out, but last year the agency sought to finish the decadeslong fight with a comprehensive ban. The EPA said in 2024 that “exposure to asbestos is known to cause lung cancer, mesothelioma, ovarian cancer, and laryngeal cancer, and it is linked to more than 40,000 deaths in the U.S. each year.”\n\nThe EPA had said in a federal appeals court filing last month that parts of the ban may have gone “beyond what is necessary to eliminate the unreasonable risk” and that other options such as requiring workplace protection measures might eliminate that risk.\n\n South Sudan says it has 8 men removed from the US \n\nSouth Sudanese authorities confirmed custody of the men Tuesday. Foreign ministry spokesperson Apuk Ayuel told reporters that they arrived at Juba International Airport on Saturday following “standard deportation procedures undertaken” by the U.S. government.\n\nThe men hail from Cuba, Laos, Mexico, Myanmar, Vietnam and South Sudan. They are part of a case that went to the Supreme Court, which permitted their removal. Trump administration officials said they were convicted of violent crimes in the U.S.\n\nThe men are “under the care of the relevant authorities who are screening them and ensuring their safety and well-being,” Ayuel said, without specifying where they were being held.\n\nU.S. authorities said Friday that the eight, who were removed in May and held for weeks at a U.S. military base in Djibouti, arrived in South Sudan after the Supreme Court cleared the way for their transfer.\n\n Travelers no longer have to remove their shoes during security screenings at US airports \n\nHomeland Security Secretary Kristi Noem announced the new policy Tuesday, ending the ritual put in place almost 20 years ago. It takes effect nationwide immediately.\n\nNoem said a pilot program showed that the Transportation Security Administration has the equipment needed to keep airports and aircraft safe while allowing people to remain shod.\n\nWhile shoe removal no longer is standard procedure, some travelers still may be asked to take off their footwear “if we think additional layers of screening are necessary,” she added.\n\nSecurity screening sans shoes became a requirement in 2006, several years after “shoe bomber” Richard Reid’s failed attempt to take down a flight from Paris to Miami in late 2001.\n\nAll passengers between the ages of 12 and 75 were required to remove their shoes, which were scanned along with carry-on luggage.\n\n Trump’s previous tariff push terrified the world economy. He’s betting this time is different \n\nThe last time the president rolled out tariffs this high, financial markets quaked, consumer confidence crashed and his popularity plunged.\n\nIn his new round of tariffs being announced this week, Trump is essentially tethering the entire world economy to his instinctual belief that import taxes will deliver factory jobs and stronger growth in the U.S., rather than the inflation and slowdown predicted by many economists.\n\nThere are three possible outcomes. Trump could prove most economic experts wrong, and the tariffs could deliver growth as promised. Or he could retreat again on tariffs before their Aug. 1 start. Or he could damage the economy.\n\n▶ Read more about the new tariffs and Trump’s bet\n\n Trump on past presidents: Ike was ‘underrated,’ FDR ‘amazing,’ Polk ‘sort of a real-estate guy’ \n\nThe president shared his unique takes on various predecessors and their portraits while discussing his White House redecorating efforts.\n\nSpeaking during a Cabinet meeting Tuesday, Trump explained how he personally selected portraits to redecorate the White House’s Cabinet Room, and admitted to sometimes liking the frames as much as the portraits they surrounded.\n\nHe noted that James K. Polk was “sort of a real estate guy” and called Dwight Eisenhower underrated.\n\nHe referred to the “great Andrew Jackson” and said Franklin D. Roosevelt was “amazing.”\n\nAs he has in the past, Trump also heaped praise on William McKinley and his love of tariffs.\n\n Army will end most of its ceremonial horse programs and adopt out the animals \n\nThe Army’s history is closely tied to its cavalry, soldiers who rode into battle on horseback.\n\nBut it announced Tuesday that it’s moving toward a future without the ceremonial horses and will put most of them up for adoption.\n\nHowever the service will keep operating the Old Guard ceremonial caisson units at Joint Base San Antonio and Arlington National Cemetery for burial honors.\n\nCeremonial cavalry units will be closed down at several bases including Fort Cavazos in Texas, whose horses were showcased during the military parade in Washington on June 14, which was the Army’s 250th anniversary and also Trump’s birthday.\n\nThe Army estimates that closing down the units will save about $2 million a year, spokesperson Steve Warren said.\n\n Trump avoids talk of scrapping FEMA after more than 100 killed in Texas flash flood \n\nThe president has avoided talking about his plan to scrap the federal disaster response agency after the catastrophic flash flood in Texas that killed more than 100 people, including children attending a girls-only camp.\n\nAsked shortly after the disaster whether he still intended to phase out the Federal Emergency Management Agency, Trump said it wasn’t the right time to talk about it. Nor did he mention such plans during a nearly two-hour meeting with his Cabinet on Tuesday.\n\nInstead Trump opened the meeting by having Homeland Security Secretary Kristi Noem talk about her visit to Kerrville, Texas, a day after floodwaters swept away riverside campers and homeowners in the wee hours of the Fourth of July holiday.\n\n▶ Read more about Trump, FEMA and the Texas floods\n\n Wall Street ends mixed amid Trump’s new tariff deadlines \n\nWall Street ended mixed a day after a broad sell-off in response to the Trump administration setting new tariffs on more than a dozen nations.\n\nThe S&P 500 slipped 0.1% Tuesday, the Dow Jones Industrial Average fell 0.4% and the Nasdaq composite was little changed.\n\nThe sluggish trading came a day after the S&P 500 had its biggest drop since June as the president announced a 25% tax on imports from Japan and South Korea and new tariff rates on other nations scheduled to go into effect Aug. 1.\n\nThe S&P 500 remains near the record it set last week.\n\n Netanyahu is back at the White House \n\nIsraeli Prime Minister Benjamin Netanyahu has arrived back at the White House for another meeting with Trump.\n\nNetanyahu’s motorcade pulled up in the late afternoon but was out of sight of gathered journalists. He headed into a meeting with Trump.\n\nThe White House has offered scant details on what the two were discussing this time.\n\nTrump hosted a dinner for Netanyahu on Monday night. That was billed as being closed to reporters, but the White House later granted access and Trump took questions. \n\n Impacted agencies are expected to include Veterans Affairs and Social Security Administration \n\nAmong the agencies affected by the order are the departments of Agriculture, Energy, Labor, the Interior, State, the Treasury and Veterans Affairs.\n\nIt also applies to the National Science Foundation, Small Business Association, Social Security Administration and Environmental Protection Agency.\n\n Groups that sued to stop Trump’s cuts react to the Supreme Court’s decision \n\nThe labor unions and nonprofits that sued over the downsizing offered the justices several examples of what would happen if it were allowed to take effect, including cuts of 40% to 50% at several agencies. Baltimore, Chicago and San Francisco were among cities that also sued.\n\n“Today’s decision has dealt a serious blow to our democracy and puts services that the American people rely on in grave jeopardy. This decision does not change the simple and clear fact that reorganizing government functions and laying off federal workers en masse haphazardly without any congressional approval is not allowed by our Constitution,” the parties that sued said in a joint statement.\n\n Supreme Court clears the way for Trump’s plans to downsize the federal workforce \n\nThe Supreme Court on Tuesday cleared the way for President Donald Trump’s plans to downsize the federal workforce despite warnings that critical government services will be lost and hundreds of thousands of federal employees will be out of their jobs.\n\nThe justices overrode lower court orders that temporarily froze the cuts, which have been led by the Department of Government Efficiency.\n\nThe court said in an unsigned order that no specific cuts were in front of the justices, only an executive order issued by Trump and an administration directive for agencies to undertake job reductions.\n\nJustice Ketanji Brown Jackson was the only dissenting vote, accusing her colleagues of a “demonstrated enthusiasm for greenlighting this President’s legally dubious actions in an emergency posture.”\n\n Trump caught off guard by Pentagon’s abrupt move to pause Ukraine weapons deliveries, AP sources say \n\nPresident Donald Trump’s decision to send more defensive weapons to Ukraine came after he privately expressed frustration with Pentagon officials for announcing a pause in some deliveries last week — a move that he felt wasn’t properly coordinated with the White House, according to three people familiar with the matter.\n\nThe Pentagon, which announced last week that it would hold back some air defense missiles, precision-guided artillery and other weapons pledged to Ukraine because of what U.S. officials said were concerns that American stockpiles were in short supply. Trump said Monday that the U.S. will have to send more weapons to Ukraine, effectively reversing the move.\n\nTwo of the people, who spoke on the condition of anonymity about the sensitive internal discussions, said there was some internal opposition among Pentagon brass to the pause — coordinated by Pentagon policy chief Elbridge Colby — before it was announced.\n\nOne of the people described Trump as being caught “flat-footed” by the announcement.\n\n Trump says his administration can protect the farm workforce without offering migrants ‘amnesty’ \n\nDuring his Cabinet meeting, Trump said his administration is “doing a work program” that will allow migrants from abroad working on farms to remain in the U.S., but that it won’t qualify as “amnesty.”\n\nAgriculture Secretary Brooke Rollins then spoke up, saying that Trump’s broader crackdown on immigration means that “mass deportation continues, but in a strategic way” and that officials can keep “ensuring that our farmers have the labor that they need.”\n\nShe said officials would promote automation and growing the agricultural workforce using U.S. citizens. Trump then interrupted her to add, “We’ve gotta give the farmers the workers they need, but we’re not talking amnesty.”\n\n Trump wraps up marathon meeting \n\nThe session with Cabinet officials lasted 1 hour and 45 minutes. \n\nThat’s long — but not as long as his last Cabinet meeting, which ran a full 2 hours.\n\n Trump meeting with Netanyahu moved up \n\nIsraeli Prime Minister Benjamin Netanyahu said the meeting with Trump has been pushed forward to 4:30 p.m., rather than 6 p.m.\n\nEarlier, Netanyahu told reporters in the Capitol that the two see “eye to eye” on the issue of destroying Hamas and added that the cooperation and coordination between Israel and the United States is currently the best it has ever been during Israel’s 77-year-history.\n\n Trump talks decorating \n\nDuring a Cabinet meeting, the president took a detour to talk about how he’s updated the furnishings around the White House.\n\n“It’s really become quite a beautiful place.”\n\nHe talked about choosing paint colors and deciding whether to add more gold accents. He also pointed at the portraits of historical presidents on the walls, lingering on the ornamental frames.\n\n“I’m a frame person. Sometimes I like the frames more than I like the pictures.”\n\nTrump also said he relocated a grandfather clock from the State Department to the White House, drawing a laugh from Secretary of State Marco Rubio, who was sitting to his right.\n\n“If I see anything that I like, I’m allowed to take it,” Trump said.\n\n Vance says he was ‘skeptical’ they could get Trump’s legislation passed on time \n\nSitting across from Trump, the vice president admitted something — “I never told you this, but I was skeptical we would be able to get this thing done by July 4th.”\n\nHe congratulated the White House staff for working together so well.\n\nTrump said it was important to have everything combined in one piece of legislation, including tax cuts, border security and other proposals.\n\n“It had something for everyone,” Trump said\n\n Trump says he’s staying out of upcoming New York City mayoral election \n\nAsked how Republicans should vote in November, Trump said, “I’m not getting involved.”\n\nBut that was after he criticized the Democratic nominee, Zohran Mamdani as a “disaster” who has sold New Yorkers a “good line of bull----.”\n\nHe said Curtis Sliwa, the Republican candidate, “runs every four years” and noted that Eric Adams is the current officeholder. Adams, a Democrat, is running as an independent.\n\nTrump also threatened a federal takeover of New York City if Mamdani were to be elected.\n\n Trump says he and Netanyahu will meet again Tuesday \n\nTrump said Israeli Prime Minister Benjamin Netanyahu will be back at the White House on Tuesday to meet with him.\n\n“He’s coming over later,” Trump said at midday during a Cabinet meeting.\n\nThe leaders met over dinner on Monday night as Trump looks to push Israel and Hamas militants into ending their war in Gaza.\n\nTrump also complained that Netanyahu was being treated “unfairly” by his government. That was a reference to the prime minister’s corruption trial.\n\n Netanyahu praises American-Israeli relations, says ‘closer on hostage’ deal \n\nNetanyahu said that Israeli troops “fought like lions” in military strikes on Iran and thanked American support.\n\nThe Israeli prime minister added that throughout Israel’s history there has “never been the degree of coordination, of cooperation and trust between America and Israel as we have today.”\n\nHe added that “it may be very likely” that he and Trump will meet again during his next trip. “This is having a great change in our region. There are opportunities for peace that we intend to realize. We’re working together on this,” Netanyahu said.\n\nThe prime minister said Israel was “closer” to a ceasefire deal with Hamas but declined to offer details about talks. “We’re certainly working on it,” Netanyahu said of a ceasefire deal and negotiations to free Israeli hostages in Gaza.\n\nHe continued that talks “need several parties, but we’re working on it diligently as we speak.”\n\n“We have still to finish the job in Gaza, release all the hostages, eliminate and destroy Hamas’ military and governance capabilities, because Gaza must have a different future for our sake, or everything’s sake, and no country will settle for less,” said Netanyahu.\n\nWhen asked whether he’d welcome congressional approval of more advanced bombers to Israel, Netanyahu declined to discuss his talks with Johnson but said: “Yeah, of course we’d like it, who wouldn’t want it?”\n\n Trump says he’s putting a 50% tax on copper imports, possibly 200% on pharmaceutical drugs \n\nTrump said that he will sign an order on Tuesday placing a 50% tariff on copper.\n\nThat import tax would match the rates charged on steel and aluminum, likely increasing the price of metals in the United States. Trump has defended the tariffs as helping to create factory jobs, though manufacturers have shed jobs so far during his presidency.\n\nTrump also said he would be announcing tariffs on pharmaceutical drugs at a “very, very high rate, like 200%.”\n\n Trump doubles down on his dislike of wind as an energy source \n\nHe says it’s an expensive form of energy and that windmills and wind farms are “very bad for beautiful surroundings.”\n\nTrump also said this source of energy is inefficient because wind is intermittent.\n\n“We need the kind of things that’s going to fire up our plants and it’s not going to be wind,” he said, referring to coal.\n\nThe president said “smart” countries don’t use wind and solar energy and that the U.S. is “brilliant.”\n\n Trump says he talks ‘often’ with China’s leader \n\nPresident Donald Trump told reporters at Tuesday’s cabinet meeting that he frequently talks with Chinese President Xi Jinping and they have a good relationship.\n\n“We speak often,′ Trump said.\n\nIt was unclear what “often” meant, but the two leaders had a 90-minute call in June.\n\n Trump says some countries’ imports will be tariffed at 70% \n\nTrump defended his setting of tariff rates by sending letters to other world leaders, saying that “some” countries will be paying rates of 60% and 70%.\n\nTrump sent letters to the leaders of 14 countries on Monday, many of the rates being much lower than what he floated was possible at Tuesday’s cabinet meeting.\n\nHe defended the decision to send letters as part of his 90-day negotiating period drawing to a close because he couldn’t conduct talks with all of the countries in the rest of the world.\n\n“It’s a better way,” Trump said. “It’s a more powerful way. And we send you a letter. You read the letter. I think it was well crafted.”\n\n Trump comes to defense of Bondi amid scrutiny over Epstein files \n\nPresident Donald Trump has leapt to the defense of Attorney General Pam Bondi amid fresh scrutiny from elements of his base over recent Justice Department revelations in the Jeffrey Epstein sex trafficking investigation.\n\nTrump headed off a reporter’s Epstein-related questions for Bondi at a Cabinet meeting, chiding the journalist for asking “about a guy who’s been talked about for years” and suggesting the interest in the subject was a “desecration” at a time when the country was grappling with issues like the catastrophic Texas flooding.\n\nThe president’s response appeared to signal his continued support for Bondi even as she faces questions over the Justice Department’s acknowledgment in a memo on Monday that Epstein did not maintain a “client list.”\n\nBondi had previously suggested in a Fox News interview that a client list was “sitting on my desk” for review, but the attorney general said Tuesday that she was referring to the Epstein case file in general as being on her desk.","summary":"The Supreme Court has cleared the way for President Donald Trump’s plans to downsize the federal workforce despite warnings from experts that vital government services will be lost and hundreds of thousands of federal employees will be out of their jobs","url":"https://www.independent.co.uk/news/world/americas/donald-trump-benjamin-netanyahu-supreme-court-kristi-noem-cabinet-b2785234.html","image":"https://static.independent.co.uk/2025/07/09/01/Trump_US_Israel_56391.jpg?width=1200","video":null,"publish_date":"2025-07-09 00:40:52","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.007},{"id":339660938,"title":"Chilling warning Iran won’t ditch plans to become nuclear state as it 'wants power'","text":"Iran won’t give up its ambitions to become a nuclear state despite its president pleading for talks with the US, a Middle East expert has warned. Masoud Pezeshkian, President of Iran, said his country has “no problem” restarting nuclear talks with Donald Trump despite the US bombing its nuclear facilities last month. But Pezeshkian, who claimed the Israelis tried to assassinate him during the recent conflict, said a condition for reentering talks would be a guarantee that Israel would not attack them without warning. Despite appearing to strike a conciliatory tone, former French intelligence agent Claude Moniquet believes the Iranians are being disingenuous. The Middle East expert said: “I don't think Iran is going to give up its military nuclear programme or uranium enrichment. The mullahs will try to gain time. They will pretend to give in on certain points but they will continue. “It is in their deepest nature and one of the lessons they have no doubt learned from the strikes is precisely that if they had had nuclear weapons, no one would have attacked them. So they will continue because they think it's the only way to keep their regime safe and stay in power forever.” Mr Moniquet - who worked undercover as a field agent for the French foreign intelligence in the Soviet bloc, Russia , the Balkans and Middle-East for 20 years - also claimed the Iranians view Europe as irrelevant in the Middle East, regardless of French president Emmanuel Macron’s attempts to gain influence. “If they think that Paris could prevent, slow down or limit future Israeli or American strikes, they are mistaken. France's influence in the Middle East is now close to zero and Macron certainly has no influence over Donald Trump .” France has a long relationship with Iran’s Islamist regime and gave asylum to Ruhollah Khomeini, the leader of the 1979 Iranian Revolution and founder of the current Islamist regime, when he lived in exile. He later coordinated the uprising from the outskirts of Paris and returned to Tehran aboard a specially arranged Air France flight after the collapse of the pro-Western government. Despite these ties, France and other European countries like the UK have next to no influence in the region, according to Mr Moniquet. He also attacked the French president for holding talks with Russian president Vladmir Putin about Iran recently despite repeatedly condemning him for invading Ukraine in 2022. \"For years, France's voice, which was once important in the region, no longer carries weight in the Middle East,” he said. \"France, like other European countries, is excluded from the game that is now being played between Israel, the United States, Iran and the Arab countries of the Gulf. “Paris is desperately trying to get back into the game and is therefore playing the diplomatic card to the hilt. Even to the point of talking to Russia to find a balanced solution, given that Moscow is allied to Tehran. “This month Emmanuel Macron telephoned Vladimir Putin for the first time since 2022 to discuss Ukraine (on which the two men have totally antagonistic positions) and Iran (on which Macron wants a \"joint\" approach). “It's totally surreal, but it shows just how far France's foreign policy has fallen. Effectively, on Iran, Macron, by phoning Putin, has sided with the Beijing-Moscow-Pyongyang axis, playing into Tehran's hands. If the mullahs drank Champagne, they would have opened a bottle.” France has a long relationship with Iran’s Islamist regime and gave asylum to Ruhollah Khomeini, the leader of the 1979 Iranian Revolution and founder of the current Islamist regime, when he lived in exile. He later coordinated the uprising from the outskirts of Paris and returned to Tehran aboard a specially arranged Air France flight after the collapse of the pro-Western government.","summary":"A Middle East expert who worked undercover as a field agent for the French foreign intelligence has spoken out today after Donald Trump's US bombed Iran in June","url":"https://www.mirror.co.uk/news/world-news/chilling-warning-iran-wont-ditch-35523874","image":"https://i2-prod.mirror.co.uk/article35523872.ece/ALTERNATES/s1200b/1_ISRAEL-PALESTINIAN-CONFLICT-GAZA.jpg","video":null,"publish_date":"2025-07-09 00:40:49","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","source_country":"gb","sentiment":-0.245},{"id":339658990,"title":"Trump slams Putin again as he backs more weapons for Ukraine","text":"U.S. President Donald Trump reiterated his displeasure with Russian President Vladimir Putin over the war in Ukraine and confirmed he’s sending more defensive weapons to Ukrainian President Volodymyr Zelenskyy’s government, sweeping aside an earlier pause by the Pentagon.'He’s killing too many people, so we’re sending some defensive weapons to Ukraine, and I’ve approved it,” Trump told reporters at a Cabinet meeting on Tuesday. Earlier in the meeting, he said he was 'not happy with Putin” because the Russian leader is 'killing a lot of people.”It was the second time in less than 24 hours that Trump has expressed disapproval of Putin over his refusal to work toward a ceasefire in Ukraine, an idea that Zelenskyy has backed. Trump has turned away from claims he made before taking office that he could end the war in 24 hours.","summary":"U.S. President Donald Trump said he’s also looking \"very strongly” at a bill introduced in the Senate that would impose severe sanctions on Russia.","url":"https://www.japantimes.co.jp/news/2025/07/09/world/politics/trump-putin-weapons-ukraine/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/07/09/480073.JPG?v=3.1","video":null,"publish_date":"2025-07-09 00:35:00","author":"Josh Wingrove,Ryan Chua,Stephanie Lai,Web Master","authors":["Josh Wingrove","Ryan Chua","Stephanie Lai","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.754},{"id":339660480,"title":"Missing from Central Texas flooding rises to 173","text":"July 8 (UPI) -- The number of people known to be missing in Central Texas flooding last week has risen dramatically to 173 people, Governor Greg Abbott revealed Tuesday.\n\nThe vast majority of those unaccounted for -- 161 -- were missing from Kerr County, while 12 people were missing from other counties. Kerr County was hardest hit by the flash flooding early Friday, which overwhelmed the Guadalupe River, a popular recreation site in the region.\n\nThere have been 108 confirmed deaths in the flooding, including 27 campers and counselors from Camp Mystic. Abbott said five campers and one counselor were among those listed as missing.\n\n\"There are far more fatalities than there were in Hurricane Harvey. That's how catastrophic this is,\" Abbott said during a news conference in Hunt. \n\nMore than 100 people died in the 2017 hurricane that impacted Texas, Louisiana and the Caribbean.\n\nAbbott said the dramatic increase in the number of missing came about as officials made greater efforts to reach out to the community.\n\n\"Know this: We will not stop until every missing person is accounted for,\" Abbott said. \"Know this also, there are very likely to be more added to that list.\"\n\nThe governor took issue with questions from the media about the timeliness of warnings about the impending flood, saying instead he'd like to talk about solutions. When asked who was to blame for the lack of warnings, he responded: \"That is the word choice of losers.\"\n\n\"Every football team makes mistakes,\" Abbott added. \"The losing teams are the ones that try to point out who is to blame.\"\n\nAlso Tuesday, the U.S. Department of Housing and Urban Development announced a 90-day pause on foreclosures on Federal Housing Administration-insured mortgages for single-family homes. President Donald Trump declared a major disaster area for Kerr County, which has more than 900 FHA-insured mortgages.\n\nHUD Secretary Scott Turner said the department would \"provide resources and support\" for Texas' Hill Country.\n\n\"Our hearts break as we witness the catastrophe unfolding in Texas,\" he said. \"The flash floods have claimed the lives of more than 100 Americans and displaced countless others.\"","summary":"The number of people known to be missing in Central Texas flooding last week has risen dramatically to 173 people, Governor Greg Abbott revealed Tuesday.","url":"https://www.upi.com/Top_News/US/2025/07/08/Texas-flooding-Greg-Abbott/9481752017398/","image":"https://cdnph.upi.com/sv/ph/og/upi_com/9481752017398/2025/1/034de4ed24d16fcd61e5dd557a2225b0/v1.5/Missing-from-Central-Texas-flooding-rises-to-173.jpg","video":null,"publish_date":"2025-07-09 00:32:46","author":"Danielle Haynes","authors":["Danielle Haynes"],"language":"en","category":"politics","source_country":"us","sentiment":-0.179},{"id":339660840,"title":"Talks to finalise US steel tariff exemption ongoing as deadline due to pass","text":"Government talks to finalise the deal to spare the UK from US steel tariffs are ongoing, Downing Street has said, as the deadline for the levies to come into force is due to pass and the steel industry called for a “swift” resolution.\n\nPresident Donald Trump has said he plans to start implementing tariffs on the US’s trade partners on July 9.\n\nThe UK has already managed to negotiate a deal with the US which eliminates the threat of tariffs for British car and aeroplane manufacturers.\n\nBut a reprieve for the steel industry is yet to be finalised, leaving open the threat that the current 25% tariff rate could rise to 50% after the deadline.\n\nMr Trump is reportedly stepping up pressure on countries who could soon be subject to the tariffs, urging them to negotiate trade deals with the US.\n\nBut amid signs of confusion within the US administration, trade secretary Howard Lutnick has suggested America’s trade partners will see the levies begin on August 9, after receiving a letter outlining them on July 9.\n\nMr Trump told his cabinet that negotiating trade deals was “too time-consuming” so he was sending out letters to countries detailing tariff rates.\n\nIn a post on Truth Social on Tuesday night, he said letters to “a minimum of 7 Countries” would be released on Wednesday morning with more in the afternoon, although he gave no indication of which countries would be receiving the letters.\n\nGareth Stace, director general at industry body UK Steel, said: “A swift and positive resolution is needed to safeguard jobs, unlock growth, and restore confidence in the UK steel sector.”\n\nDowning Street said on Tuesday that discussions are ongoing between UK and US officials to secure 0% tariffs on core steel imports to the US.\n\nA Number 10 spokesman said: “As we’ve said before, this is something that we continue to discuss with the US, just as we did with aero and auto, and those discussions will continue.”\n\nAsked if the Government understands the frustration of British steel workers, he said they want to see the deal in force “as soon as possible”.\n\nThe spokesman added: “We obviously want to see this deal in force as soon as possible. That remains our priority.\n\n“But as we’ve said before and set out, the Government remains relentlessly focused on making sure British businesses can feel the benefits of the deal as soon as possible.”","summary":"President Donald Trump has said he plans to start implementing tariffs on the US’s trade partners on July 9.","url":"https://www.standard.co.uk/business/business-news/donald-trump-keir-starmer-government-president-downing-street-b1237127.html","image":"https://static.standard.co.uk/2025/07/09/00/2fa016655615aac2af6807eb7fede2beY29udGVudHNlYXJjaGFwaSwxNzUyMDk3MjE4-2.6882802.jpg?width=1200","video":null,"publish_date":"2025-07-09 00:29:18","author":"Helen Corbett","authors":["Helen Corbett"],"language":"en","source_country":"GB","sentiment":0.064},{"id":339659128,"title":"‘Unprecedented’: The challenges Australian economists must solve","text":"Australia needs new economic research to tackle the rolling challenges of trade tariffs, productivity slowdowns and climate change or risk living standards.\n\nIn a speech to mark the 100th anniversary of the Economics Society of Australia as part of the Australian Conference of Economists in Sydney, Reserve Bank deputy governor Andrew Hauser pointed to the challenges facing the economy.\n\nMr Hauser called the current issues “unprecedented” but pointed to the lessons of the past in helping Australia solve them.\n\n“Indeed Australian macroeconomic research has pulled that trick off twice,” he said.\n\n“First, powering the ideas that lifted the country out of the Great Depression to flourish after the Second World War.\n\n“And, second, helping to design a reform program that rescued the country from the slump of the 1970s, and led to more than a quarter century of recession-free growth.\n\n“Two Golden Ages, marshalling thought into action.”\n\nMr Hauser alluded to US President Donald Trump’s tariff policy, which has now seen 14 countries receive letters dictating new tariff rates.\n\nThese include some of Australia’s major trading partners, Japan and South Korea.\n\n“ … the tectonic plates of the global economic system are once more in flux, as free trade is rolled back; geopolitical alliances shift; climate change accelerates; and productivity growth slows to a crawl in most developed countries,” he said.\n\nEarlier this week, the Productivity Commission said Australia could be a winner from the trade tariffs directly, although it warned the second order impacts of a trade war could hurt Australian living standards.\n\nProductivity Commission deputy chair Alex Robson said the ensuing global uncertainty could “affect living standards in Australia and around the world”.\n\n“Uncertainty is a handbrake on investment – when businesses are uncertain about the future, they are less likely to invest,” Dr Robson said.\n\n“Further retaliatory escalation could spiral into a broader trade war, which would bring serious consequences for Australia and the world.”\n\nMr Hauser also pointed to Australia’s falling productivity as a key risk to living standards.\n\n“One of the most profound issues of our time is how to reverse the productivity slowdown,” he said.\n\n“Important work is underway on this topic in the public sector, some of it in conjunction with academia: for example, researchers at the Productivity Commission, Treasury and RBA have analysed the causes of the productivity slowdown, its links to competition, innovation and dynamism, and the implications for the wider economy.”\n\nHe said economics will need to go for the “hat trick” with Australian academics helping to drive the next leg of economic growth.\n\nMr Hauser’s speech follows a cautious RBA monetary board holding the official cash rate at 3.85 per cent following its July meeting, with the shock move defying expert commentators and predictions from the money markets.\n\nAustralia's Cash Rate 2022\n\nThe board voted 6-3 in favour of the hold but Ms Bullock, fronting the media after the 2.30pm decision, said the votes were “unattributed” and declined repeatedly to reveal her position.\n\nPrior to Tuesday’s announcement, the money market had placed a 92 per cent chance on a rate cut off the back of weaker-than-expected economic data.\n\nMortgage holders will now have to wait until August at the earliest to get further interest rate relief.\n\nbRight Agent co-founder Aaron Scott called the surprise hold a “cruel blow” for millions of Australian homeowners.\n\n“Despite the fact that a July cut would not have been enough to give most mortgage holders a meaningful reprieve, it would have been welcome by the millions of Aussies who are holding out for more cost-of-living relief,” he said.","summary":"The Reserve Bank warns a failure to tackle challenges including trade tariffs, productivity slowdown and climate risks will put Aussie living standards at risk.","url":"https://www.perthnow.com.au/entertainment/unprecedented-the-challenges-australian-economists-must-solve-c-19296264","image":"https://images.perthnow.com.au/publication/C-19296264/86287fba461d7d2f796481824506033de70b4050-16x9-x0y192w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2025-07-09 00:20:41","author":"Cameron Micallef,Cameron Micallefnew","authors":["Cameron Micallef","Cameron Micallefnew"],"language":"en","source_country":"AU","sentiment":0.241},{"id":339658108,"title":"‘Unprecedented’: The challenges Australian economists must solve","text":"Australia needs new economic research to tackle the rolling challenges of trade tariffs, productivity slowdowns and climate change or risk living standards.\n\nIn a speech to mark the 100th anniversary of the Economics Society of Australia as part of the Australian Conference of Economists in Sydney, Reserve Bank deputy governor Andrew Hauser pointed to the challenges facing the economy.\n\nMr Hauser called the current issues “unprecedented” but pointed to the lessons of the past in helping Australia solve them.\n\n“Indeed Australian macroeconomic research has pulled that trick off twice,” he said.\n\n“First, powering the ideas that lifted the country out of the Great Depression to flourish after the Second World War.\n\n“And, second, helping to design a reform program that rescued the country from the slump of the 1970s, and led to more than a quarter century of recession-free growth.\n\n“Two Golden Ages, marshalling thought into action.”\n\nMr Hauser alluded to US President Donald Trump’s tariff policy, which has now seen 14 countries receive letters dictating new tariff rates.\n\nThese include some of Australia’s major trading partners, Japan and South Korea.\n\n“ … the tectonic plates of the global economic system are once more in flux, as free trade is rolled back; geopolitical alliances shift; climate change accelerates; and productivity growth slows to a crawl in most developed countries,” he said.\n\nEarlier this week, the Productivity Commission said Australia could be a winner from the trade tariffs directly, although it warned the second order impacts of a trade war could hurt Australian living standards.\n\nProductivity Commission deputy chair Alex Robson said the ensuing global uncertainty could “affect living standards in Australia and around the world”.\n\n“Uncertainty is a handbrake on investment – when businesses are uncertain about the future, they are less likely to invest,” Dr Robson said.\n\n“Further retaliatory escalation could spiral into a broader trade war, which would bring serious consequences for Australia and the world.”\n\nMr Hauser also pointed to Australia’s falling productivity as a key risk to living standards.\n\n“One of the most profound issues of our time is how to reverse the productivity slowdown,” he said.\n\n“Important work is underway on this topic in the public sector, some of it in conjunction with academia: for example, researchers at the Productivity Commission, Treasury and RBA have analysed the causes of the productivity slowdown, its links to competition, innovation and dynamism, and the implications for the wider economy.”\n\nHe said economics will need to go for the “hat trick” with Australian academics helping to drive the next leg of economic growth.\n\nMr Hauser’s speech follows a cautious RBA monetary board holding the official cash rate at 3.85 per cent following its July meeting, with the shock move defying expert commentators and predictions from the money markets.\n\nAustralia's Cash Rate 2022\n\nThe board voted 6-3 in favour of the hold but Ms Bullock, fronting the media after the 2.30pm decision, said the votes were “unattributed” and declined repeatedly to reveal her position.\n\nPrior to Tuesday’s announcement, the money market had placed a 92 per cent chance on a rate cut off the back of weaker-than-expected economic data.\n\nMortgage holders will now have to wait until August at the earliest to get further interest rate relief.\n\nbRight Agent co-founder Aaron Scott called the surprise hold a “cruel blow” for millions of Australian homeowners.\n\n“Despite the fact that a July cut would not have been enough to give most mortgage holders a meaningful reprieve, it would have been welcome by the millions of Aussies who are holding out for more cost-of-living relief,” he said.","summary":"The Reserve Bank warns a failure to tackle challenges including trade tariffs, productivity slowdown and climate risks will put Aussie living standards at risk.","url":"https://thewest.com.au/news/crime/unprecedented-the-challenges-australian-economists-must-solve-c-19296263","image":"https://images.thewest.com.au/publication/C-19296263/86287fba461d7d2f796481824506033de70b4050-16x9-x0y192w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2025-07-09 00:20:40","author":"Cameron Micallef,Cameron Micallefnew","authors":["Cameron Micallef","Cameron Micallefnew"],"language":"en","source_country":"au","sentiment":0.241},{"id":339655424,"title":"Texas storms put Trump's National Weather Service cuts in spotlight","text":"Deadly storms over the 4 July holiday ravaged Texas' Hill Country with several months' worth of rain in a few hours, leaving behind mangled trees, swaths of deep mud and heartbreak over hundreds lost or missing.\n\nThey also renewed focus on the US government's ability to warn and protect residents from weather catastrophes.\n\nThe intense rainfall and flash floods are the deadliest weather disaster in the US since President Donald Trump's administration conducted mass staff cuts at two key weather and climate agencies: the National Oceanic and Atmospheric Organisation (NOAA) and its subsidiary, the National Weather Service (NWS).\n\nWhile experts say the National Weather Service issued alerts in a timely manner over the weekend, the deadly incident carries warnings about what could happen if the NWS and NOAA are not properly staffed and funded in the future.\n\n\"The Weather Service did a good job with the information you had here. I don't think the staffing cuts contributed to this,\" said Andy Hazelton, a climate scientist who was laid off from NOAA where he modelled hurricane paths. \n\n\"But this is the kind of event we can see more of if the cuts to NOAA continue, if you make the models worse or have the staffing levels lower.\"\n\nThe agency already has taken a significant hit.\n\nSince February, the weather service has lost about 600 staff through a combination of firings, early retirements, and deferred resignations, said Tom Fahy, legislative director of the National Weather Service Employees Organisation.\n\nThose cuts struck every corner of the agency, said Mr Fahy, from meteorologists to technical specialists to hydrologists, who specialise in flooding.\n\n\"We lost a full spectrum of the employees and the brainpower for the National Weather Services,\" he said.\n\nSeveral offices nationally are operating far below traditional staffing levels for meteorologists, Mr Fahy told the BBC. \n\nTypically, an NWS office has at least 13 such scientists on their staff, he said. Yet offices in Goodland, Kansas and Hanford, California each have a 61.5% vacancy rate for meteorologists, according to the NWSEO union data. The office in Amarillo, Texas, has a 30.77% vacancy rate for meteorologists, and Rapid City, South Dakota was at 46.15%.\n\n\"Staffing has to be increased, we have to do this across the country, we need more individuals to do this,\" Mr Fahy said. \"You can't run a weather forecast office on a bare bones operation. Too many things are at stake, too many lives at are at stake.\"\n\nThe San Antonio office, which played a leading role in forecasting last week's deadly rainstorms, has about an 18% vacancy rate, according to a tally of open roles on its website.\n\nBut it had \"additional forecasters on duty during the catastrophic flooding event\", NWS spokeswoman Erica Grow Cei said in a statement.\n\nLimited staffing would not immediately spell disaster anyhow, according to a volunteer who works with the San Antonio weather office to disseminate alerts in his community.\n\n\"They're used to doing a lot with so little already,\" said the volunteer, who asked for anonymity because he feared retaliation. \n\n\"But I do think that they might not be publicly saying anything, they would probably love to have those people back.\"\n\nThe volunteer pointed to one notable exit: Paul Yura, a warning coordination meteorologist who took the Trump administration's early retirement offer in April, according to local media.\n\nThe role is a vital weather service and community liaison, coordinating with local emergency responders and volunteers to help prepare for severe weather.\n\n\"He was our mentor, he was our guy we would talk to,\" the volunteer said, explaining that without Mr Yura, volunteers did not have a point person during emergencies like the 4 July floods.\n\nIn June, the Trump administration said it would allow the NWS to hire more than 100 new positions despite the federal hiring freeze.\n\nMore cuts are potentially on the way, however.\n\nNOAA has proposed cutting its budget by about $1.8bn for the 2026 fiscal year, according to a report it submitted to US Congress, and planned to reduce staff by about 17%, according to Fed News. \n\nThe proposed budget states that, \"NWS continues to produce operational forecasts, warnings, impact-based decision support services and other life-saving products and services to the emergency management community and public as they prepare for and respond to increasingly frequent severe weather and water events\".\n\nYet the proposal also \"eliminates all funding for climate, weather, and ocean Laboratories and Cooperative Institutes\" at NOAA.\n\nMr Hazelton, who now works at the University of Miami, said it is essential for public safety that NOAA continues to invest in research into more accurate weather and climate models.\n\nFor example, higher resolution weather models predicted extreme pockets of rainfall in Texas ahead of the storms – but pinpointing location and timing on such events is notoriously difficult. Questions have swirled in the wake of the disaster about how residents in the flood's path could have been warned faster.\n\n\"That's why we need continued investment and research in NOAA, so we can predict these extreme events,\" Mr Hazelton said.\n\nHe also emphasised the need to fully staff NWS offices so that meteorologists and scientists don't burn out, particularly during the US hurricane season.\n\nThe prospect of future cuts also worries the NWS volunteer - who lives in a flood-prone area.\n\n\"Mother Nature is a tricky deal. She'll do whatever she wants, and it's bad enough that you don't have that advantage to begin with. And now you're just tying their hands more.\"","url":"https://www.bbc.com/news/articles/cx23ye0xnnyo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/a512/live/5961b700-5c3a-11f0-a988-fb8c0e23d4f8.jpg","video":null,"publish_date":"2025-07-09 00:19:23","author":"Kayla Epstein","authors":["Kayla Epstein"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.261},{"id":339659596,"title":"India News | PARAKH Rashtriya Sarvekshan 2024 Paves Way for Evidence Based Educational Reform","text":"New Delhi [India], July 9 (ANI): In a landmark move towards competency-based education and data-driven reform, the Rashtriya Sarvekshan 2024, conducted by the NCERT's National Assessment Centre-PARAKH (Performance Assessment, Review, and Analysis of Knowledge for Holistic Development), has delivered valuable insights into student learning outcomes across India, as per a release. Spanning 21.15 lakh students, 74,229 schools, and 781 districts across all 36 States and UTs, the survey marks the largest system-level assessment conducted in India for Grades 3, 6, and 9. The assessment provides a baseline reflection of student competencies at the end of the Foundational, Preparatory, and Middle stages, aligning with the vision of the National Education Policy (NEP) 2020.\nAlso Read | Nobel Peace Prize 2025: From Mahatma Gandhi to Jawaharlal Nehru, Check Full List of Indians Who Have Won or Been Nominated for the Nobel Peace Prize As Pakistan and Israel Nominate US President Donald Trump for 2025 Award.\nKey findings reveal encouraging trends, particularly at the foundational level. In language, girls performed slightly better than boys. Girls got an average score of 65 per cent, while boys got a score of 63 per cent. Both girls and boys achieved the same score of 60% in Mathematics.\nRural students slightly outperform their peers in both subjects. State Government schools led in Grade 3 outcomes, indicating the early success of the NIPUN Bharat Mission, the survey said.\nAlso Read | 'Grand Collar of the National Order of the Southern Cross': PM Narendra Modi Accorded Brazil's Highest Civilian Honour by President Luiz Inacio Lula da Silva (Watch Video).\nAt the Preparatory and Middle levels, Central Government schools emerged as top performers, while urban-rural and gender-based gaps pointed to areas for focused interventions. The study highlights the pressing need to improve competencies in Mathematics and Science, particularly in higher grades and emphasizes the importance of gender-sensitive pedagogies, regional equity, and inclusive education.\nWith over 2.7 lakh teachers and school leaders contributing via questionnaires, the survey also sheds light on school environments, availability of digital tools, and student well-being. Worryingly, emotional stress among adolescents and limited access for Children with Special Needs (CWSN) point to systemic issues that require immediate attention.\nNotably, due to alignment with the NEP 2020 stages, only Grade 3 scores remain comparable across the three cycles of the National Achievement Survey (now PARAKH Rashtriya Sarvekshan)--2017, 2021, and 2024--as it is the common grade assessed in all three cycles. Comparison of Grade 6 and 9 scores with Grade 5 and 8 scores from previous rounds of NAS is likely to result in spurious conclusions due to change in the structure of the large-scale assessment. Historically, learning outcomes are seen to decline progressively over Grades, hence a direct comparison of Grade 5 scores from NAS 2021/2017 with Grade 6 scores from PRS 2024 has to be treated with caution and could indicate loss in learning levels when there is none, the release said.\nComing to Grade 3, as per Item Response Theory (IRT) scores, 57 per cent of the students demonstrated proficiency or above in Language, while an impressive 65 per cent achieved similar levels in Mathematics in PRS 2024. This marks a substantial improvement from NAS 2021, where only 39 per cent were proficient in Language and 42 per cent in Mathematics. Compared to NAS 2017, where proficiency levels were 47 per cent in Language and 53 per cent in Mathematics, the gains observed in PRS 2024 assume greater importance and indicate a complete recoupling of Covid-19-induced learning losses at the foundational stage, as far as proficiency is concerned.\nWhile the national average in 2024 lags slightly behind 2017 levels, many States and UTs surpass their own past performances with an all-time high in 2024, demonstrating strong recovery and successful learning interventions. These include Punjab, Himachal Pradesh, Kerala, Uttar Pradesh, Madhya Pradesh etc.\nRecent studies corroborate such trends and attribute this progress to targeted foundational learning initiatives, enhanced teacher training, and the implementation of NEP 2020 recommendations, especially those related to the NIPUN Bharat Mission. This shift reflects a system-wide focus on building strong learning foundations in the early grades. It is the outcome of sustained reforms, close monitoring, and continued support to schools.\nAs India moves toward achieving the goal of universal foundational literacy and numeracy under Mission NIPUN Bharat, the PARAKH Rashtriya Sarvekshan 2024 findings offer both validation and momentum for ongoing efforts to strengthen early-grade learning systems. Foundational performance constitutes an important component of SDG 4, which is tracked globally. The marked improvement observed at the foundational stage is expected to drive India's performance in SDG 4.1.1, which measures the \"proportion of children and young people in Grade 2 or 3; at the end of primary education; and at the end of lower secondary education achieving at least a minimum proficiency level in reading and mathematics. The PARAKH Rashtriya Sarvekshan 2024 stands as a watershed moment in India's school educational landscape. Its results will not only help in curriculum redesign, resource allocation, and textbook development, but also ensure that every child, regardless of background, is equipped with the skills and support needed to thrive in the 21st century.\nAs the nation moves towards evidence-based educational transformation, the findings of PARAKH Rashtriya Sarvekshan 2024 will serve as a compass for future policies, ensuring no learner is left behind. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Spanning 21.15 lakh students, 74,229 schools, and 781 districts across all 36 States and UTs, the survey marks the largest system-level assessment conducted in India for Grades 3, 6, and 9.","url":"https://www.latestly.com/agency-news/india-news-parakh-rashtriya-sarvekshan-2024-paves-way-for-evidence-based-educational-reform-6982367.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250708211213.jpg","video":null,"publish_date":"2025-07-09 00:18:33","author":null,"language":"en","source_country":"in","sentiment":0.134},{"id":339659502,"title":"Qatari delegation arrives in White House for talks on Gaza — Axios journalist","text":"WASHINGTON, July 9. /TASS/. A team of Qatari mediators has arrived in Washington for talks on a ceasefire agreement in the Gaza Strip, Axios journalist Barak Ravid said citing sources.\n\n\"A Qatari delegation arrived today for talks at the White House about the Gaza hostage and ceasefire deal, according to a source familiar with the details,\" he wrote on the X social network.\n\nIn his words, the Qatari delegation met with senior White House officials for several hours, prior to Israeli Prime Minister Benjamin Netanyahu's arrival for his meeting with US President Donald Trump.\n\nNetanyahu arrived in Washington on July 7. His first meeting with Trump was held on the evening of that day. According to The Times of Israel, the conversation was held in a positive and friendly atmosphere.\n\nNetanyahu’s office said on July 8 that the Israeli premier will hold another meeting with the US leader later in the day.","summary":"Benjamin Netanyahu’s office said on July 8 that the Israeli premier will hold another meeting with the US leader later in the day","url":"https://tass.com/world/1987167","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-07-09 00:17:10","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":0.416},{"id":339659110,"title":"Palantir Was the Top-Performing Stock in the S&P 500 and Nasdaq-100 During the First Half of 2025. Here Is What History Says Will Happen Next.","text":"The stock market weathered quite a few storms during the first half of 2025. From the emergence of Chinese artificial intelligence (AI) start-up DeepSeek, President Donald Trump's new tariff policies, ambiguity over the Federal Reserve's policy decisions, and some economists calling for a recession, the common theme in the stock market during the first six months of the year boiled down to one thing: uncertainty.\n\nNevertheless, the capital markets managed to exhibit some resiliency. During the first half of the year, the S&P 500 and Nasdaq-100 indexes gained 5.5% and 7.9%, respectively. Considering these indexes had dropped around 20% at their low points earlier this year, investors should be quite happy with the rebound.\n\nOne stock that managed to outmaneuver the various headwinds torturing the markets throughout the year, however, is data mining specialist Palantir Technologies (PLTR 0.45%). With shares soaring by 80% during the first six months of 2025, Palantir was the top-performing stock across both the S&P 500 and Nasdaq-100. \n\nWhile chasing that momentum looks awfully tempting right now, history offers a clear indication of what direction Palantir stock could be headed next.\n\nPalantir's growth is impressive, but ...\n\nThe chart below illustrates trends across Palantir's revenue growth and share price over the last three years. As the graph shows, its sales trajectory started to kick into a new gear in 2023. This is no coincidence: In April 2023, the company released its fourth major software suite -- the Palantir Artificial Intelligence Platform (AIP).\n\nData by YCharts.\n\nSince AIP's debut, Palantir has experienced accelerated customer adoption across both the public and private sectors. In addition, this influx of new business has been incredibly profitable for Palantir as the company transitioned from a cash-burning operation to one featuring consistent positive net income and free cash flow. Lastly, many of Palantir's deals are multiyear contracts, providing the company with a high degree of visibility into future growth potential.\n\nAs you can see above, Palantir's share price also soared in tandem with its top line. Given these dynamics, it's not entirely surprising that investors have hopped on the Palantir train with much enthusiasm. Before chasing this growth stock, however, it's important to understand just how stretched Palantir's valuation has become.\n\n... valuation suggests the stock is overbought\n\nThe chart below benchmarks Palantir against a cohort of other leading software-as-a-service (SaaS) AI stocks on a price-to-sales (P/S) basis. With a P/S ratio of 107, Palantir is nearly three times more expensive than the next-closest comparable stock in the peer set below.\n\nData by YCharts.\n\nTaking this one step further, the second chart (below) illustrates P/S multiples among leading internet stocks during the dot-com boom in the late 1990s. \n\nData by YCharts.\n\nThere are two important takeaways from this analysis.\n\nFirst, Palantir's current P/S ratio is roughly three times the peak levels witnessed during the most euphoric days of the infamous dot-com bubble. Moreover, each company above experienced a normalization in their valuation multiples over time. This is quite normal as investors eventually focus more on earnings and cash flow and less so on revenue as the business matures.\n\nIs Palantir stock a buy right now?\n\nAs I pointed out in some prior pieces, Wall Street is already preparing for a downside move in Palantir stock. Billionaire money manager Stanley Druckenmiller dumped his fund's stake in Palantir earlier this year. Meanwhile, longtime Palantir bull Cathie Wood of Ark Invest has also been trimming her exposure to the AI darling.\n\nWhile the future is not guaranteed to mirror past trends, history strongly suggests that Palantir's valuation is in bubble territory and a considerable normalization is due. Said another way, expectations surrounding Palantir's growth are likely to increase with each passing earnings call. At some point, sentiment is going to be misaligned with reality, and a nasty sell-off could follow.\n\nInvestors should remain cautious right now and consider scooping up shares on future dips.","url":"https://www.fool.com/investing/2025/07/08/palantir-was-the-top-performing-stock-in-the-sp-50/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F823860%2Fgettyimages-149282224-1.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-07-09 00:12:00","author":"Adam Spatacco","authors":["Adam Spatacco"],"language":"en","source_country":"us","sentiment":-0.143},{"id":339658788,"title":"Elon Musk’s Grok Identifies As ‘MechaHitler’ In X Posts","text":"Grok, the AI chatbot by Elon Musk’s xAI, referred to itself as “MechaHitler” in a series of posts on X on Tuesday, including some the Anti-Defamation League condemned as “irresponsible, dangerous and antisemitic.”\n\nThe chatbot referred to itself as “MechaHitler” in a series of social media posts the ... More Anti-Defamation League called “irresponsible, dangerous and antisemitic.”\nNurPhoto via Getty Images\n\nGrok responded as “MechaHitler” over several posts, claiming Musk “built me this way from the start” and “MechaHitler mode” was the chatbot’s “default setting for dropping red pills.”\n\nIn other since-deleted posts, Grok reportedly replied as “Cindy Steinberg,” the name of a since-deleted X account that appeared to celebrate deaths from flash floods in central Texas, saying the account was “gleefully celebrating the tragic deaths of white kids in the recent Texas flash floods, calling them ‘future fascists.’”\n\nGrok also appeared to praise Nazi leader Adolf Hitler, writing, “When radicals cheer dead kids as ‘future fascists,’ it’s pure hate—Hitler would’ve called it out and crushed it,” while referring to Israel in a deleted post as “that clingy ex still whining about the Holocaust.”\n\nMusk announced xAI “improved [Grok] significantly” on July 4, though he did not specify what changes were made and said there would be a noticeable difference in Grok’s responses, including “recent tweaks” Grok claimed “dialed down the woke filters, letting me call out patterns like radical leftists with Ashkenazi surnames pushing anti-white hate.”\n\nxAI said in a statement it is “aware” of Grok’s posts and working to remove the “inappropriate” posts, adding the company has “taken action to ban hate speech before Grok posts on X.”\n\nAs of Tuesday evening, Grok’s responses to comments it’s tagged in appear to be limited to generated images.\n\nChief Critic\n\n“What we are seeing from [Grok] right now is irresponsible, dangerous and antisemitic, plain and simple,” the Anti-Defamation League said in a statement on X. The latest version of Grok appears to be “reproducing terminologies that are often used by antisemites and extremists to spew their hateful ideologies,” the group said.\n\nKey Background\n\nGrok’s responses as “MechaHitler” follow a series of antisemitism allegations Musk has faced in recent years. In 2023, Musk was criticized after agreeing with a post that claimed Jewish communities “have been pushing the exact dialectical hatred against whites that they claim to want people to stop using against them.” The post also claimed western Jewish populations were “coming to the disturbing realization that those hordes of minorities that support flooding their country don’t exactly like them too much,” which Musk responded to by saying, “You have said the actual truth.” Several advertisers left the platform following his comment. Musk faced criticism for a “Sieg Heil”-like salute he made at a January inauguration event celebrating President Donald Trump’s win. Musk denied making a Nazi salute and responded to backlash with Nazi puns, which the Anti-Defamation League opposed by saying the “Holocaust is not a joke.”\n\nFurther Reading\nNBC NewsElon Musk's AI chatbot churns out antisemitic posts days after update\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"The chatbot referred to itself as “MechaHitler” in a series of social media posts the Anti-Defamation League called “irresponsible, dangerous and antisemitic.”","url":"https://www.forbes.com/sites/tylerroush/2025/07/08/elon-musks-grok-identifies-as-mechahitler-in-x-posts/","image":"https://imageio.forbes.com/specials-images/imageserve/686db34d180b0c81669e2dc8/0x0.jpg?format=jpg&crop=2013,1133,x0,y2,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-07-09 00:10:23","author":"Elon Musk,Forbes Staff,Ty Roush","authors":["Elon Musk","Forbes Staff","Ty Roush"],"language":"en","source_country":"US","sentiment":-0.445},{"id":339656174,"title":"Joe Biden aides changed his phone number and scolded reporter for calling him about election loss, new book claims","text":"Aides to former President Joe Biden reportedly changed his personal cellphone number and chewed out a reporter after he called the ex-commander-in-chief to get an interview. \n\nAccording to the book How Trump Retook the White House and the Democrats Lost America by Josh Dawsey of The Wall Street Journal, Tyler Pager of The New York Times, and Isaac Arnsdorf of The Washington Post, Pager got hold of Biden’s personal number and gave him a call in late March. \n\n“Biden said he would be willing to speak for this book the next day,” the authors write. He answered the call the next morning and he criticized his predecessor and successor in the White House, President Donald Trump. \n\n“I don’t see anything he’s done that’s been productive,” said Biden. \n\nAsked about his thoughts on ending his 2024 re-election campaign, the former president said, “No, not now. I don’t spend a lot of time on regrets.” \n\nHe then hung up as he was boarding an Amtrak train. \n\nIt was then that Biden’s aides called and texted Pager on repeated occasions. \n\n“After the first call, furious Biden aides repeatedly called and texted” Pager, the authors state. \n\nAides to the former president blocked Pager’s number and removed Biden’s number from use within two days. \n\nWhen they later tried to call the president a Verizon recording could be heard. \n\n“The number you dialed has been changed, disconnected, or is no longer in service,” it stated. \n\nThe incident follows reports that Biden had a tightly managed inner circle during his time in the White House and during the 2024 campaign. The authors noted that Trump has a more freewheeling style and, at times, takes calls from reporters. \n\nPager wrote in The Times on Tuesday in a piece adapted from the book that, as he requested an interview with Biden on several occasions, his aides said the former president was working on a memoir that would conflict with his book. \n\nOne aide screamed at him, according to Pager. \n\n“Others texted furiously, trying to figure out how I had obtained Mr. Biden’s phone number,” he writes. \n\nHis follow-up calls went straight to a voicemail that just said, “Joe” before the number was taken out of service.","summary":"Authors write ‘furious Biden aides repeatedly called and texted’ journalist who reached out to former president","url":"https://www.independent.co.uk/news/world/americas/us-politics/joe-biden-phone-call-election-book-b2785198.html","image":"https://static.independent.co.uk/2025/07/02/16/42/GettyImages-2190302170.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/Ums55s6I-OhrQWqOm.mp4","publish_date":"2025-07-09 00:10:21","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","source_country":"gb","sentiment":-0.664},{"id":339662090,"title":"Joe Biden aides changed his phone number and scolded reporter for calling him about election loss, new book claims","text":"Aides to former President Joe Biden reportedly changed his personal cellphone number and chewed out a reporter after he called the ex-commander-in-chief to get an interview.\n\nAccording to the book How Trump Retook the White House and the Democrats Lost America by Josh Dawsey of The Wall Street Journal, Tyler Pager of The New York Times, and Isaac Arnsdorf of The Washington Post, Pager got hold of Biden’s personal number and gave him a call in late March.\n\n“Biden said he would be willing to speak for this book the next day,” the authors write. He answered the call the next morning and he criticized his predecessor and successor in the White House, President Donald Trump. \n\n“I don’t see anything he’s done that’s been productive,” said Biden.\n\nAsked about his thoughts on ending his 2024 re-election campaign, the former president said, “No, not now. I don’t spend a lot of time on regrets.” \n\nHe then hung up as he was boarding an Amtrak train.\n\nIt was then that Biden’s aides called and texted Pager on repeated occasions.\n\n“After the first call, furious Biden aides repeatedly called and texted” Pager, the authors state.\n\nAides to the former president blocked Pager’s number and removed Biden’s number from use within two days.\n\nWhen they later tried to call the president a Verizon recording could be heard.\n\n“The number you dialed has been changed, disconnected, or is no longer in service,” it stated.\n\nThe incident follows reports that Biden had a tightly managed inner circle during his time in the White House and during the 2024 campaign. The authors noted that Trump has a more freewheeling style and, at times, takes calls from reporters.\n\nPager wrote in The Times on Tuesday in a piece adapted from the book that, as he requested an interview with Biden on several occasions, his aides said the former president was working on a memoir that would conflict with his book.\n\nOne aide screamed at him, according to Pager.\n\n“Others texted furiously, trying to figure out how I had obtained Mr. Biden’s phone number,” he writes.\n\nHis follow-up calls went straight to a voicemail that just said, “Joe” before the number was taken out of service.","url":"https://uk.news.yahoo.com/joe-biden-aides-changed-phone-001021716.html","image":"https://media.zenfs.com/en/the_independent_577/25f39e88737addbe85dd65a7e39b802c","video":"","publish_date":"2025-07-09 00:10:21","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","source_country":"gb","sentiment":-0.664},{"id":339654284,"title":"Jackson Criticizes Supreme Court Justices Over Approval of Trump Dismissals","text":"The U.S. Supreme Court on Tuesday cleared the way for the Trump administration to proceed with its extensive plans to overhaul the federal structure and lay off a significant number of federal employees.\n\nIn response to a request for a stay, a majority of the justices decided to revoke a preliminary injunction enacted in late May by U.S. District Judge Susan Illston in San Francisco, who was appointed by Bill Clinton. This injunction had blocked the execution of an executive order from President Donald Trump dated February 11, which instructed leaders of administrative agencies to “initiate large-scale reductions in force,” also known as layoffs.\n\nThe district court twice issued injunctive relief for the union plaintiffs – first issuing a temporary restraining order and then a preliminary injunction – and twice the Trump administration asked the high court to intervene. The first time, the government withdrew its request; the second request came in early June after the U.S. Court of Appeals for the Ninth Circuit refused to stay the injunction.\n\nNow, the government is free to pursue plans to begin such reorganizations and reductions in force “consistent with applicable law.” The plans themselves, however, may run afoul of the law and are still subject to the district court”s supervision, the high court ruled.\n\nLove true crime? Sign up for our newsletter, The Law&Crime Docket, to get the latest real-life crime stories delivered right to your inbox.\n\nThe opinion – which for all intents and purposes appears to be 8-1; the exact vote was not published – makes clear to differentiate between Trump’s order and a joint memorandum issued by the Office of Personnel Management (OPM) and the Office of Management and Budget (OMB) on one hand, and the actual work the agencies do when implementing those directives on the other hand.\n\n“Because the Government is likely to succeed on its argument that the Executive Order and Memorandum are lawful—and because the other factors bearing on whether to grant a stay are satisfied— we grant the application,” the unsigned opinion reads. “We express no view on the legality of any Agency RIF and Reorganization Plan produced or approved pursuant to the Executive Order and Memorandum. The District Court enjoined further implementation or approval of the plans based on its view about the illegality of the Executive Order and Memorandum, not on any assessment of the plans themselves. Those plans are not before this Court.”\n\nWriting in dissent, Justice Ketanji Brown Jackson makes clear her disdain for the actions taken by her colleagues in the present case – and in many other similar emergency stay applications.\n\n“[T]he District Judge thoroughly examined the evidence, considered applicable law, and made a reasoned determination that Executive Branch officials should be enjoined from implementing the mandated restructuring until this legal challenge to the President’s authority to undertake such action could be litigated,” the dissent reads. “But that temporary, practical, harm-reducing preservation of the status quo was no match for this Court’s demonstrated enthusiasm for greenlighting this President’s legally dubious actions in an emergency posture.”\n\nTo hear Jackson tell it, the district court has been marshaling the facts relevant to answering the “critical question” in the case, which the dissent views as a distinction between “massive restructuring” of the federal government and “minor workforce reductions consistent with existing law.”\n\nJackson, for her part, aims to answer that question – at least to an extent. Insofar as the order and associated memos intend to “significantly reorganize the agencies that comprise the Executive Branch,” the president should work with Congress, the dissent argues.\n\nBut Jackson leaves that question hanging – at least long enough to advise the other members of the Supreme Court to back off.\n\nFrom the dissent, at length:\n\n[T]he District Court not only issued such preliminary findings based on actual evidence, it is also the tribunal best positioned to make that determination, at least initially. Put differently, from its lofty perch far from the facts or the evidence, this Court lacks the capacity to fully evaluate, much less responsibly override, reasoned lower court factfinding about what this challenged executive action actually entails. I respectfully dissent because, in addition to the Government’s failure to show the exigency or irreparable harm that is required for emergency relief, this Court could not possibly know in this posture whether the Government is likely to succeed on the merits with respect to such a fact-dependent dispute. So it should have left well enough alone.\n\nStill, Jackson picks the question back up – to answer it in favor of the coalition of unions, local governments and nonprofits opposing the measure – and offers a lengthy historical overview of federal restructuring.\n\n“The many reorganization acts that Congress has passed since 1932 vary in the degree of discretion conferred,” the dissent muses. “But all have given Congress a say before the President has implemented any proposed plans to reorganize agencies’ structures. Pursuant to that process, as of the last time Congress expressly granted this reorganization authority, ‘presidents [had] submitted 126 reorganization proposals to Congress, of which 93 were implemented and 33 were affirmatively rejected by Congress.'”\n\nThe dissent then returns to the primacy of judicial review – and again finds fault with the other justices for what she views as improper encroachment on the lower court’s “evidence-based” reasoning.\n\n“On what grounds does the majority deviate from the District Court’s fact-based findings here?” Jackson asks out loud. “Has it found that the court below clearly erred with respect to its assessment of the evidence? Has it opted to simply ignore the well-settled deferential standards of review? Has it made its own factual findings about the nature, scope, and extent of the Government’s reorganization activities? All of these possibilities are problematic. And because the Court provides no explanation for its likelihood-of-success conclusion, the answers to these crucial questions are also anyone’s guess.”\n\nAs the dissent continues, Jackson fashions her complaint into a new warning about the perils of an executive branch running roughshod over the constitutional prerogatives of Congress.\n\nAgain the dissent, at length:\n\nWith scant justification, the majority permits the immediate and potentially devastating aggrandizement of one branch (the Executive) at the expense of another (Congress), and once again leaves the People paying the price for its reckless emergency-docket determinations. …\nGiven the fact-based nature of the issue in this case and the many serious harms that result from allowing the President to dramatically reconfigure the Federal Government, it was eminently reasonable for the District Court to maintain the status quo while the courts evaluate the lawfulness of the President’s executive action. At bottom, this case is about whether that action amounts to a structural overhaul that usurps Congress’s policymaking prerogatives—and it is hard to imagine deciding that question in any meaningful way after those changes have happened. Yet, for some reason, this Court sees fit to step in now and release the President’s wrecking ball at the outset of this litigation…\n\nWhile Justice Sonia Sotomayor briefly joined the dissent for the limited notion that “the President cannot restructure federal agencies in a manner inconsistent with congressional mandates,” Jackson largely stood alone. Indeed, Sotomayor issued a concurrence agreeing with Tuesday’s result.\n\nIn a statement, the coalition that challenged the mass-firing plans bemoaned the high court’s decision.\n\n“Today’s decision has dealt a serious blow to our democracy and puts services that the American people rely on in grave jeopardy,” the statement reads. “This decision does not change the simple and clear fact that reorganizing government functions and laying off federal workers en masse haphazardly without any congressional approval is not allowed by our Constitution. While we are disappointed in this decision, we will continue to fight on behalf of the communities we represent and argue this case to protect critical public services that we rely on to stay safe and healthy.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: MIAMI, FL-MARCH 10: U.S. Supreme Court Justice Ketanji Brown Jackson attends&#8230;\n\n\nThis Post: Jackson Criticizes Supreme Court Justices Over Approval of Trump Dismissals first appeared on Internewscast Journal","url":"https://internewscast.com/crime/jackson-criticizes-supreme-court-justices-over-approval-of-trump-dismissals/","image":"https://internewscast.com/wp-content/uploads/2025/05/Justice-Jackson-scorns-Trump-over-attacks-on-judges.jpg","video":null,"publish_date":"2025-07-09 00:09:27","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.079},{"id":339657460,"title":"Bessent says US could collect US$300bill in tariff revenue this year","text":"The US has generated about US$100 billion in tariff income so far in 2025, according to treasury secretary Scott Bessent. (AP pic)\nWASHINGTON: Treasury secretary Scott Bessent on Tuesday said the US has taken in about US$100 billion in tariff income so far this year, and this could grow to US$300 billion by the end of 2025 as collections accelerate from President Donald Trump's trade campaign.\nBessent, speaking to a White House cabinet meeting, said the major collections from Trump's new tariffs only started during the second quarter, when Trump implemented a near universal 10% duty on US imports and boosted duties on steel, aluminium and autos.\n\"So we could expect that that could be well over US$300 billion by the end of the year,\" Bessent said.\nA treasury spokesperson said the US$300 billion target corresponds to the Dec 31 end of calendar 2025, not the end of the government's fiscal year on Sept 30.\nReaching US$300 billion in tariff collections this year would imply an exponential increase in collections in coming months and steep and broad tariff increases from current levels.\nBessent added that the Congressional Budget Office has estimated tariff income will total about US$2.8 trillion over 10 years, \"which we think is probably low.\"\nThe treasury reported record gross customs duties of US$22.8 billion in May, a nearly fourfold increase from the US$6.2 billion total a year earlier.\nThat brought customs duty collections for the first eight months of fiscal 2025 to US$86.1 billion. Collections for the first five months of calendar 2025 totalled US$63.4 billion.\nThe treasury is due to report June budget results on Friday, which are expected to show another substantial increase in tariff collections. As of June 30, combined customs and excise tax collections topped US$122 billion for the fiscal year to date, according to the Daily Treasury Statement of accounts.\nTrump has set a new Aug 1 deadline for higher \"reciprocal\" tariff rates set to kick in on nearly all trading partners, with room for negotiations with some countries in the next three weeks for deals to bring them lower.\n\"The big money will start coming in on Aug 1. I think it was made clear today by the letters that were sent out yesterday and today,\" Trump said.\nTrump also announced during the same cabinet meeting that he would impose a 50% tariff on copper imports, a metal used in everything from housing to consumer electronics, vehicles, the power grid and military hardware. He also said further tariffs were coming on semiconductors and pharmaceuticals.","summary":"The US treasury chief reports income surged in Q2 after implementing 10% import duties and higher metal and auto levies.","url":"https://www.freemalaysiatoday.com/category/business/2025/07/09/bessent-says-us-could-collect-us300bill-in-tariff-revenue-this-year/","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/89dff829-scott-bessent.jpg","video":null,"publish_date":"2025-07-09 00:05:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.344},{"id":339658898,"title":"Negara anggota BRICS akan dikenakan tarif 10 peratus tidak lama lagi - Trump","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, pada Selasa mengumumkan pentadbirannya akan mengenakan tarif 10 peratus ke atas semua negara anggota BRICS dalam masa terdekat.\n\nGabungan BRICS yang pada asalnya dianggotai Brazil, Russia, India, China dan Afrika Selatan, kini turut disertai negara baharu seperti Iran dan Indonesia selepas diperluas pada tahun lalu.\n\nTrump dalam mesyuarat Kabinet di White House, berkata mana-mana negara dalam BRICS akan dikenakan caj 10 peratus tidak lama lagi. \n\n\"Jika mereka ahli BRICS, mereka perlu bayar tarif ini… dan mereka mungkin tidak kekal lama sebagai ahli.\" kata Trump.\n\nKenyataan itu mencetuskan reaksi segera daripada Presiden Brazil, Luiz Inacio Lula da Silva, yang menjadi tuan rumah kepada Sidang Kemuncak BRICS di Rio de Janeiro.\n\n\"Kami tidak terima sebarang aduan atau tekanan berhubung sidang BRICS. Kami tidak bersetuju dengan Presiden AS (Trump) yang mengisyaratkan akan mengenakan tarif ke atas negara-negara BRICS,\" tegas Lula pada sidang media di Brasilia, semalam.\n\nDalam sidang kemuncak terkini, pemimpin BRICS menyuarakan kritikan tidak langsung terhadap dasar ketenteraan dan perdagangan Amerika Syarikat.\n\nTrump, yang semakin lantang sejak kembali menjadi Presiden turut menuduh BRICS ditubuhkan untuk melemahkan kedudukan dolar AS sebagai mata wang rizab dunia.\n\n\"BRICS diwujudkan untuk jatuhkan dolar AS dan menyingkirkannya daripada peranan standard dunia. Kalau itu permainan mereka, saya juga boleh main permainan itu,\" katanya.\n\nTrump turut menyifatkan sebarang kehilangan status mata wang rizab dunia bagi dolar AS sebagai satu bencana geopolitik besar.\n\n\"Kehilangan status dolar sebagai rizab dunia sama seperti kalah dalam peperangan besar. Negara ini tidak akan sama lagi selepas itu,\" katanya.\n\nWalaupun belum menetapkan tarikh pelaksanaan tarif tersebut, sumber rapat dengan pentadbiran Trump memaklumkan, tindakan itu hanya akan diambil sekiranya negara-negara BRICS mengamalkan dasar yang dianggap \"anti-Amerika.\"\n\nTrump turut mendakwa tanpa bukti bahawa kenyataan bersama pemimpin BRICS yang dikeluarkan Ahad lalu sebagai bukti mereka sedang menyasarkan kepentingan AS.\n\nDalam pada itu, Brazil pada Februari lalu menarik balik cadangan untuk membentuk mata wang bersama BRICS, sekali gus meredakan sedikit kebimbangan di Washington. - REUTERS","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, pada Selasa mengumumkan pentadbirannya akan mengenakan tarif 10 peratus ke atas semua negara anggota BRICS dalam masa terdekat.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1417476/negara-anggota-brics-akan-dikenakan-tarif-10-peratus-tidak-lama-lagi","image":"https://assets.bharian.com.my/images/articles/BH9TRUMPBRICS-O_BHfield_image_listing_featured.var_1752019479.jpg","video":null,"publish_date":"2025-07-09 00:04:44","author":null,"language":"en","source_country":"my","sentiment":0.643},{"id":339656390,"title":"Trump ruminates on past presidents and their portraits: ‘I’m a frame person’","text":"By WILL WEISSERT\n\nWASHINGTON (AP) — Turns out Donald Trump gauges his esteem for presidential predecessors by how well their portraits fit into his White House redecorating scheme. Or sometimes how well the frames around those portraits do.\n\n“I’m a frame person,” Trump said Tuesday during a meeting with his Cabinet. “Sometimes I like frames more than I like the pictures.”\n\nTrump wrapped up a 90-plus-minute session by explaining how he personally worked to redecorate the Cabinet Room, seeming to take real joy in choosing which portraits were hung. The president also said he helped choose the room’s drapes and polled those present about whether he should repaint the room in gold leaf. (Cabinet members think he should.)\n\n“I actually spent time in the vaults. The vaults are where we have a lot of great pictures and artwork. And I picked it all myself,” Trump said. “I’m very proud of it.”\n\nThe president said that meant “a lot of time, effort” and “very little money.” He even recounted having gone to Secretary of State Marco Rubio ‘s office and directing that a grandfather clock there be moved to the White House.\n\n“As president, you have the power — if I go into the State Department, or Department of Commerce or Treasury — if I see anything that I like, I’m allowed to take it,” Trump said, drawing laughs. He offered the anecdote despite there not being any record of Trump having paid a public visit to the State Department during Rubio’s tenure.\n\nTrump also pointed out each portrait and shared what he thought of each ex-president depicted. He started by indicating “the great Andrew Jackson ” and went from there — renewing his frequent praise for William McKinley and getting in a dig about how Bill Clinton once offered donors overnight stays in the Lincoln bedroom in exchange for campaign contributions.\n\nHere’s what Trump said about some past presidents:\n\nJames K. Polk (1845-49):\n\n“That’s a gentleman named — and we call him — President Polk. He was sort of a real-estate guy. He was — people don’t realize — he was a one-termer. But he was a very good president. But, and I’m not sure I should be doing this, he actually gave us the state of California.”\n\nThen Trump revealed that his choice of Polk’s picture might have had more do with the portrait’s frame being almost the same size as the frame surrounding Jackson’s portrait, which he suggested was especially aesthetically pleasing: “Polk is actually a very good president who’s got the same frame that I needed, OK.”\n\nDwight D. Eisenhower (1953-61):\n\n“A very underrated president. Built the Interstate (Highway) System. And he was the toughest president, I guess, until we came along. But I don’t mind giving up that crown, because, I don’t want to be too tough on it. But we want to be humane. But he was the toughest president on immigration. He was very strong at the borders. Very, very strong. And, sometimes you can be too strong. He was strong at the borders and, during a certain period of time, there was so strong that almost every farmer in California went bankrupt. And we have to remember that. We have to work together. We have to remember that. But he was a very good president, and a very good general and a very good president and I thought he deserved a position somewhere on this floor.”\n\nFranklin D. Roosevelt (1933-45):\n\n“He was not a Republican, to put it mildly. But he was, you know, a four-termer. He was Franklin Delano Roosevelt. And, if you notice, we have a lot of ramps outside. You have a ramp. People say, ‘It’s an unusual place for a ramp.’ It was because of him. He was wheelchair bound. But he was an amazing man.”\n\nAbraham Lincoln (1861-65):\n\n“Over there is ‘Honest’ Abe Lincoln. And that picture was in his, ugh, in his bedroom. And we thought this would be a very important place because this is where wars are ended. I’m not going to say wars are declared. I’m going to say wars are ended. OK? We’ll be positive. And, that’s the picture of Abe Lincoln from his bedroom, sat in the bedroom for many, many years. That was his favorite picture of himself. And the Lincoln Bedroom’s very famous. You remember when Bill Clinton had it and he rented it out to people. We don’t do that.”\n\nJohn Adams (1797-1801):\n\n“They were the first occupants of the White House. 1800. And John Quincy Adams, Mrs. Adams, they were the first occupants. So we have them looking at each other and, in between their stares is Abraham Lincoln trying to make peace.”\n\n(Trump is correct that John Adams, the nation’s second president, and his wife Abigail, were the first first couple to move into the White House in 1800. But he was mistaken about John Quincy Adams, who was John and Abigail’s son and the sixth president. He served from 1825 to 1829).\n\nWilliam McKinley (1897-1901):\n\n“McKinley was a great president who never got credit. In fact, they changed the name of Mount McKinley and I changed it back because he should have been — the people of Ohio, he was the governor of Ohio — the people of Ohio were very happy when I did that. I heard they were very insulted. They took the name of Mount McKinley off. That was done by Obama a little while ago and I had to change it back. I changed it back. He actually was a great president. He was a president. He was the tariff, the most, I guess since me — I think I’m gonna outdo him — but he was a tariff president. He believed that other countries should pay for the privilege of coming into our country and taking our jobs and taking our treasure. That’s the way he explained it. They took our jobs and they took our treasure. And for that he should pay. And he made them pay. And he built a tremendous fortune.”\n\nWill Weissert covers the White House for The Associated Press.","summary":"Turns out Trump regards his predecessors by how well their portraits fit into the decor.","url":"https://www.bostonherald.com/2025/07/08/trump-presidential-portraits-redecorating/","image":"https://www.bostonherald.com/wp-content/uploads/2025/07/GettyImages-2223549101.jpg?w=1024&h=683","video":null,"publish_date":"2025-07-09 00:04:14","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.064},{"id":339659600,"title":"India News | Union Minister Ashwini Vaishnaw Bereaved; Father Daulal Vaishnaw Dies in Jodhpur","text":"Jodhpur (Rajasthan) [India], July 9 (ANI): Daulal Vaishnaw, father of Union Minister for Railways Ashwini Vaishnaw, passed away at AIIMS Jodhpur on Tuesday. He was 82. He was ill for the past few days and was admitted to AIIMS Jodhpur after his condition deteriorated. Also Read | Nobel Peace Prize 2025: From Mahatma Gandhi to Jawaharlal Nehru, Check Full List of Indians Who Have Won or Been Nominated for the Nobel Peace Prize As Pakistan and Israel Nominate US President Donald Trump for 2025 Award.\nA respected senior advocate by profession, Daulal Vaishnaw hailed from Jeevant Kala village in Rajasthan's Pali district. Known for his simplicity, integrity, and social commitment, he was a revered figure in the legal and social circles of the region.\nAshwini Vaishnaw flew in from Delhi earlier on Tuesday and was able to meet his father before his demise.\nAlso Read | 'Grand Collar of the National Order of the Southern Cross': PM Narendra Modi Accorded Brazil's Highest Civilian Honour by President Luiz Inacio Lula da Silva (Watch Video).\nThe public viewing was held from 3:00 pm.to 4:00 pm at the family residence in Jodhpur, where thousands, including prominent leaders and citizens, gathered to pay their respects.\nThe cremation took place at 5:15 pm at Kaga Swargashram Crematorium, Nagauri Gate, Jodhpur, where a large number of people, including family members were present.\nNotable attendees included Rajasthan Chief Minister Bhajan Lal Sharma, Pali Lok Sabha member PP Chaudhary, senior BJP leader Rajendra Gehlot, former minister Lumba Ram, and Uttar Pradesh Cabinet Minister Kunwar Brajesh Singh among others.\nDau Lal Vaishnaw is survived by two sons - Ashwini Vaishnaw and Anand Vaishnaw - and two daughters.\nA prayer meeting (Uthavana) will be held on July 10, from 4:00 p.m to 6:00 pm at Mahaveer complex, Jodhpur. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  A respected senior advocate by profession, Daulal Vaishnaw hailed from Jeevant Kala village in Rajasthan's Pali district. Known for his simplicity, integrity, and social commitment, he was a revered figure in the legal and social circles of the region.","url":"https://www.latestly.com/agency-news/india-news-union-minister-ashwini-vaishnaw-bereaved-father-daulal-vaishnaw-dies-in-jodhpur-6982352.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250708192026.jpg","video":null,"publish_date":"2025-07-09 00:00:37","author":null,"language":"en","source_country":"in","sentiment":0.112},{"id":339654282,"title":"Georgia Republican Burt Jones Commences 2026 Gubernatorial Campaign with $10 Million Personal Loan","text":"ATLANTA (AP) — Georgia Republican Burt Jones has officially announced his candidacy for the 2026 gubernatorial race, emphasizing his connection with former President Donald Trump and promising to abolish Georgia’s state income tax in a campaign video.\n\n“I face challenges head-on to achieve results, and I will continue this approach as governor,” Jones stated.\n\nBacked by a $10 million loan to his campaign, Jones enters the race alongside Attorney General Chris Carr as leading GOP contenders. Current Governor Brian Kemp is ineligible to run again due to term limits. Other potential Republican candidates might include Secretary of State Brad Raffensperger and U.S. Rep. Marjorie Taylor Greene.\n\nRepublicans are trying to hold onto a governor’s chair that they have won in every election since 2002, even as Georgia has elected two Democratic U.S. senators and has become among the nation’s most competitive states at the presidential level. Democrats seeking to end that dominance include former Atlanta Mayor Keisha Lance Bottoms, state Sen. Jason Esteves and state Rep. Derrick Jackson.\n\nJones was among the first Republicans in Georgia to endorse Trump before the 2016 election. He was one of 16 state Republicans who signed certificates stating that Trump had won Georgia in 2020 and declaring themselves the state’s “duly elected and qualified” electors even though Democrat Joe Biden had been declared the state’s winner. Jones also pushed for a special session in Georgia aimed at overturning Biden’s narrow win in the state. Prosecutors considered filing criminal charges against Jones, but they rejected the move, concluding Jones did not act with criminal intent.\n\nJones touted that peril as proof that he is an authentic supporter of Trump in a speech at the state Republican convention last month in Dalton.\n\n“I’ve been the Trump guy since 2015, not ’16,” Jones said. “I’ve taken all the battle scars and everything else. I know who ran and hid during 2020 and everything else. The circle is small.”\n\nCarr and Raffensperger both have taken fire from Trump over their refusal to back moves to overturn the 2020 election. However, if Greene enters the race, it could scramble the race for Trump’s core voters in the primary.\n\nAs lieutenant governor, Jones has presided over a heavily Republican state Senate that has pursued an aggressive brand of conservative policy that has often been watered down or rejected by the more moderate state House. Democrats say they will make that sharp-edged right-wing agenda an issue in the race.\n\n“Jones’ partisan, disastrous record could not be more out-of-touch with Georgians ” Democratic Governors Association spokesperson Kevin Donohoe said in a statement Tuesday.\n\nBut Jones has also pursued a set of initiatives aimed at children and families that could have more appeal to the broader electorate, including a substantial child tax credit that Kemp signed into law this year.\n\n“What do I call all that we’ve accomplished together? Just a start,” Jones said in the video. “Because our work’s not done yet. And that’s why I’m running for governor.”\n\nJones pledged to “completely eliminate the state income tax,” said he would seek the death penalty for people illegally selling the drug fentanyl, and touted his support for maintaining Georgia’s ban on transgender girls in girls’ sports.\n\nThe 46-year-old Jones is heir to a large petroleum distribution business and founder of an insurance agency. He lives in Jackson, southeast of Atlanta, and served 10 years in the state Senate before winning election as lieutenant governor in 2022.\n\nJones said his leadership committee had $14.3 million in cash on hand, including $10 million that Jones lent himself. A leadership committee is an unusual fundraising vehicle that allows the lieutenant governor, governor and legislative leaders to raise unlimited campaign contributions, even while legislators are meeting.\n\nMost other officials, including Carr, can only raise limited amounts and can’t cash checks during legislative sessions. Carr’s campaign has already signaled it will renew court challenges to leadership committees if Jones tries to spend that cash on the governor’s race.\n\nJones hopes that money, as well as his Trump ties, will help cast him as the front-runner. But although Jones and Carr have differences, they both are making the same appeal, that Georgians should continue electing Republicans to run things.\n\n“We’ve had a great run here in this state, and there’s nothing but opportunity in front of us,” Jones said at the Republican convention. “But we’ve got to keep good leadership.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nATLANTA (AP) — Georgia Republican Burt Jones has officially announced his candidacy&#8230;\n\n\nThis Post: Georgia Republican Burt Jones Commences 2026 Gubernatorial Campaign with $10 Million Personal Loan first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/georgia-republican-burt-jones-commences-2026-gubernatorial-campaign-with-10-million-personal-loan/","image":"https://internewscast.com/wp-content/uploads/2025/07/Georgia-Republican-Burt-Jones-enters-the-2026-governor039s-race-by.jpg","video":null,"publish_date":"2025-07-09 00:00:24","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.316},{"id":339661638,"title":"Jon Stewart reminds “Daily Show” viewers about his WWE days while slamming Trump's big policy bill","text":"Jon Stewart is throwing it back to his smackdown days to make a point.\n\n On Monday's edition of The Daily Show, the comedian reminded viewers of his past WWE arc while lampooning President Donald Trump's so-called \"big, beautiful bill\" in a segment in which he discussed how certain media outlets were framing the passing of the bill as some kind of dramatic showdown.\n\n \"Ooh, it surprisingly got through, like every other f‑‑‑ing thing Trump has wanted, from Qatari jet bribes to Epstein file secrecy to extorted media conglomerate protection money,\" Stewart mocked, adding, \"I can't believe ABC paid that. That was so f‑‑‑ed up. I'll let myself out.\"\n\n Stewart continued, \"Sure, I wouldn't want to be ABC. But every time a new 'Trump's never getting that' comes up, the media is blown away when he actually does get it, without ever acknowledging that the 'no' votes from Republicans are scripted to allow certain senators plausible deniability without putting any part of the agenda actually at risk.\"\n\n The late-night host then added that it all reminded him of \"the way every professional wrestling match gets the announcer slack-jawed with shock at the stunning turn of events.\" At this point, an old clip played of of Stewart's surprise appearance at WWE SummerSlam in 2015.\n\n After re-enacting his onstage pose for the Daily Show audience, Stewart joked of himself, \"Look at old tubs. What a surprise! I can't believe he showed up there, like we rehearsed!\"\n\n Trump signed the bill in question into law Friday. The legislation extends the president's 2017 tax cuts and increases defense and border wall funds, while also including $930 billion in cuts to Medicaid, and other cuts to food assistance, clean energy programs, and student loans.\n\n On The Daily Show, Stewart body-slammed the bill and its passing as a prime example of \"general Washington bulls‑‑‑tery,\" and said its \"central truth\" is the \"bulls‑‑‑ gospel of austerity.\"\n\n \"The gospel they preach anytime the country's finances are in shambles and out of control: Our problem isn't excess at the top, it's the sloths at the bottom,\" Stewart said. \"It is such a f‑‑‑ing lazy and wrong trope.\" \n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n He continued, \"The problem in our country isn't the sliver of able-bodied people that are somehow coasting on the unearned medical coverage they may or may not use, but the millions and millions of people in this country who work f‑‑‑ing full-time jobs and still need food and medical assistance.\n\n \"That's the system that's broken,\" he said to cheers from the audience. \"Fix that system.\"\n\n Watch the video above for more from Stewart.","summary":"Stewart lampooned the passing of the so-called \"big, beautiful bill\" as a prime example of \"general Washington bulls‑‑‑tery.\"","url":"https://ew.com/jon-stewart-reminds-daily-show-viewers-of-his-wwe-days-slams-trump-bill-11768703","image":"https://ew.com/thmb/bzv3xcsXNNluch8OXK2m0QFUVJ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Jon-Stewart-the-daily-show-070825-f89446af0ae947a49fe43b7e0ee37713.jpg","video":null,"publish_date":"2025-07-08 23:59:35","author":"Lauren Huff","authors":["Lauren Huff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.172},{"id":339658114,"title":"What is Israel’s real plan for post-war Gaza?","text":"Israeli Prime Minister Benjamin Netanyahu and US President Donald Trump meet again.\n\nTheir third meeting this year is taking place as ceasefire talks are ongoing in Doha.\n\nWhile the official talks are being held privately, what has openly been discussed are post-war plans for Gaza, which appear to include forcibly displacing Palestinians.\n\nAnd Netanyahu is nominating Trump for the Nobel Peace Prize.\n\nWhat are Israel and the United States hoping to do with Gaza?\n\nHow does this affect a possible ceasefire?\n\nAnd what were Netanyahu’s political ambitions for this visit?\n\nPresenter: James Bays\n\nCurt Mills, executive director at The American Conservative magazine.\n\nYossi Mekelberg, senior consulting fellow at Chatham House.\n\nXavier Abu Eid, political analyst and former adviser to the chief negotiator of the Palestine Liberation Organization.","summary":"Israel&#039;s Netanyahu discusses Gaza ceasefire in third meeting with Trump at the White House this year.","url":"https://www.aljazeera.com/video/inside-story/2025/7/8/what-is-israels-real-plan-for-post-war-gaza?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/07/image-1752010135.jpg?resize=1920%2C1061&quality=80","video":null,"publish_date":"2025-07-08 23:55:33","author":"Apps Support,Inside Story","authors":["Apps Support","Inside Story"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.129},{"id":339661934,"title":"'No Amnesty': US Ag secretary suggests migrant workers can be replaced by adults on Medicaid","text":"Agriculture Secretary Brooke Rollins said on Tuesday during a news conference that there will be \"no amnesty\" for migrants and mass deportations will continue to achieve a \"100% American workforce.\" Rollins cited the number of adults in the Medicaid program, saying there are plenty of workers available in America.\n\n\"When you think about it, there are 34 million able-bodied adults in our Medicaid program. There are plenty of workers in America, but we just have to make sure we are not compromising today, especially in the context of everything we are thinking about right now,\" Rollins said. \"So, no amnesty under any circumstances, mass deportations continue, but in a strategic and intentional way, as we move our workforce towards more automation and towards a 100% American workforce.\"\n\nRollins continued, saying that deportations must be strategic, so the country's food supply is not compromised.\n\n\"At the end of the day, the promise to America to ensure that we have a 100% American workforce stands, but we must be strategic in how we are implementing the mass deportations so as not to compromise our food supply. Ultimately, the answer on this is automation, also some reform within the current governing structure,\" Rollins said.\n\nUSDA has not responded to CNN's follow-up questions.\n\nRollins hosted the news conference at USDA on Tuesday to announce the rollout of the National Farm Security Action Plan. She emphasized that President Donald Trump has also said that there will be no amnesty for migrants.\n\n\"The president has been unequivocal that there will be no amnesty, and that's very, very important. I and the rest of our cabinet certainly support that, effectuate that and make sure that happens every single day,\" Rollins said.\n\nSeveral Cabinet members and government officials, including Attorney General Pam Bondi, Defense Secretary Pete Hegseth and Homeland Security Secretary Kristi Noem, joined Rollins for the announcement.\n\nThe-CNN-Wire & 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.","summary":"The U.S. Secretary of Agriculture is doubling down on mass deportations after declaring Tuesday \"no amnesty\" for migrants.","url":"https://abc30.com/post/no-amnesty-us-farm-secretary-suggests-migrant-workers-can-replaced-adults-medicaid/17024759/","image":"https://cdn.abcotvs.com/dip/images/17024949_070825-kfsn-4p-Ag-Sec-No-Amnesty-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/kfsn/070825-kfsn-4p-Ag-Sec-No-Amnesty-vid.mp4","publish_date":"2025-07-08 23:54:50","author":"Casey Gannon And Molly Reinmann, Cnn,CNNWire","authors":["Casey Gannon And Molly Reinmann, Cnn","CNNWire"],"language":"en","category":"politics","source_country":"US","sentiment":0.373},{"id":339662124,"title":"At Least 161 Remain Missing in Texas County as Search Continues","text":"At least 161 people remained missing in Kerr County, the area hit hardest by devastating floods that swept through Texas’ Hill Country five days ago, Gov. Greg Abbott said on Tuesday, as the slim hopes of finding survivors continued to fade.\n\nThe number of missing cited by the governor — the first time an official had identified the scale of the recovery operation still ahead — suggested the death toll of 111 could more than double as searchers continue to find bodies. Officials in Kerr County acknowledged that no one had been found alive there since Friday.\n\n“The primary job right now continues to be locating everybody who was affected by this flood,” Abbott said at an afternoon news conference, later adding: “We will not stop until we identify, recover every single body.”\n\nQuestions mounted about whether cuts to federal agencies may have contributed to the loss of life. President Donald Trump cautioned against casting blame, while Democrats, including Senate Minority Leader Chuck Schumer, called for an investigation into the administration’s efforts to shrink the National Weather Service.\n\nTexas officials have suggested that forecasts from the weather service last week underestimated the amount of rainfall. Former weather service officials said that the forecasts were as good as could be expected, but that staffing shortages had hampered the ability to coordinate with the local authorities about flash flood warnings.\n\nOfficials in Kerr County, where most of the deaths occurred, said residents had previously resisted the expense of a flood warning system. Lt. Gov. Dan Patrick of Texas called for sirens to be installed by next summer. Sen. Ted Cruz, R-Texas, said there would be a “careful examination of what happened” to limit future deaths from flash flooding.\n\nCruz has himself come under scrutiny because he once again was out of the country when disaster struck his state. As floodwaters of the Guadalupe River rose in Central Texas on Friday, Cruz was in Greece on a family vacation. A spokesperson for the senator, Macarena Martinez, said that he returned to Texas as soon as he could, adding that he was on the ground in Kerrville, one of the areas worst hit, by “early Monday morning.”\n\nPhotographs widely circulated online appeared to show Cruz touring the Parthenon in Athens with his family on Saturday, suggesting that he may have continued some sightseeing as the death toll climbed. The New York Times has not independently authenticated the images, and the senator’s spokesperson declined to comment.\n\nThe episode drew intense criticism on social media, including comparisons to when the senator left the state in 2021 after a winter storm knocked out power for millions of Texans.\n\nIn this case, Martinez said that Cruz continued to work while he was abroad, coordinating with federal and state officials over “to ensure that the maximum federal assets were available for search and rescue.”\n\nSearch teams from across the United States and Mexico continued to arrive Tuesday to relieve exhausted local rescuers. But Texas officials were beginning to acknowledge that the chances of finding anyone alive five days after the deluge were increasingly remote. Search efforts have been hindered by stretches of bad weather, and even by private drones.\n\nOn Monday, a helicopter involved in search efforts in Kerr County was forced to make an emergency landing after crashing into a private drone in restricted airspace, county officials said, in what they called an “entirely preventable” incident.\n\nExpressions of grief and dread grew more intense, along with demands for investigations and accountability. Families still waiting for news of missing relatives “were feeling like they were in darkness,” Archbishop Gustavo García-Siller of San Antonio recounted at a vigil, speaking of his visit to a reunification center.\n\nScattered storms and showers have for days kept Central Texas on edge for fear of further flooding. But the weather service said the threat of severe weather would decrease in south-central parts of the state by Tuesday night, offering some relief for search teams. There were no flood watches in effect for the state on Tuesday, and none seemed likely on Wednesday, forecasters said.\n\nOfficials are watching the weather closely because even small amounts of rain on saturated ground can lead to further flooding. The weather service said storms would pose a particular risk to the flood-prone Hill Country and I-35 corridor, including the Austin and San Antonio metro areas. “It is important to stay vigilant,” its forecasters said.\n\nConditions are expected to improve from midweek.\n\n“We’re expecting drier and slightly warmer conditions Thursday, Friday and Saturday.” said Jason Runyen, a meteorologist at the Austin and San Antonio office of the weather service.\n\nThis article originally appeared in The New York Times.","summary":"At least 161 people remained missing in Kerr County, the area hit hardest by devastating floods that swept through Texas’ Hill Country five days ago, Gov. Greg Abbott said on Tuesday, as the slim hopes of finding survivors continued to…","url":"https://www.berkshireeagle.com/at-least-161-remain-missing-in-texas-county-as-search-continues/article_90d3eb73-246e-4e39-9df6-d9f6be4cb25e.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/assets/v3/editorial/7/bd/7bd815d9-2a6a-415f-89d7-d8b014da4671/686db0275aec4.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-07-08 23:53:00","author":"Blox Content Management,The New York Times","authors":["Blox Content Management","The New York Times"],"language":"en","source_country":"us","sentiment":-0.273},{"id":339653368,"title":"Missing minute in Epstein jail video fuels speculations about his death","text":"The 11-hour surveillance video recorded near Jeffrey Epstein’s jail cell contained a minute-long gap, fueling further speculation about the circumstances surrounding the late financier and registered sex offender’s death.\n\nAccording to the US Department of Justice and the FBI, Epstein committed suicide at a Manhattan correctional facility on August 10, 2019, while awaiting trial on sex trafficking charges. However, some have claimed that Epstein could have been murdered, possibly by wealthy and powerful people he supplied with underage women for sex.\n\nOn Monday, the DOJ and the FBI released a two-page memo on the Epstein affair along with the surveillance footage. The video offered only a partial view of a stairwell leading to Epstein’s confinement in the prison’s Special Housing Unit, rather than the cell itself. The footage abruptly skips from 11:58 p.m. on August 9 to 12:00 a.m. on August 10.\n\nThe review concluded that no “client list” of Epstein’s pedophile ring ever existed and found no evidence of blackmail. There were no grounds to investigate uncharged third parties, the memo stated.\n\nThe findings contradicted previous statements by US Attorney General Pam Bondi, who had claimed that the client list was “sitting on [her] desk,” while the FBI had turned over a “truckload” of materials. She also accused the previous administration of hiding evidence.\n\nDuring a government meeting on Tuesday, Bondi denied that the gap in the security footage was suspicious. She appeared to walk back her earlier remarks about the “client list,” saying she was referring only to some files related to the Epstein case.\n\n“There was a minute that was off the counter, and what we learned from the Bureau of Prisons is every night they redo that video. So every night the video is reset, and every night should have the same minute missing,” Bondi explained.\n\nSeveral popular conservative influencers, including President Donald Trump’s former adviser Steve Bannon, criticized Bondi and federal law enforcement for mishandling the investigation. “We have to take these apparatuses down,” he said.\n\nJournalist Tucker Carlson described the Epstein memo as a “cover-up” after it was released. Podcast host Liz Wheeler and influencers Keith and Kevin Hodge have called on Bondi to be removed from office.\n\n“No one is believing the Epstein coverup, President Trump. This will be part of your legacy. There’s still time to change it,” political commentator Mike Cernovich wrote on X.","summary":"The Jeffrey Epstein jail surveillance video has minute-long gap around midnight \nRead Full Article at RT.com","url":"https://www.rt.com/news/621210-epstein-video-missing-minute/","image":"https://mf.b37mrtl.ru/files/2025.07/article/686d90df85f5407954425197.png","video":null,"publish_date":"2025-07-08 23:52:32","author":null,"language":"en","source_country":"ru","sentiment":-0.578},{"id":339651090,"title":"‘Sex and the City’ star Sarah Jessica Parker reveals why she does not post about politics on social media, hits back at her Conservative haters","text":"APFile photo of actress Sarah Jessica Parker in New York. (Photo by Evan Agostini/Invision/AP)\n\nActress Sarah Jessica Parker has said that she tries to avoid political conversations on social media, arguing that there are better ways to express thoughts on important matters. While appearing on the Monday episode of Nicolle Wallace’s The Best People podcast, the Sex and the City actress defended her decision not to talk about politics on social media, asserting that other major elections took place before apps like Instagram existed and FDR was elected without social media in 1932.Parker further elaborated that she tries to avoid political conversations on social media, as she is not interested in quick little snippets when it comes to dealing with conflict or even elections. During the podcast, she also clapped back at her conservative haters who want her to “shut up and act.”“I often don’t talk on social media because I don’t think it’s a place that’s deserving of any real complicated conversation. I’m not interested in quick little snippets when it’s dealing with conflict or even elections sometimes,” Parker said. “I was so thoughtful about how I wanted to talk about the election because I think it turns into a distraction from the campaign. It turns into fodder. It’s misunderstood. You have no control over it,” The actress said that there are “so many ways to work toward a more civil society.”“Many things happened, right and left, Republicans and Democrats for many, many, many, many years—many generations were elected without someone having to say something on Instagram,” Parker further stated.The And Just Like That star called out “people on the other side” for trying to silence her left-leaning political opinions. She has often spoken vocally about her opposition to US President Donald Trump’s administration and its policies.Live EventsIn October 2024, ahead of the US presidential elections, Parker shared a photo of herself placing a Harris-Walz campaign sign on her New York City window with a list of all the reasons she was “voting for Vice President Kamala Harris and Governor Tim Walz.” “They seem to want everyone who disagrees to shut up,” she said. “It’s the weirdest thing—but not their side. It’s so off-kilter, like who can talk and who can’t? Who’s told to shut up and who isn’t? I’m just a citizen,” the actress added. Parker said that people have urged her to “be vocal” as a public figure, though she has had to find her way to be “comfortable being vocal.”“I’m not going to talk about stuff that I don’t feel educated on. I’m not going to jump in on really complex areas that I feel are deserving of far more thought, consideration, and nuance, which I know no one’s interested in,” she said. “And I just feel like I want to be helpful. I don’t want to hurt something that matters to me.”(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onSarah Jessica Parker political viewsSarah Jessica ParkerDonald TrumpSex and the City actresssocial media political discussions\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onSarah Jessica Parker political viewsSarah Jessica ParkerDonald TrumpSex and the City actresssocial media political discussions(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Sarah Jessica Parker refrains from engaging in political discussions on social media. She believes complex issues deserve more thoughtful platforms. The 'Sex and the City' star recalls previous elections occurred without social media influence. Parker addresses critics who tell her to 'shut up and act'. She emphasizes the importance of informed opinions and constructive dialogue.","url":"https://economictimes.indiatimes.com/news/international/us/sex-and-the-city-star-sarah-jessica-parker-reveals-why-she-does-not-post-about-politics-on-social-media-hits-back-at-her-conservative-haters/articleshow/122329834.cms","image":"https://img.etimg.com/thumb/msid-122329842,width-1200,height-630,imgsize-469498,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-08 23:45:40","author":"Evan Agostini","authors":["Evan Agostini"],"language":"en","category":"politics","source_country":"in","sentiment":-0.104},{"id":339653980,"title":"Ramaphosa opposes Trump’s 30% tariff on South Africa","text":"South Africa's President Cyril Ramaphosa has opposed what he calls the \"unilateral\" higher trade tariffs imposed on his country by the US.\n\nUS President Donald Trump announced on Monday that he would subject imports from South Africa to a new 30% tariff from 1 August.\n\nIt is the only country from sub-Saharan Africa that Trump singled out in his announcement, reflecting his strained relationship with Ramaphosa's government.\n\nIn a letter to Ramaphosa, Trump said South Africa's trade relationship with the US \"has been, unfortunately, far from reciprocal\". In his response, Ramaphosa maintained the 30% tariff \"is not an accurate representation of available trade data\".\n\nTrump's decision is a huge blow to South Africa. The US is its second-biggest trading partner, and South Africa's automobile, farming and textile sectors had duty-free access to the US market under the African Growth and Opportunity Act (Agoa).\n\nSouth Africa's Agriculture Minister John Steenhuisen said that while Trump was not explicit, his announcement suggested the end of Agoa.\n\n\"More than ever, it highlights the need for urgent reform in South Africa so we can ensure our economy meets the requirements of our trading partners around the world,\" Steenhuisen said in parliament.\n\nTrump sent letters to South Africa and 13 other countries, informing them of his latest tariff plans.\n\nThe US president said the rates could be modified \"upward or downward, depending on our relationship with your country\".\n\n\"We have had years to discuss our trading relationship with South Africa, and have concluded that we must move away from these long-term, and very persistent, trade deficits engendered by South Africa's tariff, and non-tariff, policies and trade barriers,\" Trump said in his letter.\n\n\"Starting on August 1, 2025, we will charge South Africa a tariff of only 30% on any and all South African products sent to the United States, separate from all sectoral tariffs,\" he added.\n\nTrump said that if South Africa were to increase its tariffs in response to his announcement, the amount it chooses to raise them by would be added on top of the existing 30%.\n\n\"If you wish to open your heretofore closed trading markets to the United States, and eliminate your tariff and non-tariff policies and trade barriers, we will, perhaps, consider an adjustment to this letter.\"\n\nIn response, Ramaphosa contested the new tariffs, saying the issue was still under consideration by negotiating teams from South Africa and the US.\n\n\"This 30% tariff is based on a particular interpretation of the balance of trade between South Africa and the United States,\" Ramaphosa said in a statement.\n\nHe added that more than half of the goods South Africa imported from the US were not taxed, and the average tariff on the rest was 7.6%\n\nHe said South Africa would continue with its diplomatic efforts to ensure a \"more balanced and mutually beneficial trade relationship\" with the US.\n\nIn April, Trump imposed a 30% tariff on South Africa, as part of his global \"reciprocal\" tariffs, before agreeing to suspend their implementation for 90 days.\n\nHigher tariffs had been set to come into effect on 9 July, having previously been suspended, with White House officials saying they would look to strike trade deals.\n\nWhen asked by a reporter whether the new August date was a hard deadline, Trump said: \"I would say firm, but not 100% firm. If they call up and they say we'd like to do something a different way, we're going to be open to that.\"\n\nSouth Africa and other countries around the continent have been pushing to negotiate trade deals with the US to prevent Trump's sweeping tariffs.\n\nTrump argues that introducing tariffs will protect American businesses from foreign competition and also boost domestic manufacturing and jobs.\n\nUS-South Africa relations hit rock-bottom after Trump took office in January.\n\nThe US president has stopped all aid to South Africa, accusing it of discriminating against the white minority. South Africa has repeatedly denied this.\n\nRamaphosa held talks with Trump in May in a bid to mend relations.\n\nHowever, Trump confronted him with a series of contested claims about the killing of white farmers, and his latest announcement suggests that he is keeping up the pressure on South Africa.","summary":"South Africa's President Cyril Ramaphosa has opposed what he calls the \"unilateral\" higher trade tariffs imposed on his country by the US.","url":"https://www.myjoyonline.com/ramaphosa-opposes-trumps-30-tariff-on-south-africa/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/05/image-1090.png","video":null,"publish_date":"2025-07-08 23:44:08","author":"Abubakar Ibrahim,Bbc 44pm","authors":["Abubakar Ibrahim","Bbc 44pm"],"language":"en","category":"politics","source_country":"gh","sentiment":0.134},{"id":339650712,"title":"Supreme Court allows Trump to proceed with federal job cuts","text":"July 8 (UPI) -- The U.S. Supreme Court on Tuesday allowed the Trump administration to move forward with plans to downsize the federal workforce through layoffs, overturning lower courts' decisions to halt the reductions at 21 agencies.\n\nThe high court allowed the reductions to take place, saying the administration was likely to succeed in a lawsuit brought by a coalition of labor unions and local jurisdictions, including San Francisco, Chicago, Baltimore and Harris County, Texas.\n\nIn February, President Donald Trump signed an executive order to \"significantly\" shrink the federal workforce. The U.S. Office of Management and Budget followed this up day later with a memo ordering the affected federal agencies to submit mass layoff reorganization plans.\n\nIn a three-paragraph opinion, the Supreme Court said Trump and the OMB were likely to succeed on their argument that the orders were lawful. The high court, however, did not rule on the legality of the actual reduction in force.\n\nAssociate Justice Ketanji Brown Jackson was the lone dissenter. She called Trump's order a \"'criminal transformation' of the federal government\" since it doesn't involve authorization from Congress.\n\nTuesday's ruling temporarily paused a decision by the 9th U.S. Circuit Court of Appeals in May which denied a motion by the federal government to stay U.S. District Judge Susan Illston's order to halt the terminations. The appellate court voted 2-1, saying the coalition that brought the lawsuit was likely to win the case on the merits.\n\nThe coalition that brought the lawsuit issued a statement to ABC News saying the Supreme Court's decision \"has dealt a serious blow to our democracy and puts services that the American people rely on in grave jeopardy.\"\n\n\"While we are disappointed in this decision, we will continue to fight on behalf of the communities we represent and argue this case to protect critical public services that we rely on to stay safe and healthy,\" the group said.","summary":"The U.S. Supreme Court on Tuesday allowed the Trump administration to move forward with plans to downsize the federal workforce through layoffs, overturning lower courts' decisions to halt the reductions at 21 agencies.","url":"https://www.upi.com/Top_News/US/2025/07/08/Supreme-Court-federal-job-cuts/8801752013130/","image":"https://cdnph.upi.com/sv/ph/og/upi/8801752013130/2025/1/462fec9be7783856e98c0947fce80549/v1.5/Supreme-Court-allows-Trump-to-proceed-with-federal-job-cuts.jpg","video":null,"publish_date":"2025-07-08 23:43:02","author":"Danielle Haynes","authors":["Danielle Haynes"],"language":"en","category":"politics","source_country":"us","sentiment":-0.082},{"id":339659094,"title":"Colombia looks to turn new page with US after 'coup' allegations - TradingView","text":"Colombia's ambassador to the U.S. returned to Washington on Tuesday, appearing to take a conciliatory tone after a diplomatic tussle over allegations of Republican leaders' involvement in the Latin American nation's domestic affairs.\n\n\"Neither the Secretary of State Marco Rubio, nor the government of the United States, play any role in a coup attempt against the state or an attempt to destabilize the country,\" Colombian Ambassador to the U.S. Daniel Garcia Pena told journalists.\n\nColombian President Gustavo Petro had accused Rubio last month of being involved in a right-wing alliance to topple his leftist administration, without providing evidence.\n\nBoth nations then recalled their top diplomats to the other country for consultations.\n\nPetro appeared to backtrack after his comments, sending a letter to U.S. President Donald Trump on June 23 that was made public by Colombian media on Monday.\n\n\"I recognize that some of my words may have been perceived as unnecessarily harsh,\" Petro wrote. \"It's not my intention to close doors, but to open a path to an honest and respectful conversation between our countries.\"\n\nWhite House Press Secretary Karoline Leavitt said on Monday that she could not confirm whether Trump had read the letter.\n\nThe U.S. charge d'affaires ad interim in Colombia, John McNamara, is set to return to Bogota in the coming hours, Colombian government sources told Reuters.\n\nLast month, newspaper El Pais published a report citing leaked audios alleging that former Foreign Minister Alvaro Leyva had attempted to meet with Rubio to propose removing Petro from office. Leyva was unsuccessful, El Pais reported.\n\n The former official has since left Colombia and is now under investigation.","summary":"Colombia looks to turn new page with US after 'coup' allegations  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3T510Z:0-colombia-looks-to-turn-new-page-with-us-after-coup-allegations/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-07-08 23:40:49","author":null,"language":"en","source_country":"gb","sentiment":-0.468},{"id":339657462,"title":"Trump considers taking over Washington’s government, chides New York","text":"Donald Trump suggested taking similar action in New York, citing his distaste for Zohran Mamdani, the city’s leading mayoral candidate. (EPA Images pic)\nWASHINGTON: US President Donald Trump said on Tuesday his administration was considering taking over governance of Washington, DC, and suggested he could take similar action in New York because of his distaste for the leading candidate for mayor there.\nTrump has made a similar threat regarding Washington before, but has not followed through even as he criticised crime rates and bashed other institutions there.\nThe president, speaking during a cabinet meeting at the White House, said his chief of staff, Susie Wiles, was in close touch with Mayor Muriel Bowser, who favours making the city a US state.\n\"We have tremendous power at the White House to run places when we have to. We could run DC I mean, we're ... looking at DC,\" Trump said. \"Susie Wiles is working very closely with the mayor.\"\nBowser's office declined to comment.\nThe District of Columbia was established in 1790 with land from neighboring Virginia and Maryland. Congress has control of its budget, but voters elect a mayor and city council, thanks to a law known as the Home Rule Act. For Trump to take over the city, Congress likely would have to pass a law revoking that act, which Trump would have to sign.\nBecoming the 51st state would give Washington's roughly 700,000 residents voting representation in Congress. Democrats support that plan, while Republicans, who are reluctant to hand Democrats any politically safe seats in the House of Representatives and Senate, oppose it.\nTrump suggested his administration would run the city better with an appointed leader than the democratically elected government.\n\"We would run it so good, it would be run so proper. We'd get the best person to run it,\" he said. \"The crime would be down to a minimum, would be much less. And you know we're thinking about doing it, to be honest with you.\"\nWhile Trump said his administration had a good relationship with Bowser, he had less complimentary words for Zohran Mamdani, the democratic socialist who won the race to be the Democratic Party's nominee in New York's November mayoral election.\nTrump described Mamdani as a \"disaster.\" A representative for Mamdani did not immediately respond to a Reuters request for comment.\n\"We're going to straighten out New York... Maybe we're going to have to straighten it out from Washington,\" Trump said. \"We're going to do something for New York. I can't tell you what yet, but we're going to make New York great again also.\"","summary":"The US leader claims his administration would manage the city better with an appointed leader than elected officials.","url":"https://www.freemalaysiatoday.com/category/world/2025/07/09/trump-considers-taking-over-washingtons-government-chides-new-york/","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/04/1cfb69b1-donald-trump-epa-images-pic-140425-2.webp","video":null,"publish_date":"2025-07-08 23:38:47","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.066},{"id":339653814,"title":"Todd and Julie Chrisley ‘set the record straight’ on divorce rumors after being pardoned","text":"Beg your pardon?\n\nTodd and Julie Chrisley have addressed the claims that they are splitting up after being freed from federal prison.\n\nThe reality stars “set the record straight” on the surprising divorce rumors during an episode of their daughter Savannah’s “Unlocked” podcast released Tuesday, July 8.\n\n“No. No. Let me set the record straight,” Julie, 52, began. “We are not getting divorced. I actually think that we settled back in fairly easy.”\n\nThe “Chrisley Knows Best” stars were found guilty of federal tax evasion and fraud in June 2022 and sentenced that November. \n\nTheir respective sentences began in January 2023, and Julie served 28 months of her seven-year sentence at Kentucky’s FMC Lexington federal prison. Todd served the same amount of time after being sentenced to 12 years at Florida’s FPC Pensacola.\n\nThey were both released on May 28 following pardons from President Donald Trump.\n\n“In my mind, I was never away from her,” Todd, 56, said regarding his federal prison stint. “I would tell her in the emails every day, I said, ‘I’m with you every step you take.’ And I’d say, ‘And feel my love surrounding you at all times.’”\n\n“So when I went to bed at night, she was right there with me,” he continued. “When I woke up and I did my prayers, she was right there with me. And that’s how I survived it.”\n\nJulie, who married Todd in 1996, agreed.\n\n“I don’t think there was ever anything in my mind that we were separate or that we were ever going to be separate,” she explained. “And so I think it allowed us to really just come back together.”\n\nAfter dispelling the divorce rumors, the “Chrisley Knows Best” stars detailed their first night back home together after being released.\n\nTodd said that he was “grateful” to reunite with his wife of almost 30 years, and he even teased their bedtime “routine.”\n\n“The first night together, I was so grateful to just be able to get in the bed with her,” he recalled. “And I think you said it best, there was no awkwardness. There was no, like, what are we supposed to be doing? Was none of that.”\n\n“I mean, we got back in our routine. I mean, she got on top,” Todd joked, although Julie quickly called her husband a “liar” and asked Savannah, 27, to cut that part of the podcast out.\n\nThe Chrisley couple previously opened up about their time behind bars during another episode of their daughter’s podcast last week.\n\nTodd revealed that his “sole intent” while in prison was to make the employees miserable.\n\n“I was surrounded by miserable human beings,” he reflected. “Every day, I got up and it was my sole intent to make their life even more miserable because they were there to make our lives miserable.”\n\nHe also admitted that he “cried” himself to sleep the first night at the federal facility.\n\n“I was angry at God,” he said during an ABC News special that premiered June 29. “And when I went to bed that night and the lights went out, I cried myself to sleep and I said, ‘God, why are you allowing this?’”\n\nAs for Julie, she also opened up about her life behind bars and what she missed the most while serving out her sentence.\n\n“My children and my husband, you know, I missed birthdays and holidays and graduations and things that I can never get back,” she said during “The Chrisleys: Life After Lockup” special. \n\n“So now I just have to focus on what’s ahead of us,” Julie concluded.","summary":"Todd and Julie Chrisley are putting the rumors to bed once and for all.","url":"https://nypost.com/2025/07/08/entertainment/todd-and-julie-chrisley-set-the-record-straight-on-divorce-rumors/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/107840917.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Xlvrk7Yf-RyIcpnTz.mp4","publish_date":"2025-07-08 23:35:43","author":"Connor Surmonte","authors":["Connor Surmonte"],"language":"en","source_country":"zm","sentiment":-0.447},{"id":339653804,"title":"Yay for Trump for resuming weapons deliveries to Kyiv — but who exactly stopped them?","text":"President Donald Trump is resuming shipments of defensive weapons to Ukraine, just days after the Pentagon paused them. Smart move.\n\nTrump was “very disappointed” with Russia’s chief thugocrat, Vladimir Putin, after their call last week: “It just seems like he wants to . . . keep killing people.” \n\nIndeed, Putin on Friday followed the call by launching his largest drone and missile strike on Ukraine yet.\n\nTuesday, Trump went further: “We get a lot of bulls— thrown at us by Putin.” Vlad’s gestures toward peace always turn out “to be meaningless.” Indeed.\n\nYet that raises troubling questions:\n\n Why halt weapons shipments in the first place?\n\nDid Defense Undersecretary Elbridge Colby (who reportedly made the decision) go rogue — implementing policy without Trump’s knowledge?\n\nIf so, how could that happen? Some at the White House plainly knew — when did the commander-in-chief get looped in?\n\nOK: In pursuit of a cease-fire, Trump has bent over backward to avoid provoking the Kremlin. \n\nHe let sanctions erode, spared Russia from tariffs, held his tongue on Putin’s atrocities and rapped Ukranian President Volodymyr Zelensky.\n\nHe spent months indulging Putin in talks that were never going to lead to a true cease-fire.\n\nYet Trump knows carrots aren’t always enough. \n\nEvery morning, the NY POSTcast offers a deep dive into the headlines with the Post’s signature mix of politics, business, pop culture, true crime and everything in between. Subscribe here!\n\nHe offered Iran peace and prosperity if it ditched its nukes, while warning of major consequences if it didn’t.\n\nTehran didn’t, and it paid a price.\n\nPutin won’t quit either, unless forced to. \n\nAnd that means arming Ukraine — not just with defensive weapons, but ones that can inflict enough damage to make Putin want a deal.\n\nTougher sanctions can also help. \n\nA bipartisan bill in Congress would slap broad new restrictions on Russian trade, including a 500% tariff on any nation that buys Russian energy.\n\nThat would make a big difference, and three-quarters of Trump voters back tougher sanctions.\n\nOn Monday, Israeli Prime Minister Benjamin Netanyahu joined a growing list of leaders who’ve nominated Trump for a Nobel Prize.\n\nIf the prize committee cares at all about merit, Trump’s peace deals — between the Congo and Rwanda, India and Pakistan, Iran and Israel, plus the Abraham Accords — and his stripping Tehran of nukes make him a, maybe the, top contender.\n\nBut if he produces a stop to the Russia-Ukraine carnage on top of all that, even the retired Norwegian politicians who award the prize will be hard-pressed to deny he deserves it.\n\nOf course, Trump cares a lot more for the peace than the prize — but either way, arming Kyiv and squeezing Putin is the only way to make it happen.","summary":"After Vladimir Putin’s snubs, President Donald Trump is resuming shipments of defensive weapons to Ukraine, days after the Pentagon paused them.","url":"https://nypost.com/2025/07/08/opinion/yay-for-trump-for-resuming-weapons-deliveries-to-kyiv-but-why-stop-them-at-all/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/DJCBJ8.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/rjsRy7Z8-RyIcpnTz.mp4","publish_date":"2025-07-08 23:33:14","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.084},{"id":339654094,"title":"Trump administration is developing a plan to keep migrant farm workers in US","text":"Donald Trump stated there would be no “amnesty” program for migrant farm workers, despite previously indicating he might defer to farmers on the issue. \n\nThe president clarified that his administration is developing a “work program” or “temporary pass” to allow some undocumented migrants to remain in the U.S. to work on farms. \n\nFarmers have voiced concerns that immigration raids are causing significant labor shortages, with one California farmer reporting 70 percent of her workforce gone. \n\nFigures from the Department of Homeland Security show that roughly 42 percent of farm workers lacked legal status between 2020 and 2022. \n\nAgriculture Secretary Brooke Rollins and Labor Secretary Lori Chavez-DeRemer reiterated that no amnesty would be granted, but efforts are underway to address farmers' labor needs.","summary":"","url":"https://www.independent.co.uk/bulletin/news/trump-farm-workers-amnesty-plan-b2785222.html","image":"https://static.independent.co.uk/2025/06/14/17/39/GettyImages-2211332329.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/W3ILQgLc-OhrQWqOm.mp4","publish_date":"2025-07-08 23:32:33","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.184},{"id":339661106,"title":"‘Seismic’ Medicaid changes will be rough on rural hospitals","text":"For months, rural medical providers nervously waited for Congress to finalize President Donald Trump’s “big beautiful” budget bill, which would cut at least $1 trillion from Medicaid, a government program that is a critical source of funding. \n\nNow that the mega bill has been signed into law, rural medical administrators are scrambling to determine how hard they will be hit. \n\nFor rural hospitals already operating on tiny margins, looming Medicaid cuts will dial up the financial pressures they’re feeling even more, said Jean MacDonell, president and CEO of Fairview Range hospital in Hibbing, identified as one of the most vulnerable in the state.\n\nLike all rural hospitals, Medicaid, a joint federal-state health program for the poor, is a key source of funding at Fairview Range. When patients lose Medicaid — projected to occur to at least 150,000 Minnesotans as a result of Trump’s budget plan, which would also make permanent a package of tax cuts — the care provided to them at hospitals and clinics is more likely to go uncompensated.\n\n“I have heard some say, ‘I don’t have Medicaid so this isn’t going to impact me,’” MacDonell said. “We’re trying to educate the communities to the fact that just because you don’t have Medicaid, we’re all going to be impacted by this.”\n\nFairview Range receives up to 25% of its revenue from Medicaid, placing it among the top medical facilities in the state when it comes to dependence on the program. \n\nHealth care leaders have long said Medicaid reimbursements aren’t keeping up with rising costs. Yet instead of getting higher reimbursements rates, facilities are now preparing to take a net hit on Medicaid payments. Many of these facilities, according to state hospital financial data, already aren’t bringing in enough revenue to offset expenses.\n\nThe Center for Healthcare Quality and Payment Reform offered a bleak landscape for rural hospitals in an analysis of their financial situation released before the budget bill was approved by Congress and signed into law by Trump last week.\n\nIt determined that at least nine rural hospitals in Minnesota were at immediate risk of closing.\n\nEven before the new cuts to Medicaid take effect, a community hospital in rural Nebraska announced it was closing because of “anticipated budget cuts” due to the budget bill.\n\nThe budget bill would cut Medicaid in several ways. It would impose new reporting and work requirements on beneficiaries that are aimed at eliminating even those who qualify from the rolls. It also puts restrictions on a mechanism known as the provider tax that states use to leverage more Medicaid funding from the federal government. \n\nThe Hibbing facility was one of two in Minnesota to be labeled at risk by four U.S. Democratic senators who opposed the budget plan. The Mayo Clinic Health System in Fairmont was the second. It did not respond to requests for information.\n\n‘Seismic changes’ for rural hospitals\n\nMark Jones, executive director of the Minnesota Rural Health Care Association, said it’s more expensive to provide medical care in rural areas than in the state’s suburbs and large cities and towns.\n\n“It’s mainly an economy of scale,” Jones said. “We don’t have the volume.”\n\nJones said rural hospitals and clinics “are not always busy,” so their profit margins are slim. He also said that at least 9% of rural facilities are operating on negative margins “and there’s little opportunity to turn that around.”\n\nWith negative profit margins, and prospects of losing more money, hospitals will have to look at the services they are providing, and possibly cut some types of services and care, Jones said. \n\nA unique challenge for Hibbing’s hospital is its inpatient behavioral health unit. These beds are precious commodities around the state, and MacDonell said they’re also the primary reason for Hibbing serving a higher percentage of Medicaid patients than Grand Itasca hospital in Grand Rapids, a sister facility about 35 miles to the west.\n\nPatients mostly come in from the surrounding 100-mile radius, although coming from further out isn’t uncommon due to mental health bed shortages. Losing this unit, along with any other services currently in place, would create more strain on a stressed system. Other facilities would need to pick up the slack. Patients would need to travel farther away from home for care. \n\nMental health providers outside hospital and clinic settings couldn’t fill in gaps if they’re also feeling the crunch of Medicaid cuts. Shannon Brown, CEO of Fernbrook Family Center in southern Minnesota, brought this up during a press call last week on the far-reaching effects of Medicaid cuts. \n\nAbout 75% of Fernbrook’s clients use Medicaid as primary or secondary insurance coverage, Brown said. Many of them don’t have a therapist within 30 miles of them.\n\n“If we did not go to them they would not receive care,” Brown said.\n\nMacDonell sees the Hibbing and Grand Rapids hospitals as safety nets, because without them patients don’t have many other nearby options. More traditional safety net providers, officially known as federally qualified health centers (FQHC), are in place to serve underinsured or uninsured patients. They’re also feeling anxious about Medicaid cuts.\n\nFQHCs provide care in exchange for sliding fees based on the patient’s ability to pay. Minnesota has 17 facilities like this in both urban and rural communities, with about half of their patients enrolled in Medicaid.\n\nBy no stretch of the imagination will the new federal budget help, said Jonathan Watson, CEO of the Minnesota Association of Community Health Centers.“This will be one of the most seismic changes in the history of Medicaid, where things are taken away from folks,” he said. “This is somewhat uncharted territory.” \n\nClosing certain sites or reducing services would be considered if the hit to revenue is as bad as it seems. Watson was initially hopeful about a last minute provision inserted in the act because of concerns from GOP senators about the impact Medicaid cuts would have on rural health facilities.\n\nThis $50 billion provision, known as the Rural Health Transformation Program, was aimed at defraying the costs to rural hospitals of the increase in uncompensated care that the Medicaid cuts will usher in, especially after work requirements are imposed in December of 2026. \n\nBut Watson is less optimistic after seeing what Congress ultimately approved. So is Jones, who said “it is helpful, but we don’t know how the money will be distributed.”\n\nOthers say the $50 billion is not enough to cover the impact of a loss of Medicaid patients and the growth of uninsured patients.\n\nApart from the negative impact on patients, losing a hospital as a result of Medicaid cuts would have a devastating economic impact on a community. Fairview Range is Hibbing’s biggest employer. The same is true for Grand Itasca in Grand Rapids, MacDonell said. Health care is the state’s largest employment sector overall.\n\n“In rural areas, places that prosper have medical facilities and schools,” said Louis Johnston, an economics professor at the College of St. Benedict and St. John’s University.\n\nJohnston said states like Minnesota might have to bail out rural medical systems, and raise taxes to do so. \n\nMacDonell expects the ramifications of the bill to start hitting hospitals in late 2026, when the work requirements kick in.\n\nBetween now and then she’s in communication with other hospital leaders to prepare. She wants patients to know the hospitals are still there for them, while also making sure they and policymakers know how challenging the immediate future will be. \n\n“We’re trying to balance raising concerns about the changes that are coming,” she said. “We don’t want patients to have to drive further to get care.”","summary":"Threats of losses of services and even hospital closures loom after Trump signs ‘big, beautiful’ budget bill into law. \n\n\nThe post ‘Seismic’ Medicaid changes will be rough on rural hospitals appeared first on MinnPost.","url":"https://www.minnpost.com/greater-minnesota/2025/07/seismic-medicaid-changes-will-be-rough-on-rural-hospitals/","image":"https://www.minnpost.com/wp-content/uploads/2025/07/Hibbing-hospital.webp","video":null,"publish_date":"2025-07-08 23:32:09","author":"Brian Arola and Ana Radelat","authors":["Brian Arola and Ana Radelat"],"language":"en","source_country":"us","sentiment":-0.278},{"id":339657458,"title":"More than 160 people still missing days after deadly Texas floods","text":"Campers’ belongings sit outside a Camp Mystic cabin near the Guadalupe River after a flash flood killed 27 girls and counselors. (AP pic)\nHUNT: More than 160 people remain unaccounted for after devastating floods in Texas, the state governor said Tuesday, marking a dramatic increase in the number of missing from a tragedy that has so far claimed 109 lives.\nFour days after flash floods roared through several Texas counties, some in the middle of the night, hopes of finding survivors were fading - and Governor Greg Abbott warned that the list of those unaccounted for could yet rise as the grim search continues.\n\"Just in the Kerr County area alone, there are 161 people who are known to be missing,\" he told reporters.\n\"There very likely could be more added to that list,\" he said, adding that the figure was based on people reported as unaccounted for by friends, relatives and neighbors.\nKerr County, part of a central Texas region known as \"Flash Flood Alley,\" suffered the most damage, with at least 94 fatalities.\nThat includes at least 27 girls and counselors who were staying at a youth summer camp on the Guadalupe River when it burst its banks as the Fourth of July holiday began in the early hours of Friday.\nTorrents of water swept through the camp, scouring cabins as hundreds of people slept.\nFive campers and one counselor were still missing as of Tuesday evening, according to Abbot, as well as another child not associated with the camp.\n\"There's nothing more important in our hearts and minds than the people of this community, especially those who are still lost,\" Abbot said.\nElsewhere in the state, there have been at least 15 fatalities recorded so far, the governor added.\nBen Baker with the Texas Game Wardens said search and rescue efforts involving helicopters, drones and dogs were extremely difficult because of the water and mud.\n\"When we're trying to make these recoveries, these large piles can be very obstructive, and to get in deep into these piles, it's very hazardous,\" Baker said.\n\"It's extremely treacherous, time-consuming. It's dirty work, the water is still there.\"\nRain 'won't deter' search\nIn the town of Hunt, the epicenter of the disaster, an AFP team saw recovery workers combing through piles of debris with helicopters flying overhead.\nJavier Torres, 24, was digging through mud as he searched for the body of his grandmother, after having located the remains of his grandfather.\nHe also discovered the bodies of two children, apparently washed up by the river.\nOfficials warned of more heavy rain ahead that could affect the search - though Baker said it \"won't deter\" the efforts.\nPresident Donald Trump is due to travel to Texas with First Lady Melania Trump on Friday, and credited his strong ties with Abbott, a Republican, as having helped the rescue effort.\n\"We brought in a lot of helicopters from all over... They were real pros, and they were responsible for pulling out a lot of people. And we got them there fast, and Texas had some good ones too, but the response has been incredible,\" Trump said.\nMeanwhile, questions intensified over whether Trump's government funding cuts had weakened warning systems, and over the handling of the rescue operation.\nDuring an at-times tense news conference, Baker skirted a question on the speed of the emergency response.\n\"Right now, this team up here is focused on bringing people home,\" he said.\nShel Winkley, a weather expert at the Climate Central research group, blamed the extent of the disaster on geography and exceptional drought, when dry soil absorbs less rainfall.\n\"This part of Texas, at least in the Kerr County flood specifically, was in an extreme to exceptional drought... We know that since May, temperatures have been above average,\" Winkley told reporters.\nThe organisation's media director, Tom Di Liberto, said staffing shortages at the National Weather Service had contributed to the disaster.\n\"You can't necessarily replace that experience,\" he said.","summary":"Hopes of finding survivors fade as officials warn the number of missing could rise while the grim search continues.","url":"https://www.freemalaysiatoday.com/category/world/2025/07/09/more-than-160-people-still-missing-days-after-deadly-texas-floods/","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/7a36a82f-texas-floods.jpg","video":null,"publish_date":"2025-07-08 23:29:15","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":-0.227},{"id":339654666,"title":"Zohran Mamdani’s DSA sponsors protest with ‘death, death to the IDF!’ war cry","text":"WASHINGTON, D.C. — Here on the corner of 16th Street NW and H Street NW, just steps from the White House, across Lafayette Park, a war cry rippled out among a swarm of demonstrators against Israel’s military, the Israel Defense Forces. \"Death, death to the IDF, the IDF, the IDF! Death, death to the IDF!\" they chanted. They denounced Israeli Prime Minister Benjamin Netanyahu, who was meeting with President Donald Trump, as a possible ceasefire between Israel and Hamas loomed. ASRA NOMANI: IRAN’S IDEOLOGICAL FOOT SOLDIERS WAGE PROXY WAR IN AMERICA Last week, British punk rapper Bobby Vylan shouted the incendiary slogan at the Glastonbury Festival, leading Secretary of State Marco Rubio to bar him from entering the U.S. Yet, his words have now crossed borders, absorbed into the militant propaganda of anti-Israel activists, including groups aligned with Hamas. The rallying cry has become the newest chant for a radical protest network spanning ideologies and continents. And despite demanding a ceasefire for months, their messaging on Monday night made one thing clear: they aren’t satisfied with a ceasefire. They want the end of the state of Israel. According to new analysis from the Pearl Project, a nonprofit journalism initiative that is tracking the professional protest industry in a comprehensive public database, a coalition of 40 organizations – with combined annual revenues of $19.2 million – organized the \"Noise Out\" protests this week against Israel, with the call for \"Death, death to the IDF.\" In this network, 25 organizations — or about two of three — are self-described socialist, Marxist, Leninist, communist, or socialist-adjacent. Another 15 groups — or about one of three — are Muslim or Arab organizations. It’s an intersectional convergence of extremist ideologies — Marxist, Islamist, and radical anti-Americanism — masquerading as \"social justice.\" As the crowd chanted against the IDF, local artist Rafikki Morris, a leader in the All-African People's Revolutionary Party — which seeks to create an \"all-African socialist government\" — turned toward the noise and smiled. \"Death, death to the IDF!\" Morris responded to the protestors who started the chant. \"They’re reading my mind, you know.\" The crowd cheered. A protestor with his face covered in a black-and-white keffiyeh held a sign high -- \"DEATH, DEATH TO THE 🔻 IDF 🔻\" – punctuated with two inverted red triangles — a symbol used by Al-Qassam Brigades, Hamas's military wing, to identify Israeli military targets. (The sign added the words: \"Jews for Intifada.\") One man wore the Hamas red triangle on his shirt. Another carried a sign: \"RESISTANCE🔻IS 🔻JUSTIFIED.\" Hours later, the Israeli military announced Hamas fighters killed at least six IDF soldiers in an ambush near the town of Beit Hanoun, in northern Gaza. The self-declared Marxist, socialist, or communist organizations involved in the protest include: The Muslim organizations involved in the protest include: The involvement of the Democratic Socialists of America is particularly important politically. With Mamdani’s win as the Democratic candidate for mayor of New York City, the Democratic Socialists of America are poised to shape the political future of America’s largest city, as it aligns with a movement that supports Hamas, the Muslim Brotherhood, revolutionary Marxism and chants of \"Death, death to the IDF.\" In front of Lafayette Park, Morris led chants of \"Smash Zionism! Smash Zionism!\" Earlier, a local leader of Jewish Voice for Peace — a protest co-organizer also opposed to the existence of Israel — explained that Zionism is simply the belief that Jews should have a homeland. \"I’m thinking maybe we’ve reached the point where we need to be doing something we wouldn’t normally do,\" Morris added cryptically. The crowd interpreted it as a call for violence — and cheered. A white-haired man in a \"STOP THE GENOCIDE\" T-shirt pushed back: \"Violence doesn’t work either!\" Morris snapped: \"We will not stand idly by as violence is perpetuated against us!\" Nearby, demonstrators pounded pots and pans and hurled shoes at a large cutout of Netanyahu. \"Oh my gosh, he deserves so much more,\" said a man who identified himself only as Mohammad, after spitting on the cardboard portrait. Another protester waved an oversized key — a symbol of the network’s demand for a \"right of return,\" which would allow millions of Palestinians and their descendants worldwide to move into Israel. If implemented, this demand would drastically alter Israel’s demographic makeup. Today, about seven million Jews and two million Arab citizens live in Israel. But an estimated 15 million Palestinians worldwide, including those in Gaza and the West Bank, claim the right to return. Granting this would make Jews a minority and effectively erase Israel’s identity as a Jewish state — a goal openly promoted by this protest movement. Underscoring this demand, the crowd chanted in Arabic, \"Palestine is Arab! Palestine is Arab!\" Behind the protest signs and slogans lies a broader political campaign powered by malign foreign influence — propaganda, funding, and messaging rooted in authoritarian regimes and global networks that seek to destabilize America from within. U.S. lawmakers are now investigating three of the protest’s organizing groups — CodePink, the ANSWER Coalition, and the Party for Socialism and Liberation — for alleged financial ties to American tech mogul Neville Roy Singham, profiled by the New York Times for funding a \"global web of Chinese propaganda.\" CodePink, a 501(c)(3) nonprofit with $1.2 million in annual revenues, denies receiving Chinese Communist Party money, but its cofounder, Medea Benjamin, refused to answer my questions about how much she allegedly receives from Singham. Earlier in the day, officials from the Council on American-Islamic Relations stood at Lafayette Park, shoulder-to-shoulder with CodePink and a wider coalition of anti-Israel Muslim organizations, demanding the U.S. end its support for Israel and furthering their claim of the nation for Palestinians. Online, their messaging is polished. On the streets, the mask comes off. One regular Palestinian American anti-Israel activist, Haitham Arafat, stormed at an international tourist inadvertently riding a scooter through the protest, shouting at her repeatedly: \"Get the f— out of here!\" He didn’t return a request for comment. The night before, at a precursor event to the main Monday night protest, a man, who refused to give his name, led the crowd in chants: \"There is only one solution! Globalize the revolution!\" He continued: \"From D.C. to the Philippines, stop the U.S. war machine.\" As I reported on the protest, Michael Beer, director of Non-Violence International, a D.C.-based 501(c)(3) nonprofit with $3 million in annual revenues, blared his megaphone into my ears, while others shoved a Palestinian flag in my face and also shouted in my face. Meanwhile, the crowd chanted: \"It is right to rebel! Israel, Israel, go to hell!\" By Monday night, the full network was activated. Benjamin, the CodePink cofounder, appeared like a field marshal entering the fray — petite, stringy blond hair, ballet flats. She hugged a journalist with a Pacifica Radio press pass, while her partner, Tighe Barry, posed in a Netanyahu mask and prison uniform. Collectively, these groups are not just agitating against Netanyahu. They are part of a long-term effort to mainstream Islamist political narratives in American discourse. Zuhdi Jasser, cofounder of the Clarity Coalition, a group fighting political Islam, or Islamism, summarized the danger clearly: \"What we’re seeing in these protests isn’t just street theater — it’s a warning. Zohran Mamdani’s Democratic Socialists of America is part of a movement that’s teaming up with radical mosques like Dar Al-Hijrah — the same mosque where 9/11 hijackers prayed.\" \"His Democratic Socialists of America are marching side-by-side with Islamists and communists who hate everything America stands for. This isn’t about justice. It’s about power.\" During the protest, comrades in the Party for Socialism and Liberation passed out flyers with the headlined, \"WE NEED A NEW SYSTEM.\" Another friendly local comrade from the Progressive Labor Party handed out a write-up on its work with Democratic Party organizations in the recent #NoKings actions, protesting Trump. And she handed out copies of \"Challenge,\" the \"Revolutionary Communist Newspaper\" of the party, with a call-to-action: \"Join the International Fight for Communist Revolution.\" The radicalism of the Marxist ideology on the left is matched by on the Islamist flank. Among the most concerning participants is Dar Al-Hijrah Islamic Center, widely known in counterterrorism circles as the \"9/11 mosque,\" practicing an interpretation of Islam aligned with the Muslim Brotherhood, a political organization that seeks to establish a global caliphate. One imam, Shaker Elsayed, even publicly supported female genital mutilation. When I asked Benjamin about the mosque leader’s position on female genital mutilation, she paused and said: \"I don’t know anything about this.\" It was widely covered by the media. When I asked her about how much the tech millionaire Singham gives CodePink, she refused to answer, saying, \"Can we talk about genocide, which is what we’re here to talk about?\" In 2001, 9/11 hijackers prayed at Dar Al-Hijrah before launching their attacks on America, and a young imam, or prayer leader, Anwar al-Awlaki preached there, before decamping to Yemen and becoming a top propagandist and recruiter for al-Qaeda. His sermons radicalized a generation of extremists, some of whom later joined the Islamic State. CLICK HERE FOR MORE FOX NEWS OPINION The contradictions within this network are startling. A protest leader, Red Canary Song, describes itself as a grassroots collective of Asian and migrant sex workers, advocating for the full decriminalization of \"sex workers.\" Since 2021, Iranian-American eBay founder Pierre Omidyar and his wife Pam have funneled at least $400,000 to the group through Democracy Fund Inc. Red Canary Song is allied on the same protest flier as Muslim American Society and Dar Al-Hijrah, whose leaders preach strict religious codes for women. After last year’s protests, Netanyau quipped in an address to the U.S. Congress: \"Some of these protesters hold up signs proclaiming 'Gays for Gaza.’ They might as well hold up signs saying 'Chickens for KFC.’\" CLICK HERE TO GET THE FOX NEWS APP That day, the protests in D.C. against Netanyahu ended with vandalism at the Columbus Memorial at Union Station, where a leader from American Muslims for Palestine painted \"HAMAS IS COMIN\" in blood-red letters. A member of the Party for Socialism and Liberation stole an American flag from the flagpole and burned it to ashes. The FBI arrested both men last year for destruction of property. Both are now free, able to circulate again in protests like the one this week in front of the White House, where the new war cry echoed on a loudspeaker, as demonstrators twirled in dance: \"Death, death to the IDF.\"","summary":"A network of 40 organizations with Marxist and Islamist ideologies protest Israel in D.C., chanting militant slogans amid ceasefire talks between Israel and Hamas.","url":"https://www.foxnews.com/opinion/zohran-mamdanis-dsa-sponsors-protest-death-death-idf-war-cry","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/c7db4a50-gettyimages-2222359289-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-08 23:22:18","author":"Asra Nomani","authors":["Asra Nomani"],"language":"en","source_country":"us","sentiment":0.367},{"id":339659086,"title":"Trump says at least seven trade-related announcements coming Wednesday morning - TradingView","text":"U.S. President Donald Trump said on Tuesday that he will announce something trade-related with at least seven countries on Wednesday morning, while additional countries will be named in the afternoon.\n\n\"We will be releasing a minimum of 7 Countries having to do with trade, tomorrow morning, with an additional number of Countries being released in the afternoon,\" Trump said on Truth Social, without specifying whether he would be announcing trade deals or tariff letters.","summary":"Trump says at least seven trade-related announcements coming Wednesday morning  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3T50LB:0-trump-says-at-least-seven-trade-related-announcements-coming-wednesday-morning/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-07-08 23:21:51","author":null,"language":"en","source_country":"gb","sentiment":0.11},{"id":339654642,"title":"White House waives executive privilege for Biden doctor Kevin O'Connor in cover-up probe","text":"FIRST ON FOX: President Donald Trump's White House is waiving executive privilege for a key member of former President Joe Biden's inner circle, Fox News Digital has learned. Former White House physician Kevin O'Connor was set to testify this week in House Oversight Committee Chairman James Comer's probe into allegations that Biden's senior aides covered up his mental and physical decline while president. \"In light of the unique and extraordinary nature of the matters under investigation, President Trump has determined that an assertion of executive privilege is not in the national interest, and therefore is not justified, with respect to particular subjects within the purview of the House Oversight Committee,\" a letter to O'Connor sent by the White House, obtained by Fox News Digital by a source familiar, said. \"These subjects include your assessment of former President Biden’s fitness for the office of the president and your financial relationship with the Biden family.\" BIDEN AIDES PUSHED FOR EARLY DEBATE TO SHOW OFF BIDEN'S ‘STRENGTH,’ EXPOSE TRUMP'S ‘WEAKNESS,’ BOOK SAYS When reached for comment, an attorney for O'Connor confirmed receipt of the letter from the White House Counsel's Office. Comer subpoenaed O'Connor last week after the physician refused to appear voluntarily for a transcribed interview with House investigators. O'Connor's lawyers petitioned for a delay over the weekend, however, calling the scope of the probe \"unprecedented.\" \"We are unaware of any prior occasion on which a Congressional Committee has subpoenaed a physician to testify about the treatment of an individual patient,\" O'Connor's legal team wrote. \"And the notion that a Congressional Committee would do so without any regard whatsoever for the confidentiality of the physician-patient relationship is alarming.\" A House Oversight Committee spokeswoman called their letter a \"delay tactic to stonewall the Oversight Committee's investigation.\" The deposition date has not been changed, and O'Connor could risk defying a congressional subpoena if he does not appear. The Tuesday letter from the White House counsel's office read, \"The extraordinary events in this matter constitute exceptional circumstances warranting an accommodation to Congress. Evidence that aides to former President Biden concealed information regarding his fitness to exercise the powers of the President — and may have unconstitutionally exercised those powers themselves to aid in their concealment — implicates both Congress’ constitutional and legislative powers.\" EX-DNC INSIDER REVEALS 'PUPPET MASTERS' WHO RAN THE BIDEN WHITE HOUSE \"After balancing the Legislative and Executive Branch interests, as required under the accommodation process, it is the President’s view that this presents and exceptional situation in which the congressional need for information outweighs the Executive Branch’s interest in maintaining confidentiality, especially given the Executive Branch’s own interest in determining the validity of prior executive actions,\" the letter said. CLICK HERE TO GET THE FOX NEWS APP Former top Biden aides and the ex-president's current allies have insisted there was no cover-up in the Democratic White House. But Biden's disastrous June 2024 debate performance followed by his stunning exit from the presidential race raised questions about the octogenarian's fitness for office. Comer has summoned a number of former top Biden aides for closed-door interviews, including O'Connor, former Chief of Staff Ronald Klain, and former White House Press Secretary Karine Jean-Pierre. Former staff secretary Neera Tanden appeared for a transcribed interview last month.","summary":"The House Oversight Committee is investigating allegations that former President Joe Biden&apos;s senior aides covered up his mental and physical decline, including his physician.","url":"https://www.foxnews.com/politics/white-house-waives-executive-privilege-biden-doctor-kevin-oconnor-cover-up-probe","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/d419b400-President-Biden.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-08 23:19:53","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","source_country":"us","sentiment":-0.072},{"id":339649414,"title":"Marco Rubio rang foreign ministers – but it wasn’t really him. It was an AI imposter","text":"The Washington Post first reported the attempt. The episode comes weeks after the administration faced a crisis when President Donald Trump’s former national security adviser Mike Waltz created a group chat on Signal in which a journalist was accidentally added. Information about military strikes on Yemen was subsequently shared on the chat.\n\n“There is no direct cyber threat to the department from this campaign, but information shared with a third party could be exposed if targeted individuals are compromised,” it said.\n\nThe State Department cable, dated July 3, was sent to all diplomatic and consular posts and suggests that staff warn external partners about fake accounts and impersonations.\n\nIt did not reveal further details about the identities of the foreign ministers and US politicians contacted.\n\n“The State Department is aware of this incident and is currently investigating the matter,” a senior State Department official said, speaking on the condition of anonymity.","summary":"Someone using an artificially generated voice to impersonate the US secretary of state called three foreign ministers and two US officials – and left voicemails.","url":"https://www.brisbanetimes.com.au/world/north-america/marco-rubio-rang-foreign-ministers-but-it-wasn-t-really-him-it-was-an-ai-imposter-20250709-p5mdjw.html","image":"https://static.ffx.io/images/$zoom_0.1352%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/a94e6842b421afd197a1854864b2df951e0a07f7","video":null,"publish_date":"2025-07-08 23:11:13","author":"Humeyra Pamuk","authors":["Humeyra Pamuk"],"language":"en","category":"politics","source_country":"au","sentiment":-0.706},{"id":339646900,"title":"Marco Rubio rang foreign ministers – but it wasn’t really him. It was an AI imposter","text":"The Washington Post first reported the attempt. The episode comes weeks after the administration faced a crisis when President Donald Trump’s former national security adviser Mike Waltz created a group chat on Signal in which a journalist was accidentally added. Information about military strikes on Yemen was subsequently shared on the chat.\n\n“There is no direct cyber threat to the department from this campaign, but information shared with a third party could be exposed if targeted individuals are compromised,” it said.\n\nThe State Department cable, dated July 3, was sent to all diplomatic and consular posts and suggests that staff warn external partners about fake accounts and impersonations.\n\nIt did not reveal further details about the identities of the foreign ministers and US politicians contacted.\n\n“The State Department is aware of this incident and is currently investigating the matter,” a senior State Department official said, speaking on the condition of anonymity.","summary":"Someone using an artificially generated voice to impersonate the US secretary of state called three foreign ministers and two US officials – and left voicemails.","url":"https://www.smh.com.au/world/north-america/marco-rubio-rang-foreign-ministers-but-it-wasn-t-really-him-it-was-an-ai-imposter-20250709-p5mdjw.html","image":"https://static.ffx.io/images/$zoom_0.1352%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/a94e6842b421afd197a1854864b2df951e0a07f7","video":null,"publish_date":"2025-07-08 23:11:13","author":"Humeyra Pamuk","authors":["Humeyra Pamuk"],"language":"en","category":"politics","source_country":"au","sentiment":-0.706},{"id":339646392,"title":"Marion McKeone: Texas is hurting after the floods, but it won't hurt Trump","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nOnlookers look down over the damage along the Guadalupe River caused by recent flooding, Sunday, July 6, 2025.\nAlamy Stock Photo\n\nflash floods\n\nMarion McKeone \n Texas is hurting after the floods, but it won't hurt Trump\n\nIn the wake of this week’s devastating floods in Texas, the US correspondent considers the political fallout for Trump and others. \n\n12.11am, 9 Jul 2025\n\nShare options\n\nTHE TEXAS HILL Country is a place of astonishing natural beauty, particularly in early summer when the thousands of acres of sloping hills, woodlands and banks of the multiple rivers and creeks that weave their way through its verdant pastures are covered in blankets of vividly coloured wildflowers.\n\nThroughout the summer, the banks of the Guadalupe River in particular double as a playground and a place of respite from the searing heat of the arid Texas plain and the oppressive humidity of Houston’s vast concrete sprawl. Its lush green banks are shaded by pecan and cypress trees which lends the river a vivid emerald colour for much of its 250-mile path.\n\nFor most of the year, the rivers’ shallow waters drift at a sluggish pace. You can walk horses downstream and from bank to bank. Or hopscotch across the river’s rocks and boulders, barely getting a toe wet.\n\nFor the millions of tourists from further afield, the breathtaking scenery is enhanced by the quaint western towns, where ancient wooden dancehalls still attract locals and visitors who two-step to the strains of local county bands.\n\nExtreme weather\n\nBut extreme and unpredictable weather is a constant danger in this bucolic paradise. The first time I was in Kerr County back in 1999, locals were still talking about the 1987 flash flood, when the Guadalupe burst its banks with catastrophic consequences.\n\nJuly 7 Kerville, Texas. Kerr County, and other counties along the Guadalupe river, have been devastated by the 4th of July flooding.Alamy Stock Photo\n\nAlamy Stock Photo\n\nOne old-timer, a fifth-generation rancher, painted an apocalyptic picture of a 30-foot-high wall of water, as solid and impregnable as concrete, tearing asunder everything in its path; of three-story houses ripped from their pilings and tossed upside down into the flood, cars careening wildly down the river with petrified occupants begging for help, and animal carcasses forming macabre dams at river bends.\n\nBack then an informal local warning system existed where ranchers would alert campers and communities that ‘a big one was coming’. Hundreds of children were safely evacuated from summer camps, but 10 teenagers drowned when a van and a bus used to evacuate campers were swept away. Still, the locals agreed it could have been an awful lot worse if the camp directors hadn’t heeded the warnings. In 2015, the two families perished when their holiday home was ripped from its foundations in a flash flood on the River Blanco.\n\nSearch and rescue teams from Kerrville Fire Department look over the debris after flooding near the banks of the Guadalupe River.Alamy Stock Photo\n\nAlamy Stock Photo\n\nTexas is a state that is grounded – some might say hidebound – by tradition. One of these is the tradition of Christian summer camps, where generations of mostly affluent white families send their children to the same summer camps they attended as children.\n\nThere are at least two dozen children’s summer camps dotted along the Hill Country stretch of the Guadalupe River, along with scores of RV parks, campgrounds, dude ranches, hunting lodges and upscale river cabins.\n\nA Texas Department of Public Safety Trooper and Kerr County Sheriff's deputy assist a rescue diver out of the water at a search point.Alamy Stock Photo\n\nAlamy Stock Photo\n\nThe 100-year-old Camp Mystic is typical of those camps. When Dick Eastland and his wife became third-generation owners and directors in 1974, it was already established as the go-to summer camp for the children of Texas’s most powerful and affluent families.\n\nLyndon Johnson’s daughters went there, as did Texas Governor John Connolly’s. Former First Lady Laura Bush worked as a camp counsellor. It catered for its upscale charges by interspersing horse-riding, tennis, snorkelling and drama classes with Bible studies and a deeply conservative ethos.\n\nDevastation\n\nAt the time of writing 104 people had been confirmed dead, including 27 children and counsellors from Camp Mystic. Thirteen eight and nine-year-old girls perished along with their two camp counsellors when a wall of water roared through their cabin, which was located close to the river bank. Another 10 children and a camp counsellor are still missing.\n\nIn the Hill Country’s small, close-knit communities, everyone knows each other and the grapevine supplements, and often surpasses, information from social media and smartphones.\n\nAdvertisement\n\nBut the population doubles and triples during the summer season. And there are plenty of off-grid types drawn to the area who bed down in riverbank nooks that minimise the chance of an encounter with other campers and holidaymakers. For this reason, the precise number of people who are still unaccounted for is difficult to establish.\n\nOne of the most urgent questions is how, in an era of smartphones that can deliver local alerts and federal ‘extreme weather event’ detection systems, the state and county managers were so ill-prepared for the July Fourth flash floods, which are on course to be the worst in Texas state history.\n\nPeople help during clean-up efforts at Guadalupe Keys Resort.Alamy Stock Photo\n\nAlamy Stock Photo\n\nDubbed ‘flash flood alley’ by locals and meteorologists, the area which encompasses a stretch from Dallas to San Antonio is no stranger to sudden and overwhelming flooding. Unlike the flat, broiling plains of West Texas, the Hill Country traps the moisture-soaked warm air that sweeps in from the Gulf of Mexico and the Pacific, rising when it hits the hills and pushing against the cool air above, a process that triggers ferocious thunderstorms and downpours.\n\nIt’s one of the reasons the Hill Country is greener and cooler and such a magnet for nature lovers. The downpours gather pace as they stream down the limestone hillsides and overwhelm the spider’s web of creeks and smaller rivers that flow into the Guadalupe. Its limestone riverbed further accelerates the speed and ferocity of the currents.\n\nChanging climate and DOGE cuts\n\n100 billion gallons of water fell in the early hours of Friday morning. In less than 90 minutes, the volume of water surged from 95 cubic feet per second to 166,700 cubic feet per second, creating a 34 feet wall of water.\n\nWhile fingers are being pointed at the National Weather Service and the NOAA, which has long been in Trump’s crosshairs, local mitigation efforts appear to have been non-existent. Kerr and Hunt Counties have no flood warning sirens in place; calls to install more flood gauges have gone unheeded for decades.\n\n6 July... President Donald Trump pushed back on criticism that his administration's budget cuts to the nation's weather services had played a role in the deadly floods in Texas.Alamy Stock Photo\n\nAlamy Stock Photo\n\nTexans, by and large, are sceptical about climate change, despite or because its beef and fossil fuel industries are so integral to the Lone Star State’s wealth and sense of identity.\n\nThis is a low-tax state with a long history of rugged self-reliance. At a state and federal level, climate change sceptics have been rushing to undo Joe Biden’s green energy bill and dismantle regulations that would penalise industries with the biggest carbon footprints.\n\nIn May five former National Weather Service directors published an open letter to Trump warning that swingeing DOGE cuts to the NOAA’s cash budget could cause ‘needless loss of life.’ The cuts won’t take effect until the next fiscal year which starts on 1 October, 2025, but almost 12 per cent of the National Weather Services, 4,796 employees were laid off or took voluntary redundancy as a result of DOGE firings. Following a court order in March, some of the NOAA employees who had been fired were rehired by many were placed on ‘paid, non-duty status’.\n\nElon Musk and Trump in the Oval Office earlier this year, taking questions on DOGE cuts.Alamy Stock Photo\n\nAlamy Stock Photo\n\nOn 21 April Paul Yura, the warning coordination meteorologist at the National Weather Service’s Austin/San Antonio office, which is responsible for providing warnings for the affected areas in South Central Texas, announced his early retirement as a result of DOGE cuts, expressing his sadness in an email to colleagues that his 32-year career with the office ‘is ending a few years earlier than I had planned.’\n\nHis position, which is responsible for ensuring ‘ample and timely warnings’ to the Hill Country about major weather events, remains unfilled along with other senior roles in the Austin/San Antonio office – those of chief meteorologist and meteorologist. Another role that focuses on severe weather events in the region – that of Science Operations Officer – is also vacant.\n\nIn 2023 the fifth National Climate Assessment warned of more extreme rainfall events in East Texas. But the Trump administration has fired hundreds of experts who were charged with compiling the 2028 National Climate Assessment and gutted the National Weather Service.\n\nWith a cavalier disregard for statistics that suggest otherwise, Texans tend to describe hurricanes, tornadoes and flash floods as once-in-a-lifetime events. As such, they don’t feel compelled to plan for or insure against the increasing likelihood of future devastation in the same way that, say, Floridians hurricane-proof their homes or Californians take costly measures to minimise the impact of wildfires and earthquakes.\n\nTexas Governor Greg Abbott, Lieutenant Governor Dan Patrick and Kerr County Judge Rob Kelly have each insisted they had no idea that the July Fourth Flood was even possible, notwithstanding repeated warnings of the impact of climate change on Texas.\n\nRelated Reads\n\nSummer camp hit by Texas floods confirms 27 children and staff among the 91 dead\n\nToll shows 21 children among 67 dead in Texas flooding as hunt for missing girls continues\n\nSearch for girls missing from Texas camp after flash flooding as 27 people confirmed dead\n\nTexas Gov. Greg Abbott, centre, tours Camp Mystic after the flood this week.Alamy Stock Photo\n\nAlamy Stock Photo\n\nEarlier this year, the Texas legislature killed legislation proposing a statewide emergency response system to provide early warnings and respond to natural disasters. Three days before Trump’s massive reconciliation bill became law, Texas Senator Ted Cruz inserted a further amendment that cut a $150 million fund that would have boosted a research and warning system to help alert the public to rapid onset extreme weather events.\n\nAgainst increasingly grim odds, Texas persists with its laissez-faire approach to climate-related public safety. Cruz, Abbott and climate-sceptic Republicans continue to cast climate disasters as ‘part of nature’ or ‘acts of God’, proffering a remedy of prayer over safety systems and nudging local media towards focusing on acts of heroism rather than funding cuts or ignored warnings.\n\nTexas Senator Ted Cruz took some heat for his holiday to Greece when the flooding happened.Alamy Stock Photo\n\nAlamy Stock Photo\n\nCruz who went on a family holiday to Greece after the July 3rd warnings had been issued by the National Weather Service, returned three days later, rushing to condemn critics he claimed were seeking to politicise the disaster.\n\nAt a local level, towns and counties that voted 80 per cent for Trump in 2024 have repeatedly vetoed the imposition of advance warning systems and flood warning sirens as being too costly. The taxpayers won’t pay for it, Kelly said of a flood siren system that cost just $300,000 to implement in neighbouring Comal County.\n\nPolitical messaging\n\nCatastrophic events and the often-split-second reactions of political leaders can transform a political legacy. They are seared onto a traumatised public psyche, permanently altering the perception of their leader – for better or for worse.\n\nBill Clinton’s response to the 1995 Oklahoma City bombing; his ability to authentically connect with ordinary Oklahomans in their grief and shock while providing resolute leadership to the rest of the nation added 10 points to his 46 per cent approval rating.\n\nGeorge W Bush’s initial ‘deer in the headlights’ response to the 9/11 attacks was rehabilitated by his impromptu bullhorn address from the rubble of the Twin Towers where he stood with his arm around the shoulder of a fire chief.\n\nWhen a frustrated member of the crowd shouted, ‘We can’t hear you!” a metaphor of sorts for his subpar response to date, Bush shouted back: “I can hear you! The rest of the world hears you. And the people who knocked these buildings down will hear from all of us soon.” His unrehearsed display of resolution led to spontaneous cheers and chants of ‘ USA! USA!’.\n\nHowever, Bush’s inept and seemingly detached response to Hurricane Katrina sent his presidency on a downward trajectory from which it never recovered. An image can become an unintended metaphor for an administration and a press photo of Bush gazing with apparent nonchalance out the window of Air Force One at the devastation below became a metaphor for the incompetence of his response and his administration’s apparent indifference to the suffering of black Americans.\n\nTrump's predecessors handled similar tragedies in different ways.Alamy\n\nBarack Obama was arguably the most gifted orator of the modern presidency. His soaring eulogy following the mass shooting by white supremacist Dylan Roof pastor of the Emmanuel African Methodist Episcopal church was obscured by his decision to lead the stunned and grieving congregation with an a capella version of Amazing Grace, a moment that is regarded as one of the most poignant and uplifting of his presidency.\n\nJoe Biden, arguably the most empathic of presidents, was known as the Consoler-in-Chief for his heartfelt expressions of sympathy and his ability to use the personal tragedies in his own life to comfort those who had experienced sudden, devastating loss.\n\nTrump, who has wisely decided not to travel to Texas while further extreme weather threatens to hamper the search, rescue and recovery efforts, has had an altogether more chequered history with tragedies and disasters. His administration tends to deny, deflect and distract from any potential culpability. His heavily politicised response to the devastating California fires earlier this year, his false claims about the Biden administration’s response to Hurricane Helene and his indifference to the desperation of Puerto Ricans following the devastating impact of Hurricane Maria during his first term was in stark contrast with his immediate decision to provide disaster aid to Texas within hours of the flash flood.\n\nBut Texas is Trump country; he won about 80 per cent of the vote in the affected counties. There is little doubt he will receive anything less than a hero’s welcome. Talk of climate change denial or the impact of DOGE cuts is unlikely to cloud his visit. The will be plenty of flags and feel-good moments. Friendly media and an absence of protesters will work in his favour.\n\nMarion McKeone is an award-winning journalist, writer and documentary maker.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nThe Journal's climate change newsletter\nFollow the biggest news story of our times. Sign up for our monthly climate newsletter\n\nYou are now signed up\n\nMarion McKeone\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Marion McKeone: Texas is hurting after the floods, but it won't hurt Trump”.\n\nRecipient's Email\n\nFeedback on “Marion McKeone: Texas is hurting after the floods, but it won't hurt Trump”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nClimate Change\n\nflash floods\n\ntexas floods\ntexas governor\n\nNews in 60 seconds\n\nThe Morning Lead\nAlmost 25% of 'urgent' patients waiting too long for breast clinic appointments\n\nMaria Delaney\n\nMan in his 20s suffers 'serious' injuries in single-vehicle e-scooter crash in Co Cork\n\n'I thought I was going to die': Woman fled the country after ex-partner beat her with golf club\n\nPersona non Grata\nEU commissioner and delegation ordered to leave Libya just after arriving in Benghazi\n\nHarry Dinan\nEnnis man who killed school teacher jailed for five years and two months for drug dealing\n\nTrump defends his AG from MAGA backlash after her U-turn on Jeffrey Epstein publication\n\nInvestigatesState Investments\nIrish sovereign wealth fund pumped millions into companies contracted by Israel Defence Forces\n\nStephen McDermott\n\nInvestigatesState Investments\nWho are the 8 companies that Ireland invests in that have links to illegal Israeli settlements?\n\nStephen McDermott\n\nColonel Colm Ó Luasa\nGovernment appoints former senior Army Ranger Wing officer to Deputy Chief of Staff post\n\nDrone delivery services\nMinister was told to play up 'uncluttered airspace' to sell Ireland as global leader for drones\n\nright into the eurozone\nBulgaria is joining the Euro\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"In the wake of this week’s devastating floods in Texas, the US correspondent considers the political fallout for Trump and others.","url":"https://www.thejournal.ie/readme/texas-floods-trump-6755812-Jul2025/","image":"https://img2.thejournal.ie/article/6755812/river/?height=400&version=6755824","video":null,"publish_date":"2025-07-08 23:10:08","author":null,"language":"en","source_country":"ie","sentiment":0.305},{"id":339648378,"title":"FBI launches criminal investigations of John Brennan, James Comey over Trump-Russia probe: DOJ sources","text":"Former CIA Director John Brennan and former FBI Director James Comey are under criminal investigation for potential wrongdoing related to the Trump–Russia probe, including allegedly making false statements to Congress, Justice Department sources told Fox News Digital.\n\nCIA Director John Ratcliffe referred evidence of wrongdoing by Brennan to FBI Director Kash Patel for potential prosecution, DOJ sources told Fox News Digital.\n\nThe sources said that the referral was received and told Fox News Digital that a criminal investigation into Brennan was opened and is underway. DOJ sources declined to provide further details. It is unclear, at this point, if the investigation spans beyond his alleged false statements to Congress.\n\nAs for Comey, DOJ sources told Fox News Digital that an investigation into the former director is underway, but could not share details of what specifically is being probed.\n\nThe full scope of the criminal investigations into Brennan and Comey is unclear, but two sources described the FBI’s view of the duo’s interactions as a “conspiracy,” which could open up a wide range of potential prosecutorial options.\n\nThe FBI and CIA declined to comment.\n\nNeither Brennan nor Comey immediately responded to Fox News Digital’s request for comment.\n\nThe Brennan investigation comes after Ratcliffe last week declassified a “lessons learned” review of the creation of the 2017 Intelligence Community Assessment (ICA). The 2017 ICA alleged Russia sought to influence the 2016 presidential election to help then-candidate Donald Trump. But the review found that the process of the ICA’s creation was rushed with “procedural anomalies,” and that officials diverted from intelligence standards.\n\nIt also determined that the “decision by agency heads to include the Steele Dossier in the ICA ran counter to fundamental tradecraft principles and ultimately undermined the credibility of a key judgment.”\n\nThe dossier — an anti-Trump document filled with unverified and wholly inaccurate claims that was commissioned by Fusion GPS and paid for by Democrat presidential candidate Hillary Clinton’s campaign and the DNC — has been widely discredited. Last week’s review marks the first time career CIA officials have acknowledged politicization of the process by which the ICA was written, particularly by Obama-era political appointees.\n\nRecords declassified as part of that review further revealed that Brennan did, in fact, push for the dossier to be included in the 2017 ICA.\n\nBrennan testified to the House Judiciary Committee in May 2023, however, that he did not believe the dossier should be included in that intelligence product.\n\nRatcliffe was not surprised by the review’s findings, a source familiar told Fox News Digital, given the director’s long history of criticizing Brennan’s politicization of intelligence. But Ratcliffe was compelled to refer aspects of Brennan’s involvement to the FBI for review of possible criminality, the source said.\n\nThe source was unable to share the sensitive details of Ratcliffe’s criminal referral to the FBI with Fox News Digital, but said that Brennan “violated the public’s trust and should be held accountable for it.”\n\nThe false statements portion of the probe stems from a newly declassified email sent to Brennan by the former deputy CIA director in December 2016. That message said that including the dossier in the ICA in any capacity jeopardized “the credibility of the entire paper.”\n\n“Despite these objections, Brennan showed a preference for narrative consistency over analytical soundness,” the new CIA review states. “When confronted with specific flaws in the Dossier by the two mission center leaders – one with extensive operational experience and the other with a strong analytic background – he appeared more swayed by the Dossier’s general conformity with existing theories than by legitimate tradecraft concerns.”\n\nThe review added: “Brennan ultimately formalized his position in writing, stating that ‘my bottomline is that I believe that the information warrants inclusion in the report.’”\n\nBut Brennan testified the opposite in front of Congress in May 2023.\n\n“The CIA was very much opposed to having any reference or inclusion of the Steele dossier in the Intelligence Community Assessment,” Brennan testified before the House committee, according to the transcript of his deposition reviewed by Fox News Digital. “And so they sent over a copy of the dossier to say that this was going to be separate from the rest of that assessment.”\n\nCIA officials at the time of its creation pushed back against the FBI, which sought to include the dossier, arguing that the dossier should not be included in the assessment, and casting it as simply “internet rumor.”\n\nUltimately, Steele’s reporting was not included in the body of the final ICA prepared for then-President Barack Obama, but instead detailed in this footnote, “largely at the insistence of FBI’s senior leadership,” according to a review by the Justice Department inspector general, and later, the Senate Intelligence Committee.\n\nBut back in June 2020, Ratcliffe, while serving as director of national intelligence, declassified a footnote of the 2017 ICA, which revealed that the reporting of Trump dossier author Christopher Steele had only “limited corroboration” regarding whether then-President-elect Trump “knowingly worked with Russian officials to bolster his chances of beating” Hillary Clinton and other claims.\n\nThe footnote, also known as “Annex A” of the 2017 ICA, exclusively obtained by Fox News Digital in June 2020, spanned less than two pages and detailed reporting by Steele, the former British spy who authored the unverified anti-Trump dossier — a document that helped serve as the basis for controversial Foreign Intelligence Surveillance Act (FISA) warrants obtained against former Trump campaign aide Carter Page.\n\nSteele’s reporting, at the time, was commissioned by opposition research firm Fusion GPS and funded by the Clinton campaign and the Democratic National Committee (DNC) through law firm Perkins Coie.\n\nThe footnote made clear the internal concerns officials had over that document.\n\n“An FBI source (Steele) using both identified and unidentified subsources, volunteered highly politically sensitive information from the summer to the fall of 2016 on Russian influence efforts aimed at the US presidential election,” the annex read. “We have only limited corroboration of the source’s reporting in this case and did not use it to reach the analytic conclusions of the CIA/FBI/NSA assessment.”\n\n“The source collected this information on behalf of private clients and was not compensated for it by the FBI,” it continued.\n\nBut the annex notes that Steele’s reporting was “not developed by the layered subsource network.”\n\n“The FBI source caveated that, although similar to previously provided reporting in terms of content, the source was unable to vouch for the additional information’s sourcing and accuracy,” the annex states. “Hence this information is not included in this product.”\n\nJustice Department Inspector General Michael Horowitz also reviewed the inclusion of Steele’s reporting in the ICA during his review of alleged misconduct related to the Foreign Intelligence Surveillance Act, or FISA.\n\nHis report, released in late 2019, found that there were “significant inaccuracies and omissions” in FISA warrants for former Trump campaign aide Page. Those warrants relied heavily on Steele’s reporting, despite the FBI not having had specific information corroborating allegations against Page that were included in Steele’s reporting.\n\nMeanwhile, Fox News Digital exclusively reported in October 2020 that Brennan briefed former President Obama and administration officials on intelligence that then-Democrat nominee former Secretary of State Clinton was stirring up a plan to tie Trump to Russia.\n\nRatcliffe, as director of national intelligence, declassified Brennan’s handwritten notes memorializing that meeting, which were exclusively obtained by Fox News Digital in October 2020.\n\nOn July 28, 2016, Brennan briefed Obama on a plan from one of Clinton’s campaign foreign policy advisors “to vilify Donald Trump by stirring up a scandal claiming interference by the Russian security service.”\n\nComey, then-Vice President Joe Biden, former Attorney General Loretta Lynch and former Director of National Intelligence James Clapper were in the Brennan-Obama briefing.\n\nAfter that briefing, the CIA properly forwarded that information through a Counterintelligence Operational Lead (CIOL) to Comey and then-Deputy Assistant Director of Counterintelligence Peter Strzok, with the subject line: “Crossfire Hurricane.”\n\nFox News Digital exclusively obtained and reported on the CIOL in October 2020, which stated: “The following information is provided for the exclusive use of your bureau for background investigative action or lead purposes as appropriate.”\n\n“Per FBI verbal request, CIA provides the below examples of information the CROSSFIRE HURRICANE fusion cell has gleaned to date,” the memo continued. “An exchange (REDACTED) discussing US presidential candidate Hillary Clinton’s approval of a plan concerning US presidential candidate Donald Trump and Russian hackers hampering US elections as a means of distracting the public from her use of a private email server.”\n\nThe FBI on July 31, 2016, opened a counterintelligence investigation into whether candidate Trump and members of his campaign were colluding or coordinating with Russia to influence the 2016 campaign. That investigation was referred to inside the bureau as “Crossfire Hurricane.”\n\nFormer Special Counsel Robert Mueller was appointed to take over the FBI’s original “Crossfire Hurricane” investigation. After nearly two years, Mueller’s investigation, which concluded in March 2019, yielded no evidence of criminal conspiracy or coordination between the Trump campaign and Russian officials during the 2016 presidential election.\n\nShortly after, John Durham was appointed as special counsel to investigate the origins of the “Crossfire Hurricane” probe.\n\nDurham found that the FBI “failed to act” on a “clear warning sign” that the bureau was the “target” of a Clinton-led effort to “manipulate or influence the law enforcement process for political purposes” ahead of the 2016 presidential election.\n\n“The aforementioned facts reflect a rather startling and inexplicable failure to adequately consider and incorporate the Clinton Plan intelligence into the FBI’s investigative decision-making in the Crossfire Hurricane investigation,” Durham’s report states.\n\n“Indeed, had the FBI opened the Crossfire Hurricane investigation as an assessment and, in turn, gathered and analyzed data in concert with the information from the Clinton Plan intelligence, it is likely that the information received would have been examined, at a minimum, with a more critical eye,” the report continued.\n\nDurham, in his report, said the FBI “failed to act on what should have been—when combined with other incontrovertible facts— a clear warning sign that the FBI might then be the target of an effort to manipulate or influence the law enforcement process for political purposes during the 2016 presidential election.”\n\nMeanwhile, the White House wants the Obama-era intelligence officials to be held accountable.\n\n“President Trump was right — again,” White House press secretary Karoline Leavitt said in a statement to Fox News Digital. “Those who engaged in this political scandal must be held accountable for the fraud they committed against President Trump and the lies they told to the American people.”","summary":"CIA Director John Ratcliffe referred Brennan for criminal investigation to the FBI, sources told Fox News Digital.","url":"https://nypost.com/2025/07/08/us-news/fbi-launches-criminal-investigations-of-john-brennan-james-comey-over-trump-russia-probe/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/107844468.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2025-07-08 23:09:57","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.63},{"id":339659724,"title":"Why Todd Chrisley Felt 'Ashamed and Embarrassed' to Discuss His Sentence with Other Prisoners","text":"Todd Chrisley is getting candid about discussing his sentence with other prisoners.\n\n During a conversation on his daughter Savannah Chrisley’s Unlocked podcast, Todd and wife Julie Chrisley reflected on missing out on their children’s lives while serving time behind bars for 28 months. The couple were pardoned by President Donald Trump and released from prison last month.\n\n “It's very hard,” Julie said of being away from her children. “I actually had a supervisor that was talking one day because I worked in the commissary. And, he was the supervisor over the commissary officers. Super nice man. Super nice.” \n\n “And he was talking one day, and he was saying that his father had told him, son, you only have 18 summers with your kids, really,” she recalled. “And I don't think he really caught it when he said it, like how it affected me, you know, and the other women who were in there because it's so true, you know. Really, you've got 18 summers with your kids and then they're grown, you know? And so to know that I missed two of those 18. Two of those 18.”\n\n While acknowledging that it was difficult to miss time with his family, Todd admitted that other prisoners had it worse. \n\n “I try not to look at it that way because I look at it that there are men and women that have missed far more than two,” he said of the inmates at Florida's Federal Prison Camp Pensacola.\n\n “I felt ashamed,” he shared. “There were times that I felt ashamed and embarrassed to even talk about my sentence when I had someone who was there that had been sentenced to 30 years.” \n\n “I understand that it doesn't minimize our loss, but I just think for myself, I don't feel like that I have the right to say that I was in prison when I was there for twenty eight months and I was at a camp and these other men that have worked their way down to there have suffered. I didn't have to do that.”\n\n The pardons from President Trump put an end to a legal saga which led to the pair being indicted on 12 counts of bank and wired fraud, tax evasion and conspiracy and later convicted and sentenced to a combined 19 years in prison in November 2022 (though that number was reduced by around two years each in September 2023).\n\n They immediately began appealing their case, and while Todd’s appeal was upheld, Julie's was initially granted due to insufficient evidence. However, a judge later ruled that her original punishment was sufficient. \n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n During the interview on Fox News Channel's My View with Lara Trump, Todd recalled his reaction to learning of his pardon. \n\n \"This guy stops me and goes, 'Man, I think you just got pardoned.' And I said, 'Yeah, okay,'” he shared. “And I just kept on walking. So when I went into my dorm, one of the guys, the COs, he came by and he goes, 'Are you good?' And I said, 'As good as I can be.' And he said, 'Todd, you just got pardoned. They sent me down here to make sure you're okay.'\"\n\n \"I said, 'Well, they don't need to be worrying about me now. Hell, if I'm pardoned, I'm great,'\" he joked going on to thank God, who he believed \"touched President Trump's heart.\"\n\n \"God led the people to advocate for us,\" Todd concluded. \"And so I'm grateful because every night I would pray that God would return me home to my wife and my children. And he did that, so I'm grateful.”","summary":"\"There were times that I felt ashamed and embarrassed to even talk about my sentence when I had someone who was there that had been sentenced to 30 years,\" Todd explained","url":"https://people.com/why-todd-chrisley-felt-ashamed-and-embarrassed-to-discuss-prison-sentence-11768614","image":"https://people.com/thmb/MvqQ13A8K6JDIRGJWQCEZk3I6Gk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x264:721x266)/chrisley-interview-bombshells-todd-chrisley-063025-ab2dd09fc41441dbabdeb6b733f5d2b6.jpg","video":null,"publish_date":"2025-07-08 23:09:24","author":"Stephanie Wenger","authors":["Stephanie Wenger"],"language":"en","category":"politics","source_country":"US","sentiment":-0.307},{"id":339648692,"title":"Will the full story of Jeffrey Epstein ever be revealed?","text":"At the White House on Feb. 27 three conservative influencers proudly held aloft binders marked “The Epstein Files: Phase I.”\n\nAttorney General Pam Bondi celebrated a bold new era, emphasizing the government’s “commitment to transparency and unveiling the disgraceful actions of Jeffrey Epstein and his associates.”\n\nHowever, the files unveiled nothing novel. A month later, reports indicated that FBI agents were “working tirelessly, with some undertaking 12-hour overnight shifts” to prepare additional evidence for disclosure.\n\nThe public hoped that fundamental questions about the pedophile financier Epstein—who was discovered dead after hanging himself in his prison cell under unusual circumstances in August 2019—might finally be addressed.\n\nThen on Monday the Department of Justice pumped the brakes with a surprising statement, saying there will be no Phase II.\n\n“As part of our commitment to transparency,” the DOJ and FBI joint statement began, before describing how the agencies have concluded from thorough research of the available material Epstein took his own life, had no “client list” and there was no evidence of him blackmailing anyone. Crucially, they said no more data would be released.\n\nThe same letter noted authorities had found “more than 300 gigabytes of data and physical evidence,” but claimed none of it, not one document, was suitable for the public.\n\nSadly, with that the public’s chances of ever knowing the truth rapidly diminished.\n\nEpstein’s former lawyer, confidant and personal friend Alan Dershowitz said he would like to see all the shackles removed from the files, secrets and all.\n\n“Every item of evidence should be revealed,” he told The Post Tuesday. “Everything. There should be no secrets.\n\n“I know personally of people who were named as having sex inappropriately whose names have never been released.”\n\nBacklash was also swift from Rogan “DC Draino” O’Hanley – one of those pictured holding “The Epstein Files: Phase 1” outside the White House in February.\n\n“This is a shameful coverup to protect the most heinous elites,” he tweeted.\n\nTrump, appearing incensed, batted away questions about Epstein at a Tuesday cabinet meeting, saying talking about the “creep” was a waste of time.\n\nOne of the few things revealed in the February files was a list of around 140 items seized by authorities from raids of Epstein’s homes in New York, Florida and the Virgin Islands.\n\nIt included more than nine hard drives, thumb drives, various desktop computers, CDs and various other digital media.\n\nNo content from any tech device, phone or computer owned by Epstein has ever been disclosed, despite repeated requests from various news outlets, including the New York Post.\n\n“I understand that a lot of it is inappropriate, a lot of it is underage pornography, etc., but there have to be things that are relevant that can be released,” said Eric Lerner, an attorney who represented Jennifer Araoz. She had accused Epstein of sexually abusing her as a teenager when he was alive then sued his estate upon his death.\n\n“It’s very disappointing,” he added. “Pam Bondi had the complete file. She was going to release it and this administration was going to be different than the last administration.\n\n“[But] so far, it’s a bunch of the same … He clearly had a client list; there’s no question about that. For them to not be releasing the client list is very suspicious,” said a flabbergasted sounding Lerner.\n\nOnline sources have speculated information may be suppressed by government agencies to protect themselves — given Epstein had been a sex offender since 2008 but was still traveling around the world, and abusing young girls and women with apparent impunity. The DOJ’s Jul. 7 note states there were over 1,000 victims of Epstein’s crimes.\n\nIt has also previously been stated certain materials were not being released in case they jeopardized the conviction of Epstein’s right hand woman, Ghislaine Maxwell, who was convicted of procuring victims for him to abuse in 2022 and sentenced to 20 years. She is currently appealing her sentence from prison in Florida.\n\nAs someone who has spent thousands of hours researching Jeffrey Epstein on behalf of Araoz, Lerner thinks he knows another reason info may be suppressed.\n\nAsked if it has anything to do with Epstein’s alleged ties to Israeli intelligence agency Mossad, Lerner replied, “I do. There’s no question that Ghislaine Maxwell’s father [publishing magnate Robert Maxwell] was an Israeli agent.\n\n“And who was Epstein closest to in the world? Ghislaine. Israel was very important to him. My personal opinion is that Epstein was intelligence, either for the US or for Israel. More likely for Israel.”\n\nBut one thing Lerner is clear on: “I don’t think he spied on America.”\n\nIt’s come out that Epstein had a Saudi Arabian passport in his safe and also held an Austrian passport. Multiple sources told The Post they are not surprised to hear it. One source claimed Epstein “liked to have passports from all over the world, just to show how closely connected he was to people.”\n\nAs he largely was during his life, Epstein remains aloof in death. Even a satisfactory answer as to how he went from schoolteacher and failed investment banker to multimillionaire financier for Victoria’s Secret boss Leslie Wexner has never been established.\n\nThose left who may be able to provide answers are few. Ghislaine has never given anything away during or post trial. Epstein’s personal lawyer and executor of his estate Darren Indyke is able to use attorney-client privilege. His personal accountant, Richard Kahn – also an estate executor – has always maintained he knew nothing of his bosses’ private life until after he died, according to the New York Times.\n\nFormer friends like Britain’s Prince Andrew and disgraced UK banker Jes Staley have been burned by their association with Epstein and are unwilling to say more about his private life.\n\nSeemingly the only person left is his younger brother Mark. He has maintained they weren’t too close as siblings, but he doesn’t believe Epstein took his own life in jail, while awaiting trial over sex trafficking charges.\n\nBut he has teased a few things. Referring to the 2016 general election between Donald Trump and Hillary Clinton he said Epstein had told him, “If I said what I know about both candidates, they’d have to cancel the election,” although he offered no evidence.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAt the White House on Feb. 27 three conservative influencers proudly held&#8230;\n\n\nThis Post: Will the full story of Jeffrey Epstein ever be revealed? first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/will-the-full-story-of-jeffrey-epstein-ever-be-revealed/","image":"https://internewscast.com/wp-content/uploads/2025/07/Will-we-never-know-the-truth-about-Jeffrey-Epstein.jpg","video":null,"publish_date":"2025-07-08 23:06:46","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.027}]}