{"offset":0,"number":50,"available":24845,"news":[{"id":398425216,"title":"Trevor Noah Literally Makes Nicki Minaj & Donald Trump the Butt of the Joke in Grammys Monologue","text":"Skip to main content\n\nTrevor Noah at the 68th GRAMMY Awards held at the Crypto.com Arena on Feb. 1, 2026, in Los Angeles.\n\nGilbert Flores/Billboard\n\nTrending on Billboard\n\nTrevor Noah hosted the Grammys for the final time this year — and he made sure to milk every second of his last opening monologue on Sunday night (Feb. 1).\n\nHere Are the 2026 Grammys Winners: Full List (Updating Live)\n\nGrammys Red Carpet 2026: Best Photos of Sabrina Carpenter, Olivia Dean & More\n\nHere Are All the Performers & Presenters for the 2026 Grammy Awards\n\nFollowing a fiery rendition of “APT.” from record and song of the year nominees ROSÉ and Bruno Mars, Noah took the stage for his sixth consecutive stint as Grammy host on Sunday (Feb. 1), donning a snazzy black tuxedo and bow tie.\n\nAlways good for some crowd work, he began his opening monologue gushing over the year in music — Doechii and Jelly Roll, both already winners tonight, got shout-outs — and greeting famous friends in the audience such as Miley Cyrus, and album of the year nominees Clipse, Justin Bieber and Bad Bunny.\n\nDespite the overflow of starpower in Los Angeles’ Crypto.com Arena, the climax of his opening monologue came by way of two celebrities who were notably not in attendance: Nicki Minaj and Donald Trump. Joking that the two controversial figures missed the ceremony due to a “very important” White House meeting, Noah began imitating Trump, cracking, “Actually, Nicki, I have the bigger a–!”\n\nNaturally, the zinger landed perfectly in the room, drawing raucous laughter from the star-studded crowd. On Jan. 28, Minaj met the president for the first time, holding hands with her fellow Queens mogul at the Trump Accounts Summit in Washington, D.C. The Billboard Hot 100-topping rapper also received a Trump Gold Card-themed memento from the President. The pair’s meeting comes after a drastic public conservative shift for Minaj, who has frequently used her X account to voice her support for President Trump and his administration.\n\nMinaj, who has yet to win a Grammy despite 12 career nominations, wasn’t the only rapper to get burned by Noah at the 2026 Grammys. Shortly before his presidential quip, Noah joked that 2026 was starting to feel like 1999 because of a “presidential sex scandal,” everyone being “scared of computers” and Diddy being arrested. (The disgraced Bad Boy mogul and three-time Grammy winner was sentenced to four years in prison on Oct. 3 for violating federal prostitution laws.)\n\nWith Sunday night’s ceremony, Noah becomes the first person to host six consecutive Grammy telecasts since Billboard 200 chart-topper Andy Williams hosted the first seven live telecasts from 1971 to 1977.\n\nGet weekly rundowns straight to your inbox\n\nWant to know what everyone in the music business is talking about?\n\nGet in the know on\n\nVisit Billboard Pro for music business news\n\nBillboard is a part of Penske Media Corporation. © 2026 Billboard Media, LLC. All Rights Reserved.\n\nPowered by WordPress.com VIP\n\noptional screen reader\n\nManage Account\n\nBillboard Hot 100™\n\nBillboard 200™\n\nHits Of The World™\n\nSongs Of The Summer\n\nYear-End Charts\n\nDecade-End Charts\n\nR&B/Hip-Hop\n\nBusiness News\n\nRecord Labels\n\nView All Pro\n\nSongwriters & Producers\n\nArtist Index\n\nRoyalty Calculator\n\nMarket Watch\n\nIndustry Events Calendar\n\nBillboard Español\n\nCultura y Entretenimiento\n\nCrossword Puzzle\n\nGET ACCESS TODAY","summary":"The Emmy-winning comedian aced his final opener, also taking a crack at Diddy.","url":"https://www.billboard.com/music/awards/trevor-noah-grammys-joke-monologue-donald-trump-nicki-minaj-1236169310/","image":"https://www.billboard.com/wp-content/uploads/2026/02/P103YR0J-e1769994508490.jpg","video":null,"publish_date":"2026-02-02 01:52:28","author":"Kyle Denis,Kyle-Brandon Denis","authors":["Kyle Denis","Kyle-Brandon Denis"],"language":"en","category":"politics","source_country":"US","sentiment":0.104},{"id":398424444,"title":"Dollar firm as investors mull a Fed under Warsh, yen back in the spotlight","text":"The US dollar index steadied at 97.22 after jumping 1% on Friday. (AFP pic)\nSINGAPORE: The US dollar clung to its gains today as investors weighed what a Federal Reserve (Fed) under Kevin Warsh might look like, with his preference for a smaller balance sheet.\nThe yen was also back on traders' radars, after Japanese Prime Minister Sanae Takaichi over the weekend talked up the benefits of a weaker yen in a campaign speech, in a tone at odds with her finance ministry that has worked to stem the currency's declines.\nUS President Donald Trump's pick of Warsh as the next Fed chair sparked a wave of selling across risky assets and sent precious metals tumbling on Friday, while the dollar clawed back its losses from earlier last week.\nWhile investors think Warsh will be inclined to cut rates, they expect him to rein in the Fed's balance sheet, which is typically supportive for the dollar as it reduces the money supply in the market.\nThe greenback remained on the front foot in early Asia trade on Monday, leaving the euro firmly away from the US$1.20 level as it last stood at US$1.1848.\nSterling GBP was down 0.05% to US$1.3680, while the dollar index steadied at 97.22 after jumping 1% on Friday.\nRichard Clarida, PIMCO's global economic advisor and former Fed vice chair, said that while Warsh will inherit a Federal Open Market Committee that remains divided over the pace and scale of further policy easing, he believes Warsh will be able to deliver two rate cuts this year, and potentially even a third.\n\"Beyond those next two or three rate cuts, we believe Warsh may be more wary, depending on the inflation outlook,\" said Clarida.\n\"Warsh, based on his writings since leaving the Fed, may be much less likely to rely on extensive forward guidance about the future path of interest rates,\" Clarida said.\nElsewhere, the Australian dollar fell 0.54% to US$0.69255, while the New Zealand dollar slid 0.3% to US$0.6001.\nYen weakens\nThe Japanese yen was down 0.4% to ¥155.39 per dollar on Monday, pressured in part by the dollar's strength and Takaichi's weekend comments which seemed to condone a weaker currency.\nA survey by the Asahi newspaper showed that her party is likely to score a landslide victory in the upcoming lower house election.\n\"The Feb 8 snap election is likely to be the next key local catalyst for the yen,\" said Tony Sycamore, a market analyst at IG.\n\"An LDP majority would likely push the US dollar/Japanese yen toward ¥160, whereas a coalition outcome could leave the pair near the ¥155.00 level depending on the coalition partners,\" Sycamore said.\nInvestors have sold the yen and Japanese government bonds in the run-up to the election, on expectations of more expansionary fiscal policy should Takaichi win a strong mandate, and that the tax cuts her party has touted would further strain already stretched government finances.\nStill, the ailing yen has found a floor in recent times, as traders remain on alert to the prospect of a coordinated currency intervention by the US and Japan after talks of rate checks from both sides late last month sent the currency surging.","summary":"The US dollar clung to its gains as investors weighed what a Federal Reserve under Kevin Warsh might look like.","url":"https://www.freemalaysiatoday.com/category/business/2026/02/02/dollar-firm-as-investors-mull-a-fed-under-warsh-yen-back-in-the-spotlight","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/02/74a73891-us-dollar.jpg","video":null,"publish_date":"2026-02-02 01:43:03","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.142},{"id":398423578,"title":"Nationwide 'ICE Out' protests sweep US against Trump administration's immigration policies","text":"Washington DC: Protests swept across the United States over the weekend as demonstrators rallied under the slogan \"ICE Out\", demanding an end to the Trump administration's immigration enforcement measures, CNN reported..The protests marked a second consecutive day of demonstrations after a nationwide strike on Friday disrupted schools, workplaces, and businesses across several states, with large rallies and marches reported in major cities including Minneapolis, New York, Los Angeles, Portland, and Austin..Deportation of boy, 5, detained by ICE\ntemporarily blocked by US judge .According to CNN, protests gained momentum following recent incidents in Minneapolis, where the deaths of Alex Pretti and Renee Good during immigration enforcement actions have intensified public scrutiny of federal tactics, making the incidents focal points in the broader national debate over immigration policy..Trump says to 'de-escalate' Minneapolis after Pretti shooting.The protest also led to major legal development in the country, with a federal judge on Saturday ordering the release of five-year-old Liam Conejo Ramos and his father from a detention facility in Texas, issuing a strongly worded opinion critical of the government's actions..The child and his father returned to Minneapolis on Sunday, according to Texas Representative Joaquin Castro, CNN reported..The detention of the child had further fuelled the widespread outrage and become a symbol of opposition to what critics describe as heavy-handed enforcement practices by federal authorities..Who was Alex Jeffrey Pretti? ICU nurse killed in Minneapolis protest.However, the Trump administration also had its small share of wins when a separate court ruling denied a request by the State of Minnesota and the cities of Minneapolis and St Paul to halt Operation Metro Surge, a large-scale federal immigration operation currently underway in the Twin Cities, CNN reported..The operation involves thousands of federal agents and will continue as legal proceedings move forward amid the raging protests..The US Department of Homeland Security (DHS) welcomed the ruling, while state and city officials expressed disappointment, noting that they would continue pursuing the case, which alleges unlawful arrests and excessive use of force, CNN reported..'Be Good': Anti-ICE protests sweep the US following fatal ICE shooting in Minneapolis, echoing at the Golden Globes.Amid the unrest, US President Donald Trump instructed the DHS not to deploy federal intervention in Democratic-led cities unless formally requested by local authorities..Mounting criticism.In a post on Truth Social on Saturday, Trump directed Secretary of Homeland Security Kristi Noem not to intervene in \"protests and/or riots\" in Democratic-led cities amid mounting criticism over his administration's use of aggressive immigration enforcement measures..\"I have instructed Secretary of Homeland Security, Kristi Noem, that under no circumstances are we going to participate in various poorly run Democrat Cities with regard to their Protests and/or Riots unless, and until, they ask us for help,\" his post read..Documentation.Meanwhile, in Chicago, Mayor Brandon Johnson signed an executive order directing city police to document and investigate alleged misconduct by federal immigration officers. The move follows the formation of a coalition of nine local district attorneys to prosecute federal officers accused of violating state laws, CNN reported..Separately, the US Department of Justice has launched a civil rights investigation into the fatal shooting of Alex Pretti by federal officers, with US Deputy Attorney General Todd Blanche stating that the investigation would examine whether the officers involved violated the law, adding later that the inquiry is being conducted by the FBI.","summary":"Protests swept across the United States over the weekend as demonstrators rallied under the slogan \"ICE Out\", demanding an end to the Trump administration's immigration enforcement measures, CNN reported.","url":"https://gulfnews.com/world/americas/nationwide-ice-out-protests-sweep-us-against-trump-administrations-immigration-policies-1.500428436","image":"https://media.assettype.com/gulfnews/2026-01-20/kx7v3buw/newsml_afp_com_20260120T233459Z_doc_93ff9u6.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2026-02-02 01:40:34","author":"ANI","authors":["ANI"],"language":"en","category":"politics","source_country":"ae","sentiment":-0.121},{"id":398423170,"title":"Grammys Host Trevor Noah Mocks Trump’s Butt and Bezos’ Wedding in Monologue","text":"Skip to main content\n\nGrammys: Sabrina Carpenter, Rosé, Olivia Dean and More Stars Hit the Red Carpet\n\nFebruary 1, 2026 5:34pm\n\nShare on Facebook\n\nGoogle Preferred\n\nShare to Flipboard\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nSend an Email\n\nPrint the Article\n\nPost a Comment\n\nTrevor Noah\n\nMichael Schwartz/CBS\n\nShare on Facebook\n\nGoogle Preferred\n\nShare to Flipboard\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nSend an Email\n\nPrint the Article\n\nPost a Comment\n\nGrammys host Trevor Noah took to the Crypto.com Arena stage Sunday night and delivered an opening monologue that took aim at President Trump and our national “anxiety.”\n\nThrowing down largely gentle barbs, Noah joked at the outset of the 68th annual awards show that America’s drinking game was now “every time we turn on the news, we drink.”\n\n“So many stars in this room, I feel like I’m at Jeff Bezos wedding — but with way more Black people,” Noah said.\n\n“The last time Lauryn Hill performed at the Grammys was in 1999 — back in 1999 the president had a sex scandal, people thought computers were going to destroy the world, and Diddy was arrested,” Noah said. “Boy how times have changed!”\n\nRelated Stories\n\nRosé Makes History, Kicking Off 2026 Grammy Awards With Electric \"APT\" Performance Featuring Bruno Mars\n\nThe Story Behind Billie Eilish, Justin and Hailey Bieber Wearing \"ICE OUT\" Pins at the Grammys\n\nTurning his attention to a clearly uncomfortable Justin Bieber — who is set to perform tonight — Noah said, “Over the last few years, this young man has done so many amazing things … My personal favorite thing that Justin Bieber has done over the past year is he told Apple to move the dictation button on the keyboard — hero. Justin, now I just need you to tell them to make a new feature where when you search on your phone, it finds things.”\n\n“Nicki Minaj is not here,” said Noah, a four-time Grammy nominee himself. “She is still at the White House with Donald Trump discussing very important issues.” Noah then launched into a Trump impression: “Actually, Nicki, I have the biggest ass. I have it. Everybody is saying it, Nicki. I know this is you, but it’s me. Look at it baby: WAP, WAP, WAP.”\n\n“Doechii is in the house,” he continued. “Her hit record, ‘Anxiety,’ which is now our new national anthem.”\n\n“Olivia Dean is also here, nominated for best new artist,” Noah said. “You should be nominated for the most amazing and thoughtful artist because she fought Ticketmaster to stop resellers from ripping fans off — which is amazing, because if the fans can’t afford tickets, we can’t have live music, and without concerts, how would we find out which CEOs are having affairs on the Jumbotron?”\n\nThis marks the former Daily Show host’s sixth consecutive (and final) time hosting music’s biggest night.\n\nPreviously, Grammys executive producer Ben Winston issued a statement to The Hollywood Reporter about bringing Noah back: “I am beyond thrilled to welcome Trevor Noah back to host the Grammys for his sixth, and sadly, final time. He’s been the most phenomenal host of the show. He’s so smart, so funny and such a true fan of the artists and music. His impact on the show has been truly spectacular, and we can’t wait to do it together one last time.”\n\nA total of 95 awards are being presented in two Grammy ceremonies, starting with the Premiere Ceremony, which was held earlier Sunday.\n\nHere’s a full list of winners across both ceremonies.\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nRosé Makes History, Kicking Off 2026 Grammy Awards With Electric “APT” Performance Featuring Bruno Mars\n\nThe Story Behind Billie Eilish, Justin and Hailey Bieber Wearing “ICE OUT” Pins at the Grammys\n\nSteven Spielberg\n\nSteven Spielberg Achieves EGOT Status After Landing First Grammy Win\n\nTrevor Noah\n\nWatch the Grammys Red Carpet Livestream\n\nGrammys Finally Award K-pop as ‘KPop Demon Hunters’ Hit “Golden” Scores First Win\n\nGrammy Awards: Winners List (Updating Live)\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2026 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"The best jokes from the six-time host's opening monologue at the 2026 Grammys.","url":"https://www.hollywoodreporter.com/music/music-news/grammys-host-trevor-noah-monologue-jokes-1236491864/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2026/01/Trevor-Noah_PC-Michael-SchwartzCBS-2021-CBS-Broadcasting-Inc.-All-Rights-Reserved92-H-2026.jpg","video":null,"publish_date":"2026-02-02 01:34:56","author":"James Hibberd","authors":["James Hibberd"],"language":"en","category":"politics","source_country":"us","sentiment":0.302},{"id":398424458,"title":"Shares jittery in Asia as metals fluctuate ahead of earnings","text":"Volatile trading saw MSCI’s broadest index of Asia-Pacific shares outside Japan slip 0.7%, while South Korea fell 1.0%. (EPA Images pic)\nSYDNEY: Asian share markets mostly followed Wall Street futures lower on Monday as chaotic trading in silver made for a nervous start to a week that is packed with corporate earnings, central bank meetings and major economic data.\nSilver lost another 5% at one stage, as Friday's 30% plunge squeezed leveraged positions in what had become a very crowded trade. Dealers also pointed to a halt in trading of the UBS SDIC silver futures fund in China as one cause of the rout.\nOil prices also fell by almost 3% as President Donald Trump said over the weekend Iran was \"seriously talking\" with Washington, perhaps lessening the risk of a US military strike on the country.\nThe jitters saw MSCI's broadest index of Asia-Pacific shares outside Japan ease 0.7%, with South Korea down 1.0%.\nJapan's Nikkei was a rare gainer, adding 0.7% as opinion polls suggested Prime Minister Sanae Takaichi's Liberal Democratic Party was likely to score a landslide victory in next week's lower house election.\nSuch a victory would likely make it easier to push through aggressive stimulus policies, while also easing political uncertainty in general. More debt-funded spending could pressure bonds and the yen, with Takaichi talking up the benefits of a weaker currency for exports.\nIt was also a busy week for earnings in Europe, with around 30% of Euro STOXX market capitalisation due to report. EUROSTOXX 50 futures and DAX futures both eased 0.1%, while FTSE futures held steady.\nS&P 500 futures dipped 0.2% and Nasdaq futures fell 0.4%, with about one quarter of the S&P 500 set to report this week. Growth in S&P 500 earnings per share is running at 11% on the previous year, when consensus had been for 7%.\nThe focus will be on tech majors Alphabet, Amazon and AMD, particularly costs and benefits of AI in the wake of Microsoft's badly received results.\nAnalysts at Goldman Sachs noted consensus estimates for AI hyperscaler capex this year had climbed to US$561 billion, up 38% on 2025 and compared to US$540 billion expected at the start of earnings season.\nDollar steadies for now\nIn currencies, the dollar looked a little steadier at US$1.1847 per euro after Friday's 1% bounce. It was aided by broad weakness in the yen, which saw it edge up 0.3% to 155.17 yen.\nThe rally had been initially triggered by Trump's choice of former Federal Reserve governor Kevin Warsh to become the next chair of the central bank.\nAnalysts assumed Warsh was less likely to press for all-out rapid rate cuts than some other possible choices, though he has sounded more dovish than current chair Jerome Powell.\n\"Trump is most unlikely to have nominated Warsh if he was not genuinely supportive of lower interest rates, and for which there is plenty of evidence Warsh believes that the economy can achieve higher rates of non-inflationary growth,\" said Ray Attrill, head of FX strategy at NAB.\nWhich was why market pricing remained at two rate cuts for this year, with a move seen unlikely until June when, presumably, Warsh will be chair. Futures imply a 68% chance of a steady outcome at the April meeting and, oddly, 68% for an easing in June.\nThat outlook may change should the January payrolls report on Friday surprise significantly in either direction, assuming the government is open and it is actually released.\nAlso on the menu this week are policy meetings by the Reserve Bank of Australia, European Central Bank and Bank of England.\nThe RBA is an outlier in that markets imply around a 75% chance it will raise interest rates by a quarter point to 3.85%, so reversing one of three cuts delivered last year, in an attempt to quell resurgent inflation.\nIn commodity markets, volatility was the main theme as gold fell 1.4% to US$4,807 an ounce, having shed almost 10% on Friday. After an early dive, silver steadied at US$84.62 but trade was extremely choppy.\nOil prices fell as investors waited anxiously to see whether the US would strike Iran, or some sort of deal could be struck.\nBrent slid 2.7% to US$67.46 a barrel, while US crude dropped 2.8% to US$63.38 per barrel.","summary":"Chaotic trading in silver sets a nervous tone as the recent 30% plunge squeezes leveraged positions in a crowded trade.","url":"https://www.freemalaysiatoday.com/category/business/2026/02/02/shares-jittery-in-asia-as-metals-fluctuate-ahead-of-earnings","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/0e2bdaa7-korea-market.jpg","video":null,"publish_date":"2026-02-02 01:33:06","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"my","sentiment":-0.168},{"id":398423514,"title":"Trump backs former critic Sununu in high-stakes swing state Senate race","text":"President Donald Trump on Sunday endorsed former Sen. John E. Sununu of New Hampshire, a longtime GOP Trump critic, over one of his first-term ambassadors, former Sen. Scott Brown, in a crucial Senate race that's one of a handful that may determine the Senate majority in the midterm elections. Sununu, who was praised by Trump as an \"America First Patriot\" who \"will work tirelessly to advance our America First Agenda,\" is seen by top Senate Republicans as the strongest candidate to flip the seat held by longtime Democratic Sen. Jeanne Shaheen, who is retiring at the end of this year rather than seek re-election to a fourth six-year term. \"John E. Sununu has my Complete and Total Endorsement — HE WILL NOT LET YOU DOWN. MAKE AMERICA GREAT AGAIN — ELECT JOHN E. SUNUNU,\" Trump emphasized, in a post on social media. Sununu is a former three-term representative who defeated then-Gov. Shaheen in New Hampshire's 2002 Senate election. But the senator lost to Shaheen in their 2008 rematch. DEMOCRATS EYE NARROW PATH TO CAPTURE SENATE MAJORITY, BUT ONE WRONG MOVE COULD SINK THEM \"I want to thank the President for his support and thank the thousands of Granite Staters who are supporting me,\" Sununu said after landing Trump's endorsement. The endorsement will further boost Sununu, who enjoys a polling and fundraising advantage over Brown. After Trump's endorsement, the Senate Leadership Fund, which is aligned with Senate Majority Leader John Thune, said on X that \"John Sununu is the clear choice to be New Hampshire's next US Senator, and President Trump's critical endorsement has put an end to the primary.\" TIM SCOTT TELLS MAGA VOTERS TRUMP ‘IS ON THE BALLOT’ AS GOP FIGHTS TO GROW SENATE MAJORITY IN 2026 But Brown, as of now, has no intentions of dropping out. \"I’ve always believed that the people of New Hampshire are the ultimate authority on our future, and they deserve a choice between candidates seeking to earn their support,\" he said in a statement. And apparently questioning Sununu's MAGA credentials, he added, \"I am running to ensure our America First agenda is led by someone who views this mission not as a career path, but as a continuation of a lifelong commitment to service.\" Brown emphasized, \"My priorities for New Hampshire remain clear: a stronger economy, a secure border, reliable and affordable energy and better health care for our veterans. This mission has always been about you, not me. Let’s keep working!\" Sununu is a brand name in New Hampshire politics. His father, John H. Sununu, is a former governor who later served as chief of staff in then-President George H.W. Bush's White House. And one of his younger brothers is former Gov. Chris Sununu, who won election and re-election to four two-year terms steering the Granite State. FIRST ON FOX: SUNUNU LAUNCHES BID TO RETURN TO SENATE But Sununu has a long history of backing Trump rivals. He served as national co-chair on the 2016 Republican presidential campaign of then-Ohio Gov. John Kasich, who declined to support Trump as the party's nominee. And Sununu, along with then-Gov. Chris Sununu, endorsed former ambassador and former South Carolina Gov. Nikki Haley in the 2024 New Hampshire Republican presidential primary, as she battled Trump for the nomination. And on the eve of the first-in-the-nation presidential primary, the former senator wrote an opinion piece titled \"Donald Trump is a loser,\" that ran in the New Hampshire Union Leader, the state's largest daily newspaper. Brown endorsed Trump ahead of his 2016 New Hampshire primary victory, which launched him toward the GOP presidential nomination and ultimately the White House. Brown later served as U.S. ambassador to New Zealand during Trump's first term. Some in New Hampshire's MAGA base immediately rejected the president's endorsement of Sununu, calling it a \"slap in the face to grassroots supporters\" who have long backed Trump. \"The Sununu family openly mocked, degraded, and worked against the America First movement, the President himself, and the policies that energized New Hampshire voters,\" a group of MAGA activists posted on X. \"We will continue and intensify our campaign opposition to the Sununu operation.\" Brown formally launched his Senate campaign in June, after over six months of reaching out to grassroots supporters in the state. He raised roughly $1 million during his first three months as a candidate. Sununu jumped into the race in late October, with the backing of the National Republican Senatorial Committee (NRSC), which is the Senate GOP's campaign arm. FIRST ON FOX: BROWN SHOWCASES HEALTHY FUNDRAISING HAUL NRSC chair Sen. Tim Scott said at the time that Senate Republicans were \"all-in\" for Sununu. Since then, Sununu has landed the backing of a majority of the Republicans in the Senate, as well as from GOP leaders in New Hampshire. The seat in New Hampshire, along with an open Democrat-held seat in Michigan are two of the NRSC's top targets this year as they aim to expand their 53-47 majority in the chamber. Georgia, where the GOP views Democratic Sen. Jon Ossoff as very vulnerable, is the NRSC's other top target. Sununu more than doubled Brown's fundraising haul during the past three months, and the latest public opinion polls in New Hampshire indicate Sununu with a double-digit lead over Brown in the GOP primary, which won't be held until September. Pappas, a four-term congressman who represents the eastern half of the state, outraised both Sununu and Brown combined during the 4th quarter of 2025 fundraising. CLICK HERE TO GET THE FOX NEWS APP And the latest polls indicate Pappas topping Sununu by single digits and Brown by double digits in hypothetical general election matchups. Pappas is the clear front-runner for his party's nomination, in a race that also includes Karishma Manzur, a member of the New Hampshire Democratic Party's rules committee.","summary":"President Trump endorsed former critic John Sununu over ally Scott Brown in crucial New Hampshire GOP Senate primary that could determine chamber control.","url":"https://www.foxnews.com/politics/trump-backs-former-critic-sununu-high-stakes-swing-state-senate-race","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/john-e-sununu-rye-new-hampshire-oct.-24-2025.jpg","video":null,"publish_date":"2026-02-02 01:32:09","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":0.131},{"id":398424242,"title":"Indian stock market: 8 key things that changed for market overnight - Gift Nifty, US dollar to gold and silver prices","text":"The Indian stock market benchmark indices, Sensex and Nifty 50, are expected to open higher on Monday, taking a breather from previous session’s crash, with volatility likely to remain elevated, as investors react to the Union Budget 2026 proposals.Asian markets traded mixed, while the US stock market ended lower, with stock futures declining.On Sunday, the Indian stock market crashed in the special trading session after the announcement of the Budget proposal to increase the Securities Transaction Tax (STT) on F&O trading.The Sensex cracked 1,546.84 points, or 1.88%, to close at 80,722.94, while the Nifty 50 settled 495.20 points, or 1.96%, lower at 24,825.45.“While the lack of immediate consumption stimuli and increased transaction costs in financial markets (increase in STT) may pose challenges in the near term. This budget has been a balancing act, given the fiscal constraints. Here onwards, RBI’s role in implementing liquidity measures to stabilise borrowing costs and support the bond markets will be a key monitorable,” said Sandeep Das, MD & CEO Centrum Wealth.Here are key global market cues for Sensex today:Asian MarketsAsian markets traded mixed on Monday ahead of China’s factory activity data. Japan’s Nikkei 225 rose 0.13%, while the Topix gained 0.52%. South Korea’s Kospi declined 2.5%, and the Kosdaq plunged 3%. Hong Kong Hang Seng index futures indicated a lower opening.Gift Nifty TodayGift Nifty was trading around 24,902 level, a premium of nearly 49 points from the Nifty futures’ previous close, indicating a higher start for the Indian stock market indices.Wall StreetUS stock market ended lower on Friday as investors viewed President Donald Trump’s nomination of former Federal Reserve Governor Kevin Warsh as a hawkish choice.The Dow Jones Industrial Average fell 179.09 points, or 0.36%, to 48,892.47, while the S&P 500 declined 29.98 points, or 0.43%, to 6,939.03. The Nasdaq Composite closed 223.30 points, or 0.94%, lower at 23,461.82.For the week, the S&P 500 rose 0.3%, the Dow fell 0.4% and the Nasdaq fell 0.2%. For the month, S&P 500 gained 1.4%, Nasdaq rose 0.9% and the Dow Jones rallied 1.7%.Japan PMIJapan’s manufacturing activity grew at the fastest pace in about three and a half years in January. The S&P Global Japan Manufacturing Purchasing Managers’ Index (PMI) rose to 51.5 in January from 50.0 in December, the strongest level since August 2022.Japanese Bond YieldsJapanese government bonds (JGBs) fell and the yields rose. The 20-year JGB yield climbed 2.5 basis points (bps) to 3.2%, while the five-year yield rose 2.5 bps to 1.680%.DollarThe US dollar index steadied at 97.22 after jumping 1% on Friday. The Japanese yen was down 0.4% to 155.39 per dollar. Euro last stood at $1.1848, while Sterling was down 0.05% to $1.3680.Gold PricesGold prices extended fall, pressured by a firm dollar, while silver price recovered from a more than three-week low hit. Spot gold price fell 1.5% to $4,793.97 per ounce, while US gold futures for February delivery climbed 1.6% to $4,818.10 per ounce. Spot silver price rose 1.6% to $85.98 an ounce.MCX gold rate for April futures ended lower by ₹4,242, or 2.87%, at ₹1,48,104 per 10 grams on Sunday. MCX silver price for March futures expiry closed at a 9% lower circuit of ₹2,65,652 per kg, down by ₹26,273.Crude Oil PricesCrude oil prices fell by over $1 per barrel as US President Donald Trump said over the weekend Iran was “seriously talking” with Washington. Brent crude futures fell 2.7% to $67.48 per barrel, while US West Texas Intermediate crude price declined 2.8% to $63.41 per barrel.(With inputs from Reuters)","url":"https://www.livemint.com/market/stock-market-news/indian-stock-market-8-key-things-that-changed-for-market-overnight-gift-nifty-us-dollar-to-gold-and-silver-prices-11769968687035.html","image":"https://www.livemint.com/lm-img/img/2026/02/01/1600x900/logo/GLOBAL-MARKETS--6_1769968716345_1769968723579.JPG","video":null,"publish_date":"2026-02-02 01:28:15","author":"Ankit Gohel","authors":["Ankit Gohel"],"language":"en","category":"business","source_country":"in","sentiment":-0.03},{"id":398422132,"title":"Trevor Noah Shades Diddy, Nicki Minaj in Final Monologue at 2026 Grammys","text":"Trevor Noah poked fun at a plethora of celebrities — including Sean “Diddy” Combs and Nicki Minaj — during his final monologue as Grammys host.\nNoah, 41, kicked it off on Sunday, February 1, by mentioning Lauryn Hill’s first performance at the Grammys since 1999, saying, “Do you understand how long ago that was? Back in 1999, the President had a sex scandal, people thought computers were about to destroy the world and Diddy was arrested. Boy, how times have changed.”\nThe host continued to bring attention to other celebrities. He mentioned Justin Bieber’s return after a four-year absence, adding, “I think better than any Grammy, he has come back as a new dad. … My personal favorite thing that Justin has done is he told Apple to move the dictation button on the keyboard.”\nNoah then shifted his focus to Justin’s wife, Hailey Bieber. “Do you have a discount code for the Rhode lip tint?” he quipped.\nElsewhere in his monologue, Noah brought up Minaj’s absence, joking, “She is not here. She is still at the White House with Donald Trump discussing very important issues.”\nThe 68th annual Grammy Awards marked Noah's sixth and final run as host. Grammys executive producer Ben Winston recently confirmed that Noah would not be taking on the role again in the future.\n“I am beyond thrilled to welcome Trevor Noah back to host the Grammys for his sixth, and sadly, final time,” Winston said in a January statement. “He’s been the most phenomenal host of the show. He’s so smart, so funny, and such a true fan of the artists and music. His impact on the show has been truly spectacular, and we can’t wait to do it together one last time.”\nIn addition to taking the stage as a host, Noah has been nominated at the Grammys four times. He previously scored nods in the Best Comedy Album category for “Trevor Noah: Son of Patricia,\" \"Trevor Noah: I Wish You Would\" and \"Trevor Noah: Where Was I.\"\nNoah is also up for a Grammy this year for his \"Into The Uncut Grass\" audiobook. He previously found success for his work on The Daily Show. Noah became the Senior International Correspondent in 2014 before taking over for Jon Stewart as the host one year later.\n“Many people are part of the reason that I’m sitting here today, but above all, I would be remiss if I didn’t acknowledge one man, and that’s Jon Stewart,” he said at the time. “Thank you, Jon. Thank you for believing in me. I’m not quite sure what you saw in me, but I’ll work hard every day to find it, and I’ll make you not look like the crazy old dude who left his inheritance to some random kid from Africa.”\nNoah announced in 2022 that he would be leaving the show. \"There’s another part of my life that I want to continue exploring,\" he said on The Daily Show about his departure. “The point is, I want to say thank you. Because man, I never dreamed that I would be here.”","url":"https://www.usmagazine.com/entertainment/news/trevor-noah-shades-diddy-nicki-minaj-in-final-monologue-at-2026-grammys/","image":"https://www.usmagazine.com/wp-content/uploads/2026/02/Trevor-Noah-Shades-Diddy-Legal-Issues-Nicki-Minaj-During-His-Final-Monologue-as-Grammys-Host-2026-Grammy-Awards.jpg?crop=0px%2C0px%2C2000px%2C1131px&resize=1200%2C675&quality=86&strip=all","video":null,"publish_date":"2026-02-02 01:26:35","author":"Yana Grebenyuk","authors":["Yana Grebenyuk"],"language":"en","source_country":"us","sentiment":0.183},{"id":398423516,"title":"Trevor Noah roasts Nicki Minaj's Trump ties during Grammy Awards opening monologue ceremony","text":"Trevor Noah took aim at Nicki Minaj's new association with President Donald Trump while opening the 68th annual Grammy Awards Sunday in Los Angeles, Calif. After welcoming Justin and Hailey Bieber, Billie Eilish, Pharrell Williams and Tyler the Creator to the 2026 Grammy Awards at Crypto.com Arena, Noah assured the crowd, \"Nicki Minaj is not here.\" As the crowd erupted in cheers, Noah added, \"She is still at the White House with Donald Trump, discussing very important issues.\" The former Daily Show host impersonated Trump during his sixth and final run as host, and said, \"Actually Nicki, I have the biggest a--. I know they say it's you, but it's me.\" NICKI MINAJ CALLS HERSELF TRUMP'S ‘NO. 1 FAN’ AS HAND HOLDING MOMENT GOES VIRAL AT TREASURY EVENT Minaj and Trump went viral Wednesday after they were photographed holding hands at the U.S. Treasury Department's Trump Accounts Summit. The \"Starships\" singer also called herself Trump's \"number one fan.\" GRAMMY AWARDS 2026: SABRINA CARPENTER AND ADDISON RAE SHINE ON RED CARPET Kendrick Lamar leads nominations with nine nods, followed closely by Lady Gaga, Jack Antonoff and Cirkut who each have seven nominations. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS Each best new artist nominee is set to perform, including Leon Thomas, Olivia Dean, Katseye, The Marías, Addison Rae, sombr, Alex Warren and Lola Young. Justin Bieber returns to the stage Sunday as a scheduled performer, in addition to Bruno Mars, Rosé, Tyler, the Creator, Lady Gaga, Sabrina Carpenter, Clipse and Pharrell Williams. Reba McEntire, Brandy Clark and Lukas Nelson are set to perform the in memoriam segment, with Ms. Lauryn Hill paying tribute to D’Angelo and Roberta Flack. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Post Malone, Andrew Watt, Chad Smith, Duff McKagan and Slash will honor Ozzy Osbourne.","summary":"Trevor Noah roasts Nicki Minaj&apos;s Trump ties while hosting the 2026 Grammy Awards in Los Angeles, featuring Pharrell Williams, Lady Gaga, and Justin Bieber.","url":"https://www.foxnews.com/entertainment/trevor-noah-roasts-nicki-minajs-trump-ties-during-grammy-awards-opening-monologue-ceremony","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/02/grammys-trevor-noah.jpg","video":null,"publish_date":"2026-02-02 01:25:52","author":"Tracy Wright","authors":["Tracy Wright"],"language":"en","source_country":"us","sentiment":0.621},{"id":398423576,"title":"Trump 'hopeful' Iran will 'make a deal', says failure will show if Khamenei's 'regional war' warning was right","text":"Florida: US President Donald Trump on Sunday said he was \"hopeful\" that Iran would \"make a deal\" with Washington, hours after Iranian Supreme Leader Ayatollah Ali Khamenei warned that any conflict initiated by the United States would turn into a \"regional war\". .Trump added that if the deal does not go through, it would become clear whether Khamenei's warning was correct..Speaking to reporters at his Mar-a-Lago residence in Florida, Trump said the US had deployed significant military assets in the region but preferred a diplomatic outcome amid escalating tensions between the two countries..\"We have the biggest, most powerful ships in the world over there, very close, and in a couple of days, hopefully, we'll make a deal. If we don't make a deal, then we'll find out whether or not he was right,\" Trump said..Trump's remarks came in response to a series of strong statements by Iran's Supreme Leader in a series of posts on X, who warned Washington against military action, stating that Washington should understand that any war would not remain limited..\"The Americans should know if they start a war, this time it will be a regional war,\" Khamenei's post read, adding that Iran would not be intimidated by threats involving warships or aircraft..\"That Americans sometimes talk about war - saying we will come with warships and aircraft - is nothing new. The Iranian nation is not affected by such talk. They shouldn't try to intimidate the Iranian nation with such things,\" his post added..Iran does not seek conflict: Khamenei.Khamenei said Iran does not seek conflict but would respond forcefully to any aggression and further accused the United States of attempting to dominate Iran due to its strategic resources and location..\"We are not the initiators of war. We do not seek to oppress anyone. We do not seek to attack any country. However, anyone who seeks to attack or cause harm will face a decisive blow from the Iranian nation,\" another post read..Iran-US tensions: Why the Strait of Hormuz is a potential flashpoint.\"What is the issue between the United States and Iran? The issue can be summed up in two words: The United States wants to devour Iran; the Iranian nation and the Islamic Republic prevent this,\" another post added..Referring to historical US influence in Iran, the Supreme Leader claimed Washington was trying to regain control after losing its grip decades ago..\"Iran possesses numerous attractions: Its oil, gas, rich minerals, and geographic location are attractive. The US wants to seize control of this country just as they controlled it before.\".\"For more than 30 years, the Americans were present in Iran. Iran's resources, oil, politics, and security were in their hands. Everything was in their hands. Now that their grip has been broken, they're trying to find a way back. The Iranian nation stands firm, preventing it,\" Khamenei stated in another post..Khamenei asserted that Iran would continue to resist US pressure, stating that the country \"stands firm and will continue to stand firm\" against what he described as American \"mischief and harassment\"..Earlier on Saturday, Trump, aboard Air Force One, stated that the US had deployed very powerful naval assets in the region, near Iran, but he hoped that negotiations would lead to an acceptable outcome..\"We do have very big, powerful ships heading in that direction, as you know. But I hope they negotiate something that's acceptable,\" Trump said..Meanwhile, the Secretary of Iran's Supreme National Security Council, Ali Larijani, in a post on X, said that preparations for negotiations with the US are moving forward, dismissing what he described as media-driven hype..Iran FM Araghchi says Tehran lost 'trust' with US as negotiating partner, seeks 'fair and equitable' deal.\"Contrary to the hype of the contrived media war, structural arrangements for negotiations are progressing,\" Larijani said in his post..However, the Secretary did not mention any details on the framework of the matter..Currently, a \"massive Armada\", led by the USS Abraham Lincoln, is heading towards Iran as tensions escalate between the two sides..On Friday, the US President indicated that Iran was prepared to enter negotiations to avert potential American military action, even as Tehran maintained that talks cannot proceed under pressure..\"They do want to make a deal,\" Trump stated, addressing reporters at the White House..'Do not repeat same mistake': Iran Foreign Minister Araghchi warns Trump amid tensions .He also disclosed that a deadline had been set for Iran to begin discussions on nuclear weapons, though he did not specify the timeframe..\"Hopefully, we'll make a deal. If we don't make a deal, we'll see what happens,\" Trump added, referencing the deployment of a US naval carrier group near Iran.","summary":"In reference to historical US influence in Iran, the Supreme Leader had earlier claimed Washington was trying to regain control after losing its grip decades ago.","url":"https://gulfnews.com/world/mena/trump-hopeful-iran-will-make-a-deal-says-failure-will-show-if-khameneis-regional-war-warning-was-right-1.500428439","image":"https://media.assettype.com/gulfnews/2026-02-01/f61o8n7f/ANI_20260201205000.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2026-02-02 01:22:32","author":"ANI","authors":["ANI"],"language":"en","category":"politics","source_country":"ae","sentiment":-0.36},{"id":398423184,"title":"Gold falls 1.5% on firm dollar, silver recovers from over three-week low","text":"Feb 2 (Reuters) - Gold extended falls on Monday, pressured by a firm dollar, as investors gauged U.S. President Donald Trump's Fed chair pick Kevin Warsh's approach to interest rate cuts, while silver recovered from a more than three-week low hit on Friday. FUNDAMENTALS * Spot gold was down 1.5% at $4,793.97 per ounce, as of 0046 GMT, after touching a more than one-week low on Friday. Bullion scaled a record high of $5,594.82 on Thursday. * U.S. gold futures for February delivery climbed 1.6% to $4,818.10 per ounce. * Spot silver rose 1.6% to $85.98 an ounce. It hit a record high of $121.64 on Thursday. * The dollar clung onto its gains as investors weighed what a U.S. Federal Reserve under Warsh might look like, with his preference for a smaller balance sheet. [USD/] * A stronger dollar makes greenback-priced gold less affordable for holders of other currencies. * Warsh checks a long list of boxes for Trump as his pick to run the Fed, with longstanding political and social ties to the president, deep Wall Street connections and a well-tailored demeanour. * But how deeply and quickly he will cut interest rates and how aggressively he will pursue his \"regime change\" at the Fed remain open questions. * U.S. economic data on Friday showed that producer prices increased by the most in five months in December amid some pass-through from import tariffs, suggesting inflation could pick up in the months ahead and allow the Fed to keep rates steady for a while. * Investors still expect at least two rate cuts in 2026. [FEDWATCH] * Non-yielding bullion tends to perform better in low-interest-rate environments * Spot platinum lost 2% to $2,120.05 per ounce after hitting a record $2,918.80 on January 26, while palladium shed 0.9% to $1,682.59. DATA/EVENTS (GMT) 0030 Japan S&P Global Mfg PMI Final SA Jan 0145 China RatingDog Manufacturing PMI Final Jan 0700 UK Nationwide house price mm, yy Jan 0850 France HCOB Manufacturing PMI Jan 0855 Germany HCOB Mfg PMI Jan 0950 EU HCOB Mfg Final PMI Jan 0930 UK S&P GLOBL MANUFACTURING PMI Jan 1445 US S&P Global Mfg PMI Final Jan 1500 US ISM Manufacturing PMI Jan (Reporting by Ishaan Arora in Bengaluru; Editing by Subhranshu Sahu)","url":"https://www.marketscreener.com/news/gold-falls-1-5-on-firm-dollar-silver-recovers-from-over-three-week-low-ce7e5bddda8fff27","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2026-01/2026-01-27T022637Z_1_LYNXMPEM0Q04I_RTROPTP_4_GLOBAL-PRECIOUS.JPG","video":null,"publish_date":"2026-02-02 01:22:24","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"fr","sentiment":-0.021},{"id":398423392,"title":"Trevor Noah Roasts Nicki Minaj at Grammys for Going MAGA: ‘She’s Still at the White House With Donald Trump’","text":"Although Trevor Noah usually keeps his Grammy hosting duties free of political discussion, he used his enthusiastic opening monologue to poke fun at Nicki Minaj’s recent turn to fawning over Donald Trump. After lightly joking with scores of superstars in the audience, Noah pointed out that the A-list rapper wasn’t at the award show. “Nicki […]","summary":"Although Trevor Noah usually keeps his Grammy hosting duties free of political discussion, he used his enthusiastic opening monologue to poke fun at Nicki Minaj&#8217;s recent turn to fawning over Donald Trump. After lightly joking with scores of superstars in the audience, Noah pointed out that the A-list rapper wasn&#8217;t at the award show. &#8220;Nicki [&#8230;]","url":"https://variety.com/2026/music/news/trevor-noah-nicki-minaj-grammys-trump-maga-1236641769/","image":"https://variety.com/wp-content/uploads/2026/02/Trevor-Noah-Monologue-Grammys.jpg","video":null,"publish_date":"2026-02-02 01:19:31","author":"William Earl","authors":["William Earl"],"language":"en","category":"politics","source_country":"us","sentiment":0.322},{"id":398424712,"title":"Kennedy Center to close for two years for renovations, Trump says","text":"Kennedy Center to close for two years for renovations, Trump says\n\nThe Kennedy Center in Washington DC will be closed for a two-year renovation beginning in July, President Donald Trump has announced.\n\nIn a post on Truth Social on Sunday, Trump said the centre would close on 4 July this year \"in honor of the 250th Anniversary of our Country\". \n\nThe move follows several artists cancelling performances at the storied institution after it was recently renamed as the Trump Kennedy Center.\n\nShortly after taking office, the president fired several of the board members at the centre and replaced them with allies, who then voted to make Trump chairman of the board.\n\nThe new board renamed the institution the Donald J Trump and the John F Kennedy Memorial Center for the Performing Arts in December. New signage appeared on the building's exterior the following day.\n\nSeveral musical acts, including Steven Schwartz, the composer of the musical Wicked, and a group called Doug Varone and the Dancers, cancelled performances at the centre in the following weeks because of the Trump name change. \n\nOn Thursday, the venue hosted a premiere screening of a documentary about first lady Melania Trump.\n\nTrump has said there would be a \"scheduled grand reopening\" for the facility, and that the renovations had already been financed. \n\n\"I have determined that The Trump Kennedy Center, if temporarily closed for construction, revitalization, and complete rebuilding, can be, without question, the finest performing arts facility of its kind, anywhere in the world,\" he wrote on Truth Social. \n\n\"In other words, if we don't close, the quality of construction will not be nearly as good, and the time to completion, because of interruptions with Audiences from the many events using the facility, will be much longer.\"\n\nTrump had lambasted the physical state of the centre and worked with Congress to allocate more than $250m (£182m) to rebuild it, one of many renovation projects he has taken on in his second term. \n\nSome US lawmakers and legal scholars have argued that because the centre was named in a 1964 law, Congress must have a say on any name change.\n\nLast December Democratic US Representative Joyce Beatty filed a lawsuit seeking to remove Trump's name for that reason. \n\nSome members of President John F Kennedy's family too have denounced the move. The centre was named in Kennedy's memory shortly after his assassination.\n\nJoe Kennedy III, a former US House of Representatives member and grandnephew of the late president, said the venue was \"a living memorial to a fallen president and named for President Kennedy by federal law\".","url":"https://www.bbc.com/news/articles/c1ev53zyww2o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/fb74/live/d272cf80-ffd2-11f0-8af4-99b156a79215.jpg","video":null,"publish_date":"2026-02-02 01:13:12","author":"Madeline Halpert","authors":["Madeline Halpert"],"language":"en","source_country":"gb","sentiment":-0.398},{"id":398424462,"title":"Counting begins in Costa Rica vote dominated by narco violence","text":"The Sovereign People party’s presidential candidate, Laura Fernandez, casts her vote at a San Jose polling station. (EPA Images pic)\nSAN JOSE: Vote counting began Sunday evening in Costa Rica after elections dominated by a surge in narco-trafficking and promises of a crackdown from the conservative frontrunner.\nLaura Fernandez, the ruling party candidate, is the runaway favourite to become the next leader of a country long seen as a beacon of stability in a volatile region, but now battling a crime wave.\nPolls ahead of the election showed that Fernandez, who takes inspiration from Nayib Bukele, the iron-fisted president of nearby El Salvador, could secure the 40% of votes required for a first-round victory.\nA total of 20 candidates are running for the top job.\nFernandez is the protege of popular outgoing President Rodrigo Chaves, under whom she served as planning minister and chief of staff.\nA victory for the 39-year-old political scientist would confirm a rightward lurch in Latin America, where conservatives in Chile, Bolivia and Honduras have come to power in recent months.\nChaves has deflected criticism for a dramatic rise in the murder rate on his watch by placing the blame on what he sees as an overly-permissive judiciary.\nCosta Rica has gone from being a transit point for cocaine shipments to a logistics hub for Mexican and Colombian cartels, with a spillover of the drug trade into local communities.\nThe number of homicides jumped 50% in the past six years to 17 per 100,000 inhabitants.\nJessica Salgado, 27, said she voted for Fernandez as the continuity candidate, because she felt the government was on the right track, even if violence is on the up.\n\"The violence exploded because they (the government) are going after the ringleaders, it's like dragging rats out of the sewer,\" Salgado told AFP.\nHer sister Kenia, 24, voted for an opposition candidate, however, saying more investment in education and healthcare was needed so that young people \"don't go down the wrong path\" into crime.\nSeeking outright majority\nFernandez is hoping to win a big enough parliamentary majority to change the constitution and overhaul the judiciary.\nHer detractors fear she could try to change the charter to allow her mentor Chaves to return as president after her four-year mandate ends.\nUnder the current constitution, he is barred from seeking re-election until he has been out of power for eight years.\nAs he voted, former president Oscar Arias, winner of the 1978 Nobel Peace Prize, warned that the \"survival of democracy\" was at stake.\n\"The first thing dictators want to do is to reform the Constitution to stay in power,\" he said, alluding to Chaves.\nFernandez insisted she would \"safeguard democratic stability.\"\nCocaine-smuggling hub\nThe drug trade has sucked in the high-density \"precarios\" (informal settlements) of cities such as the capital San Jose, where shootouts between rival drug gangs are increasingly frequent.\nFernandez has vowed to complete construction of a maximum-security prison modelled on Bukele's brutal CECOT penitentiary.\nShe has also promised to stiffen prison sentences and to impose a state of emergency in areas worst hit by crime.\nThe opposition compares the confrontational, anti-elite discourse of Fernandez and Chaves to that of Bukele and US President Donald Trump.\nBukele is a hero for many in Latin America, credited with restoring security to a nation traumatised by crime.\nHe has rounded up more than 90,000 people since March 2022 as part of his war on gangs, with rights groups saying that many of those detained are innocent or minors.\nAbout 8,000 of those arrested were later released.\n\"At what point did we go from dreaming of being the Switzerland of Central America to dreaming of being El Salvador?\" left-wing presidential candidate Ariel Robles, who is running a distant second behind Fernandez, said during the campaign.\nAnother contender, centrist economist Alvaro Ramos, warned that \"modern dictatorships don't always arrive with tanks.\"","summary":"Ruling party candidate Laura Fernandez is the favourite to lead a nation long seen as stable, now facing a crime wave.","url":"https://www.freemalaysiatoday.com/category/world/2026/02/02/counting-begins-in-costa-rica-vote-dominated-by-narco-violence","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/86621633-laura-fernandez.jpg","video":null,"publish_date":"2026-02-02 01:12:53","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":-0.104},{"id":398424722,"title":"Burkina Faso, Mali and Niger have turned to Russia. Now the US wants to engage","text":"Three West African juntas have turned to Russia. Now the US wants to engage them\n\nThe US has declared a stark policy shift towards three West African countries which are battling Islamist insurgents and whose military governments have broken defence ties with France and turned towards Russia.\n\nThe state department announced that Nick Checker, head of its Bureau of African Affairs, would visit Mali's capital Bamako to convey the United States' \"respect for Mali's sovereignty\" and chart a \"new course\" in relations, moving \"past policy missteps\".\n\nIt adds that the US also looks forward to co-operating with Mali's allies, neighbouring Burkina Faso and Niger, \"on shared security and economic interests\".\n\nAbsent from the agenda is the longstanding American concern for democracy and human rights. The Biden administration had halted military co-operation after coups deposed the elected civilian presidents of all three countries between 2020 and 2023, with Niger's Mohamed Bazoum still locked up in his own residence.\n\nThe US statement makes explicit a radical change in policy that had become increasingly evident over the 12 months since Donald Trump returned to the White House. \n\nThe shift started with the shuttering of USAID – a key provider of development support to the region – days after the president was sworn in for a new term.\n\nThis was followed by repeated signals of a much narrower focus on security and mineral resources, with both development and governance sidelined.\n\nThe announcement of Checker's visit goes further in openly declaring respect for Mali's sovereignty. The message will resonate in Bamako and allied capitals, where military leaders have built their appeal by striking pan-Africanist themes and rejecting former colonial power France.\n\nBurkina Faso's military leader, Capt Ibrahim Traoré, presents himself as a standard-bearer in resisting \"imperialism\" and \"neo-colonialism\". Through vigorous social media promotion, he has gained huge support for this stance and personal popularity among young people across the continent and beyond.\n\nThe Trump administration has made plain that it is unconcerned by the regimes' rejection of the European-style constitutional model of elected civilian government.\n\nMassad Boulos, senior adviser for Africa at the state department and a Trump confidant, last year told the French newspaper Le Monde: \"Democracy is always appreciated, but our policy is not to interfere in the internal affairs of other countries. People are free to choose whatever system is appropriate for them.\"\n\nThis attitude marks a stark change.\n\nDuring the Biden era Gen Michael Langley, head of the US military's Africa Command (Africom) from 2022 to 2025, stressed the importance of good governance and environmental issues, as complements to military support.\n\nHowever last year, following Trump's return to the presidency, he said that supporting the fight against terrorism was now the main focus. \n\nAnd that certainly seems to be the priority in West Africa, a message reiterated by Rudolph Attalah, a senior counter-terrorism official, on a visit to Bamako last year.\n\nThen last month Africom's deputy head, Gen John Brennan, confirmed that the US was continuing to actively support the three military-run countries in their struggle against jihadist groups, and Islamic State in particular.\n\nThe motives for Trump's shift in approach seem to be threefold.\n\nThe US, like Europe, remains seriously concerned about the long-term security threat posed by the jihadist groups now operating across the Sahel - the semi-arid stretch of land south of the Sahara Desert. According to some definitions, the region now accounts for half of all the world's terrorism deaths.\n\nAlthough almost all the casualties are local, there is concern in the US that the governments' loss of control of much of their territory could allow the emergence of safe havens for jihadist groups to develop further and expand.\n\nDiplomats and analysts routinely now describe the region as the \"epicentre of global terrorism\", which could present a long-term international threat.\n\nIn the \"tri-border region\", where Mali, Burkina and Niger converge, the West African offshoot of Islamic State (Islamic State in the Greater Sahara, ISGS) is particularly active. \n\nA fresh reminder of the scale of threat that it poses came only last week with an attack on the airport in Niamey, Niger's capital.\n\nThe jihadist activity is also a threat to the Sahel's export of valuable or strategically important minerals: the region is a major producer of gold and Mali also produces lithium – a key ingredient in rechargeable batteries and also used in some medication – while Niger has significant uranium reserves. \n\nNiger's military government has seized control of the country's main uranium mine from the longstanding French operator, Orano, and is now lining up Russia as its new partner in the sector.\n\nThe Trump administration also appears concerned not to leave Russia to play the role of sole external defence partner of the three countries.\n\nUnlike the West African regional bloc Ecowas, France, the EU and the Biden administration, today's White House does not regard the Russian military presence as a threat to regional stability or human rights. Russia has deployed about 1,000 security contractors in Mali, with smaller contingents of mercenaries or regular troops in Burkina Faso and Niger.\n\nThere have been numerous allegations of abuses committed by the Russians, in particular in Mali.\n\nWhen Attalah visited Bamako, he signalled that Washington was quite relaxed about Moscow's military involvement.\n\nIt seems that Washington does not want to leave the field open for exclusively Russian influence and does now want to balance that with its own security partnership.\n\nStill, this will be on terms that will not unsettle Trump's political base, to whom he has repeatedly promised an end to US involvement in \"forever wars\" overseas. This is not about troops on the ground – save, perhaps, for occasional training teams.\n\nAfricom's Brennan says the US is providing Mali, Burkina and Niger with intelligence support and hints at the potential supply of weapons.\n\nBut Washington is not seeking to redeploy active forces or reopen the large drone base it built in Agadez, Niger, where it had around 800 troops. The junta expelled them after the Biden administration pressed for a roadmap to restore democracy.\n\nFollowing the spate of coups, Ecowas tried to pressure the military leaders into promising firm dates for new elections.\n\nBut in response Niger, Burkina and Mali withdrew from the bloc last year and they are now focused on building up their own confederation, the Alliance of Sahel States (AES).\n\nBecause they are no longer members, Ecowas has no responsibility for addressing their internal governance values.\n\nAnd this has freed its dozen remaining member states to themselves just try to rebuild practical co-operation with the three countries in the fight against Islamist groups.\n\nThis is a major priority for governments across the region, at a time when militants have been infiltrating over the borders, to stage attacks or hide in the north of countries such as Benin, Nigeria and Togo, Ghana and Ivory Coast.\n\nAs the region faces this daunting challenge, US intelligence on key targets, and perhaps extra weapons too, may help deliver some quick wins against the militants.\n\nBut - as France's decade-long deployment of thousands of troops and air power to the Sahel showed - high-tech military means alone cannot restore peace, unless the complex social and economic stresses in this desperately poor region of the world are also addressed.\n\nYou may also be interested in:\n\nGo to BBCAfrica.com for more news from the African continent.\n\nFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica","url":"https://www.bbc.com/news/articles/ckglwnrx437o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/cc98/live/4c323af0-ff8c-11f0-b5b6-6b2a047b2cea.jpg","video":null,"publish_date":"2026-02-02 01:12:17","author":"Paul Melly","authors":["Paul Melly"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.008},{"id":398423072,"title":"Trump: Don Lemon’s Arrest Is ‘The Best Thing That Could Have Happened To Him’","text":"President Donald Trump trashed Don Lemon and denied having advance knowledge that the ex-CNN host would be arrested last week. \n\nFederal authorities arrested Lemon on Thursday evening on federal civil rights charges in connection with his coverage of a protest at Cities Church in St. Paul, Minn., on Jan. 18. The charges included conspiracy and hampering the First Amendment rights of those worshiping at the church. \n\nAccording to Los Angeles Mayor Karen Bass, Lemon was ”released on his own recognizance.” His next court date is Feb. 9 in Minneapolis. \n\nWhile talking with reporters on Air Force One on Saturday, Trump said Lemon’s arrest was “the best thing that could happen to him” in his decades-long journalism career. \n\nWhen a reporter asked if he knew Lemon was going to be taken into custody, Trump said that he didn’t “know anything about the Don Lemon thing,” then described him as a “sleazebag.” \n\n“Everyone’s known that. He’s a washed up... Probably from his standpoint, the best thing that could happen to him,” Trump said. “He had no viewers. He was a failure; he was a failed host. And now, he’s in the news. I didn’t know anything about it.”\n\nMinutes after his release, Lemon vowed that he would not stop reporting.\n\n“I have spent my entire career covering the news. I will not stop now,” Lemon said. “There is no more important time than right now, this very moment, for a free and independent media that shines a light on the truth and holds those in power accountable.” \n\nLemon’s attorney Abbe Lowell accused the Trump administration of “wrongdoing” in a separate statement shared on Instagram.\n\n“Instead of investigating the federal agents who killed two peaceful Minnesota protesters, the Trump Justice Department is devoting its time, attention and resources to this arrest, and that is the real indictment of wrongdoing in this case,” Lowell said. “This unprecedented attack on the First Amendment and transparent attempt to distract attention from the many crises facing this administration will not stand.”\n\nGeorgia Fort, another reporter who covered the Jan. 18 protest at Cities Church, shared on her Facebook livestream that she was also arrested early on Friday. \n\nMedia and journalist advocacy groups have decried Lemon and Fort’s arrests, calling the matter “extremely alarming” and an “attack on the first amendment.”","url":"https://www.huffpost.com/entry/trump-don-lemon-arrest_n_697f7821e4b0bdc5d2a91460?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/697feaa41b0000bb776fe7b6.jpeg?ops=1778_1000","video":null,"publish_date":"2026-02-02 01:11:40","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"us","sentiment":-0.444},{"id":398423066,"title":"Trump: Don Lemon’s Arrest Is ‘The Best Thing That Could Have Happened To Him’","text":"President Donald Trump trashed Don Lemon and denied having advance knowledge that the ex-CNN host would be arrested last week. \n\nFederal authorities arrested Lemon on Thursday evening on federal civil rights charges in connection with his coverage of a protest at Cities Church in St. Paul, Minn., on Jan. 18. The charges included conspiracy and hampering the First Amendment rights of those worshiping at the church. \n\nAccording to Los Angeles Mayor Karen Bass, Lemon was ”released on his own recognizance.” His next court date is Feb. 9 in Minneapolis. \n\nWhile talking with reporters on Air Force One on Saturday, Trump said Lemon’s arrest was “the best thing that could happen to him” in his decades-long journalism career. \n\nWhen a reporter asked if he knew Lemon was going to be taken into custody, Trump said that he didn’t “know anything about the Don Lemon thing,” then described him as a “sleazebag.” \n\n“Everyone’s known that. He’s a washed up... Probably from his standpoint, the best thing that could happen to him,” Trump said. “He had no viewers. He was a failure; he was a failed host. And now, he’s in the news. I didn’t know anything about it.”\n\nMinutes after his release, Lemon vowed that he would not stop reporting.\n\n“I have spent my entire career covering the news. I will not stop now,” Lemon said. “There is no more important time than right now, this very moment, for a free and independent media that shines a light on the truth and holds those in power accountable.” \n\nLemon’s attorney Abbe Lowell accused the Trump administration of “wrongdoing” in a separate statement shared on Instagram.\n\n“Instead of investigating the federal agents who killed two peaceful Minnesota protesters, the Trump Justice Department is devoting its time, attention and resources to this arrest, and that is the real indictment of wrongdoing in this case,” Lowell said. “This unprecedented attack on the First Amendment and transparent attempt to distract attention from the many crises facing this administration will not stand.”\n\nGeorgia Fort, another reporter who covered the Jan. 18 protest at Cities Church, shared on her Facebook livestream that she was also arrested early on Friday. \n\nMedia and journalist advocacy groups have decried Lemon and Fort’s arrests, calling the matter “extremely alarming” and an “attack on the first amendment.”","url":"https://www.huffpost.com/entry/trump-don-lemon-arrest_n_697f7821e4b0bdc5d2a91460?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/697feaa41b0000bb776fe7b6.jpeg?ops=1778_1000","video":null,"publish_date":"2026-02-02 01:11:40","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"us","sentiment":-0.444},{"id":398424870,"title":"New Zealand Negotiating Critical Minerals Deal With the US","text":"New Zealand is in confidential negotiations with the United States on the supply of critical minerals after President Donald Trump issued a proclamation on Jan. 14 declaring that countries that didn’t sign a deal would be subject to tariffs.\n\nHaving officially joined a trading partnership last year, New Zealand has been designated a “foreign trading partner” and could face tariffs if it doesn’t negotiate.","url":"https://www.theepochtimes.com/world/new-zealand-negotiating-critical-minerals-deal-with-the-us-5978912?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2026/01/31/id5978969-GettyImages-2243453218-300x180.jpg","video":null,"publish_date":"2026-02-02 01:10:35","author":"Rex Widerstrom","authors":["Rex Widerstrom"],"language":"en","category":"politics","source_country":"us","sentiment":-0.126},{"id":398424866,"title":"New Zealand Negotiating Critical Minerals Deal With the US","text":"New Zealand is in confidential negotiations with the United States on the supply of critical minerals after President Donald Trump issued a proclamation on Jan. 14 declaring that countries that didn’t sign a deal would be subject to tariffs.\n\nHaving officially joined a trading partnership last year, New Zealand has been designated a “foreign trading partner” and could face tariffs if it doesn’t negotiate.","url":"https://www.theepochtimes.com/world/new-zealand-negotiating-critical-minerals-deal-with-the-us-5978912","image":"https://img.theepochtimes.com/assets/uploads/2026/01/31/id5978969-GettyImages-2243453218-300x180.jpg","video":null,"publish_date":"2026-02-02 01:10:35","author":"Rex Widerstrom","authors":["Rex Widerstrom"],"language":"en","category":"politics","source_country":"us","sentiment":-0.126},{"id":398424246,"title":"The violence in Iran could lead to civil war","text":"Eye-witnesses describe the aftermath of the protests and their repression as resembling a battlefield, with torched banks and mosques and overturned security vehicles. One claims that the university museum in Mashhad, Iran’s second city and a stronghold of the clerical regime, is in ruins. “Anything that serves as a means to tyranny and control was destroyed,\" says a protester. The regime’s humiliation of the dead is radicalising a public that had already turned violent. Even if America does not intervene against the regime, how can Iran hold together as a country in the aftermath of such bloodshed?\n\n For several hours on January 8th protesters controlled the streets of Tehran and other cities. “You couldn’t drive on the streets. There was fire here and there; debris, bricks, stones, destruction. As we marched, people bent all traffic sign posts, broke many of them and set all garbage bins on fire. All traffic cameras were broken. It was all amazing and beautiful vandalising,\" recalls the same protester. According to multiple accounts, masked men armed with knives killed basijis, the regime’s volunteer vigilantes. “It’s already a civil war,\" says a young woman in Mashhad. “We’re just not saying it.\"\n\n Might horror at the violent unravelling of their country pull Iranians back from the brink? There is little sign of it so far. The divisions in this large, multi-ethnic, multi-religious country are hardening. Iran’s rulers and their opponents accuse the other of hiring mercenaries: Shia militiamen from Iraq, say protesters; Israeli agents, says the regime. Each side threatens more violence. Reza Pahlavi, the last shah’s son, has emphasised Iranians’ right to defend themselves from the regime and has urged America to strike.\n\n The regime, soaked in blood, appears to be uninterested in compromise. Mr Khamenei’s hybrid theocracy-cum-democracy has morphed into a security state. Drones patrol the skies. Spot-checks of mobile phones net those with suspect sympathies. A three-week internet blackout has crippled the digital economy, deepening Iran’s economic isolation and malaise. On January 27th the rial hit a new low, even against a falling dollar.\n\n Initial official expressions of understanding for the protesters’ economic plight have vanished. Now all opponents are “terrorists\". The loyal pro-reform opposition has been neutralised by the election of President Masoud Pezeshkian, one of their number. Braver voices have been silenced. Hassan Rouhani, a former president who challenged both the Islamic Revolutionary Guard Corps and the supreme leader, is said to be under house arrest. His allies are said to be subject to travel bans.\n\n Meanwhile royalists inside and outside Iran increasingly argue that protest is futile against a regime willing to kill on such a scale. Many despair of the possibility of the army or police breaking ranks, as happened when Syria rose up against the Assads. And despite the build-up of American military might, the regime’s opponents question whether Donald Trump will keep his promise to help them. Instead, protesters and exiled opponents increasingly advocate taking up arms to avenge the dead. Elders in Lorestan and Ilam—peripheral provinces where protests erupted, where tribal loyalties are still prevalent and weapons still prized—have taken to social media dressed in military fatigues, brandishing rifles and vowing revenge for the crackdown. “Next time my cousins say they’ll swap Molotov cocktails for machine guns,\" worries a student in an eastern city. “For this massacre, every single one of them must be killed,\" says a normally urbane protester in Tehran.\n\n Could the protesters morph into armed rebel groups, as happened in response to regime violence in Libya and Syria? Some royalists abroad are wondering how to smuggle arms into Iran and solicit Israel’s help. It seems that little attention is being paid to the decade of civil war, mass displacement and the destruction of what had been middle-income countries that followed the recourse to arms elsewhere in the Middle East in the Arab spring of 2010-12.\n\n In the past, protesters in Iran tended to be middle-class. But poverty has eroded their numbers and now more typically they come from the sectors the regime used to consider its backbone. Many supporters of Mahmoud Ahmadinejad, a former hardline and populist president, now back Mr Pahlavi, claims an Iranian journalist exiled in Britain. They are ditching religious symbols for royalist ones—the lion and sun—and their chants and hashtags are openly anti-Islamic. “One mullah per lamppost,\" runs one. “Burn the Quran,\" is another.\n\n In all of this the voices of those who led earlier peaceful protests and hold fast to a struggle for representation dating back to Iran’s constitutional revolution of 1906 are being drowned out. Reformists’ and opposition calls to free political prisoners—many of whom favour a democratic republic—have faded. Opposition satellite channels based abroad ignored the call from Mir Hossein Moussavi, a former presidential candidate held under house arrest for 15 years, for Mr Khamenei and his henchmen to step down. Hecklers denounce anyone seeking reform, or even democracy instead of a monarch. “They don’t want anyone but Pahlavi,\" says a teacher who took part in the women-led protests against compulsory veiling in 2022. “They don’t let us speak.\" Fear of revenge killings is spreading. Many predict capital and physical flight. Turkey says it is considering setting up a buffer zone to guard against an influx of refugees.\n\n Could Mr Trump break the stand-off? His armada is amassing off Iran’s coast. Mr Khamenei is said to have moved to a fortified bunker in anticipation of an American strike. Western countries have managed to oust Iranian leaders before. Between them Britain and America helped orchestrate three coups in the 20th century; in 1921, 1941 and 1953.\n\n But anger at those coups partly fuelled the revolution in 1979. The fallout from outsiders’ interventions is unpredictable. The mayhem that followed the Western toppling of tyrants in Iraq and Libya also offers a cautionary tale. Nor is the exit of Mr Khamenei likely to be enough to satisfy the regime’s opponents; they want the edifice he built to fall with him. Meanwhile Iran’s rulers have seen the consequences of eviscerating the ruling class, as happened in Iraq after Saddam Hussein’s overthrow in 2003. In Iran, too, expect them to fight to retain their power and assets. Either way, chaos looms.","url":"https://www.livemint.com/global/the-violence-in-iran-could-lead-to-civil-war-11769994180121.html","image":"https://www.livemint.com/lm-img/img/2026/02/02/1600x900/logo/IRAN-IRGC-PARLIAMENT-4_1769994444198_1769994459443.JPG","video":null,"publish_date":"2026-02-02 01:08:55","author":"The Economist","authors":["The Economist"],"language":"en","category":"politics","source_country":"in","sentiment":-0.311},{"id":398421270,"title":"Ceasefire in Gaza: Pakistan assails Israel’s violations","text":"ISLAMABAD: As many as eight Islamic countries including Pakistan have strongly condemned what they have described as Israel’s repeated violations of the ceasefire in Gaza which have resulted in the “killing and injuring of more than a thousand Palestinians.”\n\nIn a joint statement issued Sunday, the foreign ministers of Pakistan, Egypt, Jordan, United Arab Emirates, Indonesia, Türkiye, Saudi Arabia and Qatar strongly condemned Israel’s repeated violations of the ceasefire in Gaza, which, they said, have resulted in the killing and injuring of more than a thousand Palestinians.\n\n“These actions risk escalating tensions and undermining efforts aimed at consolidating calm and restoring stability, at a time when regional and international parties are working collectively to advance the second phase of President Donald Trump’s peace plan and to implement the United Nations Security Council Resolution 2803,” the statement said.\n\nThe foreign ministers, in the statement, said, they consider that these repeated violations constitute a direct threat to the political process and hinder ongoing efforts to create appropriate conditions for transitioning to a more stable phase in the Gaza Strip, both in terms of security and humanitarian conditions, and stress the “necessity of full commitment to ensuring the success of the second phase of President Trump’s peace plan.”The ministers also called on all parties to fully uphold their responsibilities during “this critical period and to exercise the utmost restraint, in order to preserve and sustain the ceasefire, refrain from any actions that may undermine the current process, and create favourable conditions to move forward toward early recovery and reconstruction, as well as advancing a just and lasting peace grounded in the Palestinian right to self-determination and statehood, in accordance with international law and relevant UN Security Council resolutions, and the Arab peace initiative.”\n\nEarlier, in December, last year, as many as 21 Islamic states including Pakistan and the Organisation of Islamic Cooperation (OIC) joined hands in strong condemnation of their rejection of Israel’s recognition of the “Somaliland” region of Somalia, dubbing this move as tantamount to Israel’s “full and blatant disregard to international law.”\n\nCopyright Business Recorder, 2026","summary":"ISLAMABAD: As many as eight Islamic countries including Pakistan have strongly condemned what they have described as Israel’s repeated violations of the ceasefire in Gaza which have resulted in the “killing and injuring of more than a thousand Palestinians.”\n\n\nIn a joint statement issued Sunday, the foreign ministers of Pakistan, Egypt, Jordan, United Arab Emirates, Indonesia, Türkiye, Saudi Arabia and Qatar strongly condemned Israel’s repeated violations of the ceasefire in Gaza, which, they said, have resulted in the killing and injuring of more than a thousand Palestinians.\n\n\n“These actions risk escalating tensions and undermining efforts aimed at consolidating calm and restoring stability, at a time when regional and international parties are working collectively to advance the second phase of President Donald Trump’s peace plan and to implement the United Nations Security Council Resolution 2803,” the statement said.\n\n\nThe foreign ministers, in the statement, said, they consider that these repeated viola","url":"https://www.brecorder.com/news/40405216/ceasefire-in-gaza-pakistan-assails-israels-violations","image":"https://i.brecorder.com/large/2026/02/0206070212e92c7.webp","video":null,"publish_date":"2026-02-02 01:07:25","author":"Sardar Sikander Shaheen","authors":["Sardar Sikander Shaheen"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.031},{"id":398421862,"title":"British stars and Dalai Lama win Grammys as stars protest Ice on red carpet","text":"British stars FKA Twigs and Cynthia Erivo joined the Dalai Lama as early Grammy Award winners as artists protested against US Immigration and Customs Enforcement (Ice) officers deployed in US cities.\n\nSingers Joni Mitchell and Kehlani, and Bon Iver’s Justin Vernon were among artists wearing “Ice out” and “Be Good” pins at the annual ceremony, held at the Crypto.com Arena in Los Angeles on Sunday.\n\nIce officers have been deployed in US cities as part of President Donald Trump’s mass deportation initiative, most notably in Minnesota and Minneapolis, where about 2,000 federal agents have been deployed.\n\nOfficers have come under strong criticism over their aggressive approach. Most recently, Ice agents fatally shot two people on the streets of Minneapolis: Renee Good on January 7 and Alex Pretti on January 24.\n\nVernon, 44, whose group Bon Iver is nominated for best alternative music album, said he wore a whistle as a tribute to the legal observers documenting the actions of federal agents in the streets.\n\n“I think there’s a reason that music exists and it’s to heal and to bring people together,” he told The Associated Press. “But the real work are those observers on the on the ground in Minneapolis. We just want to shout them out.”\n\nKehlani, 30, cursed Ice in her acceptance speech as she won her first Grammy for best R&B performance for Folded.\n\nShe said: “I hope everybody’s inspired to join together as a community of artists and speak out against what’s going on. F*** Ice.”\n\nSpeaking on the red carpet, Colombian singer-songwriter Karol G, who is nominated for her record Tropicoqueta in the best Latin pop category, addressed the plight of the US’s Latin community.\n\nShe said: “Our community here in the United States is going through a lot of bad and difficult and hard things, and just to be a voice, just to be a representation, just to be a part of how positive we are, and how special we are for the world.\n\n“So it is like the best meaning of being in these places, and I am super happy because there’s a lot of Latin artists tonight, and to keep like seeing every year more and more and more, that’s evolution, it’s very special, that’s beautiful.”\n\nAmy Allen, Rhiannon Giddens and Margo Price were also among the artists wearing the political pins.\n\nElsewhere, the Dalai Lama won a Grammy for his narration of the audiobook Meditations: The Reflections of His Holiness. He was not there to accept the award, but Rufus Wainwright did so on his behalf.\n\nFKA Twigs, whose real name is Tahliah Barnett, took home best dance/electronic album for her record Eusexua, and Erivo won best pop duet/group performance for Defying Gravity, a duet with fellow Wicked star Ariana Grande.\n\nTwigs beat competition from fellow British artists PinkPantheress and Fred Again to the gong.\n\nRapper Kendrick Lamar, 38, who is the most nominated artist at this year’s ceremony with nine nods, has already scooped best rap song for TV Off, featuring Lefty Gunplay, and best melodic rap performance for Luther, a duet with R&B singer SZA.\n\nHe has also won best rap performance for Chains & Whips with Clipse, Pusha T, Malice and Pharrell Williams.\n\nPop superstar Lady Gaga, who is the second-most nominated at the awards alongside producers Jack Antonoff and Cirkut, has already won best dance pop recording for Abracadabra, and the song has also won best remixed recording for its Gesaffelstein remix.\n\nIn the televised ceremony, Gaga, whose real name is Stefani Germanotta, will go head-to-head with Lamar for album of the year, song of the year and record of the year.\n\nGaga’s Mayhem and Lamar’s GNX will face competition from Swag by Justin Bieber; Debi Tirar Mas Fotos by Bad Bunny; Man’s Best Friend by Sabrina Carpenter; Let God Sort Em Out by Clipse, Pusha T and Malice; Mutt by Leon Thomas; and Chromakopia by Tyler The Creator, for album of the year.\n\nThe song Golden from the Netflix film KPop Demon Hunters, sung by fictional group Huntr/x, became the first K-Pop act to win a Grammy, taking home the award for best song written for visual media.\n\nIn the televised ceremony, there will be performances from the likes of British singers Lola Young and Olivia Dean, Gaga, Bieber, Carpenter, Tyler The Creator and Lauryn Hill.\n\nBrat star Charli XCX, rapper Doechii, former One Direction star Harry Styles and singer-songwriter Carole King are among the stars presenting awards.","summary":"FKA Twigs and Cynthia Erivo picked up early awards ahead of the star-studded ceremony in Los Angeles.","url":"https://www.standard.co.uk/culture/music/cynthia-erivo-dalai-lama-british-lady-gaga-grammys-b1269178.html","image":"https://static.standard.co.uk/2026/02/02/01/16b444c2b6b66fad78fbe9778ce27210Y29udGVudHNlYXJjaGFwaSwxNzcwMDgwNjYx-2.79255137.jpg?width=1200","video":null,"publish_date":"2026-02-02 01:07:12","author":"Casey Cooper-Fiske","authors":["Casey Cooper-Fiske"],"language":"en","source_country":"gb","sentiment":0.171},{"id":398419628,"title":"Trending World","text":"Iran's supreme leader Ayatollah Ali Khamenei has warned that any attack on his country would spark a regional conflict, as the US continues to build up its forces nearby.\n\n\"The Americans should know that if they start a war, this time it will be a regional war,\" Khamenei was quoted as saying by the semi-official Tasnim news agency.\n\nDonald Trump earlier said Iran was in \"serious discussions\" and he hoped they would lead to something \"acceptable\", while Iran's Foreign Minister Abbas Araghchi told CNN he was \"confident that we can achieve a deal\" on Tehran's nuclear programme.\n\nTrump has threatened to intervene in Iran over its nuclear ambitions and after its deadly crackdown on anti-government protests.\n\nAraghchi said: \"Unfortunately, we have lost our trust [in] the US as a negotiating partner,\" but added the exchange of messages through friendly countries in the region was facilitating \"fruitful\" talks with Washington.\n\nIran's top security official Ali Larijani had previously said a framework for negotiations was progressing.\n\nAs part of its build up of forces, the US has sent its aircraft carrier the USS Abraham Lincoln to the region and late last week US Central Command said it was operating in the Arabian Sea.\n\n\"[Trump] regularly says that he brought ships... The Iranian nation shall not be scared by these things,\" added Khamenei.\n\nIran had been expected to begin a two-day live-fire naval exercise on Sunday in the Strait of Hormuz - one of the world's most important shipping lanes and a key route for energy supplies. However on Sunday Reuters quoted an Iranian official as saying the Iranian Revolutionary Guards Corps (IRGC) navy had no plans for such an exercise.\n\nAround a fifth of the world's traded oil passes through the waterway, which is about 33km (21 miles) wide at its narrowest point between Iran and Oman. Iran has in the past threatened to close the strait if it were attacked. \n\nThe US has warned Iran against any \"unsafe and unprofessional behaviour\" near its forces in the area.\n\nAraghchi responded by saying: \"The US military is now attempting to dictate how our Powerful Armed Forces should conduct target practice in their own turf.\"\n\nOn Saturday, two explosions in Iran heightened anxiety in the country. Local authorities said a blast that killed one and hurt 14 at a building in the southern port city of Bandar Abbas was caused by a gas leak. \n\nTasnim denied social media reports that a Revolutionary Guards Corps navy commander had been targeted in the blast.\n\nIn the south-western city of Ahvaz, at least four people were killed in another explosion, with local authorities again blaming a gas leak, according to Iran's Tehran Times.\n\nOn Thursday, Trump said he had told Iran that it had to do two things to avoid US military action: \"Number one, no nuclear. And number two, stop killing protesters.\"\n\nThe US-based Human Rights Activists News Agency says it has confirmed the killing of more than 6,300 people since the unrest began in late December, and is investigating another 17,000 reported deaths.\n\nAnother group, the Norway-based Iran Human Rights (IHR), has warned the final toll could exceed 25,000.\n\nProtesters have told the BBC that the lethal crackdown by security forces was unlike anything they had witnessed before.\n\nIn his remarks on Sunday, Khamenei accused protesters of attacking police, the IRGC and other facilities including banks and mosques.\n\n\"The coup was suppressed,\" Tasnim quoted him as saying.","url":"https://www.classfmonline.com/world/Iran-s-supreme-leader-warns-of-regional-war-if-US-attacks-70441","image":"https://cdn.classfmonline.com/imagelib/thumbs/44658665.jpg","video":null,"publish_date":"2026-02-02 01:06:01","author":"Bbc.com","authors":["Bbc.com"],"language":"en","source_country":"gh","sentiment":-0.264},{"id":398424706,"title":"‘We’ll find out’: Trump responds to Khamenei’s warning","text":"President Donald Trump has said the world would soon “find out” whether Iran’s Supreme Leader Ayatollah Ali Khamenei was correct in warning that a US attack would ignite a regional war, adding that there is still time to make a deal.\n\nIn recent weeks, the United States has increased its military presence in the Middle East, deploying the aircraft carrier USS Abraham Lincoln, additional guided-missile destroyers and advanced air defense systems in what Trump has described as a “massive and beautiful armada.”\n\nKhamenei warned on Sunday that any military action against Iran would have far-reaching consequences across the Middle East, much bigger than after the US-Israeli attack last summer.\n\n“They should know that if they start a war this time, it will be a regional war,” Khamenei said in a speech in Tehran marking the anniversary of the 1979 Islamic Revolution. He accused Washington of seeking to “devour” Iran and seize its oil and natural gas resources.\n\nAsked by reporters about the warning, Trump dismissed the remarks but left the door open to both diplomacy and force.\n\n“Of course he is going to say that,” Trump said. “Hopefully we’ll make a deal. If we don’t make a deal, then we’ll find out whether or not he was right.”\n\nTensions have remained high since US strikes on Iranian nuclear facilities last June and amid Washington’s promise to punish Iran for its crackdown on violent anti-government protests. Trump has repeatedly criticized Iranian leaders over the unrest and has suggested that Iran needs “new leadership,” while also urging protesters to continue demonstrating and “take over” state institutions.\n\nKhamenei, in his speech, characterized the protests as a foreign-backed plot, calling the unrest a “sedition” similar to past movements against the Islamic Republic. Iranian authorities have blamed the violence on “terrorists” supported by the US and Israel in order to justify a military intervention.\n\nThe head of Iran’s Supreme National Security Council, Ali Larijani, who held talks with Russian President Vladimir Putin at the Kremlin on Friday, said that progress was being made toward negotiations. Iranian Foreign Minister Abbas Araghchi also indicated that diplomacy could resume, although no formal talks with Washington were currently planned.","summary":"President Donald Trump has said the world would soon see whether Iran’s Supreme Leader Ayatollah Ali Khamenei was correct in his warning \nRead Full Article at RT.com","url":"https://www.rt.com/news/631843-iran-attack-warning-trump/","image":"https://mf.b37mrtl.ru/files/2026.02/article/697ff1f185f5402a4250478e.jpg","video":null,"publish_date":"2026-02-02 01:05:17","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.126},{"id":398424224,"title":"Trump family crypto firm sold major stake to UAE investment firm","text":"A crypto company run by President Donald Trump’s family members sold a large stake to investors tied to the United Arab Emirates just days before Trump’s inauguration, linking a Trump family business to a prominent member of the UAE’s governing elite.","url":"https://www.washingtonpost.com/politics/2026/02/01/trump-uae-crypto-world-liberty-financial/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EGKGACNKZLMUM7MHLLWYITJ7PM.jpg&w=1600&h=900","video":null,"publish_date":"2026-02-02 01:04:22","author":"Matt Viser","authors":["Matt Viser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.489},{"id":398420316,"title":"Russian drone attack on bus carrying mine workers in Ukraine kills at least 12","text":"Twelve miners have been killed in a Russian drone strike in eastern Ukraine, Ukrainian officials and the country’s largest private energy company have said. DTEK said a bus carrying mine workers home after their shift was hit by a drone in the Dnipropetrovsk region on Sunday. At least 15 others were injured, according to Ukraine’s State Emergency Service. The company initially said 15 people had been killed, but later revised the number to at least 12. In a separate series of attacks, at least two more people were killed and several others injured across Ukraine overnight and on Sunday, officials said. Six people were injured when a drone struck a maternity hospital in the city of Zaporizhzhia. Two of those hurt were women who were giving birth at the time. Zaporizhzhia regional head Ivan Fedorov said the attack was further “proof of a war directed against life”.BBC Verify confirmed the location as Maternity Hospital No. 3 on Bocharova Street in the eastern part of the city. Videos shared on social media, carrying official watermarks, showed damaged hospital rooms, broken windows and debris scattered across patient wards, offices and a children’s room. Some footage showed fire damage, while other videos showed firefighters moving patients to safety. No deaths were reported in the hospital attack. In this photo provided by the Ukrainian Emergency Service, firefighters put out the fire after a Russian drone hit a coal miners' bus killing at least 15, officials said, in Dnipropetrovsk region, Ukraine. (AP) Ukraine’s Foreign Minister Andriy Sybiha said the strike showed that Russian President Vladimir Putin was continuing a “war against civilians contrary to peace efforts”. Fedorov later said three more people were injured in a separate strike on a residential area in the region.Elsewhere, officials said a man and a woman were killed by a drone strike in the central city of Dnipro. A 72-year-old man was injured in the town of Nikopol. In southern Kherson, a 59-year-old woman was seriously wounded by shelling, while three people were injured in a strike in Kharkiv. Russia launched a wave of attacks on Ukraine’s power system in January, cutting heating and electricity to millions during winter. Temperatures are expected to fall below minus 20 degrees Celsius in some areas this weekend. US President Donald Trump said on Thursday that President Putin had agreed to halt attacks during the cold period. The Kremlin later said the pause would end on Sunday. Ukraine also said it is working with Elon Musk’s company SpaceX to stop Russia from using Starlink satellite systems for drone attacks. Ukraine’s military depends on Starlink for internet access and said it had found the terminals on Russian long-range drones. Also read Russia invites Ukrainian President Volodymyr Zelenskyy to Moscow for peace talks Musk said measures to stop the “unauthorised” use of Starlink appeared to be working. Ukraine’s Defence Minister Mykhailo Fedorov thanked him for being “a true friend of the Ukrainian people”. Meanwhile, President Volodymyr Zelenskyy said a second round of talks involving Ukraine, Russia and the United States would begin on Wednesday in Abu Dhabi, after being delayed from Sunday. He did not explain the delay. Talks aimed at ending the war have been led by the US, with a major disagreement over territory. Russia controls around a fifth of Ukraine and wants Kyiv to hand over more land, while Ukraine has said it wants Russia to return control of the Zaporizhzhia nuclear power plant.","url":"https://indianexpress.com/article/world/russian-drone-attack-on-bus-carrying-mine-workers-in-ukraine-kills-at-least-12-10508311/","image":"https://images.indianexpress.com/2026/02/US_62d372.jpg","video":null,"publish_date":"2026-02-02 01:01:32","author":"Express Global Desk","authors":["Express Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.355},{"id":398424460,"title":"Trump’s war against the states","text":"For months, President Donald Trump’s aggressive anti-immigration campaign has threatened to push the US to the brink of genuine civil conflict without quite crossing the line.\nBut the killing of US citizens Renée Good and Alex Pretti by federal immigration officers in Minneapolis this month has made it clear that this once invisible boundary can, in fact, be breached.\nAfter videos of Immigration and Customs Enforcement (ICE) agents killing Pretti – an intensive-care nurse who was observing and recording a raid – provoked public outrage, Trump struck a more conciliatory tone and removed Gregory Bovino, the senior Border Patrol official who had become the public face of the crackdown in Minneapolis. Even so, the conflict now playing out on the streets of major American cities is unlikely to abate.\nIronically, and in contrast to traditional party alignments, this conflict pits an increasingly authoritarian Republican president against Democratic state officials asserting their constitutional authority.\nAs tensions escalate, governors and mayors in Democratic-controlled states and cities find themselves effectively untethered from the federal system designed to constrain executive power.\nState and local leaders have long assumed that close intergovernmental cooperation – a core tenet of federalism – would temper Trump’s efforts to undermine constitutional rights.\nBut the unleashing of ICE in state and local jurisdictions, the attempts to label Good and Pretti as “domestic terrorists,” and the obstruction of state and local investigations into their deaths all underscore the administration’s contempt towards this foundational feature of American governance.\nThe standard constitutional remedy for a rogue executive threatening civil breakdown is the separation of powers. In the Trump era, however, both Congress and the Supreme Court have largely abdicated their responsibility to restrain Trump or hold him accountable.\nAs a result, governors and mayors face an agonising strategic dilemma typically associated with great-power conflicts: how to deter further aggression rather than provoke it.\nMiscalculation could prompt Trump to invoke the Insurrection Act or, more ominously, to seize control of state capitals through the use of Presidential Emergency Action Documents – classified, Cold War-era powers originally designed to ensure order in the event of a Soviet attack.\nThis threat, which Trump has repeatedly raised in recent weeks, is now a sword of Damocles hanging over governors and mayors. With the recent establishment of the US Army’s Western Hemisphere Command and a National Security Strategy that makes homeland and hemispheric security a top priority, Trump could deploy federal troops to any American city within hours.\nGovernors and mayors are left with only two viable paths. They can maintain strategic ambiguity about how they would respond to such a takeover, or they can make clear, privately or publicly, that they are prepared to mobilise state and local resources to resist federal overreach.\nRecent events, from the violence in Minnesota to the reckless seizure of Venezuelan president Nicolás Maduro, have shown that dismissing Trump’s radicalism and megalomania, or relying on the existence of moral limits, is no longer tenable.\nGiven that Trump’s decision-making is driven almost entirely by immediate political considerations and personal aggrandisement, open confrontation would likely invite further escalation.\nThe most effective course for state officials may be to hedge and prepare for the worst. They should speak publicly about the dangers of executive overreach while continuing to cooperate with federal law enforcement in all areas except immigration.\nIn that domain, they should propose joint operational guidelines for ICE that prohibit the use of tactical gear, masks, heavy weapons, and armoured vehicles, and require agents to comply with accepted policing standards.\nTo be sure, Trump could simply ignore these exhortations. With that possibility in mind, state and local officials should quietly prepare the legal filings necessary for rapid judicial intervention in response to aggressive federal actions, whether under the Insurrection Act or outside of it.\nBut there is no guarantee the courts will intervene. Although the Supreme Court recently blocked the administration from deploying the National Guard in support of ICE operations in Illinois on narrow statutory grounds, Justice Brett Kavanaugh took care to note in his concurrence that such limits would not apply if the president invoked the Insurrection Act, under which even active-duty troops could be deployed domestically.\nThe Insurrection Act permits the use of the military for domestic law enforcement when rebellion threatens national security. Trump’s likely justification would be that Antifa – a loose label inflated by the far right into a mythic enemy – constitutes an organised armed movement supported by complicit state leaders, despite the fact that Antifa is neither unified nor armed.\nAlthough such a claim would be transparently false, the statute’s threshold is so low that even outlandish allegations could satisfy the Act’s prima facie requirements. Judicial review would occur only after troops had been deployed, when conditions might already be too volatile to contain.\nMoreover, given the Supreme Court’s broad sympathy for the “unitary executive theory” – the view that presidential authority is practically absolute – it may well uphold Trump’s invocation of the Insurrection Act on the merits.\nIn that event, Congress would remain the only institution capable of checking Trump’s authority. Admittedly, its acquiescence has helped create the current constitutional crisis, and with both chambers under Republican control, Trump’s militarisation of domestic governance is not likely to encounter sustained resistance. Still, fissures are beginning to appear, as some Republican members have expressed unease with Trump’s impulsive behaviour at home and abroad.\nThis may create a narrow opening for governors and mayors to coordinate a bipartisan response. A congressional awakening may seem improbable, but if Trump invokes the Insurrection Act or similar emergency authorities, it may represent America’s last, best hope of averting constitutional breakdown.\n\nSteven Simon, distinguished fellow and visiting professor at Dartmouth College, is the former senior director for the Middle East and North Africa at the National Security Council (2011-12). Jonathan Stevenson, senior fellow at the International Institute for Strategic Studies and managing editor of Survival, is the former director for political-military affairs, Middle East and North Africa, at the National Security Council (2011-13).\nThe views expressed are those of the writers and do not necessarily reflect those of FMT.","summary":"The recent killing of two US citizens by Immigration and Customs Enforcement agents marks a grim turning point in President Donald Trump's efforts to militarise domestic law enforcement.","url":"https://www.freemalaysiatoday.com/category/opinion/2026/02/02/trumps-war-against-the-states","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/12/12798588-ICE.webp","video":null,"publish_date":"2026-02-02 01:00:54","author":"Steven Simon and Jonathan Stevenson","authors":["Steven Simon and Jonathan Stevenson"],"language":"en","category":"politics","source_country":"my","sentiment":-0.107},{"id":398423506,"title":"'Melania' documentary shocks Hollywood press with 'face-saving' debut that 'over-performed' expectations","text":"\"Melania,\" the documentary detailing the 20 days in the first lady’s life before President Donald Trump's second term in office, shocked the Hollywood press with its surprise opening weekend. Reports indicated that \"Melania\" posted the best opening weekend for a documentary in over a decade, in stark contrast to its low critic score. \"No one saw that coming, with many suggesting 'Melania' was a bomb before it even opened based on empty, or nearly empty, seat maps in cinemas across the country,\" The Hollywood Reporter reported Saturday. 'MELANIA' WORLD PREMIERE: PRESIDENT TRUMP, FIRST LADY, RFK JR., NICKI MINAJ AND MANY MORE LIGHT UP RED CARPET It continued, \"[E]xhibitors weren’t so convinced, based on sluggish ticket sales and an endless stream of social posts showing auditoriums where only a smattering of tickets had been sold (it’s hard to remember a non-concert doc that’s been so scrutinized in terms of its opening number).\" Other entertainment outlets also expressed surprise at the box office performance of the \"Melania\" documentary. \"'Melania: Twenty Days to History' is proving the haters and losers wrong. The Brett Ratner-directed documentary chronicling three weeks in the life of the incoming first lady has over-performed expectations,\" Rolling Stone magazine reported on Sunday. MELANIA TRUMP PRAISED BY HIGH-PROFILE ALLIES FOR SPEAKING UP MORE IN SECOND TERM Variety reported that the film was \"eclipsing box office expectations,\" while Deadline claimed \"Melania\" had \"crushed it exactly where she was suppose to\" in red areas despite concerns about a \"great deal of juicing\" at the box office. The New York Times called the numbers a \"face-saving result for the first lady\" after initial predictions placed the film at only $5 million, though it contextualized the sizeable opening. \"On Saturday, analysts projected roughly $8 million in domestic ticket sales for the nearly two-hour film. The actual amount, $7 million, suggests that opening day was front loaded with Mrs. Trump’s fans,\" the New York Times wrote. Fox News Digital reached out to Amazon MGM Studios for a comment. 'MELANIA' FILM LEAVES PREMIERE AUDIENCE 'INSPIRED'; PRODUCER SLAMS MEDIA FOR YEARS OF UNFAIR TREATMENT Reports also found that Amazon MGM Studios spent $40 million on the documentary with another $35 million spent on marketing. However, the studio reportedly intends to recoup these costs through licensing deals as well as upcoming plans to add the film to its Prime Video streaming service. \"We’re very encouraged by the strong start and positive audience response, with early box office for ‘Melania’ exceeding our expectations,\" Amazon MGM’s head of domestic theatrical distribution, Kevin Wilson said in a statement to Variety. \"This momentum is an important first step in what we see as a long-tail lifecycle for both the film and the forthcoming docu-series, extending well beyond the theatrical window and into what we believe will be a significant run for both on our service. We are confident in the long-term value this rollout will deliver to customers both in theaters, and for years to come on Prime Video.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP The \"Melania\" documentary was also widely panned by entertainment critics as a form of \"propaganda\" for the Trump administration. By contrast, verified audience users on the Rotten Tomatoes website largely praised the film, giving it a 99% approval rating.","summary":"The &quot;Melania&quot; documentary surprised members of Hollywood&apos;s entertainment media after posting the best opening weekend for a documentary in over a decade.","url":"https://www.foxnews.com/media/melania-documentary-shocks-hollywood-press-face-saving-debut-over-performed-expectations","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/07/MelaniaTrump.jpg","video":null,"publish_date":"2026-02-02 01:00:46","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.02},{"id":398420312,"title":"Trump tariff shadow: Budget addresses US demands, backs vulnerable sectors","text":"THE UNION Budget 2026-27 has accommodated several US-focussed demands raised during ongoing trade negotiations while upping support for the most tariff-vulnerable sectors, such as textile, footwear and marine products. The aim is to prepare them for diversification in the face of 50 per cent US tariffs. While the US trade deal remains elusive, other markets are set to open up following implementation of trade deals, particularly the UK and the EU. In her Budget speech, Finance Minister Nirmala Sitharaman announced a tax holiday until 2047 to any foreign company that provides cloud services to customers globally by using data centre services from India, a move that directly benefits top American companies in expanding their foothold in India. The Budget has also proposed the elimination of duty on aircraft components and nuclear-generation equipment. The US is the global market leader in the aviation sector, and is one of the largest exporters of nuclear reactor components. For the domestic sector, Sitharaman announced a host of measures, particularly in the textile sector, to increase productivity, including capital support for textile machinery in clusters and a targeted scheme to boost the availability of input items — a longstanding challenge. Also Read | No big-ticket sops for poll-bound states in Budget 2026, unlike previous years US demand for tax break for data centres As part of the bilateral trade agreement negotiations, the US had sought greater market access for its companies looking to establish their data centres in India. The demands are understood to have included tax breaks, affordable access to resources like land, energy and water, and duty exemptions on some imports. With the announcement of a tax holiday until 2047 to foreign companies for setting up data centres in the country, the government has acted on one of the US’s key demands. However, the tax break comes with some riders: the companies would need to provide services to Indian customers through an Indian re-seller entity. Several US companies have announced massive investments in setting up data centres in India to fuel artificial intelligence’s hunger for such infrastructure. Last month, Union IT Minister Ashwini Vaishnaw said that private investments in India’s AI infrastructure could double from last year’s $70 billion by the end of the ongoing financial year (FY26). US demands in aviation, nuclear & data services With the passage of the Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India (SHANTI) Act, 2025, and opening the sector for private players to enter the operations side of the tightly-governed nuclear power sector, the government had already addressed a key US demand. On Sunday, the Budget proposed zero customs duty on nuclear-generation equipment, absorber rods and project imports for all registered nuclear plants until 2035, signalling long-term market access. In the aviation sector too, India has eliminated duties on aircraft components and Maintenance, Repair and Operations (MRO) inputs, benefiting US aerospace firms and engine and maintenance suppliers. Also Read | FM Sitharaman announces chip manufacturing scheme 2.0, but will it go beyond fabs? Concession for units in Special Economic Zones Aimed at preventing job losses in the Special Economic Zones (SEZs), Sitharaman announced “a special one-time” measure to facilitate sales by eligible manufacturing units in SEZs to the Domestic Tariff Area (DTA) at concessional duty rates. “To address the concerns arising about utilisation of capacities by manufacturing units in the Special Economic Zones due to global trade disruptions, I propose, as a special one-time measure, to facilitate sales by eligible manufacturing units in SEZs to the DTA at concessional rates of duty. The quantity of such sales will be limited to a prescribed proportion of their exports. Necessary regulatory changes will be undertaken to operationalise these measures while ensuring a level playing field for the units working in the DTA,” Sitharaman said. SEZs are zones which receive a simplified system of official clearances and procedures, and other duty benefits aimed at spurring investments and manufacturing. The Budget announcement comes amid distress calls from SEZ units that completely depend on the US market and are on the verge of closure due to US tariffs under President Donald Trump. As many as 466 units have closed in the last five years (until FY25) in seven SEZs across the country, according to data shared by the Commerce and Industry Ministry in a written response to a Lok Sabha question. US tariffs have resulted in two consecutive months witnessing a decline in Indian goods exports - September and October. Also Read | India gets its first indigenous microprocessor: What are semiconductor chips and why are they significant? Modernising textile clusters Amid concerns of irreversible damage to the textile sector due to tariffs and missed Summer orders, Sitharaman announced an integrated programme aimed at modernising the sector, focusing on each segment of the supply chain. She announced the National Fibre Scheme for self-reliance in natural fibres such as silk, wool and jute, man-made fibres, and new-age fibres; Textile Expansion and Employment Scheme to “modernise traditional clusters with capital support for machinery”, technology upgradation and common testing and certification centres; National Handloom and Handicraft programme to \"integrate and strengthen existing schemes and ensure targeted support for weavers and artisans\"; and Tex-Eco Initiative to promote \"globally competitive and sustainable textiles and apparel\". India’s textile and apparel industry contributes 13% to industrial production, 12% to exports, and about 2% to GDP. Roughly 80% of India’s textile value chain is concentrated in Micro, Medium and Small Enterprise (MSME) clusters, each with its own specialisation. In a letter to Vice President C P Radhakrishnan last month, Indian apparel exporters said sustained US tariffs in the absence of a trade deal could cause permanent damage to India’s market share, resulting in job losses, as there is no further shock-absorption capacity left. Also Read | No NPR notification yet, but Budget allocates funds. Will NPR, precursor to NRC, be conducted? Duty structure in labour-intensive sectors After broad-based reforms, including the elimination of certain Quality Control Orders (legal directives issued by the government) and the reduction of duty on key input items such as cotton, Sitharaman announced further easing of the duty structure. Indicating emphasis on the labour-intensive sector, she proposed to increase the limit for duty-free imports of specified inputs used for processing seafood products for export, from the current 1% to 3% of the Free on Board (FOB) value of the previous year’s export turnover. “I also propose to allow duty-free imports of specified inputs, which is currently available for exports of leather or synthetic footwear, to exports of shoe uppers as well. I propose to extend the time period for export of final product from the existing six months to one year, for exporters of leather or textile garments, leather or synthetic footwear and other leather products,” Sitharaman said. Container shortage Sitharaman announced a Rs 10,000 crore container manufacturing scheme amid the continued shortage of the large boxes essential for trade, as well as India’s dependency on China for their supply. The allocation covers a five-year period and is aimed at creating “a globally competitive container manufacturing ecosystem.” Triggered by the recent tensions in the Middle East, the Red Sea crisis resulted in concerns about the passage of ships through the region. The incident also exposed India’s dependency, which resulted in stopgap arrangements. However, issues due to container shortages have persistently troubled traders since the Covid-19 pandemic. During the Board of Trade (BoT) meeting in November last year, Gujarat’s representative flagged the shortage of shipping containers and its impact on exporters. Further, Assam’s representative said tea exports from the state face hurdles due to “shipping line levies for empty containers”, in the context of the state being landlocked. China is the largest exporter of containers, manufacturing around 95% of the large steel boxes globally. Much of the container manufacturing in China is done by a handful of highly subsidised, state-owned enterprises that have sparked security concerns in the US, EU, and India. The US has also initiated plans to de-risk its ports from over-reliance on Chinese containers and cranes. India also began production after 2021.","url":"https://indianexpress.com/article/explained/explained-economics/trump-tariff-shadow-budget-addresses-us-demands-backs-vulnerable-sectors-10508121/","image":"https://images.indianexpress.com/2026/02/Nirmala-1600_20260201211504.jpg","video":null,"publish_date":"2026-02-02 00:59:01","author":"Soumyarendra Barik","authors":["Soumyarendra Barik"],"language":"en","category":"politics","source_country":"in","sentiment":0.326},{"id":398421432,"title":"Trump says closing Kennedy Center arts complex for two years","text":"WASHINGTON: US President Donald Trump announced on Sunday (Feb 1) he is closing the Kennedy Center arts complex in Washington for two years, beginning on Jul 4 - the nation's 250th anniversary - for a thorough renovation.\n\nSince returning to office, Trump has launched a forceful takeover of the once non-partisan center, branding some of its programming too \"woke\" and adding his own name to the facade.\n\n\"I have determined that the fastest way to bring The Trump Kennedy Center to the highest level of Success, Beauty, and Grandeur, is to cease Entertainment Operations for an approximately two year period of time,\" Trump, who is the centre's chairman of the board, posted on his Truth Social platform.\n\nThe decision, he said, will be subject to approval of the board, which he handpicked upon taking over as chairman.\n\nTrump said the facility's various entertainment events - concerts, operas, musicals, ballet performances and interactive arts - would impede and slow the construction and renovation operations, and that a full temporary closure would be necessary.\n\n\"The Trump Kennedy Center, if temporarily closed for Construction, Revitalisation, and Complete Rebuilding, can be, without question, the finest Performing Arts Facility of its kind, anywhere in the World,\" he said.\n\n\"America will be very proud of its new and beautiful Landmark for many generations to come.\"\n\nThe extent of the \"complete rebuilding\" mentioned by Trump is unclear, but he has long declared that the structure - built as a living memorial to slain US president John F Kennedy and opened in 1971 - is dilapidated and needs a facelift.\n\nSince the makeover of the board, including the installation of Trump as chairman, several prominent artists and shows have cancelled their appearances at the centre, including the musical \"Hamilton\", operatic soprano Renee Fleming and renowned composer Philip Glass.\n\nThe Washington National Opera recently announced it would leave the Kennedy Center, its home since the centre's opening.\n\nSome have directly cited Trump's name being added to the institution and its facade, while others have noted logistical or financial pressures.","summary":"The centre will close from Jul 4 for a thorough renovation, said US President Donald Trump.","url":"https://www.channelnewsasia.com/world/kennedy-center-performing-arts-complex-closing-2-years-trump-5899931","image":"https://dam.mediacorp.sg/image/upload/s--7hEoiIgm--/c_crop,h_900,w_1600,x_0,y_0/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/02/2026-01-27t171011z_1833837","video":null,"publish_date":"2026-02-02 00:59:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.399},{"id":398424164,"title":"Kennedy Center arts complex to shut for a two year renovation, Trump says","text":"US President Donald Trump, said on Sunday that the Kennedy Center for the Performing Arts in Washington will close for about two years from July 4, the nation’s 250th anniversary. He said the closure is part of a planned large-scale renovation, which still requires approval from the centre’s board, appointed after he became chairman.\nSince returning to office, Trump has launched a forceful takeover of the once non-partisan center, branding some of its programming too “woke” and adding his own name to the facade.\n“I have determined that the fastest way to bring The Trump Kennedy Center to the highest level of Success, Beauty, and Grandeur, is to cease Entertainment Operations for an approximately two year period of time,” Trump, who is the center’s chairman of the board, posted on his Truth Social platform.\nThe decision, he said, will be subject to approval of the board, which he handpicked upon taking over as chairman.\nEvents to be halted during works\nTrump said the facility’s various entertainment events – concerts, operas, musicals, ballet performances, and interactive arts – would impede and slow the construction and renovation operations, and that a full temporary closure would be necessary.\n“The Trump Kennedy Center, if temporarily closed for Construction, Revitalization, and Complete Rebuilding, can be, without question, the finest Performing Arts Facility of its kind, anywhere in the World,” he said.\n\"America will be very proud of its new and beautiful Landmark for many generations to come.\"\nThe extent of the \"complete rebuilding\" mentioned by Trump is unclear, but he has long declared that the structure -- built as a living memorial to slain US president John F Kennedy and opened in 1971 -- is dilapidated and needs a facelift.\nSince the makeover of the board, including the installment of Trump as chairman, several prominent artists and shows have cancelled their appearances at the center, including the musical \"Hamilton,\" operatic soprano Renee Fleming and renowned composer Philip Glass.\nThe Washington National Opera recently announced it would leave the Kennedy Center, its home since the center's opening.\nSome have directly cited Trump's name being added to the institution and its facade, while others have noted logistical or financial pressures.\n(With agency inputs)","url":"https://www.firstpost.com/world/kennedy-center-arts-complex-to-shut-for-a-two-year-renovation-trump-says-13975007.html","image":"https://images.firstpost.com/uploads/2026/02/blobhttpsweb.whatsapp.comb4bdd32e-b2c6-44aa-998b-ebdae9810f7e-2026-02-02T061927.938-2026-02-e71023292960ac7d931fe16770d9359a.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2026-02-02 00:58:13","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.364},{"id":398422598,"title":"Revealed: All the key figures named in Ghislane Maxwell's newly released emails - from Elon Musk to Princess Beatrice","text":"Ghislane Maxwell sought to portray Andrew Mountbatten Windsor's accuser as a deranged teenager obsessed with witchcraft, new emails from the Epstein files show.\n\nA message from Maxwell's 'GMAX' account sought to blacken the name of the-then Virginia Roberts after she alleged Jeffrey Epstein trafficked her to the former Duke of York.\n\nIn the 2011 email, Maxwell, currently serving 20 years in prison for procuring girls for predatory Epstein, advised her on-off lover to claim 'she was 17 when you met her and her mum was worried she was into whichcraft (sic) and that she fled the country to avoid a grand theft auto problem and iditment (sic).'\n\nThe messages were sent after when Vanity Fair contacted Epstein about Mr Mountbatten-Windsor's links to Giuffre.\n\nGiuffre, who took her own life last year, was paid an undisclosed, out-of-court settlement in March 2022 to resolve a US civil sexual assault lawsuit against Andrew, who denies her claims.\n\nAs observers all over the world continued to sift through the three million documents released on Friday - including thousands of uncaptioned videos and images with no context - humiliating revelations about Andrew and other key figures drawn into Epstein's sphere continued to emerge across the weekend and into last night.\n\nThey include:\n\nAndrew Mountbatten-Windsor \n\nAndrew discussed arranging billions in loans from Libya to Dubai during the last years of Muammar Gaddafi's regime.\n\nThe former Duke of York discussed a deal with Epstein and UAE-based investment banker Terrence Allen in 2010, newly released emails show.\n\nAnd he also spoke of potential investment opportunities in war-torn Afghanistan with the late paedophile financier, after he claimed to Newsnight he had broken off contact.\n\nSarah Ferguson \n\nSarah Ferguson offered Epstein and his friends VIP tours of Buckingham Palace and sent him a message saying 'marry me'. \n\nIn 2009, she boasted she could 'organise anything' after Epstein asked if she would arrange a 'VIP tour' or 'access to something special' in London for the daughter of his US lawyer, Alan Dershowitz.\n\nThe following month, Epstein told hedge fund manager Glenn Dubin that Fergie could 'organise tea in...Buckingham Palace...or Windsor Castle' when they visited the UK.\n\nEpstein is known to have visited Buckingham Palace, Sandringham and Balmoral at the invitation of Andrew and his ex-wife.\n\nIn 2010, Ferguson sent Epstein an email which read: 'You are a legend. I really don't have the words to describe, my love, gratitude for your generosity and kindness. Xx I am at your service. Just marry me.'\n\nMs Ferguson began another email from November 2009, while Epstein was on house arrest, with: 'My dear spectacular and special friend Jeffrey. You are a legend, and I am so proud of you.'\n\nAnd in a message from August that year she thanked the billionaire 'for being the brother I have always wished for.'\n\nPrincess Eugenie\n\nIn one shocking message showing her closeness to him, Andrew's ex-wife, Sarah Ferguson, told Epstein that she was waiting for her youngest daughter, Eugenie, to 'come back from a sh***ing weekend,' after he enquired if the former Duchess was in or going to New York.\n\nThe message was sent in 2010, shortly after Eugenie met now-husband Jack Brooksbank on a ski holiday.\n\nPrincess Beatrice\n\nEpstein joked that if Lord Mandelson married Princess Beatrice the Queen 'would have a queen as a grandson.'\n\nIn an email exchange in October 2009, Epstein also told Mandelson - a serving cabinet minister at the time - that it would be 'incest' if the pair got together.\n\nSarah Ferguson and both her daughters arranged lunch with Epstein the same month he was released from jail in the US, with the rest of his 13 month sentence to be spent on house arrest, according to newly released emails.\n\nEpstein's assistant, Lesley Groff, discussed booking British Airways flights for the trio in July 2009, and arranging for a driver to pick them up from the airport.\n\nThe devil himself\n\nIn an undated video interview, seemingly conducted by Donald Trump's former right-hand man, Steve Bannon, Epstein denied his mysterious fortune came from 'dirty money' and claims he made donations to try to eradicate polio in India and Pakistan.\n\nEpstein said: 'I think if you told them the devil himself said 'I'm going to exchange some dollars for your child's life...,' to which the interviewer asks: 'Do you think you're the devil himself?'\n\nThe paedophile replied: 'No, but I do have a good mirror.'\n\nRichard Branson\n\nSir Richard Branson emailed Epstein to say he would be happy to see him any time, so long as the paedophile financier brought his 'harem'.\n\nThe Virgin Group founder, who has supported the rehabilitation of ex-offenders, also encouraged Epstein to enlist Bill Gates to help repair the paedophile financier's reputation following his 2008 conviction.\n\nA Virgin Group spokesman said any contact Epstein had with Branson took place more than 12 years ago and was limited to group or business settings, such as a charity tennis event.\n\n'Had they had the full picture and information, there would have been no contact whatsoever,' the spokesman added.\n\n'Richard believes that Epstein's actions were abhorrent and supports the right to justice for his many victims.'\n\nElon Musk asked Epstein when the 'wildest party' would take place on his island in November 2012.\n\nThe Tesla boss told his fellow billionaire he wanted to 'hit the party scene in St Barts or elsewhere and let loose.'\n\nEpstein asked how many people he would bring to his island, Little Saint James, and promised to send him a helicopter.\n\nMusk, who maintains he never visited Epstein's island, also chased Epstein about visiting in January 2013, according to the messages released.\n\nNorwegian Crown Princess\n\nCrown Princess Mette-Marit of Norway apologised last night after it emerged she had exchanged dozens of effusive emails with Epstein despite knowing about his jail sentence.\n\nIn 2012, when Epstein said he was going to Paris on a 'wife-hunting' mission but preferred 'Scandinavians,' Mette Marit responded: 'Paris good for adultery. Scandis better wife material.'\n\nA month later she told Epstein he was 'very charming'.\n\nThe crown princess had previously said she would not have had contact with Epstein if she had known about his criminality. But an email from 2011 showed her saying: 'Googled u after last email. Agree didn't look too good.'\n\nOlympic chief\n\nLos Angeles 2028 Olympics chief Casey Wasserman has also apologised over flirty emails between him and Maxwell, including one where he wrote: 'I think of you all the time ... So what do I have to do to see you in a tight leather outfit?'\n\nLast night the 51-year-old said in a statement: 'I deeply regret my correspondence with Ghislaine Maxwell which took place over two decades ago, long before her horrific crimes came to light.","summary":"A message from Maxwell's 'GMAX' account sought to blacken the name of the-then Virginia Roberts after she alleged Jeffrey Epstein trafficked her to the former Duke of York.","url":"https://www.dailymail.co.uk/news/article-15518475/figures-named-Ghislane-Maxwells-emails-Elon-Musk-Princess-Beatrice.html","image":"https://i.dailymail.co.uk/1s/2026/02/02/00/106021079-0-image-m-48_1769992831953.jpg","video":null,"publish_date":"2026-02-02 00:54:59","author":"Editor,George Odling","authors":["Editor","George Odling"],"language":"en","source_country":"gb","sentiment":0.171},{"id":398420770,"title":"Shares jittery in Asia as metals gyrate, earnings loom","text":"Asian share markets have mostly followed Wall Street futures lower as chaotic trading in silver made for ‍a nervous start to a week that is packed with corporate earnings, central bank meetings and major economic data. Silver lost another five per cent at one stage, as Friday's 30 per cent plunge squeezed leveraged positions in ​what had become a very crowded trade. Dealers also pointed to a halt in trading of the UBS SDIC silver futures fund in China as one cause of the rout. Oil prices also fell by ⁠almost three per cent as US President Donald Trump said over the weekend Iran was \"seriously talking\" with Washington, perhaps lessening the risk of a US military strike on the country. The jitters saw MSCI's broadest index of Asia-Pacific shares outside Japan ease on Monday 0.7 per cent, with South Korea down 1.0 per cent. Japan's Nikkei was a rare gainer, adding 0.7 per cent as opinion polls suggested Prime Minister Sanae Takaichi's Liberal Democratic Party was likely to score a landslide victory in next week's lower house election. Such a victory would likely make it easier to push through aggressive stimulus policies, while also easing political uncertainty in general. More debt-funded spending could pressure bonds and the ‌yen, with Takaichi talking ​up the benefits of a weaker currency for exports. It was also a busy week for earnings in Europe, with around 30 per cent of Euro STOXX market capitalisation ‍due to report. EUROSTOXX 50 futures and DAX futures both eased 0.1 per cent, while FTSE futures held steady. S&P 500 futures dipped 0.2 per cent and Nasdaq futures fell 0.4 per cent, with about one quarter of the S&P 500 set to report this week. Growth in S&P 500 earnings per share is running at 11 per cent on the previous year, when consensus had been for 7 per cent. The focus will be on tech majors Alphabet, Amazon and AMD, particularly costs and benefits of AI in the wake of Microsoft's badly received results. Analysts at Goldman Sachs noted consensus estimates for AI hyperscaler capex this year had climbed to $US561 billion ($A807 billion), up 38 per cent on ​2025 and compared to $US540 billion ($A776 billion) expected at the start of earnings season. In currencies, the ‌dollar looked a little steadier at $1.1847 per euro after Friday's one per cent bounce. It was aided by broad weakness in the yen, which saw it edge up 0.3 per cent to 155.17 yen. The rally had been initially triggered by Trump's choice of former ​Federal Reserve governor Kevin Warsh to become the next chair of the central bank. Analysts assumed Warsh was less likely to press for all-out rapid rate cuts than some other possible ‍choices, though he has sounded more dovish than current chair Jerome Powell. \"Trump is most unlikely to have nominated Warsh if he was not genuinely supportive of lower interest rates, and for which there is plenty of evidence Warsh believes that the economy can achieve higher rates of non-inflationary growth,\" said Ray Attrill, head of FX strategy at NAB. Which was ​why ​market pricing remained at two rate cuts for this year, with a move ​seen unlikely until June when, presumably, Warsh will be chair. Futures imply a 68 per cent chance of ​a steady outcome at the April meeting and, oddly, 68 per cent for an easing in June. That outlook may change should the January payrolls report on Friday surprise significantly in either direction, assuming the government is open and it is actually released. Also on the menu this week are policy meetings by the Reserve Bank of Australia, European Central Bank and Bank of England. The RBA is an outlier in that markets imply around a 75 per cent chance it will raise interest rates by a quarter point to 3.85 per cent, so reversing one of three cuts delivered last year, in an attempt to quell resurgent inflation. In commodity markets, volatility was the main theme as gold fell 1.4 per cent to $US4,807 ($A6,912) an ounce, having shed almost 10 per cent on Friday. After an early dive, silver steadied at $US84.62 ($A121.67) but trade was extremely choppy. Oil prices fell as investors waited anxiously to ‍see whether the US would strike Iran, or some sort of deal could be struck. Brent slid 2.7 per cent to $US67.46 ($A97) a barrel, while US ​crude dropped 2.8 per cent to $US63.38 ($A91.13) per barrel. Australian Associated Press","url":"https://www.goulburnpost.com.au/story/9165695/shares-jittery-in-asia-as-metals-gyrate-earnings-loom/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/946e2f1c-2a17-4d7a-b23f-150724405212.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2026-02-02 00:53:51","author":"Wayne Cole","authors":["Wayne Cole"],"language":"en","source_country":"au","sentiment":-0.122},{"id":398420192,"title":"Trump announces two-year closure of Trump Kennedy Center for major renovations","text":"President Donald Trump said Sunday that the Trump Kennedy Center will close later this year for a two-year period to undergo renovations.\n\nIn a post on Truth Social, Trump said the complex will close on July 4, coinciding with the nation’s 250th anniversary, at which point construction will begin on what he described as a “new and spectacular entertainment complex.”\n\nTrump said the decision followed a yearlong review involving contractors, arts experts and other advisers. He added that the temporary closure would allow the renovations to be completed faster and at a higher quality than if construction were carried out while performances continued.\n\nTrump said the approach would be “the fastest way” to elevate the center, adding that the planned grand reopening would surpass previous versions of the venue.\n\nThe Trump Kennedy Center did not immediately respond to Fox News Digital’s request for comment. \n\nTrump said the funds to carry out the renovation were already in place, though he did not provide an estimated cost or explain whether the project would be financed through federal funding, private contributions, or a combination of both.\n\nThe Trump Kennedy Center hosts hundreds of performances each year and is home to several resident companies. It was not immediately clear whether those events would be postponed or moved to other venues.\n\nSince his return to office, Trump has undertaken a series of changes aimed at reshaping the look and feel of the White House and other iconic Washington landmarks.\n\nIn October, Trump unveiled a new monument dubbed the “Arc de Trump,” which is planned to commemorate the nation’s 250th anniversary next year.\n\nHe has previously said that the large arch, a near twin of Paris’s iconic Arc de Triomphe, will welcome visitors crossing the Arlington Memorial Bridge from Arlington National Cemetery into the heart of the nation’s capital.\n\nTrump’s taste for opulence is evident in the Oval Office, where gold accents now line the ceiling and doorway trim, reflecting his personal style.\n\nBeyond the Oval Office, the administration has unveiled the “Presidential Walk of Fame,” a series of portraits of past presidents displayed along the West Wing colonnade.","summary":"President Donald Trump said Sunday that the Trump Kennedy Center will close later this year for a two-year period to undergo renovations.","url":"https://nypost.com/2026/02/01/us-news/trump-announces-two-year-closure-of-trump-kennedy-center-for-major-renovations/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/02/120222043.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/hktEQQcb-RyIcpnTz.mp4","publish_date":"2026-02-02 00:53:49","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":0.294},{"id":398423510,"title":"Iran stages Khamenei photos to mask cracks in IRGC, opposition groups say","text":"Iran’s regime released staged images of Supreme Leader Ayatollah Ali Khamenei in an attempt to show strength and boost a military under strain, according to opposition groups operating outside the country. The photographs, published by Iranian state media Jan. 31, marked Khamenei’s first public appearance in weeks and showed him praying at the tomb of Islamic Republic founder Ayatollah Ruhollah Khomeini as regime officials issued new threats against the U.S. and Europe. Ali Safavi, a senior official with the National Council of Resistance of Iran, said the images were aimed less at reassuring the public than at boosting morale among the regime’s weakening security forces. \"The images of Ali Khamenei were pure propaganda,\" Safavi told Fox News Digital. \"He wanted to show that he is not afraid of dying, but at the same time he is desperately trying to boost the morale of his demoralized forces.\" TRUMP SAYS IRAN CALLED 'NUMEROUS' TIMES TO MAKE DEAL AS CARRIER ENTERS MIDDLE EAST WATERS Safavi said the Islamic Revolutionary Guard Corps (IRGC) remains the backbone of the regime’s power but is showing signs of strain after weeks of suppressing nationwide protests. \"These images are intended to project strength and shore up the repressive forces,\" he said. \"But underneath, the regime is reeling from the reality that its criminal clique cannot break the will of the people and Khamenei knows the situation will never return to what it was before Dec. 28.\" The release of the photos coincided with calls from the European Parliament to designate the IRGC as a terrorist organization. HUNDREDS RALLY OUTSIDE IRANIAN UN AMBASSADOR'S FIFTH AVENUE RESIDENCE CALLING FOR REGIME CHANGE \"The IRGC is the backbone of this regime,\" Safavi said. \"Its disintegration can only occur after a fundamental shift in the balance of forces and with the presence of organized resistance on the ground. Only then do defections at lower levels of the military become meaningful.\" Tehran reacted angrily to the European move with Iranian lawmakers appearing in IRGC uniforms in a highly choreographed show of solidarity, according to reports. A banner reading, \"The Revolutionary Guard is the largest anti-terrorism organization in the world,\" was displayed at the speaker’s podium, and the IRGC flag was prominently featured, according to the Times of Israel. US MILITARY WARNS IRAN IT WILL NOT TOLERATE ANY 'UNSAFE' ACTIONS AHEAD OF LIVE-FIRE DRILLS IN STRAIT OF HORMUZ \"We saw the same thing when the U.S. designated the IRGC a foreign terrorist organization in 2019,\" Safavi said. \"More than half of these lawmakers are former IRGC commanders,\" he added. \"The IRGC dominates Iran’s economy and permeates the executive, legislative and judicial branches, as well as educational institutions.\" After the U.S. dispatched a naval strike group led by the USS Abraham Lincoln to the region, Khamenei also warned Sunday in comments reported by Iranian state media that any military action would trigger a wider regional conflict. \"We are not the ones who start a war,\" Khamenei said . \"But if America attacks or harms Iran, the Iranian nation will deliver a strong blow — and any war started by America will spread across the region,\" he said per reports. CLICK HERE TO DOWNLOAD THE FOX NEWS APP President Donald Trump said Sunday that if Iran does not reach a deal on its nuclear program, \"we’ll find out\" whether Khamenei’s warning proves correct. \"Doing business with Iran means doing business with the IRGC,\" Safavi said. \"The IRGC is the regime — even the clerics.\"","summary":"Iranian regime projects strength through staged images of Supreme Leader Ayatollah Ali Khamenei at prayers, a senior official with the National Council of Resistance of Iran said.","url":"https://www.foxnews.com/world/iran-stages-khamenei-photos-mask-cracks-irgc-opposition-groups-say","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/02/ali-khamenei-iran.jpg","video":null,"publish_date":"2026-02-02 00:52:54","author":"Emma Bussey","authors":["Emma Bussey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.032},{"id":398420176,"title":"Trump’s right on the UK’s ‘great stupidity’","text":"President Donald Trump’s justifiably scathing remarks about Britain’s insane plan to hand control of the Chagos Islands to the Republic of Mauritius seem to have hit their mark: London has now reopened talks on the plan with the White House.\n\nWhew. Cross your fingers Prime Minister Keir Starmer sees the light. If not, Trump will have to do whatever he can to stop the deal.\n\nThose islands, after all, are home to the joint US-UK military base Diego Garcia and are essential to the West’s global defense strategy.\n\n“The UK giving away extremely important land is an act of GREAT STUPIDITY, and is another in a very long line of National Security reasons why Greenland has to be acquired,” thundered Trump on Truth Social.\n\nSituated in the Indian Ocean, the base has played a key role in bombing strikes against Houthi targets in Yemen and humanitarian relief operations in Gaza.\n\nRecent White House national and global-security reassessments prompted Trump to withdraw US support for the UK plans to release the islands.\n\nMeanwhile, China has been making commercial investments in Mauritius and expanding its Belt and Road infrastructure — and dominance — there. \n\nWere it to gain a foothold in the Chagos, it would enable Beijing to disrupt military operations at Diego Garcia. \n\nBritish Conservative Party leader Kemi Badenoch one-upped Trump, calling the release of the islands “not just an act of stupidity, but of complete self sabotage.” Absolutely right. \n\nDiego Garcia is becoming even more vital to US Indo-Pacific military operations as China looks to project power beyond the South China Sea.\n\nThe base serves as a critical surveillance and rapid-response platform for the Middle East, South Asia and East Africa and as protection from Somali pirates and Houthi terrorists for ships in the Persian Gulf and other key shipping lanes.\n\nThe US Space Force also uses the base to monitor over 9,000 objects, including satellites, in orbit and deep space.\n\nFortunately, Parliament hasn’t ratified the agreement yet, so Trump is right to insist Starmer reconsider his plans before it does.\n\nIf not, Trump can unilaterally stop the handover by refusing to update the 1966 US-UK treaty needed to complete the deal. If it comes it, that’s exactly what he’ll need to do.\n\nLet’s face it, conflict with Beijing is becoming increasingly likely, and the only possible hope of deterring it will be an overpowering military that is well-positioned to counter any attacks.\n\nFor that to be a reality, Britain and the United States will need to keep control of those islands.","summary":"President Donald Trump's justifiably scathing remarks about Britain's insane plan to hand control of the Chagos Islands to the Republic of Mauritius seem to have hit their mark.","url":"https://nypost.com/2026/02/01/opinion/trumps-right-on-the-uks-great-stupidity/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/01/undated-file-photo-shows-diego-116986667_c1ac41-e1768935372616.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2026-02-02 00:49:51","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":0.131},{"id":398423582,"title":"US talking deal with 'highest people' in Cuba: Trump","text":"US President Donald Trump said Sunday that Washington was negotiating with Havana's leadership to strike a deal, days after he threatened Cuba's reeling economy with a virtual oil blockade..US allies, foes alarmed by capture of Venezuela's Maduro.\"Cuba is a failing nation. It has been for a long time, but now it doesn't have Venezuela to prop it up. So we're talking to the people from Cuba, the highest people in Cuba, to see what happens,\" Trump told reporters at his Mar-a-Lago estate in Palm Beach, Florida..\"I think we're going to make a deal with Cuba.\" .Trump gave no indication what such a deal might entail..His second administration has been ratcheting up pressure on the communist-run island nation off south Florida since the January 3 US ouster of Venezuelan leader Nicolas Maduro, whose country was a close ally of Havana and a crucial source for oil exports to Cuba. .US threatens tariffs on 'any country' selling oil to Cuba, a move that puts pressure on Mexico.On Thursday, the Republican president signed an executive order threatening to impose additional tariffs on countries that sell oil to Cuba..The following day, Cubans were queueing up in long lines at gas stations in Havana..Mike Hammer, the US charge d'affaires to Cuba since 2024, said during a visit this weekend to Trinidad province in central Cuba that he encountered residents who \"shouted some insults\" at him. .Cuban communist party.\"I think they belong to a certain party, but I know they do not represent the Cuban people, the ordinary Cubans,\" Hammer said in a video posted to X, in reference to the Cuban Communist Party. .Meanwhile, the US State Department's Bureau of Western Hemisphere Affairs said in a statement on X: \"The illegitimate Cuban regime must immediately stop its repressive acts of sending individuals to interfere with the diplomatic work of CDA Hammer and members of the @USembcuba team.\" .\"Our diplomats will continue to meet with the Cuban people despite the regime's failed intimidation,\" the agency added..Trump and Secretary of State Marco Rubio, the Miami-born son of Cuban exiles, have made no secret of their desire to bring regime change in Havana..After Maduro's fall, the US president warned Havana to \"make a deal soon\" or face unspecified consequences. .\"NO MORE OIL OR MONEY FOR CUBA: ZERO!\" Trump had stated earlier, claiming Cuba was \"ready to fall.\".Tariffs threat.Mexican President Claudia Sheinbaum said Sunday her administration was planning to send humanitarian aid to Cuba, including \"food and other products,\" while working on a diplomatic solution to continue sending oil to the island despite Trump's threatened tariffs..\"We never discussed with President Trump the issue of oil with Cuba,\" Sheinbaum added, after the two leaders had spoken by phone Thursday..For its part, Cuba's government has accused Trump of seeking to economically strangle the island, where daily power cuts are intensifying and lines at gas stations keep getting longer.","summary":"US talking deal with 'highest people' in Cuba: Trump","url":"https://gulfnews.com/world/americas/us-talking-deal-with-highest-people-in-cuba-trump-1.500428422","image":"https://media.assettype.com/gulfnews/2026-01-16/58vy1wq7/newsml_afp_com_20260116T234529Z_doc_92zr6rw.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2026-02-02 00:45:33","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"ae","sentiment":-0.137},{"id":398421130,"title":"Alex Pretti shooter Jesus Ochoa is a gun enthusiast with 25 rifles, pistols and shotguns, reveals ex-wife","text":"One of the federal agents identified in the fatal shooting of Alex Pretti in Minneapolis was described by his ex-wife as a long-time gun enthusiast, according to records obtained by ProPublica.Jesus Ochoa, a 43-year-old Border Patrol agent, was named alongside Customs and Border Protection officer Raymundo Gutierrez as the two federal officers who fatally shot Pretti on January 24 during a confrontation. The shooting occurred in Minneapolis as part of a bigger immigration enforcement effort by federal authorities under the Trump administration.Ochoa joined the US Customs and Border Protection’s Border Patrol in 2018 after earning a criminal justice degree from the University of Texas-Pan American, his ex-wife Angelica Ochoa told ProPublica. She said the couple divorced in 2021.By the time they separated, Angelica said, Ochoa had become deeply interested in firearms. She said that he owned about 25 rifles, pistols and shotguns, and that he was passionate about guns.Both Ochoa and Gutierrez are from South Texas. Gutierrez (35) joined CBP in 2014 and works in the agency’s Office of Field Operations, taking part in high-risk missions similar to those conducted by police special units.The shooting of Alex Pretti, a 37-year-old United States citizen and intensive care nurse, drew national attention and scrutiny. Pretti was killed after an encounter with federal agents during an immigration sweep in the city. Bystander videos show that Pretti was shot multiple times after he was wrestled and pinned down by multiple agents. Pretti had a licensed firearm but did not brandish his gun in any way; he was holding his phone in one hand and was trying to help a woman before federal agents took him down. Department of Homeland Security claims that the two officers fired their weapons following basic protocol and that Pretti could be a potential threat. Body-worn camera footage has not yet been released, and the agents have been placed on administrative leave.US President Donald Trump said the incident was unfortunate and said the FBI is investigating each and every bit of the case. However, the MAGA chief had called 37-year-old Renee Good a \"domestic terrorist\" earlier in January when she, too, was shot by an ICE agent in Minneapolis.","url":"https://timesofindia.indiatimes.com/world/us/alex-pretti-shooter-jesus-ochoa-is-a-gun-enthusiast-with-25-rifles-pistols-and-shotguns-reveals-ex-wife/articleshow/127849809.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-127849809/127849809.jpg","video":null,"publish_date":"2026-02-02 00:44:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.206},{"id":398423882,"title":"Trump Announces 2-Year Closure of Kennedy Center for Renovation","text":"President Donald Trump announced Sunday on Truth Social that the Trump Kennedy Center will close on July 4, 2026, for approximately two years of construction and renovation. Trump said the closure will transform the facility into what he described as “the finest Performing Arts Facility of its kind, anywhere in the World.“ The announcement follows the president's controversial 2025 decision to rename the historic institution, originally built as a memorial to former President John F. Kennedy. Newsweek reached out the White House and Kennedy Center via email on Sunday for comment. Why It Matters The facility serves as the nation's cultural center and a living memorial to Kennedy, hosting thousands of performances annually and attracting millions of visitors. A two-year closure would significantly impact Washington's cultural landscape, affecting artists, employees, and audiences who depend on the venue. The center was built and named to commemorate Kennedy after his assassination in 1963, and Trump's controversial renaming and planned renovation will cement his legacy on the American capital while proving contentious among those who want to preserve Kennedy's legacy. Prize-winning composer Philip Glass recently withdrew the world premiere of a new symphony from the Trump Kennedy Center, becoming the latest prominent artist to cancel a scheduled appearance at the Washington venue amid controversy surrounding its leadership under Trump. What To Know In a Truth Social post, Trump said the closure will allow for “complete rebuilding“ to transform the facility into what he described as “the finest Performing Arts Facility of its kind, anywhere in the World.“ The decision follows a one-year review involving contractors, musical experts, art institutions, and consultants who evaluated whether to pursue construction while maintaining operations or temporarily shutting down. Trump indicated the decision is “totally subject to Board approval“ and that financing is “completed, and fully in place.“ Trump's announcement characterizes the current Kennedy Center as “tired, broken, and dilapidated“ with conditions that have been “both financially and structurally“ poor “for many years.“ The president stated that partial construction while maintaining entertainment operations would result in lower quality work and longer completion times due to interruptions from ongoing performances. The planned closure would allow for uninterrupted construction, producing “a much faster and higher quality result,“ according to Trump. The renovation aims to create what the president called a “World Class Bastion of Arts, Music, and Entertainment“ that will be “far better than it has ever been before.“ A “spectacular Entertainment Complex“ is planned, with a grand reopening scheduled for approximately mid-2028. The president fired all the center's board members shortly after taking office and replaced them with allies who voted for him to be chairman of the board. The president then secured some $257 million in funding to renovate the venue. Fox News host Laura Ingraham, Attorney General Pam Bondi, and second lady Usha Vance were on the board and voted for the renaming. Ohio Representative Joyce Beatty, who also sits on the board, said she was muted on the call and not allowed to speak. What People Are Saying President Donald Trump: “This important decision, based on input from many Highly Respected Experts, will take a tired, broken, and dilapidated Center, one that has been in bad condition, both financially and structurally for many years, and turn it into a World Class Bastion of Arts, Music, and Entertainment.“ White House press secretary Karoline Leavitt said in December: “Not only from the standpoint of its reconstruction, but also financially, and its reputation. Congratulations to President Donald J. Trump, and likewise, congratulations to President Kennedy, because this will be a truly great team long into the future!“ Tennessee Democratic Representative Steve Cohen: “Renaming the Kennedy Center for Trump would be a sacrilege. JFK was a martyred, historic US president whose name is synonymous with artistic excellence in America. The idea that Trump would put his name BEFORE Kennedy's—or even alongside it—is obscene.“ Joe Kennedy III, Kennedy's grandnephew: “The Kennedy Center is a living memorial to a fallen president and named for President Kennedy by federal law. It can no sooner be renamed than can someone rename the Lincoln Memorial, no matter what anyone says.“ Maria Shriver, Kennedy's niece: “It is beyond comprehension that this sitting president has sought to rename this great memorial dedicated to President Kennedy. It is beyond wild that he would think adding his name in front of President Kennedy's name is acceptable. It is not.“ Erika Donalds, wife of Florida Republican Byron Donalds: “POTUS revived the Kennedy Center, rescuing it from financial ruin, physical decline, and reputational damage caused by years of Democrat mismanagement and liberal control. Renaming it the Trump-Kennedy Center is a well-deserved honor, one of many still to come!“ A tarp covering the the Kennedy Center is dropped as workers finish installing President Donald Trump's name on the facade of the building in Washington, D.C. on Friday, December 19, 2025. (Photo by Annabelle Gordon/Sipa USA)(Sipa via AP Images) What Happens Next The decision requires approval from the Kennedy Center's Board of Trustees before implementation. Update 2/1/26, 8:23 p.m. ET: This article has been updated with additional information.","summary":"The president announced the Kennedy Center will close July 4 for a two-year renovation to create a &quot;world class&quot; facility.","url":"https://www.newsweek.com/trump-announces-2-year-closure-of-kennedy-center-for-renovation-11450837","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/AP25353825652644.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-02 00:43:48","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","source_country":"US","sentiment":0.204},{"id":398424436,"title":"Gold extends biggest fall in over a decade as rally snaps back","text":"Spot gold dropped as much as 4% in early trading on Monday, while silver fell by a similar percentage to hold above US$80 an ounce. (EPA Images pic)\nSINGAPORE: Gold fell, extending its biggest plunge in more than a decade, as precious metals snapped back from a record-breaking rally that had run too far, too fast. Silver also slumped.\nSpot gold dropped as much as 4% in early trading on Monday, while silver fell by a similar percentage to hold above US$80 an ounce, having briefly dropped as far as 12%. The white metal recorded its biggest ever intraday decline in the previous session.\n“This isn’t over,” said Robert Gottlieb, a former precious metals trader at JPMorgan Chase & Co and now an independent market commentator. “We’ve got to see if it’s going to find support. The bottom line is that the trade was way too crowded.”\nOver the last year, precious metals have risen to all-time highs that have shocked even seasoned traders. The rally accelerated sharply in January, as investors piled into gold and silver on renewed concerns about geopolitical upheaval, currency debasement and the independence of the Federal Reserve.\nThe trigger for Friday’s dramatic selloff was the news that US President Donald Trump would nominate Kevin Warsh to lead the Fed, which sent the dollar higher and undercut sentiment among investors who had bet on Trump’s willingness to let the currency weaken.\nTraders regard Warsh as the toughest inflation fighter among the final candidates, raising expectations of monetary policy that would underpin the dollar and weaken greenback-priced bullion.\nBut precious metals had already been primed for extreme moves, as soaring prices and volatility strained traders’ risk models and balance sheets.\nA record wave of purchases of call options - contracts which give holders the right to buy at a pre-determined price - had “mechanically reinforcing upward price momentum,” Goldman Sachs Group Inc said in a note, as the sellers of the options hedged their exposure to rising prices by buying more.\nGold fell 2.2% to US$4,784.54 an ounce as of 8:05am Singapore time. Silver slid 2.1% to US$83.30. Platinum and palladium declined. The Bloomberg Dollar Spot Index, a gauge of the US currency, was flat after gaining 0.9% in the previous session.","summary":"Goldman Sachs reports that a record wave of call option purchases had mechanically reinforced the upward price momentum.","url":"https://www.freemalaysiatoday.com/category/business/2026/02/02/gold-extends-biggest-fall-in-over-a-decade-as-rally-snaps-back","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/03/d0f89bbe-gold-epa-140325.webp","video":null,"publish_date":"2026-02-02 00:43:32","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"my","sentiment":-0.246},{"id":398417782,"title":"Trump says Kennedy Center will cease entertainment operations for two years","text":"The John F. Kennedy Memorial Center for the Performing Arts should not host any events for two years, starting on July 4, President Donald Trump posted on Sunday.\"Based on these findings, and totally subject to Board approval, I have determined that the fastest way to bring The Trump Kennedy Center to the highest level of Success, Beauty, and Grandeur, is to cease Entertainment Operations for an approximately two year period of time, with a scheduled Grand Reopening that will rival and surpass anything that has taken place with respect to such a Facility before,\" Trump wrote on the social media platform Truth Social.The arts and entertainment center, in Washington, has been marked by turmoil in recent months following Trump's appointment as chairman, his push to change the organization's focus, plans for reconstruction and the board's addition of his name to the institution.The center historically has hosted over 2,000 events per year, according to the website, although many performers have pulled out of planned shows since Trump's shakeup began..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}Among those who cancelled performances in recent months are a touring production of the musical “Hamilton,” composer Philip Glass and actress Issa Rae.The Kennedy Center did not immediately respond to a request for comment Sunday.- EndsPublished By: Satyam SinghPublished On: Feb 2, 2026Tune In","url":"https://www.indiatoday.in/world/us-news/story/trump-orders-two-year-halt-kennedy-center-events-revamp-relaunch-glbs-2861569-2026-02-02","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/trump-kennedy-center-183741440-16x9.png?VersionId=hrBAN3l4J3bXwWauHOzZmwVlnIYHaD4b?size=1280:720","video":null,"publish_date":"2026-02-02 00:41:44","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"in","sentiment":-0.246},{"id":398423580,"title":"Venezuelan activist Javier Tarazona ends '1,675 days' of suffering in prison","text":"A renowned Venezuelan human rights activist was freed Sunday after more than four years in a notorious Caracas prison, saying he endured 1,675 days behind bars that were \"too much pain for a human being.\".\"The message remains the same: four years and seven months in prison did not silence the truth. The truth set me free,\" Javier Tarazona told AFP in an interview, hours after being released from the Helicoide prison, where he was held on charges including terrorism and treason..Venezuela releases dozens of prisoners in 2 days, 600 more still detained.FreedomThe dissident's release marked the latest step by Venezuela's interim president, Delcy Rodriguez, to free political prisoners. She has been under pressure from Washington to free prisoners after the United States ousted Nicolas Maduro on January 3 and declared it is in effect running the South American country..Tarazona spent \"1,675 days in a dark place,\" he said. \"It cannot be possible for this kind of case to keep happening.\".To cries of \"Freedom! Freedom! Freedom!\" and applause from Catholic faithful, the 43-year-old was taken from prison to the forecourt of a Caracas church..Released outside the church — authorities often do not free inmates in front of prisons — Tarazona was reunited with his brother and his mother, Teresa de Jesus Sanchez Garcia, 71..Then came Omar de Dios Garcia, an activist arrested while accompanying Javier Tarazona on July 2, 2021. The Tarazona brothers and De Dios, who at one point shared the same cell for four months, embraced for a long time..\"Javier is free at last,\" his brother Rafael told AFP..The men prayed together and then left, as the faithful at La Candelaria church clapped..\"People are applauding out of a great longing for freedom, out of hope for reunions among Venezuelans, out of joy,\" Javier Tarazona said. .\"People fervently wish that we can embrace one another with joy, with enthusiasm. Without fear.\".'Discombobulator': Top-secret device used in the Maduro raid? What we know so far.Amnesty for political prisoners.One of Venezuela's most prominent jailed dissidents, Tarazona is among roughly 1,000 political prisoners, some of whom are gradually being freed as Venezuela seeks reforms after many years of authoritarian leftist rule. .He was freed two days after Rodriguez announced the closure of Helicoide and a general amnesty law..This in turn came less than a month after US forces attacked Caracas and seized Maduro, whisking him and his wife Cilia Flores away to New York to face US drug-trafficking charges..Why has Trump attacked Venezuela and captured Maduro? What happens next?.Tarazona is a major opposition figure in Venezuela. Amnesty International and other human rights groups had been calling for his release. .The rights group Foro Penal says there are still 711 political prisoners held in Venezuela..The government has started to release some, but relatives of those detained and rights groups say the process is too slow. The amnesty is expected to speed things up..Tarazona, director of the rights NGO Fundaredes, had been imprisoned since July 2021. Besides treason and terrorism he was accused of incitement to hatred..He is known for his role in reporting clashes between military forces and guerrilla groups along the porous 2,000-kilometer (1,240-mile) Colombia-Venezuela border. .Fundaredes had accused the Maduro government of harboring Colombian guerrilla leaders in Venezuela..US President Donald Trump says his administration is now running Venezuela and has allowed Rodriguez to be interim leader so long as she toes Washington's line -- in particular granting US access to Venezuela's vast oil reserves..Rodriguez has quickly moved to overhaul Venezuelan society in ways sought by the Trump administration..\"The closure of the Helicoide does not solve the problem of injustice in this country. If closing the Helicoide means erasing a memory, I believe we have to work to ensure it does not happen again,\" Tarazona said.","summary":"Prominent Venezuelan activist released after over four years in jail","url":"https://gulfnews.com/world/americas/venezuelan-activist-javier-tarazona-ends-1675-days-of-suffering-in-prison-1.500428401","image":"https://media.assettype.com/gulfnews/2026-02-01/jg7m9l5r/newsml_afp_com_20260201T181506Z_doc_94r82wf.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2026-02-02 00:40:57","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"ae","sentiment":0.022},{"id":398423482,"title":"The Rightward Drift of Latin America","text":"Last month, conservative Jose Kast defeated communist Jeannette Jara to become the next president of Chile. While Kast is a social conservative, he ran on a platform centered around illegal immigration and crime, two of the issues voters were most concerned about. In addition, Kast promises deregulation, tax cuts, and expansion of mining in the country.\n\nThe election of Kast provides an opportunity for President Trump to further his own agenda. For one thing, Kast’s focus on crime and immigration is shared with Donald Trump. Closer cooperation between US law enforcement and Chilean authorities can work to counter cartel operations in Chile, therefore preventing drugs and illegal immigration from reaching the US. In addition, Kast and Chile can help counter Venezuelan dictator Nicholas Maduro. If the US military is going to step up operations against Maduro, it would benefit from as many allies as possible.\n\nThe benefits to the US of a Kast victory go beyond security. One of the priorities of the incoming Kast administration is mining. Chile is already one of the world’s leading producers of copper and lithium, and it is working to expand its mining of other rare earth metals. The global economy depends on these metals in the production of everything from cellphones to military technology. China is the world leader in mining and processing of these metals. China is one of the United States’ chief adversaries, so the US cannot rely on China to supply it with these critical minerals. Therefore, mining deals with alternative sources are vital.\n\nElsewhere in Latin America, Honduras elected Trump-endorsed conservative Nasry Asfura, who won a closely contested election to become president. Like in Chile, Asfura replaces a deeply unpopular socialist government. To illustrate the unpopularity of the incumbent LIBRE party, their candidate finished a distant third with a mere 19% of the vote. The candidate Asfura defeated is from another right-wing party.","url":"https://hotair.com/headlines/2026/02/01/the-rightward-drift-of-latin-america-n3811423","image":null,"video":null,"publish_date":"2026-02-02 00:40:00","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":0.113},{"id":398422586,"title":"Donald Trump says latest release of Epstein files clear his name despite them detailing 'an alleged sex assault on a young girl'","text":"Donald Trump insisted the latest Epstein files ‘absolve’ him of any wrongdoing – claiming it was the ‘opposite of what people were hoping for’, despite the files containing an allegation of a sex act involving a young teenage girl.\n\nThe Department of Justice published more than 3million additional pages on Friday, including 2,000 videos and 180,000 images.\n\nThey also included images of Brett Ratner, the director of the new documentary about the President’s wife Melania, embracing a young woman next to Epstein.\n\nResponding to the files’ release, Mr Trump said: ‘I didn’t see it myself but I was told by some very important people that not only does it absolve me, it’s the opposite of what people were hoping, you know, the radical Left.’\n\nSexual assault allegations against him emerged in the files but were removed just hours after being published. An FBI record contained a claim that a 13 or 14-year-old girl was forced to perform a sex act on Mr Trump decades ago.\n\nThe document containing the uncorroborated tip about Mr Trump and a teenage girl disappeared from the files but was later restored. The tip is unverified and has been strongly rejected by the White House.\n\nMr Trump has denied any wrongdoing in relation to Epstein and has not been accused of any crimes by Epstein’s victims.\n\nThe President also threatened to sue Epstein’s estate, and his friend-turned-nemesis Michael Wolff, for allegedly ‘conspiring’ to destroy his political career in emails shown in the files. \n\nSpeaking on board Air Force One, Mr Trump said: ‘Wolff, who’s a third-rate writer, was conspiring with Jeffrey Epstein to hurt me politically or otherwise and that came through loud and clear. \n\n'So we’ll probably sue Wolff on that… Maybe the Epstein estate, I guess. I don’t know. But we’ll certainly sue Wolff.’\n\nIn the pictures of Brett Ratner, 56, known for the Rush Hour movies, he can be seen sitting on a sofa alongside Epstein and two woman whose faces have been obscured.\n\nThere is no indication of wrongdoing from the files. The Melania film is Mr Ratner’s first project since he was accused of sexual misconduct during the #MeToo movement.\n\nMeanwhile Democrats on the House Oversight Committee have accused Mr Trump and the Department of Justice of withholding around half of the Epstein files.\n\nBut Attorney General Pam Bondi said Friday’s release ‘marks the end’ of the government’s efforts to comply with the Epstein Files Transparency Act – which was signed by Mr Trump in November last year.","summary":"A document containing a sexual assault allegation against the US President emerged in the latest Epstein files but was removed just hours after being published - before then later being restored.","url":"https://www.dailymail.co.uk/news/article-15518437/Donald-Trump-Epstein-files-alleged-sex-assault-young-girl.html","image":"https://i.dailymail.co.uk/1s/2026/02/02/00/106019955-0-image-m-26_1769991381803.jpg","video":"https://video.dailymail.com/video/mol/2025/07/18/8629419139048820171/1024x576_MP4_8629419139048820171.mp4","publish_date":"2026-02-02 00:39:44","author":"Editor,Tom Midlane","authors":["Editor","Tom Midlane"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.304},{"id":398419086,"title":"Kennedy Center to close for 2 years for renovations in July, Pres. Trump says","text":"President Donald Trump said Sunday he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction.\n\nTrump's announcement on social media follows a wave of cancellations since Trump ousted the previous leadership and added his name to the building. Trump made no mention in his post of the recent cancellations.\n\nTrump announced his plan days after the premiere of \"Melania\" a documentary of the first lady was shown at the storied venue. The proposal, he said, is subject to approval by the board of the Kennedy Center, which has been stocked with his hand-picked allies. Trump himself chairs the center's board of trustees.\n\n\"This important decision, based on input from many Highly Respected Experts, will take a tired, broken, and dilapidated Center, one that has been in bad condition, both financially and structurally for many years, and turn it into a World Class Bastion of Arts, Music, and Entertainment,\" Trump wrote in his post.\n\nLeading performing arts groups have pulled out of appearances, most recently, composer Philip Glass, who announced his decision to withdraw his Symphony No. 15 \"Lincoln\" because he said the values of the center today are in \"direct conflict\" with the message of the piece.\n\nEarlier this month, the Washington National Opera announced that it will move performances away from the Kennedy Center in another high-profile departure following Trump's takeover of the U.S. capital's leading performing arts venue.\n\nA spokesperson for the Kennedy Center did not immediately respond to an emailed request for comment.","url":"https://abc13.com/post/kennedy-center-close-2-years-renovations-july-president-donald-trump-says-performers-backlash/18523962/","image":"https://cdn.abcotvs.com/dip/images/18524014_020126-kgo-ap-kennedy-center-donald-trump-split-img.jpg?w=1600","video":null,"publish_date":"2026-02-02 00:39:21","author":"Michelle L. Price","authors":["Michelle L. Price"],"language":"en","category":"politics","source_country":"us","sentiment":0.093},{"id":398418490,"title":"Kennedy Center to close for 2 years for renovations in July, Pres. Trump says","text":"President Donald Trump said Sunday he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction.\n\nTrump's announcement on social media follows a wave of cancellations since Trump ousted the previous leadership and added his name to the building. Trump made no mention in his post of the recent cancellations.\n\nTrump announced his plan days after the premiere of \"Melania\" a documentary of the first lady was shown at the storied venue. The proposal, he said, is subject to approval by the board of the Kennedy Center, which has been stocked with his hand-picked allies. Trump himself chairs the center's board of trustees.\n\n\"This important decision, based on input from many Highly Respected Experts, will take a tired, broken, and dilapidated Center, one that has been in bad condition, both financially and structurally for many years, and turn it into a World Class Bastion of Arts, Music, and Entertainment,\" Trump wrote in his post.\n\nLeading performing arts groups have pulled out of appearances, most recently, composer Philip Glass, who announced his decision to withdraw his Symphony No. 15 \"Lincoln\" because he said the values of the center today are in \"direct conflict\" with the message of the piece.\n\nEarlier this month, the Washington National Opera announced that it will move performances away from the Kennedy Center in another high-profile departure following Trump's takeover of the U.S. capital's leading performing arts venue.\n\nA spokesperson for the Kennedy Center did not immediately respond to an emailed request for comment.","summary":"President Donald Trump said Sunday he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction.","url":"https://abc7news.com/post/kennedy-center-close-2-years-renovations-july-president-donald-trump-says-performers-backlash/18523962/","image":"https://cdn.abcotvs.com/dip/images/18524014_020126-kgo-ap-kennedy-center-donald-trump-split-img.jpg?w=1600","video":null,"publish_date":"2026-02-02 00:39:21","author":"Michelle L. Price","authors":["Michelle L. Price"],"language":"en","category":"politics","source_country":"US","sentiment":0.093},{"id":398418890,"title":"World News | Nationwide 'ICE Out' Protests Sweep US Against Trump Administration's Immigration Policies","text":"Washington DC [US], February 2 (ANI): Protests swept across the United States over the weekend as demonstrators rallied under the slogan \"ICE Out\", demanding an end to the Trump administration's immigration enforcement measures, CNN reported.\nThe protests marked a second consecutive day of demonstrations after a nationwide strike on Friday disrupted schools, workplaces, and businesses across several states, with large rallies and marches reported in major cities including Minneapolis, New York, Los Angeles, Portland, and Austin.\nAlso Read | Mehdi Mahmoudian Arrested: Oscar-Nominated Screenwriter of Iranian Drama 'It Was Just an Accident' Held in Tehran Weeks Before Academy Awards.\nAccording to CNN, protests gained momentum following recent incidents in Minneapolis, where the deaths of Alex Pretti and Renee Good during immigration enforcement actions have intensified public scrutiny of federal tactics, making the incidents focal points in the broader national debate over immigration policy.\nThe protest also led to major legal development in the country, with a federal judge on Saturday ordering the release of five-year-old Liam Conejo Ramos and his father from a detention facility in Texas, issuing a strongly worded opinion critical of the government's actions.\nAlso Read | Russian Drones Kill at Least 12 in Dnipro As Ukrainian President Volodymyr Zelenskyy Says More Russia-Ukraine Talks Next Week.\nThe child and his father returned to Minneapolis on Sunday, according to Texas Representative Joaquin Castro, CNN reported.\nThe detention of the child had further fuelled the widespread outrage and become a symbol of opposition to what critics describe as heavy-handed enforcement practices by federal authorities.\nHowever, the Trump administration also had its small share of wins when a separate court ruling denied a request by the State of Minnesota and the cities of Minneapolis and St Paul to halt Operation Metro Surge, a large-scale federal immigration operation currently underway in the Twin Cities, CNN reported.\nThe operation involves thousands of federal agents and will continue as legal proceedings move forward amid the raging protests.\nThe US Department of Homeland Security (DHS) welcomed the ruling, while state and city officials expressed disappointment, noting that they would continue pursuing the case, which alleges unlawful arrests and excessive use of force, CNN reported.\nAmid the unrest, US President Donald Trump instructed the DHS not to deploy federal intervention in Democratic-led cities unless formally requested by local authorities.\nIn a post on Truth Social on Saturday, Trump directed Secretary of Homeland Security Kristi Noem not to intervene in \"protests and/or riots\" in Democratic-led cities amid mounting criticism over his administration's use of aggressive immigration enforcement measures.\n\"I have instructed Secretary of Homeland Security, Kristi Noem, that under no circumstances are we going to participate in various poorly run Democrat Cities with regard to their Protests and/or Riots unless, and until, they ask us for help,\" his post read.\nMeanwhile, in Chicago, Mayor Brandon Johnson signed an executive order directing city police to document and investigate alleged misconduct by federal immigration officers. The move follows the formation of a coalition of nine local district attorneys to prosecute federal officers accused of violating state laws, CNN reported.\nSeparately, the US Department of Justice has launched a civil rights investigation into the fatal shooting of Alex Pretti by federal officers, with US Deputy Attorney General Todd Blanche stating that the investigation would examine whether the officers involved violated the law, adding later that the inquiry is being conducted by the FBI. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Protests swept across the United States over the weekend as demonstrators rallied under the slogan &quot;ICE Out&quot;, demanding an end to the Trump administration's immigration enforcement measures, CNN reported.","url":"https://www.latestly.com/agency-news/world-news-nationwide-ice-out-protests-sweep-us-against-trump-administrations-immigration-policies-7297617.html","image":"https://st1.latestly.com/wp-content/uploads/2026/02/ANI-20260201213332.jpg","video":null,"publish_date":"2026-02-02 00:38:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.111},{"id":398423062,"title":"Trump-Loving Singer Trades MAGA Fashion For A New 2-Word Statement","text":"Joy Villa walked the Grammys red carpet Sunday night wearing a blue jumpsuit with the words “Scientology Kills” across the chest. Villa paired the blue jumpsuit with a pink fuzzy coat that had little notes attached with names of people who allegedly have had ties with Scientology. \n\nThe singer is used to making a literal statement with her Grammys red carpet looks, often championing conservative topics, such as President Donald Trump and the anti-abortion movement. At the 2017 Grammy awards, Villa wore a dress that read “Make America Great Again” and then, at the 2018 show, she wore a white dress with a fetus inside a rainbow, along with the words “Choose Life.” At the 2020 Grammys, she again supported Trump with a dress that read “impeached and re-elected” on the back.\n\nIn May 2025, Villa announced in a live video on social media that she had left Scientology after 15 years with the church. Earlier this month, she wrote an essay for the publication Evie, saying the religion was “slowly destroying” her. She said she gave Scientology $2 million.\n\n“I was working twelve-hour days, mentally depleted, spiritually numb, emotionally unraveling,” Villa wrote. “I was deeply depressed. So depressed that I began to scare myself. I did not want to die, but I no longer wanted to live.”\n\nShe continued, saying Scientology took credit for her success. \n\n“Every achievement was attributed not to God, not to talent, not to perseverance, but to auditing, donations, and loyalty to the organization,” Villa wrote. “My success became propaganda. My life became marketing.”\n\nOne of the names on Villa’s jacket is Philip Gale, a software internet developer, who died by suicide in 1998. Leaving Scientology was said to have been a “traumatic” experience for him.","url":"https://www.huffpost.com/entry/trump-loving-singer-trades-maga-fashion-for-a-new-2-word-statement_n_697fe607e4b00b8d44e30988?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/697feaf21b0000a3786fe7b8.jpeg?ops=1778_1000","video":null,"publish_date":"2026-02-02 00:37:59","author":"Paige Skinner","authors":["Paige Skinner"],"language":"en","source_country":"us","sentiment":-0.464},{"id":398417838,"title":"Trump-Loving Singer Trades MAGA Fashion For A New 2-Word Statement","text":"Joy Villa walked the Grammys red carpet Sunday night wearing a blue jumpsuit with the words “Scientology Kills” across the chest. Villa paired the blue jumpsuit with a pink fuzzy coat that had little notes attached with names of people who allegedly have had ties with Scientology. \n\nThe singer is used to making a literal statement with her Grammys red carpet looks, often championing conservative topics, such as President Donald Trump and the anti-abortion movement. At the 2017 Grammy awards, Villa wore a dress that read “Make America Great Again” and then, at the 2018 show, she wore a white dress with a fetus inside a rainbow, along with the words “Choose Life.” At the 2020 Grammys, she again supported Trump with a dress that read “impeached and re-elected” on the back.\n\nIn May 2025, Villa announced in a live video on social media that she had left Scientology after 15 years with the church. Earlier this month, she wrote an essay for the publication Evie, saying the religion was “slowly destroying” her. She said she gave Scientology $2 million.\n\n“I was working twelve-hour days, mentally depleted, spiritually numb, emotionally unraveling,” Villa wrote. “I was deeply depressed. So depressed that I began to scare myself. I did not want to die, but I no longer wanted to live.”\n\nShe continued, saying Scientology took credit for her success. \n\n“Every achievement was attributed not to God, not to talent, not to perseverance, but to auditing, donations, and loyalty to the organization,” Villa wrote. “My success became propaganda. My life became marketing.”\n\nOne of the names on Villa’s jacket is Philip Gale, a software internet developer, who died by suicide in 1998. Leaving Scientology was said to have been a “traumatic” experience for him.","url":"https://www.huffpost.com/entry/trump-loving-singer-trades-maga-fashion-for-a-new-2-word-statement_n_697fe607e4b00b8d44e30988?origin=home-entertainment-feed-unit","image":"https://img.huffingtonpost.com/asset/697feaf21b0000a3786fe7b8.jpeg?ops=1778_1000","video":null,"publish_date":"2026-02-02 00:37:59","author":"Paige Skinner","authors":["Paige Skinner"],"language":"en","source_country":"au","sentiment":-0.464},{"id":398418128,"title":"Trump announces two-year closure of embattled Kennedy Center","text":"President Donald Trump announced on Sunday that the embattled Kennedy Center will close for two-years as it undergoes renovations. \n\n\"After a one year review of The Trump Kennedy Center, that has taken place with Contractors, Musical Experts, Art Institutions, and other Advisors and Consultants, deciding between either Construction with Closure and Re-Opening or, Partial Construction while continuing Entertainment Operations through a much longer period of time, working in and around the Performances, I have determined that The Trump Kennedy Center, if temporarily closed for Construction, Revitalization, and Complete Rebuilding, can be, without question, the finest Performing Arts Facility of its kind, anywhere in the World,\" Trump wrote in a lengthy Truth Social post on Sunday. \n\nThe president made the announcement at a time when the Kennedy Center's bookings had dried up in protest of the Trump administration. Artists ranging from Béla Fleck to Issa Rae and The Cookers have all cancelled their Kennedy Center dates. \n\nThe Kennedy Center is scheduled to close on July 4, according to Trump's post.","summary":"President Donald Trump announced on Sunday that the embattled Kennedy Center will close for two-years as it undergoes renovations. \n\n\"After a one year review of The Trump Kennedy Center, that has taken place with Contractors, Musical Experts, Art Institutions, and other Advisors and Consultants, deciding between either Construction with Closure and Re-Opening or, Partial Construction while continuing Entertainment Operations through a much longer period of time, working in and around the Performances, I have determined that The Trump Kennedy Center, if temporarily closed for Construction, Revitalization, and Complete Rebuilding, can be, without question, the finest Performing Arts Facility of its kind, anywhere in the World,\" Trump wrote in a lengthy Truth Social post on Sunday. \n\nThe president made the announcement at a time when the Kennedy Center's bookings had dried up in protest of the Trump administration. Artists ranging from Béla Fleck to Issa Rae and The Cookers have all cancelled their Kennedy Cente","url":"https://www.rawstory.com/trump-2675067339/","image":"https://www.rawstory.com/media-library/president-donald-trump-poses-on-the-red-carpet-for-the-2025-kennedy-center-honors-at-the-john-f-kennedy-center-for-the-performi.jpg?id=62651163&width=1200&height=1200&coordinates=817%2C0%2C818%2C0","video":null,"publish_date":"2026-02-02 00:35:59","author":"Robert Davis","authors":["Robert Davis"],"language":"en","source_country":"US","sentiment":-0.233}]}