{"offset":0,"number":50,"available":13767,"news":[{"id":392293336,"title":"Trump admin sends more agents to Minneapolis despite furor over woman&#8217;s killing","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUS Customs and Border Protection agents patrol a neighborhood during immigration enforcement activity in Minneapolis in Minneapolis, Minnesota, on January 11, 2026. A US Immigration and Customs Enforcement (ICE) agent shot and killed 37-year-old Renee Nicole Good on the streets of Minneapolis on January 7, leading to huge protests and outrage from local leaders who rejected White House claims she was a domestic terrorist. (Photo by Octavio JONES / AFP) \n\n International News, Latest News \n\nJanuary 11, 2026\n\n\n\n\n Trump admin sends more agents to Minneapolis despite furor over woman’s killing \n\n\n\n\n\n\n\nMINNEAPOLIS, United States (AFP)—US Homeland Security Secretary Kristi Noem said Sunday that hundreds more federal agents were heading to Minneapolis, brushing aside demands by the city’s Democratic leaders to leave after an immigration officer fatally shot a woman protester.\n\nIn multiple TV interviews, Noem defended the actions of the officer who shot and killed 37-year-old Renee Nicole Good, whose death has sparked renewed protests nationwide against President Donald Trump’s aggressive immigration crackdown.\n\nNoem reiterated her claim that Good’s actions in the Midwestern city on Wednesday amounted to “domestic terrorism,” and that the agent acted in self-defense when he fatally shot Good in her car.\n\nProminent Democratic officials, including Minnesota Governor Tim Walz and Minneapolis Mayor Jacob Frey, have strongly disputed this narrative, saying viral footage from the scene shows Good’s vehicle turning away from the agent and posing no threat to his life.\n\nNoem, when pressed repeatedly by CNN about how she could make such definitive statements while an investigation into the incident had just begun, insisted she and the administration were in the right.\n\n“Why are we arguing with a president who’s working to keep people safe?” she said.\n\nSpeaking separately to the conservative Fox News network, Noem said hundreds more officers will arrive Sunday and Monday, to allow immigration agents “that are working in Minneapolis to do so safely.”\n\nIf protesters “conduct violent activities against law enforcement, if they impede our operations, that’s a crime, and we will hold them accountable to those consequences,” Noem told “Sunday Morning Futures.”\n\n– ‘Extremely politicised’ –\n\nMeanwhile confrontations between federal agents and protesters continued Sunday in Minneapolis, with officers seen using pepper spray against people holding signs outside an Immigration and Customs Enforcement (ICE) facility in the city.\n\nNoem accused Democrats of encouraging violence against immigration officers.\n\n“These locals, if you look at what Governor Walz has said, if you look at what Mayor Frey has said, they’ve extremely politicized and inappropriately talked about the situation on the ground in their city,” she told CNN’s “State of the Union.”\n\n“They’ve inflamed the public. They’ve encouraged the kind of destruction and violence that we’ve seen in Minneapolis the last several days.”\n\nSince Wednesday’s shooting, thousands of people have demonstrated, largely peacefully, in several cities across the country including Minneapolis, where 29 people were detained and then released Friday, according to police.\n\nThe protesters have demanded a full investigation into the circumstances of the deadly encounter.\n\nDemocratic officials are particularly critical of the fact that local authorities have been excluded from the investigation, which is being conducted by the FBI.\n\n“It should be a neutral, unbiased investigation where you get the facts,” Frey told CNN.\n\nHe also described as legitimate activists’ actions to disrupt immigration enforcement operations, such as one in which Good was involved.\n\n“You need to enforce laws, of course, but there’s also a requirement that you carry out laws and carry out enforcement in a constitutional way,” Frey added.\n\n“We’ve got pregnant women getting dragged through the street. We’ve got high schoolers just getting — American citizens, by the way — getting taken away.”\n\nOn Sunday agents were carrying out Trump’s immigration crackdown and were seen detaining people in residential areas. People were also seen laying flowers at makeshift memorials honoring Good.\n\nThe federal security operation in Minneapolis occurred amid a highly politicized fraud investigation in Minnesota.\n\n\n\n\n\n\n\n\nTags: ICE agents Minneapolis US \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n St Catherine taxi operator charged with murder \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n St CATHERINE, Jamaica – A St Catherine taxi operator has been charged with murder following the stabbing death of a man in Portmore, St Catherine on J... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n American woman among two charged following St Mary firearm seizure \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n ST MARY, Jamaica–An American sterile surgical technician is among two charged with possession of a prohibited weapon and unauthorised possession of am... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Man United knocked out of FA Cup by Brighton, Martinelli hits hat-trick for Arsenal \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n MANCHESTER, United Kingdom (AFP)—Manchester United crashed out of the FA Cup with a meek 2-1 home defeat to Brighton on Sunday as Gabriel Martinelli's... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Barca edge Real Madrid in thrilling Spanish Super Cup final \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n JEDDAH, Saudi Arabia (AFP)—Barcelona retained the Spanish Super Cup with a thrilling 3-2 Clasico win over Real Madrid in Saudi Arabia on Sunday. Raphi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Over 3,400 candidates with varying disabilities sat CXC examinations in 2025 \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—A total of 3,444 special needs students across the Caribbean, the majority of whom were visually-impaired, sat examinations administ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Shanoya Douglas tastes rare defeat at hand of Trinidadian Alexxe Henry \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica— Jamaica’s rising star Shanoya Douglas was beaten into second place in the Class One 100m at the PureWater/RDanny Williams/JC develo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Natesha defends wifeys with ‘Louis V’ \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n US-based dancehall artiste Natesha is one of those rare talents who proves with her latest release, Louis V , that modern-day female artistes don't al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/11/trump-admin-sends-agents-minneapolis-despite-furor-womans-killing/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2026/01/AFP__20260111__92CQ93R__v1__MidRes__UsImmigrationOfficerKillsWomanInMinneapolis-1024x683.jpg","video":null,"publish_date":"2026-01-12 03:00:35","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.023},{"id":392295380,"title":"Calgary's Iranian community calls on world leaders to take action","text":"“Some Iranians are fortunate enough to have access to Starlink, and that’s helped a lot for some people to get some videos out,” he said. “A couple of people get in touch with their families, but most of these people, I would say 95 per cent, have no idea what’s happening.\n\n“They don’t know if their families went out on the streets, if they’ve passed away, hurt, arrested, or stayed at home because there is literally no point of contact.”\n\nZarringhala said he hopes the messages in downtown Calgary and around the world will inspire global leaders to take action, particularly U.S. President Donald Trump.\n\n“We call on President Trump, who’s been telling the people that he’s going to step in,” Zarringhala said. “He’s going to help. He’s going to free Iran. Please do it quicker. People are dying in the masses. Don’t wait before it’s too late. Get rid of these people. That’s what we’re pushing for.”\n\nHe hopes to see military action, similar to the U.S. military invasion that led to the capture of former Venezuelan President Nicolás Maduro.","url":"https://calgarysun.com/news/calgary-iranian-community-calls-world-leaders-take-action-civil-unrest-iran","image":"https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2026/01/Iran-rally-011126-8-copy.jpg","video":null,"publish_date":"2026-01-12 00:04:51","author":"Daniel Gonzalez","authors":["Daniel Gonzalez"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.497},{"id":392294340,"title":"Rand Paul says bombing Iran will help regime as Trump considers strikes","text":"A GOP senator who has frequently broken with the president on issues of foreign policy and government spending warned Donald Trump against invading or launching strikes in Iran on Sunday after the president released several statements on Truth Social indicating that he was considering supporting protests within the country with military or other assistance.\n\nSen. Rand Paul spoke on ABC’s This Week as it was reported that the president was briefed in recent days on options for military strikes within the country. It isn’t clear what the administration’s target or goal for military action would be if strikes were to be authorized by the president.\n\nPaul told ABC that while the protests, which are now nearing a third week, are a sign that many Iranians are tired to living under the current regime, there isn’t enough evidence that they were calling for or wanted U.S. intervention of any kind.\n\n\"I don't think it's the job of the American government to be involved with every freedom movement around the world,\" Paul told ABC’s Martha Raddatz. \"I think the protests are directed at the Ayatollah, justifiably so, and the best way is to encourage them and say that, of course, we would recognize a government that is a freedom-loving government that allows free elections. But bombing is not the answer.”\n\n“[W]hen you bomb a country, then people tend to rally around their own flag,” Paul said. “They tend to see this as the — you know, a foreign country coming in and bombing us. And so, I don't think it always has that [intended] effect.” \n\nPaul was one of five Republican senators who broke party lines to support a War Powers resolution aimed at restricting Trump’s military campaign against Venezuela on Thursday, causing the measure to pass the Republican-controlled Senate in a rare victory for Democrats.\n\nOne of Paul’s colleagues, Sen. Lindsey Graham, has called for the U.S. to directly support protestors as the death toll continues to climb amid a security forces crack down.\n\nTrump himself issued a pair of statements on Truth Social vowing to support Iranian protesters in the event of a violent crackdown, which seems to have occurred in many areas.\n\nGraham is publicly and privately urging Trump to take action to topple the Iranian regime, of which the South Carolina senator has been a vocal critic on the Hill for years. During both of Trump’s presidency, the senator supported military action against the Iranian government including the killing of Revolutionary Guard chief Qassem Soleimani and, years later, targeted strikes against Iranian nuclear facilities.\n\nTrump is also seeing calls for intervention from the likes of Reza Pahlavi, son of the deposed former Shah of Iran. Pahlavi now lives in northern Virginia. He has publicly encouraged the protesters and his supporters (largely in the U.S. and Europe) claim that demonstrators are pining for his return. \n\nOther Iranian dissident groups like the MEK-linked National Council of Resistance of Iran (NCRI) have amplified the protests but do not support military action by the U.S., calling instead for countries to expel Iranian diplomats and shutter the regime’s embassies.\n\nLast week, Paul didn’t take a position when asked by The Independent whether he would also support a War Powers resolution introduced by Sen. Ruben Gallego that would prevent the administration from going to war over Greenland. On Sunday, however, he said that a similar or greater level of resistance existed in the Senate against that idea.\n\n“I think you'd be hard-pressed to find someone in Greenland for it, but you'd also be hard-pressed to find somebody in Washington who's for a military invasion on either side of the aisle. So, I think there'll be enough pressure to stop it. But the problem is, is they keep rattling the saber,” Paul said on Sunday.\n\nAdding that he didn’t dispute that there were reasons for the U.S. to consider purchasing Greenland, the senator added that Trump’s rhetoric made that prospect much harder.\n\n“You don’t get there by angering and denigrating the people who live there,” said Paul.","summary":"More than 500 reported dead as security forces crack down on protests which are entering third week","url":"https://www.independent.co.uk/news/world/americas/us-politics/rand-paul-trump-iran-bombing-b2898464.html","image":"https://static.independent.co.uk/2026/01/11/22/36/paul_abc_126.jpg?crop=417,278,x42.5,y0&trim=0,43,0,42&width=1200","video":"https://cdn.jwplayer.com/videos/mEz4ftD6-4VHSaSK0.mp4","publish_date":"2026-01-11 23:10:01","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.09},{"id":392294334,"title":"The Latest: Golden Globes to kick off Hollywood's 2026 awards season","text":"Hollywood’s awards season will kick off with the 83rd Golden Globe Awards at 8 p.m. Eastern/5 p.m. Pacific.\n\nComedian Nikki Glaser returns for a second year to host the ceremony at the Beverly Hilton in Beverly Hills, California. It’s a champagne-soaked party featuring some of the biggest names in film and television, even if the awards won’t exactly forecast the Oscars. \n\n“One Battle After Another” topped the list of nominations with nine, closely followed by “Sentimental Value” with eight. “Wicked: For Good” was snubbed for best picture and best director. Others left out include Joe Rogan (for the new podcast category ), Sydney Sweeney and Gwyneth Paltrow, leaving room for plenty of surprise inclusions. See the full list of nominees.\n\nThe Globes will be broadcast on CBS and available to stream through Paramount+.\n\nThe Latest:\n\n Who’s presenting the awards \n\nThe presenters announced Thursday feature a mix of Hollywood A-listers like George Clooney, Julia Roberts and Queen Latifah, along with rising stars like the leads from “Heated Rivalry,” Connor Storrie and Hudson Williams.\n\nAdditional presenters include: Amanda Seyfried, Ana de Armas, Ayo Edebiri, Charli xcx, Chris Pine, Colman Domingo, Dakota Fanning, Dave Franco, Diane Lane, Hailee Steinfeld, Jason Bateman, Jennifer Garner, Joe Keery, Judd Apatow, Justin Hartley, Kathryn Hahn, Keegan-Michael Key, Kevin Bacon, Kevin Hart, Kyra Sedgwick, Lalisa Manobal (Lisa from Blackpink), Luke Grimes, Macaulay Culkin, Marlon Wayans, Melissa McCarthy, Mila Kunis, Miley Cyrus, Minnie Driver, Orlando Bloom, Pamela Anderson, Priyanka Chopra Jonas, Regina Hall, Sean Hayes, Snoop Dogg, Wanda Sykes, Will Arnett and Zoë Kravitz.\n\n In the wake of Renee Good’s killing, will the Globes get political? \n\nThe Globes usually want a party, not politics. But that might be hard in the award show’s first ceremony during President Donald Trump’s second term. \n\nThe fatal shooting of 37-year-old mother Renee Good in Minneapolis by U.S. Immigration and Customs Enforcement may be on the minds of many attendees. The night’s frontrunner, “One Battle After Another,” notably opens with a raid on an ICE detention facility.\n\n Will beasts and girlfriends challenge ‘Adolescence’? \n\nWhile the Globes’ TV drama and comedy categories have massive overlap with last year’s Emmys, the limited series group is full of new blood.\n\nRecent buzzy series \" All Her Fault,\" “The Beast in Me” and “The Girlfriend” have all been nominated for best limited series and the honor of probably losing to “Adolescence.”\n\n Globes TV is the Emmys plus ‘Pluribus’ \n\nCompared to the crazy-convoluted Emmys calendar, the Golden Globes TV eligibility window is as simple as the singular soul on “Pluribus.”\n\nIf most of a show aired the previous year, it’s eligible. That’s it.\n\nThe big nominees are still nearly all reruns though. Everything in the best drama series category was up for best drama at September’s Emmys, including the winner “The Pitt.”\n\n“Pluribus” is the only invader in the group, and has a good chance of getting the Globes to conform to its will. “Heated Rivalry” didn’t make the team.\n\n Potential political storylines \n\nLast year, the Golden Globes largely avoided conversations surrounding President Donald Trump’s politics. That may not be the case this time around.\n\nSince Trump reclaimed the White House, the president’s name has been added to the exterior of the John F. Kennedy Center for the Performing Arts building. Numerous artists have canceled appearances at the center, and ticket sales and attendance have fallen, and viewership for December’s broadcast of the Kennedy Center Honors program was down by about 35% compared to the year before.\n\nMeanwhile, Trump also said he would slap a 100% tax on movies made outside the United States, though no such tariffs have yet to be levied.\n\nAnd the awards event will also be taking place in California, one of the states central to political redistricting ahead of U.S. midterms this year.\n\n Who picks the winners \n\nThis year’s voting body is made up of nearly 400 journalists and film critics from around the world, who cover the entertainment industry for international audiences.\n\nThe ceremony was originally presented by the Hollywood Foreign Press Association. After a series of scandals, Dick Clark Productions and Eldridge Industries acquired the rights to the show in 2023. The voting body has expanded to include more racial, ethnic and gender diversity since then.\n\nAny foreign entertainment journalist working for an internationally based media outlet can apply to be a voter.\n\n The Globes' new category: Podcasts \n\nThe Golden Globes this year introduced the best podcast category, and the nominees represent a mix of news and celebrity conversations all the while avoiding political controversy. Up for the inaugural award:\n\n1. “Armchair Expert with Dax Shepard”\n\n2. “Call Her Daddy”\n\n3. “Good Hang with Amy Poehler”\n\n4. “The Mel Robbins Podcast”\n\n5. “SmartLess”\n\n6. “Up First,” from NPR\n\nThe nominations seemingly avoided controversy by passing on popular conservative-leaning podcasts from the shortlist, such as “The Joe Rogan Experience,” which topped all major podcast platforms in 2025, and “The Megyn Kelly Show,” “The Tucker Carlson Show,” “The Ben Shapiro Show” and Candace Owens’ “Candace.”\n\nAlso axed from the nominees: the left-leaning “Pod Save America,” and popular true-crime podcasts “Morbid” and “Rotten Mango.”\n\n How big a night is Warner Bros. in for? \n\nWarner Bros. might be on the cusp of being sold, but it stands to dominate Sunday’s Globes. The studio is behind the odds-on favorite “One Battle After Another,” the most likely drama winner, “Sinners,” and the most nominated series, “The White Lotus.”\n\nWarner Bros. Discovery has agreed to be acquired by Netflix in a deal with $82.7 million. The only studio with more nominations than Warner Bros.’ 31? Netflix, with 35.\n\n The top nominees \n\n1. “One Battle After Another”: 9\n\n2. “Sentimental Value”: 8\n\n3. “Sinners”: 7\n\n4. “Hamnet”: 6\n\n5. “Frankenstein” and “Wicked: For Good”: 5 each\n\n1. “The White Lotus”: 6\n\n2. “Adolescence”: 5\n\n3: “Only Murders in the Building” and “Severance”: 4 each\n\n5. “The Bear,” “The Beast in Me,” “Black Mirror,” “Hacks,” “Nobody Wants This,” and “The Studio: 3 each","summary":"Hollywood’s awards season is kicking off with the 83rd Golden Globe Awards at 8 p.m. Eastern/5 p.m. Pacific","url":"https://www.independent.co.uk/news/world/americas/donald-trump-hollywood-pacific-sentimental-value-joe-rogan-b2898454.html","image":"https://static.independent.co.uk/2026/01/11/21/83rd_Golden_Globes_-_Arrivals_48724.jpg?width=1200","video":null,"publish_date":"2026-01-11 21:42:53","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.458},{"id":392293342,"title":"St James Municipal Corporation ramps up earthquake preparedness activities","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMayor of Montego Bay, Councillor Richard Vernon (JIS photo) \n\n Latest News, News \n\nJanuary 11, 2026\n\n\n\n\n St James Municipal Corporation ramps up earthquake preparedness activities \n\n\n\n\n\n\n\nKINGSTON, Jamaica —In observance of Earthquake Awareness Month throughout January, the St James Municipal Corporation will intensify its routine public education efforts and conduct preparedness drills across the parish.\n\nThroughout the month, the Municipal Corporation will be hosting public education sessions in schools, businesses and communities.\n\nAdditional activities to be conducted include, earthquake simulation drills and the launch of a public awareness campaign via media platforms to promote preparedness and emergency readiness.\n\nThese efforts aim to inform residents on how to safeguard themselves in the event of an earthquake.\n\nSpeaking during the Municipal Corporation’s monthly meeting on January 8, Mayor of Montego Bay, Councillor Richard Vernon, urged residents to support the programmed activities.\n\n“Participate [in the drills] and take personal responsibility for preparedness, as well as heed all advisories issued by the Municipal Corporation. I believe that this year, more than ever, we must take these advisories seriously,” he said.\n\nMeanwhile, the director of planning at the corporation, Trevion Manning, underscored the importance of observing Earthquake Awareness Month.\n\n“People need to be more aware of the best actions to take during and after an earthquake,” he said, noting that “it is much different from a hurricane.”\n\nManning pointed out that while the corporation remains committed to educating the public on earthquake preparedness, post-hurricane recovery continues to be a priority for the municipality.\n\n“We still have people in shelters whom we are working to return to normalcy, by helping them secure their own accommodations. We continue to prepare and provide meals for those who have been displaced and whose homes have been completely destroyed,” he said.\n\n“As you go through the parish, you will see that the council, like the Government, is still in recovery mode. Our primary focus remains on helping citizens and businesses return to normalcy,” Manning emphasised.\n\n\n\n\n\n\n\n\n\nTags: Earthquake Awareness Week St James Municipal Corporation \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n Woman killed in St Croix shark attack \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n CHARLOTTE AMALIE, US Virgin Islands (CMC) —A shark attack along a beach in St Croix, on Thursday, claimed the life of a United States (US) woman. She ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n 10 killed in five multi-vehicle crashes in December says ITA \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Thirty-two people were killed in 27 fatal crashes during the month of December 2025 according to the Island Traffic Authority (ITA).... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n ISSA Champions Cup set to start January 20 \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—The ISSA Champions Cup will kick off on January 20th and end on the 31st, Observer Online has been reliably informed. The start of t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Grange mourns passing of pioneering women’s cricketer, Dorothy Hobson \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Sports Minister Olivia Grange has extended condolences to the family, friends, and the wider sporting fraternity following the passi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Part 2 of ‘Kevin Smith: Cult Pastor’ documentary premieres on YouTube \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n Once revered as a prophet, Kevin Smith’s legacy is now defined by a deadly cult ritual that claimed lives and led to posthumous charges of murder, con... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\", \"breaking-news\":\"Push Notifications\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Transport Authority commences motor vehicle examinations January 12 for 2026/27 licencing period \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —The Transport Authority will commence motor vehicle examinations on Monday, January 12 in preparation for the renewal of road licen... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump tells Cuba to ‘make a deal, before it is too late’ \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump urged Cuba on Sunday to \"make a deal\" or face unspecified consequences, warning that the flo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/11/st-james-municipal-corporation-ramps-earthquake-preparedness-activities/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2026/01/Mayor-Vernon-1200x825-1-1024x704.jpg","video":null,"publish_date":"2026-01-11 21:36:10","author":null,"language":"en","source_country":"jm","sentiment":0.073},{"id":392293322,"title":"ISSA Champions Cup set to start January 20","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, Sports \n\nJanuary 11, 2026\n\n\n\n\n ISSA Champions Cup set to start January 20 \n\n\n\n\n\n\n\nKINGSTON, Jamaica—The ISSA Champions Cup will kick off on January 20th and end on the 31st, Observer Online has been reliably informed.\n\nThe start of the competition was pushed back from last year due to the passage of Hurricane Melissa, which devastated parts of western Jamaica and interrupted the schoolboys’ football competition.\n\nThe organisers had announced earlier last year that the competition would be increased with the addition of the finalists from the Ben Francis and Walker Cup competitions, who would play in the first round from January 20-21.\n\nBen Francis Cup champions Clarendon College and runners up Cornwall College, as well as Walker Cup champions St Catherine High and Mona High, will be drawn against the losing semi-finalists from the Manning Cup and daCosta Cup competitions for the first round.\n\nThe winners will then advance to the second round to be played on January 23 and 24. The semi-finals will then be played the following week, with the final set for Saturday, January 31.\n\nGlenmuir High, a finalist in the daCosta Cup and who will draw a bye in the first round are the two-time defending champion of the Champions Cup.\n\n-Paul A Reid\n\n\n\n\n\n\n\n\nTags: Football ISSA Champions Cup \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n Woman killed in St Croix shark attack \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n CHARLOTTE AMALIE, US Virgin Islands (CMC) —A shark attack along a beach in St Croix, on Thursday, claimed the life of a United States (US) woman. She ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n St James Municipal Corporation ramps up earthquake preparedness activities \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —In observance of Earthquake Awareness Month throughout January, the St James Municipal Corporation will intensify its routine publi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n 10 killed in five multi-vehicle crashes in December says ITA \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Thirty-two people were killed in 27 fatal crashes during the month of December 2025 according to the Island Traffic Authority (ITA).... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Grange mourns passing of pioneering women’s cricketer, Dorothy Hobson \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Sports Minister Olivia Grange has extended condolences to the family, friends, and the wider sporting fraternity following the passi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Part 2 of ‘Kevin Smith: Cult Pastor’ documentary premieres on YouTube \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n Once revered as a prophet, Kevin Smith’s legacy is now defined by a deadly cult ritual that claimed lives and led to posthumous charges of murder, con... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\", \"breaking-news\":\"Push Notifications\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Transport Authority commences motor vehicle examinations January 12 for 2026/27 licencing period \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —The Transport Authority will commence motor vehicle examinations on Monday, January 12 in preparation for the renewal of road licen... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump tells Cuba to ‘make a deal, before it is too late’ \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump urged Cuba on Sunday to \"make a deal\" or face unspecified consequences, warning that the flo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/11/issa-champions-cup-set-start-january-20/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/Football-Photo-1-2-4.webp","video":null,"publish_date":"2026-01-11 21:16:07","author":null,"language":"en","category":"sports","source_country":"jm","sentiment":0.185},{"id":392292380,"title":"As Trump signals next phase of Gaza plan, Israel faces decisions on Rafah and Hamas","text":"President Donald Trump is expected to announce this week a move to the second phase of his Gaza peace plan, but Israeli officials and regional sources say critical questions remain about implementation and impact. It is unclear whether Trump will make the announcement Tuesday or later this month at the World Economic Forum in Davos, Switzerland. One immediate issue is whether Israel will be required to reopen the Rafah crossing between Gaza and Egypt before the return of the last remaining Israeli hostage’s body, Israeli army Sgt. First Class Ran Gvili. Mediators are pressing Hamas to locate and return Gvili, and Israeli officials say intensive efforts are underway. If Gvili’s body is returned soon, Israeli officials say Rafah could reopen smoothly in both directions. If not, Israel may resist opening the crossing, which officials describe as its primary leverage over Hamas. No political directive has yet been issued to the military or civil authorities, though Israel is making logistical preparations. If opened, Rafah would allow people to exit Gaza into Egypt and, for the first time, enter Gaza from Egypt. A second unresolved issue is Hamas’ disarmament. Israeli officials say no tangible progress has been made, and that mediators Qatar, Egypt and Turkey appear to favor limiting disarmament to heavy weapons and rockets while allowing Hamas to retain small arms. Israel has rejected proposals to store weapons in warehouses, arguing Hamas could easily regain access, and has told Trump the group holds an estimated 70,000 Kalashnikov rifles. A third uncertainty concerns the proposed International Stabilization Force. Security officials say there has been little progress, with many countries withdrawing offers to send troops or limiting contributions to technical or medical teams due to fears of clashes with Hamas. One element expected in Trump’s announcement is the creation of a “Peace Council” and a technocratic committee to administer Gaza. An Israeli official said several countries have withdrawn from stabilization force discussions, including Indonesia and Azerbaijan, and that the technocratic body is expected to report to the Palestinian Authority in Ramallah, though Israel opposes strong institutional ties. Foreign Minister Gideon Sa'ar reiterated Israel’s position in a joint statement with Japan’s foreign minister, saying Israel is committed to Trump’s plan but insisting Hamas must disarm and Gaza be demilitarized. He also demanded the Palestinian Authority end its “Pay for Slay” policy, halt incitement and stop legal and diplomatic action against Israel. American-Palestinian businessman Bishara Bahbah, who has previously mediated between the White House and Hamas, said the Peace Council is expected to hold its first official meeting during the third week of the month alongside the Davos forum. He said Palestinian factions are expected to meet in Cairo this week, where the names of a 12-member independent technocratic committee to manage Gaza may be announced. Bahbah said humanitarian aid will be distributed by private companies rather than international organizations, following Israeli objections, and that Rafah would reopen immediately after Gvili’s body is returned. In interviews with regional media, Bahbah said the Peace Council would include the United States, Britain, Germany, Italy, Qatar, the United Arab Emirates and Egypt, with possible participation by the heads of the International Monetary Fund and World Bank. He said representation would be at the level of heads of state or government. He said Hamas confirmed to him there are no current negotiations on disarmament, despite it being a clause in the ceasefire that took effect October 10, and that Trump is expected to announce the council’s members on January 13. A senior European diplomat said the second phase was intended to include Hamas’ disarmament and the stabilization force but remains poorly defined, noting that the ceasefire is holding only partially and that the European Union has offered police training and Rafah monitoring once the crossing opens. “The biggest question is how Hamas disarmament would actually happen,” the diplomat said. “That remains unclear.”","summary":"As uncertainty surrounds Rafah’s reopening, the fate of an international stabilization force and Hamas disarmament, Bishara Bahbah says a Gaza 'Peace Council' will meet this week while Trump has yet to announce a move to Phase Two of his plan","url":"https://www.ynetnews.com/article/byixduzh11l","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/10/16/rJfcNt7Rpxl/rJfcNt7Rpxl_0_0_3000_1688_0_large.jpg","video":null,"publish_date":"2026-01-11 21:13:28","author":"Itamar Eichner","authors":["Itamar Eichner"],"language":"en","category":"politics","source_country":"il","sentiment":0.057},{"id":392294332,"title":"Letterman trashes ‘those idiots at CBS’ over state of news division","text":"Legendary late-night host David Letterman tore into his former network home of CBS this week, accusing the broadcaster of letting “idiots” turn CBS News into a “wreck” under its new leadership.\n\n“CBS News is a wreck,” Letterman said in a video posted Friday on his YouTube channel. “It’s just gone.”\n\nLetterman accused CBS News, which recently installed conservative commentator Bari Weiss as editor-in-chief, of abandoning the legacy it built with well-regarded broadcasters like Edward Murrow.\n\n“It was that mentality that drove the integrity of CBS News that has been trampled on, pissed on, and eviscerated by these idiots that have taken it over,” Letterman added.\n\n“And I am at a point now where it really is hurting my feelings because I’m sick and tired of people saying, ‘Oh, wait until those midterms.’ Kids, we’re far downstream from the midterms having any effect on this.”\n\nThe Independent has contacted CBS for comment.\n\nThe network has been under scrutiny over the last year or so, thanks to a series of business moves that critics saw as undermining its editorial integrity to be more friendly to the Trump administration.\n\nLast summer, CBS News’s then-parent company paid to settle a lawsuit from Donald Trump over the editing of a 60 Minutes episode, as the company’s pending merger with Skydance, which needed federal approval, was in the balance. \n\nBy August, Paramount’s merger officially closed with Skydance, a company headed by David Ellison, son of the billionaire Oracle co-founder and Trump supporter Larry Ellison.\n\nThe new leadership soon installed Weiss to lead CBS News, who lacked broadcast TV news experience and was previously known for founding The Free Press, a news site that often skewered the “woke” politics of the left.\n\nUnder Weiss, the network has made a number of controversial calls, prompting anger from newsroom staff, they have told The Independent.\n\nThose included pulling a highly anticipated 60 Minutes segment shortly before airtime about the Trump administration’s summary deportation of hundreds of migrants to a brutal Salvadorian prison where they said they were tortured.\n\nUnder new CBS Evening News anchor Tony Dokoupil, the broadcast has embraced a more flattering tone towards the administration, according to critics.\n\nStaffers told The Independent that recent broadcasts, such as one where Dokoupil said he salutes Secretary of State Marco Rubio, resembled “state TV.”","summary":"CBS News has been under heavy scrutiny since conservative commentator Bari Weiss was installed as editor-in-chief, a move critics feared would mean the network softening its coverage of the Trump administration","url":"https://www.independent.co.uk/news/world/americas/us-politics/david-letterman-cbs-jimmy-kimmel-b2898438.html","image":"https://static.independent.co.uk/2026/01/11/20/33/GettyImages-2245937079.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/DFvW2VTp-4VHSaSK0.mp4","publish_date":"2026-01-11 21:12:24","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":-0.231},{"id":392293338,"title":"Grange mourns passing of pioneering women’s cricketer, Dorothy Hobson","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDorothy Hobson (Facebook photo: Hon. Olivia 'Babsy' Grange) \n\n Latest News, News \n\nJanuary 11, 2026\n\n\n\n\n Grange mourns passing of pioneering women’s cricketer, Dorothy Hobson \n\n\n\n\n\n\n\nKINGSTON, Jamaica—Sports Minister Olivia Grange has extended condolences to the family, friends, and the wider sporting fraternity following the passing of Dorothy Hobson.\n\nGrange, in a media release on Saturday, said Hobson was a trailblazer in women’s cricket.\n\n“She distinguished herself as a player, captain, coach, selector, and administrator, making an enduring contribution to the sport locally, regionally, and internationally. She was a member of the first ever West Indies women’s cricket team and played in the 1973 Women’s Cricket World Cup,” said Grange.\n\nThe Minister noted that in 2013, Hobson became the first-ever woman coach of the Melbourne Cricket Club’s Camp, which was considered a significant step in a traditionally male-dominated setup. Grange said this added to her credentials as a pioneering figure for the club, breaking ground for both women coaches and campers.\n\n“Miss Hobson’s impact was also felt through her contribution to the development of other sports, including netball, where she supported community and developmental initiatives that strengthened participation and leadership among women and girls,” Grange stated.\n\n“Her life’s work helped to shape generations of women athletes and administrators and laid critical foundations for the growth of women’s sport in Jamaica and the wider Caribbean,” she continued.\n\nHobson was also the coach of the West Indies women’s team at the 1993 Women’s Cricket World Cup, and later chief selector of the West Indies women’s team.\n\nShe also played a pivotal role in the relaunch of the Jamaica Women’s Cricket League in 2015, revitalising a competition that had been dormant for several years.\n\n\n\n\n\n\n\n\nTags: death Dorothy Hobson Sports Minister Olivia Grange \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n Woman killed in St Croix shark attack \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n CHARLOTTE AMALIE, US Virgin Islands (CMC) —A shark attack along a beach in St Croix, on Thursday, claimed the life of a United States (US) woman. She ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n St James Municipal Corporation ramps up earthquake preparedness activities \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —In observance of Earthquake Awareness Month throughout January, the St James Municipal Corporation will intensify its routine publi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n 10 killed in five multi-vehicle crashes in December says ITA \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Thirty-two people were killed in 27 fatal crashes during the month of December 2025 according to the Island Traffic Authority (ITA).... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n ISSA Champions Cup set to start January 20 \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—The ISSA Champions Cup will kick off on January 20th and end on the 31st, Observer Online has been reliably informed. The start of t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Part 2 of ‘Kevin Smith: Cult Pastor’ documentary premieres on YouTube \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n Once revered as a prophet, Kevin Smith’s legacy is now defined by a deadly cult ritual that claimed lives and led to posthumous charges of murder, con... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\", \"breaking-news\":\"Push Notifications\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Transport Authority commences motor vehicle examinations January 12 for 2026/27 licencing period \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —The Transport Authority will commence motor vehicle examinations on Monday, January 12 in preparation for the renewal of road licen... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump tells Cuba to ‘make a deal, before it is too late’ \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump urged Cuba on Sunday to \"make a deal\" or face unspecified consequences, warning that the flo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/11/grange-mourns-passing-pioneering-womens-cricketer-dorothy-hobson/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2026/01/Dorothy.jpg","video":null,"publish_date":"2026-01-11 20:49:38","author":null,"language":"en","source_country":"jm","sentiment":0.278},{"id":392293308,"title":"Part 2 of ‘Kevin Smith: Cult Pastor’ documentary premieres on YouTube","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nJanuary 11, 2026\n\n\n\n\n Part 2 of ‘Kevin Smith: Cult Pastor’ documentary premieres on YouTube \n\n\n\n\n\n\n\nOnce revered as a prophet, Kevin Smith’s legacy is now defined by a deadly cult ritual that claimed lives and led to posthumous charges of murder, conspiracy and firearm offences.\n\nThrough more eyewitness accounts and disturbing details, the Jamaica Observer continues its exploration of the dangers of blind faith, manipulation and institutional failure, and confronts the haunting question: Did Kevin Smith really die?\n\nThe final part of the two-part documentary, “Kevin Smith: Cult Pastor — Dead or Alive? The Story that Shook Jamaica”, is out now on YouTube.\n\n\n\n\n\n\n\n\n\nTags: Albion cult pastor Kevin Smith Montego Bay St James \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\", \"breaking-news\":\"Push Notifications\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n Woman killed in St Croix shark attack \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n CHARLOTTE AMALIE, US Virgin Islands (CMC) —A shark attack along a beach in St Croix, on Thursday, claimed the life of a United States (US) woman. She ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n St James Municipal Corporation ramps up earthquake preparedness activities \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —In observance of Earthquake Awareness Month throughout January, the St James Municipal Corporation will intensify its routine publi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n 10 killed in five multi-vehicle crashes in December says ITA \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Thirty-two people were killed in 27 fatal crashes during the month of December 2025 according to the Island Traffic Authority (ITA).... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n ISSA Champions Cup set to start January 20 \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—The ISSA Champions Cup will kick off on January 20th and end on the 31st, Observer Online has been reliably informed. The start of t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Grange mourns passing of pioneering women’s cricketer, Dorothy Hobson \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica—Sports Minister Olivia Grange has extended condolences to the family, friends, and the wider sporting fraternity following the passi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Transport Authority commences motor vehicle examinations January 12 for 2026/27 licencing period \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n KINGSTON, Jamaica —The Transport Authority will commence motor vehicle examinations on Monday, January 12 in preparation for the renewal of road licen... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump tells Cuba to ‘make a deal, before it is too late’ \n\n\n\n\n\n\n\nJanuary 11, 2026 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump urged Cuba on Sunday to \"make a deal\" or face unspecified consequences, warning that the flo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/11/part-2-kevin-smith-cult-pastor-documentary-premieres-youtube/","image":"https://img.youtube.com/vi/vzjymb01dpY/sddefault.jpg","video":null,"publish_date":"2026-01-11 20:41:51","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.016},{"id":392291260,"title":"'Donald Trump thinks he can buy us, pay money for us, but we are human beings. We cannot be bought'","text":"Greenland, the semi-autonomous Danish territory, grabbed headlines around the world after US president Donald Trump suggesting he wanted to take control of the country. Trump said he wanted to 'own' Greenland, to prevent Russia and China from doing so. The M.E.N's sister newspaper, the Daily Record, travelled to Greenland to find out what people there think of the president's words. Greenlanders have said they will follow the example of Braveheart hero William Wallace to defend their “freedom” in the face of threats from Donald Trump. As the US President vows to take over the huge North Atlantic island proud locals in the capital Nuuk have sent a determined message that their home is not up for grabs. Morten Meller, 60, beat his chest and declared, “No. He cannot do this. We must have our FREEDOM!.” Drinking in Daddy’s bar with other fishermen, Morten said: “Donald Trump thinks he can buy us, pay money for us, but we are human beings. We cannot be bought.” Everyone we spoke to shared Morten’s view. Trump’s plans carry an explicit threat of force and most people in Nuuk now view him as a gangster. We trudged the snowbound streets and around the icy harbour to ask what ordinary Greenlanders think of the big issue that has brought the gaze of the entire world on this freezing outpost. Scallop fisherman Peter Hessner pointed at a gathering of giant ravens at the side of the road, when asked about the US President. He said: “He’s nuts. Everyone knows it, even the birds know it.” Peter was born in Greenland to a Danish father and Greenlandic mother. Like the majority of Greenlanders he would like independence. Many believe now is not the right time economically to break free from Denmark - and virtually every person we spoke to said a takeover by America would be a disaster. Peter, who has skippered a scallop boat for more than 30 years, says he wishes to preserve the Greenlandic way of life - but in a country that runs its own affairs. He said: “We want to run our own country, to be independent of other countries, including Denmark. We don’t want an even worse arrangement than the one we have. “If I was offered independence tomorrow I would take it but I wouldn’t take a deal to be part of America for any amount of money. We want our freedom.” Peter said Greenland could stand on its own without American money. He said: “We have a lot of minerals and we have a lot of fish in the sea. We could open up some mines and we can make a lot of money for our people through this. Our fishing industry can also be very successful. “I don’t think Donald Trump will mess around with NATO - but you never know when you’re dealing with someone who is crazy.” Student Malik Jensen, 17, said he would like to pass on a message to Donald Trump from the young people of Nuuk. He said: “My message is this: f*** you. I’m mad about this as we don’t want the Americans here. We don’t want our country to be invaded and we don’t want to get annexed - whatever that means. People are afraid right now.” Malik, who aims to study animation in Denmark and bring his skills back to Greenland, said no amount of money could persuade him or other Greenlandic people to accept Donald Trump or the USA as a sovereign power. He said: “People are angry and they won’t accept it. Our country is beautiful and we believe that culture and history are more important than money.” Student Malik Karlsen, 16, said young Greenlanders all agree that Donald Trump is a bully. He is one of the few who thinks Trump could actually launch a military takeover, following the outrageous US mission to capture Venezuelan leader Nicolas Maduro. He said: “I don’t like what he is saying about Greenland at all. I thought his threat of force was a bluff at first but after what he did with Venezuela’s president, I don’t think it’s a bluff.” Malik, who lived in Denmark for four years, said he feels people in Nuuk are scared but he would not support any deal that involved the people being paid off by the USA - even if it meant fixing their woefully inadequate health service. He said: “We need to get the health service sorted out but not at that price.” Removal man Inuit Mohammed Lundblad, 35, served as NATO soldier from the age of 19 to 23. He said the resilience of the military alliance, formed in Washington DC in 1949, is now being tested by Trump. Mohammed, an Inuit, says it’s crucial that NATO stands up to the challenge. The father of one said: “NATO has to be strong here because there are more soldiers at its command and it must be aware of its own strength. The USA has more firepower but I don’t think it will ever come down to that. I think Trump will draw the line and not actually use any force. Whatever value he sees in Greenland - and it is obviously a very high one - it would be crazy to become enemies with all the nations of NATO.” Petrina Lange, 29, is a mother of one and has another on the way. She is still working at the harbour in Nuuk as a removals agent, until her maternity leave starts. She is fiercely proud and does not wish her children to live in the dominion of any other nation. Inuit Petrina said: “I have no idea what the USA will do next. I think almost everyone I know would like to see an independent Greenland. We don’t want to be part of America.” On our walkaround of Nuut, it takes several hours to find even one voice in favour of Donald Trump’s plans. We find one eventually, 35-year-old Julio Sangreen, who is drinking with other men under a tunnel that leads to the entrance of Nuuk’s shopping mall. Despite Greenland’s stunning landscape and rich cultural heritage, it shares the same high instance of social problems as the UK. Unemployed Julio said: “We want Trump. We want America because we need money. “I have no money for even food yet our country would be very rich if we deal with Trump.”","summary":"“No. He cannot do this. We must have our FREEDOM!&quot;","url":"https://www.manchestereveningnews.co.uk/news/world-news/donald-trump-thinks-can-buy-33210179","image":"https://i2-prod.manchestereveningnews.co.uk/article33210212.ece/ALTERNATES/s1200b/0_RTP_SDR_110126_Greenland_Day3_008JPG.jpg","video":null,"publish_date":"2026-01-11 20:11:56","author":"Andrew Bardsley,Mark McGivern","authors":["Andrew Bardsley","Mark McGivern"],"language":"en","source_country":"gb","sentiment":0.089},{"id":392292340,"title":"Cuba faces energy crisis as Trump says 'make a deal before it’s too late'","text":"U.S. President Donald Trump warned Cuba on Sunday night that it would be wise to move quickly to sign an agreement with Washington, saying that if it does not do so the island nation will no longer receive oil or money from Venezuela. Venezuela has until now been the largest oil supplier to impoverished Cuba, which regularly suffers from power outages and shortages of basic goods. The loss of oil supplied by Caracas, or even a significant cutback, could spell disaster for the island. \"Cuba lived, for many years, on large amounts of oil and money from Venezuela. In return, Cuba provided 'Security Services' for the last two Venezuelan dictators,” Trump wrote, referring to Hugo Chavez and Nicolas Maduro, who were surrounded by Cuban bodyguards. “But not any more! Most of those Cubans are DEAD from last week's U.S.A. attack, and Venezuela doesn't need protection anymore from the thugs and extortionists who held them hostage for so many years. Venezuela now has the United States of America, the most powerful military in the World (by far!), to protect them, and protect them we will.\" Trump therefore declared: \"THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA - ZERO! I strongly suggest they make a deal, BEFORE IT IS TOO LATE.\" Cuba has lived under a socialist dictatorship since the revolution led by Fidel Castro in 1959 and has for decades been subject to sanctions by the United States and other countries. In recent years it has repeatedly reported collapses of the power grid and shortages of basic goods, and Venezuelan oil has been one of the resources that allowed it to endure. Between January and November last year, for example, Venezuela sent Cuba an average of 27,000 barrels of oil a day, covering about 50% of Cuba’s oil shortfall. Since the military operation in Venezuela a week ago in which the United States captured Venezuelan President Nicolas Maduro, Trump said he has reached understandings — also with the help of harsh threats — with Maduro’s replacement, interim President Delcy Rodriguez. He also said he forced her to effectively send all of Venezuela’s oil to the United States. After the operation, Trump said Cuba was now \"ready to fall,” but officials at the U.S. Central Intelligence Agency are skeptical. Reuters reported over the weekend, citing three sources, that the CIA does expect a bleak period for Cuba in economic and political terms and assesses that this could indeed make it harder for the regime to govern the population. However, the agency cannot say definitively that Trump’s assessment that the Havana government is close to collapse has merit. In a statement last Sunday aboard Air Force One, Trump said: “I don’t know if they (Cuba) will hold up, but Cuba has no income now. They got all their money from Venezuela, from Venezuelan oil.” The fall of the regime in Havana has long been a dream of U.S. Secretary of State Marco Rubio, himself the son of Cuban immigrants. On Sunday, Trump shared a post on his social media platform that suggested — apparently in jest — that Rubio could become Cuba’s next president. Trump added the caption: “Sounds good to me!” On Sunday night, a few hours after Trump’s post threatening to halt oil supplies to Cuba, Cuban Foreign Minister Bruno Rodriguez responded, saying his country would not submit to blackmail or any form of U.S. military coercion and that it has the right to import fuel from any exporter willing to sell it. He denied claims that Havana ever received financial or material compensation for providing security services to any country.","summary":"After taking control of Venezuela’s oil industry and diverting all output to the US, Trump said not a single barrel would reach Havana, adding that Cuba is 'ready to fall,' shared a post joking about Rubio as its next leader","url":"https://www.ynetnews.com/article/rychqsbhbl","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2024/10/20/BJV4Fczxkl/BJV4Fczxkl_1_311_3000_1688_0_large.jpg","video":null,"publish_date":"2026-01-11 20:05:28","author":null,"language":"en","category":"politics","source_country":"il","sentiment":-0.101},{"id":392291256,"title":"Taking the temperature in freezing Greenland after Donald Trump's contentious comments","text":"Greenland, the semi-autonomous Danish territory, grabbed headlines around the world after US president Donald Trump suggesting he wanted to take control of the country. Trump said he wanted to 'own' Greenland, to prevent Russia and China from doing so. The M.E.N's sister newspaper, the Daily Record, travelled to Greenland to find out what people there think of the president's words. In Greenland’s tiny capital of Nuuk an imposing new building dominates the skyline on the main drag. It’s hardly a skyscraper but it grabs my attention as I arrive in Nuuk. And I soon learn that its purpose has become the focus of heated debate among locals. The building is America’s brand new consulate and it dwarfs the cheerful, multi-coloured low-rise housing and office blocks that characterise the picture postcard town. It was, until recently, looked on as a welcome addition to the world’s most remote city of just 20,000 inhabitants, a further commitment by their American friends. But recent statements by the world’s most powerful man have put a chill into the bones of people, already living in the coldest place on earth. Nuuk-based plumber Mads Pedersen, 35, told me of his disgust at Donald Trump’s repeated threats to take Greenland - by force if necessary. The statements have sparked a diplomatic crisis with Greenland’s current sovereign ruler Denmark and the island’s own government in turmoil. Mads said: “It’s a sh** show to be honest. This man has no boundaries, he doesn’t care about laws or people and he is making direct threats to people who care so much about people in their communities. “He is talking about buying everything - buying the land, buying the people. We can see he has been working on a plan to take over and we really don’t know what will be going on with extra US consular people coming over. But people don’t want our home to turn in to an American colony.” My first impressions of Nuuk - a five hour flight from ruling Copenhagen - reveal a modern town including Greenland’s only shopping mall. But with temperatures of -17C on the night we arrived, there was no mistaking that life in Greenland is one of extremes. This is a town whose main industry is fishing and where life can be hard. There’s no McDonalds or Starbucks among the buildings in this town. And that’s the way local people would like it to stay. Mads, relaxing with beers with plumber mates Simon Pedersen and Martin Nielsen after a hard week’s work, said he was sickened by claims that Trump would attempt to buy off Greenlanders with suggestions of annual stipends of $10,000 a year. He said: “We don’t give a damn about his money and we people wouldn’t do it for a million dollars.” Mads, 35, said Trump had blown his own chances of getting support from Greenlanders by telling them that force was an option., He said: “He’s blown the whole game. If he wanted to do one of his ‘deals’ he’s not going to get it because he’s lost all trust. He doesn’t understand that he’s dealing with proud people who don’t give a damn about what Donald Trump wants. “He could maybe have kept on the diplomatic route but the guy has no patience, no respect for Greenland or its people.” The Inuit name for Greenland – Inuit Nunaat – means “land of the people”. By law, individuals can’t buy land here - so it comes as a hefty insult to most when Donald Trump says he’ll “do a deal.” Fellow plumber Simon Pedersen, 35, came to Nuuk from Denmark work six years ago - and never went back. He said it’s just stupid talk for Trump to say he will take over Greenland by force. He tells me: “I’d say it’s not going to happen because we’re dealing with Nato and the actual future of the world. “This would be a step too far, even for Trump.” Simon said the current situation has brought many links between Danish and Greenlandic citizens, with many families now bonded and interwoven through movement of people from one homeland to another. He said: “We are both linked and although there are historic grudges and things are not perfect, we are not in any state of emergency. There are people in Denmark with sisters or brothers or parents in Greenland and there are Greenlandic people whose grandparents were Danish. People don’t hate each other and the cultures and very much connected.” Simon also pointed out the irony in the fact even Greenlandic people cannot buy land there. He said: “The land is owned by Greenland by law. This is important to the national identity and culture. “So how can Trump just say he’ll buy it? He is a like gangster.” Father of three Martin Nielsen 41, another of the plumbing gang, said: “For me I want my kids to get a good education and I would encourage them to go to Denmark when they are old enough to do that. If they want to stay here that’s fine. And if they wanted to go to university then come back that would be good too. “Trump taking over by force seems like a nightmare scenario and we just hope nothing like that happens.” Trump’s announcement of an intention to take over Greenland sparked a crisis for the people of Greenland and Denmark, its ruling nation. It also put the world on red alert, including China and Russia, who both have their own intentions for the strategically crucial Arctic region. The capture of Venezuela’s rogue leader Nicolas Maduro turbo-charged the confidence of the POTUS - who rode roughshod over international law and seems to have gotten away Scot-free. And the people of the world’s biggest island were happy to see Trump’s gaze averted from their shores, a year after he initially boldly stated his aims for a Greenland takeover. Inhabitants - with a large majority of Inuit natives - have been more than content to be largely ignored by the world. Thousands of tourists are attracted by natural wonders like spectacular icebergs, humpback whales, waterfalls and the Aurora Borealis frequent displays of the Aurora Borealis. But the rare earth minerals in the ground and the new, defrosting shipping routes mean the island is at the centre of a new cold war. Greenlanders are renowned for modesty and courtesy - and are not enjoying the glare of the world media. Neither are they enjoying being insulted and now threatened by the world’s most powerful man. Britain’s honorary consul in Greenland, Christian Keldsen, is also the director of the Greenland Business Association. Keen to stress he’s speaking with his business hat on, Keldsen admits that many people are living with fear and trepidation after Trump’s comments. He said: “I think the majority of people I talk to are saying it’s a mix of being irritated and, the most common thing I hear, which is that it’s disrespectful. Somebody is talking about their country as just being a block of ice or a piece of land, forgetting that this place actually contains people, it contains culture, it contains our everyday lives. “And in addition to that, or an extension of that, we have people that are scared at this point, because, you know, we are talking military takeover and other things are coming into play.” Keldsen said the talk of annexation is ridiculous, as the US already has agreements in place to allow them to take out mineral wealth and move freely in Greenland. He said: “So it’s somewhat annoying, on the side of this good relationship, for someone to be talking about takeovers and annexation and all these other things because it’s not necessary. “The US has access to our ground. They have access to our business. They can do investments here. Our government is very pro the US. So it’s unnecessary. It’s just creating some noise in the background. “The relationship is here, the consulate is here and Greenland has representation in the US. We were doing lots of events together with the America. Americans. So we were pursuing this, and we were doing that in a very friendly and amicable fashion. Keldsen said national pride in Greenland is fierce, with a strong majority in favour of independence when the time is right for them. He said: “We’re an ambitious country, and any ambitious country in the world should thrive, strive for autonomy, sovereignty and so on, and obviously, so do we. So the idea of leaving one relationship or one coloniser and then being taken over by another is not on people’s agenda.”","summary":"&quot;It’s a sh** show to be honest.&quot;","url":"https://www.manchestereveningnews.co.uk/news/world-news/taking-temperature-freezing-greenland-after-33210166","image":"https://i2-prod.manchestereveningnews.co.uk/article33210198.ece/ALTERNATES/s1200b/0_RTP_SDR_090126_Greenland_Day1_015JPG.jpg","video":null,"publish_date":"2026-01-11 20:04:34","author":"Andrew Bardsley,Mark McGivern","authors":["Andrew Bardsley","Mark McGivern"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.078},{"id":392291062,"title":"'Hope this is a joke': Trump ally launches attack on admin official's 'very stupid idea'","text":"An ally to Donald Trump on Sunday waged war against an admin economics affairs official.\n\nUnder Secretary of State Jacob S. Helberg, the 22nd Under Secretary of State for Economic Affairs, posted a Reuters article in which he is quoted titled \"Qatar and UAE to join U.S.-led effort to bolster technology supply chain,\" as a clear endorsement of the Trump admin plan.\n\nThat set off alarm bells with one particular MAGA influencer.\n\n\"Qatar and the United Arab Emirates will soon join a U.S.-led initiative to secure AI and semiconductor supply chains, Undersecretary of State for Economic Affairs Jacob Helberg told Reuters in an interview,\" according to the news article. \"The addition of those two countries is notable given the Middle East’s history of political divisions and reflects a U.S.-led effort to bring Israel and Gulf states into the same technology-focused economic framework.\"\n\nLaura Loomer, the MAGA activist who was recently spotted on the so-called \"Doomsday Plane\" with Pete Hegseth, over the weekend launched into an attack on the economics official.\n\n\"This is a very stupid idea, I must say,\" she wrote Sunday. \"Why would we want to open up US supply chains for semiconductors to sabotage by Qatar, the funders of the Muslim Brotherhood and a state sponsor of global jihad? Why do we need a bunch Arab Tribesmen in Qatar for the sake of bolstering US technology and semiconductor supply chains!?\"\n\nShe then concluded, \"Can someone name one thing that benefits humanity that has ever been created by Qatar? What a horrible idea! I hope this is a joke…\"","summary":"An ally to Donald Trump on Sunday waged war against an admin economics affairs official.\n\nUnder Secretary of State Jacob S. Helberg, the 22nd Under Secretary of State for Economic Affairs, posted a Reuters article in which he is quoted titled \"Qatar and UAE to join U.S.-led effort to bolster technology supply chain,\" as a clear endorsement of the Trump admin plan.\n\nThat set off alarm bells with one particular MAGA influencer.\n\n\"Qatar and the United Arab Emirates will soon join a U.S.-led initiative to secure AI and semiconductor supply chains, Undersecretary of State for Economic Affairs Jacob Helberg told Reuters in an interview,\" according to the news article. \"The addition of those two countries is notable given the Middle East’s history of political divisions and reflects a U.S.-led effort to bring Israel and Gulf states into the same technology-focused economic framework.\"\n\nLaura Loomer, the MAGA activist who was recently spotted on the so-called \"Doomsday Plane\" with Pete Hegseth, over the weekend launc","url":"https://www.rawstory.com/trump-laura-loomer-2674873226/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-attends-a-press-conference-with-british-prime-minister-keir-starmer-not-pictured-at-the-white-hous.jpg?id=56611656&width=1200&height=1200&coordinates=423%2C0%2C423%2C0","video":null,"publish_date":"2026-01-11 19:56:02","author":"David McAfee","authors":["David McAfee"],"language":"en","category":"politics","source_country":"US","sentiment":-0.01},{"id":392291084,"title":"Trump ally openly threatens Cuban officials in online frenzy: 'Wipe you out in minutes'","text":"Rep. Carlos Giménez (R-FL), a Cuban-born lawmaker and close ally of President Donald Trump, issued a barrage of open threats to Cuban government officials Sunday, warning them that the United States had the “capability to wipe [them] all out in a matter of minutes.”\n\nFollowing the U.S. attack and takeover of Venezuela – which included the capture of President Nicolás Maduro – calls among Republicans for the Trump administration to target Cuba next have intensified, with Sen. Lindsey Graham (R-SC) and Giménez leading the charge.\n\nWhile Graham would issue just one explicit threat to Cuban leadership – that their opportunity to flee was quickly expiring – Giménez instead opted to directly reply to Cuban government officials on social media, writing several posts that included threats of kidnapping and military intervention.\n\nFor instance, Cuban Minister of Foreign Affairs Bruno Rodríguez Parrilla called for the international community to demand the release of Maduro and his wife from U.S. captivity on Sunday in a social media post. About 30 minutes later, Giménez responded with an ominous response.\n\n“Don't worry so much about Maduro and drop the scandal,” Giménez wrote. “Your future will be much worse.”\n\nIn another social media post, Giménez shared an image of Maduro in U.S. custody, only doctored to swap Maduro for Cuban President Miguel Díaz-Canel, and writing that Díaz-Canel was “next” to be abducted by U.S. forces.\n\nTo Cuban diplomat Carlos F. de Cossio, Giménez issued a rare bit of praise, calling him potentially the “cleverest” Cuban official, albeit with an ominous warning.\n\n“Seize the moment and negotiate while there's still time,” Giménez wrote in a social media post on X. “There's not much left.”\n\nAnd again to Parrilla, Giménez issued another ominous threat.\n\n“You all lie shamelessly,” Giménez wrote. “No one believes you anymore. You don't have much time left.”","summary":"Rep. Carlos Giménez (R-FL), a Cuban-born lawmaker and close ally of President Donald Trump, issued a barrage of open threats to Cuban government officials Sunday, warning them that the United States had the “capability to wipe [them] all out in a matter of minutes.”\n\nFollowing the U.S. attack and takeover of Venezuela – which included the capture of President Nicolás Maduro – calls among Republicans for the Trump administration to target Cuba next have intensified, with Sen. Lindsey Graham (R-SC) and Giménez leading the charge.\n\nWhile Graham would issue just one explicit threat to Cuban leadership – that their opportunity to flee was quickly expiring – Giménez instead opted to directly reply to Cuban government officials on social media, writing several posts that included threats of kidnapping and military intervention.\n\nFor instance, Cuban Minister of Foreign Affairs Bruno Rodríguez Parrilla called for the international community to demand the release of Maduro and his wife from U.S. captivity on Sunday in ","url":"https://www.rawstory.com/cuba-2674873298/","image":"https://www.rawstory.com/media-library/image.jpg?id=62710910&width=1200&height=1200&coordinates=833%2C0%2C834%2C0","video":null,"publish_date":"2026-01-11 19:46:50","author":"Alexander Willis","authors":["Alexander Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.137},{"id":392294330,"title":"Iran threatens to hit US military targets if Trump decides to strike over protests","text":"Iran has threatened to attack US military targets if Donald Trump launches strikes over the country’s growing protests. \n\nThe US president warned the Islamic Republic this week that the United States would “hit them hard” if protesters were killed, and is understood to be weighing up options for action within days. \n\nHundreds of people have been killed on Iran’s streets as nationwide protests in 185 cities across all 31 provinces calling for an end to supreme leader Ali Khamenei’s rule continue to grow. \n\nBut as international pressure on Iran mounts, Tehran escalated the crisis on Sunday by claiming it was ready to launch strikes against Israeli and US bases in the region.\n\n“In the event of an attack on Iran, both the occupied territory and all American military centres, bases and ships in the region will be our legitimate targets,” parliamentary speaker Mohammad Bagher Qalibaf said. \n\nIn the UK, the government praised the bravery of the protesters as calls grew for the Iranian Revolutionary Guard (IRGC) to be proscribed.\n\n“It takes real courage to speak up in an authoritarian system, especially for young women, but it should not require courage just to make your voice heard,” said foreign secretary Yvette Cooper. “These are fundamental rights: free speech; peaceful assembly; and the exercise of those rights should never come with the threat of violence or reprisals.”\n\nSupport is growing for a transition to be forced in Iran from the fundamentalist regime which has run the country since the fall of the Shah in 1979. Already, discussions appear to be underway over who should be installed to replace the regime with the late Shah’s heir Reza Pahlavi – often referred to as the Baby Shah – being touted as a possible frontrunner.\n\nThe protests started in Tehran's Grand Bazaar over failing economic policies in late December, before spreading to universities and other cities.\n\nMr Trump offered support for the protesters in a post on social media over the weekend: \"Iran is looking at FREEDOM, perhaps like never before. The USA stands ready to help!!!\"\n\nThe president will be given multiple options to help deal with the crisis during a briefing on Tuesday, from sanctions to military strikes, according to The Wall Street Journal.\n\nThe US State Department also issued a statement warning Iran’s leadership “not to play games” with Mr Trump, adding “when he says he'll do something, he means it”.\n\nIn Iran the death toll continues to rise as protests against the regime continue. US-based rights group HRANA (Human Rights Activists News Agency) reported the number of casualties had soared to as high as 466 on Sunday, with more than 10,000 arrested. However, human rights organisations cautioned that an ongoing blackout is making it tricky to verify and record deaths properly.\n\nThe Independent has seen video that includes the sound of continuous gunfire while eyewitness accounts shared with activists’ Twitter accounts via Starlink describe widespread slaughter.\n\nOne person, reportedly speaking from the Narmak neighbourhood in the northeast of the capital, said the regime opened fire on crowds.\n\n“I saw all the streets covered in bloodstains. They were washing the blood of this country’s children off the asphalt with high-pressure water after massacring them. There were bloodstains on all the city streets,” the unnamed person said.\n\nAnother added that mobile and landline calls are not working and that the regime is sending texts warning citizens not to leave their homes because “armed terrorists are out”. Shops are empty and food is running out.\n\nIn the west of Iran on Thursday, the last time most areas had mobile network access, one man told The Independent that fuel was also scarce: “The situation is terrible, but everyone is optimistic that the regime will fall.”\n\nWith Iran once again threatening action against Israel, prime minister Benjamin Netanyahu called top advisers and ministers together for a preliminary security consultation on Sunday.\n\nThe Israel Defense Forces was said to be staying operationally prepared to respond if needed amid fears of a widening crisis in the Middle East, but was treating the anti-regime protests as an internal Iranian affair for now.\n\nIn the UK, the government faced calls to proscribe the IRGC as thousands took to the streets in London in a demonstration supporting regime change.\n\nLaila Jazayeri, director of the Association of Anglo-Iranian Women in the UK, said the IRGC had already gone too far.\n\nSpeaking at the demonstration on Sunday, she said: “The prime minister should prescribe the deadly force IRGC, that is killing people inside Iran.”\n\nCabinet minister Heidi Alexander said the British government has always viewed Iran as a hostile state and was looking at the situation, while holding out hope an alternative solution to force could still be reached. \n\n\"It's a concerning situation there and we would like to see anything that happens in future involving a peaceful transition where people can enjoy fundamental freedoms and we see proper democratic values back in the heart of Iran.\"\n\nTory leader Kemi Badenoch said it would be right for the US to help oust the Islamic Republic's leadership and indicated she would support RAF involvement if necessary.\n\nShe told BBC One's Sunday With Laura Kuenssberg: \"You've seen the recent RAF strikes, for instance, in Syria. Without over speculating – we are talking about hypothetical situations – we have worked in alliance with other countries.\n\n\"I think this has to be something that we do with a broad coalition of countries. That is the right way to do it, and to make sure that we create a stable Iran.\"\n\nShe said Iran would “very happily wipe out the UK if it felt it could get away with it” and “I don't have an issue with removing a regime that is trying to harm us”.","summary":"The UK government has praised the bravery of protesters taking to the streets","url":"https://www.independent.co.uk/news/world/middle-east/iran-protests-donald-trump-ayatollah-b2898374.html","image":"https://static.independent.co.uk/2026/01/11/08/GettyImages-2254948642.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/zsK8npXm-OhrQWqOm.mp4","publish_date":"2026-01-11 19:31:26","author":"David Maddox,James C. Reynolds and Bel Trew","authors":["David Maddox","James C. Reynolds and Bel Trew"],"language":"en","category":"politics","source_country":"gb","sentiment":0.108},{"id":392291074,"title":"Reagan budget director goes off on billionaire's defense of Trump's 'dog's breakfast' plan","text":"Ronald Reagan's budget director over the weekend for roasting a billionaire's defense of Donald Trump's economic plans.\n\nIt started with a post by billionaire Bill Ackman, who said, \"I think President Trump's goal of reducing credit card interest rates is a worthy and important one.\"\n\n\"My concern about capping rates at 10% is that doing so will inevitably cause millions of Americans to have their cards cancelled as credit card companies lose the ability to adequately price subprime credit risk,\" he added. \"Consumers denied credit cards will be forced to turn to loan sharks whose rates and terms will be vastly worse for borrowers.\"\n\nAckman goes on to say, \"I commend the President for his focus on affordability for all Americans. Mortgage spreads and rates are coming down significantly due it his actions. Finding a way to bring down credit card rates without taking credit away from many Americans would have a very positive impact on the most disadvantaged Americans.\"\n\nThat led to a Reagan-era official erupting with a missive of his own.\n\nDavid Stockman, a politician and former businessman who was a Republican U.S. Representative from the state of Michigan and the Director of the Office of Management and Budget under President Ronald Reagan, said, \"Hey, Bill, stop kissing his a--. When it comes to economics he's an unhinged whirligig of statist humbug, hoo-doo and ham-handed hammering of free markets and economic liberty. The very idea of government intervention in the credit card market is neither 'worthy' nor 'important'. Its just a stupid attempt to address the real affordability problem that is caused by massive deficits and endless money-printing at the Fed---both of which the Donald wants more of.\"\n\n\"The truth is, there is absolutely nothing redeeming about the dog's breakfast of protectionism, easy money, Keynesian deficits and crony capitalism that passes for Trump-O-Nomics,\" he then wrote.","summary":"Ronald Reagan's budget director over the weekend for roasting a billionaire's defense of Donald Trump's economic plans.\n\nIt started with a post by billionaire Bill Ackman, who said, \"I think President Trump's goal of reducing credit card interest rates is a worthy and important one.\"\n\n\"My concern about capping rates at 10% is that doing so will inevitably cause millions of Americans to have their cards cancelled as credit card companies lose the ability to adequately price subprime credit risk,\" he added. \"Consumers denied credit cards will be forced to turn to loan sharks whose rates and terms will be vastly worse for borrowers.\"\n\nAckman goes on to say, \"I commend the President for his focus on affordability for all Americans. Mortgage spreads and rates are coming down significantly due it his actions. Finding a way to bring down credit card rates without taking credit away from many Americans would have a very positive impact on the most disadvantaged Americans.\"\n\nThat led to a Reagan-era official erupting ","url":"https://www.rawstory.com/trump-regan-budget-director-dog/","image":"https://www.rawstory.com/media-library/president-donald-trump-in-front-of-a-painting-of-former-u-s-president-ronald-reagan-attends-an-event-to-announce-that-the-spa.jpg?id=61911698&width=1200&height=1200&coordinates=528%2C0%2C528%2C0","video":null,"publish_date":"2026-01-11 19:25:44","author":"David McAfee","authors":["David McAfee"],"language":"en","category":"politics","source_country":"US","sentiment":-0.319},{"id":392294298,"title":"Democrat says Trump is ‘stealing’ from taxpayers and could be impeached if Republicans lose control of Congress","text":"Democratic Sen. Chris Murphy said on Sunday that Donald Trump had so far in his second term committed “10 times” the number of impeachable offenses as he’d committed in his first term and appeared to disagree with senior members of his party who’ve waved off impeachment efforts.\n\nThe Connecticut lawmaker has become an increasingly prominent voice among his party’s younger members, who favor a more forceful pushback against the president as his party looks toward 2026. \n\nMurphy spoke Sunday with NBC’s Kristen Welker on Meet the Press, where Welker asked him a question about former Speaker Nancy Pelosi’s declaration late in 2025 that Trump’s conduct did not rise to the standard of impeachable so far under his second term. Murphy firmly disagreed.\n\n“I know that this president has committed ten times more impeachable offenses in his second term as he did in his first term. He is stealing from the American people,” he said, calling his judgment a result of having “common sense”.\n\n“The amount of corruption that he is involved in, taking a luxury private jet from Qatar, trading national security secrets to a foreign nation in exchange for a $2 billion investment in his cryptocurrency. That is wildly corrupt,” he said. “I don't think it's any secret that the president's level of corruption and illegality is nuclear grade in his second term compared to his first term.”\n\nAllegations of self-dealing have followed Donald Trump since his earliest days in politics, as reporters began to note that his properties were charging Secret Service agents for staying in rooms while they were on-site protecting the president and his family. \n\nThose accusations were compounded as Trump hosted campaign events and fundraisers at his various properties, including the now-sold Trump International Hotel in downtown Washington, D.C., which became a mainstay for hangers-on eager for face time with the president or his aides and allies.\n\nIn his second term, the president pushed traditional ethical standards to their limits with his foray into cryptocurrency, which has attracted lucrative investments from domestic and foreign partners alike.\n\nThe senator’s remarks refer to a $2 billion investment by the United Arab Emirates into the crypto firm Binance using a cryptocurrency co-founded by members of Trump’s family, as well as his acceptance of a replacement for Air Force One gifted by the Qatari government.\n\nThe House of Representatives is where any impeachment legislation originates, per the Constitution. Democrats are in the minority in both chambers; successful impeachment would require a majority in the House and a two-thirds vote in the Senate to reach a conviction. In December, two dozen Democrats joined with Republicans to defeat articles of impeachment filed by Rep. Al Green of Texas, while dozens more, including members of leadership, voted “present” rather than aye or nay.\n\nAppetite for impeachment could grow after the 2026 midterms if Democrats retake both the House and the Senate, but even then, any effort would be an uphill battle.\n\nMurphy indicated in his interview that he respected the House’s own determinations on the matter. It’s unlikely that any impeachment effort would reach the Senate before 2027 at the very earliest.\n\nTrump was the target of two impeachment efforts during and after his first term. Both were unsuccessful, but the second impeachment effort resulted in the most defections across party lines in the history of presidential U.S. Senate impeachment trials.","summary":"Murphy points to crypto scheme and Qatari jet as evidence of Trump’s self-dealing","url":"https://www.independent.co.uk/news/world/americas/us-politics/chris-murphy-trump-impeachment-senate-b2898423.html","image":"https://static.independent.co.uk/2026/01/11/18/06/murphy_nbc_126.jpg?crop=385.5,257,x35.8,y0&trim=0,36,0,35&width=1200","video":"https://cdn.jwplayer.com/videos/6ajUgoTK-OhrQWqOm.mp4","publish_date":"2026-01-11 19:20:10","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.355},{"id":392294292,"title":"Trump will hear Iran options from senior aides including Rubio and Hegseth this week: Report","text":"President Donald Trump is set to be briefed this week by senior administration officials on his options to respond to widespread anti-government protests in Iran, according to a report. \n\nTrump will be briefed Tuesday on specific routes of response to the protests, suggesting that he is considering reprimanding the regime for cracking down on demonstrators, as he has previously warned he would do, sources told The Wall Street Journal.\n\nThe president will meet with senior administration officials, Secretary of State Marco Rubio, Defense Secretary Pete Hegseth and Joint Chiefs Chair Gen. Dan Caine to weigh the options, which include boosting anti-government sources online, utilizing secret cyber weapons, and placing more sanctions on the regime and military strikes, according to the report. \n\nAt least 538 people are feared dead as a result of the anti-government protests, which started over two weeks ago, while over 10,600 others have been detained during the demonstrations, the Associated Press reported Sunday. \n\nA final decision on the course of action is not expected to come out of the meeting, according to the WSJ. On Sunday, Iran’s parliamentary speaker warned Trump that Tehran would target U.S. bases in the Middle East if Washington involved itself, raising fears of a wider regional conflict. \n\nThe Pentagon hasn’t moved any forces to prepare for potential military strikes, and the U.S. recently moved the aircraft carrier USS Gerald R. Ford and its strike group from the Mediterranean to Latin America, leaving no aircraft carrier in the Middle East or Europe. \n\nRepublican Sen. Rand Paul warned against strikes in Iran on Sunday, after Trump previously threatened to bomb the country if it killed protesters demonstrating against its regime. \n\n“The only problem I have with saying, ‘Oh, we’re going to bomb Iran,’ is that sometimes it has the opposite effect,” Paul told ABC News’ This Week. \n\n“So, when you bomb a country, then people tend to rally around their own flag. They tend to see this is the – you know, a foreign country coming in and bombing us. And so, I don’t think it always has that effect.” \n\n“I wish, you know, the same as the president, I want success. I hope that the freedom movement survives,” Paul added. \n\nThe US-based rights group HRANA reported Sunday that the death toll has surpassed 500, and that more than 10,000 people had been arrested. \n\nThey noted difficulty sourcing reliable information amid Iran's nationwide internet blackout. Despite these difficulties, protesters continued taking to the streets in the country’s capital on Sunday morning. \n\nOnline videos, likely transmitted via Starlink satellite transmitters, reportedly showed protesters gathering in northern Tehran’s Punak neighborhood. The videos appeared to show authorities shutting off streets, with protesters waving their lit phones. \n\n“The pattern of protests in the capital has largely taken the form of scattered, short-lived, and fluid gatherings, an approach shaped in response to the heavy presence of security forces and increased field pressure,” the Human Rights Activists News Agency said. “Reports were received of surveillance drones flying overhead and movements by security forces around protest locations, indicating ongoing monitoring and security control.”\n\nOther footage taken in Mashhad, Iran’s second-largest city, reportedly showed protesters confronting security forces.\n\nMeanwhile, Trump said on social media that the US “stands ready to help” Iranians protesting against clerical rule, after earlier warning that US forces were “locked and loaded” if demonstrators were killed.\n\nThe demonstrations began on December 28 over the collapse of the Iranian rial currency, which trades at over 1.4 million to $1, as the country’s economy struggles due to international sanctions, in part levied over its nuclear program. \n\nIn the weeks since, the protests have intensified, with calls challenging Iran’s theocracy. \n\nThe Associated Press contributed to this report.","summary":"Trump is set to weigh possible responses during the meeting, though a final course of action isn’t expected to come as quickly","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-iran-protests-response-meeting-b2898416.html","image":"https://static.independent.co.uk/2026/01/11/08/GettyImages-2254948642.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/65I7Npgj-OhrQWqOm.mp4","publish_date":"2026-01-11 19:10:23","author":"Isabel Keane","authors":["Isabel Keane"],"language":"en","source_country":"gb","sentiment":-0.006},{"id":392289272,"title":"The Purged","text":"The purge began late Friday night, four days after Donald Trump returned to the White House. Seventeen inspectors general—internal watchdogs embedded throughout the federal government—received emails notifying them of their termination. Three weeks later came the Valentine’s Day Massacre: the ousting of tens of thousands of federal employees with little discernible pattern, across agencies and across the country. By April, entire departments—the U.S. Agency for International Development, the Consumer Financial Protection Bureau—had been gutted.\n\nWorkers the administration couldn’t fire were coerced into leaving on their own. Toxicity became HR policy. Employees received an email with the subject line “Fork in the Road.” It offered eight months’ pay to anyone who resigned, and no assurances of job security to those who stayed. A follow-up email encouraged them “to move from lower productivity jobs in the public sector to higher productivity jobs in the private sector.” At the end of Trump’s first year back in office, roughly 300,000 fewer Americans worked for the government.\n\nThat number understates the destruction. When Trump anointed Elon Musk to lead the newly created Department of Government Efficiency, he did so in the name of clearing out mediocrities and laggards. The bureaucracy does harbor pockets of waste and paper-pushing positions that could easily be culled. But the administration showed little interest in understanding the organizations it was eviscerating. Any sincere attempt to reform the government would have protected its top experts and most skilled practitioners. In fact, such workers account for a disproportionate share of the Trump-era exodus. Many of them accepted the resignation package because they possessed marketable skills that allowed them to confidently walk away. The civil service thus lost the cohort that understands government best: the keepers of its unwritten manual, the custodians of institutional integrity.\n\nGrover Norquist, one of the chief ideologists of modern conservatism, used to fantasize about drowning the government in the bathtub. The Trump administration has realized that macabre dream—not merely by shrinking the state, but by poisoning its culture. It has undone the bargain that once made government careers attractive: lower pay offset by uncommon job security and a sense of professional mission.\n\nThe American government grew in bursts of reform, crisis, and optimism—not from the sketching table of an engineer but from the rough contingencies of history. The outraged response to a 1969 oil fire on the Cuyahoga River catalyzed the creation of the Environmental Protection Agency. The failure to prevent the September 11 attacks gave rise to the Department of Homeland Security. This accidental architecture was part of the federal government’s genius. It nurtured corners of national life—declining industries, obscure sciences—that a management consultant obsessed with optimization could never properly value. It embodied the wisdom, as well as some of the imperfections, of American history. For all its flaws, the American state was a source of national greatness and power: It ushered in an age of prosperity and discovery; it made everyday existence safer and fairer. It deserves, at the very least, the dignity of a proper burial.\n\nIn the late 19th century, as the American government took on its modern form, a single word captured the spirit of the enterprise: disinterestedness. The duties of civil servants, who remained in their chairs as presidents came and went, were supposed to transcend patronage and partisanship. Their professional obligation was to present facts and judgments that reflected an objective reality—not to flatter the preferences of the administration in power.\n\nThe nascent American state aspired to become a branch of science. It measured; it mapped; it studied. After its founding, in 1879, the United States Geological Survey recruited scientists and experts from Johns Hopkins, Yale, and Harvard. Using the most advanced techniques, it tracked river flow to forecast floods and to irrigate the arid West. It charted mineral belts in the Appalachians and the Rockies, which supplied the raw materials for industrial growth.\n\nIn the earliest decades of the 20th century, the National Bureau of Standards established common definitions for such basic measurements as the volt and the ohm, making it possible to build and trade at scale. The Bureau of Labor Statistics compiled data on wages, prices, and productivity that became the basis for economic prediction. The U.S. Weather Bureau allowed farmers to foresee storms.\n\nThe spirit of disinterestedness became the foundation for a regulatory state. Armed with scientific studies, the government could intervene to prevent disasters, protect consumers, and guard against recessions. Out of that faith in expertise arose the Federal Reserve and the Food and Drug Administration. Granite and marble buildings proliferated across Washington, D.C., housing a growing constellation of university-trained specialists. In their research and reports, they described what became the shared American reality.\n\nThe flaws in this system were obvious enough, at least in retrospect. Data points might be objective, but the decisions drawn from them were not. Handing power to experts—on the assumption that they alone were qualified to exercise it—sometimes bred insular arrogance. When the Army Corps of Engineers built levees on the lower Mississippi, it inadvertently magnified the devastation of the floods it had intended to prevent. Federal policies encouraging farmers to plow the prairie led to the ecological catastrophe known as the Dust Bowl. Those tendencies, many decades later, fueled the rise of Ronald Reagan, who famously said, “The nine most terrifying words in the English language are: ‘I’m from the government, and I’m here to help.’ ”\n\nYet regulators also prevented immense human suffering. Before the advent of the modern state, the economy convulsed with financial panics roughly every 20 years. After the Securities and Exchange Commission and the Federal Deposit Insurance Corporation were created in the 1930s, confidence replaced chaos. Generations passed without bank runs. American markets became the safest bet on the planet.\n\nAt the dawn of the 20th century, American medicines were often laced with alcohol, opiates, or narcotics. Thanks to the FDA, those potions were gradually replaced by pharmaceuticals tested for safety—snake oil gave way to science.\n\nThe postwar era brought more triumphs. Following the arrival of the National Highway Traffic Safety Administration in 1970, which mandated crash tests and new safety features, fatality rates from car accidents were cut by more than 70 percent. After the creation of the Occupational Safety and Health Administration in 1971, workplace fatalities fell by nearly 70 percent. The state smoothed the roughest edges of the market; it tamed intractable dangers; it made American life more livable.\n\nIn the vernacular, the federal government is synonymous with Washington. That conflation obscures the fact that roughly 80 percent of its workforce is stationed outside the District of Columbia. Still, there’s no denying that Washington contains the densest concentration of civil servants—and the story of that caste is a morality tale.\n\nIn the 1970s, Washington was a city distinctly devoid of flash. Even its most powerful denizens drove beat-up Volvos; its dandies shopped at Brooks Brothers. The elegant houses of Georgetown were ostentatiously weather-beaten. The children of wealthy law-firm partners and humble bureaucrats attended the same schools.\n\nBut beginning in the late 20th century, lobbying became a boom industry. Those law partners, who sold their ability to influence policy, began raking in seven-figure salaries. A gap in wealth—and lifestyle—started to separate the lawyers in private practice from the civil servants. They lived in different neighborhoods, shopped at different stores, sent their kids to different schools.\n\nThat high-end lifestyle was seductive, and it attracted many government workers who wanted a beach house of their own. But the surprising thing, really, was how many preeminent experts—scientists, intelligence analysts, economists, even lawyers—stayed in their government job for the entire arc of their career.\n\nThey stayed because the work allowed them to accumulate new skills, to test themselves in crises, to solve novel problems. At its best, government work supplied the rush of being in the arena, a sense of professional purpose—a higher meaning than most jobs can muster.\n\nUntil the purges of the past year, the U.S. government housed an unmatched collection of experts, capable of some of the greatest feats in human existence. The achievements of this corps bear legendary names: the Manhattan Project, Apollo, the Human Genome Project. These aren’t just gauzy tales from the past. After the National Institutes of Health helped sequence the genome, it funded research that turned that knowledge into pioneering medicines with the potential to treat hundreds of rare diseases. It kept refining technology to make those treatments more affordable—and those therapeutics have dramatically improved survival rates for illnesses, such as pediatric leukemia and spinal muscular atrophy.\n\nUnder Trump, the expertise capable of such achievements has begun to vanish. His administration isn’t simply committed to shrinking government; it sees career officials as the enemy within, an entrenched elite exploiting its power and imposing its ideology on the nation. Its demise is not collateral damage but the imperative. What took generations to build is being dismantled in months, and with it goes not just expertise but what remains of the shared American faith in expertise itself.\n\nBureaucrats extol their ethos of service. They describe government work as a calling. Thirty percent of federal workers are military veterans who sought to extend their patriotic devotion into civilian life. Even those who never passed through the armed forces cast their career choices in similar terms. A generation of bureaucrats, now in the prime of their career, entered government after September 11. They were moved to emulate the commitment of the first responders they saw on television. They felt an obligation to serve.\n\nDonald Trump has betrayed those workers. By describing them as a hostile force, he’s questioned their patriotism—and robbed the sense of mission from their work. Employees who signed up to serve a transcendent national interest, who understood their duty as being to the American people, now find themselves instructed to follow the whims of a corrupt, narcissistic leader.\n\nWhat’s been lost isn’t just a sense of purpose, but a body of knowledge—a way of making the machinery of the state function. Early-20th-century bureaucrats may have aspired to govern as if they were practicing science, but the reality is something more like craft. The American state, a product of compromises, is tricky terrain to master. Organizations duplicate one another; agencies are overseen by political leaders who arrive with minimal understanding of the workplace they will manage. Succeeding in such an environment requires savvy veterans who have learned how to operate such an unruly machine and can model how to do so for fresh-faced co-workers. By wiping out many of the bureaucracy’s most experienced practitioners, Trump has severed the chain that allowed one generation of civil servants to pass on the habits of effective government to the next.\n\nSome of Trump’s firings have drawn attention, such as the peremptory dismissal of C. Q. Brown, the chairman of the Joint Chiefs of Staff, one of hundreds of military officers who have been removed alongside civil servants. But for the most part, the crumbling of the American state has unfolded as a quiet catastrophe. Bureaucrats are the definition of anonymous. Their prestige suffers because it is conflated in the public’s mind with long lines at the DMV, fastidious building inspectors, parking tickets—the stuff of local functionaries. So much of the civil service is devoted to long-term national flourishing—preventing disease, safeguarding financial markets—that its achievements go unappreciated.\n\nThe toll of the purge will become clear only gradually. When the U.S. Fish and Wildlife Service loses the biologists who track bat populations, vulnerable species can no longer be rigorously protected. When bat populations dwindle, insects proliferate. Farmers will likely compensate by deploying insecticides, which government studies suggest can do significant prenatal harm. Government, too, is part of a delicate American ecosystem—as it erodes, crises that lay bare its indispensability will multiply.\n\nCapturing the magnitude of the destruction is an almost impossible task. Statistics can convey the scale, but only individual stories reveal what has actually vanished, the knowledge and skill that have been recklessly discarded. The damage will ripple through every national park, every veterans’ hospital, every city and town.\n\nOver the course of four months, I interviewed 50 federal workers, both civilian and military, who were either fired or forced out—who took early retirement or resigned rather than accept what their job had become. I wanted to understand how their time in government came to such an abrupt end and, more than that, to understand the career that preceded their departure. When The Atlantic asked their former agencies to comment, many declined, citing the privacy of personnel matters. In the name of protecting these workers, the government refused to defend the decisions that had upended their lives. What follows is their story—a portrait of the void that will haunt American life, a memorial to what the nation has lost.","summary":"Donald Trump’s destruction of the civil service is a tragedy not just for the roughly 300,000 workers who have been discarded, but for an entire nation.","url":"https://www.theatlantic.com/magazine/2026/02/trump-federal-worker-layoffs-interviews/685321/","image":"https://cdn.theatlantic.com/thumbor/qMNCPsY0bbeMxdf0fAQMD5S4tis=/0x0:1250x703/960x540/media/img/2026/01/PurgedHP/original.gif","video":null,"publish_date":"2026-01-11 19:00:00","author":"Franklin Foer","authors":["Franklin Foer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.129},{"id":392291066,"title":"Tom Homan's big 'admission' from NBC interview gets immediate backlash from viewers","text":"Donald Trump appointee Tom Homan was hit with a major backlash after he said Sunday in response to NBC News’ Kristen Welker that it was \"hateful rhetoric\" that caused ICE to shoot and kill an American woman.\n\nWelker also asked Homan whether he did, in fact, keep an alleged $50,000 bribe or whether he returned it, a question that didn’t sit well with Trump’s border czar. In a separate part of the interview, he said, \"We gotta stop the hateful rhetoric.\"\n\n\"Saying this officer is a murderer is dangerous. It's just ridiculous,\" he added. \"It's gonna infuriate people more which means there's gonna be more incidents like this.\"\n\nDem candidate Fred Wellman said, \"Hateful rhetoric is calling a suburban mom a 'radical left wing terrorist.' More hysterics from Temu gangster Homan. Stop treating US citizens as your enemy.\"\n\nDem politician Melanie D'Arrigo said, \"'Calling the ICE agent who murdered an innocent woman a murderer is going to make other ICE agents upset and want to murder other innocent women too,' is real abuser language from weak men.\"\n\nA self-identified ex-GOPer called @PSchmaling also chimed in, saying, \"Listening to Tom Homan on Meet the Press telling people to stop hateful rhetoric.\"\n\n\"That's rich, he's spent a year demonizing and threatening every one in the country with a dark complexion and brown eyes,\" the user then added.\n\nWriter Matt O'Brien said, \"True story: the Nazis only would have committed some mild genocide if people hadn’t called them Nazis so much.\"\n\nDavid Aldridge, Executive Director for the Virginia Coalition for Progressive Values, weighed in with, \"Once again, Tom. Your official agency account posted a white nationalist anthem two freakin’ days ago.\"\n\nDr Mickolas, MD, wrote, \"If you want the public to not call him a murderer, maybe the government shouldn't have labeled her immediately as a domestic terrorist.\"\n\nDemocratic strategist Matt McDermott said, \"Put another way, this is an admission that ICE officers are so unprofessional and inadequately trained that simply being criticized might cause them to lose control and resort to violence.\"","summary":"Donald Trump appointee Tom Homan was hit with a major backlash after he said Sunday in response to NBC News’ Kristen Welker that it was \"hateful rhetoric\" that caused ICE to shoot and kill an American woman.\n\nWelker also asked Homan whether he did, in fact, keep an alleged $50,000 bribe or whether he returned it, a question that didn’t sit well with Trump’s border czar. In a separate part of the interview, he said, \"We gotta stop the hateful rhetoric.\"\n\n\"Saying this officer is a murderer is dangerous. It's just ridiculous,\" he added. \"It's gonna infuriate people more which means there's gonna be more incidents like this.\"\n\nDem candidate Fred Wellman said,  \"Hateful rhetoric is calling a suburban mom a 'radical left wing terrorist.' More hysterics from Temu gangster Homan. Stop treating US citizens as your enemy.\"\n\nDem politician Melanie D'Arrigo said, \"'Calling the ICE agent who murdered an innocent woman a murderer is going to make other ICE agents upset and want to murder other innocent women too,' is real ","url":"https://www.rawstory.com/tom-homan-2674873067/","image":"https://www.rawstory.com/media-library/tom-homan-who-was-appointed-border-czar-by-u-s-president-donald-trump-speaks-to-members-of-the-media-at-the-white-house-in.jpg?id=56708240&width=1200&height=1200&coordinates=958%2C0%2C958%2C0","video":null,"publish_date":"2026-01-11 18:38:45","author":"David McAfee","authors":["David McAfee"],"language":"en","source_country":"US","sentiment":-0.503},{"id":392292346,"title":"Shocking footage from Iran shows dozens of body bags as death toll rises to 538","text":"According to the latest update from the U.S.-based Iranian human rights organization HRANA, which relies on a network of sources inside Iran, at least 538 people have been killed since the protests began about two weeks ago, including 490 protesters and 48 members of the security forces. The death toll is likely significantly higher. HRANA said more than 10,600 people have been arrested. Iran has been without internet access for a third consecutive day. The Fars news agency sought to project a sense of normalcy on Sunday, publishing photos from Tehran’s bazaar. However, particularly graphic videos published by BBC Persian and the opposition outlet Iran International, reportedly filmed near the Kahrizak forensic institute in Tehran, showed bodies being transported in pickup trucks, with family members told to search through piles of corpses to find their relatives. In 12 videos circulated online, apparently provided by a person who recently left Iran, relatives can be seen weeping beside loved ones killed in the protests. Long rows of body bags were also visible, laid out in the courtyard of the forensic institute. One video showed images of the dead displayed on a screen for identification by families, with the number 250 written beneath one image, suggesting that more than 250 bodies may be at that site alone. Despite the continued internet blackout, Iran International reported that mass protests were still underway in Tehran on Sunday evening. According to the opposition site, Iranian security forces fired tear gas at families who arrived at a Tehran cemetery for the funerals of protesters killed in recent days. The Wall Street Journal reported, citing U.S. officials, that President Donald Trump is expected to receive a briefing Tuesday on specific response options, a sign he is considering action against the Iranian regime over the violent suppression of the protests, as he has repeatedly threatened. The planned meeting with senior administration officials is expected to focus on measures against the Islamic Republic that could include covert cyber operations against military and civilian targets in Iran, additional sanctions and possible military strikes. No final decision is expected at the meeting, as discussions remain at an early stage. In preliminary talks among senior administration officials last week, concerns were raised that U.S. or Israeli action on behalf of the protesters could serve the regime’s narrative that foreign forces are behind the unrest. The Pentagon has not yet moved forces in preparation for possible strikes. The United States would need to deploy military assets not only to carry out attacks but also to defend its forces in the region. In recent days, the U.S. transferred the aircraft carrier Gerald Ford and its strike group from the Mediterranean to South America, leaving no American aircraft carrier currently stationed in either the Middle East or Europe. One option under discussion is the transfer of Starlink terminals, the satellite internet service owned by Elon Musk, into Iran, which could help protesters bypass the country’s internet and phone shutdowns. Meanwhile, following the protests over the weekend, several situation assessments were held at the IDF, led by Chief of Staff Lt. Gen. Eyal Zamir. The military stressed that the demonstrations are an internal Iranian matter but said it remains on defensive alert and continues to improve its capabilities and operational readiness. ‘We will know how to respond forcefully if required. The IDF will do whatever is necessary to protect the citizens of the State of Israel,’ officials said. At the start of Sunday’s Cabinet meeting, Prime Minister Benjamin Netanyahu said Israel was closely monitoring developments in Iran. ‘The protests for freedom have spread across the country,’ Netanyahu said. ‘The people of Israel, and the entire world, stand in awe of the tremendous courage of Iran’s citizens.’ He added: ‘We all hope that the Persian nation will soon be freed from the yoke of tyranny, and when that day comes, Israel and Iran will once again be loyal partners in building a future of prosperity and peace for both peoples.’","summary":"The death toll continues to rise, with graphic videos showing images of the dead and grieving relatives beside rows of body bags; the Wall Street Journal reported Trump will be briefed Tuesday on response options, including military strikes, but no US aircraft carrier is currently in the region","url":"https://www.ynetnews.com/article/h14fmpwhwx","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/01/11/HkEEewIbS11x/HkEEewIbS11x_0_17_1080_608_0_large.jpg","video":null,"publish_date":"2026-01-11 18:13:28","author":"Lior Ben Ari","authors":["Lior Ben Ari"],"language":"en","source_country":"il","sentiment":0.019},{"id":392294290,"title":"Smithsonian swaps portrait of Trump - and removes any reference to his impeachments","text":"The Smithsonian’s National Portrait Gallery in Washington, D.C., has swapped out President Donald Trump’s portrait and removed accompanying text that referenced his impeachments and the January 6, 2021, Capitol riots, a new Washington Post report reveals. \n\nThe White House shared photos of the new portrait earlier this week in a post on X. The original text accompanying the portrait was removed and replaced by a new placard that only lists the president’s years in office, the Post reports. \n\nThe change comes after a Trump administration official complained about the accompanying text several months ago, according to the Post.\n\nThe original text, which the Post reports was still available on the Smithsonian’s website as of Saturday, described Trump’s path to the White House, the accomplishments of his first term, his two impeachments and the January 6 Capitol riots. The original text also noted that Trump lost the 2020 election to former President Joe Biden.\n\n“Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the U.S. Capitol on January 6, 2021, he was acquitted by the Senate in both trials,” the original text reads, in part.\n\nWhen asked about the changes, a Smithsonian spokesperson told The Independent: \"For some new exhibitions and displays, the museum has been exploring quotes or tombstone labels, which provide only general information, such as the artist's name.\"\n\n\"The history of Presidential impeachments continues to be represented in our museums, including the National Museum of American History. The previous label of the National Portrait Gallery's portrait remains available on the museum's website,\" the spokesperson added\n\nMeanwhile, White House spokesperson Davis Ingle praised the new portrait, but did not respond to The Independent’s question about whether a Trump administration official requested any of these changes.\n\n“For the first time in history, the Smithsonian National Portrait Gallery has hung up an iconic photo taken by the White House honoring President Trump. His unmatched aura will be seen and felt throughout the halls of the National Portrait Gallery,” Ingle said. \n\nA White House official said the portrait was taken by White House photographer Daniel Torok, and that the museum can use photographs until an official portrait painting has been completed.\n\nThis comes after the Smithsonian removed, but later reinstated, an exhibit about Trump’s impeachments last summer. Museum officials said at the time they were \"not asked by any administration or other government official to remove content from the exhibit” and described the change as part of a routine replacement.\n\nTrump has also sought to put his name on a number of Washington, D.C., institutions, including the Kennedy Center and the U.S. Institute of Peace.","summary":"The White House shared the new portrait on social media earlier this week","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-national-portrait-gallery-changes-b2898213.html","image":"https://static.independent.co.uk/2026/01/11/3/01/G-UjpvkWwAAZLOG-(1).jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/RkFDyBLL-4VHSaSK0.mp4","publish_date":"2026-01-11 18:08:36","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.085},{"id":392291086,"title":"Trump's border czar erupts when pressed on alleged $50k bribe: 'I'm not addressing it!'","text":"President Donald Trump’s border czar Tom Homan erupted Sunday after NBC News’ Kristen Welker pressed him on an alleged $50,000 cash bribe he reportedly took in exchange for dishing out government contracts to private prisons.\n\nLast September, it was revealed that Homan had been ensnared in an FBI probe in 2024, and was being investigated by the agency for allegedly accepting a $50,000 cash bribe from undercover FBI agents in exchange for promising to award private prisons lucrative government contracts under the second Trump administration.\n\nWhile the investigation was closed in 2025, Welker asked Homan whether he did, in fact, keep the alleged $50,000 bribe or whether he returned it, a question that didn’t sit well with Trump’s border czar.\n\n“I didn't take $50,000 from anybody, and that's a question for the FBI – I'm not gonna give this story any more air!” Homan said. “Bottom line: I did nothing illegal, I did nothing... uh... and the FBI and DOJ reviewed this... no credible evidence I did anything because I didn't do anything illegal.”\n\nWelker pressed Homan on the matter, only for Homan to erupt further.\n\n“I'm not giving this story any more air!” Homan said. “This is an attack on my integrity and my professionalism, I'm not addressing it! That's a question for the FBI.”\n\nAgain, Welker continued to press Homan on the issue, which Homan continued to grow more irritated with.\n\n“I did not keep... $50,000 is ridiculous!” he continued. “And it irritates me this story keeps going on and on and on even though I've been found that nothing inappropriate, so I'm not gonna answer anymore of these questions.”\n\nWelker asked Homan again whether he returned the alleged $50,000 bribe, and finally got a more direct answer.\n\n“I didn't have any money to return!” Homan said. “I didn't take the $50,000, bottom line.”\n\nGiven his new declarative statement – that he had not accepted the alleged $50,000 bribe, Welker then asked if he’d be comfortable with the FBI releasing documents related to investigation, a question that Homan shut down immediately, saying he didn’t want to “get ahead” of the FBI. Welker asked the same question twice more, and both times, Homan refused to answer.","summary":"President Donald Trump’s border czar Tom Homan erupted Sunday after NBC News’ Kristen Welker pressed him on an alleged $50,000 cash bribe he reportedly took in exchange for dishing out government contracts to private prisons.\n\nLast September, it was revealed that Homan had been ensnared in an FBI probe in 2024, and was being investigated by the agency for allegedly accepting a $50,000 cash bribe from undercover FBI agents in exchange for promising to award private prisons lucrative government contracts under the second Trump administration.\n\nWhile the investigation was closed in 2025, Welker asked Homan whether he did, in fact, keep the alleged $50,000 bribe or whether he returned it, a question that didn’t sit well with Trump’s border czar.\n\n“I didn't take $50,000 from anybody, and that's a question for the FBI – I'm not gonna give this story any more air!” Homan said. “Bottom line: I did nothing illegal, I did nothing... uh... and the FBI and DOJ reviewed this... no credible evidence I did anything because ","url":"https://www.rawstory.com/tom-homan-2674873163/","image":"https://www.rawstory.com/media-library/image.jpg?id=61215202&width=1200&height=1200&coordinates=1059%2C0%2C1060%2C0","video":null,"publish_date":"2026-01-11 18:00:19","author":"Alexander Willis","authors":["Alexander Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-1},{"id":392288048,"title":"Donald Trump’s Greenland ambitions rattle Europe as leaders push for diplomacy","text":"LONDON — For Prime Minister Mette Frederiksen of Denmark and leaders across Europe, the threat of violence from their American allies was shocking.\n\nStephen Miller, one of President Donald Trump’s closest aides, was asked Monday to rule out the use of military force to seize Greenland, a semi-autonomous territory of Denmark. Miller not only refused. He also questioned Greenland’s status, ignored its historical ties to Denmark and mocked the idea that Europe could stand up to US troops.\n\n“The real question is, by what right does Denmark assert control over Greenland?” Miller said on CNN. “Obviously, Greenland should be part of the United States.”\n\nAlthough Frederiksen had long taken Mr Trump’s threats seriously, Miller’s blunt comments blew apart what had been her yearlong effort to quietly talk the president out of his desire to control Greenland. They stunned a visibly frazzled Frederiksen and created a sense of near panic among her counterparts in Europe, according to interviews with more than a dozen diplomatic and military officials and others in several countries.\n\nThe comments by Miller, and the president’s earlier insistence that “we do need Greenland, absolutely,” crystallised the danger for Europe’s leaders, the officials said. They are now working behind the scenes to draft potential responses, including the idea of building up NATO forces to better counter Chinese and Russian influence, or even offering Mr Trump access to Greenland’s vast mineral deposits.\n\nThe emerging consensus is that they must find a way to avoid a damaging political confrontation with Mr Trump through negotiation. One concern expressed privately among European officials is that Greenland is not about security or economic resources, but about Mr Trump’s desire to “make America greater again,” as one European foreign minister said, and go down in history as having expanded US territory for the first time in decades.\n\nMr Trump was blunt about Greenland on Friday at the White House, saying, “I would like to make a deal the easy way, but if we don’t do it the easy way, we’re going to do it the hard way.”\n\nEven for a Continent whose leaders have grown used to Trump’s repeated assault on long-standing alliances in Europe, the renewed targeting of Greenland left officials shaken, appalled and nervous, according to several of the officials.\n\nIt also left them far from united on how to respond. A statement of support for Denmark came Tuesday from six other European countries, not the entire 27-nation membership of the European Union. Privately, officials have disagreed about how aggressively to criticise Mr Trump because his help is critical to efforts to ending the war in Ukraine, which many European leaders view as a defining threat.\n\nA direct challenge to Mr Trump is likely to produce an angry response, one European foreign minister said, but too weak a stance would be equally damaging.\n\nFrederiksen has warned publicly that an American attempt to take Greenland by force would “mean the end of the NATO alliance.” And Denmark’s Defense Ministry said in a statement Friday that if Greenland were invaded, its soldiers would be allowed to shoot without waiting for instructions from superiors.\n\nJean-Noël Barrot, the French foreign affairs minister, said on French public radio that he did not believe Mr Trump would invade Greenland. When it comes to any form of intimidation, he added, Europe must “prepare ourselves to respond, to retaliate, and not to respond alone.”\n\nOthers in Europe urged calm, noting that Secretary of State Marco Rubio plans to meet with officials from Denmark in the coming days. Ursula von der Leyen, the president of the European Commission, said this past week that “cooperation is stronger than confrontation.”\n\nThere has been a push across Europe to dial back tough talk in the hopes that members of Congress in the United States, including Republicans, can persuade Mr Trump and his aides to back down, three European diplomats and a senior Western military official said.\n\nJesper Moller Sorensen, the Danish ambassador, has chronicled meetings with American lawmakers on the social media platform X. US Rep. Mike Flood, R-Neb., wrote after one meeting this past week that the ambassador “expressed an openness to discuss any measure that would enhance the security of the United States, while respecting the sovereignty of the Kingdom of Denmark.”\n\nLittle evidence has emerged that an invasion is imminent, several of the officials acknowledged. European leaders are still trying to figure out how real the threat is and exactly what Mr Trump’s goals are. They do not want to risk escalating the situation before they fully understand it.\n\nAcross Europe, the Greenland conversations began in earnest Tuesday morning, hours after Miller’s comments, when the leaders of many European countries had gathered in Paris to discuss ways to end the war in Ukraine. In Paris the following day, Polish, French and German foreign ministers talked again. And Thursday in Brussels, diplomats hashed out ideas at a meeting of the North Atlantic Council, NATO’s political arm. Ambassadors from across the 27 nations of the European Union heard a state of play on the situation Friday.\n\nIn between, officials across Europe traded phone calls and text messages.\n\nEuropean leaders have made a point of reassuring Frederiksen, who is normally blunt and strong-willed, about their support. The conversations have yet to lead to consensus on what to do if Mr Trump decides to make good on his threats.\n\nOne possibility under discussion is whether Denmark might offer to alter the legal status of Greenland without changing its ownership. In essence, as one official said, the United States could act in Greenland as if it owned it, but without doing so.\n\nGreenlanders could, for example, vote for independence and then associate themselves with the United States for security and economic benefits, without becoming part of the United States. That would most likely require a significant economic offer to Greenland’s 56,000 or so citizens that would improve considerably from what Denmark currently provides them, which is estimated at some $1 billion a year.\n\n“That would be the cleverest way, to offer a significant carrot,” said Jon Rahbek-Clemmensen of the Center for Arctic Security Studies at the Royal Danish Defense College.\n\nSuch a deal would not appear to satisfy Mr Trump. In an interview with The New York Times this past week, the president said that “ownership is very important.” He added: “That’s what I feel is psychologically needed for success. I think that ownership gives you a thing that you can’t do, whether you’re talking about a lease or a treaty.”\n\nAnother option that European officials are discussing is a significant buildup of NATO forces in Greenland to demonstrate to Mr Trump that the alliance is serious about countering Chinese and Russian activity in the Arctic.\n\nAt the North Atlantic Council meeting, officials weighed the possibility of a maritime exercise involving warships and icebreakers, one NATO ambassador said. It would be a sign of reassurance and also a symbol of allied commitment.\n\nWhether to bolster Arctic security efforts has been a long-standing debate in NATO. Washington has pushed for more action for years. Canada, at least until recently under Prime Minister Mark Carney, has been reluctant to cede more responsibility to NATO. But if investing more military resources in Greenland could ease Mr Trump’s demands to seize the island, it will become a more pressing debate now, the NATO ambassador said.\n\nSome European officials have raised the possibility of allowing the United States to expand its military presence on Greenland without having to acquire the island. Others have said Denmark could seek a deal to provide the United States with rare minerals from Greenland needed for high-tech and military manufacturing, something Mr Trump has expressed interest in.\n\nOther suggestions, like establishing a permanent European base in Greenland, would be unlikely to get significant support among officials on the Continent. Several of the officials said it would be best to keep the security issue within NATO, thus involving the Americans.\n\n“If Greenland has a security problem, the answer is not for the US to take over Greenland but work together with 31 allies,” said Ivo H. Daalder, a US ambassador to NATO under President Barack Obama.\n\nEuropean officials have also discussed how to show the United States that they are ramping up their financial commitment to Greenland and Arctic security, two diplomats and another European official said. The European Union has proposed a large spending increase as part of its next budget, for instance.\n\nMr Barrot, the French foreign affairs minister, rejected any sale of Greenland. He referred to the Louisiana Purchase of 1803, which occurred when Napoleon sold 828,000 square miles of land to the Americans in part to fund an ongoing war in Haiti, then one of its colonies in revolt.\n\n“Greenland is not for sale, nor is it for the taking,” Mr Barrot said. “We are no longer in the era when one could buy or sell Louisiana.”\n\nThis article originally appeared in The New York Times.\n\n© 2026 The New York Times Company","summary":"The US President’s renewed push to claim Greenland has left Europe’s leaders alarmed and divided, as they scramble to defuse tensions and craft a diplomatic path forward.","url":"https://thewest.com.au/news/world/donald-trumps-greenland-ambitions-rattle-europe-as-leaders-push-for-diplomacy-c-21273693","image":"https://images.thewest.com.au/publication/C-21273693/e78e006e03d8656d87e89fd057da080d646c4625-16x9-x0y0w3840h2160.jpg?imwidth=1200","video":null,"publish_date":"2026-01-11 18:00:00","author":"Eric Schmitt,Michael D. Shear,Steven Erlanger and Jeanna Smialek","authors":["Eric Schmitt","Michael D. Shear","Steven Erlanger and Jeanna Smialek"],"language":"en","category":"politics","source_country":"au","sentiment":-0.003},{"id":392292378,"title":"More than 10,000 arrested in Iran; Trump considers next steps","text":"According to the latest update from the U.S.-based Iranian human rights organization HRANA, which relies on a network of sources inside and outside Iran, at least 538 people have been killed since the protests began in late December. HRANA said it had verified the deaths of 490 protesters and 48 members of the security forces, with more than 10,600 people arrested. Reuters said it was unable to independently verify the figures, and the true toll may be significantly higher. Several situation assessments were held over the weekend at the IDF, led by Chief of Staff Lt. Gen. Eyal Zamir, following the protests in Iran. The military stressed that the demonstrations are an internal Iranian matter, but said it remains prepared on the defensive front and is continuously improving its capabilities and operational readiness. “We will know how to respond forcefully if required. The IDF will do whatever is necessary to protect the citizens of the State of Israel,” officials said. At the start of the weekly Cabinet meeting, Prime Minister Benjamin Netanyahu said that “Israel is closely monitoring what is happening in Iran. The protests for freedom have spread across the country. The people of Israel, and the entire world, stand in awe of the tremendous courage of Iran’s citizens. Israel supports their struggle for freedom and strongly condemns the mass slaughter of innocent civilians.” He added that “we all hope that the Persian nation will soon be freed from the yoke of tyranny, and when that day comes, Israel and Iran will once again be loyal partners in building a future of prosperity and peace for both peoples.” Footage verified by Reuters showed large nighttime demonstrations in Tehran, as well as fires, debris and explosions in the northeastern city of Mashhad. The flow of information from Iran has been severely restricted by an internet blackout imposed by authorities. Three Israeli sources said Israel was placed on a high-alert footing amid concerns over possible U.S. intervention. An Israeli military official said Israel views the protests as an internal Iranian matter but is monitoring developments closely and is prepared to respond “with power if need be.” The New York Times reported Sunday that U.S. Secretary of State Marco Rubio spoke with Netanyahu over the weekend, with the two discussing the protests in Iran amid updated assessments in Jerusalem that there is now a tangible possibility the regime could fall. According to several senior U.S. officials quoted by the newspaper who are familiar with the matter, President Donald Trump has been briefed in recent days on new strike options against Iran, as he weighs carrying out his threat to bomb the country over the violent suppression of the protests. At this stage, Trump has not made a final decision on a strike, but the officials said he is seriously considering ordering airstrikes in response to the ayatollahs’ regime’s efforts to crush the demonstrations, which erupted over Iran’s economic situation and deteriorating living conditions. The Times reported that Trump was presented with a range of options, including strikes in Tehran against nonmilitary targets. Senior U.S. officials added that at least some of the options presented are directly linked to elements of Iran’s security services, which have used violence to rein in the growing protests. At the same time, officials in Washington have stressed that the United States must be cautious, warning that strikes on Iran could have the opposite effect by rallying public support behind the ayatollahs’ regime, or trigger a wave of retaliatory attacks by Tehran that could threaten U.S. troops and diplomats across the region. According to a senior U.S. military official, American commanders would want additional time before any possible strike to “reinforce positions and prepare defenses” ahead of a potential Iranian response. Earlier Sunday, Iranian Parliament Speaker Mohammad Bagher Ghalibaf warned that “in the event of aggression against Iran, American bases in the region and Israel will be within our range.” Iranian President Masoud Pezeshkian also sought to deflect blame toward Israel, saying Iran’s enemies want to “sow chaos and disorder” following the 12-day war waged against Iran in June. Pezeshkian said his government is determined to address the Iranian people’s economic problems and is willing to listen to the public, but urged Iranians to distance themselves from “rioters and terrorists.” He claimed that the United States and Israel are giving instructions to the “rioters” in an effort to destabilize Iran.","summary":"At least 538 people have been killed since protests began, with the toll likely higher; Trump has been briefed on strike options, but the New York Times says the US may seek more time; the IDF says it is prepared, Netanyahu praises the ‘courage of Iran’s citizens’","url":"https://www.ynetnews.com/article/h1lky4wszl","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/01/05/r1smasKEZl/r1smasKEZl_0_0_850_479_0_large.jpg","video":null,"publish_date":"2026-01-11 17:17:07","author":"Yoav Zitun, Itamar Eichner, Lior Ben Ari, Reuters","authors":["Yoav Zitun, Itamar Eichner, Lior Ben Ari, Reuters"],"language":"en","category":"politics","source_country":"il","sentiment":0.186},{"id":392291076,"title":"'It's just not true!': CNN calls out Noem to her face over blatant double standard","text":"Homeland Security Secretary Kristi Noem was put in the hot seat on CNN Sunday after being backed into a corner over her “different standard” when it came to when law enforcement should be allowed to use deadly force.\n\nNoem appeared with CNN’s Jack Tapper to fiercely defend the deadly use of force in the killing of Rene Good, a Minnesota woman who was fatally shot Wednesday by a federal immigration agent. She argued that by Good having accelerated her vehicle in the direction of the agent, she had become a physical threat, and therefore, her killing was justified.\n\nNoem was put on the spot, however, after Tapper cued up video of supporters of President Donald Trump attacking law enforcement during the Jan. 6 Capitol riot.\n\n“By this standard, would any of those officers be justified in shooting and killing the people causing them physical harm?” Tapper asked.\n\nNoem dodged the question – as she had done earlier in the interview – and instead issued a generic statement about law enforcement having the right to arrest individuals that pose a threat.\n\n“Every single situation is going to rely on the situation those officers [are in], that they know that when people are putting hands on them, when they are using weapons against them, when they are physically harming them, that they have the authority to arrest those individuals,” she said.\n\n“The president pardoned every single one of those people,” Tapper pointed out.\n\nInstead of addressing Tapper’s remark, Noem went on to insist that the Trump administration was enforcing “every single” law, regardless of the circumstances, a claim that Tapper immediately called her out on for being false.\n\n“I just showed you video of people attacking law enforcement officers. Undisputed proof, undisputed evidence, and I just said President Trump pardoned all of them, and you said President Trump is enforcing all of the laws equally,” Tapper said. \n\n“It's just not true! There's a different standard for law enforcement officials being attacked if they're being attacked by Trump supporters, we just saw that!”","summary":"Homeland Security Secretary Kristi Noem was put in the hot seat on CNN Sunday after being backed into a corner over her “different standard” when it came to when law enforcement should be allowed to use deadly force.\n\nNoem appeared with CNN’s Jack Tapper to fiercely defend the deadly use of force in the killing of Rene Good, a Minnesota woman who was fatally shot Wednesday by a federal immigration agent. She argued that by Good having accelerated her vehicle in the direction of the agent, she had become a physical threat, and therefore, her killing was justified.\n\nNoem was put on the spot, however, after Tapper cued up video of supporters of President Donald Trump attacking law enforcement during the Jan. 6 Capitol riot.\n\n“By this standard, would any of those officers be justified in shooting and killing the people causing them physical harm?” Tapper asked.\n\nNoem dodged the question – as she had done earlier in the interview – and instead issued a generic statement about law enforcement having the right to ar","url":"https://www.rawstory.com/kristi-noem-2674873110/","image":"https://www.rawstory.com/media-library/image.jpg?id=62710718&width=1200&height=1200&coordinates=334%2C0%2C334%2C0","video":null,"publish_date":"2026-01-11 17:08:53","author":"Alexander Willis","authors":["Alexander Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.694},{"id":392291316,"title":"Trump tells Cuba to ‘make a deal, before it is too late’","text":"WASHINGTON: US President Donald Trump urged Cuba on Sunday (Jan 11) to “make a deal” or face unspecified consequences, warning that the flow of Venezuelan oil and money to Havana would now stop.\n\n“THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA – ZERO!” Trump said on his Truth Social channel. “I strongly suggest they make a deal, BEFORE IT IS TOO LATE.”\n\nHis remarks come a week after US forces seized Venezuela’s authoritarian leader Nicolas Maduro in a nighttime operation in Caracas that killed dozens of Venezuelan and Cuban security forces.\n\nEarlier on Sunday, Trump reposted a message suggesting that US Secretary of State Marco Rubio could become the president of now communist-ruled Cuba.\n\nTrump shared that post with the comment: “Sounds good to me!”\n\nIn his own post soon afterwards, Trump said that “Cuba lived, for many years, on large amounts of OIL and MONEY from Venezuela. In return, Cuba provided ‘Security Services’ for the last two Venezuelan dictators, BUT NOT ANYMORE!”\n\n“Most of those Cubans are DEAD from last week’s U.S.A. attack, and Venezuela doesn’t need protection anymore from the thugs and extortionists who held them hostage for so many years.”\n\nUnder a US trade embargo, Havana since 2000 has increasingly relied on Venezuelan oil provided as part of a deal struck with Maduro’s predecessor Hugo Chavez.\n\nArticle source: https://www.channelnewsasia.com/world/trump-cuba-strike-deal-us-5851411","summary":"WASHINGTON: US President Donald Trump urged Cuba on Sunday (Jan 11) to &#8220;make a deal&#8221; or face unspecified consequences, warning that the flow of Venezuelan oil and money to Havana would now stop. &#8220;THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA &#8211; ZERO!&#8221; Trump said on his Truth Social channel. &#8220;I strongly [&#8230;]","url":"https://china.timesofnews.com/breaking-news/trump-tells-cuba-to-make-a-deal-before-it-is-too-late","image":null,"video":null,"publish_date":"2026-01-11 16:45:55","author":"Times of News","authors":["Times of News"],"language":"en","category":"politics","source_country":"in","sentiment":-0.137},{"id":392291082,"title":"'Who cares': Trump gets MAGA blowback after tone deaf boast about luxury resort design","text":"President Donald Trump took to social media Sunday to brag about the front entrance of his luxury Mar-a-Lago resort in Palm Beach, Florida, a boast that came hot on the heels of an underwhelming jobs report that showed “weaker than expected” growth in the private sector, and one that drew pushback even on his own social media platform.\n\n“The Entrance to Mar-a-Lago!” Trump proudly boasted on his social media platform Truth Social, sharing a photo of the entrance to his resort, covered in gold-platted decals and trim.\n\nEven on his own platform, Trump received some pushback from his supporters, with Truth Social user “George” writing that he’d “give a s— about your entrance” once they received a “tariff rebate check,” which Trump has repeatedly promised to award every American.\n\nThat user previously expressed pro-Trump sentiments\n\n“What do we do with this information Mr. President?” wrote another, Truth Social user “Eric Ochanji II,” who was apparently dumbfounded by Trump’s post. Similarly, that individual shared numerous pro-MAGA posts.\n\nAnd another, Truth Social user “Cheshiret,” simply wrote “who cares” Sunday. That person widely shares posts by top Trump officials.","summary":"President Donald Trump took to social media Sunday to brag about the front entrance of his luxury Mar-a-Lago resort in Palm Beach, Florida, a boast that came hot on the heels of an underwhelming jobs report that showed “weaker than expected” growth in the private sector, and one that drew pushback even on his own social media platform.\n\n“The Entrance to Mar-a-Lago!” Trump proudly boasted on his social media platform Truth Social, sharing a photo of the entrance to his resort, covered in gold-platted decals and trim.\n\nEven on his own platform, Trump received some pushback from his supporters, with Truth Social user “George” writing that he’d “give a s— about your entrance” once they received a “tariff rebate check,” which Trump has repeatedly promised to award every American.\n\nThat user previously expressed pro-Trump sentiments\n\n“What do we do with this information Mr. President?” wrote another, Truth Social user “Eric Ochanji II,” who was apparently dumbfounded by Trump’s post. Similarly, that individual shar","url":"https://www.rawstory.com/trump-2674873068/","image":"https://www.rawstory.com/media-library/image.jpg?id=62710684&width=1200&height=1200&coordinates=331%2C0%2C332%2C0","video":null,"publish_date":"2026-01-11 16:26:25","author":"Alexander Willis","authors":["Alexander Willis"],"language":"en","source_country":"US","sentiment":0.221},{"id":392290188,"title":"Cuban President Miguel Díaz-Canel says U.S. has no moral authority to threaten Cuba","text":"Cuban President Miguel Díaz-Canel has responded to Donald Trump’s latest threats, stating that “those who turn everything into a business, even human lives, have no moral authority to point the finger at Cuba.”\n\nOn Sunday, the U.S president urged Cuban authorities to “reach an agreement” after noting that following the capture of Venezuelan President Nicolás Maduro last weekend, shipments of oil and money from Caracas “have stopped.”\n\nThey have no moral authority to point the finger at Cuba in any way — absolutely in no way at all — those who turn everything into a business, even human lives. Those who are now venting hysterically against our nation are consumed by rage at the sovereign decision of this people to choose their political model.”\n\nMiguel Diaz-Canel, in response, denounced that “those who blame the Revolution for the severe economic shortages we suffer should be ashamed to remain silent” because “they are the result of the draconian measures of extreme strangulation that the U.S. has imposed on us for six decades and threatens to intensify now.”\n\nThe Cuban president concluded by proclaiming that “Cuba is a free, independent and sovereign nation” and that “it does not attack; it has been attacked by the US for 66 years, and it does not threaten; it is preparing, ready to defend the Homeland to the last drop of blood.”\n\n[ SOURCE: teleSUR ]","summary":"Cuban President Miguel Díaz-Canel says U.S. has no moral authority to threaten Cuba","url":"https://www.radiohc.cu/en/cuban-president-miguel-diaz-canel-says-u-s-has-no-moral-authority-to-threaten-cuba/","image":"https://www.radiohc.cu/wp-content/uploads/2025/11/b05994c3-cf6c-4c5d-b855-4d3a804acc2f.jpg__830x600_q85_subject_location-124388_subsampling-2.jpg","video":null,"publish_date":"2026-01-11 16:21:06","author":"Ed Newman","authors":["Ed Newman"],"language":"en","category":"politics","source_country":"CU","sentiment":-0.576},{"id":392294300,"title":"Operation Hawkeye Strike: How Donald Trump is taking on ISIS in Syria again","text":"Donald Trump has launched new strikes in Syria to drive out a resurgent Islamic State, after the terror group killed two American soldiers and an interpreter last month.\n\nU.S. Central Command (CENTCOM) on Saturday confirmed the latest strikes against ISIS in Syria, with one official saying two dozen aircraft had carried out 90 strikes on 35 targets.\n\nCENTCOM shared grainy black and white footage of explosions and reiterated its commitment to “rooting out Islamic terrorism” and protecting partners in the region.\n\nOperation Hawkeye Strike, launched in December, has been developed in a new partnership with the Syrian government that displaced longtime dictator Bashar al-Assad little over a year ago. \n\nThe Independent looks at what Operation Hawkeye involves, and why it has happened now.\n\nThe latest U.S. activity in Syria began in the days after a lethal ISIS attack on American and Syrian forces in Palmyra.\n\nAccording to the U.S. government, ISIS killed two American soldiers and a handler on 13 December. Syria’s interior ministry said the attacker was a police officer suspected of sympathising with Islamic State.\n\nThe victims were identified as Sgt. Edgar Brian Torres Tovar, 25, and Sgt. William Nathaniel Howard, 29. Three other Iowa National Guard members were wounded, officials said.\n\nWithin a week, the U.S. had launched massive strikes against dozens of ISIS targets in conjunction with the Jordanian air force. Secretary of defense Pete Hegseth said coalition forces struck fighters, infrastructure, and weapons sites on 19 December, and named the operation ‘Hawkeye’.\n\nOne U.S. official said Washington had used F-15s fighter jets, A-10 Warthogs, Apache helicopters and HIMARS rocket systems to hit ISIS cells in the December assault. A Syrian security said targets were struck in Homs, Deir ez-Zor and Raqqa provinces. With only around 1,000 troops left in Syria, the US did not carry out any ground operations.\n\nFive ISIS members were killed, including the head of a cell responsible for operating drones in the area, according to the Syrian Observatory for Human Rights. Another Syrian official told the AFP news agency that the “intense” bombardment had lasted five hours.\n\nTrump, who authorized the strikes, said that they had the full support of Syrian president Ahmed al Sharaa, who reached an agreement with Washington during a visit in November. \n\nOn 10 January, the U.S. carried out a second wave of strikes on targets across Syria with unnamed ‘partner forces’.\n\nAn unnamed US official told CNN that the operation launched 90 precision munitions at more than 35 targets, using over two dozen aircraft. It is not yet clear if there were any casualties. \n\nCENTCOM said: “Our message remains strong: if you harm our warfighters, we will find you and kill you anywhere in the world, no matter how hard you try to evade justice.”\n\nA fragile amnesty for the Syrian government has allowed the U.S. to scale up its work to oust ISIS. But after the fall of Assad, it was unclear whether Washington would stick around to finish off the group.\n\nThe U.S. had spent 10 years in the country fighting ISIS under ‘Operation Inherent Resolve’ by 2024. By 2019, the terror group was exhausted and had lost all its major positions in Syria. The group moved underground while factions continued deadly attacks on civilians abroad and plotted attacks in Europe.\n\nWhen al Sharaa’s HTS swept into Damascus in November 2024, then president-elect Trump opposed the Biden administration’s use of precision airstrikes against ISIS camps in Syria.\n\nHe said the U.S. “should have nothing to do with” the country and added: “This is not our fight. Let it play out. Do not get involved. Syria is a mess, but it is not our friend”.\n\nOver the last year, the president has lifted sanctions on Syria and vowed to crush a resurgent Islamic State, whether in the Middle East or elsewhere.","summary":"The president has stepped up attacks on ISIS in recent weeks after saying the U.S. should have ‘nothing to do with’ Syria","url":"https://www.independent.co.uk/news/world/middle-east/operation-hawkeye-donald-trump-isis-syria-b2898314.html","image":"https://static.independent.co.uk/2026/01/11/12/10/Screenshot-2026-01-11-at-11-39-28.png?crop=2388,1592,x63.9,y0&trim=0,471,0,63&width=1200","video":"https://cdn.jwplayer.com/videos/zaAYH4J7-OhrQWqOm.mp4","publish_date":"2026-01-11 16:10:56","author":"James C. Reynolds","authors":["James C. Reynolds"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.384},{"id":392294324,"title":"You can’t give Nobel Peace Prize to someone else, committee tells winner Machado before Trump meeting","text":"The organizers of the Nobel Peace Prize have told winner María Corina Machado it “cannot be revoked, shared or transferred” after she suggested giving Donald Trump her 2025 award.\n\nThe institute said in a statement the decision to award a Nobel Prize is “final and stands for all time”, citing the statutes of the Nobel Foundation, which do not allow appeals.\n\nThe warning comes after the U.S. president said he would be honored to accept the prize if offered by the Venezuelan opposition leader during a planned meeting in Washington next week.\n\nMachado’s win in October was reported to have sparked resentment for Trump, who has long expressed interest in winning the prize and has at times linked it to diplomatic achievements, even though she has been effusive in her support and dedicated her win to him.\n\nMachado has since backed Trump’s campaign to tackle Venezuelan drug boats and overthrow Nicolás Maduro. She and fellow Vente politician Edmundo Gonzalez had been thought to be frontrunners to lead the country after the shock capture of the former Venezuelan president, but she was sidelined in the aftermath of his toppling.\n\nFollowing the U.S. raid, Trump said Machado was a “very nice woman” but that it would be “tough” for her to lead Venezuela because she did not have “respect within or the support within the country”.\n\nIn response, Machado offered to share or even personally give her prize to the president.\n\nSpeaking to Sean Hannity on Fox News on Monday, she said that presenting the prize to Trump would be an act of gratitude from the Venezuelan people for the removal of Maduro.\n\n”Did you at any point offer to give him the Nobel Peace Prize?“ Hannity asked. “Did that actually happen?” She responded, “Well, it hasn’t happened yet.”\n\nOf the potential offer, Trump said: “I’ve heard that she wants to do that. That could be a great honor.”\n\nBut the Norwegian Nobel Committee and the Norwegian Nobel Institute warned on Friday: ”Once a Nobel Prize is announced, it cannot be revoked, shared or transferred to others. The decision is final and stands for all time.”\n\nThe organization also noted that committees awarding the prizes do not comment on the actions or statements of laureates after receiving awards.\n\nMachado, who has been in hiding due to persistent threats on her life, emerged only briefly in Oslo after a three-day mission in which she was smuggled out of the country with the help of the US military for the Nobel ceremony.\n\nThe Venezuelan opposition leader, a former National Assembly member, was barred from running in Venezuela’s 2024 general election by authorities aligned with Maduro.\n\nShe backed a stand-in candidate who was widely considered to have won the vote, although Maduro claimed victory. Ballot audits by independent observers showed irregularities in the official results.","summary":"Warning comes after U.S. president says he would be ‘honored’ to accept prize if offered by Venezuelan opposition leader during meeting in Washington","url":"https://www.independent.co.uk/news/world/americas/nobel-peace-prize-machado-trump-maduro-venezuela-b2898349.html","image":"https://static.independent.co.uk/2025/10/10/10/41/marina-trump-split.jpeg?crop=2047.5,1365,x0.3,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/yFaYdA1L-OhrQWqOm.mp4","publish_date":"2026-01-11 16:10:43","author":"Tara Cobham","authors":["Tara Cobham"],"language":"en","category":"politics","source_country":"gb","sentiment":0.049},{"id":392291060,"title":"'Jaw dropping': Dem gov who beat Trump in court shows how to win against 'bully' president","text":"A Democratic governor beat Donald Trump's White House in court after what she described as a \"jaw dropping\" interaction with the president. Now, she's telling others how to handle him.\n\nMaine Governor Janet Mills appeared on MS NOW on Sunday, and was asked about a moment when she literally and figuratively stood up to the president. Mills stood in a room with others when the president tried to force her to \"comply\" with rules about trans people in sports.\n\nThe incident was in February of 2025, when Mills told the president, \"I'll see you in court,\" after he confidently declared, \"We are the federal law.\"\n\nMills ended up filing that suit, and the Trump administration quietly backed down, according to a host on the network.\n\nSpeaking on MS NOW over the weekend, Mills said it's \"time for the congress\" to stand up to Trump's ICE. In doing so, she notes, \"If you don't stand up to a bully, they never stop. He's bullying the people.\"\n\nMills then brought her own experience with the president into the equation.\n\n\"And when I had that confrontation with the president... when we said we are the federal law, that was a jaw-dropping moment for me and many Americans,\" she said. \"We know what the constitution says. The constitution says the president shall take care that the laws be faithfully executed, not that he can make up laws across America and terrorize people. That's not his job.\"","summary":"A Democratic governor beat Donald Trump's White House in court after what she described as a \"jaw dropping\" interaction with the president. Now, she's telling others how to handle him.\n\nMaine Governor Janet Mills appeared on MS NOW on Sunday, and was asked about a moment when she literally and figuratively stood up to the president. Mills stood in a room with others when the president tried to force her to \"comply\" with rules about trans people in sports.\n\nThe incident was in February of 2025, when Mills told the president, \"I'll see you in court,\" after he confidently declared, \"We are the federal law.\"\n\nMills ended up filing that suit, and the Trump administration quietly backed down, according to a host on the network.\n\nSpeaking on MS NOW over the weekend, Mills said it's \"time for the congress\" to stand up to Trump's ICE. In doing so, she notes, \"If you don't stand up to a bully, they never stop. He's bullying the people.\"\n\nMills then brought her own experience with the president into the equation.\n\n\"And ","url":"https://www.rawstory.com/trump-jaw-dropping-janet-mills/","image":"https://www.rawstory.com/media-library/maine-governor-janet-mills-stands-as-u-s-president-donald-trump-speaks-during-a-business-session-with-u-s-governors-who-are-in.jpg?id=56575574&width=1200&height=1200&coordinates=717%2C0%2C718%2C0","video":null,"publish_date":"2026-01-11 16:01:09","author":"David McAfee","authors":["David McAfee"],"language":"en","category":"politics","source_country":"US","sentiment":-0.382},{"id":392291088,"title":"Lindsey Graham issues most explicit threat yet: 'I'd be looking for a new place to live'","text":"Sen. Lindsey Graham (R-SC), among the most hawkish members of Congress, issued an ominous threat Sunday to Cuba in a manner strikingly similar to threats made to Venezuela just weeks before the U.S. attack and takeover of the South American nation.\n\nPresident Donald Trump issued his own ominous threat to Cuba Sunday morning in a social media post, demanding that the Caribbean nation “make a deal” favorable to the United States – and soon – before it’s “too late.” Graham excitedly shared Trump’s post just moments later, while also issuing his own warning to Cuba.\n\n“My advice to the commies running Cuba and oppressing its people: Call [Venezuelan President Nicholas] Maduro and ask him what to do…If you can get through, that is,” Graham wrote Sunday in a social media post on X. “If I were you, I’d be looking for a new place to live.”\n\nGraham’s warning is strikingly similar to the warning Trump issued Maduro before U.S. forces kidnapped and extradited him to New York to stand trial on drug-trafficking and weapons charges, where he urged Maduro to flee the country in late November, about one month before the U.S. attack. \n\nIn mid-December, Trump also declared Maduro’s “days are numbered,” a foreshadowing of the unprecedented attack that took place about two weeks later. Graham himself also issued similar threats to Venezuela's leadership in the weeks leading up to the attack. In late December, Graham openly called for regime change in Venezuela, professing his support of “standing up to Maduro” and saying he wanted “him to go.”\n\nThe U.S. government has sought to topple Cuba’s government since the 1959 overthrow of U.S.-backed dictator Fulgencio Batista, who opened the floodgates for American companies to exploit the nation’s labor and resources.\n\nA number of Republicans have cheered at the prospect of finally toppling the Cuban government, including Rep. Carlos Giménez (R-FL), who shared an image on social media Thursday depicting Cuba plastered with the logos of American companies like McDonald’s, Exxon Mobil and Walmart. \n\nGiménez was born in Cuba, and his parents, who were wealthy landowners, fled the nation after the 1959 Cuban revolution, which saw the systematic seizure of lands and properties held by the country’s elites, foreigners and Batista officials and supporters, though with compensation for seized property in the form of bonds.\n\nGraham has been among the most hawkish lawmakers in Congress, having regularly advocated for U.S. military intervention abroad. Specifically, Graham has publicly voiced support for military action against Iran, North Korea, Venezuela, Iraq, Syria, Libya and Mexico, and many on repeated occasions.","summary":"Sen. Lindsey Graham (R-SC), among the most hawkish members of Congress, issued an ominous threat Sunday to Cuba in a manner strikingly similar to threats made to Venezuela just weeks before the U.S. attack and takeover of the South American nation.\n\nPresident Donald Trump issued his own ominous threat to Cuba Sunday morning in a social media post, demanding that the Caribbean nation “make a deal” favorable to the United States – and soon – before it’s “too late.” Graham excitedly shared Trump’s post just moments later, while also issuing his own warning to Cuba.\n\n“My advice to the commies running Cuba and oppressing its people: Call [Venezuelan President Nicholas] Maduro and ask him what to do…If you can get through, that is,” Graham wrote Sunday in a social media post on X. “If I were you, I’d be looking for a new place to live.”\n\nGraham’s warning is strikingly similar to the warning Trump issued Maduro before U.S. forces kidnapped and extradited him to New York to stand trial on drug-trafficking and weapons","url":"https://www.rawstory.com/cuba-2674873009/","image":"https://www.rawstory.com/media-library/image.jpg?id=55173948&width=1200&height=1200&coordinates=166%2C0%2C167%2C0","video":null,"publish_date":"2026-01-11 15:44:30","author":"Alexander Willis","authors":["Alexander Willis"],"language":"en","source_country":"US","sentiment":0.071},{"id":392294304,"title":"Trump targets Cuba in Truth Social posts and jokes about who its next president could be","text":"President Donald Trump has issued a strong warning to Cuba, declaring the island nation would receive “zero” oil or money from Venezuela – after joking that U.S. Secretary of State Marco Rubio would be its next president. \n\n“THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA – ZERO!” Trump wrote on his Truth Social platform early Sunday morning. “I strongly suggest they make a deal, BEFORE IT IS TOO LATE,” Trump added. \n\nTrump’s plan for Venezuela’s massive oil reserve has started to become clearer in recent days. While the South American country has been Cuba’s largest oil supplier, after the U.S. capture of Venezuelan leader Nicolas Maduro, Trump convinced the country’s interim leader, Delcy Rodriguez, to send between 30 and 50 million barrels of sanctioned oil to the U.S. \n\n“Cuba lived, for many years, on large amounts of OIL and MONEY from Venezuela,” Trump wrote. “In return, Cuba provided ‘Security Services’ for the last two Venezuelan dictators, BUT NOT ANYMORE!” \n\nTrump’s stern warning on social media came after the president shared a screenshot of another person’s lighthearted post reading, “Marco Rubio will be president of Cuba.” To which Trump added, “Sounds good to me!” \n\nThe Secretary of State’s popularity – and odds of becoming the next president – have soared since U.S. forces captured the Venezuelan leader. \n\nThe chances of Rubio becoming the next president went from just 4 percent last month to 9 percent last Monday, according to Polymarket.\n\nRubio, however, still lags dramatically behind Vice President JD Vance in the race to be Trump’s successor on the Republican ticket, with Vance ahead of him with 30 percent chances. \n\nAll eyes have been on Cuba in the days since U.S. forces extradited the Venezuelan leader, as the two countries are close allies and trading partners. \n\nSince the capture of Maduro last weekend, Republican leaders have signaled that Cuba’s communist regime may soon fall. While U.S. intelligence has suggested Cuba’s political and economic situation is dire, its assessment has shown no clear support for Trump’s prediction that the island is “ready to fall,” Reuters reported, citing three people familiar with the confidential assessments. \n\nA day after the U.S. captured Maduro, Rubio issued a warning to Cuba, telling NBC News’ “Meet the Press” that he thinks the country is “in a lot of trouble.” \n\n“I’m not going to talk to you about what our future steps are going to be and our polices are going to be right now in this regard,” Rubio said. “But I don’ think it’s any mystery that we are not big fans of the Cuban regime, who, by the way, are the ones that were propping up Maduro.” \n\nMeanwhile, the loss of Venezuelan oil has been devastating for Cuba. \n\nBetween January and November last year, Venezuela sent an average of 27,000 barrels a day to the island, accounting for about 50 percent of the country’s oil deficit, according to data from the Venezuelan oil company PDVSA.","summary":"Trump issued a stern warning to Cuba after joking that Secretary of State Marco Rubio would become the island’s next leader","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-cuba-truth-social-marco-rubio-b2898350.html","image":"https://static.independent.co.uk/2026/01/09/22/47/GettyImages-2255451656.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/osDTbWge-4VHSaSK0.mp4","publish_date":"2026-01-11 15:42:07","author":"Isabel Keane","authors":["Isabel Keane"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.058},{"id":392295340,"title":"Trump tells Cuba to ‘make a deal, before it is too late’","text":"Donald Trump has urged Cuba to “make a deal” or face consequences, warning that the flow of Venezuelan oil and money would now stop.\n\nThe United States (US) president has been turning his attention to Cuba since US forces seized Venezuela’s leader Nicolás Maduro in a 3 January raid on its capital.\n\nVenezuela, a long-standing ally of Cuba, is believed to send around 35 000 barrels of oil a day to the island, but Trump has said this will end.\n\n“Cuba lived, for many years, on large amounts of OIL and MONEY from Venezuela. In return, Cuba provided ‘Security Services’ for the last two Venezuelan dictators, BUT NOT ANYMORE!” he posted on Truth Social on Sunday.\n\n“THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA – ZERO! I strongly suggest they make a deal, BEFORE IT IS TOO LATE.”\n\nTrump did not specify the terms of a deal or the consequences Cuba could face.\n\nHe also referenced the raid to seize Maduro and his wife, Cilia Flores, who are facing drug trafficking and other charges in a US court.\n\nCuba has for years supplied Maduro with his personal security detail. The Cuban government said 32 of its nationals were killed during the US operation in the Venezuelan capital, Caracas.\n\nTrump said: “Most of those Cubans are DEAD from last week’s USA attack, and Venezuela doesn’t need protection anymore from the thugs and extortionists who held them hostage for so many years.”\n\n“Venezuela now has the United States of America, the most powerful military in the World (by far!), to protect them, and protect them we will.”\n\nThe Cuban government is yet to respond to Trump’s latest threats, but president Miguel Díaz-Canel previously said the 32 “brave Cuban combatants” who died in Venezuela would be honoured for “taking on the terrorists in imperial uniforms”.\n\nWhile the Trump administration has not stated clear plans for Cuba, the US president has previously said that a military intervention was unnecessary because the country was “ready to fall”.\n\nUS secretary of state Marco Rubio indicated last week that Cuba’s leaders should be worried, saying that he would be “concerned” if he was in the Cuban government and that “they’re in a lot of trouble”.\n\nOn Sunday, Trump also re-posted on social media a message suggesting that Rubio – a Cuban-American former Florida senator and the son of Cuban exiles – could become president of Cuba.\n\nTrump shared that post with the comment: “Sounds good to me!”\n\nThe Trump administration’s tactic of confiscating sanctioned Venezuelan oil tankers has already begun to worsen a fuel and electricity crisis in Cuba. – BBC\n\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch.\nIt’s an essential way to stay informed. Subscribe and join our newsletter community.","summary":"Donald Trump has urged Cuba to &#8220;make a deal&#8221; or face consequences, warning that the flow of Venezuelan oil and money would now stop. The United States (US) president has been turning his attention to Cuba since US forces seized Venezuela&#8217;s leader Nicolás Maduro in a 3 January raid on its capital. Venezuela, a long-standing [&#8230;]\n\n\nThe post Trump tells Cuba to &#8216;make a deal, before it is too late&#8217; appeared first on The Namibian.","url":"https://www.namibian.com.na/trump-tells-cuba-to-make-a-deal-before-it-is-too-late/","image":"https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/01/WhatsApp-Image-2026-01-11-at-17.09.44-1024x576.jpeg","video":null,"publish_date":"2026-01-11 15:39:10","author":"George Wright","authors":["George Wright"],"language":"en","category":"politics","source_country":"na","sentiment":0.203},{"id":392292372,"title":"Turkey seeks to join Saudi-Pakistani defense pact in move that could reshape Middle East","text":"Bloomberg reported over the weekend, citing sources, that Turkey is seeking to join a defense alliance recently signed between Saudi Arabia and Pakistan, a nuclear-armed state. The move could pave the way for a new security alignment that may shift the balance of power in the Middle East and beyond. The defense pact between Saudi Arabia and Pakistan, both Muslim countries, was signed in September and stipulates that any attack on one of the two states will be considered an attack on both. The clause is similar to Article 5 of the NATO charter, the Western military alliance of European states, Canada and the United States. Turkey itself is a NATO member, and its military is the alliance’s second largest, after that of the United States. Sources who spoke with Bloomberg said talks on Turkey’s inclusion in the Saudi-Pakistani defense pact are at an advanced stage and that an agreement is highly likely to be signed eventually. The sources said expanding the alliance to include Ankara makes strategic sense for all three countries, as Turkey’s interests are increasingly aligned with those of Saudi Arabia and Pakistan in South Asia, the Middle East and Africa. According to the report, Turkey also views the pact as a way to strengthen its security and deterrence capabilities amid growing questions over how much it can rely on the United States and on President Donald Trump’s commitment to NATO. Nihat Ali Özcan of the Ankara-based TEPAV think tank told Bloomberg that Saudi Arabia would bring economic power to a trilateral alliance, Pakistan would contribute nuclear capabilities, ballistic missiles and manpower, and Turkey would provide military experience and a highly developed defense industry. “As the United States prioritizes its own interests and those of Israel in the region, shifting dynamics and the consequences of regional conflicts are pushing countries to develop new mechanisms for identifying friends and enemies,” Özcan said. Saudi Arabia and Turkey were rivals for years for leadership in the Sunni Muslim world and relations between them were marked by deep mistrust. In recent years, however, ties have improved and the two countries have expanded economic and security cooperation. Both are also concerned by Shiite Iran’s regional influence and support Syria’s new Sunni-led government. Turkey and Pakistan have maintained close military ties for years. Ankara is building warships for Pakistan’s navy and has upgraded dozens of Pakistan’s F-16 fighter jets. Turkey also shares drone technology with both countries.","summary":"Report says Ankara is in advanced talks to join a Saudi-Pakistani mutual defense pact, a move that could create a new regional security bloc as doubts grow over US commitments and NATO’s future","url":"https://www.ynetnews.com/article/sjfltebrzg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2022/06/22/rymZf3e5q/rymZf3e5q_1_145_3000_1688_0_large.jpg","video":null,"publish_date":"2026-01-11 15:35:05","author":"Ynet","authors":["Ynet"],"language":"en","category":"politics","source_country":"il","sentiment":0.439},{"id":392291080,"title":"This man nailed Trump — then elite conspirators helped him wriggle free","text":"Tuesday was the five-year anniversary of the J6 insurrection. On Jan. 6, 2021, the then-president organized and led an attempted paramilitary takeover of the US government.\n\nAnd Donald Trump got away with it.\n\nHe ran for president for a second time like a man who was trying to outrun a jail sentence. That’s because he was.\n\nSpecial counsel Jack Smith, who investigated the events of that treasonous day, told lawmakers last month he could prove Trump’s guilt. \n\n“Our investigation developed proof beyond a reasonable doubt that President Trump engaged in a criminal scheme to overturn the results of the 2020 election and to prevent the lawful transfer of power,” Smith said.\n\nTrump stalled and obstructed and dragged his feet, abusing every judicial courtesy afforded to powerful men and every procedural loophole, all while campaigning as if his life depended on it. He turned himself into the “hero” in a grandiose narrative about the battle between good and evil (QAnon), and when justice came knocking, he made it seem like evidence of the conspiracy against him — and America.\n\nOnce safely back in power, Trump stopped all the criminal investigations. With damning proof in hand, Smith was forced to stand down. Trump claimed the authority of judge and jury. He saw no law that could stop him from doing what he wants, to whomever he wants, because his word is law.\n\nBut Trump couldn’t have gotten away with treason by himself. First, there were the Republicans who saved him from being held accountable by the same Congress that he attacked. Then there were the oligarchs who paid for a massive rightwing media complex that defended an unapologetic traitor and encouraged conspiratorial thinking among followers. Then there were the mainstream corporate leaders on Wall Street and beyond, who quickly understood that he really could get away with it, like all the other elites over the last 20 years who’d gotten away with their crimes.\n\nEvery single Trump ally already believed they were above the law, morality and tradition. That belief was validated by GOP justices on the Supreme Court, who manufactured legal immunity, and by Trump’s victory. Society is now at a point where one of the world’s biggest communications platforms, owned by one of the world’s richest men, can produce literal child pornography — and the elites of the world just shrug.\n\nWhat began on Jan. 6, 2021, was continued the day Trump was sworn back into office. From there was a renewed push to unwind the political settlements of the previous century. The explicit goal was to loot the safety net; create a secret police force; suppress freedoms of speech, religion and movement; immiserate the property-owning middle classes; and reshape society so that rich white men like Trump could once again rule with impunity.\n\nThe never-ending insurrection applied to foreign affairs as well. Trump has sabotaged the lawful, international order that the US established after the atrocities of World War II. Bribery of the American president is now factored into the cost of global trade, a pattern of corruption that will no doubt deepen as heads of state realize that, in the wake of the kidnapping of Venezuela’s Nicolas Maduro, Donald Trump will take what he wants if it is not given to him.\n\nThe institutions of democracy — in this, I include the courts, the media and universities as well as the American people — now face a never-ending insurrection, because they failed to hold a traitor, and the corrupt elites before him, accountable for their crimes. And as long as we keep failing, we can keep expecting more of the same. \n\nAs Trump said after the attack on Venezuela, “We can do it again, too. Nobody can stop us.\"\n\nAll that said, the truth about the J6 insurrection isn't going away, no matter how contested it is currently. Do you see a time in the future when justice will prevail? Or do you think injustice baked into the cake of the American republic?\n\nThese are some of the questions I asked Adam Cohen, a lawyer and activist with a large online following who commented thoroughly on Jack Smith’s deposition. (It was released on New Year’s Eve by Republicans on the House Judiciary Committee for absolute minimum exposure to it.)\n\nAdam chose to be optimistic.\n\n“Some people scoff at the concepts of American ingenuity and exceptionalism, but I think we're going to need some realistic, feasible ideas to fix our country,” Adam told me.\n\n“I think we can, but it's going to take time, perhaps generations. I mean, we've been trying to get this right for 250 years. We just have to keep pressing forward, calling out the inequalities inherent in our system and look for ways to fix them. We've done it before. We can do it again.”\n\nJS: Today is the anniversary of the J6 insurrection. Trump is president again. Jack Smith said last month that there is proof beyond doubt that he's responsible for the attempted takeover of the US government. Did he get away with it?\n\nAC: The January 6 select committee extensively showed the depths that Trump went through to illegally steal the 2020 election — the lies, the extortion of election officials, the attempts to find 11,780 nonexistent votes, the fake electors, and the insurrection itself, which included incitement, threats against his own vice president, refusal — for hours — to do anything to stop it, and telling his supporters who had just bludgeoned 140 police officers that he loved them.\n\nHe was never prosecuted, and now he's president.\n\nUnfortunately, the answer to your question is self-evident.\n\nSmith said the attack could not have happened without Trump. It looks like those who said he was campaigning to stay out of jail were right. Even Joe Biden said that. What does that say about the system? What can reformers do?\n\nI believe Smith's testimony showed that Trump announced he was running shortly after it was announced there was going to be a criminal investigation into the classified documents scandal and, potentially, January 6.\n\nDuring his candidacy, Trump repeatedly attacked the investigation as an attempt to silence him. He then argued for — and received — immunity from a Supreme Court featuring three of nine justices chosen by him. Even the most cynical of us were shocked by that opinion. The whole affair exposed significant cracks in the system. We need to look at serious SCOTUS reform, then go on from there.\n\nWhat was the most damning thing in Smith's deposition? What was the key detail that made you think this is the reason the Republicans released it on New Year's Eve.\n\nEven though we've seen so much coverage of January 6, time has a frustrating way of dulling memory, doesn't it? So it was profoundly infuriating to be reminded that almost all of Trump’s co-conspirators were Republican officials. And they were willing to testify against him. You have to think he didn't want the world, and especially MAGA, to see how thoroughly they were duped, used and summarily discarded.\n\nThis president claims the right to kidnap leaders of foreign countries in order to try them in US courts. He also claims total immunity from US courts. Forget about whether he's above the law. He is. The question is whether and for how long Americans will tolerate a depraved president.\n\nOh boy, you're asking the wrong person. I was out in 2015 when he came down the escalator and called Mexicans criminals — and the campaign rhetoric devolved from there.\n\nThen, four years after January 6th, he gets reelected?\n\nIt really shakes your faith in our politics.\n\nThe truth about J6 isn't going away, no matter how contested it is. Do you see a future in which justice will be done to future evil men, if not this president, who is 79? Or is injustice baked into the cake of the American republic?\n\nThe optimist in me says we will reform our government to stop this from happening in the future. The pessimist sees the Supreme Court greatly expanding executive power, which will be difficult if not impossible to overcome.\n\nSome people scoff at the concepts of American ingenuity and exceptionalism, but I think we're going to need some realistic, feasible ideas to fix our country.\n\nI think we can, but it's going to take time, perhaps generations. I mean, we've been trying to get this right for 250 years. We just have to keep pressing forward, calling out the inequalities inherent in our system and look for ways to fix them. We've done it before. We can do it again.","summary":"Tuesday was the five-year anniversary of the J6 insurrection. On Jan. 6, 2021, the then-president organized and led an attempted paramilitary takeover of the US government.\n\nAnd Donald Trump got away with it.\n\nHe ran for president for a second time like a man who was trying to outrun a jail sentence. That’s because he was.\n\nSpecial counsel Jack Smith, who investigated the events of that treasonous day, told lawmakers last month he could prove Trump’s guilt. \n\n“Our investigation developed proof beyond a reasonable doubt that President Trump engaged in a criminal scheme to overturn the results of the 2020 election and to prevent the lawful transfer of power,” Smith said.\n\nTrump stalled and obstructed and dragged his feet, abusing every judicial courtesy afforded to powerful men and every procedural loophole, all while campaigning as if his life depended on it. He turned himself into the “hero” in a grandiose narrative about the battle between good and evil (QAnon), and when justice came knocking, he made it see","url":"https://www.rawstory.com/raw-investigates/trump-january-6-2674856471/","image":"https://www.rawstory.com/media-library/donald-trump.jpg?id=62672795&width=1200&height=1200&coordinates=835%2C0%2C836%2C0","video":null,"publish_date":"2026-01-11 15:30:31","author":"John Stoehr","authors":["John Stoehr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.247},{"id":392287748,"title":"US could become the enemy of a post-Nato Europe","text":"Colombia is right next door to Venezuela, and the United States fleet is already just offshore, so how about taking down President Gustavo Petro? \"He’s a sick man who likes making cocaine and sending it to the United States, and he’s not going to be doing it very long,\" according to The Donald (who is lying about Petro.)\n\nInstant triumphs tend to be smaller and less rewarding (arresting Russian-registered tankers in mid-ocean, for example). There is only one whole country on his list that Trump could conquer in one week from a standing start: Greenland. Which may be why Steve Miller, White House Deputy Chief of Staff, moved it to the top of the hit-list.\n\nAs a former colony that is still a self-governing part of the Danish kingdom, Greenland is not yet a completely sovereign state. But it can hold a referendum on full independence whenever its 57,000 people want, so it sort of qualifies as a country. Only a trophy country, but you would still get points for conquering it.\n\nIf I were completely ignorant of military matters, I would now copy and paste several paragraphs of White House hogwash explaining how strategically important Greenland is. I would say that the Russians and the Chinese are casting lascivious eyes on the Arctic because there are valuable minerals there, and the sea lanes are opening up because the glaciers are melting.\n\nIndeed, last Monday Trump insisted that Greenland is \"so strategic right now, it’s covered with Russian and Chinese ships all over the place. We need Greenland from the standpoint of national security\".\n\nNo, they do not. Greenland is a region of zero strategic importance. I spent some time on Greenland’s west coast recently (Ilulissat), and Russian and Chinese ships were conspicuous by their total absence.\n\nGreenland was briefly important strategically 60 to 70 years ago, when interceptors and radar stations based there might shoot down nuclear-armed Soviet bombers on their way to North America. Then the technology shifted to ballistic missiles that fly through space, and the number of troops on American airbases in Greenland dropped from 10,000 to 200.\n\nIf Washington wants to base more troops there now, it has only to ask: the treaty says it can have an unlimited number of bases and troops in Greenland. Similarly, if it wants some minerals, just negotiate a contract, start digging (and pay for them).\n\nAs for the \"sea lanes\" across the Arctic, Russia’s northern sea route connecting the Pacific to the Atlantic is getting busier. The Northwest Passage around Greenland and northern Canada, however, will get little traffic until the ice is almost all gone (20-plus years from now), because all the remaining ice tends to get trapped among Canada’s Arctic islands.\n\nOn the other hand, if you just need \"threats\" as cover for your imperial ambitions, there are plenty of experts who can find them for you at a modest price. Trump relentlessly broadcasts their \"findings\".\n\nGiven the servile posture (or just sheer laziness) of most American media, if Trump invades Greenland, he would probably get away with it at home. However, he would not get away with it abroad.\n\nThe Russians and the Chinese would be happy to see the US invade Greenland, but for America to seize the territory of a country that has been a loyal member of the North Atlantic Treaty Organisation (Nato) for 77 years is a very bad look.\n\n\"Nobody's going to fight the United States militarily over the future of Greenland\", Steve Miller said confidently, and that’s true. American air and naval power would quickly overwhelm any attempted Danish defence of Greenland, and there is no point in getting people killed for nothing.\n\nHowever, the political and strategic impact would be immense.\n\n\"If the United States decides to militarily attack another Nato country\", warned Danish Prime Minister Mette Frederiksen, \"then everything would stop. That includes Nato and therefore post-World War 2 security.\"\n\nA post-Nato alliance including every country except the United States would probably reform, but the enemy would be different. That might even be enough to shock American voters into starting the fightback in the mid-term elections in November. Or am I just clutching at straws?\n\n— Gwynne Dyer is an independent London journalist.","summary":"How important is Greenland strategically, really? PHOTO: REUTERS  \n\n  \n\nThe Crazy Gang are high on the \"brilliant success\" of their Venezuela caper and looking for new targets. Like Alexander the Great, Donald Trump weeps because there are no more worlds to conquer. But wait! Actually, there are still lots of places to conquer.","url":"https://www.odt.co.nz/opinion/us-could-become-enemy-post-nato-europe","image":"https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2026/01/222051012-greenland-iceberg.jpg?itok=AUdLO6Wq","video":null,"publish_date":"2026-01-11 15:30:00","author":null,"language":"en","source_country":"nz","sentiment":-0.239},{"id":392287744,"title":"Cartoonist’s view — Yeo","text":"After every large privacy breach in this country, commentators say it must be a wake-up call.\n\n Today's cartoon from Shaun Yeo.\n\n The Crazy Gang are high on the \"brilliant success\" of their Venezuela caper and looking for new targets. Like Alexander the Great, Donald Trump weeps because there are no more worlds to conquer....\n\n Famously, football in the United Kingdom is as much a religion as it is a sport.\n\n The Exhibition Jamboree which was officially opened at Tahuna Park yesterday morning is a big event not only in the history of the Scout Movement in these lands, but — so there is good reason to...\n\n Some pretty nasty things have been said about Invercargill over the years, mostly by those who have never been there or who considered a fleeting visit gave them authority to comment.\n\n Today's cartoon from Shaun Yeo.\n\n Hunting for treasure in the time-honoured way is usually a futile business, right from the time the get-rich-quick adventurer charters his yacht and sets sail for the islands of the blest until he...\n\n 2026 is the Year of the Horse, and the trick for many of us will be to learn to ride it or risk it riding you good and proper.\n\n Standing beside State Highway 8 at the bottom of the Fruitlands straight, the Cap Broome Hotel is perhaps the most photographed building in Central Otago.\n\n If, as the adage has it, a camel is a horse designed by a committee, what are we to make of the Cabinet’s latest creation, MCERT?\n\n Today's cartoon from Shaun Yeo.\n\n Trump wants Greenland. Europe’s tepid response is putting Nato and global security at risk, Shannon Brincat and Juan Zahir Naranjo Caceres write.\n\n When legal standards diverge from social standards, confusion follows, Associate Prof Anna High writes.\n\n More than half of new articles on the internet are being written by AI, Francesco Agnellini explains.\n\n The Axemen’s Carnival again drew a large crowd last evening when some keen contests were witnessed.\n\n In today's Letters to the Editor, a reader advocates for the return of a cable car instead of another cycleway. And a Christian viewpoint on Christmas is appreciated.\n\n The world will be watching to see how effective the United Kingdom’s new restrictions on advertising junk food to children will be.\n\n Today's cartoon from Shaun Yeo.\n\n For six decades I believed that the word stereo meant two.","summary":"Today's cartoon from Shaun Yeo.","url":"https://www.odt.co.nz/opinion/cartoonist%25E2%2580%2599s-view-%25E2%2580%2594-yeo-543","image":"https://www.odt.co.nz/sites/default/files/styles/odt_square_2col/public/story/2026/01/axepersons_1926.jpg?itok=s1_trngu","video":null,"publish_date":"2026-01-11 15:30:00","author":null,"language":"en","source_country":"nz","sentiment":0.199},{"id":392286604,"title":"Trump Gets New Portrait At Smithsonian, Impeachment Text Removed: Report","text":"The Smithsonian Institution’s National Portrait Gallery has unveiled a new photographic portrait of US President Donald Trump, while removing most of the text that referenced his two impeachments and the January 6, 2021, Capitol attack, according to a report by The Washington Post.\nThe White House shared an image of the updated “America’s Presidents” exhibit on its social media accounts, and Trump also promoted the portrait on Truth Social.\nThe photograph, taken by White House photographer Daniel Torok, shows Trump in black and white at the Resolute Desk, fists resting on the surface, looking directly at the camera.\n\nNEW at the National Portrait Gallery in Washington, D.C.:\nPresident Donald J. Trump. pic.twitter.com/UbHweGydaX\n— The White House (@WhiteHouse) January 10, 2026\n\n“For the first time in history, the Smithsonian National Portrait Gallery has hung up an iconic photo taken by the White House honoring President Trump,” White House spokesperson Davis Ingle said in a statement, The Hill reported.\n“His unmatched aura will be seen and felt throughout the halls of the National Portrait Gallery.” Ingle noted.\nTrump’s new portrait replaced one of former President Joe Biden, which visitors previously saw first when entering the exhibit. Guests moving through the gallery in chronological order will see the portraits of all presidents, with Trump now displayed in a prominent position.\nThe previous Trump portrait, showing him with hands folded, had two small wooden plaques with the numbers “45” and “47,” reflecting his two nonconsecutive terms—the first president to do so since Grover Cleveland.\nThe earlier display also included text noting his impeachments and the Capitol attack, but the new placard only lists his years in office. Other presidential portraits continue to include descriptive text, such as former President Bill Clinton’s mention of his impeachment.\nConcetta Duncan, a National Portrait Gallery spokeswoman, told The Washington Post the museum is moving towards “tombstone labels,” which provide only essential information about each portrait.\nIt is unclear if the recent changes were directed by the administration, though modifications were expected after Trump returned to the White House.","summary":"Guests moving through the gallery in chronological order will see the portraits of all presidents, with Trump now displayed in a prominent position.","url":"https://www.news18.com/world/trump-gets-new-portrait-at-smithsonian-impeachment-text-removed-report-ws-l-9823863.html","image":"https://images.news18.com/ibnlive/uploads/2026/01/trump-2026-01-565562c8da7da52a19120c927eeb155c.jpg","video":null,"publish_date":"2026-01-11 15:23:15","author":"News18,Yimkumla Longkumer","authors":["News18","Yimkumla Longkumer"],"language":"en","category":"politics","source_country":"in","sentiment":0.087},{"id":392286776,"title":"Iran's President Blames 'Rioters' As Protest Toll Reaches 203; Israel Supports 'Freedom Struggle'","text":"Amid widespread protests across Iran, President Masoud Pezeshkian made his first televised remarks on the chaos, where he said that officials are willing to listen to protesters, but rioters are trying to “destroy the entire society.”\n“The people (of Iran) should not allow rioters to disrupt society. The people should believe that we (the government) want to establish justice,” he told state broadcaster IRIB. “If someone who belongs to this country protests, we hear those protests, we listen, and we address them.”\nThe Iranian President also accused of Israel and the United States of attempting to destabilising the country. “The US and Israel are sitting there, giving instructions to these people, telling them: go ahead, we are backing you. The same ones who struck this country and killed our young people and our children are now giving them orders, telling them: you do this work, we are with you,” he added.\nPezeshkian also asserted that Iran will not allow any foreigners to sow seeds of discord among the nation, and no fellow citizen should create chaos inside the country. Targeting US President Donald Trump, Pezeshkian said he should be ashamed of what he is doing in Venezuela, Gaza and elsewhere.\n“Families, I ask you: do not allow your young children to join rioters and terrorists who behead people and kill others,” Pezeshkian appealed to protesting Iranians.\nDeath Toll Reaches 203\nActivists said at least 203 people have been killed as the protests, which began over economic grievances, turned into a direct challenge to Iran’s clerical leadership. Demonstrations have continued for several nights across multiple cities, drawing growing international attention and concern.\nThe US-based Human Rights Activists News Agency, which relies on activists in Iran cross-checking information, offered the new death toll of 203 on Sunday, a large jump. Of those killed, 162 are protesters and 41 are members of the security forces, it said.\nSeveral protesters hit the streets in large numbers despite the internet blackout. The US-based Centre for Human Rights in Iran (CHRI) said it had received “eyewitness accounts and credible reports indicating that hundreds of protesters have been killed across Iran during the current internet shutdown”.\nIran’s security chief Ali Larijani drew a line between protests over economic hardship, which he called “completely understandable”, and “riots”, accusing them of actions “very similar to the methods of terrorist groups”, according to the Tasnim news agency.\nIsrael Supports ‘Struggle For Freedom’\nMoreover, Israeli Foreign Minister Gideon Saar said Israel supports the Iranian people in what he described as their “struggle for freedom” and wished them success. “We think they deserve freedom… We don’t have any hostility with the people of Iran,” he added.\nIran’s parliament speaker warned the US military and Israel would be “legitimate targets” if America strikes the Islamic Republic, amid repeated threats by US President Trump. Mohammad Bagher Ghalibaf directly threatened Israel, “the occupied territory” as he referred to it, and the US military, possibly with a preemptive strike.\nKhameini Hits Back At Trump’s Warning\nIran’s Supreme Leader Ayatollah Ali Khamenei on Sunday took a sharp swipe at Trump, telling him to “manage his own country” after the American leader said the United States was “ready to help” amid escalating anti-government protests.\n“The President of the United States declared that if the Iranian government did this or that, he would side with the rioters. The rioters have placed their hopes in him. If he is so competent, let him manage his own country then,” Khamenei wrote.\nTrump has spoken out strongly in favour of the protesters and warned Iranian authorities against using deadly force. He has even threatened military action “if they start killing people”, a statement that further raised tensions between Washington and Tehran.\n(with inputs from agencies)","summary":"Iran's President Masoud Pezeshkian said officials were willing to talk with protesters, and accused the US and Israel of supporting \"rioters\" and stoking tensions.","url":"https://www.news18.com/world/iran-president-blames-rioters-protests-death-toll-rises-israel-us-donald-trump-khameini-latest-updates-ws-kl-9823731.html","image":"https://images.news18.com/ibnlive/uploads/2026/01/iran-president-2026-01-b767abeae2ae90d994f089165b3127bc.jpg","video":null,"publish_date":"2026-01-11 15:18:24","author":"Aveek Banerjee,News18","authors":["Aveek Banerjee","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.381},{"id":392286830,"title":"No more oil or money going to Cuba, says US President Trump","text":"Washington, DC [US], January 11 (ANI): US President Donald Trump on Sunday claimed that Cuba had lived for many years on Venezuelan oil and money but said that this would now stop after the United States launched a strike in Venezuela and captured its President, Nicolas Maduro and his wife, Cilia Flores.In a post on Truth Social, Trump wrote, “Cuba lived, for many years, on large amounts of OIL and MONEY from Venezuela. In return, Cuba provided “Security Services” for the last two Venezuelan dictators, BUT NOT ANYMORE! Most of those Cubans are DEAD from last weeks U.S.A. attack, and Venezuela doesn’t need protection anymore from the thugs and extortionists who held them hostage for so many years. Venezuela now has the United States of America, the most powerful military in the World (by far!), to protect them, and protect them we will. THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA – ZERO! I strongly suggest they make a deal, BEFORE IT IS TOO LATE. Thank you for your attention to this matter. President DJT.”Following Maduro’s capture, Venezuela’s Vice President Delcy Rodriguez officially assumed charge as the country’s acting president, according to CNN.Trump earlier said that the United States would now “run Venezuela” and seek full access to the country’s oil resources from the newly appointed acting president.Earlier on Friday (local time), Trump met top oil and gas executives at the White House and said major investments would be made in Venezuela’s energy sector.Addressing reporters, Trump said, “We just had a great meeting with the oil executives, we sort of formed a deal.”He added, “They’re going to be going in with hundreds of billions of dollars in drilling oil, and it’s good for Venezuela, and it’s great for the United States,” Fox News quoted Trump as saying.Trump further said, “A lot of money is going to be made. Oil prices will come down, although they are getting down pretty good now without it, and it was a great meeting we had today with the biggest companies anywhere in the world.”The US President also assured oil executives of safety and security in Venezuela. He said the United States had built Venezuela’s oil industry earlier and would now do “everything” regarding assets that were stolen.Trump said he was pleased to welcome some of the biggest oil and gas companies to the White House and added that the departure of Nicolas Maduro made it possible for a strong future for both countries.Earlier this week, Trump said Venezuela would turn over 30 million to 50 million barrels of oil to the United States, which would be sold at market value, with the proceeds controlled by the US.Meanwhile, Cuba last week announced that 32 of its citizens were killed during the United States military operation in Venezuela.The Cuban government also observed two days of national mourning on January 5 and January 6 to honour those killed in the operation. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/no-more-oil-or-money-going-to-cuba-says-us-president-trump-9823890.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2026-01-11 15:15:03","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.105},{"id":392291114,"title":"Rage consumes US as hundreds of ICE protests take over cities — with more planned Sunday","text":"With more such events set for Sunday, hundreds of demonstrations took place in cities large and small across the United States on Saturday to denounce the killing of Renee Nicole Good by a federal immigration enforcement officer last week in Minneapolis.\n\nThe wave of “ICE Out for Good” protests arrives as a consolidated expression of outrage directed at President Donald Trump for his authoritarian tactics, cruel policies, and a lawlessness seemingly without end. Just a day after Good was killed in Minnesota, two other people were shot and wounded by federal agents in Portland, Oregon.\n\n“Renee Nicole Good and the Portland victims are just the most recent victims of ICE’s reign of terror,” said the 50501 movement, one of the groups behind the weekend protests, said in a statement. “ICE has brutalized communities for decades, but its violence under the Trump regime has accelerated.”\n\nThe killing of Good by Jonathan Ross, a 10-year veteran of the Immigration and Custom Enforcement (ICE) agency, came just days after Trump’s unlawful military attack on Venezuela which culminated in the arrest of President Nicolas Maduro and his wife, Cilia Flores. Many who protested Saturday noted that the two events are deeply related as they epitomize the increasingly violent nature of the president’s second term.\n\nAlso notable is how the act of war against Venezuela and the killing of Good bookended the fifth anniversary of the Trump-backed insurrection that took place on January 6, 2021. While many marked that occasion with solemn remembrances, the Trump administration released a fabricated version of the day that was denounced as Orwellian and gaslighting of the highest form.\n\nAs Mother Jones’ David Corn wrote on Thursday: “The military assault on Venezuela, the shooting of a Minneapolis woman by an ICE agent, the launch of the White House’s new revisionist website about January 6—these three events convey a powerful and unsettling message from Donald Trump and his crew: Violence is ours to use, at home and abroad, to get what we want.”\n\nSaturday’s protests—organized by the Not Above the Law Coalition, MoveOn, the ACLU, Indivisible, and others—took place from Minneapolis to New York and from Chicago to Los Angeles. Demonstrations and rallies also took place in Portland, Oregon as well as Portland, Maine, with hundreds of events and rallies in smaller cities and communities nationwide.\n\nMore details about the events, including a growing list of Sunday’s demonstrations and rallies, is available here.\n\n“It feels like maybe we’re hitting a tipping point,” 49-year-old Ben Person, who marched in Minneapolis, told the New York Times.\n\n“We’re here to say f--k Trump, abolish ICE, arrest Jonathan Ross, impeach [Homeland Security Secretary] Kristi Noem, and bring justice to anyone who’s ever been wronged by the patriarchy and fascist communities,” another demonstrator in Minneapolis told Status Coup News.\n\n“The shootings in Minneapolis and Portland were not the beginning of ICE’s cruelty, but they need to be the end,” said Deirdre Schifeling of the ACLU. “These tragedies are simply proof of one fact: the Trump administration and its federal agents are out of control, endangering our neighborhoods, and trampling on our rights and freedom. This weekend, Americans all across the country are demanding that they stop.”\n\nAt a rally in Portland, Maine on Saturday evening, Troy Jackson, the Democratic former president of the State Senate now running for governor, said the killing of Good in Minneapolis made clear to him that such violence against regular citizens could indeed happen anywhere:\n\nFor one demonstrator in Minneapolis, the imperial and authoritarian drive of the Trump administration reminded him of the galactic villains of the Empire in the Star Wars series:\n\nThe organizers of the weekend protests said that public shows of dissent will remain key in the coming days, weeks, and months.\n\n“We will resist the government’s attacks by building community, by documenting atrocities, by protesting nonviolently, by showing kindness and solidarity at all times,” said Pablo Alvarado, co-executive director of the National Day Laborer Organizing Network, another of the organizing groups.\n\n“We will meet them in the streets, in the courts, at the day labor corners. We will meet them everywhere. And we will win. We are not afraid or discouraged. And we will not be defeated,” Alvarado added. “The more we stand together as a community of determination and love, the harder it will be for them to divide and destroy us.”","summary":"With more such events set for Sunday, hundreds of demonstrations took place in cities large and small across the United States on Saturday to denounce the killing of Renee Nicole Good by a federal immigration enforcement officer last week in Minneapolis.\n\nThe wave of “ICE Out for Good” protests arrives as a consolidated expression of outrage directed at President Donald Trump for his authoritarian tactics, cruel policies, and a lawlessness seemingly without end. Just a day after Good was killed in Minnesota, two other people were shot and wounded by federal agents in Portland, Oregon.\n\n“Renee Nicole Good and the Portland victims are just the most recent victims of ICE’s reign of terror,” said the 50501 movement, one of the groups behind the weekend protests, said in a statement. “ICE has brutalized communities for decades, but its violence under the Trump regime has accelerated.”\n\nThe killing of Good by Jonathan Ross, a 10-year veteran of the Immigration and Custom Enforcement (ICE) agency, came just days aft","url":"https://www.rawstory.com/rage-consumes-us-as-hundreds-of-ice-protests-takeover-cities-with-more-planned-sunday/","image":"https://www.rawstory.com/media-library/image.jpg?id=62710603&width=1200&height=1200&coordinates=836%2C0%2C837%2C0","video":null,"publish_date":"2026-01-11 15:12:29","author":"Common Dreams,Jon Queally","authors":["Common Dreams","Jon Queally"],"language":"en","category":"politics","source_country":"US","sentiment":0.027},{"id":392288256,"title":"ANC pledges six fixes with eye on election","text":"The ANC, whose electoral support has dwindled over the years, has declared 2026 a year of decisive action to fix local government and transform the economy, with the government of national unity (GNU) having set aside R54bn for service delivery.\n\nThis is as the country is set to hold much-anticipated municipal elections later this year, in which opposition parties expect the former liberation movement to perform poorly. \n\nDelivering the ANC’s January 8 statement to party faithful at Moruleng Stadium, North West, on Saturday, party leader President Cyril Ramaphosa said to advance the ANC government and South Africa, the organisation had identified six tasks for the year. \n\nThese included fixing local government and improving basic services; speeding up economic transformation, inclusive growth and job creation; and waging war on crime and corruption, and gender-based violence and femicide (GBVF). \n\nThe beleaguered local government sector is dogged by malfeasance and fiscal challenges in which billions of rand have been wasted on fruitless, wasteful and unauthorised expenditure annually, affecting delivery of basic services such as potable water, electricity, clinics and refuse collection. \n\n“Over the next three years, the national government will invest R54bn to repair water and electricity infrastructure in Buffalo City, Cape Town, Ekurhuleni, eThekwini, Joburg, Mangaung, Nelson Mandela Bay and Tshwane,” Ramaphosa said. \n\n“Municipalities must also increase funding for infrastructure maintenance and strengthen administrative capacity. They must build in-house capacity, especially functional yellow fleets and skilled personnel, to fix water leaks, potholes and power outages, and to deliver basic cleaning and greening services.” \n\nMunicipalities must also increase funding for infrastructure maintenance and strengthen administrative capacity. — Cyril Ramaphosa, ANC president\n\nThe president said municipal administration should be ethical and capable, with professional management “insulated from undue political interference and capture”.\n\n“We also call on municipal administrations to strengthen financial management so that scarce resources are used first and foremost to provide services and develop our towns and communities.”\n\nMeanwhile, Ramaphosa has criticised what he described as an “increasing vocal minority” in South Africa that had thrown in its lot with those propagating falsehoods against the country. \n\nSolidarity and AfriForum have openly spoken out against South Africa’s foreign policy and what they describe as the country’s race laws, while the discredited “white genocide” narrative has been parroted by US President Donald Trump. \n\n“Their aim is to undermine South Africa’s constitutional democracy, non-racialism, non-sexism and the transformation project. They employ multifaceted tactics, including the propagation of blatant falsehoods such as claims of ‘white genocide’ to attract sympathy and solidarity from global racist movements and individuals,” Ramaphosa said. \n\n“On the one hand, they form and fund political parties designed to fragment the motive forces of change. On the other hand, they sow the seeds of regime change, establish parallel state structures and foment secessionist tendencies. \n\n“Reversing the gains of democracy by any means has become an increasingly open objective of domestic antitransformation forces and their global allies.” \n\nRamaphosa noted that worldwide the values of democracy, equality, equity, inclusion, human solidarity, gender equality and social justice were under attack. \n\n“This attack seeks to delegitimise any government that aims to address inequalities, whether between nations, communities, genders, races and individuals. It seeks to undermine the existing rule-based order in the world and return human civilisation to an era of might, privilege and subjugation,” he said. \n\n“The vast majority of South Africans, and indeed of global humanity, embrace these values of freedom, equality, non-racialism, non-sexism and human solidarity.”","url":"https://www.businessday.co.za/news/2026-01-11-anc-pledges-six-fixes-with-eye-on-election/","image":"https://www.businessday.co.za/resizer/v2/JWP5NTN775CPXDSDOCNNOZD6PM.jpg?auth=5ffef94e8289ab2838ab360fd036d13e26d6a6ea6cd25cfb3340d5e99db1c25d","video":null,"publish_date":"2026-01-11 15:06:37","author":"Luyolo Mkentane","authors":["Luyolo Mkentane"],"language":"en","category":"politics","source_country":"za","sentiment":-0.15},{"id":392294342,"title":"Starmer considering sending military to Greenland as Trump ratchets up rhetoric","text":"Sir Keir Starmer is considering sending British troops to Greenland as Donald Trump’s rhetoric over snatching the Danish territory continues to ratchet up.\n\nIt comes just days after the prime minister committed to sending troops into Ukraine as the core of the coalition of the willing to guarantee the peace, with former senior military top brass questioning whether the UK has enough personnel.\n\nThe revelation comes after former Obama assistant secretary of state Frank Rose told The Independent that Mr Trump’s actions threaten to undermine US defence in the region and lead to allies turning on him.\n\nPresident Trump has insisted he wants control over Greenland and has not ruled out the prospect of using military force to seize the semi-autonomous Danish territory.\n\nTransport secretary Heidi Alexander insisted that discussions about securing the High North against Russia and China were part of Nato’s “business as usual” rather than a response to the US military threat.\n\nTory leader Kemi Badenoch lambasted the discussions, warning that there is a danger the Nato alliance could collapse and arguing that Greenland is a “second-order issue”.\n\nShe told the BBC’s Laura Kuenssberg: “Right now, what I am really concerned about is if there is going to be a Nato. We need to keep America on side.”\n\nMeanwhile, former UK ambassador to the US Lord Peter Mandelson insisted that he does not believe Mr Trump will send US troops to take control of Greenland, accusing critics of the US president of “wanting to clutch at their pearls” rather than face reality. However, the Labour peer was also critical of the prime minister, who sacked him as ambassador, for not producing the promised spending increase on defence.\n\nThe Telegraph reported that military chiefs are drawing up plans for a possible Nato mission to Greenland, which could involve British soldiers, warships and planes being deployed to the island.\n\nMs Alexander downplayed the suggestion, telling Ms Kuenssberg the report “possibly reads something more into business as usual discussions amongst Nato allies than there actually are”.\n\nShe said the UK agreed with President Trump that the Arctic Circle “is becoming an increasingly contested part of the world with the ambitions of [Vladimir] Putin and China”.\n\n“Whilst we haven’t seen the appalling consequences in that part of the world that we’ve seen in Ukraine, it is really important that we do everything that we can with all of our Nato allies to ensure that we have an effective deterrent in that part of the globe against Putin.”\n\nMr Trump has said he wants to get control over Greenland, which has a strategic location and natural resources, and “if we don’t do it the easy way, we’re going to do it the hard way”.\n\nBut Lord Mandelson said he did not believe Mr Trump would use the military against a Nato ally.\n\n“President Trump is not going to land on Greenland, take Greenland by force,” he said. “He’s not a fool. What’s going to happen is there’s going to be a lot of discussion, a lot of consultation, a lot of negotiation and at the end of the day, we are all going to have to wake up to the reality that the Arctic needs securing against China and Russia.\n\n“And if you ask me who is going to lead in that effort to secure, we all know, don’t we, that it’s going to be the United States.”\n\nHe argued that Mr Trump “believes we live in a world of conflicts and hard power… and sometimes nettles need to be grasped. We have to understand that.”\n\nHe was also critical of Sir Keir over not matching his commitment with promised increases in defence spending.\n\n “I’m sorry, but the money’s got to follow,” he said. “I think the principle [of extra defence spending] is accepted. I think that the funding is embraced, but I haven’t seen the financial plans. Not for the future, not in the way that they need to build up and unfold in the years to come.”\n\nDowning Street sources noted that the prime minister shares President Trump’s view that Russia’s growing aggression in the High North must be deterred, and Euro-Atlantic security strengthened, and the UK takes the threats from Russia and China in the region “extremely seriously”.\n\nThey confirmed that “Nato discussions on reinforcing security in the region continue and we would never get ahead of those, but the UK is working with Nato allies to drive efforts to bolster Arctic deterrence and defence”.\n\nJust last year, UK commandos took part in Exercise Joint Viking in Norway – one of Nato’s biggest High North drills in sub-zero temperatures– alongside 7,000 allied troops, Royal Navy patrol boats and RFA Lyme Bay.\n\nThis year, 1,500 Royal Marines will deploy for Exercise Cold Response across Norway, Finland and Sweden, training with allies to defend key terrain and demonstrate Nato unity.\n\nBut in the last week, senior retired military top brass have warned that the UK is overstretched even with Sir Keir’s commitment to Ukraine.\n\nIn a report for Policy Exchange, retired air marshal Edward Stringer warned that increased defence spending in the UK is being “eaten up by the Ministry of Defence [MoD]’s overdraft” with the UK’s military footprint shrinking at a critical moment.\n\nHis report, entitled “The Say-Do Gaps in Defence”, notes that the British army now has just 14 howitzers in total; the Royal Navy has been unable to put more than one attack submarine to sea for a while; and the RAF had to send training unit pilots to sea to guarantee certification of the F35 Force on the carrier.\n\nMeanwhile, another Policy Exchange report earlier in the week from another retired air marshal, Lord Stirrup, outlined how the UK had become too reliant on possessing nuclear weapons for deterrence, which he warned was not scaring Vladimir Putin.\n\nIt came as Sir Richard Shirreff, who served as Nato’s deputy supreme allied commander in Europe between 2011 and 2014, said allied forces would need at least 50,000 troops in Ukraine to deter an attack from Russia, while the army currently has less than 75,000 personnel.","summary":"The potential for British troops in the Danish territory comes days after the PM pledged boots on the ground in Ukraine","url":"https://www.independent.co.uk/news/uk/politics/greenland-starmer-trump-military-arctic-b2898311.html","image":"https://static.independent.co.uk/2025/05/15/13/56/Prime-Minister-Keir-Starmer-Travels-To-Albania-Ahead-Of-EPC-Summit-66s18nuc.jpeg?crop=7176,4784,x0,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/oCTBz6Jn-OhrQWqOm.mp4","publish_date":"2026-01-11 14:38:10","author":"David Maddox","authors":["David Maddox"],"language":"en","category":"politics","source_country":"gb","sentiment":0.154},{"id":392294328,"title":"Fake AI-generated videos shared by Musk about Venezuela received millions of views","text":"AI-generated images and videos following the arrest of Venezuelan president Nicolas Maduro have flooded social media, receiving millions of views as experts warn that visual cues are no longer a reliable tell for artificial intelligence.\n\nWithin hours of Donald Trump’s announcement that Maduro had been captured, AI-generated images of the arrest and outdated footage claiming to show the military operation in Caracas were widely shared on social media.\n\nElon Musk reposted an AI-generated video of Venezuelans crying on their knees, thanking Trump and the US for freeing them from President Maduro. The footage, originally published by an account on X called Wall Street Apes, has been viewed 5.7 million times on the platform.\n\nResearch by Shayan Sardarizadeh, a senior journalist for BBC Verify, revealed that the video was originally posted on TikTok by an account called Curious Mind, which regularly shares AI-generated videos. A community note underneath the reposted video described it as “AI generated and is currently being presented as a factual statement intended to mislead people.”\n\nMultiple errors can be spotted in the video, from incorrect flag patterns and disappearing objects to missing teeth. The video has since been taken down on TikTok but remains on X.\n\nMusk has gone on to share multiple “AI slop” videos, including one deepfake of Maduro breakdancing with President Trump, and another of the Venezuelan president in prison with Sean “Diddy” Combs.\n\nWhile he has not responded to claims on social media that the video of the Venezuelans crying was false, he has since reposted content that vouches for X’s accuracy.\n\nVince Lago, mayor of Coral Gables, Florida, was one of many who reposted a hyper-realistic, AI-generated photo of Maduro being led off a plane by US law enforcement agents on Instagram.\n\nAnalysis by Google’s SynthID detection tool revealed an invisible watermark on the content that proves it was generated or edited using AI software. According to Google Gemini, this watermark is “imperceptible to the human eye but can be detected by software”.\n\nAs part of his post using the fake image on social media, the politician declared: “With the capture of Nicolas Maduro earlier today, America is safer and Venezuela is one step closer to freedom.\n\n“President Trump and Secretary of State Marco Rubio were clear from the start: Maduro is not President of Venezuela, he is the leader of a narco-terrorist organization threatening our country. God bless our men and women in uniform, and may God continue to bless our great country.”\n\nThe creator of the now-viral, AI-generated photo of Maduro later came forward as a Spanish-based X user with fewer than 100 followers. A self-described “AI video art enthusiast”, who goes by the name Ian Weber, told AFP that he had never expected it to become so widely shared.\n\nHe created the fake with Google Gemini’s Nano Banana Pro to post within 20 minutes of Trump’s announcement of the operation on Truth Social, according to AFP.\n\nAnother AI-generated photo showed a soldier posing next to Maduro, who has a black hood over his head, according to a report from NewsGuard outlining fabricated and out-of-context photos and videos linked to the military operation in Venezuela. \n\nNewsGuard, which provides services such as misinformation tracking, said that seven of the misleading photos and videos it identified have now garnered more than 14 million views on X alone.\n\nBenjamin Dubow, a democratic resilience fellow at the Center for European Policy Analysis (CEPA), explained to The Independent that the AI-generated content came about as social media users attempted to fill an information void in the hours after Maduro’s capture was announced.\n\n“With the capture of Maduro, you have one of the biggest, most shocking news stories of the past couple of years and especially Saturday morning US time, the couple of hours after the event happened, there’s almost no news coming out because there’s just a lot of uncertainty. \n\n“You have the press conference at 11 o’clock Eastern Time, but you have news already broken before then about the event and you have a lot of demand for an understanding of what’s been going on and what’s happening.\n\n“There were a lot of people on social media generally who were more than happy to step in to fill that void,” he added. “What’s kind of interesting about what Musk shared, what the mayor of Coral Gables shared … They were fakes, but they weren’t really conveying anything that different than what happened.”\n\nHe added that basic media literacy remained important in the face of the sheer volume of content and misinformation online.\n\n“Best practice is waiting until there are actual reliable sources, validating the sources, making sure they’re credible, reliable and up to date,” he said. “Basic media literacy as it existed 20 years ago still applies now. It’s a much bigger challenge because the volume of content is hundreds or thousands of times greater than it was back then. \n\n“The really big thing is you should be the most suspicious of content that you most agree with, which is very hard and counterintuitive to do, but the stuff you agree with, the stuff that makes the most sense, that’s the easiest way to trick you into believing something that’s not true,” he added. \n\n“You’re never gonna believe something that makes the other side look good, so the other side’s misinformation really isn’t gonna affect you.\"\n\nSofia Rubinson, senior editor of NewsGuard’s Reality Check, told The Independent: “As AI-generated images and videos improve to the point where visual cues are no longer reliable, it’s more important than ever to approach content on social platforms with skepticism, even when shared by prominent or verified accounts. \n\n“In situations like Venezuela, where credible news organisations may lack immediate access or visuals, AI-generated content and manipulated media can quickly fill the information void. These images may not always invent events outright, but they can misrepresent context, timing, or scale. Our ability to trust what we see on social media is rapidly declining.”\n\nAs well as AI-generated media, old footage of previous incidents in Venezuela has been recycled, causing further confusion. Even President Trump has shared footage purporting to show throngs of Venezuelans “celebrating” the US military’s recent capture of President Maduro. \n\nThe post on Truth Social showed a massive crowd of people gathered in Caracas. Its caption states: “Millions of Venezuelans are celebrating the news of the collapse of the Maduro regime.”\n\nA reverse image search of the clip showed the footage was actually from a protest in Caracas after Maduro’s disputed presidential win in July 2024. \n\nThe same video has been reposted by right-wing influencer and conspiracy theorist Alex Jones on X, who alleged to his audience of 4.4 million followers it was to celebrate “the ouster of Communist dictator Nicolas Maduro”. It has been viewed 2.2 million times.\n\nThe Independent has contacted X and Meta for comment.","summary":"Within hours of Donald Trump’s announcement that Venezuela’s president had been captured, social media was flooded with AI-generated media. Bryony Gooch reports","url":"https://www.independent.co.uk/news/world/americas/venezuela-maduro-ai-videos-images-trump-misinformation-b2895344.html","image":"https://static.independent.co.uk/2026/01/06/12/51/1767544858913.jpeg?crop=799.5,533,x0.2,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/CTPXJcrH-4VHSaSK0.mp4","publish_date":"2026-01-11 14:02:39","author":"Bryony Gooch","authors":["Bryony Gooch"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.158},{"id":392289280,"title":"How Bad Bunny Did It","text":"A few years ago, I visited my childhood home and heard a surprising sound: the bright and bouncy music of the Puerto Rican rapper Bad Bunny. My parents are white Baby Boomers who speak no Spanish and have never shown a taste for hip-hop, but they’d somehow gotten into Benito Antonio Martínez Ocasio, whose sex-and-rum-drenched lyrics they couldn’t begin to decipher. The vector of transmission appeared to be the streaming service hooked to their smart speakers. When in need of a pick-me-up, Mom would shout, “Alexa, play Bad Bunny,” and make her Southern California kitchen sound like a San Juan nightclub.\n\nStories like this help explain how Bad Bunny has reached across language barriers to dominate pop domestically and abroad. Since uploading his first single in 2016, he’s broken U.S. sales records and claimed the title of the most streamed artist on Spotify in four separate years. His popularity, high standing with critics, and duration of success make him a peer—and sometimes a better-selling one—of such contemporary titans as Taylor Swift, Beyoncé, and Kendrick Lamar. Like them, he’s figured out that 21st-century-pop success is achieved by assembling excitingly hybrid sounds around an iron core of identity. In his case, that means performing almost exclusively in Spanish.\n\nMany Latin American singers have enjoyed cross-over fame before, but none has done it in the way Bad Bunny has, or at the same scale. Before streaming, they couldn’t: Major-market radio DJs, record-label execs, and the media still decided what constituted the American mainstream, and conventional wisdom said that audiences preferred music whose lyrics they could understand. Ricky Martin, Enrique Iglesias, and Shakira cracked U.S. markets only after they started singing in English. Rare exceptions, such as “Macarena,” by Los del Río, didn’t even confer name recognition upon their creators.\n\nBut the internet has revealed popular desires that last century’s gatekeepers didn’t know how to exploit. Bad Bunny arose from a transnational scene—widely called música urbana—whose primary audience is Spanish speakers, including the 44 million who live in the United States. Streaming has also helped English-only audiences connect with his music, just as it has for K-pop and Afrobeat. This month, Bad Bunny will occupy a cultural stage once reserved for America’s classic-rock gods and pop goddesses: the Super Bowl halftime show.\n\nBad Bunny has touted his game-day gig as a triumph for Latino—particularly Puerto Rican—representation. And in plain ways, his ascendance contradicts Donald Trump’s decree, made last March, that English is the sole national language. MAGA voices attacked the “crazy” decision by the “woke” NFL to book someone who’s not “a unifying entertainer.” They cited Bad Bunny’s political stances (he doesn’t want ICE outside his concerts) and gender-bending fashion (his biceps look great in a minidress). But they also tend to express the view that he, though an American citizen, is somehow un-American. The conservative activist group Turning Point USA is planning an alternative halftime show; in a poll sent to its supporters about what they’d like to see, the first option was “anything in English.”\n\nThe truth is that Bad Bunny’s rise is plenty American, and not simply because it reinforces the pluralistic ideals that Trump’s movement seeks to diminish. Bad Bunny’s music has reached all corners of the planet because it is a state-of-the-art product; he is a victor in the ever more crowded race for the freshest and most broadly appealing sound. Language barriers have turned out to be yet another bit of old friction that the internet has sanded down to create a cosmopolitan, commercialized middle ground. Does what’s lost in translation matter?\n\nAt the center of Bad Bunny’s sound is the rhythm that has ruled Latin American pop for decades: reggaeton, which marries dancehall and rap in crisp, minimalist fashion. Inspiring partying often with just a drum machine and a vocalist, reggaeton first flourished as the sound of working-class urban life in Puerto Rico. “This is where I was born, and so was reggaeton, just so you know,” Bad Bunny boasts in Spanish in one song.\n\nHe also grew up as a highly online Millennial at a time when American pop culture was ruled by Fall Out Boy’s pop punk, Lady Gaga’s synth pop, and Drake’s rap blues. All of those touchstones now inform his maximalist take on reggaeton. In any given Bad Bunny song, the melodies roll and sway between emo dejection and childlike glee, the electronic beats call to mind Nintendo games, and the low end churns as ominously as a lava pit. Bad Bunny’s vocal tone is unique: husky and flat, peppered with gasps and grunts, and shimmering with digital effects. He sounds like a ringmaster in a futuristic circus, and you don’t need to know Spanish to feel that a thrilling story is unfolding.\n\nIndeed, Bad Bunny’s success with English-speaking audiences might seem to answer the perennial music-fan debate about how important lyrics really are. Any Rolling Stones listener oblivious to what Mick Jagger is yowling about knows that the art form’s pleasures don’t require intelligibility. And the ideals of enlightened music appreciation dictate that listening to music you don’t understand can be a mind-expanding exercise. As David Byrne once put it, “To restrict your listening to English-language pop is like deciding to eat the same meal for the rest of your life.”\n\nMusic, however, is also a form of communication. That’s especially the case in the tradition Bad Bunny builds on: hip-hop, in which narrative, persona, and wordplay are crucial. He raps with intoxicating fluidity, stringing syllables together in a steady murmur that encourages close listening. Translations get you only part of the way to comprehending this aspect of his appeal. His themes are largely the same as those of English-language pop rappers—success, partying, and girls. (Lots of girls: “Me gustan mucho las Gabriela, las Patricia, las Nicole, las Sofía,” goes his smash “Tití Me Preguntó,” a little black book in song form.) But as I read along, I can sense all the things I’m missing: puns, connotations, references.\n\nEven some fluent Spanish speakers may feel similarly. He raps in a Caribbean dialect that is “full of so many skipped consonants, Spanglish, neologisms, and argot that it borders on Creole,” the Puerto Rican anthropology professor Yarimar Bonilla wrote in The New York Times. Bad Bunny’s success proves the cliché that music is a universal language, but it also highlights how universality can shear art from its social context—of which, in this artist’s case, there is a lot.\n\nBad Bunny has taken care to make his most important messages clear through not only lyrics but also videos, album art, and interviews. He’s more than a Puerto Rican Casanova with an ear for appealing musical pastiche. He’s also a protest artist, and part of what he’s protesting is the very process by which he has become so famous.\n\nThe title of his latest album, DeBÍ TiRAR MáS FOToS (or “I Should Have Taken More Photos”), expresses a sense of loss about the culture he grew up in. The cover image is of two empty chairs against a backdrop of banana trees. The songs long for friends and neighbors who have emigrated. A short film released with the album portrays an old man visiting a San Juan coffee shop only to find that it has been gentrified beyond recognition—filled with tourists and digital nomads scarfing overpriced vegan quesitos. (The video also features a talking toad belonging to an endangered local species.)\n\nBad Bunny is articulating the surreal and sad feeling of seeing his homeland transformed by internet-supercharged globalization. The U.S. territory’s economy has long relied on tourism, but in recent years, a wave of laptop-toting mainlanders lured by the balmy climate and notoriously loose tax laws has driven rent increases and threatened to wash out the local identity. Bad Bunny’s new album, Bonilla wrote, is a “lament for a Puerto Rico slipping through our fingers: betrayed by its leaders; its neighborhoods displaced for luxury developments; its land sold to outsiders, subdivided by Airbnb and crypto schemes and repackaged as paradise for others.”\n\nBad Bunny seeks not just to point out the problem of displacement, but also to do something about it. He’s portrayed his refusal to sing in English as a proactive maneuver against the pressures of Anglo-assimilation. On his latest tour, he skipped the continental U.S. entirely, citing fears that ICE agents would target his concerts. Instead, he hosted a 31-show residency in San Juan, the title of which, No me quiero ir de aquí, means “I Don’t Want to Leave Here.” He has campaigned for the island’s independence and against its potential statehood. One song on the new album spotlights Hawaii—a tourist playground whose natives have been utterly marginalized—as an example of the fate that could befall Puerto Rico if its residents do not resist the influence from their north.\n\nYet, inevitably, Bad Bunny’s worldwide fame is bound up in the same cycle he bemoans. Though many tickets for his concert residency were set aside for locals, the gambit of course attracted outsiders to the island. Some made a pilgrimage to the supermarket where he once worked in his hometown of Vega Baja. One was shot and killed in La Perla, a poor San Juan neighborhood that began to attract tourists only after being featured in the video for Luis Fonsi and Daddy Yankee’s 2017 reggaeton smash, “Despacito.”\n\nIn this context, Bad Bunny’s Super Bowl booking represents an uneasy trade. He gets to perform on America’s most watched stage—expressing his vision on a grand scale in ways that could energize his fans and expand his audience. The NFL not only gets a popular performer to juice ratings; it gets to advertise itself to the Spanish-speaking world at a time when professional football is eyeing the global market share of soccer and other sports, eager to carve out a niche. Some might say that the NFL is a mainland-American institution with colonial ambitions, and that Bad Bunny is now part of that effort.\n\nExports, imports, migration, melding—the costs of these historical engines of change and progress are now the preoccupation of popular art and politics. In a strange way, MAGA and Bad Bunny are each responding to versions of the same 21st-century phenomenon: the decoupling of culture and geography, which has left so many people—wherever they were born—feeling strangely placeless and adrift. But the cruel absurdities and dark historical parallels of Trump’s nationalist agenda reflect how perverse, and ultimately futile, strident identity protectionism is in 2026. American country music has been catching on abroad; American listeners have KPop Demon Hunters fever. And the Super Bowl will be headlined by an artist who seems sure he can create something meaningful out of interconnectivity—something that’s his own, no matter how much it’s shared.\n\nThis article appears in the February 2026 print edition with the headline “How Bad Bunny Did It.”","summary":"The Super Bowl headliner doesn’t care if you understand his lyrics.","url":"https://www.theatlantic.com/magazine/2026/02/bad-bunny-super-bowl-cultural-significance/685508/","image":"https://cdn.theatlantic.com/thumbor/eMiQ3RjJ0gi0dZmtODde28ZNH1Q=/510x0:1822x1312/1080x1080/media/img/2026/01/Bad_Bunny_Omnivore_web_16x9/original.jpg","video":null,"publish_date":"2026-01-11 14:00:00","author":"Spencer Kornhaber","authors":["Spencer Kornhaber"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.104},{"id":392285426,"title":"Exact moment Donald Trump's lies on Renee Good unravel in ICE shooter's video","text":"This is the exact moment that Donald Trump's falsehoods about Renee Good were exposed, as crucial new evidence on her killing came to light. The mum-of-three had dropped her son off at school in the city of Minnesota , just hours before she was shot three times in her car by a masked ICE agent. Renee encountered a swarm of law enforcement officials as an immigration raid was being carried out and was trying to move her car away from the scene when shots were fired. A new video, which shows the incident from the law enforcement officer's perspective, debunks claims made by Trump and Vice President JD Vance that he was acting in self defence, with one pin-point moment leaving their smear of Renee's character in tatters. The new video sees the 37-year-old mum speaking with the ICE agent before the shooting unfolded. Renee had partially blocked the road with her car, the agent got out of his own vehicle, and walked around the Honda Pilot, capturing her registration number and her face in his footage. Renee had rolled down her window and she spoke to the officer. \"That's fine, dude. I'm not mad at you,\" she was heard saying. As this goes on, someone who is believed to be Renee's partner walked toward the officer, filming him in turn on her own phone. \"We don't change our plates every morning,\" Renee then said to the officer. \"They'll still be the same plates when you come talk to us later. That's fine. US citizen and former f***ing veteran. Former Navy veteran, you want to come at us?\" At one stage, she reversed her vehicle, allowing other cars to get past. The person who was standing outside the car was then heard saying, \"I say you go get yourselves some lunch, big boy.\" On the far side of Renee's vehicle, more officers approached, who began to demand she exit her Honda. \"Get out of the car,\" they are heard saying. \"Get out of the f***ing car.\" At this stage, the video crucially shows that Renee began to turn her steering wheel to the right, to drive around the officer who was standing in front of it. The camera was then pointed away, but the officer can be heard saying \"whoa\". The White House have claimed that Renee was trying to run over the officer, and so they acted in self defence, and JD Vance has argued the new video confirms his claims that she was trying to injure the officer. However, the footage shows her clearly trying to steer around him, and therefore not trying to run him over. As analysed by the Mirror , the new footage, from the shooter's perspective, also shows he changed hands on the phone he was using to film the incident, leaving his right hand free to draw his weapon ten seconds later. Then, three shots rang out. Renee's car moved quickly towards parked cars nearby, as the officer said: \"F***ing b**ch\". The mum-of-three had lost her life. The video seems to confirm that Renee had parked her car across the way to try and block the ICE agents from conducting their work - but she, nor the other person outside the car, became aggressive towards them. Becca Good, Renee's partner, said in a heartbreaking tribute to Renee, that she \"was a Christian who knew that all religions teach the same essential truth: we are here to love each other, care for each other, and keep each other safe and whole\". Becca also said that \"kindness radiated out\" of Renee and that she \"literally sparkled\". \"On Wednesday, January 7th, we stopped to support our neighbours. We had whistles. They had guns,\" the statement said. Renee's ex-husband has also insisted that she was not an activist and that he had never known her to participate in any protests. He described her as a devoted Christian who took part in youth mission trips to Northern Ireland when she was younger. She loved to sing, participating in a high school chorus and studying vocal performance in college. The mum studied creative writing at Old Dominion University in Virginia and won a prize in 2020 for one of her works, according to a post on the school's English department Facebook page, reports the Associated Press. She also hosted a podcast with her second husband, who died in 2023. She has a 15-year-old daughter and a 12-year-old son from her first marriage. Her 6-year-old son was from her second marriage, the Mirror US reports. Renee's ex-husband said she had primarily been a stay-at-home mum in recent years, but had previously worked as a dental assistant and at a credit union. Donna Ganger, Renee's mother, told the Minnesota Star Tribune: \"Renee was one of the kindest people I've ever known. She was extremely compassionate. She's taken care of people all her life. She was loving, forgiving, and affectionate. She was an amazing human being.\" Protests have broken out in cities in towns across the US after Renee's killing, while other immigration enforcement officers shot and wounded two people in Portland , Oregon. Despite public uproar, Trump's administration has defended the shootings, claiming they were both acts of self-defence against drivers who were \"weaponising\" their vehicles. The Trump administration has deployed thousands of federal officers to Minnesota as part of an expanded enforcement drive, with more than 2,000 personnel involved. Some of those officers were reassigned after being abruptly withdrawn from Louisiana, where they had been involved in a separate operation launched last month that was due to run until February.","summary":"New video evidence of Renee Good's final moments, analysed by the Mirror, have made clear that Donald Trump's allegations about the mum-of-three's character are unfounded","url":"https://www.mirror.co.uk/news/us-news/exact-moment-donald-trumps-lies-36533462","image":"https://i2-prod.mirror.co.uk/article36530349.ece/ALTERNATES/s1200b/0_Immigration-Enforcement-Minnesota-26009829184407.jpg","video":null,"publish_date":"2026-01-11 13:58:17","author":"Ellie Fry,Emma Mackenzie","authors":["Ellie Fry","Emma Mackenzie"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.801},{"id":392291092,"title":"New red flags raised about Trump's 'cognitive health': 'He's only going to get worse'","text":"Prominent activists on Sunday raised a renewed alarm about Donald Trump's \"cognitive health,\" with one conservative declaring, \"He's still only going to get worse.\"\n\nAmid frantic White House moves both on and off American soil, Charlotte Clymer, an Army Veteran and a writer who has done work for the Human Rights Campaign, wrote on social media, \"I'm not a doctor or a nurse. I have no medical expertise. Far be it from me to diagnose anyone. Not my place. I don't know what's going on with Trump. But I do know something is going on with him. We all can see something is pretty damn off with him.\"\n\nClymer then put the \"legacy media\" on notice for failing to raise these same questions, asking, \"Where is the scrutiny over his cognitive health that legacy media had for Pres. Biden? How much worse will this get until legacy media does what they're supposed to do here?\"\n\nProminent conservative attorney George Conway, who has opposed Trump for years, further responded to Clymer, writing, \"I had a few thoughts on this question in 2019 and wrote this 11,000+ word piece in [The Atlantic] about [Trump's] serious psychiatric disorders (Narcissistic Personality Disorder and Antisocial Personality Disorder, for starters) to explain why, as a legal and constitutional matter, he was unfit for the presidency and would only become more so with the passage of time.\"\n\nConway went on to talk about his view on Trump's mental health status as of this year.\n\n\"In the six-plus years since, every mental health professional I have come across has told me that my essay had it exactly right,\" he then added. \"I think every word of it has been proven right many times over. Even today, he's still only going to get worse.\"","summary":"Prominent activists on Sunday raised a renewed alarm about Donald Trump's \"cognitive health,\" with one conservative declaring, \"He's still only going to get worse.\"\n\n\nAmid frantic White House moves both on and off American soil, Charlotte Clymer, an Army Veteran and a writer who has done work for the Human Rights Campaign, wrote on social media, \"I'm not a doctor or a nurse. I have no medical expertise. Far be it from me to diagnose anyone. Not my place. I don't know what's going on with Trump. But I do know something is going on with him. We all can see something is pretty damn off with him.\"\n\nClymer then put the \"legacy media\" on notice for failing to raise these same questions, asking, \"Where is the scrutiny over his cognitive health that legacy media had for Pres. Biden? How much worse will this get until legacy media does what they're supposed to do here?\"\n\nProminent conservative attorney George Conway, who has opposed Trump for years, further responded to Clymer, writing, \"I had a few thoughts on this q","url":"https://www.rawstory.com/trump-cognitive-2674872817/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-and-u-s-vice-president-jd-vance-meet-with-ukraine-s-president-volodymyr-zelenskiy-not-pictured-ov.jpg?id=61774838&width=1200&height=1200&coordinates=796%2C0%2C797%2C0","video":null,"publish_date":"2026-01-11 13:50:44","author":"David McAfee","authors":["David McAfee"],"language":"en","category":"politics","source_country":"US","sentiment":-0.245}]}