{"offset":0,"number":50,"available":10609,"news":[{"id":358716558,"title":"Donald Trump makes feelings clear on Carlos Alcaraz and Jannik Sinner, voices surprise at his treatment from NYC crowd after US Open visit","text":"Donald Trump made waves with his appearance at Arthur Ashe Stadium to witness Carlos Alcaraz and Jannik Sinner's showdown in the 2025 US Open final. The US President has revealed how he feels about his experience at the event after his noteworthy visit.Trump's decision to return to the New York Major after a 10-year absence led to controversial scenes during the men's final, especially because broadcasters were reportedly asked to censor any negative reactions to the President's presence. Despite this, videos from the stadium revealed that the 79-year-old received a mixed reaction from the crowd, with many spectators booing him when he appeared on screen during the national anthem.Due to heightened security, Donald Trump's presence also caused a major delay and forced Carlos Alcaraz and Jannik Sinner's clash to commence with only 40% of the stadium occupied while fans were stuck in long queues outside. Nevertheless, the match unfolded in thrilling fashion, with Alcaraz claiming a 6-2, 3-6, 6-1, 6-4 victory to clinch his sixth Grand Slam title.After his visit, Trump said that he thoroughly enjoyed his experience at the final and praised Alcaraz and Sinner for their \"unbelievable talent.\" The US President also expressed surprise at the great treatment he received from the \"progressive\" New York crowd during the match.\"Well, I loved it. First of all, the two players have unbelievable talent. It just seems that they hit the ball harder than I’ve ever seen before, incredible talent. And I enjoyed it. I used to go all the time. Lately, it’s a little bit more difficult to go. I really enjoyed it. They were really nice,\" Trump said.\"The fans were really nice. I didn't know what to except. Usually, you would say that would be a somewhat progressive, as they say nowadays, crowd. Some people would call it liberal but we'll use the word they like to use, progressive, but they were great. The fans were great,\" he added.Despite Donald Trump's praise for Carlos Alcaraz, the US President generated a buzz with his seemingly unimpressed reaction to the Spaniard's victory at the New York Major. Martina Navratilova even accused Trump of being \"jealous\" after he was spotted not clapping for Alcaraz's victory.Carlos Alcaraz on Donald Trump attending US Open final: \"Playing in front of him, to be honest I will try not to think about it\"Carlos Alcaraz - Source: GettyCarlos Alcaraz felt that it was great for the tennis to have Donald Trump in attendance during the US Open. While speaking to the press before the title clash, the 22-year-old called it a \"privilege\" for the tournament to have the US President grace his meeting with Jannik Sinner.Alcaraz also said that he intended to put Trump's presence out of his mind during the final because it would make him too nervous otherwise.\"I think that it is a privilege for the tournaments having the president from every country just to support the tournament, to support tennis, and to support the match. For me, playing in front of him, to be honest I will try not to think about it. I don’t want myself to be nervous because of it, but I think attending the tennis match, it’s great for tennis to have the president at the final,\" Carlos Alcaraz said.Carlos Alcaraz will enjoy a short break from the tour before returning to action at the Japan Open, scheduled to begin on September 24. Having reclaimed the World No. 1 ranking after his US Open triumph, the Spaniard will enter the ATP 500 event as the top seed.","summary":"Donald Trump made waves with his appearance at Arthur Ashe Stadium to witness Carlos Alcaraz and Jannik Sinner's showdown in the 2025 US Open final.","url":"https://www.sportskeeda.com/tennis/news-donald-trump-makes-feelings-clear-carlos-alcaraz-jannik-sinner-voices-surprise-treatment-nyc-crowd-us-open-visit","image":"https://staticg.sportskeeda.com/editor/2025/09/48c92-17573775162650-1920.jpg","video":null,"publish_date":"2025-09-09 01:12:56","author":"Urvi Mehra","authors":["Urvi Mehra"],"language":"en","source_country":"in","sentiment":0.009},{"id":358716908,"title":"Iryna Zarutska stabbing case: Trump calls killing of Ukrainian woman 'horrific'","text":"US President Donald Trump on Monday condemned the killing of a 23-year-old Ukrainian refugee in North Carolina, calling the suspect a \"career criminal.\" In a statement posted on the official White House account on X, Trump said he had watched the surveillance video of the August 22 attack, describing it as \"horrific\" and \"not really watchable because it's so horrible.\"\"The perpetrator was a well-known career criminal, who had been previously arrested and released on CASHLESS BAIL in January, a total of 14 TIMES,\" Trump wrote. \"What the hell was he doing riding the train, and walking the streets? Criminals like this need to be LOCKED UP.\"The victim, identified as Iryna Zarutska, had fled the war in Ukraine and was working in Charlotte. Video released by the Charlotte Area Transit System (CATS) shows her boarding a Lynx Blue Line train shortly before 10 pm, dressed in a pizzeria uniform and scrolling on her phone. Moments later, a man in a red hoodie seated behind her pulled out a knife and stabbed her three times, including once in the neck. Zarutska died at the scene.The suspect, 34-year-old Decarlos Brown, was arrested soon after the attack and charged with first-degree murder. Authorities said Brown had an extensive criminal record, including felony robbery, larceny, and breaking convictions dating back more than a decade.Trump links case to broader crime debateSpeaking earlier in the day at Washington's Museum of the Bible, Trump said the Charlotte stabbing underscored the danger of lenient bail laws.\"We're all people of religion, but there are evil people,\" Trump told the audience. \"If we don't handle that, we don't have a country.\"He linked the case to his administration's earlier push against cashless bail policies, arguing that Brown's release showed \"why reform has failed.\"Community reeling, political tensions risingZarutska's killing has rattled Charlotte's Ukrainian community and fueled political debate nationwide. Trump cited other recent high-profile killings in his remarks, suggesting a broader pattern of \"criminals set free at the expense of innocent lives.\"For Zarutska's grieving family, Trump said his message was one of condolence: \"I just give my love and hope to the family of the young woman who was stabbed … by a madman.\"","summary":"Donald Trump condemned the murder of Iryna Zarutska, a Ukrainian refugee, in Charlotte, North Carolina, blaming lenient bail laws for the tragedy. He described the suspect, Decarlos Brown, as a \"career criminal\" with a history of arrests and releases on cashless bail. Trump linked the case to his broader argument against cashless bail policies, highlighting the need to lock up dangerous criminals to protect innocent lives.","url":"https://timesofindia.indiatimes.com/world/us/iryna-zarutska-stabbing-case-trump-calls-killing-of-ukrainian-woman-horrific-condemns-lunatic-behind-the-attack/articleshow/123775970.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123775971/123775971.jpg","video":null,"publish_date":"2025-09-09 00:56:56","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.493},{"id":358716336,"title":"BRICS leaders denounce protectionism, tariff ‘blackmail’","text":"BRASÍLIA: Leaders of the 11-member BRICS bloc railed against economic protectionism and “tariff blackmail” during a virtual meeting Monday held amid a damaging trade war with US President Donald Trump.\n\nThe group of emerging economies met via videoconference at the initiative of Brazil’s President Luiz Inacio Lula da Silva, whose office said it was necessary to address the “intensification of unilateral measures” in the world.\n\nThe BRICS represents nearly 40 percent of global GDP and almost half of the world’s population. \n\nSeveral of its members are among those most affected by what Lula referred to Monday as “tariff blackmail” and “unjustified and illegal” trade practices.\n\nAddressing his colleagues, Chinese President Xi Jinping called Monday for the upholding of “the multilateral trading system with the World Trade Organization at its core” and for rejection of “all forms of protectionism.”\n\nBrazil’s exports to the United States plunged 18.5 percent year-on-year in August after Trump slapped his highest level of trade tariff — 50 percent — on a range of goods from Latin America’s biggest economy.\n\nTrump is punishing Brazil for what he calls a “witch hunt” against his ally, former president Jair Bolsonaro who is on trial for allegedly plotting a coup to take power back from Lula after losing the 2022 elections.\n\nA verdict in the trial is expected this week.\n\n“Tariff blackmail is being normalized as an instrument to conquer markets and interfere in domestic affairs,” Lula said Monday.\n\nWashington also imposed tariffs of up to 50 percent on Indian imports, accusing New Delhi of fueling Moscow’s deadly attacks on Ukraine by purchasing Russian oil.\n\nRussian President Vladimir Putin also took part in the virtual meeting, just days after meeting Xi, North Korea’s Kim Yong Un and India’s Narendra Modi in China where regional leaders slammed “bullying behavior” in a veiled reference to Trump’s United States.\n\nSouth Africa for its part, was hit with a 30 percent tariff — the highest in sub-Saharan Africa — amid soaring tensions with Washington over a range of domestic and international policies.\n\nTrump has said he would not attend the G20 summit in South Africa later this year.\n\nSouth African President Cyril Ramaphosa, in a prepared speech, said “unilateral tariff actions are contributing to an increasingly protectionist environment which poses great hardships and danger for the countries of the Global South.”\n\nIn July, Trump lashed out at the BRICS and threatened its members with additional tariffs after they voiced concern that his trade war was putting the global economy at risk.\n\n“No matter how the international situation changes, we must remain steadfast in promoting the building of an open global economy, sharing opportunities and achieving win-win results through openness,” Xi reiterated Monday.\n\nOther BRICS members are Indonesia, Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates.","summary":"BRASÍLIA: Leaders of the 11-member BRICS bloc railed against economic protectionism and “tariff blackmail” during a virtual meeting Monday held amid a damaging trade war with US President Donald Trump.\n\n\n\nThe group of emerging economies met via videoconference at the initiative of Brazil’s President Luiz Inacio Lula da Silva, whose office said it was necessary to address the “intensification of unilateral measures” in the world.\n\n\n\nThe BRICS represents nearly 40 percent of global GDP and almost half of the world’s population. \n\n\n\nSeveral of its members are among those most affected by what Lula referred to Monday as “tariff blackmail” and “unjustified and illegal” trade practices.\n\n\n\nAddressing his colleagues, Chinese President Xi Jinping called Monday for the upholding of “the multilateral trading system with the World Trade Organization at its core” and for rejection of “all forms of protectionism.”\n\n\n\nBrazil’s exports to the United States plunged 18.5 percent year-on-year in August after Trump slapped his ","url":"https://www.brecorder.com/news/40381784/brics-leaders-denounce-protectionism-tariff-blackmail","image":"https://i.brecorder.com/large/2025/09/68bf416ba95aa.jpg","video":null,"publish_date":"2025-09-09 00:43:38","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":0.301},{"id":358713078,"title":"'Really ticked me off': Republican senator blasts Trump admin's 'disdain for human life'","text":"One Senate Republican isn't holding back from making his feelings known about a recent military operation that President Donald Trump's administration carried out earlier this month.\n\nPolitico reported Monday that Sen. Rand Paul (R-Ky.) is doubling down on his criticism of the administration's recent bombing of a boat it claimed was carrying members of a Venezuelan gang who were allegedly trafficking drugs. The attack killed 11 people, and wasn't made public until Trump posted about the operation to social media after the fact.\n\nPaul — who chairs the Senate Homeland Security and Government Affairs Committee – had previously taken aim at Vice President JD Vance after the vice president on Saturday tweeted: \"Killing cartel members who poison our fellow citizens is the highest and best use of our military.\"\n\nREAD MORE: George Conway busts Trump's claim that signature on lewd Epstein birthday card isn't his\n\n\"What a despicable and thoughtless sentiment it is to glorify killing someone without a trial,\" Paul wrote in response to Vance's post.\n\nThe Kentucky Republican elaborated on his criticism in remarks to reporters on Monday evening, saying the vice president's comments \"really ticked me off.\" While he didn't publicly say whether he would hold a hearing over the bombing, he lamented that \"nobody’s even asking whether we need to prove [the administration's claims]. We just blow them up.\"\n\n“I got no love lost for these people. But at the same time, is this the new Coast Guard policy?\" Paul continued. \"Almost none of the boats we’ve interdicted does it end up with us blowing up the boat.\"\n\nThe three-term Republican said he felt it was wrong for Vance to \"glorify the idea of killing people without any due process and saying he just didn’t give a s--- what anybody who was going criticize him was going to say. That to me was a disdain for human life and a disdain for processes.\"\n\nREAD MORE: 'I handled the deal': Epstein joked about selling a 'fully depreciated' woman to Trump\n\nClick here to read Politico's report in its entirety.","summary":"One Senate Republican isn't holding back from making his feelings known about a recent military operation that President Donald Trump's administration carried out earlier this month.\n\nPolitico reported Monday that Sen. Rand Paul (R-Ky.) is doubling down on his criticism of the administration's recent bombing of a boat it claimed was carrying members of a Venezuelan gang who were allegedly trafficking drugs. The attack killed 11 people, and wasn't made public until Trump posted about the operation to social media after the fact.\n\nPaul — who chairs the Senate Homeland Security and Government Affairs Committee – had previously taken aim at Vice President JD Vance after the vice president on Saturday tweeted: \"Killing cartel members who poison our fellow citizens is the highest and best use of our military.\"\n\nREAD MORE: George Conway busts Trump's claim that signature on lewd Epstein birthday card isn't his\n\n\"What a despicable and thoughtless sentiment it is to glorify killing someone without a trial,\" Paul wrote","url":"https://www.alternet.org/republican-senator-trump-disdain/","image":"https://www.alternet.org/media-library/image.jpg?id=61428978&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-09-09 00:41:18","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.277},{"id":358712078,"title":"Man Accused Of Trying To Kill Trump Goes To Trial In Florida Court","text":"The trial of Ryan Routh, the man accused of attempting to assassinate then-presidential candidate Donald Trump, is set to begin Monday in Fort Pierce, Florida, with jury selection. Opening statements are scheduled to follow on Thursday.\nRouth, 59, was arrested last year after allegedly attempting to shoot Trump while he was campaigning. The incident occurred nearly a year ago, when Routh reportedly staked out a golf course with the intent to kill the Republican frontrunner, now President of the US. The case is being overseen by Judge Aileen Cannon.\nIn a highly unusual move, Routh has chosen to represent himself in court, despite repeated warnings from Judge Cannon. In a letter to the court, Routh wrote, “It was ridiculous from the outset to consider a random stranger that knows nothing of who I am to speak for me,” explaining that he and his attorneys were “a million miles apart” and not responding to his questions. Judge Cannon responded by saying, “I strongly urge you not to make this decision,” but ultimately granted his request.\nRouth faces five serious charges, including attempted assassination of a major presidential candidate, being a felon in possession of a firearm, possessing a firearm with no serial number, and assaulting a federal officer. If convicted, he could face life in prison.\nThe incident occurred just weeks after another assassination attempt on Trump in Pennsylvania, where a bullet grazed his ear during a rally. The two incidents, so close together, raised renewed concerns over political violence and the effectiveness of US Secret Service protocols in the lead-up to the 2024 election.\nOriginally from North Carolina, Routh had been living in Hawaii prior to the alleged attempt. He has a prior criminal record and is known to have expressed strong political views, including vocal support for Ukraine in its war against Russia.\nSecurity measures are expected to be tight throughout the trial, given the nature of the charges and the political implications of the case.","summary":"In a highly unusual move, Routh has chosen to represent himself in court.","url":"https://www.news18.com/world/man-accused-of-trying-to-kill-trump-goes-to-trial-in-florida-court-ws-l-9558437.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/Untitled-design-12-2025-09-9e188135ccd82aa0f142ec9ccc8299b4.png","video":null,"publish_date":"2025-09-09 00:35:52","author":"New.storytailors,News18,World Desk","authors":["New.storytailors","News18","World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.478},{"id":358712476,"title":"Europe floods its borders to stop Russia: Finland and Poland turn frontiers into anti-tank swamps as Germany warns Ukraine is 'just the start of Putin's plans for conquest' and EU stockpiles food","text":"European countries are bracing themselves for an imminent war with Russia by turning borders into defensive swampland and stockpiling essential goods such as food, water and medicine in preparation for a crisis.\n\nSeveral members of the 27-nation bloc are taking the drastic measures in anticipation of an invasion by Russian President Vladimir Putin, who could turn his sights towards conquering European countries after proving triumphant in Ukraine. \n\nThe defence ministries of Finland and Poland are calling for the restoral of their nation's bogs and marshes, making it impossible for Russian tanks to attack as any advance would be prevented by their heavy vehicles sinking into swampland.\n\nIt comes as German Chancellor Friedrich Merz issued a warning on Monday that Putin's 'imperialist plan wouldn't end with the conquest of Ukraine but would rather be just the start'. \n\nMeanwhile, Brussels has launched a 'stockpiling strategy' to ensure the continuity of key goods across Europe in the face of potential crises such as energy blackouts, pandemics, climate change and World War.\n\nThe EU is also pushing for every household to have a three-day survival kit, including matches, ID documents in a waterproof punch, bottled water, energy bars and a flashlight.\n\nAnd France's government has told its health bodies to expect for a 'major engagement' by March 2026 by asking hospitals to prepare for a potential flood of military patients from home and abroad.\n\nIt follows Ukrainian President Volodymyr Zelensky's warning that Putin could attack a NATO country within the next five years, as he criticised the alliance for a slow spending ramp up in June. \n\nThere is a precedent in Ukraine for using the natural capability of viscous wetlands to ward off deadly Russian onslaughts.\n\nAs Russian soldiers marched towards Kyiv in February 2022, Ukraine took a desperate measure. To repel Putin's advance, the armed forces blew a hole in the soviet-era Kozarovychi Dam on the Irpin river north of Kyiv, flooding 2,800 hectares of land. \n\nThe last-ditch attempt to shield the city paid off. As the land transformed into an impenetrable, black swamp, advancing Russian tanks found themselves 'stuck in the mud' as US President Donald Trump claimed last month.\n\nNow, there are mounting calls in Europe to accelerate the restoration of bogs and marshes as a measure to combat climate change and to bolster defense.\n\nPeatlands are unique ecosystems that naturally store large amounts of carbon dioxide. But if drained, they exude centuries' worth of carbon into the atmosphere, contributing towards global warming. \n\nAfter World War II, huge quantities of wetland were converted into profitable farmland. Nearly half of all peatlands in Europe are degraded, mostly due to artificial drainage - causing a toll on the environment.\n\nEU countries reported 124 million tons of greenhouse gas pollution from drained peatlands in 2022, close to the annual emissions of the Netherlands. Some scientists say even this is an underestimate.\n\nThat's why the bloc is prioritising restoring 30 percent of degraded peatlands over the next five years, and 50% by 2050 - to slow climate change, promote biodiversity, and now, ready border nations for potential war.\n\nAs part of Poland's £1.9 billion Eastern Shield development project for defence infrastructure, swamplands and forests close to its borders with Russia will be expanded.\n\n'The natural environment in the border areas is an obvious ally of any actions enhancing the elements of Eastern Shield,' a spokesman for Poland’s ministry of defence said. \n\nOn top of plans to expand swampland to deter Putin's troops, this summer the country added protective minefields to a 20-kilometre stretch of land bordering Russia and Belarus. The size of the armed forces stood at about 190,000 personnel at the end of last year, including ground, air, naval, special forces and territorial defence forces. Poland plans to increase this to 300,000 troops within a few years.\n\n'Drained peatland makes up 10 percent of Finland’s agricultural land, but it produces more than half of the agricultural greenhouse gas emissions,' Kristiina Lang, a research professor and peat specialist at the Natural Resources Institute of Finland told France24. \n\nIn Finland, there are some obvious locations that could be considered for large-scale rewetting, such as swathes of land drained for forestry that failed to grow any trees. \n\n'It's very logical to wet these large areas again,' Lang said. 'And if we need to rewet part of our peatlands anyway, then why not close to the eastern border?'\n\nScientists argue that restoring bogs on NATO's eastern flank would be a relatively cheap and effective measure to achieve EU climate targets and defense goals in one fell swoop.\n\nBut there are environmental downsides and complications associated with the plan to revive Europe's swamps. For one, people with privately-owned land in areas that have been earmarked for rewetting will be opposed to the move. \n\nMoreover, when Ukraine flooded the Irpin basin in a desperate attempt at defense, it was hugely ecologically destructive in the nearby residential areas, and the release of sewage and heavy metals harmed the environment.\n\nGovernments in the Baltic states which share a 600-mile border with Russia and Belarus have shown little interest in the project so far, apart from Lithuania, which said defense-linked wetland restoration 'is currently under discussion', according to Politico.\n\nThe Baltic country has recently revealed plans to dig a 30-mile-wide ribbon of defences on its borders with Russia and Belarus that will include minefields and bridges set to blow up in case Moscow invades.\n\nFor the past year, Estonia, Latvia and Lithuania have been fortifying their borders, adding obstacles and redoubts to existing fences amid Russia's mounting aggression.\n\nWhen complete, the Baltic defence line is estimated to be more than 940 miles long and will limit Russia's ability to launch attacks from its own territory, Kaliningrad and Belarus.\n\nLithuania, in particular, began setting up dozens of so-called 'engineering parks' filled with 'counter-mobility' equipment.\n\nThese initially included razor wire, concrete roadblocks, Czech Hedgehogs (a type of anti-tank barrier), as well as dragon's teeth (concrete pyramids).\n\nBut Lithuania has now said that it is looking to further layer its defences, stretching them wide enough to protect Vilnius, the capital. Lithuania's border with Kaliningrad and Belarus is over 590 miles long. \n\nThe new ribbon will be made of three layers. The first, estimated to be three miles wide, will begin with an anti-tank ditch next to the border fence. This will then be followed by an embankment, strips of dragon's teeth and minefields, and then two layers of strongpoints for defending infantry.\n\nThe second and third layers will see bridges primed with explosives that can be detonated at will, as well as more lines of infantry. \n\nEstonia approved a four-year €2.8 billion (£2.4 billion) additional defence funding bill earlier this year, pushing the Baltic country to an average defence spending of 5.4 percent of GDP through to 2029.\n\nMerz told a conference of Germany's ambassadors that 'we are experiencing daily and with increasing intensity hybrid Russian attacks, including on our infrastructure' and pointed to Moscow's 'provocations in the North and Baltic Seas'.\n\nGermany has been Ukraine's second-biggest supplier of military aid since Russia's invasion began in 2022 and has been on high alert for sabotage plots directed from Moscow.\n\nMerz has moved to ramp up Germany's defence capacities in the face of Trump's questioning of the future strength of the transatlantic alliance and wants Germany to have Europe's 'strongest conventional army'.\n\n'We have historic tasks,' Merz said on Monday, namely 'building a new security architecture which should last for several decades to come'.\n\n'What we referred to as the liberal world order is under pressure from many sides, including within the political West,' he said.\n\n'A new conflict between systems has broken out between liberal democracies and an axis of autocracies.'\n\nThe EU this year launched a broad readiness push to bolster its militaries and try to ensure it can defend itself by 2030.\n\n'The goal is very simple to make sure that essential supplies that keep our societies running, especially the ones that save lives, are always available,' EU crisis management commissioner Hadja Lahbib said. \n\nMeanwhile, French hospitals have been ordered to make preparations for an imminent war. \n\n'Among the risks identified is the hypothesis of a major engagement where the health issue would consist of taking care of a potentially high influx of victims from abroad,' the ministry of health said in a statement. \n\n'It is therefore a question for our health system of anticipating the care of military patients in the civilian health system'. \n\nBritain, despite having more recent memory of armed conflicts than many of its allies on the continent, has fallen behind in civil planning. \n\nIn November, the chief of the UK defence staff said that Britain simply does not have 'some of the civil aspects or planning aspects' that other allies have 'as part of their traditions'. \n\nAdmiral Sir Tony Radakin told the Berlin security conference that 'we are having those conversations to learn from our colleagues and see what might be appropriate for ourselves'.\n\nOther countries are more prepared. In November last year, Sweden announced that it would be sending out five million pamphlets to its population just north of 10 million, urging preparedness for the possibility of a lasting conflict.\n\nNATO chief Mark Rutte sounded the alarm in July about a major conflict that he anticipates would be started by simultaneous invasions from Xi and Putin.\n\nHe claimed that combined attacks from the Russian and Chinese leaders would trigger a World War nightmare and bring the planet to the brink of Armageddon.\n\nAccording to the NATO chief, China would start by seeking to grab Taiwan - while ensuring the Kremlin dictator simultaneously attacks NATO territory, amid fears Putin is eyeing the Baltic republics.","summary":"Several members of the 27-nation bloc are taking the drastic measures in anticipation of an invasion by Putin , who could turn his sights towards conquering Europe.","url":"https://www.dailymail.co.uk/news/article-15076585/Europe-floods-borders-stop-Russia-Finland-Poland-turn-frontiers-anti-tank-swamps-Germany-warns-Ukraine-just-start-Putins-plans-conquest-EU-stockpiles-food.html","image":"https://i.dailymail.co.uk/1s/2025/09/08/16/101945495-0-image-m-63_1757344528070.jpg","video":null,"publish_date":"2025-09-09 00:32:12","author":"Editor,Imogen Garfinkel","authors":["Editor","Imogen Garfinkel"],"language":"en","category":"politics","source_country":"gb","sentiment":0.136},{"id":358716104,"title":"Justice Barrett addresses public's 'disconnect' with court ahead of book release","text":"Supreme Court Associate Justice Amy Coney Barrett highlighted the \"disconnect\" between how the public perceives the Court and how it actually operates in a wide-ranging interview with \"Special Report\" on Monday. \"You know, we don't wear red and blue,\" Barrett told Fox News anchor Bret Baier. \"We all wear black because judges are nonpartisan.\" AMY CONEY BARRETT DETAILS BATTLE BETWEEN HER OWN PERSONAL VIEWS AND THE LAW IN NEW BOOK Barrett, who was appointed by President Donald Trump in 2020 and has served for nearly five years on the nation’s highest court, explained why she decided to write her upcoming book \"Listening to the Law: Reflections on the Court and Constitution.\" People across all groups have asked Barrett the \"same questions,\" she said. \"How did this court get its cases? How does the Court decide cases? Do the justices get along?\" \"And I can't answer all of those questions one on one,\" Barrett continued. \"But I can write a book so people can find the answers, if they're interested.\" While the Trump-appointee aims to answer common questions she hears, she maintained what is \"popular\" with the public does not influence her judicial opinions. JUSTICE BARRETT DEFENDS JACKSON JABS AS ‘WARRANTED’ IN RARE PUBLIC APPEARANCE \"The point I try to convey in the book is that you have to follow the law where it leads, even if it leads in a place where the majority of people don't want you to go,\" Barrett said. The Constitution \"trumps\" all written laws, Barrett argued. Barrett echoed her originalist philosophy as she went on to address criticism of the controversial Dobbs ruling that overturned the constitutional right to an abortion. The Dobbs decision is misunderstood, she argued. \"Dobbs did not say that abortion is illegal,\" Barrett stated. \"Dobbs didn't weigh in on that question. Dobbs said it belongs to the political process. And, you know, it's been thrown to the political process, and the states have been working it out.\" When asked about her Catholic faith, something that has drawn criticism since her nomination hearing in the Senate, Barrett broadened the conversation to include all \"deeply held moral commitments\" a judge can hold. JUSTICE BARRETT OPENS UP ABOUT 'AWKWARD' START ON SCOTUS, SHADOW DOCKET AND MORE IN FORTHCOMING MEMOIR \"Whether you are pro-choice because you think you're a secular humanist, but you think it is a fundamental moral right of a woman to terminate a pregnancy, or whether you're a person of faith who is pro-choice because you believe the same or you are a person of faith who is pro-life,\" Barrett began. \"Everyone, every single judge, every single person has more commitments. And I just don't think it matters from where those commitments come, they all must be put aside if one is to judge.\" Barrett’s book, which explores the court’s processes and relationships between judges in greater detail, is set to release Tuesday, Sept. 9. CLICK HERE TO GET THE FOX NEWS APP","summary":"Supreme Court Associate Justice Amy Coney Barrett explains why she wrote her new book and defines the &apos;disconnect&apos; in how the public perceives the Supreme Court on &apos;Special Report.&apos;","url":"https://www.foxnews.com/media/justice-barrett-addresses-publics-disconnect-court-ahead-book-release","image":"https://static.foxnews.com/foxnews.com/content/uploads/2020/10/AP20287474670775-e1602597484897.jpg","video":"https://www.foxnews.com/video/6378847517112","publish_date":"2025-09-09 00:30:47","author":"Stephanie Samsel","authors":["Stephanie Samsel"],"language":"en","category":"politics","source_country":"us","sentiment":0.113},{"id":358710786,"title":"India News | Stage Set for Vice Presidential Polls; NDA, Oppn Parties Hold Meetings","text":"New Delhi [India], September 9 (ANI): Stage is set for Vice Presidential contest on Tuesday with NDA expressing confidence of victory of its candidate CP Radhakrishnan and opposition parties rallying in support for their candidate Justice B Sudershan Reddy.\nBoth the BJP-led National Democratic Alliance and opposition parties held mock-polls ahead of the crucial day, telling the MPs to be cautious in exercising their franchise lest their vote gets invalid.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nPrime Minister Narendra Modi on Monday said that the candidature of CP Radhakrishnan has generated immense enthusiasm all across and people believe he will be an excellent Vice President.\n\"Participated in the NDA meeting in Delhi, attended by MPs across the NDA family. The candidature of Thiru CP Radhakrishnan has generated immense enthusiasm all across. People believe that he will be an excellent Vice President, who will enrich the office with his wisdom and insights,\" he said in a post on X.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Monday expressed confidence that NDA's Vice Presidential candidate CP Radhakrishnan will get more votes that the strength of the ruling alliance, saying many MPs are thinking of voting for him in the election on Tuesday.\n\"There will be secret voting. CP Radhakrishnanji will get more support from the MPs than the votes from the NDA. Many MPs are thinking of voting for Radhakrishnan ji, and it is in the national interest that a very good person with nationalist ideology becomes the Vice President of our country,\" Rijiju told mediapersons here.\nAnswering a query, he said even one vote going waste is a huge loss.\n\"So last time we have seen few invalid votes. So the Prime Minister has appealed that not a single vote should be invalid or any vote should go wastage. All MPs are very particular about their voting rights\" he said.\nPM Modi addressed NDA MPs ahead of the Vice Presidential election at a meeting here.\n\"It was a very good meeting. All MPs of the Rajya Sabha and the Lok Sabha met together, and PM Modi also guided them. Prime Minister expressed his happiness about the important bills that have been passed in the Parliament recently and also said that people should be informed about such important bills in the true sense... For a self-reliant India, NDA leaders have been called upon to play a leadership role,\" Rijiju said.\n\"There are elections tomorrow, so in such an environment, this was a good opportunity. All the NDA MPs met and the suggestions and guidance given by the Prime Minister to us today, all the MPs listened to this very carefully and after the Vice President's election, they will take this message to their respective areas,\" he added.\nINDIA bloc held a mock drill to reduce the risk of invalid ballots.\nShiv Sena (UBT) MP Anil Desai said all important issues were considered for tomorrow's Vice Presidential election. \"The entire opposition is united. A mock poll was conducted for the Vice Presidential election.. even small details were explained so that no mistake happens,\" he told ANI later. A BJP leader said that the NDA candidate is expected to garner at least 427 votes. Congress leaders expressed confidence that the opposition candidate will get over 324 votes.\nBiju Janata Dal (BJD) has decided to abstain from the Vice Presidential elections.\n\"Biju Janata Dal has decided to abstain from the vice presidential elections tomorrow. The Biju Janata Dal remains equidistant from both the NDA and INDIA alliances. We are focused on the development and welfare of Odisha and 4.5 crore people of Odisha,\" party leader Sambit Patra said. BRS working president KT Rama Rao (KTR) also announced that the party will not take part in the Vice Presidential polls\n\"For the last 20 days, BRS has been warning both state and central governments about the shortage of urea. Yet they have failed to respond. As a mark of protest and in solidarity with 71 lakh Telangana farmers, BRS has decided not to participate in the Vice President election. If NOTA was an option, we would have chosen it,\" he said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Stage is set for Vice Presidential contest on Tuesday with NDA expressing confidence of victory of its candidate CP Radhakrishnan and opposition parties rallying in support for their candidate Justice B Sudershan Reddy.","url":"https://www.latestly.com/agency-news/india-news-stage-set-for-vice-presidential-polls-nda-oppn-parties-hold-meetings-7101086.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908161100.jpg","video":null,"publish_date":"2025-09-09 00:30:27","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.171},{"id":358713524,"title":"Indian AI startups run into US visa hurdle","text":"Aravind Jayendran, cofounder of agentic AI startup LatentForce, needs to be in the US within the next three months for key client meetings, but is struggling with the visa situation. Like many executives in the AI startup space, he is trying to figure out how to ensure a B1/B2 visa in time for the trip, as the appointment wait time ranges from three-and-a-half to nine months in India.Siddhant Mohan, whose company Qodex focuses on API testing and security, has a B1/B2 visa but is now looking to apply for O-1, a specialty non-immigrant visa, as he is spending an average of close to six months a year in the US as his startup scales up. “We are seeing that getting O-1 is harder than before as denial rates have increased,” he said.Indian AI startups, which are moving to the US in droves to be close to the epicentre of AI developments, are running into immigration issues as the Donald Trump administration tightens visa rules across categories, restricting access and increasing administrative burdens.“As a startup, we are already facing multiple challenges and this is yet another that we need to deal with now,” Jayendran said.Several startup founders and investors ET spoke with said it is crucial for them to be physically present in the US since it is a key—often the largest—market for them. Immigration challenges under the Trump administration will likely impact their business and they are also recalibrating their hiring strategy, founders and investors said.In the past year, multiple Indian founders, from companies like Composio, Smallest.ai and Atomicwork, moved to the US in order to be closer to their largest customer base and tap into the talent ecosystem as generative AI grows at a rapid pace. The US is also where the largest amount of venture capital investments is going into AI startups.It is vital for these companies to be in the US, investors told ET.“There is a limit as to how much we can do online. For example, we have met all our customers in person and then closed the deal. If you cannot do that, it makes you handicapped as you are not getting sales,” LatentForce’s Jayendran said. ETtech\n Changes under Trump IIA Bengaluru-based investor told ET that getting a visa is now a huge hurdle, whether it is B1/B2 for business and leisure or the O-1 specialty occupation visa, which is for people with extraordinary ability in areas such as science, arts, or business. For many Indian founders, O-1 is a preferred route for migrating to the US to set up shop.The number of Indians applying for O-1 visas has seen a significant rise in the last three years. While the number of visa approvals has increased to 1,375 in FY24 from 210 in 2018, the denial rate has been on the rise, too. According to data from the US Citizenship and Immigration Services, overall the denial rate of O-1 has increased from 4.5% in FY23 to 5.8% in FY24.Joel Yanovich, attorney at Murthy Law Firm, said he has started to see stricter scrutiny of O-1 cases, which is causing delays.Some founders who were exploring countries like Vietnam and Thailand to apply for a US visa, will now have to recalibrate. A founder, who was looking at multiple options including overseas said, that that option is no longer available, as the US Department of State said people can apply only from the country they are a resident or citizen of.Shift in hiringWith visas becoming an issue, companies are also looking to change their hiring strategy.Himanshu Tyagi, cofounder of Sentient Labs which has set up a research and development centre in San Francisco, said most of the people his company hires in the US are PhD researchers. While they are not all from India, this is a concern. “We are seeing that the researchers might run into visa issues within months of hiring. The Optional Practical Training (OPT) clause, which allowed fresh graduates to work in the US till they moved to a work visa category, is facing potential elimination,” he said.Earlier OPT allowed students on an F-1 student visa to stay in the country for two years, giving them time to apply for H-1B. This rule is now facing elimination under Trump.Also Read: H-1B aspirants brace for longer waits, denials“But there is no alternative to hiring PhD candidates because AI is a space that is hyper focused on research. The only other option is to hire local talent, which is extremely expensive, and we cannot even wait since time is of essence when it comes to AI,” he said.With the Trump administration looking to increase the wage criteria for employment visas, Mohan, who was cited earlier, said his company is recalibrating its US hiring strategy. While the company will hire local talent for business development roles, it is not looking to hire fresh engineering graduates in the US (often Indian students after completing education in the US). “We will be hiring more engineers in our offices in India instead of the US,” he said.","summary":"Indian AI startups are increasingly relocating to the US to capitalise on the booming AI sector, but face growing immigration hurdles due to tightened visa rules under the Trump administration.","url":"https://economictimes.indiatimes.com/tech/technology/indian-ai-startups-run-into-us-visa-hurdle/articleshow/123772563.cms","image":"https://img.etimg.com/thumb/width-1200,height-900,imgsize-2901866,resizemode-75,msid-123772563/tech/technology/indian-ai-startups-run-into-us-visa-hurdle.jpg","video":null,"publish_date":"2025-09-09 00:30:00","author":"Swathi Moorthy","authors":["Swathi Moorthy"],"language":"en","category":"politics","source_country":"in","sentiment":-0.286},{"id":358716220,"title":"Epstein Files Bombshell: New Docs Reveal CIA Ties, Early Connection To Ghislaine Maxwell","text":"The House Oversight Committee has released a four-part document dump from Jeffrey Epstein’s estate, including a 50th birthday letter book filled with handwritten notes and letters from high-profile associates. Among the most shocking revelations are claims suggesting Epstein may have worked for the CIA and details about his early connection to Ghislaine Maxwell. Epstein 'Works for the CIA' One page features a photo of Epstein in a suit beside an unidentified individual, accompanied by a handwritten caption that reads, “He is the boyfriend of [redacted]. We think he works for the CIA.” The redacted name and the direct CIA reference have reignited speculation about Epstein’s mysterious wealth and long-standing protection from legal consequences. Though unverified, the note adds to persistent rumors of Epstein’s ties to intelligence services. Also read: Epstein Knew Ghislaine as a Teenager Another notable letter, written by Elliot Wolk, states that Epstein worked for media mogul Robert Maxwell, Ghislaine’s father, in the mid-1970s, long before their publicly known relationship began. The message reads, “Jeffrey, I remember in the mid-1970s you being a star salesman for our tax-advantaged strategies... Was that when you first discovered the Maxwell teen-age daughter... Happy Birthday.” This suggests Epstein may have known Ghislaine since she was a teenager, well before their documented involvement and criminal partnership. Robert Maxwell died under mysterious circumstances in 1991. Several conspiracy theories suggest that Jeffrey Epstein was an intelligence asset, possibly working for Israeli intelligence, and that he may have been recruited by Robert Maxwell, who himself has long been suspected of ties to Mossad. While no official confirmation has ever been provided to substantiate these claims, documents like the recently released handwritten note referencing the CIA, along with other cryptic messages and unexplained associations, have continued to fuel speculation. The lack of transparency around Epstein’s finances, immunity from prosecution for years, and deep connections to powerful figures have only kept these theories alive. Birthday Book Signed by Trump, ClintonThe birthday book also includes messages from public figures like President Donald Trump, former President Bill Clinton, and acclaimed lawyer Alan Dershowitz, each of whom contributed personal notes to Epstein. One of the letters allegedly signed by Trump has sparked additional controversy, with questions swirling around its authenticity. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"The House Oversight Committee released new documents from Epstein’s estate, including a birthday book with claims he worked for the CIA and knew Ghislaine Maxwell as a teen. Theories of Epstein as an intelligence asset are well-known. The book also includes notes from Trump, Clinton, and Dershowitz, sparking renewed controversy.","url":"https://www.timesnownews.com/world/us/us-news/epstein-files-bombshell-new-docs-reveal-cia-ties-early-connection-to-ghislaine-maxwell-article-152734286","image":"https://images.timesnownews.com/thumb/msid-152734292,thumbsize-1002645,width-1280,height-720,resizemode-75/152734292.jpg","video":null,"publish_date":"2025-09-09 00:29:13","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":0.114},{"id":358715682,"title":"QUENTIN LETTS: Did Keir give Maria the boot because he was too terrified to sack her sister?","text":"Eager to assert her tough-guy credentials, new Home Secretary Shabana Mahmood welcomed counterparts from the 'Five Eyes' alliance.\n\nStanding outside the Honourable Artillery Company in London, Ms Mahmood eagerly shook hands with Donald Trump's gun-toting homeland security minister, a dog killer.\n\nKristi Noem is a former governor of South Dakota who shot dead the family pet, a pooch named Cricket, after it tried to nip her.\n\nGiven Sister Noem's propensity for putting a bullet between the ears of sad-eyed mutts, it was perhaps just as well that Yvette Cooper was no longer chairing the event. Yvette could get a little bitey sometimes. We might have had a diplomatic incident – if not an awkward homicide – on our hands.\n\nThe Five Eyes alliance allows us to share security secrets with Australia, Canada, New Zealand and the US. David Cameron used to observe that the organisation should more accurately be called 'Ten Eyes', given that most participants have two eyeballs. Mind you, I once edited a diary column on which we had five reporters but only eight working headlights, two of our chaps being down to one jelly each. Story for another day, perhaps.\n\nBack to politics. Vertically challenged Ms Mahmood, who came up roughly to Ms Noem's gun belt, greeted the dog murderer in bright sunshine. Ms Mahmood gushed words of greeting (these did not, one assumes, include 'woof-woof').\n\nThe police sniffer dogs that are normally evident at such tightly guarded events were nowhere to be seen. They seemed to have scarpered. And who could blame them?\n\nMs Mahmood used the summit to claim that she and her colleagues were looking at putting visa pressure on Third World countries to take back illegal migrants.\n\nThis was something a former Conservative Home Secretary, Priti Patel, legislated for, to great yowls from Labour. Now Ms Mahmood, pointy chin gleaming, was presenting it as a sign of her own rigour. Given how keen she is on castration, migrants might accept repatriation as a softer option.\n\nWestminster was still recovering from last Friday's ministerial slaughter. Angela Rayner was nowhere to be seen. Where Lucy Powell used to sit there was just emptiness. No change there, then.\n\nBut Maria Eagle had turned up to defence questions. Good for her. Ms Eagle was axed as defence procurement minister last week, her duties passing instead to clean-behind-the-ears Luke Pollard. He pronounces 'missiles' as 'missals'. Not quite the same thing, dear.\n\nMiss Eagle is the twin of Angela Eagle, who is also a Labour MP and had a similarly rotten day on Friday when she was demoted from the Home Office to Environment. One assumes her responsibilities there will include keeping an eye on field mice, voles and similar tasty morsels.\n\nMaria is the less frightening – dare one say, the more soignee? – of the Eagle gals. It is not impossible that Sir Keir Starmer was terrified of giving Angela the boot and picked instead on poor Maria, who had done nothing particularly wicked at Defence.\n\nThere she sat on the backbenches, looking even more glum than usual. A Conservative, Sir Julian Smith, ambled over to pat her on the shoulder and whisper some kindly words. Miss Eagle looked rather pop-eyed. Almost tearful. It can be a beastly game, politics.\n\nWinners looked ecstatic. Mike Tapp, a new Home Office minister, was beaming as he took his front bench seat. He had donned a pair of red socks for the occasion. A senior colleague asked for a glass of water and Mr Tapp dropped the beaker. A leaky Tapp. But smooth. Not a line on his forehead. Kim Kardashian has more wrinkles.\n\nAlso v. pleased with himself was Stephen Morgan, who has escaped the clutches of Scary Bridget Phillipson at Education and been made a Whip. And the new border security minister, Alex Norris, stood behind the Speaker's Chair. He was previously one of Angela Rayner's underlings at Local Government. He appeared to have cast aside his grief at her downfall. Couldn't stop laughing.","summary":"Eager to assert her tough-guy credentials, new Home Secretary Shabana Mahmood welcomed counterparts from the 'Five Eyes' alliance.","url":"https://www.dailymail.co.uk/debate/article-15078345/QUENTIN-LETTS-Did-Keir-Maria-boot-terrified-sack-sister.html","image":"https://i.dailymail.co.uk/1s/2025/09/08/21/101954391-0-image-a-8_1757362505429.jpg","video":null,"publish_date":"2025-09-09 00:28:56","author":"Editor,Quentin Letts","authors":["Editor","Quentin Letts"],"language":"en","source_country":"gb","sentiment":-0.148},{"id":358710766,"title":"India News | India's Unemployment Rate is 2 % According to World Economic Forum, Making It Lowest Among G20 Nations: Dr Mansukh Mandaviya","text":"New Delhi [India], September 9 (ANI): Quoting the World Economic Forum's 'The Future of Jobs Report 2025', the Union Minister for Labour & Employment and Youth Affairs & Sports Dr Mansukh Mandaviya stated that India's unemployment rate is 2 per cent, which is the lowest among the G20 nations. He highlighted how employment generation has taken place across sectors in tandem with India's rapid economic growth, and underlined the enabling government schemes that have contributed towards the same, said the Ministry of Labour & Employment.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nThe Union Minister was addressing the gathering in New Delhi at the signing of Memorandums of Understanding (MoU) between the Ministry of Labour & Employment and 'Mentor Together' and 'Quikr' for enhancing employment opportunities as well as youth employability on the National Career Service (NCS) Portal.\nThe MoU was signed in the presence of Union Minister for Labour & Employment, Dr. Mansukh Mandaviya and Union Minister of State for Labour & Employment, Sushri Shobha Karandlaje.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nIn his address, Dr. Mandaviya said, \"The National Career Service (NCS) platform, with nearly 52 lakh registered employers, 5.79 crore job seekers and over 7.22 crore vacancies mobilised, is now evolving to offer not just job listings, but as a one-stop solution for all employment-related services. Currently, there are over 44 lakh active vacancies on the portal. Over the past year, the Ministry has signed MoUs with ten key organisations, including Amazon and Swiggy. These partnerships have already mobilised nearly five lakh vacancies.\"\nHighlighting the Government's renewed focus on youth, Dr Mandaviya recalled that, at the very start of its third term, Prime Minister Narendra Modi had announced a package of five flagship schemes with a total budget of Rs 2 lakh crore to support employment, skilling, and opportunities for 4.1 crore youth. A key highlight of this package is the Pradhan Mantri Viksit Bharat Rozgar Yojana (PM-VBRY), with an allocation of ₹99,446 crore, aimed at incentivising the creation of over 3.5 crore jobs in two years, of which 1.92 crore will benefit first-time entrants to the workforce.\nThe Minister further underscored the importance of employment creation through the growth of services, manufacturing, and agriculture, noting that the Government has launched transformative schemes such as MUDRA and PM SVANidhi to promote self-employment and entrepreneurship. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Quoting the World Economic Forum's 'The Future of Jobs Report 2025', the Union Minister for Labour &amp; Employment and Youth Affairs &amp; Sports, Dr Mansukh Mandaviya stated that India's unemployment rate is 2 per cent, which is the lowest among the G20 nations, said a statement from Ministry of Labour and Employment on Monday.","url":"https://www.latestly.com/agency-news/india-news-indias-unemployment-rate-is-2-according-to-world-economic-forum-making-it-lowest-among-g20-nations-dr-mansukh-mandaviya-7101084.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908210556.jpg","video":null,"publish_date":"2025-09-09 00:28:27","author":null,"language":"en","source_country":"in","sentiment":-0.243},{"id":358710762,"title":"India News | Army, Navy Conducted High-Altitude Combat Diving Training in Sikkim at 17,000 Feet","text":"Kolkata (West Bengal) [India], September 9 (ANI): A joint Scuba and Combat Diving Exercise was conducted by the Indian Army PARA (Special Forces) and the Indian Navy MARINE COMMANDOS (MARCOS) in Sikkim at an altitude of 17,000 feet, from 30 August to 5 September, said a press release from Defence PRO on Monday. During the training, participants carried out open circuit air diving, closed circuit pure oxygen diving, dives up to a depth of 17 metres in extreme cold-water conditions, and combat night diving.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nConducted amidst treacherous terrain and freezing waters, the exercise showcased the exceptional professionalism, adaptability and courage of the Special Forces of the Indian Army and the elite Marine Commandos of the Indian Navy. The high-altitude environment added unique challenges, reinforcing operational readiness and expanding the limits of combat diving capability.\nSuch training is essential to prepare soldiers for future battlefields where unpredictability is the only constant. Operating in rarefied high-altitude conditions, executing precision tasks in freezing waters, and integrating combat diving into joint operations strengthens resilience and versatility. Exercises of this nature also enhance jointmanship between the Services, sharpen specialised combat skills, and ensure that India's elite forces remain mission-ready across diverse terrains--from the high Himalayas to the deep seas.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nSpeaking on the occasion, the Team Commander stated, \"Training in these extreme conditions tests every aspect of a soldier's endurance, skill and mental strength. It ensures that when called upon, our teams can operate effectively in any environment, no matter how harsh or demanding. This exercise reflects the spirit of jointmanship and the commitment of our elite forces to remain prepared for every challenge.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.   A joint Scuba and Combat Diving Exercise was conducted by the Indian Army PARA (Special Forces) and the Indian Navy MARINE COMMANDOS (MARCOS) in Sikkim at an altitude of 17,000 ft, from 30 August to 5 September, said a press release from Defence PRO on Monday.","url":"https://www.latestly.com/agency-news/india-news-army-navy-conducted-high-altitude-combat-diving-training-in-sikkim-at-17000-feet-7101082.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908202315.jpg","video":null,"publish_date":"2025-09-09 00:26:27","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.404},{"id":358710768,"title":"World News | India-New Zealand Hold Wide-ranging Discussions on Defence, Trade During Foreign Office Consultations","text":"New Delhi [India], September 9 (ANI): India and New Zealand held the Foreign Office Consultations here in the national capital on Monday, focused on several aspects of the bilateral relationship such as defence, trade and education, the Ministry of External Affairs (MEA) said on Monday. Sharing the details in a post on X, the MEA said that the Foreign Office Consultations were led by Secretary (South) Neena Malhotra and Deputy Secretary (Asia Group & Americas) Grahame Morton. Also Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nMEA underscored that the consultations reaffirmed the commitment to deepen ties and continue with the momentum of high-level exchanges. \"India-New Zealand Foreign Office Consultations led by Secretary (South) Dr. Neena Malhotra and Deputy Secretary (Asia Group & Americas) Mr. Grahame Morton, were held today in New Delhi. Discussions covered the entire gamut of - bilateral relations, including defence, trade, education, sports, mobility, customs and people-to-people ties. The consultations reaffirmed commitment to deepen the - partnership and continue the momentum of recent high-level exchanges\", MEA said on X. Also Read | 'Black Day for Nepal' Says Manisha Koirala Amid Ongoing Gen Z Protest Against Social Media Ban.\nhttps://x.com/MEAIndia/status/1965080866297717079\nThe visit comes after, in August this year, Union Minister of State for Defence, Sanjay Seth, met New Zealand Defence Ministry's Head of International Branch, Kathleen Pearce, in New Delhi, reaffirming commitment to deepen cooperation across key strategic domains.\nThe Second Round of negotiations for the India-New Zealand Free Trade Agreement (FTA) concluded successfully on July 25 in New Delhi, further advancing the shared objective of strengthening bilateral trade and economic partnerships.\nAccording to a previous statement by the Ministry of Commerce, the Third Round of negotiations is scheduled to be held in New Zealand in September 2025. The intersessional virtual meetings will maintain the forward trajectory set in the second round.\nIndia's bilateral merchandise trade with New Zealand reached USD 1.3 billion in FY 2024-25, recording a growth of 48.6 per cent over the previous financial year, signalling the growing potential of the economic partnership, the statement by the Ministry of Commerce highlighted. It further noted that the FTA is expected to enhance trade flows, support investment linkages, promote supply chain resilience, and establish a predictable and enabling environment for businesses in both countries.\nIndia and New Zealand have historically shared close and cordial ties. Similarities such as membership of the Commonwealth, common law practices and pursuing shared aspirations of achieving economic development and prosperity through democratic governance systems for diverse communities in both countries provide an excellent backdrop for deepening the friendly ties, according to the Ministry of External Affairs. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  India and New Zealand held the Foreign Office Consultations here in the national capital on Monday, focused on several aspects of the bilateral relationship such as defence, trade and education, the Ministry of External Affairs (MEA) said on Monday.","url":"https://www.latestly.com/agency-news/world-news-india-new-zealand-hold-wide-ranging-discussions-on-defence-trade-during-foreign-office-consultations-7101080.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908202147.jpg","video":null,"publish_date":"2025-09-09 00:24:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.116},{"id":358713080,"title":"'The one thing Donald Trump cannot undo': Former RNC chair says VP tainted by Epstein","text":"Attorney and former Republican National Committee chairman Michael Steele said Monday the more Vice President JD Vance is forced to defend President Donald Trump over the latter's relationship with convicted child predator Jeffrey Epstein, the more difficult it would harm his potential presidential campaign.\n\nDuring a Monday segment on MSNBC, Steele said, \"...that relationship becomes a part of his story, too, because you defended a guy who was friends with a pedophile. Now try that in a sentence and see how it works when you're running for office.\"\n\n\"That's the one thing Donald Trump cannot undo,\" he said of Trump's relationship with Epstein.\n\nREAD MORE: 'Deranged psychopath': Experts sound alarm over Trump's 'green light' of domestic violence\n\n\"And so, I think that there's a lot, a lot more here to unpack, depending on how the stories play themselves out. But to me, that's what's so important about this, this moment, this, this pictorial of this relationship. I think we should be very fearful of someone like JD Vance and Peter Thiel because Donald Trump is an empty vessel.\"\n\nLucy Caldwell, a former Republican strategist, also spoke during the segment and said of Trump, \"He's an extremely dangerous, empty vessel. But he's a shapeshifter, right? It's part of how he can go about the Epstein incident in this way. \n\nShe added: “JD Vance is a person who is is a shapeshifter in a different way, in a more pernicious way, but has a long term plan for this country that is very well thought out and very articulate and very, very frightening. And so I think the more that we can attach people like Peter Thiel and JD Vance to the story of Donald Trump, the better.\"\n\nShe further said that Trump is not likely to come out of the scandal \"unscathed.\"\n\nREAD MORE: 'Now this is bromance': Social media erupts over Trump's 'explicit love letter' to Epstein\n\nThe Wall Street Journal ignited a firestorm Monday by releasing images of a sexually suggestive birthday message allegedly penned by Trump to convicted sex offender Jeffrey Epstein back in 2003.\n\nThe note, reportedly part of a birthday tribute book marking Epstein’s 50th birthday, includes a nude sketch in which Trump’s signature is stylized as pubic hair. Trump denied signing the letter.\n\nWatch the video below or at this link.\n\n - YouTube www.youtube.com","summary":"Attorney and former Republican National Committee chairman Michael Steele said Monday the more Vice President JD Vance is forced to defend President Donald Trump over the latter's relationship with convicted child predator Jeffrey Epstein, the more difficult it would harm his potential presidential campaign.\n\nDuring a Monday segment on MSNBC, Steele said, \"...that relationship becomes a part of his story, too, because you defended a guy who was friends with a pedophile. Now try that in a sentence and see how it works when you're running for office.\"\n\n\"That's the one thing Donald Trump cannot undo,\" he said of Trump's relationship with Epstein.\n\nREAD MORE: 'Deranged psychopath': Experts sound alarm over Trump's 'green light' of domestic violence\n\n\"And so, I think that there's a lot, a lot more here to unpack, depending on how the stories play themselves out. But to me, that's what's so important about this, this moment, this, this pictorial of this relationship. I think we should be very fearful of someone lik","url":"https://www.alternet.org/trump-epstein-jd-vance/","image":"https://www.alternet.org/media-library/image.png?id=61568159&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-09-09 00:23:56","author":"Ailia Zehra","authors":["Ailia Zehra"],"language":"en","category":"politics","source_country":"US","sentiment":0.197},{"id":358715084,"title":"Monday, September 8. Russia’s War On Ukraine: News And Information From Ukraine","text":"KYIV, UKRAINE - SEPTEMBER 08: A view at a headquarters of Ukrainian government that was hit by a Russian \"Iskander-K\" cruise missile on September 7 during an overnight Russian attack in Kyiv, Ukraine, on September 8, 2025. (Photo by Danylo Antoniuk/Anadolu via Getty Images)\nAnadolu via Getty Images\n\nDispatches from Ukraine. Day 1,294.\n\nRussia Hits Government Building in Record Attack on Ukraine\n\nIn the early hours of Sept. 7, Russia executed the most intense aerial attack on Ukraine to date, discharging a salvo of 810 Shahed drones and decoys along with 13 missiles. Ukraine’s air defenses intercepted 747 drones and four cruise missiles, but all nine ballistic missiles penetrated defenses. The strikes hit multiple major cities across Ukraine, killing four people and injuring some 50 others.\n\nUkraine’s capital, Kyiv, bore the brunt of the overnight onslaught. In the government quarter, near the city’s historic center, a Russian ballistic missile struck the Cabinet of Ministers — the seat of Ukraine’s executive authority — for the first time. In the aftermath, Prime Minister Yulia Svyrydenko recorded a video message from the building’s shattered upper floors. Appearing visibly more emotional than usual, she appealed for greater international support to protect the people of Ukraine.\n\nMeanwhile, President Volodymyr Zelenskyy renewed his calls for a stronger international response. “The world can force the Kremlin criminals to stop the killings,” he wrote on X. “All that is needed is political will.” He noted that nearly half of the fired drones were decoys designed to deplete Ukraine’s defenses. In parallel, President Zelenskyy revealed that circa 150 of the Russian drones had been taken out by inexpensive interceptor drones.\n\nLarge-scale strikes have become a standard tactic for Moscow: overwhelm Ukraine’s air defenses by launching record numbers of drones at once. Russia had previously set a record in early July with 728 projectiles in one night. So far in September, Russian forces conducted two major airstrikes of 500 airborne weapons, with 2,147 drones dispatched in total.\n\nMORE FOR YOU\n\nIn addition to the large-scale strike on Sept. 7, Russian shelling killed at least 20 and wounded more than 50 civilians across Ukraine between Sept. 5 and 8. Hardest-hit was the eastern province of Donetsk with 10 civilian deaths and 20 injuries. Officials in northeastern Kharkiv oblast, or region, reported four fatalities and 14 wounded; in neighboring, central Dnipropetrovsk oblast, four individuals lost their lives, with 10 others injured. Southern Kherson province recorded two fatalities and six wounded.\n\nNew Threats of Additional Sanctions on Russia\n\nIn Washington, U.S. President Donald Trump said on Sept. 7 he is ready to increase sanctions on Moscow, but stressed that Europe must act first. When asked if he would move to the “second phase of sanctions on Russia,” he responded “yes.” Treasury Secretary Scott Bessent added that the White House is pushing Europe to act in unison. “If the U.S. and the EU do this together, we are in a race now between how long the Ukrainian military can hold up versus how long the Russian economy can hold up,” Bessent told NBC on Sept. 7.\n\nIn line with statements from other senior officials, U.S. Energy Secretary Chris Wright noted in an interview with the Financial Times that the U.S. would only escalate sanctions if European countries stopped purchasing Russian oil and gas. He emphasized that Russian fossil fuel exports are funding President Vladimir Putin’s “war machine” and urged Europe to buy American LNG and other energy products instead to meet the terms of the U.S.-EU trade deal, which calls for $750 billion in U.S. energy sales to Europe by 2028.\n\nWashington’s more aggressive posture regarding new sanctions on the Kremlin break from the pattern of recent weeks: even after negotiations reached a dead end in August, in many cases, U.S. officials had been warm in tone toward Russia and President Putin. European officials, by contrast, have consistently emphasized the need to ratchet up sanctions pressure.\n\nResponding to renewed unfavorable rhetoric from the U.S., the Kremlin insisted on Monday that no sanctions would ever compel Russia to alter its course on its war against Ukraine, even as the West signaled additional economic restrictions are under consideration. “No sanctions will be able to force the Russian Federation to change the consistent position that our president has repeatedly spoken about,” Kremlin spokesperson Dmitry Peskov said on Sept. 8.\n\nPeskov also dismissed Western penalties as “absolutely useless in terms of exerting pressure on Russia,” while emphasizing that Moscow prefers to pursue its objectives through political and diplomatic channels, a path blocked, in its view, by Europe and Kyiv.\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Dispatches from Ukraine. Day 1,294.","url":"https://www.forbes.com/sites/katyasoldak/2025/09/08/monday-september-8-russias-war-on-ukraine-news-and-information-from-ukraine/","image":"https://imageio.forbes.com/specials-images/imageserve/68bf6ed4dc007526595fa369/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-09-09 00:22:56","author":"Forbes Staff,Katya Soldak","authors":["Forbes Staff","Katya Soldak"],"language":"en","category":"politics","source_country":"US","sentiment":-0.077},{"id":358710770,"title":"India News | Candidature of CP Radhakrishnan for Vice President Has Generated Immense Enthusiasm: PM Modi","text":"New Delhi [India], September 9 (ANI): Prime Minister Narendra Modi on Monday said that the candidature of CP Radhakrishnan has generated immense enthusiasm, and people believe he will be an excellent Vice President.\n\"Participated in the NDA meeting in Delhi, attended by MPs across the NDA family. The candidature of Thiru CP Radhakrishnan has generated immense enthusiasm all across. People believe that he will be an excellent Vice President, who will enrich the office with his wisdom and insights,\" he said in a post on X.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Monday expressed confidence that NDA's Vice Presidential candidate CP Radhakrishnan will get more votes than the strength of the ruling alliance, saying many MPs are thinking of voting for him in the election on Tuesday.\n\"There will be secret voting. CP Radhakrishnanji will get more support from the MPs than the votes from the NDA. Many MPs are thinking of voting for Radhakrishnan ji, and it is in the national interest that a very good person with nationalist ideology becomes the Vice President of our country,\" Rijiju told mediapersons here.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nAnswering a query, he said even one vote going waste is a huge loss.\n\"So last time we have seen few invalid votes. So the Prime Minister has appealed that not a single vote should be invalid or any vote should go wastage. All MPs are very particular about their voting rights\" he said.\nPM Modi addressed NDA MPs ahead of the Vice Presidential election at a meeting here.\n\"It was a very good meeting. All MPs of the Rajya Sabha and the Lok Sabha met together, and PM Modi also guided them. Prime Minister expressed his happiness about the important bills that have been passed in the Parliament recently and also said that people should be informed about such important bills in the true sense... For a self-reliant India, NDA leaders have been called upon to play a leadership role,\" he said.\n\"There are elections tomorrow, so in such an environment, this was a good opportunity. All the NDA MPs met and the suggestions and guidance given by the Prime Minister to us today, all the MPs listened to this very carefully and after the Vice President's election, they will take this message to their respective areas,\" he added.\nRijiju said that PM Modi was not referring to any country as he laid stress on the need for the country to make its way up through self-reliance.\nThe Union Minister said PM Modi indicated that some challenges will emerge as India takes its place on the global high table and self-reliance for the country to move forward.\nSources said PM Modi urged NDA MPs to lay thrust on Swadeshi and suggested that they organize 'Swadeshi Mela\" and encourage people to purchase Make in India products during the festival season. He also urged them to hold meetings with traders to explain the impact of GST reforms.\nThey said that PM Modi indicated that GST rate cuts have triggered a \"lehar\" (wave) and there is need to build on it. They also said that PM Modi cited an example and is learnt to have said that a vehicle also has to have air in its tyres to be able to take advantage of a burst of wind.\nThe MPs of NDA were apprised of the voting process during mock poll held on Monday. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Prime Minister Narendra Modi on Monday joined the National Democratic Alliance (NDA) meeting in Delhi, where Members of Parliament from across the NDA expressed strong support for C.P. Radhakrishnan's candidature for Vice President.","url":"https://www.latestly.com/agency-news/india-news-candidature-of-cp-radhakrishnan-for-vice-president-has-generated-immense-enthusiasm-pm-modi-7101078.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908194841.jpg","video":null,"publish_date":"2025-09-09 00:22:28","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.314},{"id":358715466,"title":"B.C. residents reduce trips to U.S. for seventh straight month (BC)","text":"New data show B.C. drivers travelled less through major Washington state border crossings on a year-over-year basis for the seventh straight month.\n\nThis comes amid economic uncertainty created in part from U.S. President Donald Trump imposing 35 per cent tariffs on Canadian products that fall outside the Canada-U.S.-Mexico Agreement, 25 per cent tariffs on steel and aluminum and raised duties of 35.19 per cent on softwood lumber.\n\nTrump has also been dismissive of Canadian sovereignty, suggesting that Canada should join the U.S. \n\nData from the Cascade Gateway Border Data Warehouse tracks southbound traffic by vehicles with B.C. licence plates at four land-border crossings and found 149,915 B.C. passenger vehicles crossed into the U.S. in August. That is down 39 per cent from the 246,017 such drivers who made those trips in August 2024, according to the data. \n\nThat follows year-over-year monthly declines in that traffic of:\n\n 28 per cent in July;\n\n 43 per cent in June;\n\n 47 per cent in May;\n\n 51 per cent in April;\n\n 43 per cent in March; and\n\n 29 per cent in February.\n\nThe Cascade Gateway Border Data Warehouse data covers the Peace Arch, Pacific Highway, Sumas and Lynden points of entry.\n\nThe last time that there was a monthly increase in southbound traffic by B.C.-plated passenger vehicles across those Washington state crossings was in January, when 158,766 such vehicles made those trips. That was up about 10 per cent from 144,066 such southbound vehicles in January 2024, according to the Cascade Gateway Border Data Warehouse.\n\nOther ways of tracking Canadian visits to the U.S. similarly show reduced travel.\n\nThe Vancouver Airport Authority on Monday afternoon released data showing that passenger counts on flights to or from the U.S. in July were down 2.2 per cent, to 686,431, compared with July 2024. \n\nAiralo, which sells eSIM cards for electronic devices, released a report Monday showing trends in eSIM purchases by Canadians in the U.S. in the May 1 through Aug. 15 period.\n\nThat report described a \"sharp decline\" in those sales, compared with the same time period in 2024, although its data show that the U.S. remained the top summer destination for Canadian travellers in that time period. \n\n\"Its sheer convenience, variety of experiences, and strong cross-border ties kept it in the lead — even as more Canadians looked further afield to Europe and Asia for their vacations,\" the report said.\n\nAirline executives through much of this year have discussed pivoting some flight capacity out of the U.S. and onto more domestic Canadian routes. \n\nFlair Airlines CEO Maciej Wilk, for example, told BIV in late July that this has been the case for his carrier, although it continues to find strong demand for some U.S. routes.\n\n“We suspended Palm Springs and Phoenix, but we're still flying to Fort Lauderdale, to Orlando, to Los Angeles and to San Francisco, so all of those destinations are staying,\" he said.","summary":"New data show B.C. drivers travelled less through major Washington state border crossings on a year-over-year basis for the seventh straight month. This comes amid economic uncertainty created in part from U.S. President Donald Trump imposing 35 per cent tariffs on Canadian products that fall outsid...","url":"https://www.castanet.net/news/BC/571213/B-C-residents-reduce-trips-to-U-S-for-seventh-straight-month","image":"https://www.castanet.net/content/2025/9/glacier_168702_p.jpg","video":null,"publish_date":"2025-09-09 00:21:00","author":"Contributed,Glen Korstrom","authors":["Contributed","Glen Korstrom"],"language":"en","source_country":"ca","sentiment":-0.199},{"id":358710778,"title":"India News | Fire Erupts at Oil Warehouse in Indore's Palda Industrial Area","text":"Indore (Madhya Pradesh) [India], September 9 (ANI): A fire broke out in an oil warehouse located in the Palda industrial area of Indore on Monday night, prompting a swift response from the fire department.\nMultiple fire tenders have been rushed to the site, and efforts are currently underway to bring the blaze under control.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nSharing details, Fire Brigade Sub-Inspector Shiv Narayan Sharma says, \"A Huge fire was seen. A total of 5 fire tenders were deployed to douse the fire as the fire was going out of control... The fire has been controlled as of now... Only 5% of the work of controlling the fire is left, which will be completed after the removal of shed...\" More details awaited. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  A fire broke out in an oil warehouse located in the Palda industrial area of Indore on Monday night, prompting a swift response from the fire department.","url":"https://www.latestly.com/agency-news/india-news-fire-erupts-at-oil-warehouse-in-indores-palda-industrial-area-7101076.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908192744.jpg","video":null,"publish_date":"2025-09-09 00:20:27","author":null,"language":"en","source_country":"in","sentiment":-0.723},{"id":358710764,"title":"India News | Death Toll in Punjab Due to Floods Goes Up to 51","text":"Chandigarh (Punjab) [India], September 9 (ANI): The flood situation in Punjab has worsened, with the death toll rising to 51, according to the Department of Information and Public Relations, Punjab. On Sunday, the death toll was at 46.\nThe heavy monsoon rains over the past week have caused rivers to swell and inundated several districts across the state, leaving thousands affected and prompting large-scale relief operations.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nMeanwhile, Prime Minister Narendra Modi will visit Himachal Pradesh and Punjab on Tuesday to review the flood-related situation. He will undertake an aerial survey of the flood and landslide-hit areas in Himachal Pradesh.\nAt around 1:30 PM, he will reach Kangra, Himachal Pradesh, where he will meet officials and chair a high-level review meeting on the situation. PM Modi will also meet the flood-affected persons and NDRF, SDRF and Aapda Mitra Team in Kangra. Then, the Prime Minister will conduct an aerial survey of the flood-affected areas in Punjab around 3 PM.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nAhead of Prime Minister Narendra Modi's visit to the state on September 9, Aam Aadmi Party (AAP) president Aman Arora earlier today expressed hope that the Centre would announce a relief package for the flood-hit state.\n\"Punjab has been reeling under floods for the past 20-25 days. Tomorrow, PM Modi is coming to Punjab. We welcome him and are hopeful that tomorrow, he will give a relief package to Punjab. The preliminary estimation of damage due to floods amounts to Rs 20,000 crores,\" Arora told ANI.\nMeanwhile, Punjab BJP president Sunil Jakhar said the Prime Minister was \"deeply concerned\" about the situation.\nIn a post on X, Jakhar said that \"Prime Minister Shri Narendra Modi is deeply concerned about the flood situation in Punjab and is closely monitoring it. He is visiting Punjab on September 9 to personally assess the local conditions and understand the ground realities to provide maximum assistance to the people of Punjab.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  The flood situation in Punjab has worsened, with the death toll rising to 51, according to the Department of Information and Public Relations, Punjab. On Sunday, the death toll was at 46.","url":"https://www.latestly.com/agency-news/india-news-death-toll-in-punjab-due-to-floods-goes-up-to-51-7101074.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908190107.jpg","video":null,"publish_date":"2025-09-09 00:18:27","author":null,"language":"en","source_country":"in","sentiment":-0.025},{"id":358708874,"title":"Hegseth, top general visit Puerto Rico amid Trump drug cartel fight","text":"Sept. 8 (UPI) -- U.S. Defense Secretary Pete Hegseth and his top general made a surprise visit Monday to Puerto Rico as the Trump administration targets drug cartels in Latin America and the Caribbean.\n\nHegseth and Joint Chiefs Chairman Gen. Dan Caine landed in the U.S. territory six days after the Pentagon announced the United States had struck a boat of \"narcoterrorists\" off of Venezuela's coast, killing 11 people. While Trump claimed the vessel was carrying narcotics to the United States, Venezuelan President Nicolas Maduro denied the accusation.\n\nPuerto Rico's governor, Jennifer Gonzalez-Colon, greeted Hegseth and Caine when they landed Monday and said she was \"honored to welcome\" them.\n\n\"We thank POTUS Trump and his administration for recognizing the strategic value Puerto Rico has to the national security of the United States and the fight against drug cartels in our hemisphere, perpetuated by narco-dictator Nicolas Maduro,\" Gonzalez-Colon wrote Monday in a post on X.\n\n\"We are proud to support America First policies that secure our borders and combat illicit activities to protect Americans and our homeland,\" she added.\n\nThe Department of Defense, renamed last week by President Donald Trump as the Department of War, shared photos of Hegseth talking to troops.\n\n\"Secretary Hegseth and Chairman Caine met with our warriors in Puerto Rico and on the USS Iwo Jima,\" the department wrote in a post on X.\n\n\"Our warfighters are the STRONGEST and MOST LETHAL fighting force on Earth.\"\n\nHegseth spoke to nearly 300 U.S. troops at Muniz Air Base in Carolina, Puerto Rico, where he called them \"American warriors.\" The Pentagon had not announced his trip in advance.\n\nIn the past few weeks, the United States has moved up to eight warships, an attack submarine and thousands of Marines into the Caribbean. Secretary of State Marco Rubio has said more strikes against drug cartels are possible.\n\nSince the administration's strike on Sept. 2, Democrats have questioned Trump's war powers authority.\n\n\"We have far more questions than we have answers about this strike,\" said House Intelligence Committee ranking member Rep. Jim Himes, D-Conn., who co-sponsored a resolution to check Trump's war powers after June's Iran strikes. \"Under what legal authority can the president order a lethal strike on a vessel that posed no threat to the United States?\"\n\nGonzalez-Colon said the administration is targeting the source of what has become a security threat.\n\n\"President Trump's leadership in the fight against narco-trafficking places Puerto Rico -- our nation's Caribbean border -- at the forefront of our security and interests,\" Gonzalez-Colon said.\n\n\"For the first time, I believe we are confronting the problem at its root, striking directly at the source of the drug flow.\"","summary":"Defense Secretary Pete Hegseth and his top general visited Puerto Rico on Monday as the Trump administration targets drug cartels in Latin America and the Caribbean.","url":"https://www.upi.com/Top_News/US/2025/09/08/defense-Pete-Hegseth-Puerto-Rico-visit/2951757374056/","image":"https://cdnph.upi.com/sv/ph/og/upi/2951757374056/2025/1/674dd25fdd60a07023d5e3240bb15202/v1.5/Hegseth-top-general-visit-Puerto-Rico-amid-Trump-drug-cartel-fight.jpg","video":null,"publish_date":"2025-09-09 00:15:05","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","category":"politics","source_country":"US","sentiment":-0.144},{"id":358710780,"title":"India News | Rajnath Singh Interacts with Students of Navy Children School, Delhi as Part of Its Diamond Jubilee Celebrations","text":"New Delhi [India], September 9 (ANI): As part of the Diamond Jubilee celebrations of Navy Children School (NCS), Delhi, Defence Minister Rajnath Singh interacted with the students and the Principal of the school at South Block in New Delhi on Monday. Addressing the students, the Defence Minister encouraged them to dream with purpose, pursue their goals with sincerity, and uphold a strong sense of national pride in all their endeavours. He exhorted them to stay humble yet strong and fulfil their duties in whichever capacity with honesty and respect. Also Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nHe laid emphasis on the character development of children in their formative years. Further, Singh lauded the role of NCS in shaping the character and aspirations of students through discipline, service, and patriotism. He acknowledged the vital role schools under the Ministry of Defence play in nation-building, emphasising that these institutions are not just centres of learning, but platforms that imbue the next generation with values of leadership, integrity, and responsibility, said Ministry of Defence.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nDuring the event, he was given a brief overview of the NCS's vision and achievements, with the students sharing their experiences of how the school is playing a central role in their holistic development. The students also presented handcrafted tokens of respect to the Defence Minister, along with a Coffee Table Book and Crest.\nEarlier, Singh lauded PM Modi and Finance Minister Nirmala Sitharaman for the \"bold decision\" on GST reforms.\n\"The Government of India, under the leadership of PM Narendra Modi, has announced the Next-Gen GST reforms to bring relief across sectors. With tax rates reduced on many key items, this reform will bring ease of living, further strengthen ease of doing business, empower small businesses, and boost India's self-reliance under Aatmanirbhar Bharat. I thank PM Modi and the FM Nirmala Sitharaman for taking this bold decision,\" Rajnath Singh wrote on X. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  As part of the Diamond Jubilee celebrations of Navy Children School (NCS), Delhi, Defence Minister Rajnath Singh interacted with the students and the Principal of the school at South Block in New Delhi on Monday.","url":"https://www.latestly.com/agency-news/india-news-rajnath-singh-interacts-with-students-of-navy-children-school-delhi-as-part-of-its-diamond-jubilee-celebrations-7101071.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908190355.jpg","video":null,"publish_date":"2025-09-09 00:14:27","author":null,"language":"en","source_country":"in","sentiment":0.48},{"id":358710790,"title":"India News | NDA Vice President Candidate Will Get More Support Than Strength of Ruling Alliance: Rijiju","text":"New Delhi [India], September 9 (ANI): Union Parliamentary Affairs Minister Kiren Rijiju has expressed confidence that NDA's Vice Presidential candidate CP Radhakrishnan will get more votes than the strength of the ruling alliance, saying many MPs are thinking of voting for him in the election on Tuesday.\n\"There will be secret voting. CP Radhakrishnanji will get more support from the MPs than the votes from the NDA. Many MPs are thinking of voting for Radhakrishnan ji, and it is in the national interest that a very good person with nationalist ideology becomes the Vice President of our country,\" Rijiju told mediapersons here.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nAnswering a query, he said even one vote going waste is a huge loss.\n\"So last time we have seen few invalid votes. So the Prime Minister has appealed that not a single vote should be invalid or any vote should go wastage. All MPs are very particular about their voting rights\" he said.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nPM Modi addressed NDA MPs ahead of the Vice Presidential election.\n\"It was a very good meeting. All MPs of the Rajya Sabha and the Lok Sabha met together, and PM Modi also guided them. Prime Minister expressed his happiness about the important bills that have been passed in the Parliament recently and also said that people should be informed about such important bills in the true sense... For a self-reliant India, NDA leaders have been called upon to play a leadership role,\" he said.\n\"There are elections tomorrow, so in such an environment, this was a good opportunity. All the NDA MPs met and the suggestions and guidance given by the Prime Minister to us today, all the MPs listened to this very carefully and after the Vice President's election, they will take this message to their respective areas,\" he added. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Union Parliamentary Affairs Minister Kiren Rijiju has expressed confidence that NDA's Vice Presidential candidate CP Radhakrishnan will get more votes than the strength of the ruling alliance, saying many MPs are thinking of voting for him in the election on Tuesday.","url":"https://www.latestly.com/agency-news/india-news-nda-vice-president-candidate-will-get-more-support-than-strength-of-ruling-alliance-rijiju-7101069.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908190313.jpg","video":null,"publish_date":"2025-09-09 00:12:28","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.31},{"id":358709224,"title":"Mumbling Zohran Mamdani serves up word salad instead of straight answers to pressing NYC issues in recent spate of interviews","text":"He’s mumbling Mamdani.\n\nDemocratic socialist Zohran Mamdani dodged straightforward questions Monday on pressing issues facing the Big Apple — capping off days of mealy-mouthed politician speak that insiders argued showed the charismatic candidate’s shine is wearing off.\n\nThe frontrunner in the mayoral election only had gobbledygook to offer on a range of topics during the public safety forum at Columbia Journalism School, even when simply asked if he supported school safety agents working in the city’s public schools.\n\n“I think it is an indication of this broken status quo that we have many schools where they will have a school safety agent, but they will not have a nurse or a social worker… and I’ve been critical of that approach to our school system,” he droned to moderator Errol Louis.\n\nThe forum — hosted by the journalism school and the news outlet Vital City — came after a spate of weekend media interviews in which Mamdani gave similar non-responses.\n\nThe substance-free streak shows Mamdani is struggling to transition from the Democratic primary’s upset challenger to the responsibilities of being the top City Hall contender, political observers and consultants said.\n\n“He is about to find out charisma and charm are not answers,” said one longtime political operative. \n\n“Tough choices have to be made and as the young, inexperienced frontrunner – he doesn’t want to make them. It’s understandable, but not necessarily acceptable.”\n\nMamdani’s increasing taste for word salad showed itself Friday, when he was asked by CNN’s Abby Phillip whether he would request for the National Guard to be put on the subways in response to President Trump potentially sending federal agents to the Big Apple.\n\n“We have a responsibility to address the struggles that New Yorkers are living through. And one thing I’ll say about Donald Trump is he often diagnoses actual despair that people are living through,” he said, notably not responding to the question.\n\nThe candidate who once unhesitatingly said billionaires shouldn’t exist also dodged Phillip’s question on whether he thought the same about trillionaires — and bizarrely tried to shift the focus.\n\n“I think the better question is whether working people should exist, because what we’re seeing right now is amidst this incredible wealth, we have people who are keeping the city running that have to now live outside of the city, outside of the state,” he said.\n\nThe firebrand progressive’s ramblings continued Sunday during an interview on CBS2 New York’s “The Point with Marcia Kramer.”\n\nAsked about past stances, including calling to defund the police, that he’s been increasingly shedding, Mamdani replied: “Yes, those are out of step with the campaign that we are running and it’s been clear throughout.”\n\nHe also decided to point the finger at independent mayoral candidate Andrew Cuomo.\n\n“It’s chiefly Andrew Cuomo – who would prefer to debate a mythical version of myself than the person who I actually am. They would prefer to focus on tweets from 2020 as opposed to the platform in 2025,” he told Kramer.\n\nMamdani also failed to answer a direct question in the interview about what he would cut from his $10 billion freebie-filled agenda.\n\n“I think this is why it’s so critical to increase revenue on the most profitable corporations in New York City by having the same top tax rate as New Jersey,” he said – even as Gov. Kathy Hochul has publicly poured cold water on tax increases coming from Albany.\n\nKen Frydman, a Democratic political operative, said Mamdani has had three months since becoming the Democratic nominee to come up with concrete plans for proposals — such as his $1 billion Department of Community Safety, which he envisions taking over mental health calls from the NYPD.\n\n“But Mamdani has no plans for making any of his socialist policy initiatives a reality,” Frydman said. “They’re sweet nothings to the yearning, young masses.”\n\nMamdani during Monday’s public safety forum also failed to directly answer Louis’ question about how protesters blocking traffic or bridges should be dealt with.\n\nHe opted instead to criticize the NYPD’s Strategic Response Group – which he has called to disband if elected.“I think we have a proud history of exercising the First Amendment in the city, and it’s one that should be protected. I think much of this conversation around protest has also been a question of which police would respond to that protest,” he said.\n\nNicole Gelinas, a senior fellow at the Manhattan Institute who attended the forum, was troubled by Mamdani’s answers.\n\n“If you tolerate civil disobedience, you’re going to have chaos in the city,” Gelinas said.\n\nAnother Dem operative said Mamdani — who electrified voters with his lofty promises — is “coming back down to earth.”\n\n“A mayor cannot run the city on rhetoric,” the operative said.\n\n“Looks like he’s ready to become the next mayor– he is already dodging questions and has developed an allergy to furnishing detailed plans just like Mayor [Eric] Adams.”\n\nIn a phone interview with The Post, Cuomo shot back at the socialist pol, slamming him as a hypocrite.\n\nMamdani’s online footprint contains multiple examples of anti-police rhetoric, from calling the NYPD “racist, anti-queer & a major threat to public safety” to explicitly endorsing the “defund the police movement” or saying that New York’s Finest shouldn’t respond to domestic violence calls.\n\n“He is a mythical creation – just a series of tweets and TikToks. He doesn’t exist except on social media,” the former governor said.\n\n“If I couldn’t believe what you said before, why would I believe what you say now?” Cuomo questioned, adding that Mamdani’s rhetoric on policing issues has been “ugly and bizarre.”\n\nMamdani’s spokeswoman Dora Pekec focused on Cuomo, arguing the former governor spent his entire primary campaign “in hiding” — and continued to do so by skipping the public safety forum.\n\n“Meanwhile, Zohran has always and will continue to sit down with anyone to explain his vision for a more vibrant New York City where everyone can feel safe and afford to live,” she said.\n\n— Additional reporting by Carl Campanile","summary":"Zohran Mamdani dodged straightforward questions on pressing issues facing the Big Apple — capping off days of politician speak that insiders argued showed the candidate's shine is wearing off.","url":"https://nypost.com/2025/09/08/us-news/mumbling-zohran-mamdani-serves-up-word-salad-instead-of-straight-answers-to-pressing-nyc-issues-in-recent-spate-of-interviews/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-bewjuqbd8-1757375272032.jpg?quality=75&strip=all&1757360904&w=1200","video":"https://cdn.jwplayer.com/videos/JzebY07i-RyIcpnTz.mp4","publish_date":"2025-09-09 00:09:44","author":"Craig McCarthy,Hannah Fierick,Matt Troutman,Matthew Fischetti","authors":["Craig McCarthy","Hannah Fierick","Matt Troutman","Matthew Fischetti"],"language":"en","source_country":"zm","sentiment":-0.211},{"id":358708714,"title":"Democrats share image of alleged Trump letter in Epstein 'birthday book'","text":"The GOP-led House Oversight Committee says it has obtained documents and communications from the Jeffrey Epstein estate on Monday -- including the Epstein \"birthday book,\" which is said to contain the letter that President Donald Trump allegedly signed for Epstein's 50th birthday in 2003.\n\nRanking Democratic Rep. Robert Garcia posted a photo on X that Democrats say is the page attributed to Trump.\n\nTrump has denied writing the letter -- calling it \"fake.\" The president had also denied the existence of the letter, filing a $10 billion defamation lawsuit against the Wall Street Journal for its report that the birthday book contained a \"bawdy\" letter from Trump.\n\nDow Jones, the parent company of the newspaper, in response to the lawsuit said in a statement that it has \"full confidence in the rigor and accuracy\" of its reporting and \"will vigorously defend against any lawsuit.\"\n\nThe White House is denying that the image shared by Democrats is the president's signature. In a post on X, White House deputy chief of staff Taylor Budowich said \"Time for @newscorp to open that checkbook, it's not his signature. DEFAMATION!\"\n\nWhite House press secretary Karoline Leavitt, in an official response, also denied the fact that the signature depicted in the birthday book image is Trump's. She said that Trump's legal team will \"continue to aggressively pursue litigation\" against the Wall Street Journal.\n\nVice President JD Vance posted a response to Leavitt's statement, saying the release of the documents was \"another fake scandal” and calling it a \"smear.\"\n\n\"The Democrats don't care about Epstein. They don’t even care about his victims. That's why they were silent about it for years. The only thing they care about is concocting another fake scandal like Russiagate to smear President Trump with lies,” Vance wrote. \"No one is falling for this BS.\"\n\nThe committee issued a subpoena in late August for information from the estate, which included a copy of the alleged birthday book compiled for the disgraced financier's 50th birthday. The committee had requested a delivery of the documents -- which includes banking and financial records, flights logs and calendars -- on or before Sept. 8, 2025.\n\nEpstein's former associate Ghislaine Maxwell told a top official for the Justice Department that Epstein asked her to coordinate contributions to his 50th birthday book, but said she could not recall if Trump, then a private citizen, was among those who responded, according to a transcript of Maxwell's interview last month with Deputy Attorney General Todd Blanche.\n\nMaxwell was convicted in 2021 by a federal jury on sex trafficking and other charges. She is currently serving a 20-year prison sentence for aiding and participating in Epstein's trafficking of underage girls, which involved a scheme to recruit young women and girls for massages of Epstein that turned sexual. Federal prosecutors in New York said Maxwell helped Epstein recruit, groom and ultimately abuse girls as young as 14. In the interview with the Justice Department official, Maxwell continued to profess her innocence.\n\nEpstein was arrested in July 2019 and charged in a federal indictment with conspiracy and child sex trafficking. He died in custody a month later, while awaiting trial. His death was ruled a suicide by hanging.\n\nIn response to the developments surrounding the birthday book and the alleged letter from Trump, Brad Edwards, an attorney for scores of Epstein survivors, said that Trump's \"hypocrisy has been most frustrating for the victims.\"\n\n\"He told the public the Epstein story should ‘go away,’ yet filed a $10 billion lawsuit that only magnifies the very issue he wants silenced,\" Edwards told ABC News. \"With today’s release, the least he could do is withdraw that lawsuit and publicly apologize to the journalists he attacked for reporting what seems to have now proved to be true.”\n\nAfter the Wall Street Journal story and the White House denials, Edwards had publicly called on lawmakers in July to issue a subpoena to the estate for the birthday book, telling ABC News that \"the obvious and easy way to obtain the book” would be to get it from lawyers for Epstein’s estate.\n\n“It's Jeffrey Epstein's 50th birthday book, and like all other similar possessions, the estate is obviously in possession of it,\" Edwards told ABC News in July. \"Ask or subpoena the estate or their lawyers, and everyone will then have the book and can move on, which is best for the victims.\"\n\nLast week, the House Oversight Committee released tens of thousands of pages of documents related to Epstein, much of which was already publicly known.","summary":"The committee issued a subpoena in late August for information from the estate.","url":"https://abcnews.go.com/Politics/gop-led-house-oversight-committee-expected-receive-epstein/story?id=125365100","image":"https://i.abcnewsfe.com/a/1bc02e6c-ba12-41ad-a99c-0e45d1497403/james-comer-epa-gmh-250903_1756929407459_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-09-09 00:07:35","author":"John Parkinson,Lauren Peller","authors":["John Parkinson","Lauren Peller"],"language":"en","category":"politics","source_country":"US","sentiment":-0.286},{"id":358710772,"title":"World News | Nepal: Committee Formed to Investigate Monday's Violence That Claimed 19 Lives","text":"Kathmandu [Nepal], September 9 (ANI): An emergency cabinet meeting on Monday evening formed an investigation committee to look into the day's violence, which so far has claimed 19 lives.\nThe committee has given 15 days time to prepare a report.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\n\"The committee has been given 15 days time to prepare the report and submit it, looking into the aspects of how the situation escalated and the possible factors behind it. TOR (Terms of Reference) has been drafted accordingly,\" a source told ANI.\nThousands of youths joined the protests, criticizing rampant corruption and the government's ban on 26 unregistered social media platforms, including Facebook, Instagram, WhatsApp, YouTube, and Snapchat.\nAlso Read | 'Black Day for Nepal' Says Manisha Koirala Amid Ongoing Gen Z Protest Against Social Media Ban.\nPolice using lethal force against the unarmed protestors--especially students--resulted in the death of 17 in Kathmandu alone, while two deaths were recorded in Sunsari district, where a similar protest had convened.\nFrom 9 AM (local time) on Monday, demonstrators gathered at Maitighar in Kathmandu to voice their dissent. In recent days, hashtags such as 'Nepo Kid' and 'Nepo Babies' have been trending online, gaining momentum after the government decided to block unregistered platforms.\nHanaa Singer-Hamdy, United Nations Resident Coordinator in Nepal, expressed deep sorrow over the deaths and injuries during today's protests.\nIn a Facebook post, she extended heartfelt condolences to the families of those who lost their lives and urged all parties to exercise maximum restraint and vigilance.\nHamdy also appealed to the government to ensure an environment where citizens can safely and peacefully exercise their democratic rights.\nMonday marks the deadliest day in Nepali history since the overthrow of the monarchy in 2006, when a total of 18 people died in weeks of protest.\nDuring the protest, the police had used water cannons, tear gas, and live ammunition against protesters. The police fired while taking cover inside the parliament as the protestors swarmed into the building and set the entrance on fire. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  An emergency cabinet meeting on Monday evening formed an investigation committee to look into the day's violence, which so far has claimed 19 lives.","url":"https://www.latestly.com/agency-news/world-news-nepal-committee-formed-to-investigate-mondays-violence-that-claimed-19-lives-7101064.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908184611.jpg","video":null,"publish_date":"2025-09-09 00:06:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.197},{"id":358713994,"title":"Religious groups hold a Community and Democracy vigil in Washington","text":"Religious groups hold a Community and Democracy vigil, weeks after President Donald Trump ordered an increased presence of federal law enforcement to assist in crime prevention, in Washington, D.C., Sept. 8.\n\n Share on Facebook\n Share on X\n Share by email","summary":"","url":"https://www.staradvertiser.com/2025/09/08/photo-gallery/religious-groups-hold-a-community-and-democracy-vigil-in-washington/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/2025-09-08T233928Z_547504448_RC2XNGAUYCHC_RTRMADP_3_USA-TRUMP-CRIME.jpg","video":null,"publish_date":"2025-09-09 00:05:04","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.272},{"id":358710784,"title":"Business News | Government Working to Safeguard Steel Industry: MoS Bhupathiraju","text":"New Delhi [India], September 9 (ANI): Minister of State for Steel Bhupathiraju Srinivasa Varma said on Monday that the government is taking steps so that the problems faced by the steel industry get resolved. \"There is an impact presently (of the US tariffs). We are taking some steps, and in futur,e there will not be a problem,\" the minister said on the sidelines of the ISA Steel Conclave in the national capital today. Also Read | Why is Nepal not playing in Asia Cup 2025? Here’s the Reason of Nepal National Cricket Team Not Being Part of Continental Competition.\nThe US tariff on Indian goods stands at a steep 50% and has been effective since August 27.\nThe tariff could impact India's significant export of steel and iron products, affecting small and medium enterprises (MSMEs) in the sector. The United States currently has a 50% tariff on imported steel.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nThis tariff applies to most countries, except the UK, and includes finished products containing a proportion of steel.\nEstimates say that India's steel industry contributes approximately 2% to the nation's GDP. The sector has a key role in achieving India's vision of Atmanirbhar Bharat and the Make in India initiative. The Union minister stated that India aims to increase its crude steel production to 300 million tonnes by 2030, up from the current 200 million tonnes. The minister said that the government has acted swiftly on GST reforms in line with the announcment made by Prime Minister Narendra Modi. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on Business at LatestLY.  Minister of State for Steel Bhupathiraju Srinivasa Varma said on Monday that the government is taking steps so that the problems faced by the steel industry get resolved.","url":"https://www.latestly.com/agency-news/business-news-government-working-to-safeguard-steel-industry-mos-bhupathiraju-7101062.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908184215.jpg","video":null,"publish_date":"2025-09-09 00:04:29","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.059},{"id":358709604,"title":"Trump says Democrats have ‘blood on their hands’ after deadly Charlotte train stabbing","text":"President Donald Trump said that \"blood is on the hands of the Democrats\" after the brutal stabbing of a Ukrainian refugee in Charlotte, North Carolina, who was attacked and killed on a light rail train by a man with a lengthy criminal history last month. Social media exploded over the weekend after surveillance footage, released by the Charlotte Area Transit System (CATS), showed 23-year-old Iryna Zarutska boarding a Lynx Blue line last month before a man pulled out a knife and began stabbing Zarutska three times, including at least once in the neck. \"The blood of this innocent woman can literally be seen dripping from the killer’s knife, and now her blood is on the hands of the Democrats who refuse to put bad people in jail, including Former Disgraced Governor and ‘Wannabe Senator’ Roy Cooper,\" Trump said on Truth Social. \"North Carolina, and every State, needs LAW AND ORDER, and only Republicans will deliver it! Additionally, where is the outrage from the Mainstream Media on this horrible tragedy? VOTE FOR MICHAEL WHATLEY FOR UNITED STATES SENATE, HE WON’T LET THIS HAPPEN AGAIN!\" GOFUNDME PULLS FUNDRAISERS FOR FELON ACCUSED OF KILLING COMMUTER IN RANDOM CHARLOTTE TRAIN ATTACK Earlier in the day, the White House posted reaction from Trump on X.com, saying, \"The perpetrator was a well known career criminal, who had been previously arrested and released on CASHLESS BAIL in January, a total of 14 TIMES. What the hell was he doing riding the train, and walking the streets? Criminals like this need to be LOCKED UP.\" The suspect, identified as 34-year-old Decarlos Brown, was arrested shortly after the stabbing and hospitalized before being arrested on a charge of first-degree murder. Records obtained by The New York Post showed that Brown has a history of arrests going back more than a decade, including charges of felony larceny, robbery with a dangerous weapon and communicating threats. Police said Brown did not know Zarutska and the attack was random. By taking aim at the Democratic former Gov. Roy Cooper of North Carolina, Trump directly injected the tragedy into the center of the upcoming U.S. senate race in North Carolina, slated for next year. Cooper and Republican National Committee Chairman Michael Whatley are the two major front-runners. On Monday, the National Republican Senatorial Committee (NRSC) echoed Trump's argument, insisting Cooper's policies \"kept violent criminals like this on the streets instead of in jail where they belong.\" Meanwhile, Whatley said in a X post on Monday that \"a vote for Roy Cooper is a vote for more crime, more violence, more criminals.\" REPUBLICAN WANTS JUDGES HELD ACCOUNTABLE IF THEY RELEASE REPEAT VIOLENT CRIMINALS WHO STRIKE AGAIN He followed up later in the day after Trump's Truth Social post, adding that the president was \"spot on\" with his assessment of Democrats. \"My far-left opponent Roy Cooper's spineless, soft-on-crime policies have unleashed predators like Decarlos Brown Jr. and countless other violent thugs who unleash hell on innocent people because they know they'll face no real justice,\" Whatley said. Fox News Digital reached out to the Cooper campaign for comment, but did not immediately receive a response. The former governor announced his run at the end of July in a video posted to social media. A Fox News analysis of Cooper's social media did not uncover any posts about the incident. The Democratic Senatorial Campaign Committee's social media does not appear to have any comments on the matter, either. North Carolina's Gov. Josh Stein, a Democrat, was slammed over the weekend, when the video of the stabbing was first released, for not speaking out earlier. He finally commented on the matter Monday morning. \"I am heartbroken for the family of Iryna Zarutska, who lost their loved one to this senseless act of violence, and I am appalled by the footage of her murder. We need more cops on the beat to keep people safe,\" Stein posted on X. CLICK HERE TO GET THE FOX NEWS APP \"That’s why my budget calls for more funding to hire more well-trained police officers. I call upon the legislature to pass my law enforcement recruitment and retention package to address vacancies in our state and local agencies so they can stop these horrific crimes and hold violent criminals accountable.\" During a tour of the Museum of the Bible in the nation's capital on Monday, Trump weighed in on the event once again after the video of the attack surfaced over the weekend. \"We're all people of religion, but there are evil people,\" Trump said. \"And we have to confront that.\"","summary":"President Trump linkws the random stabbing death of a Ukrainian refugee, Iryna Zarutska, in Charlotte to upcoming North Carolina senate race between Roy Cooper and Michael Whatley.","url":"https://www.foxnews.com/politics/trump-says-democrats-have-blood-hands-after-deadly-charlotte-train-stabbing","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/donald-trump-reacts-charlotte-stabbing-display.jpg","video":"https://www.foxnews.com/video/6378807137112","publish_date":"2025-09-09 00:02:42","author":"Alec Schemmel","authors":["Alec Schemmel"],"language":"en","category":"politics","source_country":"US","sentiment":-0.511},{"id":358710788,"title":"India News | Bengal: BSF Seizes Gold Worth Rs 5 Crore, Nabs Smuggler Near India-Bangladesh Border","text":"Nadia (West Bengal) [India], September 9 (ANI): Troops of the 194 Battalion, Border Security Force (BSF) South Bengal Frontier, apprehended an Indian smuggler near the Sunder Border Outpost in Nadia district in West Bengal on September 7.\nActing on specific intelligence, BSF personnel intercepted the suspect and recovered 35 gold biscuits worth over Rs 5 crore concealed around his waist.\nAlso Read | Donald Trump's Advisor Peter Navarro Calls India's Russian Oil Purchases 'Blood Money', Launches Fresh Attack on Elon Musk.\nDuring preliminary questioning, the smuggler disclosed that he is a resident of Haritalapara village under the Dhantala police station. The interrogation has also provided significant leads regarding the smuggling network.\nHe, along with the seized gold, has been handed over to the concerned authorities for further investigation.\nAlso Read | Supreme Court Orders Madhya Pradesh To Pay INR 25 Lakh Compensation to Man Who Remained in Jail Despite Serving Full Sentence.\nThis is the third major gold seizure in recent days, underscoring BSF's effective intelligence network and vigilance along the border.\nConfirming the incident, the Public Relations Officer of BSF South Bengal Frontier commended the alertness of the troops. He reiterated that the BSF maintains strict surveillance to curb illegal activities along the India-Bangladesh border.\nHe also appealed to local residents to share information on smuggling through the 'Seema Saathi' helpline number, assuring rewards for credible inputs and complete confidentiality of informants. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Acting on specific intelligence, BSF personnel intercepted the suspect and recovered 35 gold biscuits worth over Rs 5 crore concealed around his waist.","url":"https://www.latestly.com/agency-news/india-news-bengal-bsf-seizes-gold-worth-rs-5-crore-nabs-smuggler-near-india-bangladesh-border-7101060.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250908183220.jpg","video":null,"publish_date":"2025-09-09 00:02:28","author":null,"language":"en","source_country":"in","sentiment":-0.179},{"id":358715124,"title":"Playing soccer, with Netanyahu's 'head': The shocking protest in front of UN headquarters | Watch","text":"Pro-Palestinian activists in New York staged a protest by playing soccer outside the United Nations headquarters with a ball made to look like Prime Minister Benjamin Netanyahu’s head in opposition to Israel’s ongoing war in Gaza. The stunt that took place on Sunday was organized by INDECLINE, an American collective that describes itself as an underground protest art movement. Founded in the early 2000s, the group is known for political provocations, street art and subversive installations. The replica of Netanyahu’s head was created by Spanish artist Eugenio Merino. “The game took place just before the 80th session of the U.N. General Assembly, and its purpose was to draw the attention of the international community to the genocide currently taking place in Gaza,” INDECLINE said in a statement. The group added that the game was played by “activists and citizens,” including both Jews and Palestinians. The protest came about two weeks before the U.N. General Assembly session, during which several countries are expected to recognize a Palestinian state, against the backdrop of the ongoing Gaza war. France and Saudi Arabia are leading the initiative and plan to hold a “Two-State Solution Conference” during the assembly. INDECLINE has a history of provocative actions. In August 2016, the group placed nude statues of Donald Trump in several U.S. cities while he was the Republican nominee for president. The statues — installed in New York, Los Angeles, San Francisco, Cleveland and Seattle — depicted Trump with a scowling face, a protruding belly and no testicles.","summary":"Ahead of the UN General Assembly, during which a number of countries are expected to recognize a Palestinian state, pro-Palestinian activists organized a soccer game in front of UN headquarters in New York using a ball that looks like the prime minister's head","url":"https://www.ynetnews.com/article/r1hyc1p9ll","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/09/08/H1fs7m9h9xl/H1fs7m9h9xl_139_94_985_554_0_large.jpg","video":null,"publish_date":"2025-09-08 23:59:22","author":null,"language":"en","category":"politics","source_country":"il","sentiment":0.21},{"id":358706578,"title":"Bill Clinton letter in Epstein 'birthday book' among new files released by House Oversight Committee","text":"The House Oversight Committee has released another tranche of files related to Jeffrey Epstein on Monday night, which includes a message from former President Bill Clinton in the late pedophile's infamous \"birthday book.\" The surprise document dump by the GOP-led panel came hours after Epstein's estate turned materials over to House investigators, pursuant to a congressional subpoena. Among the documents released by the committee is the reported book compiled by Epstein accomplice Ghislaine Maxwell for the late pedophile's 50th birthday. What appears to be an entry by Clinton praises Epstein's \"childlike curiosity, the drive to make a difference, and the [illegible] of friends.\" HOUSE MOVES TO EXPOSE EPSTEIN FILES, AUTHORIZES OVERSIGHT PROBE The book also appears to include entries by former Epstein attorney Alan Dershowitz and President Donald Trump, though the White House and the president himself have vehemently denied its veracity on multiple occasions. \"As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it. President Trump's legal team will continue to aggressively pursue litigation,\" White House press secretary Karoline Leavitt wrote on X, specifically in reference to a Wall Street Journal story that first mentioned allegations of Trump writing in the book. Fox News Digital also reached out to Clinton's office for comment. The tranche of documents released by the House Oversight Committee also includes details of Epstein's last will and testament, what appears to be an address book of contacts, and details of his 2007-2008 non-prosecution agreement with the U.S. Attorney's Office in Southern Florida. In a statement upon the files' release, House Oversight Committee Chairman James Comer, R-Ky., criticized Democrats for earlier releasing only the portion of the files that included Trump's name – and asserted that the president was not implicated in any wrongdoing. HOUSE OVERSIGHT COMMITTEE RELEASES THOUSANDS OF EPSTEIN DOCUMENTS CLICK HERE TO GET THE FOX NEWS APP \"It’s appalling Democrats on the Oversight Committee are cherry-picking documents and politicizing information received from the Epstein Estate today. Oversight Committee Republicans are focused on running a thorough investigation to bring transparency and accountability for survivors of Epstein’s heinous crimes and the American people,\" Comer said. \"President Trump is not accused of any wrongdoing and Democrats are ignoring the new information the Committee received today. The Committee will pursue additional Epstein bank records based on this new information. Democrats must decide if their priority is justice for the survivors or politics.\" The release comes a day before former Obama administration Attorney General Loretta Lynch is set to appear before Comer's panel for a closed-door deposition on Epstein.","summary":"The House Oversight Committee has released a tranche of files related to Jeffrey Epstein on Monday evening.","url":"https://www.foxnews.com/politics/bill-clinton-letter-epstein-birthday-book-among-new-files-released-house-oversight-committee","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/01/Jeffrey-Epstein-Bill-Clinton-1.jpg","video":"https://www.foxnews.com/video/6378719667112","publish_date":"2025-09-08 23:52:38","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":-0.259},{"id":358713082,"title":"'I handled the deal': Epstein joked about selling a 'fully depreciated' woman to Trump","text":"Democrats on the House Oversight Committee are now releasing new images from the infamous \"birthday book\" that convicted child trafficker Ghislaine Maxwell – who was pedophile Jeffrey Epstein's chief accomplice — assembled for Epstein for his 50th birthday. One image appears to show President Donald Trump and references a deal involving an unnamed woman and tens of thousands of dollars.\n\nThe image, which Oversight Committee Democrats posted to their official X account on Monday, appears to show the woman (whose face has been redacted), Trump, an unknown Mar-a-Lago member and Epstein all holding up an enlarged check bearing Trump's signature. A handwritten note is seen under the image, and although the note is not signed, the writing appears similar to Epstein's own, according to public records.\n\n\"Jeffrey showing early talents with money + women! Sells 'fully depreciated' [REDACTED] to Donald Trump for $22,500,\" the note read. \"Showed early 'people skills' too. Even though I handled the deal I didn't get any of the money or the girl!\"\n\nREAD MORE: 'Shame on the administration': Top GOP megadonor rallies investors against Trump\n\n Investigative journalist Jacqueline Sweet alleged the Mar-a-Lago member seen in the photo is Joel Pashcow, who was also seen sitting in close proximity to Epstein in a separate photo from 1994. Sweet also observed that Health and Human Services Secretary Robert F. Kennedy was in the photo close to both Pashcow and Epstein. Kennedy admitted to flying on Epstein's jet on two separate occasions in the 1990s.\n\nThe release of the photo comes on the heels of a separate photo the Wall Street Journal released of Trump's purported message to Epstein as part of the book. As the Journal reported earlier this year, the message imagines a conversation between Trump and Epstein in which Trump said that the two men \"have certain things in common\" and share \"a wonderful secret.\" The message is outlined by a drawing in the shape of a woman's torso, with Trump's signature in the approximate area of the woman's pubic region.\n\n\"We got the Epstein note Trump says doesn’t exist,\" Oversight Committee ranking member Robert Garcia (D-Calif.) tweeted. \"Time to end this White House cover-up.\"\n\nEarlier on Monday, White House spokesperson Taylor Budowich tweeted several of Trump's signatures and disputed that the signature seen on the letter was not from the president. However, conservative attorney George Conway tweeted a photo of a letter Trump sent him in 2006, in which the signature at the bottom was nearly identical to the one seen in the lewd birthday message.\n\nREAD MORE: George Conway busts Trump's claim that signature on lewd Epstein birthday card is his","summary":"Democrats on the House Oversight Committee are now releasing new images from the infamous \"birthday book\" that convicted child trafficker Ghislaine Maxwell – who was pedophile Jeffrey Epstein's chief accomplice — assembled for Epstein for his 50th birthday. One image appears to show President Donald Trump and references a deal involving an unnamed woman and tens of thousands of dollars.\n\nThe image, which Oversight Committee Democrats posted to their official X account on Monday, appears to show the woman (whose face has been redacted), Trump, an unknown Mar-a-Lago member and Epstein all holding up an enlarged check bearing Trump's signature. A handwritten note is seen under the image, and although the note is not signed, the writing appears similar to Epstein's own, according to public records.\n\n\"Jeffrey showing early talents with money + women! Sells 'fully depreciated' [REDACTED] to Donald Trump for $22,500,\" the note read. \"Showed early 'people skills' too. Even though I handled the deal I didn't get any o","url":"https://www.alternet.org/epstein-trump-woman/","image":"https://www.alternet.org/media-library/image.png?id=61568115&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-09-08 23:41:02","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.394},{"id":358710798,"title":"Alleged Epstein birthday note released - and it doesn't look great for Donald Trump","text":"Finally, we see the look of the evidence - and it doesn't look great for Donald Trump.\n\nA lewd birthday message Trump allegedly sent to convicted sex offender Jeffrey Epstein has been released by Democrats.\n\nThe letter, surrounded by a hand-drawn outline of what appears to be a woman, bearing Trump's name and allegedly his signature, includes the text: \"A pal is a wonderful thing. Happy Birthday - and may every day be another wonderful secret.\"\n\nThe alleged note had always been in doubt, as long as the fabled birthday book remained unpublished. There's more certainty now.\n\nTrump had repeatedly denied all association, saying: \"I never wrote a picture in my life. I don't draw pictures of women.\"\n\nIt will amplify questions surrounding his friendship with Epstein and suggestions of improper behaviour. The US president denies any wrongdoing.\n\nIn suing the publishers of The Wall Street Journal, Trump's attorneys have argued that \"no authentic letter or drawing exists\".\n\nExpect arguments over authenticity to continue - forensic investigations, who knows, to establish the provenance of the picture signed \"Donald\".\n\nRead more from Sky News:Trump threatens 'war' on ChicagoMan accused of Trump assassination attempt on trial\n\nWhat isn't in doubt is the traction it will lend to calls for a full release of the Epstein files. The birthday book handed over to the Congressional committee had the names and faces of women and minors redacted.\n\nThe drawing and its publication is the hard piece of evidence that makes it even harder for the president to cry \"hoax\".\n\nAnd yet, he surely will. To admit the picture was drawn by his own hand would be to admit a lie that would bind him tighter still to the scandal that stalks him.\n\nA first sight of the drawing is one development in this story, but it's not the only one. Lawyers for the Epstein estate wrote in their covering letter to the committee that they are unaware of the existence of a \"list of clients involved in sex, sex acts, or sex trafficking facilitated by Mr Jeffrey Epstein\".\n\nIt is their word, for public consumption.\n\nThey'll be aware, as they are in the White House, that on this story, the public would rather make up its own mind.","url":"https://uk.news.yahoo.com/alleged-epstein-birthday-note-released-234100312.html","image":"https://s.yimg.com/ny/api/res/1.2/dT5434pNIEMKkPuZWj.TLg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NjA7Y2Y9d2VicA--/https://media.zenfs.com/en/sky.com/4f4ab19e3d26051c4c38d9534323abdb","video":null,"publish_date":"2025-09-08 23:41:00","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.135},{"id":358709196,"title":"Biden’s autopen scandal is nothing short of a coup — and the culprits needs to be held accountable","text":"Just months ago a travesty was taking place in the nation’s capital as the Biden administration drew to a close.\n\nOn his way out the door, President Joe Biden commuted the sentences of more than 4,000 federally incarcerated offenders.\n\nOnly it wasn’t Biden issuing the record-shattering number of commutations — it was his autopen.\n\nAnd who controlled that?\n\nThe autopen’s last-minute pardons and commutations weren’t approved by the Justice Department:\n\n“​​There was a mad dash to find groups of people that he could then pardon — and then they largely didn’t run it by the Justice Department to vet them,” a source told the DC insider publication Axios.\n\nWhile Biden claimed the last-minute blizzard of pardons and commutations was for “nonviolent” drug offenders, a trove of administration emails obtained by The Oversight Project and first reported on by the New York Post’s Josh Christenson tell a different story.\n\n“I think you should stop saying that because it is untrue or at least misleading,” Associate Deputy Attorney General Brad Weinsheimer warned in a Jan. 18 email.\n\nAmong those receiving presidential clemency, Weinsheimer noted, “We identified violent offenders, including those who committed acts of violence during the offense of conviction, or who otherwise have a history of violence.”\n\nSubsequent reporting has brought to light extensive correspondence between the West Wing and Justice Department as officials struggled to interpret just what it was the president was doing — or whether he was even aware of what was being done.\n\nAfter all, it wasn’t his hand signing the papers; it was the autopen.\n\nFour years earlier, when Biden was first taking office, his incoming staff secretary had told him his hand signature should be used for pardons, according to Axios.\n\nBut if, by the end, Joe Biden wasn’t running the Biden administration, it doesn’t matter what he’d been told.\n\nIt’s happened before: A little more than a hundred years earlier, a stroke had left President Woodrow Wilson unable to discharge the duties of his office.\n\nBut instead of a constitutional succession taking place, the president’s wife and staff ran the administration in Wilson’s place, with the president reduced to little more than a figurehead.\n\nToday such a thing was supposed to be impossible — the Constitution’s 25th Amendment, ratified in 1967, spells out what’s meant to happen when a president is non compos mentis.\n\nVoters were left in no doubt about Biden’s mental incapacity after his disastrous debate with Donald Trump in June of last year.\n\nDemocratic insiders already knew the score, but they were content to keep Biden in the race and even in power, until the public’s discovery of his condition made perpetuating the charade impossible.\n\nEven so, Biden didn’t resign and his autopen continued to issue orders, including quite likely life-and-death decisions about clemency.\n\nTo stop injustices, voters have to be able to hold officials accountable.\n\nBut which officials can they hold to account for an autopen?\n\nJoe Biden and Kamala Harris haven’t escaped the public’s judgment, but behind them were Democrats whose names are unknown, yet whose actions America will long have to live with.\n\nWhatever shadowy collective was behind the Biden autopen is still out there.\n\nThe Trump administration is right to investigate who was really in charge of our government when the elected president evidently was not.\n\nWhat happened under Biden was a coup, and it’s not mitigated by the fact that Democrats committed a coup against an incapable president of their own party.\n\nThe autopen is meant to represent the president, not take his place.\n\nCleaning up the crime in our streets is impossible without cleaning up the way government works, and that means unmasking the officials responsible for decisions that endanger lives.\n\nThey can’t be allowed to hide behind an automated signature or leaders who don’t know what their pens are writing.\n\nDaniel McCarthy is the editor of Modern Age: A Conservative Review and editor-at-large of The American Conservative.","summary":"President Joe Biden commuted the sentences of more than 4,000 federally incarcerated offenders. Only it wasn’t Biden issuing the record-shattering number of commutations — it was his autopen.","url":"https://nypost.com/2025/09/08/opinion/bidens-autopen-scandal-is-nothing-short-of-a-coup-and-the-culprits-needs-to-be-held-accountable/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-0blictrs6-1757374352293.jpg?quality=75&strip=all&1757360420&w=1200","video":null,"publish_date":"2025-09-08 23:40:57","author":"Daniel McCarthy","authors":["Daniel McCarthy"],"language":"en","source_country":"zm","sentiment":-0.428},{"id":358708160,"title":"Israel, India sign investment deal as Smotrich welcomed in New Delhi","text":"Israel and India have signed a bilateral investment agreement to expand mutual trade during far-right Israeli Minister of Finance Bezalel Smotrich’s trip to the South Asian country, which deepened its ties with Israel under Hindu nationalist Prime Minister Narendra Modi.\n\nThe agreement, signed in New Delhi by Smotrich and Indian Minister of Corporate Affairs Nirmala Sitharaman, aims to boost trade and investment flows between the two countries. Sitharaman stressed the need for greater collaboration in “cybersecurity, defence, innovation and high-technology”.\n\nThe deal marked “an important strategic step for our joint vision”, said Smotrich, who has been sanctioned by several Western countries for his links to illegal settlements in the occupied West Bank.\n\n“The agreement reached today between Israel and India reflects our economic growth, innovation and mutual prosperity,” he wrote on X.\n\n“This agreement will open new opportunities for investors in both countries, strengthen Israeli exports, and provide businesses with the certainty and tools to grow in one of the world’s largest and fastest-growing markets.”\n\nIndia’s Ministry of Finance described the deal as a “historic milestone”, adding that it will foster cooperation in “fintech innovation, infrastructure development, financial regulation, and digital payment connectivity”.\n\nBilateral trade stood at $3.9bn in 2024, while current mutual investments are worth about $800m, according to official figures. But the bulk of the trade between the two countries is in the domain of defence and security, with New Delhi being Israel’s largest weapons buyer.\n\nLast year, Indian firms also sold Israel rockets and explosives during Israel’s war on Gaza, an Al Jazeera investigation revealed.\n\nThe agreement comes as New Delhi moves closer to Israel, even as Israel faces growing political isolation over its genocidal war on Gaza. India was one of the first countries to reach out to Israel after the October 7, 2023, attack on Israel led by Hamas, condemning it as “an act of terror”.\n\nIndian authorities have cracked down on pro-Palestine protests, even criminalising them in some cases, while allowing pro-Israel rallies.\n\nIndia still supports the so-called two-state solution for the resolution of the Israel-Palestine conflict, but it has abstained from several United Nations resolutions that have been critical of Israeli rights violations against Palestinians.\n\nIn 2024, India also abstained from a UN General Assembly vote calling for an “immediate, unconditional and permanent” ceasefire in Gaza.\n\nIndians make up the largest group of foreign students in Israel, while Israeli construction companies have sought permission to hire up to 100,000 Indian workers to replace Palestinians whose permits were revoked after Israel launched its brutal war on Gaza in October 2023.\n\nIndia has also refused to condemn Israel’s war on Iran, and declined to support the Shanghai Cooperation Organisation’s (SCO) condemnation of Israeli attacks. But after United States President Donald Trump’s 50 percent tariffs on India, which took effect late last month, New Delhi this month signed an SCO declaration that condemned the US-Israeli bombing of Iran.\n\nIndia has also moved to mend its ties with rival China, in a setback for years of US policy using New Delhi as a counterweight to Beijing.\n\nChina and India should be partners, not rivals, Chinese President Xi Jinping told Modi on the sidelines of the SCO summit in Tianjin.","summary":"India&#039;s finance minister calls for greater collaboration in &#039;cybersecurity&#039; and &#039;defence&#039; between the two countries.","url":"https://www.aljazeera.com/news/2025/9/8/israel-india-sign-investment-deal-as-smotrich-welcomed-in-new-delhi?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2023/12/Smotrich-1704059178.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-09-08 23:40:57","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.346},{"id":358709998,"title":"Mark Hamill Says He’s ‘Really Ashamed’ America Voted for Trump Twice, the 2nd Administration Is ‘On Us’","text":"Mark Hamill is once again voicing his opinion on President Donald Trump and his 2.0 administration, expanding Monday on why he thinks the reality TV star-turned-politician might, sadly, be the leader America deserves. \n\n“It’s one thing for him to have sneaked by the first time — when he got reelected, that’s on us,” Hamill said, lamenting the 2024 election between Trump and Vice President Kamala Harris in a wide-ranging interview on “WTF With Marc Maron.” “That’s where I’m really ashamed of — because I always thought there are more decent Americans, honest Americans than there are others. And it proved I was wrong. I’m in the minority in my own country.”\n\nIt’s not the first time Hamill has expressed frustration over how Trump’s reelection reflects on the state of the United States. On Nov. 6 of last year, as the White House win solidified for Trump, the “Star Wars” icon memorably wrote on X: “They say we get the leaders we deserve. Either that has just been disproven, or this is not the America we all thought we were living in.”\n\nThey say we get the leaders we deserve.Either that has just been disproven, or this is not the America we all thought we were living in.— Mark Hamill (@MarkHamill) November 6, 2024\n\nSitting with Maron on Monday’s “WTF” episode, the star of “The Long Walk” reflected on filming “Star Wars: The Last Jedi” during Trump’s first presidential run against Hillary Clinton in 2016. \n\n“It was odd because when we were doing one of the sequels was the first time Hillary was running against him, and English people on the crew would come up to me and say, like, ‘Mark, why do Americans love Donald Trump so much?’” the 73-year-old actor recalled. “And I’m going, ‘I don’t know a single person who can stomach him.’”\n\nHe admitted to at one time thinking that Trump’s showmanship made him “amusing,” but that his perception changed in 2011 amid the soon-to-be politician’s public attacks on President Barack Obama’s birthplace.\n\n“I used to think, when I was living in New York doing theater, he was amusing to me. What’s not funny about a blowhard egomaniac with zero self-awareness?” Hamill said. “He was a buffoon. But what turned me on a dime was in 2011 when he went on the birther thing, which was interesting because that was his first foray into politics and he got a great response from that. Oh, I’m appealing to the racists and the conspiracy theorists.”\n\nHamill recently made headlines for sharing that he was on the brink of leaving the United States for the United Kingdom after Trump’s reelection before his wife Marilou York convinced him it was the wrong move. She made clear that leaving would be like Trump winning.\n\n“She’s very clever,” he said at the time. “She didn’t respond right away, but a week later she said, ‘I’m surprised you would allow him to force you out of your own country.’ That son of a bitch, I thought. I’m not leaving.” \n\nListen to Hamill’s full “WTF With Marc Maron” podcast interview here.","summary":"\"I’m in the minority in my own country,\" the \"Star Wars\" icon laments\n\n\nThe post Mark Hamill Says He’s ‘Really Ashamed’ America Voted for Trump Twice, the 2nd Administration Is ‘On Us’ appeared first on TheWrap.","url":"https://www.thewrap.com/mark-hamill-trump-ashamed-wtf-with-marc-maron/","image":"https://www.thewrap.com/wp-content/uploads/2025/09/Mark-Hamill.jpeg","video":null,"publish_date":"2025-09-08 23:39:39","author":"Benjamin Lindsay","authors":["Benjamin Lindsay"],"language":"en","category":"politics","source_country":"US","sentiment":-0.128},{"id":358707178,"title":"Crime is 'real' in Chicago, both in perception and reality, alderman stresses","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Evening Edit September 08, 2025 04:33 \n\n Crime is 'real' in Chicago, both in perception and reality, alderman stresses \n Democratic Chicago Alderman Raymond Lopez discusses the crime in the city, his party's resistance to President Donald Trump's crackdown and reacts to the parents of a murdered D.C. intern thanking the Trump administration.\n\nTags WHAT TO WATCHSHOWSTHE EVENING EDIT | LATEST EPISODESTHE EVENING EDITPOLITICS","summary":"Democratic Chicago Alderman Raymond Lopez discusses the crime in the city, his party&apos;s resistance to President Donald Trump&apos;s crackdown and reacts to the parents of a murdered D.C. intern thanking the Trump administration.","url":"https://www.foxbusiness.com/video/6378850944112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/cef1a8f3-1267-4856-a72a-c860e41c1512/3e516051-dd3b-4dde-af19-02a80102f220/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-08 23:37:01","author":null,"language":"en","source_country":"us","sentiment":-0.096},{"id":358709208,"title":"Zohran Mamdani ramps up suburbanite donations on Long Island — but still trails rivals’ fundraising","text":"Big Apple mayoral hopeful Zohran Mamdani has raked in nearly $200,000 from donors on Long Island since his Democratic Party primary win – but still trails his rivals’ overall local haul, filings show.\n\nMamdani reported $104,000 from Long Island donors — who can’t vote in the city election — between July 12 and Aug. 18, outpacing any other city candidate over the same stretch, according to campaign finance records.\n\nBut former Gov. Andrew Cuomo has pulled in more than $1.5 million from Long Island donors overall as he runs on an independent line after losing a June Democratic primary to Mamdani. During the last period, he received $46,500 from 52 donors, the records showed.\n\nIncumbent Mayor Eric Adams — who is also running as an independent after he dropped out of the Democratic primary — has a haul of just over $1 million from Long Islanders but pulled under $29,000 from 35 donors int he latest filing, records show.\n\nMamdani had roughly $57,000 in total from Long Island donors before his primary win, according to the filings.\n\nRepublican Party nominee Curtis Sliwa had more individual donors than Mamdani during this latest period, with 294 donors — but still earned just $22,000. He has raised about $51,000 in total through the campaign, the filings show.\n\nThe region backed Donald Trump in his run for president last year with more than 53% of the vote — flipping Nassau County red for the first time since 1988 and cementing Suffolk County as a GOP stronghold.\n\nMamdani’s popularity in Long Island even garnered a recent half-baked endorsement from Suffolk County’s former police Commissioner Rodney Harrison, who backed the socialist’s ideas for police reform, including a plan to send mental health professionals to respond to “non-violent” calls instead of cops.\n\nSeveral high-profile elected Long Island Democrats have broken with Mamdani, with US Reps. Laura Gillen and Tom Suozzi both criticizing the socialist candidate and so far refusing to endorse their fellow Democrat.\n\n“Zohran Mamdani and other Democratic Socialists should create their own party because I don’t want that in my party,” Suozzi said last Sunday.\n\nGillen called Mamdani’s policies “the wrong choice for New York City” and said she will continue to do so as “over 300,000 Long Islanders commute to New York City every day and ensuring the city succeeds is vital for our region.”","summary":"Big Apple mayoral hopeful Zohran Mamdani has raked in nearly $200,000 from donors on Long Island since his Democratic Party primary win.","url":"https://nypost.com/2025/09/08/us-news/zohran-mamdani-ramps-up-suburbanite-donations-on-long-island-but-still-trails-rivals-fundraising/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-xa6ll98dq-1757373457418.jpg?quality=75&strip=all&1757359109&w=1200","video":"https://cdn.jwplayer.com/videos/FTyTaIvM-RyIcpnTz.mp4","publish_date":"2025-09-08 23:35:58","author":"Brandon Cruz","authors":["Brandon Cruz"],"language":"en","source_country":"zm","sentiment":-0.041},{"id":358702788,"title":"Democrats Publish Alleged Message from Trump to Jeffrey Epstein","text":"() Democrats on the House Oversight Committee released President Donald Trump’s alleged entry in the Jeffrey Epstein 50th birthday book on Monday. \n\n“We got Trump’s birthday note to Jeffrey Epstein that the President said doesn’t exist,” read a post on the Oversight Dems’ X account. \n\n“Trump talks about a ‘wonderful secret’ the two of them shared. What is he hiding? Release the files!”\n\nAttached in the X post is a drawing of what appears to be a torso. It reads:\n\nVoice Over:\n\nThere must be more to life than having everything\n\nYes, there is but I won’t tell you what it is.\n\nNor will I, since I also know what it is.\n\nWe have certain things in common, Jeffrey. \n\nYes, we do, come to think of it.\n\nEnigmas never age, have you noticed that?\n\nAs a matter of fact, it was clear to me the last time I saw you\n\nA pal is a wonderful thing. Happy Birthday—and may every day be another wonderful secret. \n\nDonald J. Trump\n\nTrump team: ‘It’s not his signature’\n\nTrump has consistently denied being the author of the letter ever since it was discussed in July, and he also claims he didn’t create the doodle. His team strongly opposed the letter’s release on Monday.\n\n“As I have consistently stated, it’s quite obvious that President Trump neither drew this image nor signed it,” White House press secretary Karoline Leavitt tweeted on X.\n\n“President Trump’s legal team will continue to aggressively pursue litigation. … This is FAKE NEWS to perpetuate the Democrat Epstein Hoax!”\n\nDeputy White House Chief of Staff Taylor Budowich labeled the image as “defamation,” noting on X that the signature does not align with the president’s authentic signature.\n\nWhat Epstein files has Congress subpoenaed?\n\nRepublicans from the House Oversight and Government Reform Committee issued a subpoena to the Epstein estate seeking numerous confidential documents. This includes anything akin to a client list and Epstein’s “birthday book,” a 2003 compilation put together by his former girlfriend Ghislaine Maxwell, which reportedly contained the letter allegedly written by Trump during his time as a private citizen in New York.\n\nThose materials are slated for delivery to Capitol Hill by Sept. 8.\n\nNews outlet sued after reporting on Epstein birthday doodle\n\nThe Wall Street Journal report from July was the initial source to detail the message, describing it as “bawdy.” Trump contested the report and proceeded to file a libel lawsuit against the publication.\n\nLeavitt said Monday that Trump’s legal team would continue to “aggressively pursue litigation” against the Wall Street Journal. \n\n“I have never drawn a picture in my life. I don’t sketch images of women,” he stated to the Wall Street Journal in July. “Those aren’t my words. That’s not my language.”\n\nThe lawsuit against the newspaper stated, “Defendants concocted this story to malign President Trump’s character and integrity and deceptively portray him in a false light.”\n\nThe suit names the two reporters, The Wall Street Journal, Dow Jones, News Corp and Rupert Murdoch, who controls the company, as defendants. It also names News Corp’s CEO, Robert Thomson. \n\n“This lawsuit is filed not only on behalf of your favorite President, ME, but also in order to continue standing up for ALL Americans who will no longer tolerate the abusive wrongdoings of the Fake News Media,” Trump wrote on Truth Social when the lawsuit was filed in July.","summary":"Internewscast Journal\n\nInternewscast\n\n\n() Democrats on the House Oversight Committee released President Donald Trump&#8217;s alleged entry&#8230;\n\n\nThis Post: Democrats Publish Alleged Message from Trump to Jeffrey Epstein first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/democrats-publish-alleged-message-from-trump-to-jeffrey-epstein/","image":"https://internewscast.com/wp-content/uploads/2025/07/rewrite-this-title-More-than-half-of-voters-disapprove-of.jpg","video":null,"publish_date":"2025-09-08 23:28:48","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.315},{"id":358701794,"title":"‘Evil, Lunatic’: Trump Responds To Killing Of Ukrainian Model In US, Blames Democrats","text":"US President Donald Trump on Monday responded to the brutal murder of Ukrainian refugee and model Iryna Zarutska, who was stabbed to death while riding public transit in North Carolina. The 24-year-old was fatally attacked on August 22 while aboard the Lynx Blue Line in Charlotte, where she was stabbed 14 times, including a fatal wound to her neck.\nCalling the killing a “terrible tragedy,” Trump condemned the media for what he described as a lack of coverage and pointed fingers at Democratic leaders for fostering an environment of lawlessness. “The blood of this innocent woman can literally be seen dripping from the killer’s knife, and now her blood is on the hands of the Democrats who refuse to put bad people in jail, including Former Disgraced Governor and ‘Wannabe Senator’ Roy Cooper,” Trump said.\nThe President also endorsed Republican candidate Michael Whatley for the US Senate, urging North Carolinians to vote for leaders who would restore order. “Every State needs LAW AND ORDER, and only Republicans will deliver it!” he declared.\n\nI have seen the horrific video of a beautiful, young Ukrainian refugee, who came to America to escape the vicious War in Ukraine, and was innocently riding the Metro in Charlotte, North Carolina, where she was brutally ambushed by a mentally deranged lunatic. The perpetrator was… pic.twitter.com/eO8xmwww9A\n— Trump Truth Social Posts On X (@TrumpTruthOnX) September 8, 2025\n\nZarutska had fled Ukraine in 2022 following the Russian invasion and had been living with her aunt in the US. She was returning home from her shift at Zapeddies, a local pizzeria, when she was attacked.\nSurveillance footage reportedly shows 34-year-old Decarlos Brown sitting behind Zarutska in a red hoodie, suddenly pulling out a folding knife and launching the fatal assault. Law enforcement confirmed the attack was entirely unprovoked.\nTrump also expressed personal sympathy, stating. “There are evil people, and we have to confront that. I just give my love and hope to the family of the young woman who was stabbed this morning or last night in Charlotte by a madman.”\nBrown was arrested shortly after the attack and is currently being held without bond. He has been charged with first-degree murder. Public records show he has a criminal history spanning over a decade, including recent charges for communicating threats and abusing the 911 system. His family disclosed that he has a prior diagnosis of schizophrenia and is currently undergoing a competency evaluation.","summary":"Brown was arrested shortly after the attack and is currently being held without bond.","url":"https://www.news18.com/world/evil-lunatic-trump-responds-to-killing-of-ukrainian-model-in-us-blames-democrats-ws-l-9558432.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/Trump-tariffs-5-2025-09-cef25652334585561659bfb70bdbdf1b.jpg","video":null,"publish_date":"2025-09-08 23:26:43","author":"New.storytailors,News18,World Desk","authors":["New.storytailors","News18","World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.372},{"id":358702790,"title":"Jeffries Warns GOP May Regret Revisiting January 6 Events","text":"House Minority Leader Hakeem Jeffries (D-N.Y.) cautioned Republicans on Monday that they might regret their decision to revisit the events of the Jan. 6, 2021, U.S. Capitol attack.\n\nJeffries indicated that Democrats intend to leverage their involvement in the newly established GOP inquiry into the assault to emphasize President Trump’s role in instigating the violence on that day.\n\n“Republicans will regret that they’ve decided to go down this road,” Jeffries told reporters in the Capitol.\n\nLast week, Republicans voted to set up a new committee to investigate Jan. 6, nearly three years after the original select committee released a report attributing blame to Trump for inciting the riot. This new committee also has the authority to scrutinize the previous investigation.\n\nRepublican leaders have stood by Trump’s actions related to the attack, criticizing the original investigation as a biased effort designed solely to damage Trump politically. The new committee is likely to be used to attempt to clear their ally in the White House, who faced a second impeachment after the 2021 riot.\n\n“Our objective is to resolve the unanswered questions, uncover all the details, and ensure reforms are in place to prevent such security breaches in the future,” announced Rep. Barry Loudermilk (R-Ga.), who will lead the committee, following its formation.\n\n“It’s time to finish the job.” \n\nDemocrats claim they’ll use the current investigation to focus attention not only on Trump’s actions but also on the violence committed against police officers by his supporters, as well as the offenses carried out by some MAGA followers since Trump pardoned them in January.\n\nRep. Jamie Raskin (D-Md.), as the ranking member of the House Judiciary Committee, is automatically considered an ex officio member of the new panel. And Jeffries named three other Democrats to the committee on Monday: Reps. Eric Swalwell (Calif.), Jasmine Crockett (Texas) and Jared Moskowitz (Fla.). \n\n“Donald Trump is trying to do with Jan. 6 what many fringe groups have done with Sept. 11, telling us it wasn’t planes that flew into the buildings but holograms, or missiles, or that it was an inside job,” Swalwell said Monday. “And here’s why we didn’t buy the 9/11 crazy talk then, or the Jan. 6 lies now: Because we saw them with our own eyes.”\n\nRaskin, who was a member of the initial Jan. 6 committee, characterized a previous Loudermilk investigation as “an attempted Orwellian rewrite” of the events surrounding the attack. He challenged the Republicans to find any inaccuracies in the first select committee’s probe of the event. \n\n“The fact of the matter is they have not laid a glove on a single fact that was presented in the report of the bipartisan select committee on Jan. 6. All of their bizarre counter-theories about antifa and about the FBI have been completely and thoroughly debunked. They have gotten nowhere, and yet they insist once again on returning to the scene of the crime,” he said. \n\n“That gives us the chance to reeducate new generations of Americans about the dangers of political authoritarianism, and about the dangers of political and religious cults.”\n\nWhile Jeffries has the power to name his Democratic picks for the new committee, Speaker Mike Johnson (R-La.) retains the power to veto any of those lawmakers as he deems appropriate. That was the case in 2021, when former Speaker Nancy Pelosi (D-Calif.) removed two of the initial Republican picks — Rep. Jim Jordan (R-Ohio) and former Rep. Jim Banks (R-Ind.) — for controversial statements and actions they made surrounding Jan. 6. \n\nIt’s unclear if the Speaker is ready to accept the four Democratic appointees. Jeffries said he has informed Johnson of his selections, but suggested there has been no response. \n\n“We let him know our choices for this subcommittee, and there’s zero precedent for anyone from the other party determining who is going to sit on a subcommittee — if, in fact, they want to take that subcommittee seriously,” Jeffries said. \n\nJohnson’s office did not respond Monday to a request for comment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nHouse Minority Leader Hakeem Jeffries (D-N.Y.) cautioned Republicans on Monday that they&#8230;\n\n\nThis Post: Jeffries Warns GOP May Regret Revisiting January 6 Events first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/jeffries-warns-gop-may-regret-revisiting-january-6-events/","image":"https://internewscast.com/wp-content/uploads/2025/09/Jeffries-says-GOP-will-‘regret-revisiting-Jan-6.jpg","video":null,"publish_date":"2025-09-08 23:24:39","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.137},{"id":358701592,"title":"Trump-Epstein live updates: Dems say ‘sickening’ letter shows Trump’s signature as White House labels it ‘fake news’","text":"House Democrats have bashed Donald Trump over a birthday letter claimed to be written by the president to the late convicted sex offender Jeffrey Epstein. \n\nRepresentative Jamie Raskin called it “sickening” and said, “We can’t trust a word MAGA says.”\n\n“House Democrats fought to bring this sickening letter into the light while Trump and MAGA mouthpieces assured us it did not exist,” he wrote on X. “Trump even sued the Wall Street Journal for reporting on it! We can't trust a word MAGA says. Release the full Epstein file NOW!”\n\nRepresentative Melanie Stansbury asked, “What ‘wonderful secret’ is Donald J. Trump hiding? Is this why he hasn’t released the files?” referring to the words in the letter. \n\nRepresentative Raja Krishnamoorthi wrote: “This is disturbing, disgusting, and extremely troubling. \n\n“Trump didn’t just leave a salacious note in Epstein’s Birthday Book - he added a lewd drawing, then lied about it for years. If he lied about this, what else is he hiding? The full Epstein files must be released now.”\n\nThe White House maintains Trump did not author the letter.","summary":"The infamous birthday letter’s release creates sensation online as White House continues to insist it is a hoax","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-epstein-birthday-letter-live-updates-b2822620.html","image":"https://static.independent.co.uk/2025/07/31/18/52/U-S--President-Donald-Trump-visits-Scotland-0ubepe9u.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/TZp1nkY6-4VHSaSK0.mp4","publish_date":"2025-09-08 23:20:58","author":"Oliver O'connell,Oliver O'Connell and Rachel Dobkin","authors":["Oliver O'connell","Oliver O'Connell and Rachel Dobkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.393},{"id":358707390,"title":"Epstein birthday letter DECODED: All the cryptic clues, the bizarre links to famous kids' book... and the revealing details behind Trump's signature","text":"Epstein birthday letter DECODED: All the cryptic clues, the bizarre links to famous kids' book... and the revealing details behind Trump's signature\n\nREAD MORE: Trump's Epstein crisis explodes as lewd birthday letter showing president's signature is revealed\n\nBy STACY LIBERATORE, US SCIENCE & TECHNOLOGY EDITOR\n\nPublished: 00:15 BST, 9 September 2025 | Updated: 00:15 BST, 9 September 2025\n\nA lewd birthday letter to Jeffrey Epstein, that appears to have been signed by Donald Trump, has resurfaced with seemingly cryptic phrases linked to a children's book and the president's own language.\n\nThe 2003 note, released Monday by Democrats on the Oversight Committee, reignited a controversy that has dogged the White House for months.\n\nThe commander-in-chief has dismissed the message as 'fake' and filed a $10billion defamation lawsuit against the Wall Street Journal, which first reported it. The paper denies the claim and stands by its reporting.\n\nThe Journal also published a handwriting analysis, claiming the 'Donald' signature matches Trump's past writing.\n\nThe letter opens with the line, 'There must be more to life than having everything,' the famous first sentence of Maurice Sendak's 1967 book 'Higglety Pigglety Pop! Or, There Must Be More to Life.'\n\nThe choice is striking, as Sendak, celebrated for Where the Wild Things Are, was also condemned for In the Night Kitchen, a book critics slammed as 'gratuitous' and 'pornographic.' \n\nThe apparent connection deepens as Sendak also published 'We Are All in the Dumps' with Jack and Guy in 1993, featuring a drawing of the Trump Tower \n\nThe birthday message continues with, 'Enigmas never age, have you noticed that?' and ends with, 'A pal is a wonderful thing. Happy Birthday, and may every day be another wonderful secret.' \n\nBoth phrases echo Trump's familiar style, such as in his 1990 book, he used 'enigma' to describe Don King and Mike Tyson, and again in 2004 when referring to Dan Rather. He has also repeatedly used the phrase 'a wonderful thing' in speeches and social-media posts. \n\nPresident Donald Trump is under fire once again after a lewd birthday letter bearing his signature was released by Jeffrey Epstein 's estate\n\nSendak published We Are All in the Dumps with Jack and Guy in 1993, featuring a drawing of the Trump Tower\n\nThe Journal also published a handwriting analysis, claiming the 'Donald' signature matches Trump's past writing\n\nThe birthday letter was reportedly part of a private album compiled by Ghislaine Maxwell for Epstein's 50th birthday, in which she asked friends to contribute photos, drawings, and personal notes. \n\nUnusually, Trump's message adopts a typewritten, almost theatrical style, an imaginary dialogue with Epstein, mirroring the way Trump often slips into third person when talking about himself. \n\nThe Journal highlighted examples from his 2015 campaign launch, 'Nobody would be tougher on ISIS than Donald Trump. Nobody.'\n\nThen, in 2018, while speaking at a rally in Illinois, he said: 'But because his name is Donald Trump, you have the haters and they continue to hate.'\n\nIn 2020, Trump said: 'Nobody's done more for the historically Black colleges and universities than Donald Trump. Nobody.'\n\nSendak's Higglety Pigglety Pop! is about his pet dog, Jennie, going on adventures. \n\nThis is not the first time Sendak's work has seemingly intersected with Donald Trump. \n\nHis 'We Are All in the Dumps with Jack and Guy' is a picture book that reimagined two nursery rhymes to address homelessness, the AIDS crisis, and other social issues of the time. \n\nJeffrey Epstein and Donald Trump pose together at the Mar-a-Lago estate in Florida in 1997\n\nThe birthday message features its own illustration, using a heavy black marker to trace around the text and form the shape of a woman's hour-glass body with breasts. Trump himself has shown his artistic abilities over the years, doodling cityscapes auctioned for charity (pictured)\n\nThough marketed for children, the layered illustrations were meant to resonate with adults as well. \n\nOne striking page shows homeless children gathered outside Trump Tower, shouting 'Lost!', 'Tricked,' 'Trumped,' and 'Dumped!' under the watchful gaze of a concerned moon.\n\nThe birthday message features its own illustration, using a heavy black marker to trace around the text and form the shape of a woman's hour-glass body with breasts. \n\nTrump himself has shown his artistic abilities over the years, doodling cityscapes auctioned for charity, which the Journal said features similar strokes to the birthday letter.\n\nThe letter opens with the line, 'There must be more to life than having everything,' the famous first sentence of Maurice Sendak's 1967 book Higglety Pigglety Pop! Or, There Must Be More to Life\n\nHowever, the signatures in Trump's artwork do not match what is shown on the Epstein letter. \n\nAfter Democrats released the note on Monday, White House Press Secretary Karoline Leavitt said, 'President Trump's legal team will continue to aggressively pursue litigation.\n\n'As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it,' Leavitt added.\n\nJeffrey EpsteinDemocrats\n\nShare or comment on this article:\nEpstein birthday letter DECODED: All the cryptic clues, the bizarre links to famous kids' book... and the revealing details behind Trump's signature\n\nAdd comment","summary":"A birthday note sent to Jeffrey Epstein, allegedly bearing Donald Trump's signature, has resurfaced, filled with puzzling lines that reference a children's book and echo Trump's trademark turns of phrase.","url":"https://www.dailymail.co.uk/sciencetech/article-15078605/Epstein-birthday-letter-DECODED-cryptic-clues.html","image":"https://i.dailymail.co.uk/1s/2025/09/08/23/101953449-0-image-m-15_1757369723358.jpg","video":null,"publish_date":"2025-09-08 23:15:50","author":"Editor,Stacy Liberatore","authors":["Editor","Stacy Liberatore"],"language":"en","source_country":"gb","sentiment":0.108},{"id":358702784,"title":"NBC Survey Reveals Significant Gender Gap in Generation Z","text":"Local news \n\n Two major aspects of President Donald Trump’s agenda intersected on Thursday when…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n The Supreme Court on Monday removed a judge’s restrictions on immigration stops…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n Internet Explorer 11 is not supported. For the best experience, please visit…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n WASHINGTON – Each year, the U.S. Coast Guard locates and captures multiple…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n IE 11 is not supported. For an optimal experience visit our site…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n LIVINGSTON COUNTY, Ill. (WCIA) — The Livingston County Health Department announced that…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n ST. PETERSBURG, Fla. (WFLA) — A homicide inquiry was initiated Sunday after…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n CAPE CANAVERAL, Fla. – SpaceX on Monday night will attempt to launch…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n SAVANNAH, Ga. () — The three young men who stood trial in…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n Internet Explorer 11 is not supported. For the best experience, please visit…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n WASHINGTON (AP) The Trump administration on Monday asked the Supreme Court for…\n\n InternewscastSeptember 8, 2025\n\n \n\n Local news \n\n IE 11 is not supported. For an optimal experience visit our site…\n\n InternewscastSeptember 8, 2025","summary":"Internewscast Journal\n\nInternewscast\n\n\nIE 11 is not supported. For an optimal experience visit our site&#8230;\n\n\nThis Post: NBC Survey Reveals Significant Gender Gap in Generation Z first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/nbc-survey-reveals-significant-gender-gap-in-generation-z/","image":"https://internewscast.com/wp-content/uploads/2025/09/NBC-poll-finds-big-gender-divide-among-Gen-Z.jpg","video":null,"publish_date":"2025-09-08 23:11:52","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.11},{"id":358702146,"title":"Charlotte mayor ripped for saying career criminal deserves 'compassion' after video showed him stabbing Ukrainian refugee","text":"The woke mayor of North Carolina's largest city has been slammed online for defending a career criminal who brutally stabbed a Ukrainian refugee to death. \n\nCharlotte Mayor Vi Lyles has suggested that 35-year-old Decarlos Brown Jr. is simply a victim of the justice system even as he faces first-degree murder charges for the death of 23-year-old Iryna Zarutska.\n\nShe noted that the suspect - who is homeless and has a litany of previous offenses - has struggled with mental health issues and seemed to have 'suffered a crisis' when he allegedly killed Zarutska onboard a South End light rail train on August 22.\n\n'This is a tragic situation that sheds light on problems with society safety nets related to mental healthcare and the systems that should be in place,' the mayor said in her initial statement to WSOC reporter Joe Bruno.\n\n'We will never arrest our way out [of] issues such as homelessness and mental health,' she said, adding that mental health problems should be 'treated with the same compassion, diligence and commitment as cancer or heart disease.'\n\n'Also, those who are unhoused are more frequently the victim of crimes and not the perpetrators,' Lyles continued in her tone-deaf statement. 'Too many people who are on the street need a safe place to sleep and wrap around services that lift them up.\n\n'We, as a community, must do better for those members of our community who need help and have no place to go,' she concluded.\n\nAfter surveillance footage was then released, showing Brown Jr. watching Zarutska for some time before he swung a knife at her as she sat with her phone, Lyles released a new statement thanking 'media partners and community members who have chosen not to repost or share the footage out of respect' for the victim's family.\n\n'This was a senseless and tragic loss,' she said. 'Like so many of you, I'm heartbroken - and I've been thinking hard about what safety really looks like in our city.\n\n'I remain committed to doing all we can to protect our residents and ensure Charlotte is a place where everyone feels safe.' \n\nThe mayor is now seeing swift backlash for her comments, with one X user noting that she made 'no mention of the killer's 14 arrests and multiple felonies.\n\n'Our empathy keeps getting used to excuse evil. And it's literally getting us killed,' he wrote.\n\nAnother X user said that 'every single thing that Charlotte's mayor, Vi Lyles, said about the murder of Iryna Zarutska is ridiculous, dangerous nonsense,' and conservative influencer Collin Rugg called her a 'total lunatic.' \n\n'We should not use the death of an innocent woman to make excuses for the criminals,' a fourth X user wrote. 'The world is full of evil and we should not tolerate it.'\n\nOthers even called for Lyles to resign, or warned that she could be voted out of office.\n\n'This Mayor Vi Lyles should be held accountable,' one X user wrote. 'She's more upset about the video being released and only shows compassion for the homeless low life who is a literal monster.\n\n'Charlotte deserves better. America deserves better,' he added. \n\nPodcaster Alec Lace even pointed out that the liberal mayor knelt for George Floyd 'but now urges people NOT to share Iryna Zarutska's video.\n\n'She didn't even mention the name of her killer, Decarlos Brown,' he noted, suggesting: 'She should resign.'\n\nBut Lyles is not the only city official facing backlash for Zarutska's murder - as it was revealed that Magistrate Judge Teresa Stokes freed Brown Jr. in January - just about seven months before police say he stabbed the Ukrainian refugee.\n\nShe had allowed the career criminal to walk free on a 'written promise' that he would return for his next court appearance following his arrest in January for 'misuse of the 911 system.'\n\nBrown Jr. dialed the emergency number while police were conducting a welfare check on him. \n\nDuring the ordeal, Brown, who is schizophrenic, told police he thought that 'man made' materials were inside his body controlling his movements. \n\n'Brown wanted officers to investigate this \"man-made\" material that was inside of his body,' an arrest affidavit reads.\n\n'Officers advised Brown that the issue was medical issue and that there was nothing further they could do.' \n\nThis response sent Brown into a rage, and he called 911. Officers arrested him and charged him with a misdemeanor.\n\nEven Brown's mother said the court system failed the community by allowing him to roam free despite his serious mental health issues, according to Newsweek. \n\nShe said he was placed under psychiatric monitoring for two weeks after she secured an involuntary commitment order when he was diagnosed with schizophrenia in 2014. \n\nThe desperate mother said that he became so aggressive that she had to kick him out of her home. \n\nBrown's lengthy criminal history also includes assaulting his sister in 2021, leaving her with minor injuries, and armed robbery in 2014.\n\nDespite these crimes, and Brown being a potential flight risk because he was not fixed to any set address, Stokes released him during his court hearing about the 911 call. \n\nA document outlining the condition of his release seen by the Daily Mail shows that it was authorized with only a 'written promise to appear' at his next court hearing. \n\nThe court memo from Mecklenburg County includes Stokes' signature, and one of Brown's many mugshots showing him looking dazed with his eyebrows raised. \n\nSocial media users have been quick to name and shame the judge, claiming that she should take responsibility for allowing Brown to be free to commit his next crime, which ultimately ended a 23-year-old refugee's life.\n\nFlorida Rep. Randy Fine called for 'every judge' who released Brown to be 'held accountable'. \n\nSharing a photograph of Iryna alongside Brown, he wrote: 'This monster on the right is who the pro-crime Democrats want sitting next to you and your family on public transportation. \n\n'I pray for the family of Iryna Zarutska. Every judge that released the criminal Decarlos Brown needs to be held accountable.'\n\nPresident Donald Trump also shared his outrage over Zarutska's death on his Truth Social page on Monday.\n\n'I have seen the horrific video of a beautiful, young Ukrainian refugee, who came to America to escape the vicious War in Ukraine, and was innocently riding the Metro in Charlotte, North Carolina, where she was brutally ambushed by a mentally deranged lunatic,' Trump wrote.\n\n'The perpetrator was a well known career criminal, who had been previously arrested and released on CASHLESS BAIL in January, a total of 14 TIMES. What the hell was he doing riding the train, and walking the streets? Criminals like this need to be LOCKED UP.'\n\nTrump then inserted the murder into the 2026 Senate race between Democrat former North Carolina Governor Roy Cooper and ex-RNC co-chairman Michael Whatley. \n\n'The blood of this innocent woman can literally be seen dripping from the killer’s knife, and now her blood is on the hands of the Democrats who refuse to put bad people in jail, including Former Disgraced Governor and “Wannabe Senator” Roy Cooper. North Carolina, and every State, needs LAW AND ORDER, and only Republicans will deliver it!' \n\nHe also wondered why the story had been ignored by the left-leaning press. \n\n'Additionally, where is the outrage from the Mainstream Media on this horrible tragedy? VOTE FOR MICHAEL WHATLEY FOR UNITED STATES SENATE, HE WON’T LET THIS HAPPEN AGAIN!'\n\nMeanwhile, Brown Jr. is facing first-degree murder charges for the brutal stabbing.\n\nHis previous crimes saw him serve five years in prison for a 2014 armed robbery and was released in September, 2020.\n\nJust months after his release from prison, on February, 2021, Brown was arrested for assaulting his sister in Charlotte and leaving her with minor injuries, according to police records obtained by the Daily Mail.\n\nThat same month, he was also arrested for injury to personal property and trespassing. \n\nA police report from that incident said Brown 'returned to the address after being told he was not allowed back and kicked and damaged the front door of the listed victim's residence.'\n\nIn July 2022, Brown was then arrested again for a domestic disturbance.\n\n'[Brown] was arrested for disorderly conduct. The suspect was yelling and cursing, causing a disturbance and drawing the attention of multiple tenants while on the property the call for service was located,' read the police report.\n\nBrown's arrest records go as back as 2007, when he was still a minor\n\nOver the next seven years, he was arrested at least six times for crimes including felony larceny, robbery with a dangerous weapon and communicating threats.\n\nAccording to the Charlotte Observer, most of the charges he faced during that time were dropped.\n\nWhen reached for comment, the Mecklenburg District Attorney's Office told the Daily Mail Tuesday it cannot speak about defendants with pending cases. \n\n'In broad terms, it remains the position of the District Attorney’s office that those who commit violent crimes should be held in custody pending trial,' the DA's office said.\n\nDaily Mail has also reached out to Lyle's office for comment.","summary":"Charlotte Mayor Vi Lyles has been slammed online for defending career criminal Decarlos Brown Jr. 35, who is accused of brutally stabbing Ukrainian refugee Iryna Zarutska, 23, to death.","url":"https://www.dailymail.co.uk/news/article-15078661/Charlotte-mayor-Decarlos-Brown-Iryna-Zarutska.html","image":"https://i.dailymail.co.uk/1s/2025/09/08/23/101956305-0-image-a-20_1757371381185.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/06/361721927284406509/1024x576_MP4_361721927284406509.mp4","publish_date":"2025-09-08 23:11:39","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.404},{"id":358704784,"title":"How Chicago doctors are encouraging telehealth during the expected ICE surge","text":"As President Donald Trump’s deportation efforts in Chicago scale up, health care providers are promoting telehealth for people in immigrant communities. They say it’s too soon to assess the impact of Trump’s campaign, which is expected to last about six weeks, but they are prepared.\n\n“Any time there is a wave of increased ICE activity, we will see a wave of patients opting to cancel appointments or do them by telehealth,” said Steph Willding, CEO of CommunityHealth, a primary and specialty care provider that treats uninsured adults and many immigrants.\n\nWhen immigration enforcement has spiked this year, she said they have seen higher rates of cancelations, no-shows and lower medication pick-up rates, especially at their location in Little Village, where many immigrants live.\n\nThis is another period of intense uncertainty, Willding said.\n\n“There’s a lot of ways in which our command structure right now is operating similarly to how we did during the first months of the pandemic, where we are taking it day by day.”\n\nLast week, at least three clinics operated by Esperanza Health Centers saw an increase in no-show appointments in anticipation of Trump’s enforcement campaign in Chicago, said Ricardo Cifuentes, vice president of external affairs.\n\nCommunityHealth, Esperanza Health Centers and Cook County Health are highlighting their telehealth services to patients. The county is encouraging patients to call (312) 864-0200 or to visit their ExpressCare website, https://cchvirtualcare.org/, for nonemergency medical concerns.\n\nCommunityHealth also has a partnership with Uber Health to give patients rides to their appointments, which include care for a range of chronic conditions, so they can avoid public transportation. Patients who need to pick up medication can also designate another person to pick up their prescription, Willding said.\n\nThey also created a new position for someone to monitor the facility’s front door at all times, she said. In addition, staff members have been trained on immigrant rights and on how to differentiate between warrants that ICE agents could present.\n\n“We’ve run drills on all of that as well to ensure that ... what we hope is an unlikely event of federal immigration coming to CommunityHealth, that we are prepared for engaging with them,” Willding said.\n\nStaff and volunteers at CommunityHealth try to reassure patients on the steps they are taking to protect immigrants because some patients have told them they are only leaving their homes for doctor’s appointments, Willding said. And while an increase in ICE can cause stress and anxiety, they have so far not seen an increase in referrals for behavioral health services.\n\n“For some of our patients, when they leave their home, they fear that they will never go back … that they will be taken and so when you are in that survival mode, your hierarchy of needs becomes very different than it does under normal circumstances,” Willding said.\n\nCifuentes said the anxiety and fear of ICE agents and the possible deployment of the National Guard has cast a shadow not just for immigrants but for many staff and community members. And while they will assess if they need to close early on a certain day depending on activities in the city, he said the clinics will continue to welcome immigrants.\n\n“We’re committed to remaining open,” Cifuentes said. “People need to know that they can continue to get their health care where they need and somewhere that they trust. And that’s what we’ll continue to do.”","url":"https://chicago.suntimes.com/immigration/2025/09/08/how-chicago-doctors-are-encouraging-telehealth-during-the-expected-ice-surge","image":"https://cst.brightspotcdn.com/dims4/default/d8ebe41/2147483647/strip/false/crop/8192x5464+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F2a%2Fda%2F2f7989f1483fac9213ae2823e3f0%2F20250","video":null,"publish_date":"2025-09-08 23:10:15","author":"Elvia Malagón","authors":["Elvia Malagón"],"language":"en","source_country":"us","sentiment":0.142},{"id":358704576,"title":"Underreported Story of Trans Offender Threatening to Victimize Girls, Shoot Schools, Raises Unsettling Terror Questions","text":"What if I told you a man who identifies as a “transgender woman” threatened to victimize girls in girls’ bathrooms, shoot up schools, and bomb churches? Would that make you more likely to support efforts to investigate whether some people who identify as transgender pose a terrorist threat?\n\nMost Americans haven’t heard the name of Jason Lee Willie, a man who identifies as female and goes by the name Alexia, but his case highlights the unnerving possibility that many people who identify as transgender may pose a violent threat to their fellow Americans.\n\nAmericans are more familiar with the man identifying as a woman who killed two and injured 17 at a Minneapolis Catholic school last month before taking his own life. They also know about the woman identifying as a man who killed three children and three adults at The Covenant School in Nashville, Tennessee, in March 2023.\n\nThe list of shooters and offenders who identify as transgender has been growing in recent years, which raises uncomfortable questions about potential ties between gender ideology or experimental gender drugs and violence.\n\nDoes the rhetoric of the transgender movement encourage hatred against Christians and conservatives? Do the interventions euphemistically termed “gender-affirming care” make people more unstable? \n\nAmerica’s elites and the legacy media seem all too curious about the motives of any shooter they can tie to the Right, but they obfuscate whenever such violence raises questions that are inconvenient for their narrative. Thankfully, the White House under President Donald Trump is willing to investigate these matters. \n\nBack in 2023, Willie, then 47, faced a federal indictment for making violent threats across state lines. While some news outlets covered the story then, few reporters sought to follow up. The Daily Signal checked on the status of the case, now two years later, and can reveal from court documents that Willie confessed to making the violent threats as part of a plea deal in June 2024.\n\nA judge sentenced him to one year in prison last year, a fact that only the outlet Reduxx appears to have reported. \n\nIn a Stipulation of Facts, Willie admitted to making a host of violent threats over the online video platform MeetMe.\n\nWhat Willie Said\n\nWillie’s threats have yet to see the light of day perhaps because they are so damning to the narrative that people who identify as transgender are the real victims. Willie made repeated threats of violence against Christians, black people, and children.\n\nHere is a sampling of his remarks. \n\n“We’re out here walking into your school, shooting your children, and I’m gonna tell you right now, I’m gonna be one of them and the FBI isn’t gonna stop me, but I’m gonna kill your children out here,” Willie said between March and August 2023.\n\nSpeaking to a black woman about August 2023, he said, “We’re going to war. We’re going to kill you.” He repeatedly used the N-word.\n\nAt about the same time, he said, “Well, I guarantee I’ll be in the bathroom raping your Christian daughters, and there ain’t nothing you f—ts can do about it. You hear me?”\n\n“I’m in the bathroom feeling your little girls’ p—s, I’m in there feeling on their p—s,” he said at about the same time. “I’m openly a pedophile. … I’m transgender, I’m in the bathroom raping your f—ing daughters and I’m openly letting you guys know this. The Republican Party, what are you f—ts going to do about us?”\n\nReferring to the Covenant School shooting, Willie said, “A person in Tennessee walked into one of your schools and shot up a bunch of your Christian daughters. That’s not the last of them if you don’t shut your f—ing mouth.”\n\n“There’s a lot of transgenders out here that are tired of being picked on and we’re going to go into the schools and we’re going to kill their f—ing children out here, and that’s the end of it,” he said. “We’re at war.”\n\nHe condemned black Christians, calling them “Christian trash” between March and August 2023. \n\n“They’re transphobic, they’re homophobic,” he said. “They’re no different than the f—ing white supremacists.”\n\nA woman on screen responded that if she saw Willie in a church, she would want to hug him. Willie responded, “We’re gonna bomb them, we’re gonna bomb them. We’re gonna bomb the churches.”\n\nBetween March and August 2023, he threatened to inject Christian women with HIV-positive needles in a restroom.\n\n“I catch you b—hes out here with a cross around your neck in that restroom, you better know we’re going to hit you with a f—ing syringe,” he said. He mentioned going after “your women with HIV in the restroom, [N-word], with a needle. I’m injecting them.”\n\nThese quotes weren’t drafted by TurningPoint USA Founder Charlie Kirk or Daily Wire host Michael Knowles as false flags to attack transgender people. They’re not even allegations. These are quotes Willie agreed that he said as he pleaded guilty to making violent threats. \n\nWhat the Trump Administration Is Doing\n\nThe White House is drafting a national security strategy on terrorism that specifically addresses threats from people who identify as transgender, The Daily Wire reported.\n\nThis investigation should consider the Minneapolis and Nashville shootings, along with Willie’s threats.\n\nTo be clear, I am not saying that everyone who identifies as transgender poses a threat to his or her fellow Americans. I don’t have evidence that such people pose a worse threat than other segments of society, but I do believe that recent events justify an investigation, and that the legacy media is working to bury facts that are inconvenient for the narrative that transgender people are first and foremost victims.\n\nThat said, I flatly oppose the other policy position the Trump Justice Department is reportedly considering.\n\n“Individuals within the DOJ are reviewing ways to ensure that mentally ill individuals suffering from gender dysphoria are unable to obtain firearms while they are unstable and unwell,” a Justice Department source told The Daily Wire. Sources also confirmed to Breitbart News that the DOJ held discussions on the matter.\n\nWhile some people who identify as transgender may pose a threat to their fellow Americans, most of them do not, and Americans do not lose their Second Amendment rights when they identify as the opposite sex. \n\nThe administration is wise to investigate a potential terrorism threat from some people who identify as transgender, and any such investigation should consider the case of Alexia Willie, which has received far less attention than it deserves.","summary":"What if I told you a man who identifies as a &#8220;transgender woman&#8221; threatened to victimize girls in girls&#8217; bathrooms, shoot up schools, and bomb... Read More\n\n\nThe post Underreported Story of Trans Offender Threatening to Victimize Girls, Shoot Schools, Raises Unsettling Terror Questions appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/08/trans-threats-victimize-girls-shoot-schools-highlight-need-combat-transgender-terrorism/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/Audrey-Hale-Nashville-shooting.jpg","video":null,"publish_date":"2025-09-08 23:10:00","author":"Tyler O'Neil","authors":["Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":0.328},{"id":358700876,"title":"Man accused of trying to assassinate Trump apologises to potential jurors","text":"The man charged with trying to assassinate Donald Trump while he played golf last year in South Florida stood before a group of potential jurors in a Florida courtroom on Monday and said he was “sorry for bringing you all in here”.\nRyan Routh is representing himself in the trial that began with jury selection on Monday in the federal courthouse in Fort Pierce, Florida.\n“Thank you for being here,” Routh told the first group of 60 jurors who were brought into the courtroom after US District Judge Aileen Cannon introduced prosecutors and Routh to the panel.\nCannon signed off on Routh’s request to represent himself but said court-appointed lawyers needed to remain as standby counsel.\nDuring a hearing earlier to go over questions that would be asked of jurors, Routh was partially shackled. But he did not appear to be restrained when the first of three batches of 60 potential jurors were brought into the courtroom on Monday afternoon.\nCannon dismissed the questions Routh wanted to ask jurors as irrelevant earlier on Monday. They included asking jurors about their views on Gaza, the talk of the US acquiring Greenland and what they would do if they were driving and saw a turtle in the road.\nThe judge approved most of the other questions for jurors submitted by the prosecutors.\nThe panel of 120 potential jurors filled out questionnaires on Monday morning and the first group was brought into the courtroom during the afternoon session. The judge inquired about any hardships that would prevent them from sitting as jurors during a weeks-long trial. Twenty-seven noted hardships and the judge dismissed 20 of them on Monday.\nThe other two groups of jurors will return to the courtroom on Tuesday morning for similar questioning. Those who are not dismissed will then return at 2pm on Tuesday for further questioning about the case and their views.\n\nThe court has blocked off four weeks for Routh’s trial, but lawyers are expecting they will need less time.\nJury selection was expected to take three days in an effort to find 12 jurors and four alternates. Opening statements were scheduled to begin on Thursday and prosecutors will begin their case immediately after that.\nCannon told Routh last week that he would be allowed to use a podium while speaking to the jury or questioning witnesses, but he would not have free rein in the courtroom.\nCannon is a Trump-appointed judge who drew scrutiny for her handling of a criminal case accusing Trump of illegally storing classified documents at his Mar-a-Lago estate in Palm Beach.\nThe case became mired in delays as motions piled up over months and was ultimately dismissed by Cannon last year after she concluded that the special counsel tapped by the Justice Department to investigate Trump was illegally appointed.\nRouth’s trial begins nearly a year after prosecutors say a US Secret Service agent thwarted Routh’s attempt to shoot the Republican presidential nominee.\nRouth, 59, has pleaded not guilty to charges of attempting to assassinate a major presidential candidate, assaulting a federal officer and several firearm violations.\nJust nine weeks earlier, Trump had survived another attempt on his life while campaigning in Pennsylvania. That gunman had fired eight shots, with one bullet grazing Trump’s ear, before being shot by a Secret Service counter sniper.\n\nProsecutors have said Routh methodically plotted to kill Trump for weeks before aiming a rifle through the shrubbery as Trump played golf on September 15 at his West Palm Beach country club.\nA Secret Service agent spotted Routh before Trump came into view. Officials said Routh aimed his rifle at the agent, who opened fire, causing Routh to drop his weapon and flee without firing a shot.\nPolice obtained help from a witness who prosecutors said informed officers that he saw a person fleeing. The witness was then flown in a police helicopter to a nearby interstate where Routh was arrested, and the witness confirmed it was the person he had seen, prosecutors have said.\nThe judge last week unsealed the prosecutor’s 33-page list of exhibits that could be introduced as evidence at the trial. It says prosecutors have photos of Routh holding the same model of semi-automatic rifle found at Trump’s club.\nRouth was a North Carolina construction worker who in recent years had moved to Hawaii. A self-styled mercenary leader, Routh spoke out to anyone who would listen about his dangerous, sometimes violent plans to insert himself into conflicts around the world, witnesses have told Associated Press.\nIn the early days of the war in Ukraine, Routh tried to recruit soldiers from Afghanistan, Moldova and Taiwan to fight against Russia. In his native Greensboro, North Carolina, he was arrested in 2002 for eluding a traffic stop and barricading himself from officers with a fully automatic machine gun and a “weapon of mass destruction”, which turned out to be an explosive with a 10-inch fuse.\nIn 2010, police searched a warehouse Routh owned and found more than 100 stolen items, from power tools and building supplies to kayaks and spa baths. In both cases, judges gave Routh either probation or a suspended sentence.\nIn addition to the federal charges, Routh also pleaded not guilty to state charges of terrorism and attempted murder.","summary":"The man charged with trying to assassinate Donald Trump while he played golf last year in South Florida stood before a group of potential jurors in a Florida courtroom on Monday and said he was “sorry for bringing you all in here”.\nRyan Routh is representing himself in the trial that began with jury selection on Monday in the federal courthouse in Fort Pierce, Florida.\n“Thank you for being here,” Routh told the first group of 60 jurors who were brought into the courtroom after US District Judge...","url":"https://www.scmp.com/news/world/article/3324809/man-accused-trying-assassinate-trump-apologises-potential-jurors","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/09/09/91c66dce-6869-435b-ac44-70876f51e123_bb924e75.jpg","video":null,"publish_date":"2025-09-08 23:09:16","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.027},{"id":358707106,"title":"Trump Vs Newsom Heats Up: Political Sparring Turns Into Full-Blown Meme War | Guess Who’s Losing?","text":"The feud between President Donald Trump and California Governor Gavin Newsom has escalated into a full-blown meme war on social media platforms like Truth Social and X. What began as policy disagreements over immigration and National Guard deployments has turned into viral exchanges, with both leaders trading doctored videos and biting posts. Trump and Newsom’s relationship, once cordial over wildfire aid in 2023, soured over immigration raids and Guard deployments in Los Angeles. Trump has repeatedly called Newsom “incompetent” and suggested potential legal action, while Newsom labelled Trump’s approach “unhinged” and “authoritarian.” A federal lawsuit by Newsom against Trump regarding the Guard deployment ended in a California victory, paving the way for this online feud. Last week, the conflict intensified with doctored videos and memes posted by both leaders. On September 3, Trump shared a video placing Newsom’s face on a man punching a Trump-branded bag. Newsom responded on X with memes mocking Trump’s temperament and health, igniting hashtags like #DementiaDon. Newsom’s Digital Rise and Democratic Clout Political strategist Garry South praised Newsom’s approach during an interaction with CNN, saying ridicule effectively targets Trump’s ego. Since June, Newsom’s X account has gained 450,000 followers, with Google searches for him surging 1,300%. A Politico poll lists him as the top 2028 Democratic contender among California voters, ahead of Alexandria Ocasio-Cortez and Pete Buttigieg. The governor has proposed a special election to redraw California’s congressional maps, potentially adding five Democratic seats. With support from House leaders like Nancy Pelosi and Hakeem Jeffries, Newsom’s strategy combines digital virality with political maneuvering. Trump has mentioned Newsom 41 times in 2025 alone, highlighting the president’s fixation. Other Democrats in the Fray While other Democratic governors, including J.B. Pritzker and Wes Moore, have challenged Trump, Newsom’s viral content has set him apart. AI-generated images showing him as a superhero and memes like “AMERICA’S MOST FAVORITE GOVERNOR” have racked up millions of views, per CNN. A meme coin launch further boosted his online presence. Observers note that Newsom’s tactics resonate with Democratic supporters, while conservatives like Fox News’s Dana Perino criticise the approach as a waste of resources. With 225 million X impressions since August, Newsom has effectively taken the lead in this digital showdown. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"The feud between President Donald Trump and California Governor Gavin Newsom has escalated into a full-blown meme war on social media platforms like Truth Social and X. What began as policy disagreements over immigration and National Guard deployments has turned into viral exchanges, with both leaders trading doctored videos and biting posts.","url":"https://www.timesnownews.com/world/us/us-news/donald-trump-vs-gavin-newsom-heats-up-political-sparring-turns-into-full-blown-meme-war-guess-whos-losing-article-152734121","image":"https://images.timesnownews.com/thumb/msid-152734166,thumbsize-36854,width-1280,height-720,resizemode-75/152734166.jpg","video":null,"publish_date":"2025-09-08 23:08:22","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":0.147}]}