{"offset":0,"number":50,"available":10535,"news":[{"id":374273036,"title":"Gayle King reportedly exiting 'CBS Mornings' in latest network shakeup","text":"Longtime CBS star Gayle King is reportedly leaving \"CBS Mornings,\" marking the latest shakeup at the Tiffany Network. Variety reported Thursday that King is expected to step down as co-host of CBS' marquee morning program next year after more than a decade, citing four sources familiar with the plan. However, Variety suggests that although her contract is set to expire in May, King may remain with CBS News and produce content for the network, resembling Norah O'Donnell's arrangement when she stepped down as the anchor of \"CBS Evening News\" earlier this year. \"There have been no discussions with Gayle about her contract that runs through May 2026. She’s a truly valued part of CBS and we look forward to engaging with her about the future,\" a spokesperson for CBS News told Variety. OUSTED CBS NEWS STAFFER TAKES TO TIKTOK TO ACCUSE NETWORK OF RACE-BASED LAYOFFS CBS News nor Paramount immediately responded to Fox News Digital's requests for comment. King joined CBS News in 2012 and was part of the network's morning show relaunch, then called \"CBS This Morning.\" While other co-hosts rotated in and out of the program over the years, King was the one who kept her seat. But she has struggled to give CBS a ratings lift despite having a roster of A-list pals like Oprah Winfrey and her mega salary ranging from $10-15 million per year, according to reports. Her expected departure from \"CBS Mornings\" comes just days after her network colleague John Dickerson announced he is exiting \"CBS Evening News,\" which he began co-anchoring with Maurice DuBois. Both programs have struggled to compete in the ratings battle against their broadcast rivals, trailing in third behind ABC and NBC for several years. PARAMOUNT TO SLASH APPROXMINATELY 1,000 JOBS IN BRUTAL ROUND OF LAYOFFS CBS News has had a tumultuous year, beginning with a lawsuit filed by President Donald Trump over election interference allegations — which was ultimately settled by its parent company Paramount — and having a new owner following Paramount's $8 billion merger with Skydance Media. David Ellison, Paramount's new CEO, tapped Bari Weiss to become editor-in-chief of CBS News as part of his $150 million acquisition of her outlet The Free Press earlier this month. CBS NEWS ANCHOR JOHN DICKERSON TO EXIT NETWORK AS BARI WEISS-ERA SHAKEUP BEGINS Paramount also implemented a brutal round of layoffs this week, impacting approximately 1,000 jobs across the entire company. Several divisions of CBS News, including its Saturday and livestream programming as well as its Race & Culture Unit, were gutted as a result. CLICK HERE TO GET THE FOX NEWS APP","summary":"&quot;CBS Mornings&quot; co-host Gayle King is expected to leave the program next year as part of the network&apos;s ongoing shakeup, according to a report from Variety.","url":"https://www.foxnews.com/media/gayle-king-reportedly-exiting-cbs-mornings-latest-network-shakeup","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/gayle-king-2021.jpg","video":null,"publish_date":"2025-10-31 01:03:41","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.008},{"id":374272020,"title":"HANNAFORD: Austerity or activism? Carney’s budget will try to be both","text":"Expectations are grim for next week's budget, the Carney government’s first — and indeed, the first Canada has seen in more than 18 months: a record deficit, limited room to manoeuvre, and what the prime minister himself has warned will require “sacrifice” (from Canadians, of course...)But according to political strategist Yaroslav Baran, this week's guest on The Hannaford Show, Canadians should prepare for something stranger than mere belt-tightening..“It’s going to be both an austerity budget and a big-spending budget,” said Baran, co-founder of The Pendulum Group and a former communications director in Prime Minister Stephen Harper's government, more than ten years ago. “Deep spending in very targeted areas — defence, housing, nation-building infrastructure, and relief for sectors hit by Trump tariffs — but pretty lean, even cutting, everywhere else. The public service can expect a 7½ percent haircut.”.In other words, he said, it will be neither a true deficit-control plan nor an election-year “Christmas-tree” budget. “It’s a hybrid — a little pain and a few presents.\"The deficit will be huge.\"They will spin it as a ‘generational investment.’Since taking office in March, Mark Carney has promised to “build” — homes, infrastructure, and Canada’s reputation as a reliable economic partner. Yet Baran cautioned that seven months in, the record is mostly architecture without results..“There’s been a lot of structure-building, but we’re still waiting for outcomes,” he said. “Creating a new home-building agency is not the same as delivering homes. That’s a means, not an end.”He pointed to the creation of the Major Projects Office as the government’s signature accomplishment — “largely modelled on Stephen Harper’s old version” — but stressed that it’s “about enabling results, not achieving them.”Baran was even less impressed by the decision to launch a federal crown developer to build and repurpose housing directly.“Ninety-five percent of homes in this country are built by the private sector,” he said. “I’d rather see tax incentives, accelerated depreciation, and zoning reform that let private builders do what they do best. Instead, this looks like a 1970s approach that assumes the state must be the agent of all good.”.The budget is also expected to feature a sharp increase in defence spending — at least on paper. “The government has promised to reach two percent of GDP for defence by March 31,” Baran noted. “I’ll believe it when I see it.”The problem, he said, is not only political will but capacity. “Our armed forces are so depleted that even recruitment centres are understaffed. You can give a 20 percent pay raise with the stroke of a pen, and they deserve it, but it’s harder to recruit and retain people, and to re-equip and deliver ships and aircraft in just six months.”One area where Carney’s tone has shifted — if not yet his policy — is energy. Would the prime minister respond to Alberta Premier Danielle Smith’s demand to remove the Trudeau-era barriers to resource development such as the “no-pipelines” Bill C-69, the Pacific tanker ban, and the emissions cap?.“I’d be stunned if that’s in the budget,” Baran said, “but it’s true — compared to Justin Trudeau, Mark Carney sounds almost conservative. He wants to build things again. He wants to re-engage the natural-resource economy. Those are good signs. The question is whether we’ll actually see delivery.”Baran said it will take time — and perhaps some political nerve — to cut through the regulatory tangle that keeps shovels out of the ground. “There’s been a lot of planning, but ask me again when the projects are completed,” he said. “That’s when we’ll know whether the Carney government can really deliver.”Carney’s budget will also unfold under the shadow of renewed U.S. tariffs — fallout from Ontario Premier Doug Ford’s ill-timed political ad campaign, which prompted a furious reaction from Donald Trump.Conservative Leader Pierre Poilievre recently accused Carney of failing to keep his promise to “handle Trump.” Was this fair? Nobody really 'handles' Trump, after all.Yes it was fair, says Baran. \"The prime minister set himself up for criticism. He won the election as the self-proclaimed Trump whisperer,” he said. “He told Canadians, ‘Elect me and I’ll get this done.’ Well, he hasn’t yet. In politics, expectation management matters — and he raised expectations unrealistically high.”The trade rift has also revived calls for Canada to “diversify” its export markets. Baran, however, was blunt about the limits of that approach. “Our trade with the U.S. is at least ten times greater than with China,” he said. “You can’t offset that overnight — not even in a decade.”He warned that China, despite Carney’s recent outreach, remains an unreliable partner. “They’ll lift tariffs one day and ban canola the next. It’s always geopolitical.”Asked how long Canadians should give the new prime minister before judging his record, Baran said patience is warranted — but not endless. “That’s why we have four-year election terms,” he said.“But Mr. Carney set the bar very high. Let’s see if he can meet it.”Hannaford airs at seven o'clock tonight.","summary":"Expectations are grim for next week's budget, the Carney government’s first — and indeed, the first Canada has seen in more than 18 months: a record deficit, limited room to manoeuvre, and what the prime minister himself has warned will require “sacrifice” (from Canadians, of course...)","url":"https://www.westernstandard.news/watch/hannaford/hannaford-austerity-or-activism-carneys-budget-will-try-to-be-both/68623","image":"https://media.assettype.com/westernstandard/2025-10-30/xs7ggnsk/CMS-Template-2025-10-30T145721.780.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-10-31 00:59:00","author":"Nigel Hannaford","authors":["Nigel Hannaford"],"language":"en","source_country":"ca","sentiment":-0.077},{"id":374269686,"title":"South Korea's APEC live: Leaders begin to arrive for Day 1 of meetings","text":"GYEONGJU, South Korea/TOKYO -- South Korea is hosting this year's Asia-Pacific Economic Cooperation forum in the southeastern city of Gyeongju. Beyond the leaders summit itself, which runs Friday and Saturday, a number of high-pressure bilateral meetings are being held.\n\nSouth Korean President Lee Jae Myung, who took office in June, is in the spotlight as counterparts including U.S. President Donald Trump, Chinese President Xi Jinping and new Japanese Prime Minister Sanae Takaichi converge in his country.\n\nFollow the flurry of diplomacy over the coming days with Nikkei Asia.\n\nFurther reading:\n\nHere are the latest updates (local time):\n\nFriday, October 31\n\n9:30 a.m. Leaders begin to arrive to greet Lee. First up was IMF Managing Director Kristalina Georgieva. Treasury Secretary Scott Bessent is representing the U.S.\n\n9:17 a.m. South Korean President Lee Jae Myung looks out of a window as he awaits the arrival of leaders on a red carpet.\n\n9:15 a.m. Good morning from a crowded media center in Gyeongju. Today we have another busy day of events. Some highlights include a speech by Nvidia CEO Jenson Huang, a possible first summit between new Japanese Prime Minister Sanae Takaichi and Chinese President Xi Jinping, plus of course the first day of the actual APEC meetings, the obligatory group photo and a gala dinner this evening.\n\nThursday, October 30\n\n8:00 p.m. The Lee-Takaichi meeting lasted for about 45 minutes, more than twice as long as it was supposed to. The South Korean president told the new Japanese leader: \"In the volatile international situation and trade environment, South Korea and Japan are neighboring countries that have a lot in common. So I think that we need to strengthen future-oriented cooperation now more than ever.\"\n\nAfterward, Takaichi acknowledged the neighbors' differences but vowed to manage the ties and \"develop Japan-South Korea relations in a future-oriented and stable manner.\"\n\n6:50 p.m. Japan's Takaichi is meeting with South Korea's Lee now.\n\n6:00 p.m. Philippine President Ferdinand Marcos Jr. arrived in South Korea a short while ago. Before his trip, he spoke to reporters, saying that \"we must recognize the immense economic gravity of the APEC region.\"\n\n\"We convene at a critical juncture, defined by evolving geopolitical landscapes, supply chain disruptions, threats of climate change and the urgent need for equitable and inclusive growth,\" Marcos said. He vowed to demonstrate the Philippines' commitment to economic partnerships and a favorable business environment, and said participation in APEC would help \"produce concrete, meaningful outcomes that enhance cooperation, drive connectivity, and promote inclusive prosperity.\"\n\n5:45 p.m. Starting her visit to South Korea, Japan's Takaichi posts on X about her expectations for the APEC summit, saying it will not only discuss trade and investment but also challenges like AI and demographics. She says that in her talks with South Korea's Lee and other leaders, she will aim to \"firmly establish trust.\"\n\n4:45 p.m. South Korean Foreign Minister Cho Hyun tells reporters that APEC member states are \"very close\" to reaching an agreement on a joint statement, but he would not specify any of the possible contents. \"Many members are still engaging in last-minute negotiations so I'm not in a position to make predictions,\" Cho says.\n\n3:30 p.m. Japanese Prime Minister Sanae Takaichi arrives in South Korea to shore up the neighbors' relations and make her debut at APEC.\n\n3:20 p.m. Trump departed South Korea on Thursday without having held a meeting or had any known contact with Kim Jong Un, after having said early in his Asia swing that he would be happy to meet with the North Korean leader.\n\n\"We never were able to talk because I was so busy,\" Trump says aboard Air Force One. However, he floats the possibility of a return visit to the region to meet Kim. \"I'd come back, with respect to Kim Jong Un. I had a great relationship with Kim Jong Un. He doesn't like too many people other than me.\"\n\n3:05 p.m. Trump's comment earlier today on restarting U.S. nuclear weapons tests has raised both questions and eyebrows. Hans Kristensen, a well-known authority on nuclear arms, has posted a lengthy rebuttal on X.\n\n2:00 p.m. Speaking to reporters aboard Air Force One, Trump says he won't divulge everything, but rattles off a lengthy list of topics he discussed with China's Xi. He says he is cutting 10 percentage points off U.S. tariffs on Chinese goods, while Beijing has agreed to buy American soybeans and keep rare-earth materials flowing. He says Taiwan did not figure in the talks.\n\n1:15 p.m. Trump departs for the U.S. aboard Air Force One, concluding the first Asia tour of his second presidency. The visit took him to Malaysia for the ASEAN summit, to Japan to connect with new Prime Minister Sanae Takaichi, and finally to South Korea, where he finalized a trade deal with President Lee Jae Myung and held today's high-stakes summit with Xi.\n\n1:05 p.m. As they leave their summit, news footage shows Trump and Xi chatting one on one.\n\n12:50 p.m. Chinese state broadcaster CCTV says Xi's meeting with Trump has ended. It lasted about an hour and 40 minutes.\n\n12:20 p.m. Here's some footage of the moment Trump and Xi shook hands for the cameras.\n\n11:55 a.m. Trump, Xi and their aides are huddling in Busan. At the start of their meeting, Xi told Trump that China and the U.S. should be \"partners and friends.\"\n\n\"I always believe that China's development goes hand in hand with your vision to make America great again,\" the Chinese president said.\n\n11:00 a.m. Just before meeting with China's Xi, Trump made a post on Truth Social declaring plans to start testing nuclear weapons, without clarifying exactly what that would entail.\n\n\"The United States has more Nuclear Weapons than any other country. This was accomplished, including a complete update and renovation of existing weapons, during my First Term in office. Because of the tremendous destructive power, I HATED to do it, but had no choice! Russia is second, and China is a distant third, but will be even within 5 years. Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately. Thank you for your attention to this matter!\"\n\n10:53 a.m. China's state broadcaster CCTV reports that Xi's summit with Trump has started.\n\n10:50 a.m. With Trump and Xi due to meet shortly, after weeks of speculation, here's a quick refresher on where things stand in their countries' fraught trade relationship.\n\n10:30 a.m. Chinese President Xi has arrived in Busan, where he is due to meet Trump, Chinese state media says.\n\n10:20 a.m. South Korean President Lee Jae Myung celebrated his trade deal with the U.S. in a post on X on Thursday morning, echoing Trump's tendency for effusive phrases. \"What a great and beautiful deal!,\" Lee wrote, adding, \"Together, we were able to reaffirm the true value of the alliance built on long-standing friendship and cooperation.\"\n\nLee's policy secretary announced the terms of the agreement on Wednesday night, saying that the two sides had agreed on how to disburse a $350 billion investment in the U.S. by Seoul in exchange for lower tariffs. \"President Trump and I will continue to work shoulder-to-shoulder for peace and prosperity,\" Lee wrote in the English-language part of his post.\n\n9:30 a.m. Xi Jinping has left China for South Korea, according to media reports.\n\n9:00 a.m. With Trump and Xi set to meet in Busan in a couple of hours, U.S. Treasury Scott Bessent says on X that the announcement following their summit will be a \"resounding victory for our great farmers.\" China's lack of American soybean orders this year has been a major point of contention in the relationship. Wire service Reuters on Wednesday reported that a Chinese state company had already made a modest purchase of the legumes.\n\n7:00 a.m. Trump said Thursday morning that he would permit South Korea to build nuclear-powered submarines, a potentially significant departure from the two countries' longstanding defense arrangement.\n\nWriting on his Truth Social page, the U.S. president said that following his agreement the previous evening over trade terms with his South Korean counterpart, he would grant permission for the building of nuclear-powered submarines, \"rather than the old fashioned, and far less nimble, diesel powered Submarines that they have now.\"\n\nTrump added in a subsequent post that the submarines would be built at a shipyard in Philadelphia, U.S.\n\nUnder the terms of the trade deal announced on Wednesday, in exchange for lowered tariffs, South Korea is set to provide $200 billion in annualized cash payments, with the remaining $150 billion going to shipbuilding projects.\n\nSouth Korea is a major shipbuilding country, and reviving the American sector has been a key priority of Trump, who added on Truth Social that his time in South Korea was \"A great trip, with a great President of South Korea!\"\n\nWednesday, October 29\n\n8:50 p.m. The U.S. and South Korea have agreed to the terms of a trade deal, with Seoul planning to provide $200 billion in cash of a total $350 billion in stateside investment in return for lower tariffs.\n\n7:30 p.m. Ahead of her departure for APEC on Thursday, Japanese Prime Minister Sanae Takaichi held a phone call earlier on Wednesday with Indian Prime Minister Narendra Modi. The Quad partners reaffirmed their shared values and interests, with Takaichi saying she \"would like to continue to work together, including through Japan-U.S.-Australia-India cooperation, to realize a 'Free and Open Indo-Pacific,'\" according to Japan's foreign ministry. She also called for bilateral cooperation on security, the economy, investment, innovation and people-to-people exchanges.\n\nModi congratulated her on becoming prime minister and said he looks forward to advancing concrete cooperation, according to the readout.\n\n7:00 p.m. Lee gathers a number of dignitaries for a special APEC dinner \"in honor of President Donald J. Trump and State Leaders.\" The guests also include Singapore's Lawrence Wong, Thailand's Anutin Charnvirakul and Australia's Anthony Albanese, among others. Local media reports say the banquet menu features dumplings made with truffles and Korean black chicken, with wine from a winery belonging to Eric Trump, the president's son.\n\n5:20 p.m. Korean food is one front in the burgeoning soft power the APEC host country is eager to show off, along with its music, film and television. Both modern and traditional Korean grub can meld tastes, at times combining salty, sweet and spicy flavors in ways that international visitors may not expect.\n\nThe APEC media center, where hundreds of reporters from around the world are at work, offers a selection of traditional and modern Korean snacks. One is hwangnam bread, a Gyeongju specialty that features red bean paste inside soft, sweet bread.\n\nParis Baguette, a major South Korean bakery chain known for sweet offerings, is operating a booth with baked goods bearing characters from Netflix hit \"K-Pop Demon Hunters.\" Among those is another red-bean-paste-filled snack and a Korean take on streusel bread.\n\nFor media members seeking something savory, instant kimchi fried rice is available alongside microwaves to heat it up. A salty option is seaweed chips with the flavor of buttered squid, produced by South Korean instant food giant Bibigo. The package on display in Gyeongju features K-pop group Seventeen.\n\n5:00 p.m. China's foreign ministry confirms that a Xi-Trump meeting is on for Thursday. It says the leaders will exchange views on bilateral relations and issues of mutual interest. While the meeting has been repeatedly touted by the U.S. side, Beijing had not explicitly confirmed it.\n\n4:45 p.m. BTS leader Kim Namjoon, better known as RM, spoke earlier at the CEO Summit and stressed the importance of promoting culture. \"When you think about investing in tomorrow's generations, think about culture as well as economics,\" the boy band star said. Calling culture and art a \"powerful force,\" he said that \"they are the fastest messengers that carry diversity and resonance.\"\n\n4:40 p.m. Japan and China are working to arrange a summit between Prime Minister Takaichi and President Xi on Friday, Kyodo reports.\n\n4:15 p.m. Trump suggests that a meeting with North Korean leader Kim Jong Un may not be in the cards after all.\n\n\"I know Kim Jong Un very well. We get along very well,\" Trump is quoted as saying by South Korea's Yonhap news agency, at his summit with Lee. \"We really weren't able to work out timing.\"\n\nTrump had repeatedly expressed interest in seeing Kim again during this Asia tour, after the two met three times during his first presidency. At one point, the U.S. leader had indicated he would be willing to extend his trip -- due to end Thursday -- in order to do so. \"If he'd like to meet, I'm around. I'll be in South Korea, so I can be right over there,\" Trump had said on his way to Japan.\n\nBut one expert told Nikkei Asia that Kim was likely more wary of the U.S. now. Pyongyang continues to keep the region on edge with its nuclear weapons and missile programs, along with its cooperation with Russia in the Ukraine war.\n\n\"We'll have other visits, and we'll work very hard with Kim Jong Un and with everybody on getting things straightened out because that makes sense,\" Trump says.\n\n3:55 p.m. Here's a picture of the crown Lee's government presented to Trump as a gift.\n\n2:39 p.m. Lee starts his summit with Trump. The South Korean president is under pressure to work out differences over a major investment deal the U.S. extracted from Seoul in return for lower tariffs. The pact remains unfinalized.\n\n1:50 p.m. Trump finishes a speech to the APEC CEO Summit. In the wide-ranging address, he reiterates his optimism for his expected meeting with China's Xi on Thursday.\n\n\"President Xi of China is coming tomorrow here and we're going to be, I hope, making a deal,\" Trump says. \"I think it'll be a good deal for both. And that's really a great result, you know, that's better than fighting and going through all sorts of problems.\"\n\n1:45 p.m. The mayor of Pohang, which is home to POSCO and represents the center of South Korea's steel industry, tells Nikkei Asia at an investment event in the city that tariffs on the metal were too high.\"The U.S. shouldn't make excessive demands. From the U.S. perspective, maybe they think they can make those requests, but from Korea's standpoint, some of them are impossible to accept,\" says Mayor Lee Kang-deok. \"Korea is a small country, while the U.S. is a big one. A small country has a harder time solving the same problems that a big country can handle more easily.\"He continues: \"Especially in our city, Pohang -- since our economy is tied to the steel industry -- the tariffs on steel are too high, way too high. Our whole steel industry is facing a risk of collapse. If Korea's steel industry collapses, Korea will suffer the most, but the U.S. will also be affected, since it's part of the same supply chain.\"The U.S. raised tariffs on imported steel from South Korea to 50% in June. This prompted Mayor Lee and members of his city government to protest outside the White House in September against the import tax.\n\n1:20 p.m. Lee's office says that Trump's visit marks \"a historic milestone\" as it makes him the first foreign leader to be received twice as a state guest in South Korea. The two will soon discuss matters related to development of their bilateral alliance, including, \"trade, investment, economic and security cooperation, alliance modernization, and peace on the Korean Peninsula,\" the statement says.\n\n12:25 p.m. Trump and his entourage were treated to a view of Japan's Mount Fuji on their way to South Korea.\n\n12:05 p.m. One of the most closely watched meetings on the margins of APEC is likely to be a Trump face-off with China's Xi. The White House has said they will meet Thursday morning, although the Chinese side has yet to confirm this. Negotiators from both countries spent last weekend hammering out a \"framework\" for the leaders to discuss.\n\nTrade, rare-earth minerals and TikTok are among the topics Trump and Xi are expected to talk about. Speaking to reporters aboard Air Force One during the short flight from Japan to South Korea, Trump touched on another: Taiwan.\n\nSome observers have raised concerns that the U.S. president, with his penchant for dealmaking, could bend on Taiwan, such as by saying he \"opposes\" its independence. Beijing claims Taiwan as its own, and such language would be considered a meaningful change from Washington's boilerplate position that it \"does not support\" independence.\n\n\"I don't know that we'll even speak about Taiwan,\" Trump said, according to NBC News. \"I'm not sure. I mean, he may want to ask about it. There's not that much to ask about it. Taiwan is Taiwan.\"\n\n11:55 a.m. Trump disembarks from his plane and receives a red-carpet welcome. He heads to a waiting Marine One helicopter, which will ferry him to the next leg of a hectic regional tour.\n\n11:35 a.m. Air Force One lands in Busan. A military honor guard is waiting to greet the U.S. president.\n\n11:30 a.m. Not everyone is happy about APEC and Trump's attendance. News footage shows a small group of protesters gathered in Gyeongju.\n\n11:00 a.m. The stage is set for one of the first big moments of APEC week, as South Korean President Lee will be meeting with Trump this afternoon. They are due to hold a summit at the Gyeongju National Museum, according to local media. A series of activities are also planned to underscore close bilateral ties, with Lee due to present Trump with a custom-made replica of a 6th-century golden crown as a gift.\n\n10:40 a.m. South Korean President Lee sums up the stakes of this week's meetings at the APEC CEO Summit. \"In an era where protectionism and nationalism are on the rise ... the words 'cooperation, coexistence, and inclusive growth' may sound hollow,\" he says. \"Paradoxically, APEC's role as a platform for solidarity will shine even brighter in times of crisis like these.\"","url":"https://asia.nikkei.com/politics/international-relations/south-korea-s-apec-live-leaders-begin-to-arrive-for-day-1-of-meetings","image":"https://images.ft.com/v3/image/raw/https%3A%2F%2Fcms-image-bucket-productionv3-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F3%2F3%2F4%2F4%2F11634433-1-eng-GB%2F640518124166-PKSKO2025103100010-1-.JPG?width=1200&fit=cover&gravity=faces&dpr","video":null,"publish_date":"2025-10-31 00:58:07","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.192},{"id":374268928,"title":"Lexi Thompson flaunts her latest hairdo styled by Florida-based hairstylist","text":"Lexi Thompson, who lives in West Palm Beach in Florida, recently took a trip further down the state to Fort Lauderdale for a much deserved hair appointment with a local stylist.She paid a visit to Hair Goals Salon, which is approximately an hour's drive down from her home in West Palm Beach. The 30-year-old got her hair styled by Jairo at the salon.The LPGA Tour sensation posted a selfie of herself in a car on a rainey day in Florida thanking her hairstylist for doing a fantastic job. She captioned the Instagram Story (via Instagram @lexi):\"Thank you @master.hairstylist &#128129;‍♀️&#128525;\"Here's a look at Lexi Thompson's new look (via Instagram @lexi):Lexi Thompson shows off her new hairdo by a Florida-based stylist (Image via Instagram @lexi)Her hairstylist, Jairo, graduated from the Aveda Insititute in Florida. As the owner and master stylist of his own hair salon in Fort Lauderdale, he specializes in blondes, colored hair, and more.Lexi Thompson's agency speaks on her break from social media after receiving backlashLexi Thompson played a round of golf with President Donald Trump over Easter weekend in 2019. Following the news going viral, she withdrew from a tournament that was around the corner and took a break from social media.Having received backlash from fans and followers on social media for playing golf with the President, her sports agency, Blue Giraffe Sports, issued a statement on her behalf clarifying that the scrutiny she was subjected to was not the reason for her withdrawal or break from all platforms.They clarified that the professional golfer made the decision to do so because she has been subject to a lot of 'social media abusers' throughout her career and needs the break to improve her mental health.Here's a look at what the statement read (via Instagram @lexi):IIt has come to our attention that the reason for Lexi Thompson's decision to take a break from Social Media has been taken out of context by various media outlets. Lexi's decision was not based on a recent event or post, but rather from a culmination of harsh, hurtful, and unwarranted commentary from social media abusers over time. Lexi is aware that this is a constant problem for most people in the public spotlight, and she has always readily accepted that fact. Lexi is excited to compete in the LPGA Mediheal Championship this week in San Francisco and simply wanted to remove this negative variable on a temporary basis in order to focus on competing against the world's best. Any news report that a recent event or situation led to her decision is completely false and erroneous.\"Here's a look at the statement (via Instagram @lexi): View this post on Instagram Instagram PostThe statement from Blue Giraffe Sports ended with a note of appreciation for her fans and supporters throughout her career.","summary":"Lexi Thompson, who lives in West Palm Beach in Florida, recently took a trip further down the state to Fort Lauderdale for a much deserved hair appointment with a local stylist.","url":"https://www.sportskeeda.com/golf/news-lexi-thompson-flaunts-latest-hairdo-styled-florida-based-hairstylis","image":"https://staticg.sportskeeda.com/editor/2025/10/881d2-17618252804860-1920.jpg","video":null,"publish_date":"2025-10-31 00:53:32","author":"Lathika Krishna","authors":["Lathika Krishna"],"language":"en","source_country":"in","sentiment":0.092},{"id":374270386,"title":"LSU AD Scott Woodward Finalizing Exit Deal After Brian Kelly Firing And Governor Jeff Landry Feud","text":"Following the firing of head coach Brian Kelly and comments made by Louisiana governor Jeff Landry, LSU and AD Scott Woodward are finalizing an exit agreement. This has been one of the most polarizing weeks in recent college football memory. After firing former head coach Brian Kelly this past Sunday, Woodward has been the focus of attention by governor Jeff Landry revolving around Kelly's $54 million buyout. As Outkick reported Thursday, there seemed to be no coming back for both parties after comments made by Jeff Landry regarding Woodward's involvement in the next coaching hire, which were made Wednesday during a news conference. Sources tell Outkick that Scott Woodward will paid the full amount owed from his buyout, which will be $6.4 million, according to the agreement. Executive Deputy AD Verge Ausberry will be the interim AD, as LSU hires a new president, who will then help lead the charge in finding the new athletic director. \"No, I can tell you right now Scott Woodward is not selecting the next coach. Hell, I'll let Donald Trump select it before I let him do it,\" Gov. Landry said Wednesday. \"I don't know, but the board of supervisors will come up with a committee and there gonna go find us a coach.\" Politics, Power, And The LSU Coaching Search: How Governor Jeff Landry Undermined AD Scott Woodward Then, the Louisiana governor tried to make a correlation between the contracts that Woodward had drawn up involving Brian Kelly and agent Trace Armstrong, while also bringing Jimmy Sexton into the conversation. \"Yall reporters need to start looking at who represents these people. Woodward’s agent, Kelly’s agent… the Texas A&M (coach’s) agent. They all have the same agent. This is ridiculous. Lawyers would be disbarred the way these agents act. It’s time for the NCAA to put guardrails.\" This moment alone was a clear sign that this marriage was going to end. Things Continue To Get Crazier At LSU Following Gov. Landry Comments If you were looking for the dreaded ‘vote of confidence’ that athletic directors love to hand out to coaches, the comments made by Landry this week were the exact opposite. When Scott Woodward seemingly fired Brian Kelly without giving much notice to the Board of Supervisors, things went downhill from there. This led to Governor Landry holding a meeting at his mansion Sunday night, in which Woodward was not invited to participate in. Louisiana Governor Jeff Landry Says He'd Let Donald Trump Select Next LSU Coach Before Current AD Now, just days after Brian Kelly was fired after the loss to Texas A&M, the LSU administration will be looking for a new athletic director, while they are also in the process of hiring a new president. If you are a potential candidate to replace Brian Kelly, this has to be an eye-opener on all accounts. Now, we will see where LSU turns next, as the chaos continues on the Bayou.","summary":"After Brian Kelly’s firing and Jeff Landry’s criticism, LSU AD Scott Woodward is set to depart amid major athletic department changes.","url":"https://www.outkick.com/sports/lsu-scott-woodward-exit-brian-kelly-firing-jeff-landry","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/10/gettyimages-2150550356.jpeg","video":null,"publish_date":"2025-10-31 00:49:39","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.181},{"id":374270710,"title":"Ex-FBI chief Comey argues 2020 testimony can't sustain false statements case","text":"APEx-FBI Director James Comey\n\nFormer FBI Director James Comey on Thursday expanded his legal challenge to a Trump administration criminal case accusing him of making false statements, saying his testimony was truthful and would not substantiate the charge. In a legal filing, Comey's lawyers said his 2020 Senate testimony was \"literally true\" and prompted by ambiguous questions from Republican Senator Ted Cruz of Texas. \"Fundamental to any false statement charge are both clear questions and false answers,\" Comey's lawyers wrote in the filing. \"Neither exists here.\" The filing is Comey's latest attempt to have the charges thrown out before a trial. He has pending challenges arguing the U.S. attorney who brought the case was unlawfully appointed and that he is being unfairly targeted because of Trump's \"personal spite\" against him. A Justice Department spokesperson declined to comment. Prosecutors are due to respond to Comey's claims in court filings next month. Comey is accused of lying during the hearing when he said he stood by prior testimony that he had not authorized anyone at the FBI to be an anonymous source in news reports about investigations into President Donald Trump and his Democratic rival in the 2016 election, Hillary Clinton. Comey has pleaded not guilty. The former FBI director, who investigated alleged ties between Trump's 2016 campaign and Russia, was the first of three of Trump's perceived political enemies to be criminally charged in recent weeks. The Justice Department also brought charges against New York Attorney General Letitia James, who filed a civil fraud lawsuit against Trump while he was out of power, and Trump's former national security adviser John Bolton, who has publicly said Trump is unfit to be president. Comey's case was brought by Lindsey Halligan, the top federal prosecutor in the Eastern District of Virginia. Halligan, a former personal lawyer for Trump with no prior prosecutorial experience, was put in the role at Trump's urging after he forced out her predecessor, who was reticent to charge Comey and James. Thursday's motion takes aim at the substance of the allegation that Comey's statement to Cruz was false.Live Events Cruz, in questioning Comey about disclosures to the news media, discussed the role of Comey's former top deputy, Andrew McCabe, in leaking information to the Wall Street Journal in 2016. But the indictment accuses Comey of authorizing a different associate, identified in court filings as former FBI special employee and law professor Daniel Richman, to act as an anonymous source. Comey's lawyers argue that Comey could reasonably have interpreted Cruz's questions to relate only to McCabe and not generally to anyone at the FBI. Comey has previously testified he did not know about McCabe's disclosure to the Wall Street Journal until after the article was published. Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onfalse statements caseTrump administrationFBI investigationJames ComeyLindsey HalliganTed Cruz\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onfalse statements caseTrump administrationFBI investigationJames ComeyLindsey HalliganTed Cruz(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Former FBI Director James Comey is fighting criminal charges. He claims his testimony was truthful and the questions asked were unclear. Comey's lawyers argue the charges lack clear questions and false answers. This is his latest effort to dismiss the case before a trial. Prosecutors are expected to respond next month. Comey has pleaded not guilty.","url":"https://economictimes.indiatimes.com/news/international/global-trends/ex-fbi-chief-comey-argues-2020-testimony-cant-sustain-false-statements-case/articleshow/124977645.cms","image":"https://img.etimg.com/thumb/msid-124977665,width-1200,height-630,imgsize-112778,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-31 00:48:20","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.287},{"id":374269850,"title":"US senators call on Trump to show support for Jimmy Lai in meeting with Xi","text":"A bipartisan group of 38 US senators is urging President Donald Trump to use his expected summit with Chinese President Xi Jinping in South Korea next week to secure the release of former Hong Kong media mogul Jimmy Lai Chee-ying, the latest in the US Congress’s efforts to get human rights on the agenda of the high-stakes meeting.\nIn a letter released on Friday, the lawmakers described Lai as a political prisoner and said the case for his release was “more dire than ever” due to his worsening health.\n“At 78 years old, he is in poor and deteriorating health. He is a diabetic and suffers from numerous physical ailments that are compounded by his continuing incarceration,” they wrote.\n“Mr Lai’s representatives have assured us that if he is released, he will leave Hong Kong and never return. He would have no desire to remain in public life. Should he die in prison, on the other hand, he would become a martyr; a powerful and enduring symbol of opposition.”\nThe letter sent to Trump, dated October 23, was led by two Republicans, Rick Scott of Florida, and James Risch, the chair of the Senate Foreign Relations Committee.\nLai is currently awaiting a verdict after a marathon national security trial in Hong Kong that concluded earlier this year.\n\nThe businessman-turned-opposition activist, who founded the now-defunct Apple Daily tabloid, is the most prominent figure yet to be prosecuted under the Beijing-decreed national security law.\nUS and other Western politicians have repeatedly condemned his prosecution as an attack on press freedom and demanded his release.\nHong Kong authorities have dismissed such accusations as attempts to undermine the city’s rule of law.\nResponding to the letter on Friday, the Chinese embassy in Washington reiterated this.\n“Hong Kong upholds the rule of law. To abide by the law and bring lawbreakers to justice is a basic principle,” said spokesperson Liu Pengyu.\n“Jimmy Lai is the principal mastermind and perpetrator behind the series of riots that shook Hong Kong. He is an agent and henchman of those hostile to China.”\nTrump earlier this year said he would seek to do what he could to “save” Lai, echoing a pledge from the presidential campaign trail last year.\nThe US president is expected to meet Xi on the sidelines of the Asia-Pacific Economic Cooperation (Apec) summit in South Korea next Thursday local time, as part of a stabilising effort after a recent escalation in tensions.\n\nRelations between the US and China hit new lows in recent weeks, after Beijing announced on October 9 that it would roll out further export restrictions on rare earth elements, key raw materials used in hi-tech manufacturing, in what many saw as a response to the expansion of a US trade blacklist.\nTrump responded to Beijing’s announcement by threatening to impose an additional 100 per cent tariffs on Chinese goods – which he later conceded was “not sustainable” – and introduce export controls on all “critical software”.\nMore complications arose when two countries began implementing new port fee structures on each other’s ships, and Trump warned he was considering a halt to purchases of Chinese cooking oil.\nPressure on China ahead of major events has sometimes yielded results. In 2000, post-arrest publicity helped to release Dickinson College librarian Song Yongyi, then a US permanent resident, when Beijing needed US Congressional approval to join the World Trade Organisation.\nAlso this week, a similar letter was sent to the US president by a group of Republican lawmakers asking him to press Xi for the release of Americans imprisoned or under exit bans in China.\nTrump said earlier this week that he was seeking a deal with Xi on “everything”.","summary":"A bipartisan group of 38 US senators is urging President Donald Trump to use his expected summit with Chinese President Xi Jinping in South Korea next week to secure the release of former Hong Kong media mogul Jimmy Lai Chee-ying, the latest in the US Congress’s efforts to get human rights on the agenda of the high-stakes meeting.\nIn a letter released on Friday, the lawmakers described Lai as a political prisoner and said the case for his release was “more dire than ever” due to his worsening...","url":"https://www.scmp.com/news/hong-kong/article/3330287/us-senators-call-trump-raise-jimmy-lai-concerns-xi-key-meeting","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/25/81c11f05-ab5c-412b-aee3-adfe9861fcb1_560a28f2.jpg","video":null,"publish_date":"2025-10-31 00:47:56","author":"Bochen Han","authors":["Bochen Han"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.178},{"id":374270708,"title":"Trump sets refugee ceiling at record-low 7,500 with focus on white South Africans","text":"APPresident Donald Trump gestures as he arrives on Air Force One, Thursday, Oct. 30, 2025, at Joint Base Andrews, Md., after returning from a trip to Asia. \n\nU.S. President Donald Trump set the refugee admissions ceiling at 7,500 for fiscal year 2026, the lowest cap on record, a White House document published on Thursday said, part of a broader effort to reshape refugee policies in the U.S. and worldwide. Trump said in an annual refugee determination dated September 30 that admissions would be focused largely on South Africans from the country's white Afrikaner ethnic minority. Trump has claimed Afrikaners face persecution based on their race in the Black-majority country, allegations the South African government has denied. Trump paused all U.S. refugee admissions when he took office in January, saying they could only be restarted if they were established to be in the best interests of the U.S. Weeks later, he launched an effort to bring in Afrikaners, sparking criticism from refugee supporters. Only 138 South Africans had entered the U.S. by early September, Reuters reported at the time. In the determination published on Thursday, Trump said his administration would consider bringing in \"other victims of illegal or unjust discrimination in their respective homelands.\" An internal document drafted by U.S. government officials in April suggested the administration could also prioritize bringing in Europeans as refugees if they were targeted for expressing certain views, such as opposition to mass migration or support for populist political parties. Europeans and other groups were not named in Trump's public refugee plan. U.S. law requires the executive branch to consult with members of Congress before setting refugee levels, but Democratic lawmakers said on September 30 that the meeting never took place. In a statement on Thursday, U.S. Representative Jamie Raskin, U.S. Senator Dick Durbin and other Democratic lawmakers said Trump's low refugee cap was both wrongheaded and lacked legal force.Live Events \"This bizarre presidential determination is not only morally indefensible, it is illegal and invalid,\" the lawmakers said. A senior Trump administration official blamed the government shutdown that began on October 1 for delayed consultation and said no refugees would be admitted until it occurred. During the United Nations General Assembly in September, top Trump administration officials urged other nations to join a global campaign to roll back asylum protections, a major shift that would seek to reshape the post-World War Two migration framework. This month, Reuters and other outlets reported Trump's plans for the 7,500-person refugee ceiling, which contrasts sharply with the 100,000 refugees who entered under former President Joe Biden in fiscal 2024. Gideon Maltz, CEO of Tent Partnership for Refugees, said in a statement that refugees help address labor shortages and that the program \"has been extraordinarily good for America.\" \"Dismantling it today is not putting America first,\" he said in a statement. In a related move, the White House said it would move oversight of the refugee support programs from the State Department to the Department of Health and Human Services.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onlow refugee admissions United StatesSouth African refugees Trump policyU.S. refugee policiesTrump refugee ceiling 2026refugee processing haltDemocratic lawmakers refugee cap\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onlow refugee admissions United StatesSouth African refugees Trump policyU.S. refugee policiesTrump refugee ceiling 2026refugee processing haltDemocratic lawmakers refugee cap(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"President Trump has set the refugee admissions ceiling at a record low of 7,500 for fiscal year 2026, prioritizing white South African Afrikaners. This move, criticized by Democrats as illegal and morally indefensible, shifts oversight of refugee programs and aims to reshape global asylum policies.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-sets-refugee-ceiling-at-record-low-7500-with-focus-on-white-south-africans/articleshow/124977357.cms","image":"https://img.etimg.com/thumb/msid-124977389,width-1200,height-630,imgsize-65670,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-31 00:36:38","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.365},{"id":374269614,"title":"Ford to invest $370 million in India defying Trump’s local push","text":"Ford Motor Co. plans to invest about 32.50 billion rupees ($370 million) in India to churn out new engines, a person familiar with the matter said, as the US carmaker resuscitates a factory it shut down four years ago.The Maraimalai Nagar manufacturing site in the southern Indian state of Tamil Nadu will be retooled to make high-end engines for export markets with an annual capacity of over 200,000 units, said the person, asking not to be named as the plans are private. The engines will not be exported to the US, but it’s unclear which countries they will be sent to, the person said, adding an announcement is expected as early as this week.The US automaker, which first signaled its interest in resuming local production in India a year ago, has been preparing the investment for months against a backdrop of heightened tensions between New Delhi and Washington. US President Donald Trump placed a 50% tariff on Indian imports earlier this year in a trade standoff, and has lashed out at the Asian country’s purchase of Russian oil. The move comes even as Trump made boosting manufacturing in the US — especially where the automotive industry is concerned — a signature policy goal. Ford caught flack from the president during his first term for a plan to increase output outside the US, but more recently won praise from him after announcing major investments at its domestic plants. Ford declined to comment. Live EventsFord’s decision reflects renewed confidence in India as a manufacturing base from Chief Executive Officer Jim Farley and comes as it pivots from a previous focus on electric vehicles. The Dearborn, Michigan-based company first set up manufacturing near Chennai in 1995 and added a second plant in Sanand, Gujarat, in 2015. Shortly after becoming CEO in 2020, Farley pulled the plug on a deal with Mahindra & Mahindra Ltd. that would have kept Ford vehicles on Indian roads. He abandoned the market altogether less than a year later, saying it could no longer pour capital into marginal markets like India and Brazil that provided little or no return.By by the time it exited, Ford racked up losses totaling over $2 billion. It ultimately sold off the Sanand vehicle plant to Tata Motors, which now builds EVs there. In 2020, Ford’s chief US rival, General Motors Co., also ceased production in India, three years after shifting to an export-only business model. More recently, other US companies have been building up their manufacturing presence in India, despite the political tension. Trump singled out Apple Inc. in May for its decision to manufacture in India, but the tech giant has since ramped up iPhone production across five Indian factories.Tamil Nadu, where Ford plans to restart its old facility, is one of India’s largest industrialized states and a longtime automaking hub. It’s home to manufacturing facilities operated by Hyundai Motor Co., Renault SA, and BMW AG.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onFord investment in IndiaFord engines manufacturingTrump manufacturing policyFord Maraimalai Nagar factoryelectric vehicles IndiaFord Motor Co.fordtata motors\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onFord investment in IndiaFord engines manufacturingTrump manufacturing policyFord Maraimalai Nagar factoryelectric vehicles IndiaFord Motor Co.fordtata motors(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"Ford Motor Co. is investing approximately $370 million in India to revive a factory and produce high-end engines for export. This move signals renewed confidence in India as a manufacturing base, despite past losses and geopolitical tensions. The Maraimalai Nagar plant will be retooled for an annual capacity exceeding 200,000 units.","url":"https://economictimes.indiatimes.com/industry/auto/auto-news/ford-to-invest-370-million-in-india-defying-trumps-local-push/articleshow/124977353.cms","image":"https://img.etimg.com/thumb/msid-124977337,width-1200,height-630,imgsize-292646,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-31 00:36:30","author":"Alisha Sachdev","authors":["Alisha Sachdev"],"language":"en","category":"politics","source_country":"in","sentiment":-0.406},{"id":374265628,"title":"School Assembly News Headlines For October 31: Top National, International & Others News","text":"News Headlines for School Assembly, October 31, 2025: From Mumbai police rescuing 17 kidnapped children to Pakistan’s Defence Minister Khawaja Asif declaring a confrontational stance towards the Afghan Taliban regime, here are the top news highlights for October 31st.\nTop National News:\n– Dularchand Yadav, a close aide of Lalu Prasad Yadav and former RJD leader, was shot dead on Thursday in Mokama during an election campaign clash between two groups.\n– Mumbai police conducted a daring rescue operation after Rohit Arya allegedly kidnapped 17 children and two others, holding them hostage in a Powai studio for six days. The police stormed the studio, rescuing all the hostages, while Arya was shot and later declared dead.\nTop International News:\n– Hours after Donald Trump ordered the US military to resume nuclear weapon testing after a 33-year hiatus, China urged the US to “earnestly abide” by a global nuclear testing ban, minutes before Trump’s meeting with Chinese President Xi Jinping.\n– Pakistan’s Defence Minister Khawaja Asif announced a confrontational stance towards the Afghan Taliban regime, accusing Kabul of harbouring and supporting Tehreek-e-Taliban Pakistan (TTP) fighters, marking a significant escalation in rhetoric.\nTop Sports News:\n– Jannik Sinner defeated Zizou Bergs at the Paris Masters, aiming for the world number one spot. Alexander Zverev survived a tough match, while Casper Ruud and Corentin Moutet made early exits.\n– Former World Champion and Russian Grand Master, Vladimir Kramnik, has firmly denied any involvement or responsibility in the death of American Grand Master Daniel Naroditsky, which is being investigated as a potential suicide or overdose.\nTop News in Business:\n– Benchmark equity indices traded lower on Thursday despite a widely anticipated rate cut by the US Federal Reserve. At 1:30 p.m., the Sensex fell by 590.57 points or 0.69 per cent to 84,406.56, while the broader Nifty dropped to 25,875.30, down 178.60 points or 0.69 per cent.\nTop News in Education:\n– CBSE released the final datesheet for the CBSE board exams 2026. The CBSE 10th and 12th exams will commence on February 17, 2026 and end on April 9, 2026.","summary":"School Assembly News Headlines For October 31st: Check top national, international, education, business and sports news for school assembly.","url":"https://www.news18.com/education-career/school-assembly-news-headlines-on-october-31-top-national-international-sports-business-education-updates-9669796.html","image":"https://images.news18.com/ibnlive/uploads/2025/10/schools-27-2025-10-912a09d04dbddfc3af36a392bb0b59e8.jpg","video":null,"publish_date":"2025-10-31 00:30:22","author":"Education And Careers Desk,News18,Sukanya Nandy","authors":["Education And Careers Desk","News18","Sukanya Nandy"],"language":"en","category":"politics","source_country":"in","sentiment":-0.131},{"id":374273138,"title":"APEC leaders to open summit after Trump and Xi agreed on steps to ease trade tensions","text":"Leaders of 21 Asian and Pacific Rim nations were set to open their annual summit Friday to discuss how to promote economic cooperation and tackle shared challenges, a day after President Donald Trump and Chinese President Xi Jinping agreed to take steps to ease their escalating trade war.\n\nThis year’s two-day Asia-Pacific Economic Cooperation summit in the South Korean city of Gyeongju city has been heavily overshadowed by Thursday’s Trump-Xi meeting. Trump described the meeting as a roaring success, saying he would cut tariffs on China, while Beijing had agreed to allow the export of rare earth elements and start buying American soybeans.\n\nTheir deals were a relief to the world economy, as experts previously warned that a failure to dial down trade tensions between the world’s two largest economies were certain to deepen global economic uncertainties.\n\nEstablished in 1989 during a period of increased globalization, APEC represents more than half of global trade. The forum champions free and open trade and investment to accelerate regional economic integration and has also been credited with bringing together countries embroiled in competitions to work together on common initiatives without binding statements.\n\nThe APEC region now faces challenges like strategic competitions between the U.S. and China, supply chain vulnerabilities, aging populations and the impact of AI on jobs. The U.S. strategy has recently been shifted to economic competitions with China rather than cooperation, with Trump’s tariff hikes and “America first” agenda shaking markets and threatening decades of globalization and multinationalism.\n\n“The global free trade order is facing various challenges. We hope that the APEC, which is being held in South Korea for the first time in 20 years, will provide an opportunity for leaders to have candid discussions and exchange views on the future of APEC,” South Korean Foreign Minister Cho Hyun told reporters Thursday. \n\nTrump left South Korea after his meeting with the Chinese president, and international media spotlight is now on Xi, whose government has portrayed itself as a defender of free trade and an alternative to U.S. protectionism. \n\nIt’s Xi’s first visit to South Korea in 11 years, and he’s scheduled to meet South Korean President Lee Jae Myung and new Japanese Prime Minister new Japanese Prime Minister Sanae Takaichi separately on Friday. \n\nDespite Trump’s optimism after a 100-minute meeting with Xi, there continues to be the potential for major tensions between the countries, with both seeking dominant places in manufacturing and developing emerging technologies such as artificial intelligence.\n\n“It is certainly a contribution to bring the leaders of the two largest economies together for a meeting where they agreed to withdraw their most extreme tariff and export control threats. As a result, worst-case outcomes for global trade were averted,” said Leif-Eric Easley, professor of international studies at Ewha Womans University in Seoul.\n\n“However, APEC is meant to be more than a venue for a trade war truce,” Easley said. “Greater multilateral efforts are needed to address the region’s most pressing economic challenges, including resisting costly and destabilizing protectionism, harmonizing regulations for sustainable trade, and coordinating standards for digital innovation.”\n\nSouth Korean officials said they’ve been communicating with other countries to prod all 21 members to adopt a joint statement at the end of the summit so as not to repeat the failure to issue one in 2018 in Papua New Guinea due to U.S.-China discord over trade. \n\nSouth Korean Foreign Minister Cho Hyun said last week that issuing a joint statement strongly endorsing free trade would be unlikely because of differing positions among APEC members. He instead anticipated a broader declaration emphasizing peace and prosperity in the region.\n\nAs host nation, South Korea places a priority on discussing AI cooperation and demographic challenges such as aging population and low birth rates, under the theme “Building a Sustainable Tomorrow: Connect, Innovate, Prosper.” South Korean officials say APEC members will share exemplary cases of responses to AI and demographic issues, explore common steps and formulate new growth strategies during this week's summit.","summary":"Leaders of 21 Asian and Pacific Rim nations are set to open their annual summit to discuss how to promote economic cooperation and tackle shared challenges","url":"https://www.independent.co.uk/news/donald-trump-apec-xi-jinping-south-korea-asian-b2855785.html","image":"https://static.independent.co.uk/2025/10/31/00/South_Korea_APEC_45440.jpg?width=1200","video":null,"publish_date":"2025-10-31 00:28:41","author":"Hyung-Jin Kim","authors":["Hyung-Jin Kim"],"language":"en","source_country":"gb","sentiment":0.127},{"id":374264022,"title":"Xi-Trump summit yields results in South Korea","text":"President Xi Jinping and US President Donald Trump reached a tactical trade truce on Thursday in Busan, South Korea, easing heightened tensions over rare earths and tariffs while leaving tech and TikTok disputes unresolved, multiple media outlets have reported. Their much anticipated meeting took place on the sidelines of the Asia-Pacific Economic Cooperation (APEC) summit.\n\nThe agreement included a one-year pause on China’s export controls on rare earths – critical to technology and defence supply chains – that Trump has said could be “routinely extended.” It cut the US’ fentanyl-related tariffs of Chinese goods from 20 percent to 10 percent (making the total tariff rate a still very high 47 percent). China also appears to have agreed to resume US soybean purchases.\n\nAccording to Wolfe Research strategist Tobin Marcus, Beijing successfully used its grip on the global supply of rare earths and a US soybean embargo to force Washington to lower its tariffs. Trivium China geopolitics analyst Joe Mazur said he saw the results as vindicating China’s strategy of “never striking first but always striking back”.\n\nEmily Kilcrease, director at the Center for a New American Security, described Thursday’s meeting as a de-escalation of measures both sides had taken since Trump took office at the start of the year and launched his so-called Liberation Day tariffs on the world – which Beijing responded to in kind. \n\n[See more: China posts a surge in exports, defying expectations]\n\nOpening the pair’s talks in Busan, Xi insisted that “China’s development and rejuvenation [were] not incompatible with President Trump’s goal of ‘making America great again’.” Afterwards, he said he was willing to work with Trump to “ensure the steady sailing forward of the giant ship of China-US relations.” He also called for both sides to finalise follow-up steps as quickly as possible.\n\nTrump, in turn, heaped praise on Xi – describing him as a “great leader of a great country.”\n\nThe two leaders agreed to visit each others’ home turf next year. Trump said he planned to be in China in April, while Xi’s trip would take place at a later date.\n\nTheir meeting followed last week’s trade negotiations in Malaysia, after which US Treasury Secretary Scott Bessent said he expected Trump and Xi to finalise TikTok’s future in South Korea. This did not happen, though China’s Ministry of Commerce has said it would continue working with the US to “resolve issues.” China’s access to Nvidia chips was also left unresolved.","summary":"Yesterday’s meeting between President Xi Jinping and his US counterpart saw tariffs cut and China’s rare earth curbs paused\n\n\nThe post Xi-Trump summit yields results in South Korea appeared first on Macao News.","url":"https://macaonews.org/news/greater-china/xi-trump-trade-talks-korea/","image":"https://macaonews.org/wp-content/uploads/2025/10/Xi-Trump-Trade-Talks.jpg","video":null,"publish_date":"2025-10-31 00:23:40","author":"Staff Reporter","authors":["Staff Reporter"],"language":"en","category":"politics","source_country":"mo","sentiment":0.004},{"id":374271146,"title":"Trump puts candy on kid’s costumed head at White House Halloween event - again","text":"President Donald Trump greeted trick-or-treaters at the White House Halloween event on Thursday night — and once again placed candy on top of a child’s costume.\n\nThe president, joined by first lady Melania Trump, distributed candy for about an hour outside the White House, which was decked out in pumpkins, leaves, and other decorations for the event. The president was spotted placing a candy bar on top of a child’s light-up mask, in a moment that mirrored a viral incident from Halloween 2019, when Trump placed candy on top of a child’s Minion costume.\n\nThe moment has already made the rounds on social media. In a post with hundreds of likes and re-shares, one user uploaded today’s clip side-by-side with the 2019 viral moment.\n\n“President Trump DOES IT AGAIN! He just recreated the time he placed a candy bar on a kid's head for Halloween 6 years ago,” the user wrote. “We are SO BACK!” \n\nSome trick-or-treaters appeared to be dressed up as Trump himself, while others opted to be Secret Service agents or the Statue of Liberty. As the president and first lady handed out candy, Halloween-themed tunes played.\n\nTrump also greeted two young kids who were in a wagon with the McDonald’s drive-thru sign. The president notably operated a McDonald’s fryer last year for a campaign photo-op.\n\nSeveral kids dressed up as pumpkins, ballerinas and dinosaurs. Some trick-or-treaters also brought items for Trump to sign, including a golf ball andTime Magazine covers that featured him. \n\nTop White House officials, including White House Press Secretary Karoline Leavitt and White House Deputy Chief of Staff Stephen Miller, were also spotted with their families at the event.\n\nMeanwhile, Trump’s tariffs are reportedly driving up the prices of Halloween candy and costumes. His tariff hike on Chinese goods has resulted in tighter Halloween inventory and higher prices, The Independent previously reported.\n\nThe National Retail Federation also estimates consumers are expected to spend a record $13.1 billion this Halloween, which is up from $11.6 billion last year and tops the previous 2023 record of $12.2 billion\n\nWhen asked about the higher prices earlier this month, White House spokesperson Kush Desai told The Independent, “Real prosperity is good jobs, booming industry, and thriving communities for everyday Americans – not cheap Chinese imports.”","summary":"Trump went viral in 2019 after he placed a candy bar on a child’s Minion costume at the White House’s trick-or-treating event","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-white-house-halloween-candy-b2855764.html","image":"https://static.independent.co.uk/2025/10/30/23/01/SEI272459762.jpg?crop=3851,2567.3,x0,y0.3&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/lbDAGLs1-4VHSaSK0.mp4","publish_date":"2025-10-31 00:23:34","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.038},{"id":374264872,"title":"Malaysia Stands Firm on Rare Earth Export Ban","text":"TEMPO.CO, Jakarta - Malaysia will maintain the ban on exporting raw, rare earth metals to protect its domestic resources. The Malaysian Trade Minister stated that this decision comes even after signing a crucial mineral deal with the United States on Wednesday.In parliament, Minister Tengku Zafrul Abdul Aziz dismissed claims that Malaysia would allow the export of crucial minerals and rare earth metals to the United States for direct profit or strategic purposes.\"We no longer want to be a country that only digs and ships out cheap raw materials like in the past,\" Tengku Zafrul stated as cited by CNA. He reiterated that Malaysia will promote foreign investment and technology sharing for mining and processing raw rare earth metals.\"Our policy is not to prevent trade forever,\" he said.\"Our policy is to prevent the export of cheap unprocessed raw materials so that value is added to Malaysia.\"Malaysia is estimated to have around 16.1 million metric tons of rare earth metal deposits, but lacks the technology to mine and process them. Rare earth metals are crucial for high-tech manufacturing, including electric vehicles, semiconductors, and missiles.Earlier this month, Malaysia was reported to be in talks with China on rare-earth metals processing, stating that Malaysia's state wealth fund, Khazanah Nasional, would partner with a Chinese firm to build a plant in Malaysia.The United States signed separate agreements with Malaysia and Thailand during President Donald Trump's visit to Kuala Lumpur on Sunday. This was to promote cooperation in diversifying crucial mineral supply chains amidst competing efforts by China.According to a joint statement by the U.S. and Malaysia, Malaysia agreed not to impose bans or quotas on the export of crucial minerals or rare earth elements to the United States.Editor's Choice: Philippines to Assume ASEAN Chairmanship from Malaysia in 2026Click here to get the latest news updates from Tempo on Google News","summary":"Malaysia is estimated to have around 16.1 million metric tons of rare earth metal deposits, according to government estimates.","url":"https://en.tempo.co/read/2061769/malaysia-stands-firm-on-rare-earth-export-ban","image":"https://statik.tempo.co/data/2025/06/06/id_1404049/1404049_720.jpg","video":null,"publish_date":"2025-10-31 00:20:24","author":"Sita Planasari","authors":["Sita Planasari"],"language":"en","source_country":"id","sentiment":-0.135},{"id":374268786,"title":"Turning Point USA’s extraordinary crowd with JD Vance shows how young people are hungry for purpose","text":"There was a time when conservative kids weren’t cool. \n\nA time when they were fogey-ish, bow-tied, out of step and out of touch. \n\nWith their own generation at least.\n\nBut that has changed. \n\nAnd nothing demonstrates that change more than something that happened at the University of Mississippi on Wednesday.\n\nFrom early morning the queues started to form. \n\nThey grew throughout the day, in spite of the rain, as thousands of people waited to get into the Turning Point USA event.\n\nAccording to Turning Point Spokeman Andrew Kolvet more than half of the entire student body of the University packed into the venue. \n\nThat’s a full 14,000 students out of a total of 27,000. \n\nNot counting the 13,000 adults who also queued to get into The Pavilion — a building more used to housing basketball games than conservative political events.\n\nThe crowd heard from Erika Kirk, the widow of Turning Point´s Founder, Charlie Kirk. \n\nAnd they also watched as Vice President JD Vance spent an hour onstage taking questions from the audience on a whole range of subjects. \n\nVance´s performance was an extraordinary tribute to his late friend.\n\nWhat was even more extraordinary was not just the event’s scale, but what this scale speaks to.\n\nFor a couple of generations it has been presumed that young people want to be rebellious. \n\nUntil the 1960s that actually wasn’t true. \n\nIt wasn’t always the case that young Americans who went away to college became politically radical and then came back in the holidays to berate their parents for their “backwards” views.\n\nBut since the ’60s that has been the presumption. \n\nThat college kids would go away, get indoctrinated by their professors and before you knew it they were back home speaking a different language.\n\nNot that it was a language much worth learning. \n\nBut it was a language nonetheless. In recent years that included being inducted into the language of “problematizing,” “conceptualizing” and “other-ing.” \n\nAt the same time students got baptized into the religion of gender-ideology, the problem of “whiteness” and of course the unfailingly alleged awfulness of American history.\n\nThat language held much longer than it should have done. \n\nBut it held. \n\nEarlier this month the Centre for Heterodox Social Science released new data on the number of young Americans identifying as trans, queer or “non-binary.” \n\nIn recent years these people were among the magical unicorn people in Generation Z. \n\nIf you couldn’t claim any other minority status you could leap over your peers, and appear fascinating and significant by announcing that you were gender-queer.\n\nBut new data shows that in the past year there has been a massive fall-off in this trend within Generation Z.\n\nIn 2022 almost 7% of undergraduate students polled in the US identified as trans. \n\nLast year that figure had slumped to 3.6%. \n\nAnd whereas nationally the number of students identifying as neither male nor female fell by a half, in some elite institutions — including Brown University — the number fell by two thirds.\n\nWhat does this have to do with the crowds gathering in Mississippi this week?\n\nBecause young people want to find something to attach themselves to.\n\nThey want to find meaning and they want to find purpose in their lives.\n\nAs I and others have said over recent years, what was termed “woke” filled a huge gap for many young people. \n\nIt filled the gap where religion once was, and like a religion it had its own mantras (“trans women are women”). \n\nIt had its own saints (George Floyd). \n\nIt had its own means of excommunication (“cancellation”). \n\nAnd it had its own high priests (Nikole Hannah-Jones, Robin Di Angelo etc).\n\nThe problem was that as religions go it was a horrible one. \n\nIt provided no meaningful purpose in life other than to live in a state of constant grievance and rebellion. \n\nThe connections and friendships it provided were shallow as a puddle. \n\nIt had no sense of beauty or the transcendent. \n\nAnd it had absolutely no mechanism for forgiveness. \n\nIt was, in fact, more of a cult than a religion.\n\nBut we live in a time when people are after meaning and purpose in their lives as much as ever. \n\nIn our time this seems to be leading to what RR Reno, the editor of Catholic Magazine First Things, has called “The Return of the Strong Gods.”\n\nAfter all, why should people keep trying simulated belonging when they could have the real thing? \n\nWhy should people try to commit to a faked-up pseudo-religion when they could have religion itself?\n\nAnd that is one of the many things that is remarkable about the phenomenon which Charlie Kirk helped start in his life and which has taken on even greater energy since his murder.\n\nStudents queuing for the event in Mississippi this week noticed what Kirk said and they noticed what happened after his death.\n\nHe told his young followers what he thought a good life looked like. \n\nA life he tried to live. \n\nHe urged young people to fall in love, to get married, to start families. \n\nHe urged them to commit more deeply to their Christian faith, or to find God for the first time. \n\nAnd in a moment which few people will forget, at his own memorial service in Arizona last month, Charlie´s widow Erika even publicly forgave her husband’s killer.\n\nHere is a difference between two visions of life which could hardly be more stark. \n\nAnd it comes back to the place I started. \n\nThat conservative views — including conservative religious views — have become cool again.\n\nSome people might put that down to a swinging back of the pendulum — a rebellion of its own. \n\nAfter all, how else are Generation Z meant to rebel other than to rebel against the rebellion itself?\n\nBut I suspect something more is going on here. \n\nThe re-election of Donald Trump was undoubtedly a turning point. \n\nAs was the swiftness with which even Silicon Valley heads (formerly the Princes of Woke) got behind him on the turn of a dime.\n\nAnd now the queues of young people to hear from conservatives — including a Republican Vice President?\n\nWe shall see whether this becomes a full-on revival. \n\nBut it is undeniably a turning of the tide. \n\nAnd a welcome one at that.","summary":"There was a time when conservative kids weren’t cool.","url":"https://nypost.com/2025/10/30/opinion/turning-point-usas-extraordinary-crowd-with-jd-vance-shows-how-young-people-are-hungry-for-purpose/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/u-s-vice-president-jd-114456933-e1761869280657.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-31 00:17:10","author":"Douglas Murray","authors":["Douglas Murray"],"language":"en","source_country":"zm","sentiment":-0.177},{"id":374273042,"title":"Trump-Orbán Meeting Set for Nov. 7 in Washington","text":"Officials in Budapest on Thursday said that Hungarian Prime Minister Viktor Orbán is to meet US President Donald Trump at the White House on Friday, November 7.\n\n“The meeting will give the two leaders an opportunity to exchange views on possible ways to achieve peace and to discuss a roadmap leading to a US-Russian meeting and, as a result, an end to the Russo-Ukrainian war,” said Gergely Gulyás, Minister of the Hungarian Prime Minister’s Office.\n\nThe announced date is a day earlier than was anticipated.\n\nOne of the primary issues between the conservative Hungarian, whose country is exclusively reliant on now-sanctioned Russian oil, and, partly as a result, has some of the warmest Kremlin relations within the European Union.\n\nLast week, the EU adopted a sanctions package to phase out all Russian energy imports by 2027 and the Trump administration’s latest decision to impose sanctions on key Russian oil firms to pressure Moscow into good-faith negotiations.\n\nLast Friday, Orbán said Budapest is seeking ways to “circumvent” the sanctions.\n\n“We are discussing how to build a sustainable system for my country’s economy, because Hungary depends very much on Russian oil and gas,” the Hungarian leader said last week. “Without them, energy prices will skyrocket, causing shortages in our reserves.”\n\nBudapest has tried to persuade Washington that, as a landlocked country, Hungary has no choice but to rely on Russian oil. However, there is an alternative oil pipeline, the Jadranski naftovod, that connects Hungary to the Adriatic Sea via Croatia – a fact that European leaders commonly bring up with Orbán.\n\nIn 2021, Hungary imported 46 percent of its oil from Russian sources. (That same year, Russia supplied the EU with 45 percent of its gas and 27 percent of its oil. By 2024, those numbers stood at 19 percent and 3 percent, respectively.)\n\nBut before the initial Russian invasion of Ukraine, in 2013, Hungary relied on Russia for 80 percent of its oil consumption.\n\nIn early October of this year, Budapest reportedly struck deals with French energy group Engie on natural gas supplies and was negotiating possible imports from Turkmenistan in what was perceived as its attempt to shift away from Russian energy imports.\n\nTrump had previously said he was “angry” in August after Ukrainian strikes hit the Druzhba Pipeline supplying Hungary with Russian oil.","summary":"Budapest said the meeting would focus on “possible ways to achieve peace and to discuss a roadmap leading to a US-Russian meeting” and, as a result, an end to Moscow’s invasion of Ukraine.","url":"https://www.kyivpost.com/post/63330","image":"https://static.kyivpost.com/storage/2025/10/30/2716cd00d3b5a69bfde637b3ffa86d9f.jpg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-10-31 00:17:08","author":"Kyiv Post","authors":["Kyiv Post"],"language":"en","category":"politics","source_country":"ua","sentiment":0.283},{"id":374267352,"title":"\"Regressive And Irresponsible\": Iran Slams Trump's Nuclear Testing Order","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/iran-slams-donald-trumps-nuclear-testing-order-9548690\" on this server.\nReference #18.8ea72917.1761871462.63b1187\nhttps://errors.edgesuite.net/18.8ea72917.1761871462.63b1187","summary":"Iran's foreign minister called on Thursday US plans to resume nuclear testing \"regressive and irresponsible\", after a surprise directive by US President Donald Trump.","url":"https://www.ndtv.com/world-news/iran-slams-donald-trumps-nuclear-testing-order-9548690","image":null,"video":null,"publish_date":"2025-10-31 00:16:50","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":374268034,"title":"Telangana Floods: Thousands Stranded, Drones Drop Food, Hospitals Inundated","text":"This special report details significant international and domestic events. US President Donald Trump and Chinese President Xi Jinping met in Busan, South Korea, reaching an agreement where the US reduced certain tariffs by 10% in exchange for China resuming American soybean purchases and ending restrictions on rare earth exports. Analyst Ashok Kanta provides insights into the US-China relationship, discussing whether this de-escalation is a temporary truce and its implications for India's trade negotiations and alliances like the Quad, noting China's lack of concessions on core issues. Domestically, a hostage crisis unfolded in Mumbai where YouTuber Rohit Arya held 17 children, citing unpaid dues from the state education department, before being fatally shot by police during a rescue operation. Arya had released a video message stating, \"I am neither a terrorist, nor do I have a huge demand for money.\" The program also covers the heated Bihar election, characterized by caste politics, crime, and campaign rhetoric. Additionally, it highlights a road rage murder in Bengaluru captured on CCTV and a pregnant Delhi Police constable winning a weightlifting medal.","summary":"Telangana Floods: Thousands Stranded, Drones Drop Food, Hospitals Inundated","url":"https://www.indiatoday.in/india/video/telangana-floods-thousands-stranded-drones-drop-food-hospitals-inundated-ytvd-2811113-2025-10-31","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/video/202510/warangalunderwaterastelanganafloods-s0-original-sixteen-to-nine.jpg?VersionId=QHfilocHUAwktC9lG9cu.QbS4sNC6g7o&size=1280:720","video":null,"publish_date":"2025-10-31 00:15:54","author":"India Today Video","authors":["India Today Video"],"language":"en","source_country":"in","sentiment":-0.324},{"id":374263758,"title":"Mag 7 Earnings, Nvidia’s $5 Trillion Moment, And Sesame’s $250 Million Bet","text":"BUSAN, SOUTH KOREA - OCTOBER 30: U.S. President Donald Trump and Chinese President Xi Jinping shake hands as they depart following a bilateral meeting at Gimhae Air Base on October 30, 2025 in Busan, South Korea. Trump is meeting Xi for the first time since taking office for his second term, following months of growing tension between both countries. (Photo by Andrew Harnik/Getty Images)\nGetty Images\n\nEarnings week for the Mag 7 brought mixed results and sharp stock moves. Apple rose more than 3 percent after reporting $102.47 billion revenue and $1.85 EPS, driven by iPhone and Services. Alphabet logged its first $100 billion quarter, up 16 percent year over year, on strong search and cloud performance. Microsoft posted $77.7 billion revenue and $3.72 EPS but fell on concerns about AI infrastructure spending. Meta set a record $51.24 billion revenue, then dropped 10 percent after a $15.9 billion tax charge and rising Reality Labs capex. Oracle stayed elevated as cloud sales climbed 28 percent in September. Nvidia reached a $5 trillion valuation on relentless AI chip demand, announced seven U.S. supercomputers, invested $1 billion in Nokia, and confirmed plans for up to $100 billion in OpenAI. CEO Jensen Huang forecast $500 billion in AI chip sales as investors treated Nvidia as the core of global AI infrastructure. Shares rose 5.6% to $212.19 after reports that President Trump will discuss Nvidia’s Blackwell chips with China’s Xi Jinping. CEO Jensen Huang projected $500 billion in AI chip sales and announced seven new U.S. supercomputers. Nvidia also invested $1 billion in Nokia to develop AI-native 5G and 6G networks. Its stock is up 50% this year. Nvidia plans to invest $100 billion in OpenAI, cementing its dominance as AI infrastructure demand outpaces supply.\n\nCNBC News — Pictured: Brendan Iribe, Oculus CEO, speaks at f8, Facebook's Developers Conference in San Francisco, CA, on March 25, 2015 — (Photo by: Harriet Taylor/CNBC/NBCU Photo Bank/NBCUniversal via Getty Images)\nNBCU Photo Bank/NBCUniversal via Getty Images\n\nSesame, the smart-glasses startup led by former Oculus co-founders Brendan Iribe and Nate Mitchell, raised $250 million in Series B funding. Sequoia Capital and Spark Capital led the round bringing total funding to about $300 million. The company is developing lightweight AI-powered glasses equipped with voice assistants named Miles and Maya to create an “ambient interface” that understands context and environment. Sesame’s blend of spatial computing and conversational AI positions it as a competitor to Apple, Meta, and Google-backed Magic Leap in the race to define the next generation of AI wearables. For Iribe, who previously founded Scaleform (acquired by Autodesk) and co-founded Oculus (acquired by Facebook for $2 billion), Sesame marks his fourth major venture.\n\nLayoffs are illustrated by an oversized pair of scissors, that looms over seven workers sitting in office chairs suspended by strings. Employees use their laptop computers and mobile devices, but some of their jobs could be cut at any time, as they are shown hanging by a thread. Their jobs are on the line. Conceptual illustration uses a flat, limited color palette over a dark blue background, presented in isometric view on a 16x9 artboard.\n\nWhite-collar layoffs are accelerating as AI adoption reshapes office work. Last week we reported Amazon is cutting 14,000 corporate jobs. This is the tip of the AI iceberg looming before the labor market. UPS has trimmed 14,000 managers over two years, and Target plans 1,800 more cuts. JPMorgan, Walmart, Accenture and others have revealed plans to slow hiring. All cited AI. PwC, the accounting and consulting giant, cut staff globally, partly because of AI. Nestlé cut jobs, blaming automation.GM to Booz Allen are reducing staff, citing efficiency and automation. Nearly two million Americans have been unemployed for six months or longer, while demand for trade, healthcare, and construction workers rises. Recruiters report middle-aged professionals struggling to keep up with new technologies and entry-level hiring tightening. Economists warn that AI-driven restructuring is eroding white-collar stability even as overall productivity improves.The irony is that the companies downsizing will yield huge dividends from Wall Street, which as far as I can tell, has never met a reorg it does not like (remember Meta’s “year of efficiency”?)\n\nMORE FOR YOU\n\nOpenAI CEO Sam Altman speaks at OpenAI DevDay, the company's annual conference for developers, in San Francisco, California, on October 6, 2025. OpenAI signed a multi-year partnership Monday with chipmaker Advanced Micro Devices as the ChatGPT-maker continues an investment spree to secure massive amounts of computing power for rolling out generative artificial intelligence. The companies announced the plan to develop AI data centers that the chipmaker said would bring in tens of billions of dollars in new revenue over the next five years. (Photo by Benjamin LEGENDRE / AFP) (Photo by BENJAMIN LEGENDRE/AFP via Getty Images)\nAFP via Getty Images\n\nOpenAI CEO Sam Altman announced plans to create an autonomous “AI researcher” by 2028, with an intern-level assistant expected by 2026. The company is restructuring as a public benefit corporation, allowing large-scale investment while its nonprofit foundation retains 26% ownership. Chief Scientist Jakub Pachocki said models could surpass human intelligence within a decade through greater “test time compute” and algorithmic advances. OpenAI plans to dedicate entire data centers to major research problems, investing $1.4 trillion to build 30 gigawatts of infrastructure. The foundation will allocate $25 billion for disease research and oversee safety and governance.\n\nLAS VEGAS, NEVADA - JANUARY 06: Attendee Jason Nguyen uses augmented reality (AR) glasses in a simulation at the Magic Leap booth during CES 2023 at the Las Vegas Convention Center on January 6, 2023 in Las Vegas, Nevada. CES, the world's largest annual consumer technology trade show, runs through January 08 and features about 3,200 exhibitors showing off their latest products and services to more than 100,000 attendees. (Photo by David Becker/Getty Images)\nGetty Images\n\nMagic Leap and Google have partnered to build reference hardware for the Android XR ecosystem. At the Future Investment Initiative in Riyadh, they revealed a prototype that merges Magic Leap’s waveguide optics with Google’s Raxium microLED engine, a key technology for lightweight AR glasses. The three-year deal positions Magic Leap as an optics and display supplier rather than a consumer brand, with Google focusing on the software layer. The prototype underscores Google’s return to spatial computing and its strategy to seed Android-based AR hardware through partners instead of producing its own glasses.\n\nVR Chat dancers.\n\nVRChat has launched on Android and iOS, opening the social VR platform to millions of mobile users. The iOS app supports devices running iOS 17 or newer, while Android requires version 10 and at least 6 GB RAM. Phones with less memory can use a limited “Companion” mode. The mobile rollout ends the platform’s beta phase and extends its reach beyond PC and VR headsets, potentially driving major user growth. VRChat recently hit 54,000 concurrent users on PC, its highest count in years, and expects a significant surge as mobile players join its creator-driven virtual worlds. Meta Horizon is approaching mobile XR the same way. Rec Room tried this, but all it did was add users and UGC spam, not revenue, and was partially responsible for layoffs there.\n\nThis column has a companion, The AI/XR Podcast, hosted by its author, Charlie Fink, and Ted Schilowitz, former studio executive and futurist for Paramount and Fox, and Rony Abovitz, founder of Magic Leap. This week’s guest is Kirin Sinha, founder and CEO, Illumix. We can be found on Spotify, iTunes, and YouTube.\n\nEditorial StandardsReprints & Permissions","summary":"Mag 7 earnings drove market swings as Nvidia hit $5 trillion and Meta slumped. Meanwhile, AI startup Sesame, founded by Oculus veterans, raised $250 million to build smarter smart glasses.","url":"https://www.forbes.com/sites/charliefink/2025/10/30/mag-7-earnings-nvidias-5-trillion-moment-and-sesames-250-million-bet/","image":"https://imageio.forbes.com/specials-images/imageserve/6903fe0c281a73e4e8bffc78/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-10-31 00:15:54","author":"Charlie Fink,Contributor,Harriet Taylor","authors":["Charlie Fink","Contributor","Harriet Taylor"],"language":"en","source_country":"US","sentiment":-0.025},{"id":374268032,"title":"Kashmir's New Bloom: A Garden of Hope After Pahalgam Terror?","text":"This special report details significant international and domestic events. US President Donald Trump and Chinese President Xi Jinping met in Busan, South Korea, reaching an agreement where the US reduced certain tariffs by 10% in exchange for China resuming American soybean purchases and ending restrictions on rare earth exports. Analyst Ashok Kanta provides insights into the US-China relationship, discussing whether this de-escalation is a temporary truce and its implications for India's trade negotiations and alliances like the Quad, noting China's lack of concessions on core issues. Domestically, a hostage crisis unfolded in Mumbai where YouTuber Rohit Arya held 17 children, citing unpaid dues from the state education department, before being fatally shot by police during a rescue operation. Arya had released a video message stating, \"I am neither a terrorist, nor do I have a huge demand for money.\" The program also covers the heated Bihar election, characterized by caste politics, crime, and campaign rhetoric. Additionally, it highlights a road rage murder in Bengaluru captured on CCTV and a pregnant Delhi Police constable winning a weightlifting medal.","summary":"Kashmir's New Bloom: A Garden of Hope After Pahalgam Terror?","url":"https://www.indiatoday.in/india/video/kashmirs-new-bloom-a-garden-of-hope-after-pahalgam-terror-ytvd-2811112-2025-10-31","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/video/202510/thegul-e-dawoodgardenofkashmir-s0-original-sixteen-to-nine.jpg?VersionId=t9O4rmNPPTf0NBMONVvDJcNlUCPM50Kr&size=1280:720","video":null,"publish_date":"2025-10-31 00:15:53","author":"India Today Video","authors":["India Today Video"],"language":"en","source_country":"in","sentiment":-0.324},{"id":374268030,"title":"DMK Leader's Bombshell: 'Don't Add Migrant Workers to Tamil Nadu's Voter Lists'","text":"This special report details significant international and domestic events. US President Donald Trump and Chinese President Xi Jinping met in Busan, South Korea, reaching an agreement where the US reduced certain tariffs by 10% in exchange for China resuming American soybean purchases and ending restrictions on rare earth exports. Analyst Ashok Kanta provides insights into the US-China relationship, discussing whether this de-escalation is a temporary truce and its implications for India's trade negotiations and alliances like the Quad, noting China's lack of concessions on core issues. Domestically, a hostage crisis unfolded in Mumbai where YouTuber Rohit Arya held 17 children, citing unpaid dues from the state education department, before being fatally shot by police during a rescue operation. Arya had released a video message stating, \"I am neither a terrorist, nor do I have a huge demand for money.\" The program also covers the heated Bihar election, characterized by caste politics, crime, and campaign rhetoric. Additionally, it highlights a road rage murder in Bengaluru captured on CCTV and a pregnant Delhi Police constable winning a weightlifting medal.","summary":"DMK Leader's Bombshell: 'Don't Add Migrant Workers to Tamil Nadu's Voter Lists'","url":"https://www.indiatoday.in/india/video/dmk-leaders-bombshell-dont-add-migrant-workers-to-tamil-nadus-voter-lists-ytvd-2811108-2025-10-31","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/video/202510/migrantsshouldntbevotersheredmkleadersexplosiveremark-s0-original-sixteen-to-nine.jpg?VersionId=gxXK2egZkQqGmbtnKe6n82RXkrCPJOTu&size=1280:720","video":null,"publish_date":"2025-10-31 00:12:53","author":"Dmk Organisatio","authors":["Dmk Organisatio"],"language":"en","category":"politics","source_country":"in","sentiment":-0.324},{"id":374273182,"title":"NASA Rebuts Kim Kardashian’s Moon-landing Conspiracy Claims","text":"In an unexpected twist that has captivated audiences, NASA finds itself at odds with Kim Kardashian over an age-old conspiracy theory. The renowned space agency, through its acting administrator Sean Duffy, has publicly dismissed Kardashian’s assertion that the 1969 moon landing was staged.\n\nTaking to social media platform X, Duffy firmly countered the reality star’s claim, stating, “Yes, we’ve been to the Moon before… six times!” His post directly addressed Kardashian, aiming to set the record straight.\n\nAdding another layer to the conversation, former President Donald Trump chimed in, attributing NASA’s renewed lunar ambitions to his administration’s leadership. This unexpected comment added a political dimension to the debate.\n\nKim Kardashian, now 45, sparked the controversy during a recent episode of her reality show, “The Kardashians.” Her remarks quickly went viral, eliciting a wave of online mockery for her unorthodox view on a historically significant event.\n\nSocial media users did not hold back, with one commenting on the irony of such a prominent figure questioning an event that is extensively documented. The public reaction highlights the lingering fascination and skepticism surrounding the moon landing, even decades later.\n\n‘[It’s] hard to believe someone so famous doubts one of the most documented events in history,’ one X user wrote. \n\nAnother scoffed that the claim was particularly outrageous coming from a highly educated woman that just wrapped a law office study program after six years in May 2025. \n\n‘If you think the moon landing was faked, you’re a f*****g idiot,’ a third fired. \n\nOthers accused her of sounding like her ex-husband, Kanye West, who has repeatedly and publicly spread unsubstantiated or debunked conspiracy theories.\n\nApollo 11, conducted by NASA, was the first spaceflight to land humans on the Moon.\n\nAlthough millions of people gathered around their televisions to watch the event unfold, people have doubted the moon landing for a variety of reasons.\n\nKardashian revealed her thoughts about the 1969 moon landing on the October 30 episode of The Kardashians while on set with her All’s Fair co-star, Sarah Paulson, 50. \n\n‘I’m sending you, so far, a million articles with both Buzz Aldrin and … the other one,’ she told Paulson, who replied: ‘Yes, do it.’\n\n‘This girl says, ‘What was the scariest moment?’ And [Aldrin] goes, ‘There was no scary moment, cause it didn’t happen. It could’ve been scary, but it wasn’t, cause it didn’t happen” Kardashian said.\n\nThe mother-of-four then alleged that Aldrin’s old age makes him blurt out comments like that, before ultimately ruling: ‘So I think it didn’t happen.’ \n\nPaulson told the SKIMS mogul that she was gearing up to go on a ‘massive deep dive’ after reading what Kardashian – who sends the actress ‘conspiracies all the time’ – had sent her.\n\nLater in the episode, a producer approached Kim’s trailer and asked the star to confirm her belief that the astronauts did not walk on the moon.\n\n‘I don’t think we did. I think it was fake,’ Kardashian insisted. ‘I’ve seen a few videos [of] Buzz Aldrin talking about how it didn’t happen. He says it all the time now in interviews.’\n\nExplaining how she was convinced of the conspiracy theory, Kardashian added: ‘Why does Buzz Aldrin say it didn’t happen? \n\n‘There’s no gravity on the moon – why is the flag blowing? The shoes that they have in the museum that they wore on the moon [have] a different [foot]print than the photos. Why are there no stars?’\n\nA producer then asked the reality TV star how she defends herself from people who brand her ‘crazy.’\n\nKardashian acknowledged that people are going to say she’s ‘crazy no matter what.’\n\n‘But like, go to TikTok. See for yourself,’ she urged viewers.\n\nAldrin, now 95, has never denied the authenticity of the 1969 Apollo 11 mission. He has spent decades fiercely defending its legacy – and mocking those who suggest it was a hoax.\n\nIn 2002, he famously punched a moon-landing denier in the face outside a hotel in Beverly Hills after being called ‘a coward, liar and thief’ and being pressed to swear on a Bible that he had walked on the moon. He was 72 at the time. \n\nPolice declined to press charges.\n\nHe has also spoken publicly and often about the challenges of the mission, the scientific rigor behind it and the emotional toll it took on the astronauts and others involved.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn an unexpected twist that has captivated audiences, NASA finds itself at&#8230;\n\n\nThis Post: NASA Rebuts Kim Kardashian&#8217;s Moon-landing Conspiracy Claims first appeared on Internewscast Journal","url":"https://internewscast.com/news/nasa-rebuts-kim-kardashians-moon-landing-conspiracy-claims/","image":"https://internewscast.com/wp-content/uploads/2025/10/NASA-slams-Kim-Kardashian-over-wild-moon‑landing-conspiracy-theory.jpg","video":null,"publish_date":"2025-10-31 00:12:34","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.098},{"id":374273124,"title":"Poilievre vows to tackle unemployment, cost of housing in address to young Canadians","text":"OTTAWA — Conservative Leader Pierre Poilievre addressed young Canadians at an event in Toronto tonight, arguing that the Liberals are sacrificing their future. \n\nSpeaking at a podium with a sign that said “Jobs. Homes. Hope.,” Poilievre criticized Prime Minister Mark Carney and his government, highlighting that the prime minister has yet to make a deal with U.S. President Donald Trump to end tariffs. \n\nThe opposition leader also condemned Carney’s recent speech at the University of Ottawa where he said the fall budget will spur “unprecedented” levels of private sector investments, but warned that sacrifices are in store.\n\nWhile Carney said the economy is holding up for the moment despite Trump’s tariff barrages, he stated in his speech that “if we don’t act now, the pressures will only grow,” and pledged his plan will contain “generational investments.”\n\nPoilievre said youth have sacrificed more than those in past generations because of “Liberal policies” and is vowing the Conservatives will help tackle issues like unemployment and the cost of housing.\n\nHe repeated several long-held Conservative policies like repealing anti-development laws, getting rid of the industrial carbon tax, cutting taxes and capping government spending, saying they would help young Canadians. \n\nPoilievre said Conservatives have a plan for youth that includes stronger take-home pay and unleashing the free enterprise system to generate high-paying jobs.\n\n“Mr. Carney, the young people in this room and across this country have already sacrificed enough,” Poilievre said. “They have worked hard, they’ve done everything right and they deserve a bright future of homes, jobs and hope.”\n\nAhead of next week’s federal budget, the Conservatives have sent out fundraising emails to supporters saying there could be an early election and warning the party “must be ready.” \n\nSeveral Conservative MPs, including Eric Melillo, Jonathan Rowe and Melissa Lantsman, attended the event. Many young people stood behind Poilievre onstage carrying signs with messages such as: “Don’t sacrifice my future.” \n\n“Canada’s youth are the best and the brightest in the world, and they deserve a future to match that,” Poilievre said.\n\nThis report by The Canadian Press was first published Oct. 30, 2025. \n\nCatherine Morrison, The Canadian Press","summary":"OTTAWA — Conservative Leader Pierre Poilievre addressed young Canadians at an event in Toronto tonight, arguing that the Liberals are sacrificing their future. Speaking at a podium with a sign that said &#8220;Jobs. Homes. Hope.,&#8221; Poilievre criticized Prime Minister Mark Carney and his government, highlighting that the prime minister has yet to make a deal [&#8230;]","url":"https://toronto.citynews.ca/2025/10/30/poilievre-vows-to-tackle-unemployment-cost-of-housing-in-address-to-young-canadians/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/10/04688aedff8b88db73cc4727c59019fcedc5574752e8fe2c2818e1a010f95ed4.jpg","video":null,"publish_date":"2025-10-31 00:12:34","author":"Catherine Morrison,News Staff","authors":["Catherine Morrison","News Staff"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.125},{"id":374270032,"title":"Israel sah terima 2 lagi mayat tebusan daripada Hamas","text":"BAITULMAQDIS: Kumpulan pejuang Palestin, Hamas, menyerahkan dua lagi mayat tebusan warga Israel, sehari selepas gencatan senjata di Gaza kembali tergugat akibat serangan berdarah oleh tentera Israel di wilayah itu.\n\nDua mayat yang diserahkan itu dikenal pasti sebagai Amiram Kuper dan Sahar Baruch.\n\nDalam kenyataan Pejabat Perdana Menteri, Benjamin Netanyahu, keluarga kedua-dua mangsa sudah dimaklumkan selepas selesainya proses pengecaman oleh Institut Perubatan Forensik Kebangsaan.\n\nSahar Baruch, 25, diculik dari kibbutz Beeri ke Gaza dan terbunuh dalam misi penyelamatan tentera yang gagal dua bulan kemudian.\n\nManakala, Amiram Kuper, 84, ketika diculik, dilarikan bersama isterinya, Nourit Kuper, dari rumah mereka di kibbutz Nir Oz.\n\nIsrael mengumumkan kematiannya ketika dalam tahanan pada Jun 2024.\n\nSetakat ini, Hamas sudah menyerahkan 17 daripada 28 mayat tebusan yang dijanjikan untuk dikembalikan sebagai sebahagian daripada perjanjian gencatan senjata yang diusahakan Amerika Syarikat (AS) antara Hamas dan Israel.\n\nIsrael melancarkan siri serangan udara ke atas Gaza pada malam Selasa hingga Rabu, selepas satu serangan yang mengorbankan seorang tenteranya di selatan wilayah Palestin itu.\n\nAgensi Pertahanan Awam Gaza melaporkan, bahawa serangan itu mengorbankan lebih 100 orang, termasuk puluhan kanak-kanak, menjadikannya malam paling berdarah sejak gencatan senjata berkuat kuasa pada 10 Oktober.\n\nMenjelang pagi Rabu, Israel mengumumkan bahawa pihaknya memulakan kembali 'penguatkuasaan semula gencatan senjata', manakala Presiden AS, Donald Trump, serta pengantara serantau, Qatar, menyatakan keyakinan bahawa perjanjian itu akan terus kekal.\n\nHamas pula menegaskan bahawa pejuangnya 'tidak terbabit dalam kes tembakan di Rafah' dan menegaskan komitmen terhadap gencatan senjata.\n\nKumpulan itu juga menangguhkan penyerahan mayat seorang tebusan yang meninggal dunia, dengan alasan bahawa sebarang 'peningkatan serangan akan menyukarkan usaha mencari, menggali dan mengeluarkan mayat'.\n\nTindakan Hamas pada Isnin lalu menimbulkan kemarahan Israel apabila kumpulan itu menyerahkan cebisan mayat yang ditemui sebelum ini, sesuatu yang dianggap Israel sebagai pelanggaran terhadap perjanjian gencatan senjata.\n\nNamun, menurut Pejabat Perdana Menteri Israel, Hamas mendakwa cebisan itu adalah mayat ke-16 yang sepatutnya dipulangkan. \n\nbagaimanapun, siasatan forensik Israel mendapati ia sebenarnya bahagian tubuh seorang tebusan yang dibawa pulang ke Israel kira-kira dua tahun lalu.\n\nSelepas bermulanya gencatan senjata bulan ini, Hamas menyerahkan 20 tebusan yang masih hidup dan memulakan proses pemulangan mayat tebusan yang meninggal dunia.\n\nBagaimanapun, Israel menuduh Hamas melanggar perjanjian kerana gagal menyerahkan mayat dengan segera, manakala Hamas menjelaskan bahawa proses mencari mayat yang tertimbus di runtuhan Gaza memerlukan masa. - AFP","summary":"BAITULMAQDIS: Kumpulan pejuang Palestin, Hamas, menyerahkan dua lagi mayat tebusan warga Israel, sehari selepas gencatan senjata di Gaza kembali tergugat akibat serangan berdarah oleh tentera Israel di wilayah itu.","url":"https://www.bharian.com.my/dunia/asia/2025/10/1465733/israel-sah-terima-2-lagi-mayat-tebusan-daripada-hamas","image":"https://assets.bharian.com.my/images/articles/bh31sah-o_BHfield_image_listing_featured.var_1761869216.jpg","video":null,"publish_date":"2025-10-31 00:07:05","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.468},{"id":374269852,"title":"Warning or routine? Timing of Russian jet fly-past into Japan raises questions","text":"A near-incursion of Russian fighter jets into Japanese airspace last week was a bid by Moscow to intimidate Tokyo amid strengthening ties with Washington, observers warned.\nAnd unless there was a breakthrough in US-Russia relations, it was unlikely that ties between Moscow and Tokyo would thaw even under new Japanese Prime Minister Sanae Takaichi, they said.\nJapan said it scrambled jets last Friday to monitor Russian warplanes, including strategic bombers capable of carrying nuclear weapons, which had flown along the edge of Japanese airspace up its coast.\nRussia’s Defence Ministry, in a statement reported by state-owned RIA news agency, confirmed its Tu-95 bombers had been escorted by jets from another country during what it described as a routine patrol flight over neutral waters.\nThe incident was said to have taken place hours before Takaichi pledged to accelerate Japan’s defence build-up. In her first speech to parliament since taking office, she said Russia’s military activities, along with those of China and North Korea, were posing a “serious concern”.\n\nJapan’s Ministry of Defence released a map showing the flight path of the Russian planes off Japan’s west coast over the Sea of Japan. It said the bombers were accompanied by two Su-35 fighters and had initially flown towards Japan’s Sado Island before turning northwards.\n“Russia conducts daily military operations around our country while invading Ukraine – this is the reality,” new Defence Minister Shinjiro Koizumi wrote in a social media post.\nYoichiro Sato, a professor of Asia-Pacific studies at Japan’s Ritsumeikan Asia-Pacific University, said while Moscow had previously flown bombers around Japan’s airspace, the timing of last week’s manoeuvre was notable, coming just after Takaichi took office and before she was due to meet US President Donald Trump.\nRussia is trying to intimidate Japan against enhancing its alliance with the US\nYoichiro Sato, a professor of Asia-Pacific studies\n“[This] suggests Russia is trying to intimidate Japan against enhancing its alliance with the US,” Sato said. “This is likely counterproductive, as the domestic public opinion will support stronger defence that Takaichi pursues.”\nDuring Takaichi’s first summit with Trump on Tuesday, both sides agreed to strengthen the bilateral alliance’s deterrence and response capabilities.\nTokyo also made clear it would take the initiative in shoring up defence spending.\nPublic support for increased defence spending in Japan has grown in recent years. A Yomiuri Shimbun poll in April found that 53 per cent of respondents supported the government’s military budget increase.\n\nOn Wednesday, Koizumi told his visiting US counterpart, Pete Hegseth, that Japan would raise its defence budget to 2 per cent of its gross domestic product by the end of this financial year, two years ahead of its previous commitment.\nColder than Abe?\nAlthough Takaichi was a protege to late Japanese prime minister Shinzo Abe, Sato said she was unlikely to continue with her mentor’s “flirtation” with Russia.\n“The hardline [position] against Russia, which resulted in Japan’s joining of the western sanctions against Russia during the Fumio Kishida administration, is likely to be maintained by Takaichi,” Sato said.\nAbe and Russian leader Vladimir Putin met more than two dozen times over the course of the former’s second term as prime minister, from 2012 to 2020.\nApart from inviting Putin to his hometown of Nagato and attending the opening ceremony of the Sochi Winter Olympics in 2014 amid western leaders’ boycott, Abe also boosted economic ties with Moscow, especially in the Russian Far East.\n\nAbe also continued negotiations with Moscow on the disputed islands known as the Northern Territories in Japan and the Southern Kurils in Russia.\nArtyom Lukin, a professor at Russia’s Far Eastern Federal University in Vladivostok, said Takaichi’s leadership was unlikely to significantly alter Russia-Japan ties.\n“Political relations between Japan and Russia have already been virtually frozen under the previous prime ministers … Neither Japan nor Russia see each other as foreign policy priorities. It will not change under Takaichi,” Lukin said.\nTokyo’s behaviour towards Moscow would also depend on the state of relations between the US and Russia, he added. “If Trump makes a deal with Putin, Japan-Russia relations are likely to improve as well. If US-Russia relations deteriorate, Tokyo will follow suit.”\nTies between Washington and Moscow remain largely adversarial, driven by Russia’s ongoing war in Ukraine, with the US implementing a new round of sanctions targeting Russian oil on October 22.\nFollowing a phone call with Putin on October 16, Trump announced his intention to meet the Russian leader in Budapest within two weeks to discuss ending the war. But days later, on October 22, Trump called off the planned summit, stating that he did not want a “wasted meeting” or a “waste of time”.\n\nLukin said that an important thing to watch was whether the Takaichi government would drastically reduce, or even stop, purchases of Russian liquefied natural gas from Sakhalin.\n“If it happens, then, the last major economic link between Russia and Japan will be severed. It is not likely to happen in the short term, though,” Lukin predicted.\nWashington has been urging Tokyo to end Russian energy imports to reinforce sanctions on Moscow over its war against Ukraine that began in 2022.\nOn Tuesday, Takaichi told Trump that Japan intended to keep importing Russian gas for the time being, warning of the risk of domestic power shortages if imports were stopped, the Japanese media reported, citing government sources.\nLast year, Russia accounted for 8.6 per cent of Japan’s total imports of liquefied natural gas, which is mainly used for thermal power generation and city gas.\nThe gas comes from the Sakhalin 2 in the Russian Far East. Two Japanese firms continue to hold stakes in the energy project even after British oil giant Shell withdrew following Russia’s invasion of Ukraine.\nIndia, “intimidated” by Trump’s tariff, was expected to stop new Russian oil purchases and turn to alternative supplies from the Middle East, Sato said. “Japan is not off the hook either.”\nAdditional reporting by Reuters","summary":"A near-incursion of Russian fighter jets into Japanese airspace last week was a bid by Moscow to intimidate Tokyo amid strengthening ties with Washington, observers warned.\nAnd unless there was a breakthrough in US-Russia relations, it was unlikely that ties between Moscow and Tokyo would thaw even under new Japanese Prime Minister Sanae Takaichi, they said.\nJapan said it scrambled jets last Friday to monitor Russian warplanes, including strategic bombers capable of carrying nuclear weapons,...","url":"https://www.scmp.com/week-asia/politics/article/3330880/was-russian-jet-fly-past-bid-intimidate-japan-cooling-ties-us","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/30/88f321e2-3774-4034-b693-fb94d615e980_4fd1c4a4.jpg","video":null,"publish_date":"2025-10-31 00:00:12","author":"Maria Siow","authors":["Maria Siow"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.078},{"id":374265764,"title":"U.S. Rep. Wasserman Schultz, Venezuelan-American caucus slam Trump administration’s actions in the Caribbean","text":"SUNRISE, FLA. (WSVN) - Congresswoman Debbie Wasserman Schultz and members of South Florida’s Venezuelan-American community expressed their frustration with the Trump administration’s recent escalation in the Caribbean.\n\nSpeaking in Sunrise on Thursday, the congresswoman said the string of decisions to bomb alleged drug-carrying boats out of the ocean is a mistake.\n\n“Extrajudicial murder of Venezuelans is what [Venezuelan leader Nicolas] Maduro does, it’s not what America should do,” said Wasserman Schultz.\n\nMembers of the Venezuelan-American caucus said the bombings remind them of what happened back home decades ago.\n\n“I can not believe I am experiencing something that I already experienced in Venezuela all over again in the United States,” said Adelys Ferro, co-founder of the Venezuelan American Caucus.\n\nThe attacks on the boats in the Caribbean began in September and have taken place as recently as Wednesday. The Pentagon announced it targeted another alleged drug boat in the Pacific Ocean.\n\nSince the attacks started, the U.S. military has killed 61 people — all alleged to be drug traffickers by the administration.\n\nRecently, the Pentagon surged even more firepower to the region, sending the U.S.S. Gerald Ford and its strike group.\n\nAll this escalation, members in the Venezuelan American caucus say, is the wrong way to go about things.\n\n“What he is doing, in many ways, sadly, is very similar to what we know, what we have experienced back in Venezuela, and that similarity doesn’t have to do with any political way of thinking,” said Ferro.\n\nIn a sign of further escalation, President Donald Trump has said he’s exploring land strikes in Venezuela.\n\n“Those drug ships aren’t coming in anymore. We can’t find a ship. There are no ships coming in with drugs,” Trump said in Asia.\n\nTrump has declared the people on the boats to be “terrorists,” and his administration has said that the U.S. is in an “armed conflict,” but he has publicly provided no evidence of their alleged crimes or even identified them.\n\n“This is an operation against narcoterrorists – as the Department of War characterizes them, the Al-Qaida of the Western Hemisphere. These are well-funded, dangerous, violent drug cartels that operate as terrorists who are flooding our country with drugs,” said Secretary of State Marco Rubio.\n\nTrump claims the alleged drug trafficking is being orchestrated by Venezuela’s Maduro and says he has authorized covert CIA missions inside that country.\n\nCritics from the South Florida Venezuelan community said on Thursday they wish Congress had more of a say in all this.\n\n“They don’t want to talk to Congress; they don’t want to do the right thing. They are not even taking into consideration the rule of law,” said Ferro.\n\nRepublicans, however, say they don’t see an issue.\n\n“He plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia. So there will be a congressional briefing about a potential expansion from the sea to the land. I support that idea. But I think he has all the authority he needs,” said South Carolina Sen. Lindsey Graham.\n\nHouse Democrats criticized the Trump administration on Thursday for pulling the Pentagon lawyers set to brief them on the U.S. boat strikes against alleged drug traffickers at the last minute. They said they left completely unsatisfied with the information that was shared.\n\nCopyright 2025 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"Congresswoman Debbie Wasserman Schultz and members of South Florida&#8217;s Venezuelan-American community expressed their frustration with the Trump administration&#8217;s recent escalation in the Caribbean. Speaking in...","url":"https://wsvn.com/news/us-world/u-s-rep-wasserman-schultz-venezuelan-american-caucus-slam-trump-administrations-actions-in-the-caribbean/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/10/103025-US-Rep-Debbie-Wasserman-Schultz-and-members-of-Venezuelan-American-Caucus.png","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/3e55199d-a1c1-4883-8051-7f21e71168bc/f35002cc-2954-4ba8-800f-0aba272c46c5/main.mp4?fastly_token=NjkwNDU0YjFfOTlkMTE5Y2YwMzgzZDEyODBjOTU1NDY5OTAzNjVmNDU4Y","publish_date":"2025-10-30 23:59:40","author":"Joe Roetz,Kevin Boulandier","authors":["Joe Roetz","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.372},{"id":374263496,"title":"As Nick Fuentes' star rises in wake of Charlie Kirk's death, he quietly strikes deal on battery charge","text":"While hosting white nationalist Nick Fuentes on his show this week, former Fox News host Tucker Carlson recognized the persistence of Fuentes’ alt-right movement.\n\nCarlson had contemplated bringing the La Grange native on his show because of past online feuds between the two. Fuentes’ racist, misogynistic and antisemitic views have been viewed as even too extreme for some right wingers, ostracizing him from mainstream Republicans.\n\nBut his profile has risen in the weeks since the Sept. 10 killing of far-right commentator Charlie Kirk.\n\n“You’re clearly ascendant, you’re enormously talented, you’re more talented than I am, for sure, as a talker. There have been a lot of attempts to silence you and it hasn’t worked,” Carlson said on his show, which has nearly 5 million subscribers.\n\n“I don’t think Fuentes is going away. Ben Shapiro tried to strangle him in the crib in college, and now he’s bigger than ever,” Carlson added, pointing to an earlier conversation in the episode in which Fuentes claimed Shapiro, a conservative commentator, tried crushing his reputation when he started to grow a following in college.\n\nIn addition to Carlson’s show, Fuentes has recently made appearances on conservative conspiracy theorist Alex Jones’ talk show “Infowars,” right-wing commentator Candace Owens’ podcast and Libertarian Dave Smith’s “Part of the Problem,” to name a few.\n\nSince the death of Kirk, another suburban Chicago native, Fuentes, 27, has gained more than 100,000 followers on X and Rumble, and his podcast reached the No. 1 trending spot on Spotify before it was removed from the platform in mid-October for violating its hate speech policies. His first “America First” show that aired after Kirk’s death collected more than 2.5 million views on Rumble.\n\nFuentes is “positioning himself as the sort of alt-Charlie Kirk,” said Hannah Gais, a senior researcher at the Southern Poverty Law Center. “And I think since Kirk’s death, even though Fuentes isn’t quite as wrapped up in MAGA, [Fuentes] has sort of tried to position himself as being the successor to Charlie Kirk.”\n\nConfrontation in Berwyn\n\nBut even with his growing popularity, Fuentes was able to quietly reach a deal with Cook County prosecutors earlier this month to settle a misdemeanor battery charge.\n\nThe case stems from a confrontation at his Berwyn home last November, when he pepper sprayed and pushed a woman who came to his front door after his address was leaked online. \n\nThe woman went to confront Fuentes after he posted a message on X as the 2024 election results began to favor President Donald Trump. In the post, Fuentes mocked the idea that women have a right to control their own bodies, saying, “Your body, my choice. Forever.” \n\nFuentes was charged with battery in the clash that ensued, but under Fuentes’ agreement with prosecutors, the charge will be dismissed as long as he completes an anger management class and 75 hours of community service, pays $635 to the victim and apologizes to her in court, records show. The next hearing in the case is scheduled for early December. \n\nFuentes did not respond to multiple requests for comment. \n\n‘We’re fighting for our lives … for our race’: Fuentes\n\nFuentes has come a long way since 2015, when as a student at Lyons Township High School, he started the “Nick Fuentes Show” on the YouTube alternative Rumble .\n\nHe urged Trump to drop out of the presidential race during his first episode breaking down the candidates for the 2016 presidential election.\n\n“I, as a Tea Party Republican, believe in equality for women, believe that Black lives matter,” the 17-year-old Fuentes said in his first show. “I believe in social justice. I support sustainable development. I believe we should protect the environment, and I believe that everybody should make enough money to feed themselves and have access to health care.”\n\n“Believe it or not, Republicans and Democrats share the same objectives. The real debate is over the means to achieve them.”\n\nBut Fuentes quickly moved right and publicly backed Trump. He rose into the public eye after attending the 2017 white supremacist “unite the right rally” in Charlottesville, Virginia, as well as the Jan. 6, 2021, riot at the U.S. Capitol. The following year, he dined with Trump and Chicago native Ye at Mar-a-Lago.\n\nSince then, he’s amassed hundreds of thousands of followers and viewers of his late-night show which streams five nights a week on Rumble, a platform which is popular with conservatives, and where he landed as the second-most watched streamer in this year’s third quarter. Clips of the show are shared on other social media platforms, garnering millions of views.\n\nFuentes sells America First items, including t-shirts, hats and flags. He also makes money through Super Chats donations, which allow livestream viewers to pay money for their comment to be highlighted on the show. \n\nFuentes’ America First Foundation made nearly $44,000 in the fiscal year ending in June 2024, according to tax records. While his foundation made about $4,000 the year prior, the nonprofit raked in about $200,000 in donations in 2022.\n\nThe America First Plus subscription service includes: $15 a month for access to the America First archives, $30 a month for the archive and an AI powered search and $100 a month for archive access and a group chat with Fuentes. It’s unclear how much money he’s earned through these channels.\n\nAmong the first young Republican livestreamers, other right-wing commentators have followed his lead of livestreaming and rhetoric as a model for their own platforms, Gais said.\n\n“I think there’s a lot of mainstream right-wing figures, like Tucker Carlson, obviously Charlie Kirk before he died, but other people within kind of the more mainstream pro-Trump media sphere looking at Fuentes’ fandom and basically trying to find ways to connect with the ideas that are appealing to Fuentes’ base,” she said.\n\nPushing Republicans further right\n\nFuentes makes no secret of the fact he wants to push the Republican Party further right “basically through infiltration,” Gais said.\n\nFor example, Fuentes’ followers, who are called Groypers, named after an alt-right meme, have targeted various parts of young Republican organizing, such as Kirk’s nonprofit student program Turning Point USA, Gais said.\n\nIn 2019, a group of Groypers crashed one of Kirk’s debate events and pressed him on topics like Israel, the Black community, immigration and crime, and questioned why Turning Point USA didn’t take more extreme stances on them.\n\n“They want them to be more racist. They want them to break with current U.S. policy over Israel for antisemitic reasons, basically to push Jews out of public life, and I think within the movement, that’s very much been his role dating back to the first Trump administration,” Gais said of the split. Officials with Turning Point USA did not respond to a request for comment.\n\nFuentes hasn’t endorsed a 2028 presidential candidate — and opposes Vice President JD Vance — but he acknowledged during Jones’ show that, “A Republican’s gotta win in ‘28, whoever it is.”\n\n“We’re fighting for our lives, we’re fighting for God, we’re fighting for our country, yes, we’re fighting for our race,” Fuentes said during a recent “America First” show, when explaining, “what we mean when we say, ‘Make America great again.’”\n\nLast December, Fuentes was the target of what he described as a “would-be assassin” who was killed in a shootout with police near Fuentes’ home after the man allegedly killed three people downstate. A surveillance camera on Fuentes’ front porch showed the 24-year-old Westchester man wearing a motorcycle helmet and carrying what appeared to be a handgun and a crossbow. His motive for targeting Fuentes remains unclear.\n\nAfter Kirk’s death, a conspiracy circulated that it was Fuentes’ own followers who were responsible for Kirk’s death. But Fuentes has denied it, even claiming that his followers were “framed.” And no evidence suggests Tyler Robinson, accused of Kirk’s murder, was a Fuentes follower.\n\n‘You don’t know what you’re talking about,’ Fuentes regularly tells followers\n\nDespite his defense of Groypers, Fuentes often bickers with them on his livestream, who pay $10 for a comment to appear on his Rumble. He regularly shows disdain for them, telling them to, “Shut the f--- up,” or “kill yourself.”\n\nIn response to one commenter in a recent livestream who said if he was nicer to his followers, he’d make more money, Fuentes said, “Thanks, idiot.”\n\n“I know like a typical woman, you think you know everything and you think it’s your place to tell everybody what to do and just what you think, you give them a piece of your mind. Shut the f--- up, you don’t know what you’re talking about,” Fuentes said.\n\nStill, the Groypers are among some of the most loyal followers of any American political influencer. And his brief run-in with the law, which likely won’t turn into a conviction on his permanent record, doesn’t even seem to be a bump in the road for Fuentes’ movement.\n\n“I don’t think his followers really care,” Gais said of Fuentes having to complete community service and anger management. \n\nHowever, Rose, the victim in the incident, said in a statement to the Sun-Times that she hopes the terms of the agreement sends a message that there are repercussions for what he did.\n\n“My main hope is that online bigots get the message that speech is free, yes, but there are consequences to it as well as consequences to their actions,” said Rose, a 58-year-old writer and co-founder of a vegan lifestyle website. “I hope that anyone who promotes discrimination and hate in the world will see this as a reminder that even in our political climate, they will be held accountable by some of us.”","url":"https://chicago.suntimes.com/politics/2025/10/17/nick-fuentes-charlie-kirk-tucker-carlson-infowars-conservative-maga","image":"https://cst.brightspotcdn.com/dims4/default/5639cb2/2147483647/strip/false/crop/5956x3971+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F25%2F8e%2Ff333f8a4821c6bc00c2d8293ba72%2Fmerli","video":null,"publish_date":"2025-10-30 23:57:13","author":"Kade Heather","authors":["Kade Heather"],"language":"en","source_country":"us","sentiment":-0.354},{"id":374268168,"title":"Who Is Casey Means? 5 Things About Trump’s Surgeon General Nominee – Hollywood Life","text":"Casey Means is making headlines as President Donald Trump has nominated her for Surgeon General. On May 7, 2025, the 47th president of the United States announced on Truth Social, “I am pleased to announce that Dr. Casey Means, will be nominated as our next Surgeon General of the United States of America. Casey has impeccable ‘MAHA’ credentials, and will work closely with our wonderful Secretary of Health and Human Services, Robert F. Kennedy, Jr., to ensure a successful implementation of our Agenda in order to reverse the Chronic Disease Epidemic, and ensure Great Health, in the future, for ALL Americans.”\n\nHe added, “Her academic achievements, together with her life’s work, are absolutely outstanding. Dr. Casey Means has the potential to be one of the finest Surgeon Generals in United States History. Congratulations to Casey! Secretary Kennedy looks forward to working with Dr. Janette Nesheiwat in another capacity at HHS. Thank you for your attention to this matter.”\n\nAs Casey awaits her official confirmation, learn more about who she is below.\n\nCasey Means Is a Stanford University Alum\n\nCasey, born Paula Casey Means on September 24, 1987, is a Stanford University alumna. Although she has spent time in the medical field, she is not a practicing physician.\n\nShe noted on her website, “During my training as a surgeon, I saw how broken and exploitative the healthcare system is and left surgery to focus on how to keep people out of the operating room. As a co-founder of Levels Health, I saw how transformational it can be to deeply understand your own health. I hope my work can help you on your journey to feeling incredible, avoiding preventable diseases, and aging well.”\n\nCasey Means Is Also an Author\n\nIn addition to her medical background, Casey is also an author. She wrote Good Energy: The Surprising Connection Between Metabolism and Limitless Health.\n\nIs Casey Means Married? \n\nYes, Casey is reportedly married to her husband, Brian Nickerson, according to multiple outlets. She was also expecting her first child as of October 2025. \n\nCasey Means Is a Surgeon General Nominee\n\nCasey now awaits the next steps following her nomination by Donald Trump to become the next Surgeon General.","summary":"Image Credit: Casey Means/Instagram Casey Means is making headlines as President Donald Trump has nominated her for Surgeon General. On May 7, 2025, the 47th president of the United States announced on Truth Social, “I am pleased to announce that Dr. Casey Means, will be nominated as our next Surgeon General of the United States [&#8230;]\n\n\nThe post Who Is Casey Means? 5 Things About Trump’s Surgeon General Nominee – Hollywood Life appeared first on Ghana Latest News.","url":"https://ghananewss.com/who-is-casey-means-5-things-about-trumps-surgeon-general-nominee-hollywood-life/","image":"https://hollywoodlife.com/wp-content/uploads/2025/05/Screenshot-2025-05-08-at-8.48.18 AM-3-e1746715016316.png?resize=384%2C216","video":null,"publish_date":"2025-10-30 23:54:31","author":"Franklin Asare,Ghana News","authors":["Franklin Asare","Ghana News"],"language":"en","source_country":"gh","sentiment":0.562},{"id":374261116,"title":"Kamala Harris’ ‘world-class pivot’ when asked about Biden’s ‘frailties’ floors journalist: ‘We all saw the debate’","text":"Kamala Harris’ attempt to sidestep a question from an Australian reporter about former President Joe Biden’s mental decline fell flat, after the journalist called out the ex-vice president’s “world-class pivot.” \n\nThe former vice president, who has long been hesitant to criticize Biden in interviews, went on a minute-long rant about President Trump when asked if her former boss’ “refusal to recognize his own frailties” cost her the 2024 election, during an interview Wednesday with ABC TV’s “7:30” host Sarah Ferguson. \n\n“I ran against Donald Trump for president, and Donald Trump ran on a platform that was, in large part, I believe, misrepresenting his intentions to the American people,” Harris’ incredible dodge began. \n\nShe went on to accuse Trump of lying to voters about his priorities and whined about the “massive amounts of mis- and disinformation” she heard on the campaign trail before Ferguson interrupted the failed Democratic nominee for president. \n\n“Forgive me,” Ferguson jumped in, as Harris continued to talk. “I want to interrupt you because that is a world-class pivot, but it is not the question that I asked you, which is about Joe Biden’s failure to recognize his own frailties and what that did to you.” \n\n“Are you still reluctant to criticize the former president?” the reporter asked. \n\nHarris appeared taken aback by the Australian journalist’s persistence, and a testy exchange followed. \n\n“In what regard, please? What exactly would you like to ask? Be more specific, if you don’t mind,” the ex-veep, sounding confused, asked Ferguson. \n\nThe reporter reiterated the question about Biden’s “frailties.” \n\n“He was not frail as president of the United States,” Harris wildly claimed. \n\nTo which the reporter shot back: “But he had frailties. We all saw the debate.” \n\nHarris maintained that Biden “had the capacity to be president” and that she “never doubted that he had the capacity to be president.” \n\nShe would only concede that she had “concerns” about the then-81-year-old president’s ability to handle the rigors of a presidential campaign. \n\n“Is there a reason why you won’t go to that prolonged frailty question?” Ferguson pressed. \n\n“I have answered that question,” Harris insisted. “I do not believe [Biden was frail].”","summary":"Harris, long been hesitant to criticize Biden publicly, went on a minute-long rant about Trump when asked if her former boss’ “refusal to recognize his own frailties” cost her the 2024 election.","url":"https://nypost.com/2025/10/30/us-news/kamala-harris-world-class-pivot-when-asked-about-bidens-frailties-floors-journalist/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/us-president-joe-biden-looks-114499242.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/wzn89szs-RyIcpnTz.mp4","publish_date":"2025-10-30 23:54:07","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.177},{"id":374268182,"title":"Trump hosts White House Halloween bash with superheroes and presidential lookalikes amid shutdown","text":"By WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump hosted hundreds of costumed guests — from superheroes to dinosaurs and even a few children dressed as the first couple — as part of Thursday night’s Halloween celebration at the White House.\n\nHe and first lady Melania Trump emerged on the South Lawn as evening was starting to fall to an orchestral version of Michael Jackson’s “Thriller.” Neither was in costume. Trump wore a blue suit and red tie with a red “USA” cap; his wife was in a brown coat over an orange dress.\n\nThe couple handed out full-sized Hershey bars and Twizzlers in boxes with the presidential seal to a line of children and their parents that stretched down the driveway. Temporary walls obscured the view of the construction of Trump’s new White House ballroom — which has led to the demolition of the East Wing — though a parked bulldozer could still be seen hulking on the other side.\n\n“It’s a long line,” Trump said. “It’s almost as big as the ballroom.”\n\nThe White House tradition went ahead despite Trump returning mere hours earlier from a six-day Asia trip that took him to Malaysia, Japan, South Korea, and amid a government shutdown in its 30th day.\n\nTrump has called for the government to reopen, but congressional Democrats are demanding an extension of expiring tax credits that have helped millions of people afford health insurance. Their Republican colleagues say they won’t negotiate until the government is reopened.\n\nTrump’s tariffs on Chinese imports have reduced inventory and raised prices for Halloween costumes for American importers, retailers and shoppers. Still, the White House exterior featured dozens of decorations resembling large autumn leaves and fall flowers like orange and red mums. The stairs leading to its balcony were crowded with carved pumpkins.\n\nAmong the children attending the Halloween party were those of members of the military and White House staffers. Karoline Leavitt, the White House press secretary, came with her young son dressed as a pumpkin. Katie Miller, a former Trump administration aide, was dressed as a skeleton, while her husband, Stephen, Trump’s deputy White House chief of staff, wore only a business suit.\n\nHundreds of children, tiny toddlers up to kids in their early teens, came dressed as Spider-Man and Captain America, ballerinas, princesses and leprechauns. Two boys wore suits, Trump hats and grins like the president, though they didn’t try to pull off his signature hairdo, while a girl with them wore a white coat over a dress like one the first lady might favor.\n\nSeveral parents had “USA” caps like Trump.\n\nSome children were shy or skittish about talking with the Trumps, but the president said something inaudible to a child whose costume consisted of sitting with his pants down on an inflatable toilet stenciled with “Wide Load” on the back.","summary":"Trump just returned from a six-day Asia trip, and the government being shut down.","url":"https://www.ocregister.com/2025/10/30/trump-halloween/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Trump_Halloween_01775-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-30 23:53:13","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.008},{"id":374268100,"title":"Trump hosts White House Halloween bash with superheroes and presidential lookalikes amid shutdown","text":"By WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump hosted hundreds of costumed guests — from superheroes to dinosaurs and even a few children dressed as the first couple — as part of Thursday night’s Halloween celebration at the White House.\n\nHe and first lady Melania Trump emerged on the South Lawn as evening was starting to fall to an orchestral version of Michael Jackson’s “Thriller.” Neither was in costume. Trump wore a blue suit and red tie with a red “USA” cap; his wife was in a brown coat over an orange dress.\n\nThe couple handed out full-sized Hershey bars and Twizzlers in boxes with the presidential seal to a line of children and their parents that stretched down the driveway. Temporary walls obscured the view of the construction of Trump’s new White House ballroom — which has led to the demolition of the East Wing — though a parked bulldozer could still be seen hulking on the other side.\n\n“It’s a long line,” Trump said. “It’s almost as big as the ballroom.”\n\nThe White House tradition went ahead despite Trump returning mere hours earlier from a six-day Asia trip that took him to Malaysia, Japan, South Korea, and amid a government shutdown in its 30th day.\n\nTrump has called for the government to reopen, but congressional Democrats are demanding an extension of expiring tax credits that have helped millions of people afford health insurance. Their Republican colleagues say they won’t negotiate until the government is reopened.\n\nTrump’s tariffs on Chinese imports have reduced inventory and raised prices for Halloween costumes for American importers, retailers and shoppers. Still, the White House exterior featured dozens of decorations resembling large autumn leaves and fall flowers like orange and red mums. The stairs leading to its balcony were crowded with carved pumpkins.\n\nAmong the children attending the Halloween party were those of members of the military and White House staffers. Karoline Leavitt, the White House press secretary, came with her young son dressed as a pumpkin. Katie Miller, a former Trump administration aide, was dressed as a skeleton, while her husband, Stephen, Trump’s deputy White House chief of staff, wore only a business suit.\n\nHundreds of children, tiny toddlers up to kids in their early teens, came dressed as Spider-Man and Captain America, ballerinas, princesses and leprechauns. Two boys wore suits, Trump hats and grins like the president, though they didn’t try to pull off his signature hairdo, while a girl with them wore a white coat over a dress like one the first lady might favor.\n\nSeveral parents had “USA” caps like Trump.\n\nSome children were shy or skittish about talking with the Trumps, but the president said something inaudible to a child whose costume consisted of sitting with his pants down on an inflatable toilet stenciled with “Wide Load” on the back.","summary":"Trump just returned from a six-day Asia trip, and the government being shut down.","url":"https://www.bostonherald.com/2025/10/30/trump-halloween/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Trump_Halloween_01775-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-10-30 23:53:13","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.008},{"id":374262388,"title":"Trump hosts White House Halloween bash with superheroes and presidential lookalikes amid shutdown","text":"By WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump hosted hundreds of costumed guests — from superheroes to dinosaurs and even a few children dressed as the first couple — as part of Thursday night’s Halloween celebration at the White House.\n\nHe and first lady Melania Trump emerged on the South Lawn as evening was starting to fall to an orchestral version of Michael Jackson’s “Thriller.” Neither was in costume. Trump wore a blue suit and red tie with a red “USA” cap; his wife was in a brown coat over an orange dress.\n\nThe couple handed out full-sized Hershey bars and Twizzlers in boxes with the presidential seal to a line of children and their parents that stretched down the driveway. Temporary walls obscured the view of the construction of Trump’s new White House ballroom — which has led to the demolition of the East Wing — though a parked bulldozer could still be seen hulking on the other side.\n\n“It’s a long line,” Trump said. “It’s almost as big as the ballroom.”\n\nThe White House tradition went ahead despite Trump returning mere hours earlier from a six-day Asia trip that took him to Malaysia, Japan, South Korea, and amid a government shutdown in its 30th day.\n\nTrump has called for the government to reopen, but congressional Democrats are demanding an extension of expiring tax credits that have helped millions of people afford health insurance. Their Republican colleagues say they won’t negotiate until the government is reopened.\n\nTrump’s tariffs on Chinese imports have reduced inventory and raised prices for Halloween costumes for American importers, retailers and shoppers. Still, the White House exterior featured dozens of decorations resembling large autumn leaves and fall flowers like orange and red mums. The stairs leading to its balcony were crowded with carved pumpkins.\n\nAmong the children attending the Halloween party were those of members of the military and White House staffers. Karoline Leavitt, the White House press secretary, came with her young son dressed as a pumpkin. Katie Miller, a former Trump administration aide, was dressed as a skeleton, while her husband, Stephen, Trump’s deputy White House chief of staff, wore only a business suit.\n\nHundreds of children, tiny toddlers up to kids in their early teens, came dressed as Spider-Man and Captain America, ballerinas, princesses and leprechauns. Two boys wore suits, Trump hats and grins like the president, though they didn’t try to pull off his signature hairdo, while a girl with them wore a white coat over a dress like one the first lady might favor.\n\nSeveral parents had “USA” caps like Trump.\n\nSome children were shy or skittish about talking with the Trumps, but the president said something inaudible to a child whose costume consisted of sitting with his pants down on an inflatable toilet stenciled with “Wide Load” on the back.","summary":"Trump just returned from a six-day Asia trip, and the government being shut down.","url":"https://www.twincities.com/2025/10/30/trump-halloween/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Trump_Halloween_01775-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-30 23:53:13","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.008},{"id":374263506,"title":"Trump hosts White House Halloween bash with superheroes and presidential lookalikes amid shutdown","text":"By WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump hosted hundreds of costumed guests — from superheroes to dinosaurs and even a few children dressed as the first couple — as part of Thursday night’s Halloween celebration at the White House.\n\nHe and first lady Melania Trump emerged on the South Lawn as evening was starting to fall to an orchestral version of Michael Jackson’s “Thriller.” Neither was in costume. Trump wore a blue suit and red tie with a red “USA” cap; his wife was in a brown coat over an orange dress.\n\nThe couple handed out full-sized Hershey bars and Twizzlers in boxes with the presidential seal to a line of children and their parents that stretched down the driveway. Temporary walls obscured the view of the construction of Trump’s new White House ballroom — which has led to the demolition of the East Wing — though a parked bulldozer could still be seen hulking on the other side.\n\n“It’s a long line,” Trump said. “It’s almost as big as the ballroom.”\n\nThe White House tradition went ahead despite Trump returning mere hours earlier from a six-day Asia trip that took him to Malaysia, Japan, South Korea, and amid a government shutdown in its 30th day.\n\nTrump has called for the government to reopen, but congressional Democrats are demanding an extension of expiring tax credits that have helped millions of people afford health insurance. Their Republican colleagues say they won’t negotiate until the government is reopened.\n\nTrump’s tariffs on Chinese imports have reduced inventory and raised prices for Halloween costumes for American importers, retailers and shoppers. Still, the White House exterior featured dozens of decorations resembling large autumn leaves and fall flowers like orange and red mums. The stairs leading to its balcony were crowded with carved pumpkins.\n\nAmong the children attending the Halloween party were those of members of the military and White House staffers. Karoline Leavitt, the White House press secretary, came with her young son dressed as a pumpkin. Katie Miller, a former Trump administration aide, was dressed as a skeleton, while her husband, Stephen, Trump’s deputy White House chief of staff, wore only a business suit.\n\nHundreds of children, tiny toddlers up to kids in their early teens, came dressed as Spider-Man and Captain America, ballerinas, princesses and leprechauns. Two boys wore suits, Trump hats and grins like the president, though they didn’t try to pull off his signature hairdo, while a girl with them wore a white coat over a dress like one the first lady might favor.\n\nSeveral parents had “USA” caps like Trump.\n\nSome children were shy or skittish about talking with the Trumps, but the president said something inaudible to a child whose costume consisted of sitting with his pants down on an inflatable toilet stenciled with “Wide Load” on the back.","summary":"Trump just returned from a six-day Asia trip, and the government being shut down.","url":"https://www.sandiegouniontribune.com/2025/10/30/trump-halloween/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Trump_Halloween_01775-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-30 23:53:13","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.008},{"id":374261126,"title":"Thank God the feds have come to clean up Washington Square Park","text":"New York City shouldn’t need the feds to help clear Washington Square Park of the pushers who’ve turned it into an open-air drug market — but it did. \n\nWith the eager cooperation of the NYPD, federal agents on Thursday nabbed 19 heavy-duty, career drug dealers with at least 80 arrests among them\n\nPer court documents, drugs dealt by the crew that calls itself WSP Enterprise led to at least two deaths last year: an 18-year-old from Aspen, Colo. who’d just graduated high school and a 43-year-old homeless park dweller.\n\nThe busts follow years of Albany “decriminalizing” most crime, so that few of these dealers could actually be jailed — with an assist from shoulder-shrugging local authorities, notably feckless Manhattan District Attorney Alvin Bragg.\n\nThe suspects have been riding a local criminal-justice merry-go-round: arrested, booked into jail, arraigned and then immediately released by tag teams of pliant assistant DAs and mawkish turn-‘em-loose judges. \n\nIt’s not like DA Bragg — whose infamous “Day One” memo demanded a “presumption of pre-trial non-incarceration” for virtually every crime short of murder — didn’t know what was going on in one-time jewel-box urban oasis. \n\n But his answer to the gross dysfunction in Washington Square was — wait for it — watercolors.\n\nThat’s right. Bragg sponsored an “art of healing workshop” in the drug-infested northwest corner of the park last July, explaining, “It’s very intentional to pick that part of the park which has had some challenges.”\n\nChallenges.\n\nAs the Post reported, Bragg meditatively painted a picture of a tree on a tiny canvas while drug addicts nodded off on nearby park benches.\n\nFederal intervention, coming after years of reporting, community meetings and police patrols, is better late than never — and a strong proof-of-concept for President Donald Trump’s vow to send law enforcement into cities where the local authorities either can’t or won’t enforce the law.\n\nThe scene in Washington Square Park has been a vile hellscape for years, with addicts openly shooting up or smoking crack or meth, dealers openly soliciting potential customers and telling non-buyers to get lost.\n\nA functioning, healthy city would’ve fixed this problem long ago: Its prosecutors would have worked with the police to develop strong cases against the degenerate vendors of venom, and its judges would have handed out some serious time, even despite Albany’s meddling.\n\nHere’s hoping the feds have their eyes on East Harlem, the Hub in The Bronx and other neighborhoods where the drug scourge has been allowed to fester — and that the city continues to have a mayor and police commissioner who’ll welcome the help.","summary":"New York City shouldn't need the feds to help clear Washington Square Park of the pushers who've turned it into an open-air drug market — but it did.","url":"https://nypost.com/2025/10/30/opinion/thank-god-the-feds-have-come-to-clean-up-washington-square-park/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-hlxvtbhko-1761867196317.jpg?quality=75&strip=all&1761852871&w=1200","video":null,"publish_date":"2025-10-30 23:51:18","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.321},{"id":374268180,"title":"Lawyers for Comey seek grand jury transcript, bringing fresh challenge to a case pushed by Trump","text":"By ERIC TUCKER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — Lawyers for former FBI Director James Comey want to review a transcript and audio recording of grand jury proceedings in his criminal case, citing what they say were “irregularities” in the process that should result in the dismissal of an indictment pushed by President Donald Trump.\n\nThe request is one in a series of challenges that defense lawyers have waged against a criminal case charging Comey with making a false statement to Congress five years ago.\n\nDefense lawyers last week asked for the case to be thrown out before trial on the grounds that it constituted a vindictive prosecution and because they say the hastily appointed U.S. attorney who filed the indictment was illegally appointed to the job.\n\nComey’s lawyers leveled new arguments against that prosecutor, Lindsey Halligan, saying in a filing Thursday that her inexperience had tainted the process, created confusion and raised the prospect that legal and factual errors were presented to the grand jury that returned the indictment.\n\nAs examples, they cite the fact that the indictment was secured after hours with only 14 grand juror votes and that Halligan erroneously signed two separate indictments — including one containing a charge that the grand jury rejected.\n\n“All available information regarding Ms. Halligan’s first-ever grand jury presentation smacks of irregularity,” Comey’s lawyers wrote. “It is virtually unheard of for a brand-new prosecutor to make her first grand jury presentation alone, without the supervision and guidance of an experienced prosecutor to ensure the absence of factual and legal errors.”\n\nTrump had announced his plan to nominate Halligan as U.S. Attorney for the Eastern District of Virginia just one day after the prosecutor who had held the job, Erik Siebert, resigned under Trump administration pressure. In declaring his support for Halligan, Trump complained in a Truth Social post directed to Attorney General Pam Bondi that “nothing is being done” on investigations into some of his foes and called for action, specifically referencing inquiries into Comey, New York Attorney General Letitia James and Democratic Sen. Adam Schiff of California.\n\n“Although such inexperience alone would not ordinarily satisfy the defense’s burden for unsealing grand jury materials, that inexperience must be viewed alongside Ms. Halligan’s likely motive to obtain an indictment to satisfy the President’s demands, the inaccuracies in the indictment, and the determination of every career prosecutor to consider the case that charges were not warranted,” Comey’s lawyers wrote.\n\nIn separate filings Thursday, Comey’s legal team also requested specific details about the conduct at the center of the criminal case, saying the terse indictment is not even clear as to what Comey is alleged to have done wrong. They also asserted that the answers he gave to “fundamentally ambiguous questions” at the Senate hearing at which he is alleged to have lied were “literally true” and that, therefore, the case must be dismissed.\n\nThe indictment accuses Comey of having misled the Senate Judiciary Committee on Sept. 30, 2020, in response to questions from Republican Sen. Ted Cruz about whether Comey had authorized a news media leak. But Comey’s lawyers say the indictment misstates his exchange with Cruz, attributing to Comey statements he did not make.\n\nThe defense team says the indictment omits context from Cruz’s question that made clear he was asking Comey if he had authorized his deputy director, Andrew McCabe, to serve as an anonymous source to the news media. The lawyers say the indictment misleadingly suggests the questioning from Cruz concerned another person, a Columbia University law professor and Comey friend named Daniel Richman. An earlier FBI investigation into whether Comey had disclosed classified information through Richman concluded there was insufficient evidence to charge either man.\n\n“Senator Cruz’s questions are fundamentally ambiguous because people of ordinary intellect would not be expected to understand that he meant to ask a broad question about Mr. Comey’s interactions with anyone at the FBI — including Daniel Richman — during a colloquy focused on Mr. McCabe,” Comey’s lawyers wrote. “On the contrary, a reasonable person readily would have understood Senator Cruz to be asking only whether Mr. Comey had specifically authorized Mr. McCabe to be an anonymous source in news reports.”","summary":"The request is one in a series of challenges in the case.","url":"https://www.ocregister.com/2025/10/30/comey-justice-department-grand-jury-transcript/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Trump_Russia_Probe_22884.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-30 23:49:59","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":374268094,"title":"Lawyers for Comey seek grand jury transcript, bringing fresh challenge to a case pushed by Trump","text":"By ERIC TUCKER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — Lawyers for former FBI Director James Comey want to review a transcript and audio recording of grand jury proceedings in his criminal case, citing what they say were “irregularities” in the process that should result in the dismissal of an indictment pushed by President Donald Trump.\n\nThe request is one in a series of challenges that defense lawyers have waged against a criminal case charging Comey with making a false statement to Congress five years ago.\n\nDefense lawyers last week asked for the case to be thrown out before trial on the grounds that it constituted a vindictive prosecution and because they say the hastily appointed U.S. attorney who filed the indictment was illegally appointed to the job.\n\nComey’s lawyers leveled new arguments against that prosecutor, Lindsey Halligan, saying in a filing Thursday that her inexperience had tainted the process, created confusion and raised the prospect that legal and factual errors were presented to the grand jury that returned the indictment.\n\nAs examples, they cite the fact that the indictment was secured after hours with only 14 grand juror votes and that Halligan erroneously signed two separate indictments — including one containing a charge that the grand jury rejected.\n\n“All available information regarding Ms. Halligan’s first-ever grand jury presentation smacks of irregularity,” Comey’s lawyers wrote. “It is virtually unheard of for a brand-new prosecutor to make her first grand jury presentation alone, without the supervision and guidance of an experienced prosecutor to ensure the absence of factual and legal errors.”\n\nTrump had announced his plan to nominate Halligan as U.S. Attorney for the Eastern District of Virginia just one day after the prosecutor who had held the job, Erik Siebert, resigned under Trump administration pressure. In declaring his support for Halligan, Trump complained in a Truth Social post directed to Attorney General Pam Bondi that “nothing is being done” on investigations into some of his foes and called for action, specifically referencing inquiries into Comey, New York Attorney General Letitia James and Democratic Sen. Adam Schiff of California.\n\n“Although such inexperience alone would not ordinarily satisfy the defense’s burden for unsealing grand jury materials, that inexperience must be viewed alongside Ms. Halligan’s likely motive to obtain an indictment to satisfy the President’s demands, the inaccuracies in the indictment, and the determination of every career prosecutor to consider the case that charges were not warranted,” Comey’s lawyers wrote.\n\nIn separate filings Thursday, Comey’s legal team also requested specific details about the conduct at the center of the criminal case, saying the terse indictment is not even clear as to what Comey is alleged to have done wrong. They also asserted that the answers he gave to “fundamentally ambiguous questions” at the Senate hearing at which he is alleged to have lied were “literally true” and that, therefore, the case must be dismissed.\n\nThe indictment accuses Comey of having misled the Senate Judiciary Committee on Sept. 30, 2020, in response to questions from Republican Sen. Ted Cruz about whether Comey had authorized a news media leak. But Comey’s lawyers say the indictment misstates his exchange with Cruz, attributing to Comey statements he did not make.\n\nThe defense team says the indictment omits context from Cruz’s question that made clear he was asking Comey if he had authorized his deputy director, Andrew McCabe, to serve as an anonymous source to the news media. The lawyers say the indictment misleadingly suggests the questioning from Cruz concerned another person, a Columbia University law professor and Comey friend named Daniel Richman. An earlier FBI investigation into whether Comey had disclosed classified information through Richman concluded there was insufficient evidence to charge either man.\n\n“Senator Cruz’s questions are fundamentally ambiguous because people of ordinary intellect would not be expected to understand that he meant to ask a broad question about Mr. Comey’s interactions with anyone at the FBI — including Daniel Richman — during a colloquy focused on Mr. McCabe,” Comey’s lawyers wrote. “On the contrary, a reasonable person readily would have understood Senator Cruz to be asking only whether Mr. Comey had specifically authorized Mr. McCabe to be an anonymous source in news reports.”","summary":"The request is one in a series of challenges in the case.","url":"https://www.bostonherald.com/2025/10/30/comey-justice-department-grand-jury-transcript/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Trump_Russia_Probe_22884.jpg?w=1024&h=683","video":null,"publish_date":"2025-10-30 23:49:59","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":374259702,"title":"Lawyers for Comey seek grand jury transcript, bringing fresh challenge to a case pushed by Trump","text":"By ERIC TUCKER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — Lawyers for former FBI Director James Comey want to review a transcript and audio recording of grand jury proceedings in his criminal case, citing what they say were “irregularities” in the process that should result in the dismissal of an indictment pushed by President Donald Trump.\n\nThe request is one in a series of challenges that defense lawyers have waged against a criminal case charging Comey with making a false statement to Congress five years ago.\n\nDefense lawyers last week asked for the case to be thrown out before trial on the grounds that it constituted a vindictive prosecution and because they say the hastily appointed U.S. attorney who filed the indictment was illegally appointed to the job.\n\nComey’s lawyers leveled new arguments against that prosecutor, Lindsey Halligan, saying in a filing Thursday that her inexperience had tainted the process, created confusion and raised the prospect that legal and factual errors were presented to the grand jury that returned the indictment.\n\nAs examples, they cite the fact that the indictment was secured after hours with only 14 grand juror votes and that Halligan erroneously signed two separate indictments — including one containing a charge that the grand jury rejected.\n\n“All available information regarding Ms. Halligan’s first-ever grand jury presentation smacks of irregularity,” Comey’s lawyers wrote. “It is virtually unheard of for a brand-new prosecutor to make her first grand jury presentation alone, without the supervision and guidance of an experienced prosecutor to ensure the absence of factual and legal errors.”\n\nTrump had announced his plan to nominate Halligan as U.S. Attorney for the Eastern District of Virginia just one day after the prosecutor who had held the job, Erik Siebert, resigned under Trump administration pressure. In declaring his support for Halligan, Trump complained in a Truth Social post directed to Attorney General Pam Bondi that “nothing is being done” on investigations into some of his foes and called for action, specifically referencing inquiries into Comey, New York Attorney General Letitia James and Democratic Sen. Adam Schiff of California.\n\n“Although such inexperience alone would not ordinarily satisfy the defense’s burden for unsealing grand jury materials, that inexperience must be viewed alongside Ms. Halligan’s likely motive to obtain an indictment to satisfy the President’s demands, the inaccuracies in the indictment, and the determination of every career prosecutor to consider the case that charges were not warranted,” Comey’s lawyers wrote.\n\nIn separate filings Thursday, Comey’s legal team also requested specific details about the conduct at the center of the criminal case, saying the terse indictment is not even clear as to what Comey is alleged to have done wrong. They also asserted that the answers he gave to “fundamentally ambiguous questions” at the Senate hearing at which he is alleged to have lied were “literally true” and that, therefore, the case must be dismissed.\n\nThe indictment accuses Comey of having misled the Senate Judiciary Committee on Sept. 30, 2020, in response to questions from Republican Sen. Ted Cruz about whether Comey had authorized a news media leak. But Comey’s lawyers say the indictment misstates his exchange with Cruz, attributing to Comey statements he did not make.\n\nThe defense team says the indictment omits context from Cruz’s question that made clear he was asking Comey if he had authorized his deputy director, Andrew McCabe, to serve as an anonymous source to the news media. The lawyers say the indictment misleadingly suggests the questioning from Cruz concerned another person, a Columbia University law professor and Comey friend named Daniel Richman. An earlier FBI investigation into whether Comey had disclosed classified information through Richman concluded there was insufficient evidence to charge either man.\n\n“Senator Cruz’s questions are fundamentally ambiguous because people of ordinary intellect would not be expected to understand that he meant to ask a broad question about Mr. Comey’s interactions with anyone at the FBI — including Daniel Richman — during a colloquy focused on Mr. McCabe,” Comey’s lawyers wrote. “On the contrary, a reasonable person readily would have understood Senator Cruz to be asking only whether Mr. Comey had specifically authorized Mr. McCabe to be an anonymous source in news reports.”","summary":"The request is one in a series of challenges in the case.","url":"https://www.sandiegouniontribune.com/2025/10/30/comey-justice-department-grand-jury-transcript/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Trump_Russia_Probe_22884.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-30 23:49:59","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":374262384,"title":"Lawyers for Comey seek grand jury transcript, bringing fresh challenge to a case pushed by Trump","text":"By ERIC TUCKER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — Lawyers for former FBI Director James Comey want to review a transcript and audio recording of grand jury proceedings in his criminal case, citing what they say were “irregularities” in the process that should result in the dismissal of an indictment pushed by President Donald Trump.\n\nThe request is one in a series of challenges that defense lawyers have waged against a criminal case charging Comey with making a false statement to Congress five years ago.\n\nDefense lawyers last week asked for the case to be thrown out before trial on the grounds that it constituted a vindictive prosecution and because they say the hastily appointed U.S. attorney who filed the indictment was illegally appointed to the job.\n\nComey’s lawyers leveled new arguments against that prosecutor, Lindsey Halligan, saying in a filing Thursday that her inexperience had tainted the process, created confusion and raised the prospect that legal and factual errors were presented to the grand jury that returned the indictment.\n\nAs examples, they cite the fact that the indictment was secured after hours with only 14 grand juror votes and that Halligan erroneously signed two separate indictments — including one containing a charge that the grand jury rejected.\n\n“All available information regarding Ms. Halligan’s first-ever grand jury presentation smacks of irregularity,” Comey’s lawyers wrote. “It is virtually unheard of for a brand-new prosecutor to make her first grand jury presentation alone, without the supervision and guidance of an experienced prosecutor to ensure the absence of factual and legal errors.”\n\nTrump had announced his plan to nominate Halligan as U.S. Attorney for the Eastern District of Virginia just one day after the prosecutor who had held the job, Erik Siebert, resigned under Trump administration pressure. In declaring his support for Halligan, Trump complained in a Truth Social post directed to Attorney General Pam Bondi that “nothing is being done” on investigations into some of his foes and called for action, specifically referencing inquiries into Comey, New York Attorney General Letitia James and Democratic Sen. Adam Schiff of California.\n\n“Although such inexperience alone would not ordinarily satisfy the defense’s burden for unsealing grand jury materials, that inexperience must be viewed alongside Ms. Halligan’s likely motive to obtain an indictment to satisfy the President’s demands, the inaccuracies in the indictment, and the determination of every career prosecutor to consider the case that charges were not warranted,” Comey’s lawyers wrote.\n\nIn separate filings Thursday, Comey’s legal team also requested specific details about the conduct at the center of the criminal case, saying the terse indictment is not even clear as to what Comey is alleged to have done wrong. They also asserted that the answers he gave to “fundamentally ambiguous questions” at the Senate hearing at which he is alleged to have lied were “literally true” and that, therefore, the case must be dismissed.\n\nThe indictment accuses Comey of having misled the Senate Judiciary Committee on Sept. 30, 2020, in response to questions from Republican Sen. Ted Cruz about whether Comey had authorized a news media leak. But Comey’s lawyers say the indictment misstates his exchange with Cruz, attributing to Comey statements he did not make.\n\nThe defense team says the indictment omits context from Cruz’s question that made clear he was asking Comey if he had authorized his deputy director, Andrew McCabe, to serve as an anonymous source to the news media. The lawyers say the indictment misleadingly suggests the questioning from Cruz concerned another person, a Columbia University law professor and Comey friend named Daniel Richman. An earlier FBI investigation into whether Comey had disclosed classified information through Richman concluded there was insufficient evidence to charge either man.\n\n“Senator Cruz’s questions are fundamentally ambiguous because people of ordinary intellect would not be expected to understand that he meant to ask a broad question about Mr. Comey’s interactions with anyone at the FBI — including Daniel Richman — during a colloquy focused on Mr. McCabe,” Comey’s lawyers wrote. “On the contrary, a reasonable person readily would have understood Senator Cruz to be asking only whether Mr. Comey had specifically authorized Mr. McCabe to be an anonymous source in news reports.”","summary":"The request is one in a series of challenges in the case.","url":"https://www.twincities.com/2025/10/30/comey-justice-department-grand-jury-transcript/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Trump_Russia_Probe_22884.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-30 23:49:59","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":374270696,"title":"Joni Ernst has novel approach to solving government’s unused buildings problem: Spirit Halloween","text":"“Spirit Halloween’s successful ‘body-snatching’ business model scares up a great idea for reviving the government’s graveyard of lifeless real estate. Let’s sell off these haunted houses to businesses who can breathe new life into them. That trick would be a real treat for the taxpayers,” Ernst said Thursday.\n\nEnrst’s DISPOSAL Act would give the General Services Administration administrator the ability to “sell the Federal building for fair market value at highest and best use” or “enter into a ground lease with a term of up to 99 years.”\n\nThe proposed legislation calls on the administrator to dispose of the Frances Perkins Federal Building, home to the Department of Labor; the James V. Forrestal Building, home to the Department of Energy; the Theodore Roosevelt Federal Building, home to the Office of Personnel Management; the Robert C. Weaver Federal Building, home to the Department of Housing and Urban Development; the Department of Agriculture South Building; and the Hubert H. Humphrey Federal Building, home to the Department of Health and Human Services. \n\n“Despite President Trump calling federal employees back to work, vacant government buildings could easily be mistaken as future locations for Spirit Halloween stores,” Ernst said in a statement. “My DISPOSAL Act immediately lists six prime pieces of D.C. real estate on the auction block and slashes through pointless regulations to fast-track the sale of the government’s graveyard of lifeless real estate to generate hundreds of millions of dollars and save taxpayers billions.”\n\nShe said the underlying goal of the bill is aimed at decreasing the national debt.\n\nIn June, Ernst proposed the sale of each of these buildings with the For Sale Act. That bill currently sits in the Senate Committee on Environment and Public Works.\n\nJONI ERNST ANNOUNCES RETIREMENT, LEAVING IOWA SENATE SEAT OPEN FOR 2026\n\nWhen President Donald Trump first began his second term, he passed two main executive actions related to Washington, D.C., federal buildings. One executive order called for full-time, in-person work for federal agency employees, and the other memorandum called for the beautification of federal buildings.\n\nIn the “Promoting Beautiful Federal Civic Architecture” memorandum, Trump called for the district’s federal buildings to “respect regional, traditional, and classical architectural heritage.” Most of the buildings Ernst calls on to be sold are brutalist-style buildings.","summary":"Sen. Joni Ernst (R-IA) has introduced another piece of legislation on Thursday, attempting to pawn off vacant government buildings to the private sector, giving a spooky-themed Senate floor speech. Ernst introduced the DISPOSAL Act, short for Disposing of Inactive Structures and Properties by Offering for Sale and Lease Act, on Thursday. The proposed bill is [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3870140/joni-ernst-unused-buildings-spirit-halloween/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP25163840180711.jpg?w=696","video":null,"publish_date":"2025-10-30 23:49:05","author":"Molly Parks","authors":["Molly Parks"],"language":"en","category":"politics","source_country":"US","sentiment":0.001},{"id":374261300,"title":"National Guard in each state is ordered to create 'quick reaction forces' trained in civil unrest","text":"Military leaders have ordered the National Guard in every state to develop a “quick reaction force” of troops trained to deal with civil disturbances and riots that can be ready to deploy with just hours' notice, the latest indication of longer-term Trump administration plans to more readily dispatch soldiers to U.S. streets.\n\nA set of memos circulated this month directs Guard units in all 50 states and U.S. territories, except for the District of Columbia, to train a contingent of soldiers in a specialized course that includes the proper use of batons, body shields, stun guns and pepper spray. \n\nSigned by Major Gen. Ronald Burkett, operations director for the National Guard, the memos reviewed by The Associated Press give various numbers for each state's force — often 500 each — that total more than 23,000 troops in all. The memos direct Washington, D.C., to maintain a “specialized” military police battalion with 50 National Guard soldiers on active duty orders.\n\nIt presses forward with President Donald Trump's broader vision for a muscular role for the U.S. military in targeting illegal immigration and crime. He has already pushed traditional boundaries by sending the National Guard into American cities, often over the objection of Democratic local leaders.\n\nThe memos, reported earlier by The Guardian, come after Trump signed an executive order in August that directed the Pentagon to create quick reaction forces that would be “available for rapid nationwide deployment.” The executive order is cited as one of the authorities for the memo, about which the Pentagon did not immediately respond to a request for comment. \n\nThe National Guard has always had troops that were on standby to deploy at a moment's notice, but they traditionally have been used to quickly react to natural disasters and did not receive special training.\n\nThe new, specialized quick reaction forces will be able to deploy a fourth of all their troops within eight hours and all of those assigned to the units within a day, according to the memo.\n\nDuring a roundtable at the White House last week with homeland security officials, Defense Secretary Pete Hegseth was asked about a memo detailing similar plans. Hegseth said he would not comment on the “particulars” but went on to say that there were “multiple layers of National Guard response forces.”\n\n“We’ve got a lot of different ways that, constitutionally and legally, we can employ” Guard troops, and “we will do so when necessary,” Hegseth said.\n\nWhile Trump has sent the National Guard into cities including Los Angeles and D.C., his efforts to deploy troops in other places have faced swift legal challenges. The Trump administration is blocked from sending troops into the Chicago area until at least the latter half of November, following a U.S. Supreme Court order calling on the sides to file additional legal briefs. And a federal trial seeking to block a troop deployment in Portland, Oregon, got underway this week.\n\nThe memos, which were sent out to the states early this month, mandate that each state and territory have its quick reaction forces operational by Jan. 1, 2026. To help with that goal, units will be provided 100 sets of crowd control equipment as well as two full-time trainers by the National Guard Bureau.\n\nThe units also will be allowed to use an additional five days of training for soldiers to get through the “Interservice Nonlethal Individual Weapons Instructor Course.” \n\nAccording to one of the memos, the initial portion of the course includes topics like “crowd management techniques,” “domestic civil disturbance training,” and “proper use of baton and body shields.” The intermediate portion focuses on the use of non-lethal weapons like Tasers and pepper spray.\n\nEach National Guard unit is required to update military leaders monthly on its progress in meeting this new mandate.","summary":"Military leaders have ordered the National Guard in every state to develop a “quick reaction force” of troops trained to deal with civil disturbances and riots that can be ready to deploy with just hours’ notice","url":"https://www.independent.co.uk/news/national-guard-donald-trump-pete-hegseth-military-washington-b2855761.html","image":"https://static.independent.co.uk/2025/10/30/23/National_Guard_Cities_Memphis_96105.jpg?width=1200","video":null,"publish_date":"2025-10-30 23:47:16","author":"Konstantin Toropin","authors":["Konstantin Toropin"],"language":"en","source_country":"gb","sentiment":-0.241},{"id":374268068,"title":"US cuts tariffs on China following Trump-Xi meeting","text":"U.S. President Donald Trump announced new trade measures with China, including scaled-back tariffs, following a meeting with Chinese President Xi Jinping on Thursday.The announcement came amid trade tensions between the countries after China sought more sweeping rare earth material export controls, and President Trump threatened an additional 100% tariff against Chinese goods in response.\"I guess on the scale from zero to 10, with 10 being the best, I would say the meeting was at 12,\" President Trump told reporters.He announced the U.S. will halve fentanyl-related tariffs from 20% to 10% against China while other investigation-related tariffs remain, as it committed to help stem the flow of fentanyl into the U.S., bringing tariffs generally to 45%-47%.\"He's going to work very hard on it. Precursors. And I think you're going to see some real action taken,\" Trump said of his Chinese counterpart.IN CASE YOU MISSED IT | Ontario to pull ad criticizing US tariffs after weekend World Series games\"China and the United States are the two largest economies in the world, and it is critical that we make sure that we don't get into conflict with each other,\" former Deputy Secretary of State Wendy Sherman said in an interview with CNN.Meanwhile, China will suspend restrictions on exports of rare earth minerals. The measure, when announced by the Chinese previously, had initially prompted a strong rebuke from the Trump administration and a threat of an additional 100% tariff on Chinese goods.\"The Chinese saw that. The whole world reacted to this, they overstepped, and so they, they've now said we're not going to do that. We have some rare earth controls from earlier in the year on magnets, where we got to a decent flow, but now we expect them to flow even, even better. We expect there to be more of a Chinese general approach to permissiveness and allowing that rare earth magnet flow. So even that improved,\" United States Trade Representative Amb. Jamison Greer told Scripps News Group.It comes as the U.S. has sought deals with allies on critical minerals, including efforts to increase mining and processing.\"As the leader of a U.S. company manufacturing permanent magnets, we keep hearing that customers want magnets from outside China. The U.S. must go all-in during this one-year period to let supply chains mature outside of China, which can create a transparent, predictable, and reliable global marketplace,\" said Wade Senti, president of Advanced Magnet Lab.President Trump said the leaders also discussed chips, with China expected to speak with Nvidia. Greer said they expect Chinese investigations of U.S. chipmakers \"to go away.\"Additionally, the U.S. will also suspend measures related to investigations against China's maritime and shipbuilding.IN RELATED NEWS | What happens to revenue brought in by Trump's tariffs?China also agreed to agricultural purchases. China will purchase 12 million metric tons of soybeans by January and at least 25 million metric tons annually through 2028, according to a White House official. The amount is a \"floor\" according to USDA Sec. Brooke Rollins, who also noted commitments to buy sorghum, hardwood and the removal of \"unwarranted retaliatory tariffs\" on agricultural products.That will be welcome news for farmers like Chris Cherry who spoke to Scripps News Group earlier in the week.\"We need to have a deal done for us to be where we're profitable,\" Cherry said.While calling the announcement a positive development, the American Soybean Association also noted \"China has historically purchased 25 to 30 million metric tons of U.S. soybeans in recent years, and today's commitments lay a strong foundation to return to those traditional volumes over the coming marketing years.\"Reduced tariffs could bring the prices down on some goods imported from China, but University of Tampa economics professor Abby Hall says consumers will still feel the pinch from previous tariffs.\"While this is a reduction in the tariff rate that's being imposed on China, it's certainly by no means an elimination,\" Hall said.\"So will consumers ultimately notice a big difference at the end of the day? Maybe on some goods, but this is certainly not going to eliminate the economic pain that consumers will feel as a result of the tariffs,\" Hall added.","summary":"U.S. President Donald Trump announced new trade measures with China, including scaled-back tariffs, following a meeting with Chinese President Xi Jinping on Thursday.","url":"https://www.scrippsnews.com/us-news/us-cuts-tariffs-on-china-following-trump-xi-meeting","image":"https://ewscripps.brightspotcdn.com/dims4/default/e4d9d62/2147483647/strip/true/crop/1024x538+0+28/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F37%2Ffa%2F0a1c562c459bbd5a8b5017b10412%2Fap25303190065176.jpg","video":null,"publish_date":"2025-10-30 23:47:01","author":"Haley Bull,Miguel Pineda,Simon Kaufman","authors":["Haley Bull","Miguel Pineda","Simon Kaufman"],"language":"en","category":"politics","source_country":"us","sentiment":0.154},{"id":374271052,"title":"$2000 Direct Deposit Stimulus Checks In November - Fact Or Fake? What IRS Said","text":"Even with the ongoing government shutdown, several Americans are still receiving inflation relief checks and New Jersey’s ANCHOR property tax rebate payments. Others continue to wait for updates on tax refunds, tariff rebates, and other federal or state relief programs in 2025. Rumours of new stimulus checks worth $1,390, $1,702, or $2,000 have spread widely on social media. However, the Internal Revenue Service (IRS) and Congress have not confirmed any new payments. These claims are false and could be part of scams or misinformation campaigns. The IRS has warned people to be cautious about text messages or emails asking for personal or financial information related to refunds or stimulus payments. American Worker Rebate Act Still Pending The only real proposal currently under review is the American Worker Rebate Act of 2025, introduced by Senator Josh Hawley. If approved, it would send $600 to $2,400 to working American families. However, the bill has not yet passed Congress, meaning no payments have been authorized under this plan. Past Stimulus Payments There have been three official federal stimulus checks tied to pandemic relief. The first paid up to $1,200 per individual. The second offered $600 per person. The third, sent in 2021, provided $1,400 per eligible taxpayer. The final deadline to claim the third stimulus payment or the 2021 Recovery Rebate Credit was April 15, 2025. Those who missed the deadline can no longer file or appeal, as unclaimed funds revert to the US Treasury. State-Level Inflation And Rebate Checks Some states continue to send their own relief payments. New York, Pennsylvania, Georgia, and Colorado have issued inflation relief or rebate checks to help residents cope with higher costs. New Jersey is distributing ANCHOR property tax relief checks—up to $1,750 for older homeowners and $450 for renters under 65. Applications for the program remain open until October 31. US President Donald Trump has suggested a new form of relief using revenue from tariffs. He proposed returning some of that money to taxpayers through rebate checks. Trump also mentioned a potential $5,000 “DOGE dividend”, named after Elon Musk’s Department of Government Efficiency (DOGE), but no official details or timeline have been shared. How To Track Refunds Safely Taxpayers can check the status of their federal refund using the IRS’s “Where’s My Refund” tool at irs.gov/refunds. Refund information updates once per day. You’ll need your Social Security number, filing status, and refund amount to log in. Refunds usually arrive within 21 days via direct deposit after your return is accepted. For state refunds, each state has its own online tracking system. For instance, Delaware and other states allow residents to check refund progress through their Department of Taxation websites. Officials warn that scammers may use fake websites or messages pretending to be from the IRS or state agencies. Always verify information through official government sites and never share banking details or personal information with unverified sources. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Despite the government shutdown, some Americans are still receiving inflation and Anchor rebate checks, while others await tax or tariff refunds. The IRS has warned against fake messages and scams about new stimulus checks, clarifying that no new federal stimulus has been approved.","url":"https://www.timesnownews.com/world/us/us-news/2000-direct-deposit-stimulus-checks-in-november-fact-or-fake-what-irs-said-article-153078301","image":"https://images.timesnownews.com/thumb/msid-153078305,thumbsize-750086,width-1280,height-720,resizemode-75/153078305.jpg","video":null,"publish_date":"2025-10-30 23:43:39","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","source_country":"in","sentiment":-0.559},{"id":374261862,"title":"French president to visit Mexico next week: Thursday’s mañanera recapped","text":"The United States’ aggressive maritime pursuit of alleged drug traffickers and an upcoming visit to Mexico by French President Emmanuel Macron were among the issues President Claudia Sheinbaum spoke about at her Thursday morning press conference.\n\nHere is a recap of the president’s Oct. 30 mañanera.\n\nNavy still searching for survivor of US strikes, says Sheinbaum\n\nSheinbaum said that the Mexican Navy was still searching for the sole survivor of U.S. military strikes on four alleged drug boats in the eastern Pacific Ocean. At least one of the strikes — which killed 14 people on Monday — occurred in international waters off Mexico’s southern Pacific coast.\n\nSheinbaum said that she was informed by the navy that it was required to continue the search for at least 96 hours.\n\n“That’s what the international rules say … and that’s what [the navy] is doing, in accordance with international law,” she said.\n\nU.S. Secretary of War Pete Hegseth, who announced Monday’s lethal strikes on social media, said on Wednesday evening that the U.S. military had “carried out a lethal kinetic strike on yet another narco-trafficking vessel operated by a Designated Terrorist Organization (DTO) in the Eastern Pacific.”\n\nEarlier today, at the direction of President Trump, the Department of War carried out a lethal kinetic strike on yet another narco-trafficking vessel operated by a Designated Terrorist Organization (DTO) in the Eastern Pacific.\nThis vessel, like all the others, was known by our… pic.twitter.com/mBOLA5RYQe\n— Secretary of War Pete Hegseth (@SecWar) October 29, 2025\n\nHe said that “four male narco-terrorists were aboard the vessel — and killed — during the strike, which was conducted in international waters.”\n\nHegseth didn’t specify where in the Eastern Pacific the attack occurred.\n\nAsked what information she had about the latest strike, Sheinbaum only said that Navy Minister Raymundo Pedro Morales would meet with a “counterpart” from the U.S. Coast Guard later on Thursday.\n\nOn Wednesday, the president voiced her opposition to the lethal strikes the U.S. military has recently been carrying out in both the Caribbean Sea and the Pacific Ocean.\n\n“We don’t agree with these interventions,” said Sheinbaum, who expressed the view that suspected drug traffickers at sea should be arrested rather than killed.\n\nEbrard represents Mexico at APEC meetings \n\nDonald Trump, Xi Jinping and other world leaders traveled this week to South Korea, where Asia-Pacific Economic Cooperation (APEC) meetings are taking place. Sheinbaum, however, stayed at home, leaving Economy Minister Marcelo Ebrard to represent Mexico on the world stage.\n\nThe president told reporters that Ebrard, a former foreign affairs minister, had held positive meetings with various officials, including U.S. Trade Representative Jamieson Greer.\n\nWith Greer, Sheinbaum noted, Ebrard is “reviewing the 54 famous non-tariff measures.”\n\nConversación con Jamieson Greer ( USTR) en Corea . Seguimos avanzando . pic.twitter.com/pFh2BZ1Ntt\n— Marcelo Ebrard C. (@m_ebrard) October 29, 2025\n\nThe United States has accused Mexico of violating the terms of the USMCA free trade pact through the use of a range of non-tariff barriers to trade.\n\nSheinbaum said that Mexico and the U.S. were nearing the completion of their review of the non-tariff barriers and would soon be able to move onto “what concerns us, which are the [U.S.] tariffs on steel and vehicles.”\n\nIn 2025, the Trump administration has imposed tariffs on a range of imports from Mexico, including steel, aluminum, copper, tomatoes and light vehicles.\n\nThe U.S. government had planned to increase its 25% tariff on non-USMCA compliant Mexican goods this week, but Sheinbaum announced on Monday that she had reached an agreement with Trump to extend bilateral negotiations on trade and tariffs by a few weeks.\n\nAccordingly, the slated increase of the U.S. tariff to 30% didn’t take effect.\n\nEbrard is well-versed in representing Mexico on the world stage, having attended numerous international meetings and summits while foreign minister during the presidency of Andrés Manuel López Obrador, a reluctant international traveler.\n\nIn South Korea, the economy minister also spoke to U.S. Secretary of Commerce Howard Lutnick, and held meetings with officials from countries including Japan, Australia and Indonesia.\n\nEmmanuel Macron to visit Mexico next week \n\nSheinbaum revealed that Macron would visit Mexico on Friday, Nov. 7.\n\n“Do you remember he was going to come [earlier in the year]? He’s coming on the 7th,” she said.\n\nSheinbaum said that her government’s priority in its upcoming talks with the French president would be to push for the repatriation of pre-Hispanic codices that are in France.\n\n“We want them to come back to Mexico, that’s our main interest,” she said.\n\nSheinbaum added that Macron would “obviously” be accompanied by French businesspeople and would meet with Mexican businesspeople.\n\n“But our greatest interest is the repatriation of these codices that are very important for Mexico,” she said.\n\nAsked whether she and Macron would hold a joint press conference, Sheinbaum said she assumed they would.\n\n“The schedule is being agreed upon; the visit will be very brief,” she said.","summary":"The United States' aggressive maritime pursuit of alleged drug traffickers and an upcoming visit to Mexico by French President Emmanuel Macron were among the issues Sheinbaum spoke about at her Thursday morning press conference.\n\n\nThe post French president to visit Mexico next week: Thursday&#8217;s mañanera recapped appeared first on Mexico News Daily","url":"https://mexiconewsdaily.com/politics/french-president-visit-mexico-thursdays-mananera-recapped/","image":"https://mexiconewsdaily.com/wp-content/uploads/2025/10/1054531_Conferencia-del-Pueblo-Jueves_impreso.jpg","video":null,"publish_date":"2025-10-30 23:42:16","author":"MND Staff","authors":["MND Staff"],"language":"en","category":"politics","source_country":"mx","sentiment":0.145},{"id":374261118,"title":"Trump reverses ‘asinine’ US nuclear-weapons policy — and it’s about time","text":"Donald Trump has trampled on another taboo, and it’s a good thing. \n\nThe president said in a Truth Social post that the United States will begin “immediately” testing our “Nuclear Weapons” on “an equal basis” with Russia and China.\n\nIt’s not clear what this means exactly; Trump could be referring to the delivery systems that carry nuclear weapons, or the weapons themselves. \n\nIf it is the latter, as most news accounts assume, it will represent an advance for the US nuclear deterrent and a victory of common sense over superstition.\n\nThe United States conducted more than a thousand explosive nuclear tests during the Cold War, but gave up the practice in 1992.\n\nSince then, it’s come to be considered a moral imperative that we don’t test — for no good reason. \n\nObviously, we aren’t going to conduct atmospheric tests again, but beginning in the 1960s we carried out explosive tests deep underground, mostly at the Nevada Test Site.\n\nAssuming that tests are safely controlled and contained, there is no good argument for not conducting them as warranted. \n\nThere is nothing immoral about testing, and testing doesn’t necessarily lead to use.\n\nIf it did, we wouldn’t have conducted hundreds of tests and only dropped the atomic bomb twice at the very outset of the nuclear age. \n\nWe have an extensive, sophisticated program to continually kick the tires of our nukes through the Stockpile Stewardship Program.\n\nIt uses computer simulations and the like to establish that everything is in working order.\n\nBut there is no substitute for explosive tests to ensure that the simulations aren’t missing anything, especially as our arsenal has changed over the last 30 years. \n\nWe should have 100% certainty about the safety, security and reliability of our nuclear arsenal, upon which so much of our national security depends. \n\nThe argument that testing will raise international tensions doesn’t make much sense.\n\nWhat is Russia going to do if we conduct a nuclear test? \n\nInvade Ukraine?\n\nCertainly, India, Pakistan and North Korea haven’t been dissuaded from having active nuclear programs.\n\n“Please, start to like us — and don’t develop your own nuclear weapons — because we don’t do nuclear tests” isn’t a compelling argument for any of our adversaries overseas.\n\nChina and Russia may already be conducting their own nuclear tests.\n\nIn recent years, reports from both the State and Defense Departments have said that Russia has violated the so-called zero-yield standard that it is supposed to be honoring by conducting supercritical nuclear tests.\n\n(Since Russia routinely cheats on all its commitments, this is not a surprise.)\n\nMore to the point, both Russia and China have been developing new warheads and delivery vehicles.\n\nSo they acquired new weapons while we were testing, and now have been acquiring new weapons while we haven’t been testing.\n\nThe consistent thread is acquiring systems to project their power and threaten us.\n\nThese are countries that will do whatever they consider in their interest, regardless of how much we might like to think the moral example of our testing moratorium is affecting their behavior. \n\nNow, there’s no doubt that getting our capacity to conduct an explosive test back up and running will take time, even if Trump and his team remain committed.\n\nThe president might finish the new White House ballroom before he carries out a test, and Nevada is not going to be happy with being the site of underground explosions again. \n\nTrump, though, is acknowledging an important reality.\n\nWe have nuclear weapons and they are a central part of our defense and, by extension, that of many of our allies.\n\nTo not test them — prudently and safely — is an asinine left-over from the immediate aftermath of the Cold War that doesn’t serve our interests or make the world safer. \n\nX: @RichLowry","summary":"Donald Trump recognizes an important reality: There is nothing immoral about testing US nuclear weapons, and not testing them doesn't make the world safer.","url":"https://nypost.com/2025/10/30/opinion/trump-reverses-asinine-us-nuclear-weapons-policy-and-its-about-time/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/JEODRODE.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-30 23:39:52","author":"Rich Lowry","authors":["Rich Lowry"],"language":"en","category":"politics","source_country":"us","sentiment":0.006},{"id":374263490,"title":"South suburban food pantry draws hundreds as SNAP cutoff looms","text":"Jason Webb receives roughly $300 each month in Supplemental Nutrition Assistance Program benefits that he splits between his family and his elderly mother living by herself.\n\nThe aid supplements his income from a part-time restaurant job that he uses to help put food on his family’s tables, Webb said.\n\nThe 40-year-old man was among about 600 people who arrived at the Rich Township Food Pantry Thursday afternoon for its twice-weekly distribution. The crowd was larger because SNAP recipients are set to lose their benefits in November during the current federal government shutdown, local officials said.\n\n“I have no plans,” said Webb, about getting more assistance, as he shook his head. “I’m still thinking about it.”\n\nRich Township Food Pantry usually serves 80 to 100 people every distribution day, said Riette Woods, the pantry coordinator.\n\nOn Thursday, Woods said staff and volunteers prepared extra food bags because of the increased demand for food. \n\nShe added that the Richton Park pantry also is looking to open more days of the week.\n\nInside the pantry, paper and blue cloth bags filled with groceries to the brim lined tables and shelves, alongside milk cartons, meat, eggs and baked goods.\n\nSeveral shopping carts were full of other bags containing vegetables and fruit. Staff and volunteers zipped between cars to put the bags into trunks and back seats.\n\nJane Donovan, 71, of Richton Park, said she depends on SNAP benefits to feed her family, even though her $80 in benefits is a drop in the bucket. She said she already visits three to four food pantries each month to fill the gap but is now looking for more places to get help.\n\nRich Township Supervisor Calvin Jordan said Thursday’s distribution will serve as an assessment of the need for food in the community. He said he already is coordinating with other municipal and community leaders to fill the gap if SNAP goes away.\n\n“You gotta feed people, that’s serious,” Jordan said. “If you look here, you see people, they drive, they get here early, they spend money on gas. We got to be able to help.”\n\nCook County Commissioner Kisha McCaskill, who joined Jordan at the pantry, said she and other commissioners are making food security a top priority and working to identify areas of need across the county, though “funds will be as tight as food.”\n\n“We need to be very realistic about it, because some of these people don’t know where their next meal is going to come from,” McCaskill said. “We need all our leadership, our clergy, our school districts to get in sync and make sure that no one goes home hungry.”\n\nThe food distribution event comes as the spar over SNAP funding continues. Congress appears unlikely to reach a legislative solution before Saturday, while the Trump administration is locked in a legal battle with a coalition of Democratic-led states over the use of contingency funding to pay for SNAP during the shutdown.\n\nMcCaskill on Thursday called on President Donald Trump and lawmakers in Washington for a quick resolution of the impending crisis.\n\n“We appeal to the president because we know that it’s a matter of his authority to say yes or no,” McCaskill said. “We can make all the noise we want, but until we come together in a concerted effort and put things forward, nothing is going to change.”","url":"https://chicago.suntimes.com/news/2025/10/30/south-suburban-food-pantry-draws-hundreds-as-snap-cutoff-looms","image":"https://cst.brightspotcdn.com/dims4/default/91dced9/2147483647/strip/false/crop/5124x3416+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa1%2F35%2Fd6fda576423abd6d09e1b4fde1bd%2Fricht","video":null,"publish_date":"2025-10-30 23:37:56","author":"Casey He","authors":["Casey He"],"language":"en","source_country":"us","sentiment":0.236},{"id":374261348,"title":"Stanley Woodward Supports Todd Blanche in High-Stakes Legal Battle Against Abrego Garcia","text":"In a significant legal development, a recently appointed associate attorney general from the Department of Justice has thrown their support behind Todd Blanche. This comes amid efforts to counter Kilmar Abrego Garcia’s push to compel a former Mar-a-Lago defense lawyer, now a deputy attorney general, to testify under oath. This testimony is being sought through a subpoena ahead of an evidentiary hearing on alleged vindictive prosecution set for next week.\n\nStanley Woodward, Jr., a prominent lawyer known for representing former President Donald Trump’s co-defendant, Walt Nauta, and FBI Director Kash Patel in separate cases, has taken the lead in this legal battle. On Thursday, Woodward submitted court documents cautioning U.S. District Judge Waverly Crenshaw. He warned that the DOJ is prepared to seek “extraordinary” mandamus relief from the 6th Circuit U.S. Court of Appeals should the judge decide against quashing the subpoenas.\n\nThis legal maneuver is detailed in a five-page filing where Woodward stands as the primary signatory. Addressing Judge Crenshaw, an appointee of former President Barack Obama, the document argues against allowing Garcia, a defendant in a smuggling case, to bypass the Trump administration’s claims of executive privilege. The filing warns that compelling testimony from figures like Blanche, Associate Deputy Attorney General Aakash Singh, and Blanche’s advisor, James McHenry, could lead the DOJ to seek a writ of mandamus.\n\nThis writ of mandamus is the same legal tool the DOJ previously used to contest a federal judge’s directive requiring a border patrol chief to provide daily updates on force usage in Illinois. It would assert that such a decision by Crenshaw constitutes a “judicial usurpation” or a “clear abuse of discretion.”\n\nThe filing states, “It is no answer to say, as Defendant does, that the subpoenas are justified because the Court has concluded that he has shown some evidence of vindictiveness.” It emphasizes that the defendant has not met other critical safeguards necessary for the separation of powers, such as specifically detailing the information sought by the subpoena.\n\nWoodward further argues, “And, in any event, there is no basis for piercing the privileges here, where the evidence establishes that neither the Deputy Attorney General nor anyone in his Office directed” acting U.S. Attorney Robert McGuire’s decision to proceed with the indictment.\n\nCiting the “apex doctrine” to guard against a grilling of Blanche based on his high-ranking status, the DOJ warned that federal courts “have zealously applied this rule to protect the separation of powers, including through the extraordinary writ of mandamus.”\n\n“This case calls for the same result,” Woodward added. “The Deputy Attorney General—the Department’s Number 2—is plainly a high-ranking official protected by the apex doctrine.”\n\nRepeating arguments that Abrego Garcia hasn’t come close to justifying this level of intrusion into the inner workings of the DOJ, Woodward said that if Crenshaw does not quash the subpoenas, the judge should “stay enforcement” so it could seek mandamus relief that would, if granted, put an end to the issue.\n\nAs recently as Wednesday, Abrego Garcia’s lawyers needled the high-ranking DOJ officials for being “resolutely unwilling to show up” and not having the “courage to come to Court to defend themselves” and the government’s “motivations” for bringing a criminal case the defense seeks to dismiss.\n\n“[T]he government’s bizarre claim that it is ‘unknown altogether’ what testimony Mr. Blanche might be asked to give is impossible to take seriously,” the filing said. “Mr. Blanche publicly claimed to know all about the motivations for this case. This Court has held that those motivations are a central issue at the upcoming hearing, and has already made clear that Mr. Blanche’s testimony is relevant.”\n\nThen, on Thursday, the defense suggested that Crenshaw should see the DOJ as stonewalling, find that the “presumption” of vindictiveness “stands” and toss out the indictment, perhaps without bothering to hold a hearing on Nov. 4.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: Stanley Woodward, Jr. speaks during nomination hearing in May 2025 (Sen.&#8230;\n\n\nThis Post: Stanley Woodward Supports Todd Blanche in High-Stakes Legal Battle Against Abrego Garcia first appeared on Internewscast Journal","url":"https://internewscast.com/crime/stanley-woodward-supports-todd-blanche-in-high-stakes-legal-battle-against-abrego-garcia/","image":"https://internewscast.com/wp-content/uploads/2025/10/Stanley-Woodward-backs-Todd-Blanche-against-Abrego-Garcia.jpg","video":null,"publish_date":"2025-10-30 23:36:31","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.407},{"id":374260396,"title":"Jimmy Kimmel slams Trump over 'very painful' state of the country: 'Not even allowed to take Tylenol for it'","text":"Jimmy Kimmel's got the jokes.\n\n The late-night host poked fun at everything from Donald Trump to his own eponymous show getting suspended while hosting Selena Gomez’s 3rd annual Rare Impact Fund Benefit on Wednesday.\n\n In a video from the event shared by TMZ, Kimmel began his remarks by thanking Gomez, of whom he said, \"Everyone says you are the best, the nicest, the kindest, the most generous and all that stuff, and I have to say I believe it.\"\n\n He continued, \"I'm excited to be here,\" before joking, \"Honestly after the month I've had, I'm excited to be anywhere. I was this close to starting an OnlyFans.\" Last month, ABC pulled Kimmel's late-night show from the air for six days following pressure from the Trump administration, and after affiliate groups Nexstar and Sinclair preempted the show, following a remark the host made about the suspect identified in the Sept. 10 shooting of Charlie Kirk. (Kimmel's return to air on Sept. 23 marked the highest viewership the show had seen in a decade.)\n\n At the fundraiser, which supported Gomez's mental health nonprofit, Kimmel then turned his sights on the current administration, joking, \"We have a very special event for you tonight filled with moving stories from amazing organizations that our president wants to defund.\"\n\n He added, \"This work the Rare Impact Fund does is needed now more than ever. It's very painful to see what's happening in our country right now, and we're not even allowed to take Tylenol for it.\" (Since Trump and Health and Human Services Secretary Robert F. Kennedy Jr. controversially claimed at a Sept. 22 press conference that autism is caused by prenatal exposure to Tylenol, Kimmel has made several jokes about the medication on his show.)\n\n On a more serious note, Kimmel went on to praise Gomez's foundation for \"the progress this organization has made in mental health care.\"\n\n The TV star concluded his speech by noting the night was aiming to raise $100 million for mental health resources, and making a sweet joke at the expense of Gomez and her new husband, Benny Blanco, who tied the knot Sept. 27. \"By the way, if you forgot to get Selena and Benny a wedding gift, great way to make up for it,\" he suggested while calling for donations.\n\n Get your daily dose of entertainment news, celebrity updates, and what to watch with our EW Dispatch newsletter.","summary":"The late-night host made the jokes while hosting Selena Gomez’s 3rd annual Rare Impact Fund Benefit on Wednesday.","url":"https://ew.com/jimmy-kimmel-slams-trump-over-very-painful-state-of-country-11840861","image":"https://ew.com/thmb/4DKdUDIJtkVgN-j0-vcO9xmUKk4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Selena-Gomez-and-Jimmy-Kimmel-103025-16ff164d8fb340fa8aae8a410ec48659.jpg","video":null,"publish_date":"2025-10-30 23:36:14","author":"Lauren Huff","authors":["Lauren Huff"],"language":"en","category":"politics","source_country":"US","sentiment":0.179},{"id":374268888,"title":"Trump administration sets rules to bar groups it opposes from loan relief","text":"The United States Department of Education has finalised new rules that could bar nonprofits deemed to have undertaken work with a “substantial illegal purpose” from a special student loan forgiveness programme.\n\nThose rules, finalised on Thursday, appear to single out certain organisations that do work in areas that President Donald Trump politically opposes, including immigration advocacy and transgender rights.\n\nUnder the new rules, set to take effect in July 2026, the education secretary has the power to exclude groups if they engage in activities like the “chemical castration” of children, using a politically charged term for gender-affirming healthcare, including puberty-delaying medication.\n\nIt also allows the education secretary to bar groups accused of supporting undocumented immigration or “terrorist” organisations.\n\nThe Trump administration has said its decisions “will not be made based on the political views or policy preferences of the organization”.\n\nBut advocates fear the move is the administration’s latest effort to target left-leaning and liberal organisations.\n\nTrump has already threatened to crack down on several liberal nonprofits, which the White House has broadly accused of being part of “domestic terror networks”.\n\nThursday’s rules concern the Public Service Loan Forgiveness programme, created by an act of Congress in 2007.\n\nIn an effort to direct more graduates into public service jobs, the programme promises to cancel federal student loans for government employees and many nonprofit workers after they have made 10 years of payments.\n\nWorkers in the public sector, including teachers, medical professionals, firefighters, social service professionals and lawyers, are among those who can benefit.\n\nIn a statement, the Trump administration defended the updated rules, calling them a necessary bulwark to protect taxpayer funds.\n\nThe programme “was meant to support Americans who dedicate their careers to public service – not to subsidize organizations that violate the law, whether by harboring illegal immigrants or performing prohibited medical procedures that attempt to transition children away from their biological sex”, said Education Undersecretary Nicholas Kent.\n\nCritics, however, have denounced the administration for using false claims of “terrorism” or criminal behaviour to silence opposing views and restrict civil liberties.\n\nMichael Lukens, executive director of the Amica Center for Immigrant Rights, said the new rules weaponised loan forgiveness.\n\nLukens explained that many of the lawyers, social workers and paralegals who work at his organisation handle cases to stop deportations and other immigration litigation.\n\nThey count on public service loan forgiveness to take jobs that pay significantly less than the private sector, he said.\n\n“All of a sudden, that’s going away,” Lukens told The Associated Press news agency. “The younger generation, I hope, will be able to wait this out for the next couple of years to see if it gets better, but if it doesn’t, we’re going to see a lot of people leave the field to go and work in a for-profit space.”\n\nOrganisations have raised concerns over the education secretary’s broad power to determine if a group should be barred. Short of a legal finding, the secretary can decide based on a “preponderance of the evidence” whether an employer is in violation.\n\nThe National Council of Nonprofits was among the associations criticising the change.\n\nIt said the rules would allow future administrations from any political party to change eligibility rules “based on their own priorities or ideology”.","summary":"Advocates say new rules let Education Department to politically punish groups working on immigration, transgender care.","url":"https://www.aljazeera.com/news/2025/10/30/trump-administration-sets-rules-to-bar-groups-it-opposes-from-loan-relief?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/10/reuters_6903e2dc-1761862364.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-10-30 23:36:04","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.305},{"id":374257780,"title":"Who is Chauncey Billups' lawyer Marc Mukasey? Trail Blazers coach attorney's surprising connection with another NBA controversy explored","text":"Portland Trail Blazers coach Chauncey Billups has reportedly hired a well-known trial lawyer to aid in his defense amid the federal charges involving illegal gambling.According to The Athletic's Sam Amick on Thursday, Billups hired Marc Mukasey to replace Chris Heywood as his attorney. Heywood handled Billups' arraignment last week.Mukasey has previously represented several notable personalities, including U.S. President Donald Trump, Navy SEAL Edward Gallagher and FTX founder Sam Bankman-Fried.Mukasey has also represented Aspiration co-founder Joe Sanberg, who is part of another ongoing league investigation involving the LA Clippers. Sanberg previously pleaded guilty to two counts of wire fraud amounting to $248 million.The Clippers are facing allegations of salary cap circumvention. Sanberg's now-bankrupt company allegedly paid star forward Kawhi Leonard close to $48 million for a \"no-show\" marketing deal. NBA insider Pablo Torre, who broke the news on Leonard's deal, said Thursday that Billups' hiring Sanberg's lawyer is \"another surreal example of the streams of the Aspiration and NBA poker/betting scandal crossing.\"Chauncey Billups will now be represented by Mukasey on his arraignment, which is tentatively set on Nov. 24 in the Eastern District of New York. The 49-year-old coach was indicted for his alleged connection with rigged poker games that are linked to organized crime.Chauncey Billups' former coach offers supportChauncey Billups' former coach with the Detroit Pistons, Larry Brown, has reportedly reached out to Billups since his arrest on Oct. 23.In an article on Thursday, ESPN's Ramona Shelburne said that Brown has texted Billups every day to let his former player know that \"he cared and was thinking about him.\" Just like Billups' several other colleagues, Brown has struggled to grapple with the issues that his former player is facing.\"He would be one of the last people I would think about involving himself with bad people,\" Brown said. \"If you talked to anybody that was involved with Chauncey, that spent time with him and knew his family, knew his kids, I think they'd be saying the same thing.\"Brown and Billups led the Pistons to an NBA championship in 2004. They defeated the heavily-favored LA Lakers in five games in what was regarded as one of the greatest upsets in NBA Finals history.","summary":"Portland Trail Blazers coach Chauncey Billups has reportedly hired a well-known trial lawyer to aid in his defense amid the federal charges involving illegal gambling.","url":"https://www.sportskeeda.com/basketball/news-who-chauncey-billups-lawyer-marc-mukasey-trail-blazers-coach-attorney-s-surprising-connection-another-nba-controversy-explored","image":"https://staticg.sportskeeda.com/editor/2025/10/cc551-17618633102061-1920.jpg","video":null,"publish_date":"2025-10-30 23:35:29","author":"Kim Daniel Rubinos","authors":["Kim Daniel Rubinos"],"language":"en","source_country":"in","sentiment":-0.375},{"id":374267980,"title":"Gayle King Done at 'CBS Mornings': Longtime Anchor 'to Depart Show' After Months of 'Woke' Backlash and $15Million Yearly Salary","text":"Gayle King is reportedly losing her 14-year reign lording over CBS Mornings as the lead host when her contract expires in May 2026, RadarOnline.com can reveal. \n\nThe wrath of the new CBS News boss, Bari Weiss, has seemingly hit ultra-liberal King, 70, as she is trying to steer the division away from its current \"woke\" status.A 'Valued' Part of CBSFour sources with knowledge of the situation told Variety the network hopes King will still call CBS home through a deal to produce her own programming, but that her days anchoring the morning show are coming to a close.\n\nThe Tiffany network said in a statement, \"There have been no discussions with Gayle about her contract that runs through May 2026. She’s a truly valued part of CBS, and we look forward to engaging with her about the future.\"\n\nKing reportedly makes a whopping $15 million per year with the network for her morning show gig.Close With DemocratsKing's left-leaning stances are well known. She gushed over Democratic presidential candidate Kamala Harris in August 2024, when the vice president was running against Republican Donald Trump, who went on to win a second term. \n\n\"When I hear people say I will vote for Kamala Harris because she is a Black woman, she is so much more than that. She’s so uniquely qualified to be president of this country,\" King raved.\n\nOprah Winfrey's BFF is also close with the Barack and Michelle Obama, going on a yacht vacation in Tahiti with the former first couple in 2017.Space ControversyEven before Weiss' arrival earlier this month, King put herself in the crosshairs with her controversial trip aboard Jeff Bezos' all-female Blue Origin flight to the edge of Earth's atmosphere in April, where she was joined by celebrity pals including Katy Perry and Lauren Sánchez Bezos.\n\nKing went on to complain loudly about how she felt her accomplishment wasn't taken seriously enough.\n\n\"This was not a ride. What happened to us, this was a bona fide freakin' flight,\" she moaned after getting hit by backlash and bad publicity.\n\n\"You never see a man, a male astronaut, who's going up in space, and they say, 'Oh, he took a ride,'\" King huffed while describing her experience as \"peaceful.\"New BossWeiss, 41, was brought in by David Ellison, the new Chairman and CEO of Paramount, to bring the network's news division back into more moderate territory after the Trump supporter felt it turned too \"woke.\"\n\n\"We believe the majority of the country longs for news that is balanced and fact-based, and we want CBS to be their home,\" Ellison stated in her October 6 hiring announcement. \n\nHe went on to call The Free Press founder and former New York Times opinion writer a \"proven champion of independent, principled journalism.\"Big Changes AlreadyAlready, there have been major changes under Weiss's short but decisive reign. \n\nCBS Evening News co-anchor John Dickerson announced on Monday, October 27, that he would be departing the network at the end of the year. \n\n\"Let’s be clear — he didn’t quit, he was pushed,\" one senior network source spilled to Hollywood insider Rob Shuter, who wrote about it on Substack. \"Bari is making it impossible for the old guard to stay. She’s cleaning house — aggressively.\"\n\n60 Minutes could see sweeping changes, as Weiss already has her eye on the news magazine show.\n\nShe reportedly called a staff meeting on October 14 and asked, \"Why does the country think you’re biased?\" leaving them in shocked silence.","summary":"Gayle King is losing her coveted anchor seat at 'CBS Mornings,' amid sweeping changes to make the network less liberal-leaning and 'woke.'","url":"https://radaronline.com/p/gayle-king-exit-cbs-mornings-anchor-leaving-show/","image":"https://media.radaronline.com/brand-img/d-icFGo23/0x0/gayle-king-cbs-mornings-exit-1761867124950.jpg","video":null,"publish_date":"2025-10-30 23:32:46","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":-0.129}]}