{"offset":0,"number":50,"available":10947,"news":[{"id":346774788,"title":"Trump Announces Trade Deal With South Korea At 15% Tariff Rate Ahead Of August 1 Deadline","text":"(Reuters) -The United States has agreed a trade deal with South Korea that will subject South Korean imports to a 15% tariff rate, President Donald Trump said on Wednesday.\nSouth Korea will also invest $350 billion in the United States and purchase $100 billion in U.S. energy products, Trump said on Truth Social.\n”It is also agreed that South Korea will be completely OPEN TO TRADE with the United States, and that they will accept American product including Cars and Trucks, Agriculture, etc,” Trump added.","summary":"The United States has agreed a trade deal with South Korea that will subject South Korean imports to a 15% tariff rate, President Donald Trump said on Wednesday.","url":"https://www.news18.com/world/trump-announces-trade-deal-with-south-korea-at-15-tariff-rate-ahead-of-august-1-deadline-9474589.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/trump-2025-07-7b8a7dc40be1ee76b38040fb20b196a4.png","video":null,"publish_date":"2025-07-31 01:39:06","author":"Mahima Joshi,News18","authors":["Mahima Joshi","News18"],"language":"en","source_country":"in","sentiment":-0.146},{"id":346774380,"title":"How Trump's tariffs are already impacting Americans","text":"Some countries have responded to Trump's trade war by seeking to deepen trade ties with other countries, rather than by putting up their own barriers.\n\nThe UK and India have signed a trade deal that they were negotiating for three years.\n\nNorway, Iceland, Switzerland and Liechtenstein - who are in a grouping called the European Free Trade Association (EFTA) - have concluded a new trade deal with a number of Latin American countries in a grouping known as Mercosur.\n\nThe EU is pushing ahead with a new trade deal with Indonesia.\n\nCanada is exploring a free trade agreement with ASEAN.\n\nSome countries have also taken advantage of the fracturing of trade between the US and China.\n\nChina has traditionally been a significant global importer of soybeans from the US, which it uses as fodder for its 440 million pigs.\n\nBut in recent years Beijing has been increasingly shifting towards buying its soybeans from Brazil, rather than America, a trend analysts argue has accelerated as a result of Donald Trump's latest trade war and Beijing's new retaliatory tariffs on US agricultural imports.","url":"https://www.bbc.com/news/articles/cr5rm7v5166o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/3eb1/live/a5957e90-6d29-11f0-af20-030418be2ca5.jpg","video":null,"publish_date":"2025-07-31 01:38:39","author":"Ben Chu, Daniel Wainwright & Phil Leake","authors":["Ben Chu, Daniel Wainwright & Phil Leake"],"language":"en","source_country":"gb","sentiment":0.302},{"id":346775134,"title":"Clock Ticks On US Tariff Hikes As Trump Broadens Blitz","text":"Time is running short for governments to strike deals with Washington to avert tariff hikes that Donald Trump has vowed against dozens of economies -- and the US president continues to expand his trade wars.As the clock ticked down on a Friday deadline for higher levies to take effect on goods from various trading partners, Trump announced a trade deal with South Korea and separate duties on Brazilian and Indian imports.He also signed an order Wednesday to impose previously-threatened 50 percent tariffs on certain copper products and end a tariff exemption for low-value shipments from abroad.The tariff hikes due Friday were initially announced in April as part of a package where Trump slapped a 10 percent levy on goods from almost all trading partners -- citing unfair trade practices.This rate was set to rise to varying levels for dozens of economies like the European Union, Japan and others, but Washington twice postponed their implementation as financial markets gyrated.So far, Britain, Vietnam, Japan, Indonesia, the Philippines, the EU and South Korea have reached initial deals with Washington to secure less punishing conditions.While the United States and China earlier slapped escalating tariffs on each other's products, both sides are working to further a truce maintaining duties at lower levels.But Trump has been pushing ahead in his efforts to reshape global trade. The US leader insisted Wednesday that the August 1 deadline \"will not be extended\" any further.In a Truth Social post, he vowed that this would be \"a big day for America.\"Although Trump has promised a surge in government revenues from his duties, economists warn that higher tariffs can fuel an uptick in inflation and weigh on economic growth. This could change consumption patterns.Already, consumers face an overall average effective tariff rate that is the highest since the 1930s, according to a recent analysis by The Budget Lab at Yale University.The effect on consumer prices has been limited so far. But analysts cautioned this could become more pronounced as businesses run down on existing inventory and pass on more costs to buyers.Among Trump's latest announcements were a 25 percent duty on Indian goods to begin Friday -- slightly lower than previously threatened -- after talks between Washington and New Delhi failed to bring about a trade pact.India would face an unspecified \"penalty\" over purchases of Russian weapons and energy as well, Trump said.He also unveiled a 50 percent tariff on Brazilian goods, saying its government's policies and actions threaten US national security.But he delayed its implementation from Friday to August 6 and crucially exempted many products from the prohibitive levy, including orange juice, civil aircraft, iron ore and some energy products.Trump inked an order too for a 50 percent tariff to kick in Friday on goods like copper pipes and wiring, making good on an earlier vow to impose these duties.But the levy, which came after a Commerce Department probe on national security grounds, was less sweeping than anticipated.It left out products like copper ores, concentrates and cathodes, bringing some relief to industry.Meanwhile, Seoul landed a deal with Trump in which South Korean products would face a 15 percent tariff when entering the United States -- significantly below a 25 percent level threatened.","summary":"Time is running short for governments to strike deals with Washington to avert tariff hikes that Donald Trump has vowed against dozens of economies -- and the US president continues to expand his trade wars.","url":"https://www.ibtimes.com/clock-ticks-us-tariff-hikes-trump-broadens-blitz-3779874","image":"https://d.ibtimes.com/en/full/4613781/days-before-higher-levies-took-effect-dozens-economies-us-president-donald-trump-signed-orders.jpg?w=1600&h=900&q=88&f=bb268906a4ec5e451a7003c9de1de323","video":null,"publish_date":"2025-07-31 01:36:10","author":"Beiyi Seow","authors":["Beiyi Seow"],"language":"en","category":"politics","source_country":"US","sentiment":0.019},{"id":346773894,"title":"'Maybe They'll Sell Oil To India': Trump Announces Trade Deal, Oil Partnership With Pakistan","text":"Just hours after imposing a 25% tariff and additional penalties on Indian imports, US President Donald Trump announced a new trade agreement with Pakistan. The deal includes a joint effort to explore and develop Pakistan’s oil reserves, a move Trump described as a potential future source of oil for India.\nIn a post on his social media platform, Truth Social, Trump revealed that Washington and Islamabad are in the early stages of selecting an energy company to spearhead the initiative.\n“We have just concluded a Deal with the Country of Pakistan, whereby Pakistan and the United States will work together on developing their massive Oil Reserves. We are in the process of choosing the Oil Company that will lead this Partnership. Who knows, maybe they’ll be selling Oil to India someday!” he wrote.\nThe announcement came soon after Trump introduced a steep 25% tariff on Indian goods, along with additional penalties. He cited the US trade deficit with India and New Delhi’s ongoing oil purchases from Russia as justification for the move.\nTrump’s post also provided a broader view of the administration’s trade policy direction. He said the White House was actively engaging with global leaders to finalise multiple trade agreements.\n“We are very busy in the White House today working on Trade Deals. I have spoken to the Leaders of many Countries, all of whom want to make the United States ‘extremely happy,’” Trump noted.\nThe post also revealed that the President was scheduled to meet with a trade delegation from South Korea. Trump pointed out that Seoul is currently subject to a 25% tariff but may be preparing to negotiate those terms.\n“South Korea is right now at a 25% Tariff, but they have an offer to buy down those Tariffs. I will be interested in hearing what that offer is,” he added.\nHe concluded the post by suggesting that more countries are coming forward with proposals for tariff reductions, aimed at narrowing the US trade deficit.\n“Likewise, other Countries are making offers for a Tariff reduction. All of this will help reduce our Trade Deficit in a very major way. A full report will be released at the appropriate time. Thank you for your attention to this matter. MAKE AMERICA GREAT AGAIN!”","summary":"In a post on his Truth Social, Trump revealed that Washington and Islamabad are in the early stages of selecting an energy company to spearhead the initiative.","url":"https://www.news18.com/world/maybe-theyll-sell-oil-to-india-trump-announces-trade-deal-oil-partnership-with-pakistan-9474581.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/donald-trump-1-2025-07-776fb082bc2deb8e3cff10fd5d60d11a.jpg","video":null,"publish_date":"2025-07-31 01:32:11","author":"Abhro Banerjee,News18","authors":["Abhro Banerjee","News18"],"language":"en","source_country":"in","sentiment":0.202},{"id":346773714,"title":"Trump tandatangani perintah kenakan tarif Brazil sehingga 50 peratus","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, menandatangani satu perintah eksekutif baharu yang mengenakan tarif 50 peratus ke atas eksport Brazil, sambil memberikan pengecualian terhadap produk-produk tertentu.\n\nRumah Putih menyatakan bahawa keputusan itu dibuat bagi menangani \"dasar, amalan dan tindakan terkini oleh Kerajaan Brazil yang membentuk ancaman luar biasa dan luar kebiasaan terhadap keselamatan negara, dasar luar dan ekonomi AS.\n\nLangkah ini diambil di tengah-tengah perbicaraan bekas presiden Brazil, Jair Bolsonaro, sekutu rapat Trump, yang kini berdepan pertuduhan cuba merancang satu rampasan kuasa.\n\nPerintah Trump itu menggambarkan prosiding undang-undang terhadap Bolsonaro sebagai satu bentuk penganiayaan politik, dengan mendakwa bahawa beliau telah \"didakwa secara tidak adil\" atas beberapa kesalahan.\n\nWalaupun kadar tarif yang dikenakan sangat tinggi, perintah berkenaan memberikan pengecualian bagi pesawat awam dan komponennya – yang dijangka memberi manfaat kepada syarikat aeroangkasa Brazil, Embraer – serta barangan seperti pulpa kayu, logam berharga, produk tenaga, baja dan jus oren.\n\nTarif berkenaan dijadualkan berkuat kuasa pada 6 Ogos, selepas tempoh pelaksanaan selama tujuh hari.\n\nSebelum ini, Trump telah mengancam untuk mengenakan tarif 50 peratus sekiranya Presiden Luiz Inacio Lula da Silva tidak menghentikan perbicaraan terhadap Bolsonaro. - BERNAMA-ANADOLU","summary":"Oleh Bernama","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1426806/trump-tandatangani-perintah-kenakan-tarif-brazil-sehingga-50-peratus","image":"https://assets.bharian.com.my/images/articles/tarifbrazil31_BHfield_image_listing_featured.var_1753925312.jpg","video":null,"publish_date":"2025-07-31 01:28:40","author":"Bernama","authors":["Bernama"],"language":"en","source_country":"my","sentiment":0.877},{"id":346774334,"title":"Our View: Israel’s government is exclusively to blame for Gaza famine","text":"When US President Donald Trump, the most ardent supporter of Israel in its war on Hamas, openly questions the narrative about the famine in Gaza being promoted by Israeli Prime Minister Benjamin Netanyahu, it is very probable nobody believes it.\n\nAsked at the weekend if he agreed with Netanyahu’s assertion that it was a “stone-faced lie” to claim that Israel was fueling hunger in Gaza, Trump said: “Those children look very hungry… that’s real starvation stuff.” A little later on the same day, he said, “the whole place is a mess… I told Israel maybe they have to do it a different way.”\n\nTrump might not have blamed Israel directly for the starvation in Gaza but there is nobody else that can take responsibility for what is happening. It is the Israel government that prevented humanitarian aid from entering Gaza for 11 weeks, from early March to late May, on the grounds that Hamas had taken control of the food distribution.\n\nThis responsibility was given to the US- and Israel-backed Gaza Humanitarian Foundation (GHF) which engaged in food distribution at the end of May, but the operation was not successful, often ending in the shooting of people trying to collect food. By mid-July, the UN human rights office OHCHR reported that it “recorded 875 people killed in Gaza while trying to get food; 674 of them were killed in the vicinity of GHF sites.”\n\nSo while some humanitarian aid has been allowed into Gaza by Israel, which bowed to international pressure for fear of losing the propaganda war, it is nowhere near enough to end the starvation suffered by thousands of Palestinians. The Integrated Food Security Phase Classification (IPC) – an international initiative working with 21 aid groups and UN agencies to assess hunger levels – said earlier this week: “The worst-case scenario of famine is currently playing out in the Gaza strip.” It called for an immediate ceasefire to alleviate “widespread starvation”.\n\nMalnutrition had killed 79 people in Gaza in the last week according to Gaza’s health authorities. “Hospitals have reported a rapid increase in hunger-related deaths of children under the age of five, with at least 16 reported deaths,” said the IPC, and since April, 20,000 children were admitted for treatment for acute malnutrition.\n\nNumbers about the suffering in Gaza are routinely disputed by Israel which argues that Hamas cannot be trusted to give accurate figures. Pictures of malnourished, starving Palestinian children cannot be dismissed as fake or as propaganda. Even President Trump recognises there is a very big problem, for which Israel’s government is exclusively to blame.\n\nThe escalating starvation in Gaza, even Israel’s allies say, is caused by the two-and-a-half-month total blockade of the strip, followed by the monopolising of aid distribution by the ineffective US-backed GHF. Needless to say, the Israel Defence Forces (IDF) blamed food shortages in Gaza on distribution failure by the UN. On Tuesday, the IDF posted footage which it said showed Hamas “violently looting humanitarian aid”.\n\nThese are deflection tactics. Everyone knows Israel has caused the starvation in Gaza and only Israel can prevent a full-scale famine. The UN said the scale of aid needed to stave off famine and prevent a health crisis is vast. Whether Netanyahu will allow adequate humanitarian through is another matter.","summary":"When US President Donald Trump, the most ardent supporter of Israel in its war on Hamas, openly questions the narrative about the famine in Gaza being promoted by Israeli Prime Minister Benjamin Netanyahu, it is very probable nobody believes it. Asked at the weekend if he agreed with Netanyahu’s assertion that it was a “stone-faced [&#8230;]","url":"https://cyprus-mail.com/2025/07/31/our-view-israels-government-is-exclusively-to-blame-for-gaza-famine","image":"https://cyprus-mail.com/wp-content/uploads/2025/07/2025-07-28T132718Z_836951215_RC2MVFAMRKOD_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA-HUNGER.jpg","video":null,"publish_date":"2025-07-31 01:20:00","author":"Israeli Prime Minister","authors":["Israeli Prime Minister"],"language":"en","category":"politics","source_country":"cy","sentiment":-0.53},{"id":346773112,"title":"Special Report w/ Bret Baier - Wednesday, July 30","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode July 30, 2025 41:13 \n FULL EPISODE\n\n EXP 7 DAYS\n Special Report w/ Bret Baier - Wednesday, July 30 \n Israel, Donald Trump, New York\n Tags MOST RECENT EPISODES | VIDEOSSPECIAL REPORT | FULL EPISODES","summary":"Israel, Donald Trump, New York","url":"https://www.foxnews.com/video/6376353570112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/9c6528d3-fa45-424e-8667-3e9d77f7fe86/f0af6fbe-9524-40dd-a08a-0d9d9e1f407e/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-07-31 01:16:43","author":null,"language":"en","source_country":"us","sentiment":-0.123},{"id":346773102,"title":"The Five - Wednesday, July 30","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode July 30, 2025 38:46 \n FULL EPISODE\n\n EXP 8 DAYS\n The Five - Wednesday, July 30 \n Donald Trump, Kamala Harris, Economy \n Tags MOST RECENT EPISODES | VIDEOSTHE FIVE | FULL EPISODES","summary":"Donald Trump, Kamala Harris, Economy","url":"https://www.foxnews.com/video/6376355032112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/5c727a32-3653-4822-88a9-35cba8157827/3771f192-ffa1-459d-bc70-f7b28df48e56/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-07-31 01:12:28","author":null,"language":"en","source_country":"us","sentiment":-0.259},{"id":346770632,"title":"Morning Digest: Trump says open to negotiations with India after announcing 25% tariff; Home Minister says no local has joined terror groups in J&K in the last six months, and more","text":"Trump says open to negotiations with India, but also links tariff ‘penalty’ to BRICS membership\n\nFollowing his announcement of a 25% tariff rate on India plus an unspecified “penalty” tariff for India purchasing Russian energy and arms, U.S. President Donald Trump said his administration was still negotiating the final tariff rate with India, while at the same time linking India’s membership to the BRICS group of countries as another reason for the penalty.\n\nDonald Trump’s latest tariff deadline is approaching: Here are the trade deals the U.S. has announced so far\n\nThe clock is ticking closer to U.S. President Donald Trump's latest tariff deadline of August 1. And while several more deals — or at least frameworks for deals — have been reached since his last tariff deadline of July 9 came and went, trade talks with many countries are still in flux. Mr. Trump unveiled sweeping import taxes on goods coming into the U.S. from nearly every country back in April. That included heightened so-called reciprocal rates for certain countries, the bulk of which have since been postponed twice.\n\nNo local has joined terror groups in J&K in the last six months, says Amit Shah\n\nUnion Home Minister Amit Shah said that in the past six months, no local had joined any terrorist group in Jammu and Kashmir (J&K). Those being killed in security operations in the Union Territory were all foreigners, he said. He said there should be no doubt that the three terrorists killed during Operation Mahadev on July 28 were the ones who carried out the Pahalgam terror attack, as the investigating agencies had matched their photos, and the evidence was backed by forensic reports.\n\nAir India Group tops audit with 19 critical safety breaches; DGCA says ‘entirely normal’ \n\nAn audit by the Directorate General of Civil Aviation (DGCA) over the past year identified 19 findings against Air India Group airlines that needed immediate corrective action, while all other carriers recorded zero findings in this category. The regulator, though, claimed that a high number of audit observations was “entirely normal”. The data released by the DGCA on Wednesday (July 30, 2025) showed that its audit revealed 10 “level 1” findings against Vistara, seven against Air India, and two against Air India Express, all of which are part of the Air India Group. All other airlines recorded zero observations in this category.\n\nOpposition walks out of Rajya Sabha over PM’s absence\n\nOpposition parties staged a walkout in Rajya Sabha evening just as Home Minister Amit Shah rose to speak in conclusion of the debate on Operation Sindoor in the Upper House, in protest against Prime Minister Narendra Modi’s absence. Congress president and Leader of Opposition in Rajya Sabha Mallikarjun Kharge said that it was an insult to the Upper House that the Prime Minister, despite being in Parliament, refused to come.\n\nLok Sabha gives nod to statutory resolution approving extension of President’s Rule in Manipur\n\nLok Sabha passed a resolution approving extension of President’s Rule in Manipur by another six months beyond August 13, with the government asserting that peace is prevailing in the northeastern state. What can be a bigger proof of peace returning there than the fact that since President’s Rule was imposed, there has been only one fatality with no casualties in the last four months, Minister of State Nityanand Rai said.\n\nU.S. sanctions hit Indian companies over Iran oil trade\n\nThe United States has imposed sanctions on at least half a dozen Indian companies accused of trading in Iranian petroleum and petrochemicals as part of broader action targeting 20 entities worldwide. The U.S. Department of State announced the sanctions on Wednesday (July 30, 2025), alleging the Indian firms knowingly engaged in “significant transactions” for the purchase and marketing of Iranian petroleum products, violating American sanctions on Iran.\n\nAll patients to register with ABHA ID, says NMC to all medical colleges and institutes\n\nTo ensure that authentic patient records are maintained by medical colleges, the National Medical Commission (NMC) has written to them directing that Ayushman Bharat Health Account (ABHA) ID should be recorded along with patient registration in the hospital. The ABHA card contains a unique 14-digit identification number called ABHA ID. The entire medical history, consultation details, and prescriptions are included in the ABHA ID. However, NMC maintained that no patient should be denied treatment without the ABHA lD.\n\nFocus on practical not ‘paper’ measures for Israel-Palestine two-state solution: India at the U.N.\n\nIndia joined the call for Israel to end the war in Gaza and ensure access to food, for Hamas to return hostages, and for U.N. members to recognise the Statehood of Palestine at a United Nations conference co-chaired by France and Saudi Arabia, but stayed on the sidelines of the major working groups formed. In a speech Indian Ambassador Parvathaneni Harish said that in 1988, India was one of the first countries to recognise the Palestinian state, and it is now time to focus on the steps required for practical solutions, not “paper solutions” to help the situation.\n\nIndian statement on Pahalgam attackers ‘replete with fabrications’, says Pakistan\n\nHome Minister Amit Shah’s account of forces killing who he said were three Pakistanis involved in the April attack on tourists in Jammu and Kashmir was “replete with fabrications”, Pakistan’s Foreign Ministry said. Mr. Shah told Parliament on Tuesday (July 29, 2025) that the three militants killed in a gun battle in a Kashmir forest this week were the perpetrators of the April 22 Pahalgam attack and that New Delhi had found evidence to back it. “Pakistan categorically rejects the baseless assertions and provocative claims made by the Indian leaders during the Lok Sabha debate on the so-called “Operation Sindoor.”\n\n'Atrocious, shocking': Cong slams Jaishankar's remarks on Nehru, Indus Waters Treaty\n\nThe Congress termed as “atrocious” External Affairs Minister S. Jaishankar’s remarks calling the Indus Waters Treaty appeasement by India’s first Prime Minister Jawaharlal Nehru and said the minister showed that he has long given up the slightest pretence of being a professional. The Congress’ attack on Mr. Jaishankar came after his speech in Rajya Sabha while intervening in the special discussion on Operation Sindoor and the Pahalgam attack. \n\nKerala nuns arrest: Durg court disposes of bail plea citing lack of jurisdiction \n\nA sessions court in Durg, Chhattisgarh disposed of the bail application of the arrested Christian nuns from Kerala, observing that it does not have the jurisdiction to hear cases under Section 143 of BNS (human trafficking), according to the lawyer for the two nuns. The court added that they may have to move to an NIA court for further legal action.\n\nIndia, UAE agree to elevate defence ties \n\nIndia and the United Arab Emirates (UAE) reaffirmed their commitment to strengthening bilateral defence cooperation during the 13th India-UAE Joint Defence Cooperation Committee (JDCC) meeting, held at the Secretary level for the first time, in New Delhi. The two sides agreed to elevate defence ties to match the growing momentum in areas such as trade, investment, and social relations, the Defence Ministry said in a statement.\n\nPahalgam terror attack: UNSC monitoring report mentions TRF\n\nThe Resistance Front, a proxy of the Lashkar-e-Taiba terror group, has found mention for the first time in a UN Security Council (UNSC) report for its role in the Pahalgam attack, a move expected to bolster India's diplomatic offensive against Pakistan-backed cross-border terrorism. The report by the UNSC's Monitoring Team (MT) quoted one unnamed member state as saying that the April 22 terror attack in Jammu and Kashmir could not have happened without Lashkar-e-Taiba's (LeT) support and that there was a relationship between the \"LeT and The Resistance Front (TRF).\n\nBihar govt announces hike in incentive for rural health workers ahead of Assembly polls\n\nAhead of the Bihar Assembly elections, Chief Minister Nitish Kumar announced that ASHA workers in the State will now get ₹3,000 per month as an incentive, a substantial increase from the existing amount of ₹1,000. He also doubled the incentive of Mamta health workers from ₹300 per delivery. The decision to increase their incentives was taken in view of the contributions of ASHA and Mamta workers to strengthen health services in rural areas, the CM wrote on social media.\n\nActor Prakash Raj appears before ED in betting app case\n\nActor Prakash Raj appeared before the Enforcement Directorate (ED) in connection with its ongoing investigation into the alleged promotion of unauthorised online betting platforms. He arrived at the ED office in Basheerbagh with his lawyer. Mr. Prakash Raj was the first among the 29 to appear for questioning before the ED. An officer from the department said that his statements will be verified further. “He answered all the questions. We will be verifying his statements and submission and decide if we have to call him again,” said the officer. \n\nEviction drive under way for second day in Assam to clear encroachment on 1,500 hectares of forest land \n\n“A massive eviction drive to clear alleged encroachment on nearly 1,500 hectares of forest land in Assam’s Golaghat district continued for the second day on Wednesday (July 30, 2025),” officials said. “The exercise, once completed, will displace around 1,500 families, mostly from the Muslim community,” they added. The eviction drive started on Tuesday (July 29, 2025) to uproot illegal settlements on almost 11,000 bighas (nearly 1,500 hectares) of land in the Rengma Reserve Forest in Uriamghat along the Assam-Nagaland border in Sarupathar sub-division.\n\nCongress loses its last MLA in Meghalaya\n\nThe Congress party lost its last legislator in Meghalaya. Thomas A. Sangma, the State’s Assembly Speaker, confirmed the resignation of Congress MLA Ronnie V. Lyngdoh, and his merger with the National People’s Party (NPP) headed by Chief Minister Conrad K. Sangma. The crossover made Meghalaya the third of the eight northeastern States without any Congress MLA. The other two States are Nagaland and Sikkim.\n\nENG vs IND fifth Test | Don’t know why the curator would not allow us to examine the surface: Gill\n\nThere have been several intense moments between India and England in the ongoing Anderson-Tendulkar Trophy. However, India captain Shubman Gill made it clear that there was no animosity between the players off the field. While Gill got into an argument with Ben Duckett and Zak Crawley at Lord’s, Ben Stokes extended a handshake to Ravindra Jadeja and Washington Sundar to end the Old Trafford game in a draw when they were inching closer to their centuries.","summary":"Here is a select list of stories to start the day","url":"https://www.thehindu.com/news/morning-digest-july-31-2025/article69875271.ece","image":"https://th-i.thgim.com/public/incoming/w9270h/article69876593.ece/alternates/LANDSCAPE_1200/Trump_72591.jpg","video":null,"publish_date":"2025-07-31 01:10:21","author":"Chief Minister Conrad","authors":["Chief Minister Conrad"],"language":"en","category":"politics","source_country":"in","sentiment":-0.237},{"id":346772978,"title":"Trump says US will set 15% tariff on South Korean imports under new deal","text":"APA South Korean protester holds up a banner during a rally against U.S. President Donald Trump's tariffs policy on South Korea, near the U.S. Embassy in Seoul, South Korea, Wednesday, July 30, 2025. The signs at bottom read \"We can't give you a penny.\" (AP Photo/Ahn Young-joon)\n\nPresident Donald Trump said on Wednesday the U.S. will charge a 15% tariff on imports from South Korea as part of a deal that eases, for now, tension with a top-10 trading partner and key Asian ally. The arrangement, announced shortly after Trump met with Korean officials at the White House, came during a blizzard of trade policy announcements ahead of a self-imposed August 1 deadline. That is when Trump has promised higher tariffs will kick in on U.S. imports from a range of countries. Imports from South Korea, a powerhouse exporter of computer chips, cars and steel, faced a 25% rate. \"I am pleased to announce that the United States of America has agreed to a Full and Complete Trade Deal with the Republic of Korea,\" Trump wrote on Truth Social. The negotiations were an early test for South Korean President Lee Jae Myung, who took office in June after a snap election. He said the deal had eliminated uncertainty in the export environment and set U.S. tariffs lower than or at the same level as major competitors.Live Events \"We have crossed a big hurdle,\" Lee said in a post on Facebook. Trump said Lee would visit the White House \"within the next two weeks\" for his first meeting with the U.S. president. Trump said South Korea had agreed to invest $350 billion in the United States in projects selected by Trump and to purchase $100 billion of liquefied natural gas and other energy products, the U.S. president said. Both steps have been major priorities for Trump, a Republican, in other trade deals. Of the $350 billion investment fund, $150 billion was aimed at a shipbuilding partnership while $200 billion would include funds for chips, nuclear power, batteries, and biologics, Kim Yong-beom, policy chief from the South Korean presidential office, told a briefing. Kim said some existing investment plans by South Korean companies would be part of the fund, and that they had ensured there would be safeguards over how the funds were used. Reuters has not seen the text of the deal or analyzed its terms. It was not immediately clear how the investment deals would be structured, where the financing would come from, over what time frame they would be implemented and to what extent their terms would be binding on the parties involved. Trump said additional South Korean investments would be announced later. Trump also said South Korea would accept American products, including cars, trucks and agriculture into its markets and impose no import duties on them. U.S. Commerce Secretary Howard Lutnick said on X that the South Korean energy purchases would take place \"over the next 3.5 years.\" The U.S. tariff rate on South Korean autos would be set at 15% and their semiconductor and pharmaceutical exports would not be treated more harshly than those from other countries, he added. Steel, aluminum, and copper were not covered by the new deal and U.S. tariff rates on those goods would remain unchanged. Despite claims by Trump and U.S. officials that non-tariff barriers on agriculture would be eliminated, Kim said that South Korea's rice and beef markets would not be open. South Korean Finance Minister Koo Yun-cheol, Industry Minister Kim Jung-kwan and Minister for Trade Yeo Han-koo had been in Washington for talks with senior U.S. officials and were believed to have met with Trump shortly before the deal announcement. Pressure had been mounting on South Korea since Japan clinched a deal to cut Trump's threatened tariffs to 15% earlier this month. Amid the last-minute push by government officials to reach a tariff deal, South Korea's Samsung Electronics inked a $16.5 billion chip deal with Tesla. South Korean battery maker LG Energy Solution also signed a $4.3 billion deal to supply Tesla with energy storage system batteries, a person familiar with the matter told Reuters.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump South Korea dealSouth Korea investment in USUS trade policyliquefied natural gas purchasesKorean auto tariffUS South Korea trade relationsSouth Korea energy productsSouth Korean presidential office\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump South Korea dealSouth Korea investment in USUS trade policyliquefied natural gas purchasesKorean auto tariffUS South Korea trade relationsSouth Korea energy productsSouth Korean presidential office(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"President Trump announced a trade deal with South Korea, imposing a 15% tariff on imports, lower than the previously threatened 25%. South Korea will invest $350 billion in U.S. projects and purchase $100 billion in energy products.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-will-set-15-tariff-on-south-korean-imports-under-new-deal/articleshow/123008255.cms","image":"https://img.etimg.com/thumb/msid-123008273,width-1200,height-630,imgsize-71616,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-31 01:03:37","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.021},{"id":346771210,"title":"India-US Trade: Here’s What India Exports To US, What It Imports","text":"US Tariffs On India: US President Donald Trump has imposed a 25 per cent tariff on Indian imports along with an unspecified penalty starting from August 01. In his social media platform Truth Social, Trump accused India of maintaining excessively high tariffs, “strenuous and obnoxious”, non-monetary trade barriers and deep energy and defence ties with Russia.\n\nIn response to the announcement of new tariffs, India said it has taken note and is currently studying its implications. It further said that India and the United States have been engaged in ongoing trade negotiations aimed at concluding a fair, balanced and mutually beneficial agreement.\n\nWith the new trade tariffs on India imports are on the horizon, let’s see the India-US trade snapshots.\n\nIn FY2024, the US imported goods and services worth $87.4 billion from India, while it exported goods and services worth $41.8 billion. It marked a trade deficit of $45.7 billion for US against India.\n\nEngineering goods, electronic goods, biologicals, petroleum and RMG cotton were the major exports to US from India. Engineering goods worth $17.6 billion had the largest share in the exporting items in FY2024. It was followed by electronic goods ($9.9 billion) and biologicals ($8.7 billion). Petroleum goods worth $5.8 billion and RMG cotton worth $4.7 billion were exported to US.\n\nThe major items that US exported to India in FY24 were: Mineral fuels & oil ($12.9 billion), precious stones ($5.16 billion), boilers & machinery ($3.7 billion), and electrical machinery ($2.4 billion).","summary":"US President Trump imposed a 25% tariff on Indian imports from August 01, citing high tariffs and Russia ties. India is studying the impact.","url":"https://www.news18.com/business/economy/india-us-trade-snapshot-what-the-us-imports-and-exports-in-87-4-billion-trade-ws-l-9474385.html","image":"https://images.news18.com/ibnlive/uploads/2025/06/Untitled-design-100-2025-06-75348adf75d49372101dda77f116d85b.jpg","video":null,"publish_date":"2025-07-31 01:00:57","author":"News18,Varun Yadav","authors":["News18","Varun Yadav"],"language":"en","source_country":"in","sentiment":0.043},{"id":346773940,"title":"Harrison Ford laments 'rich get richer and poor get poorer' in critique of Trump presidency","text":"Actor Harrison Ford spoke out about President Donald Trump's second term in an interview published Wednesday, lamenting, the \"rich get richer and poor get poorer,\" which he declared wasn't right. \"In politics and in life, you don’t always get what you want, but you get what you get, and you don’t get upset. They teach us that in kindergarten, but they also teach you to fight for what you think is right,\" he told Variety. \"Now, because we’ve been disaggregated in this way, we’re having a hard time finding commonality. But if you look at the economy, you’ll figure out where the commonality is — it’s where it always was: Rich get richer, and poor get poorer. And that ain’t exactly right,\" Ford conituned. Ford supported former Vice President Kamala Harris in 2024 and recorded a video endorsement for the former vice president. OBAMA SWIPES AT AFFLUENT LIBERALS DURING RARE PUBLIC REMARKS, SAYS 'ALL OF US ARE GOING TO BE TESTED' Ford said the country was \"on a healthy swing to the right\" right now, but added that it would swing back the other way. Asked by Variety where they should go from here, Ford responded, \"You’re asking an unqualified person. So I don’t have that answer.\" In Ford's campaign video for Harris, he said, \"The truth is this: Kamala Harris will protect your right to disagree with her about policies or ideas.\" Harris garnered a lot of celebrity endorsements, including George Clooney, Cardi B, Jamie Lee Curtis, and TV producer Shonda Rhimes. KAMALA HARRIS COMES KNIVES OUT AGAINST TRUMP IN FIRST SPEECH SINCE LEAVING OFFICE: ‘ABSOLUTE CHAOS’ Ford said during the endorsement video that Trump wanted revenge. Variety asked Ford how he felt about making the video for Harris, as someone who doesn't talk about politics often. \"Fine,\" he responded. He also spoke to Variety about his career and was asked whether he would ever retire. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP \"No. That’s one of the things I thought was attractive about the job of an actor, was that they need old people, too, to play old people’s parts,\" he said.","summary":"Harrison Ford spoke out against President Donald Trump&apos;s second term on Wednesday, lamenting &quot;the rich get rich and the poor get poorer&quot; during an interview with Variety.","url":"https://www.foxnews.com/media/harrison-ford-laments-rich-get-richer-poor-get-poorer-critique-trump-presidency","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/harrison-ford-donald-trump.jpg","video":"https://www.foxnews.com/video/6376041749112","publish_date":"2025-07-31 01:00:03","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.045},{"id":346772930,"title":"Trump says US will set 15% tariff on South Korean imports under new deal - Reuters","text":"SummaryCompaniesSouth Korea agrees to invest $350 billion in US projects, Trump saysSouth Korea to purchase $100 billion in US energy products, according to USUS sets tariffs on South Korean autos at 15%, officials said\n\nWASHINGTON/SEOUL, July 30 (Reuters) - President Donald Trump said on Wednesday the U.S. will charge a 15% tariff on imports from South Korea as part of a deal that eases, for now, tension with a top-10 trading partner and key Asian ally.\n\nThe arrangement, announced shortly after Trump met with Korean officials at the White House, came during a blizzard of trade policy announcements ahead of a self-imposed August 1 deadline.\n\nThat is when Trump has promised higher tariffs will kick in on U.S. imports from a range of countries. Imports from South Korea, a powerhouse exporter of computer chips, cars and steel, faced a 25% rate.\n\nAdvertisement · Scroll to continue\n\n\"I am pleased to announce that the United States of America has agreed to a Full and Complete Trade Deal with the Republic of Korea,\" Trump wrote on Truth Social.\n\nThe negotiations were an early test for South Korean President Lee Jae Myung, who took office in June after a snap election. He said the deal had eliminated uncertainty in the export environment and set U.S. tariffs lower than or at the same level as major competitors.\n\n\"We have crossed a big hurdle,\" Lee said in a post on Facebook. Trump said Lee would visit the White House \"within the next two weeks\" for his first meeting with the U.S. president.\n\nAdvertisement · Scroll to continue\n\nTrump said South Korea had agreed to invest $350 billion in the United States in projects selected by Trump and to purchase $100 billion of liquefied natural gas and other energy products, the U.S. president said. Both steps have been major priorities for Trump, a Republican, in other trade deals.\n\nOf the $350 billion investment fund, $150 billion was aimed at a shipbuilding partnership while $200 billion would include funds for chips, nuclear power, batteries, and biologics, Kim Yong-beom, policy chief from the South Korean presidential office, told a briefing.\n\nKim said some existing investment plans by South Korean companies would be part of the fund, and that they had ensured there would be safeguards over how the funds were used.\n\nReuters has not seen the text of the deal or analyzed its terms.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV600299 \nAbout ConnatixV600299 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nIt was not immediately clear how the investment deals would be structured, where the financing would come from, over what time frame they would be implemented and to what extent their terms would be binding on the parties involved. Trump said additional South Korean investments would be announced later.\n\nTrump also said South Korea would accept American products, including cars, trucks and agriculture into its markets and impose no import duties on them.\n\nU.S. Commerce Secretary Howard Lutnick said on X that the South Korean energy purchases would take place \"over the next 3.5 years.\"\n\nThe U.S. tariff rate on South Korean autos would be set at 15% and their semiconductor and pharmaceutical exports would not be treated more harshly than those from other countries, he added. Steel, aluminum, and copper were not covered by the new deal and U.S. tariff rates on those goods would remain unchanged.\n\nDespite claims by Trump and U.S. officials that non-tariff barriers on agriculture would be eliminated, Kim said that South Korea's rice and beef markets would not be open.\n\nSouth Korean Finance Minister Koo Yun-cheol, Industry Minister Kim Jung-kwan and Minister for Trade Yeo Han-koo had been in Washington for talks with senior U.S. officials and were believed to have met with Trump shortly before the deal announcement.\n\nPressure had been mounting on South Korea since Japan clinched a deal to cut Trump's threatened tariffs to 15% earlier this month.\n\nAmid the last-minute push by government officials to reach a tariff deal, South Korea's Samsung Electronics (005930.KS), opens new tab inked a $16.5 billion chip deal with Tesla (TSLA.O), opens new tab.\n\nSouth Korean battery maker LG Energy Solution (373220.KS), opens new tab also signed a $4.3 billion deal to supply Tesla with energy storage system batteries, a person familiar with the matter told Reuters.\n\nReporting by Trevor Hunnicutt and Ju-min Park; Editing by Stephen Coates\n\nPurchase Licensing Rights","summary":"Trump says US will set 15% tariff on South Korean imports under new deal  Reuters","url":"https://www.reuters.com/world/asia-pacific/trump-says-us-will-set-15-tariff-south-korean-imports-under-new-deal-2025-07-30/","image":"https://www.reuters.com/resizer/v2/BADFW36SEZLXLFH4OGQRZE6J7A.jpg?auth=91499323e2518f0123bb45681ffca1019ececefd99086d6dd7a8acc915c623a3&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-31 00:55:00","author":"Ju-Min Park,Trevor Hunnicutt","authors":["Ju-Min Park","Trevor Hunnicutt"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.009},{"id":346773092,"title":"Linda McMahon on how the Trump admin is handling 'woke' ideologies in higher education","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle July 30, 2025 03:24 \n\n Linda McMahon on how the Trump admin is handling 'woke' ideologies in higher education \n Education Secretary Linda McMahon discusses the multi-million dollar deal that President Donald Trump made with Brown University on ‘The Ingraham Angle.’\n Tags POLITICSPERSONALITIESTHE INGRAHAM ANGLEV-VIDEOSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIR","summary":"Education Secretary Linda McMahon discusses the multi-million dollar deal that President Donald Trump made with Brown University on ‘The Ingraham Angle.’","url":"https://www.foxnews.com/video/6376351686112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1f6949e0-e423-4cac-9044-7d057f21320e/1e41afdd-5beb-4327-92c1-d1351ac36bfd/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 00:50:50","author":null,"language":"en","source_country":"us","sentiment":0.368},{"id":346774016,"title":"Another blow for Brazil! US slaps 50% tariff to safeguard American interests; cites Bolsonaro's prosecution as economic emergency","text":"US President Donald Trump on Wednesday signed an executive order enforcing his earlier threat to impose 50% tariffs on Brazil, citing the need to safeguard US interests. The order invokes a 1977 law, arguing that Brazil’s policies and the criminal prosecution of former President Jair Bolsonaro amount to an economic emergency.The tariffs come on top of an existing 10% levy and will take effect seven days after the order’s signing. However, not all imports will be subject to the 40% tariff. Exemptions include civil aircraft and parts, aluminium, tin, wood pulp, energy products, and fertilisers.The move follows through on Trump’s earlier threat to President Luiz Inacio Lula da Silva, made in a 9 July letter, and marking a significant escalation in tensions between the two nations.\"Members of the Government of Brazil have taken actions that interfere with the economy of the United States, infringe the free expression rights of United States persons, violate human rights, and undermine the interest the United States has in protecting its citizens and companies. Members of the Government of Brazil are also politically persecuting a former President of Brazil, which is contributing to the deliberate breakdown in the rule of law in Brazil, to politically motivated intimidation in that country, and to human rights abuses,\" a statement from White House read. The statement claimed that Brazil’s judiciary had attempted to coerce social media companies and block their users. While it did not name specific platforms, the companies involved are speculated to be X and Rumble.The US President appears to align himself with Bolsonaro, who sought to overturn the outcome of his 2022 election defeat to Lula. In a parallel development, Trump was indicted in 2023 over his own attempts to challenge the results of the 2020 US presidential election.After Trump’s announcement, Lula left an animal rights event early, stating that he needed to defend the “the sovereignty of the Brazilian people in light of the measures announced by the President of the United States,” AP reported.Trump’s Treasury Department also imposed sanctions on Brazilian Supreme Court Justice Alexandre de Moraes, citing alleged suppression of freedom of expression and his role in the ongoing trial of Jair Bolsonaro.De Moraes is overseeing the criminal case against Bolsonaro, who stands accused of orchestrating a plot to remain in power following his 2022 election defeat.Earlier, on 18 July, the US State Department had announced visa restrictions on Brazilian judicial officials, including de Moraes.Stay informed with the latest business news, updates on bank holidays and public holidays.Discover stories of India’s leading eco-innovators at Ecopreneur Honours 2025","summary":"Donald Trump has escalated tensions with Brazil by imposing 50% tariffs, citing an economic emergency due to Brazil's policies and the prosecution of Jair Bolsonaro. Exemptions exist for key sectors, while the US accuses Brazil's judiciary of coercing social media companies. Lula vows to defend Brazilian sovereignty, as the US also sanctions a Supreme Court Justice.","url":"https://timesofindia.indiatimes.com/business/international-business/another-blow-for-brazil-us-slaps-50-tariff-to-safeguard-american-interests-cites-bolsonaros-prosecution-as-economic-emergency/articleshow/123007980.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123008002/123008002.jpg","video":null,"publish_date":"2025-07-31 00:49:56","author":"Toi Business Desk","authors":["Toi Business Desk"],"language":"en","source_country":"in","sentiment":0.014},{"id":346773108,"title":"Trump is ‘throwing all the rules out the window,’ says Charlie Hurt","text":"to top close Video This video is playing in picture-in-picture.\n\nJesse Watters Primetime July 30, 2025 04:47 \n\n Trump is ‘throwing all the rules out the window,’ says Charlie Hurt \n ‘Fox & Friends Weekend’ co-host Charlie Hurt breaks down President Donald Trump’s recent trip to Scotland on 'Jesse Watters Primetime.'\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRV-VIDEOJESSE WATTERS PRIMETIMEPOLITICSDONALD TRUMPDEMOCRAT ELECTIONS","summary":"‘Fox &amp; Friends Weekend’ co-host Charlie Hurt breaks down President Donald Trump’s recent trip to Scotland on &apos;Jesse Watters Primetime.&apos;","url":"https://www.foxnews.com/video/6376353922112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f4c7097b-6b39-4b18-970d-be3d84d87fe4/5c850b13-0994-44f7-9511-e3c546ce28cd/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 00:49:08","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.282},{"id":346771780,"title":"World News | Japan: Navy Chief Admiral Dinesh K Tripathi Pays Tributes at Memorial Cenotaph","text":"Tokyo [Japan], July 31 (ANI): Admiral Dinesh K Tripathi, Chief of the Naval Staff (CNS), paid tributes at the Memorial Cenotaph during his ongoing official visit to Japan. He also reviewed the Guard of Honour and held discussions with Admiral Saito Akira, Chief of Staff, Japan Maritime Self-Defence Force (JMSDF), the Indian Navy said on Wednesday.\nThe two naval chiefs discussed measures to strengthen cooperation and synergy between the two navies through enhanced operational engagements, interoperability, exchange of best practices, collaborative capacity building, and training exchange initiatives.\nAlso Read | Donald Trump's Tariffs: India Says Will Take All Steps Necessary To Secure 'National Interest' As US President Imposes 25% Tariff on Indian Exports.\nAccording to the Ministry of Defence, the visit is part of ongoing efforts to consolidate bilateral defence relations between India and Japan, in line with the deepening 'Special Strategic and Global Partnership', with a focus on maritime cooperation.\nDiscussions are expected to encompass a broad spectrum of defence cooperation areas, with particular emphasis on maritime security, technological collaboration, and identifying new avenues to strengthen naval synergy and interoperability. The CNS will also visit JMSDF units and interact with the Commander-in-Chief, Self-Defence Fleet, at Funakoshi JMSDF Base, the Ministry of Defence stated.\nAlso Read | 'All That 'Taarif' Between Donald Trump and Howdy Modi Has Meant Little': Jairam Ramesh Hits Out at Government After US President Slaps 25% Tariffs on India.\nAdmiral Tripathi's engagements in Japan are aimed at further deepening defence cooperation and friendship between the two nations, paving the way for enhanced mutual understanding in areas of shared strategic and maritime interest.\nThe Ministry of Defence noted that the visit reaffirms the time-tested India-Japan friendship, anchored in mutual respect, maritime trust, and a shared vision for peace and stability in the Indo-Pacific region.\nEarlier this year, in April, Admiral Tripathi visited Tanzania to strengthen strategic ties and enhance maritime cooperation between the two nations.\nA key highlight of that visit was the inaugural edition of the Africa-India Key Maritime Engagement (AIKEYME) exercise, which stands for 'Unity' in Sanskrit. The exercise was held from April 13 to 18 and co-hosted by the Indian Navy and the Tanzania People's Defence Force (TPDF).\nSharing a post on X, the Indian Navy wrote, \"Adm Dinesh K Tripathi, #CNS, was on an official visit to Tanzania from 12 - 16 Apr 25. The visit aimed to strengthen maritime cooperation and strategic ties between India and Tanzania, underscoring India's commitment to enhancing defence partnerships in the Indian Ocean Region.\"\nThe post added, \"The maiden edition of the large-scale multilateral exercise Africa India Key Maritime Engagement #AIKEYME, co-hosted by the #IndianNavy and the Tanzania People's Defence Force #TPDF, was scheduled to be jointly inaugurated at Dar-es-Salaam on 13 Apr 25.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Admiral Dinesh K Tripathi, Chief of the Naval Staff (CNS), paid tributes at the Memorial Cenotaph during his ongoing official visit to Japan. He also reviewed the Guard of Honour and held discussions with Admiral Saito Akira, Chief of Staff, Japan Maritime Self-Defence Force (JMSDF), the Indian Navy said on Wednesday.","url":"https://www.latestly.com/agency-news/world-news-japan-navy-chief-admiral-dinesh-k-tripathi-pays-tributes-at-memorial-cenotaph-7034075.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250730225405.jpg","video":null,"publish_date":"2025-07-31 00:48:18","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.308},{"id":346771480,"title":"Gaza’s misery boiling over","text":"It does not take a rocket scientist to figure out what is happening in the Gaza. Even a hardened mind is simply shell shocked at the goings-on where the worst form of a humanitarian catastrophe has been unfolding in the last few months.\n\nAnd all those who are pretending that it is nothing more than a test of will between Israel and the terror outfit Hamas must certainly be living in a world of their own. And the same goes for all those nations, especially in the West, who are shedding crocodile tears, issuing statements of support to the Palestinian people or a future Palestinian state and still carrying on business with Tel Aviv. The double standards have not gone unnoticed.\n\nStarvation situation\n\nThat the Gaza is a hell-hole is for the world to see. Since the Hamas terror attack on Israel on October 7, 2023, and the ensuing response of the Jewish state, it is estimated that some 60,000 people have died in that small sliver of land, a good percentage of them being women and children.\n\nWhat is more heart rending are almost daily media reports of a starvation situation, little kids rushing for a loaf or slice of bread only to be met with a hail of gunfire under the pretext of controlling a mob-like situation.\n\nIf it may be a relief of sorts in some quarters that the United Nations has not formally classified Gaza as being in a state of famine. But all thresholds to that effect are being reached. According to the Integrated Food Security Phase Classification (IFC), the “worst case scenario of famine” is currently taking place. “Conflict and displacement have intensified, and access to food and other essential items and services has plummeted to unprecedented levels”, the United Nations-backed initiative has said. “… mounting evidence shows that widespread starvation, malnutrition, and disease are driving a rise in hunger-related deaths”, the IFC has maintained, calling for immediate action to end the hostilities so as to allow for “unimpeded, large scale, life saving humanitarian response”.\n\nIt is not just a question of Prime Minister Benjamin Netanyahu getting on the wrong side of France and more recently Britain.\n\nThe Israeli leader cannot continue to harp that the “wrong” message is sent to the Hamas every time a call for humanitarianism goes out. In fact, for long time Prime Minister Netanyahu was taking cover behind President Donald Trump and the US. But it appears that President Trump too has had enough.\n\nRejecting the Israeli contention that there is no real famine in the Gaza and that photographs to this effect were misleading, President Trump asserted there was “real starvation” adding “You can’t fake that”.\n\nAgainst the backdrop of stepped up global condemnation, Washington will also be setting up food centres in the Gaza Strip.\n\nPresident Trump is also a smart politician who is quite aware of the fact that domestic sentiment is also slowly moving away, especially in the hallways of Congress — something that Prime Minister Netanyahu will also have to take note of. Politicians on both sides of the aisle traditionally known for their staunch support for the Jewish state are voicing reservations on the scale of violence in the Gaza. For instance, Marjorie Taylor Greene of Georgia became the first Republican in Congress to refer to the war in Gaza as “ genocide”.\n\nAnd within Israel that is known to have its own taboo for the use of that word, two high profile rights groups, B’Tselem and Physicians for Human Rights-Israel, have said that their country is committing “genocide” in Gaza.\n\n“Perhaps human rights groups based in Israel… coming to this conclusion is a way to confront that accusation and get people to acknowledge the reality”, Guy Shalev, Director of Physicians for Human Rights-Israel, has been quoted. Perhaps time for Prime Minister Netanyahu to really wake up and smell the coffee.\n\nThe writer is a senior journalist who has reported from Washington DC on North America and United Nations\n\nPublished on July 31, 2025","summary":"Even Israel’s staunch supporters are concerned now","url":"https://www.thehindubusinessline.com/opinion/gazas-misery-boiling-over/article69874995.ece","image":"https://bl-i.thgim.com/public/incoming/eqhyux/article69875000.ece/alternates/LANDSCAPE_1200/2025-07-29T153227Z_600300926_RC2FWFA2BOT1_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA-HUNGER.JPG","video":null,"publish_date":"2025-07-31 00:45:00","author":"Sridhar","authors":["Sridhar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.114},{"id":346772982,"title":"Trump announces US will develop 'massive' oil reserves in Pakistan, says they might sell to 'India some day'","text":"ANITrump announces US will develop \"massive\" oil reserves in Pakistan, says they might sell to \"India some day\"\n\nIn a striking shift in trade policy, US President Donald Trump on Wednesday announced two major decisions within hours. First, a 25% tariff and additional penalties on Indian imports. Then, a new trade agreement with Pakistan to jointly develop its oil reserves.The tariff on India, effective from 1 August, stems from what Trump called an unfair trade imbalance and India’s ongoing oil purchases from Russia.“BRICS, which is basically a group of countries that are anti the United States and India is a member of that if you can believe it... It is an attack on the dollar and we are not going to let anybody attack the dollar. So it’s partially BRICS and it’s partially trade,” Trump told reporters, explaining the motivation behind the penalties.Energy partnership with IslamabadHours later, Trump took to his social media platform Truth Social to unveil a US-Pakistan oil agreement.“We have just concluded a Deal with the Country of Pakistan, whereby Pakistan and the United States will work together on developing their massive Oil Reserves. We are in the process of choosing the Oil Company that will lead this Partnership. Who knows, maybe they’ll be selling Oil to India some day!” he wrote.Live EventsThe statement marks a rare moment of trade optimism between Washington and Islamabad, whose relations have often been shaped by regional tensions and security interests.Trump didn’t name the oil companies being considered or provide details on timelines. The Pakistani embassy in Washington did not immediately comment.Trade talks already in motionThis deal isn’t entirely out of the blue. Last week, Pakistan’s Foreign Minister Ishaq Dar said a US-Pakistan trade agreement was “very close” following his meeting with US Secretary of State Marco Rubio.The two officials discussed expanding cooperation in minerals and mining, according to statements from both governments. Other senior Pakistani officials have also held meetings in the US in recent weeks.The US sees Pakistan as a major non-NATO ally, and the new energy push appears to align with Washington’s larger strategic interests in Asia, particularly to counter Chinese influence.Busy day at the White HouseTrump also gave a broader update on his trade agenda, suggesting more tariff changes are on the horizon.“We are very busy in the White House today working on Trade Deals. I have spoken to the Leaders of many Countries, all of whom want to make the United States ‘extremely happy’. I will be meeting with the South Korean Trade Delegation this afternoon. South Korea is right now at a 25% Tariff, but they have an offer to buy down those Tariffs. I will be interested in hearing what that offer is,” he posted.He added, “Likewise, other Countries are making offers for a Tariff reduction. All of this will help reduce our Trade Deficit in a very major way. A full report will be released at the appropriate time. Thank you for your attention to this matter. MAKE AMERICA GREAT AGAIN!”Trade deficit figures and regional strategyIn 2024, the US goods trade deficit with Pakistan reached $3 billion, up 5.2% from 2023, according to data from the US Trade Representative’s office. Total trade between the two nations stood at $7.3 billion, a slight increase from the previous year.The Trump administration has consistently pushed for recalibrated trade agreements. Many countries have been hit with tariff threats under his tenure, often used as leverage during negotiations.India-Pakistan ceasefire in the mixThe announcement also follows months of rising tension between India and Pakistan. A deadly militant attack on 22 April in Indian-administered Kashmir led to retaliatory strikes by India on 7 May. Hostilities continued until a ceasefire was declared on 10 May.Trump has repeatedly claimed that his intervention played a role in calming tensions.Pakistan’s foreign ministry recently said it “appreciated the pivotal role” played by Trump and Rubio “in de-escalating tensions between Pakistan and India by facilitating a ceasefire.”India, however, maintains it deals with Pakistan directly, without any third-party involvement.Talks with India ongoingDespite the tariff announcement, Trump confirmed that negotiations with India are still happening.“Well, we are negotiating right now and it’s also BRICS,” he said, referring again to the bloc of emerging economies that includes India, China, and Russia.Trump’s criticism of India’s participation in BRICS underlines growing friction between Washington and New Delhi on strategic and economic fronts.For now, India faces steeper import costs. Pakistan stands to gain from renewed US trade interest. And American companies may soon be drilling for oil on Pakistani soil.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump oil reserves PakistanUS Pakistan trade agreementIndia tariff TrumpUS oil reserves developmentTrump trade policyBRICS India Pakistan relationsUS energy partnership PakistanTrump social media announcementoil sale to IndiaBRICS\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump oil reserves PakistanUS Pakistan trade agreementIndia tariff TrumpUS oil reserves developmentTrump trade policyBRICS India Pakistan relationsUS energy partnership PakistanTrump social media announcementoil sale to IndiaBRICS(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"US President Donald Trump has announced a 25% tariff and additional penalties on Indian imports, citing trade imbalance and India’s oil purchases from Russia. Just hours later, he revealed a fresh energy deal with Pakistan to jointly develop the country’s oil reserves. Trump suggested the partnership could even lead to Pakistan exporting oil to India one day. While trade talks with New Delhi continue, the US is also fielding offers from other countries on tariff reductions to ease its trade deficit.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-announces-us-will-develop-massive-oil-reserves-in-pakistan-says-they-might-sell-to-india-some-day/articleshow/123007976.cms","image":"https://img.etimg.com/thumb/msid-123008123,width-1200,height-630,imgsize-12622,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-31 00:43:56","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","source_country":"in","sentiment":0.017},{"id":346773720,"title":"Rubio, Menteri Luar Malaysia bincang ketegangan Thailand-Kemboja","text":"WASHINGTON: Setiausaha Negara Amerika Syarikat (AS), Marco Rubio dan Menteri Luar Malaysia, Datuk Seri Mohamad Hasan, membincangkan ketegangan Thailand-Kemboja, kata jurucakap Jabatan Negara AS, Tammy Bruce pada Rabu.\n\n\"Setiausaha Negara AS telah berbincang dengan Menteri Luar Malaysia bagi menyampaikan penghargaan terhadap peranan kerajaan Malaysia dalam meredakan ketegangan antara Thailand dan Kemboja.\n\n\"Bantuan Malaysia juga membaya kejayaan memudah cara perjanjian gencatan senjata berhubung pertikaian sempadan yang sedang berlaku,\" katanya dalam kenyataan yang dipetik Sputnik/RIA Novosti.\n\nRubio turut mengulangi hasrat AS untuk mencapai keamanan dan pelaksanaan gencatan senjata, katanya.\n\n\"AS menyokong rundingan selanjutnya mengenai pelaksanaan gencatan senjata bagi memastikan keamanan dan kestabilan antara Thailand dan Kemboja,\" katanya lagi.\n\nKetegangan di sempadan Thailand-Kemboja bertukar menjadi pertempuran bersenjata pada 24 Julai, apabila kedua-dua pihak saling berbalas tembakan artileri. Kedua-dua negara melaporkan korban jiwa, termasuk orang awam.\n\nPada 27 Julai, Presiden AS, Donald Trump berkata AS tidak akan berunding mengenai tarif dengan mana-mana negara yang terlibat dalam konflik bersenjata, dan menggesa Thailand dan Kemboja segera memulakan rundingan gencatan senjata.\n\nPada Isnin, Thailand dan Kemboja bersetuju untuk melaksanakan gencatan senjata bermula tengah malam. \n\nNamun pada Selasa, Pemangku Perdana Menteri Thailand mendakwa Kemboja terus melanggar gencatan senjata secara sistematik di kawasan sempadan. \n\nDakwaan itu telah dinafikan oleh Kementerian Pertahanan Kemboja.","summary":"WASHINGTON: Setiausaha Negara Amerika Syarikat (AS), Marco Rubio dan Menteri Luar Malaysia, Datuk Seri Mohamad Hasan, membincangkan ketegangan Thailand-Kemboja, kata jurucakap Jabatan Negara AS, Tammy Bruce pada Rabu.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1426796/rubio-menteri-luar-malaysia-bincang-ketegangan-thailand-kemboja","image":"https://assets.bharian.com.my/images/articles/bh31ruby-o_BHfield_image_listing_featured.var_1753922549.jpg","video":null,"publish_date":"2025-07-31 00:42:35","author":"BERNAMA","authors":["BERNAMA"],"language":"en","source_country":"my","sentiment":0.488},{"id":346766430,"title":"Trump says South Korea has secured US trade deal with 15% tariff","text":"NEW YORK -- South Korea has struck a trade deal with the U.S. and will be charged a 15% tariff rate on exports in return for duty-free treatment of American goods, President Donald Trump said Wednesday.\n\nSouth Korea will also purchase $100 billion worth of American liquefied natural gas or other energy products, Trump said in a social media post.","url":"https://asia.nikkei.com/Economy/Trade-war/Trump-tariffs/Trump-says-South-Korea-has-secured-US-trade-deal-with-15-tariff","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F0%2F8%2F7%2F0%2F49920780-3-eng-GB%2FCropped-17539170912025-07-30T191955Z_34566028_RC26XFASMS6","video":null,"publish_date":"2025-07-31 00:42:08","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.106},{"id":346771778,"title":"World News | US Sanctions Hit Indian Companies over Iran Oil Trade","text":"By Reena Bhardwaj\nWashington DC [US], July 31 (ANI): The United States has imposed sanctions on at least half a dozen Indian companies accused of trading in Iranian petroleum and petrochemicals as part of broader action targeting 20 entities worldwide.\nAlso Read | Donald Trump's Tariffs: India Says Will Take All Steps Necessary To Secure 'National Interest' As US President Imposes 25% Tariff on Indian Exports.\nThe US Department of State announced the sanctions on Wednesday, alleging the Indian firms knowingly engaged in \"significant transactions\" for the purchase and marketing of Iranian petroleum products, violating American sanctions on Iran.\nThe sanctioned Indian companies include some of the country's major petrochemical traders. Alchemical Solutions Private Limited faces the largest allegations, accused of importing Iranian petrochemical products worth over USD 84 million between January and December 2024.\nAlso Read | 'All That 'Taarif' Between Donald Trump and Howdy Modi Has Meant Little': Jairam Ramesh Hits Out at Government After US President Slaps 25% Tariffs on India.\nGlobal Industrial Chemicals Limited is alleged to have purchased Iranian petrochemicals, including methanol, valued at over USD 51 million between July 2024 and January 2025. Jupiter Dye Chem Private Limited reportedly imported Iranian products, including toluene worth over USD 49 million, during the same period. Ramniklal S Gosalia and Company is accused of purchasing Iranian petrochemicals worth over USD 22 million, including methanol and toluene.\nPersistent Petrochem Private Limited allegedly imported approximately USD 14 million worth of Iranian petrochemicals, particularly methanol, between October and December 2024. Kanchan Polymers is said to have purchased over USD 1.3 million worth of Iranian polyethene products.\nUnder the sanctions, all assets of these companies in the United States or controlled by US persons are now frozen. American individuals and companies are prohibited from conducting business with the sanctioned entities. The action also blocks any entity that is 50 per cent or more owned by the sanctioned companies.\nThe sanctions come as the US continues its \"maximum pressure\" campaign against Iran, targeting what it calls the country's \"shadow fleet\" of vessels and intermediary companies that help transport Iranian oil and petrochemicals globally. US officials say Iran uses revenue from oil and petrochemical exports to fund what Washington describes as \"destabilising activities\" in the Middle East and support for terrorist groups.\nIndia has historically maintained trade relationships with Iran, though it has reduced Iranian oil imports significantly since 2019 following previous US sanctions.\nThe sanctioned companies can petition for removal from the US Treasury's Specially Designated Nationals list. The US government says the \"ultimate goal of sanctions is not to punish, but to bring about a positive change in behaviour.\"\nCompanies wishing to contest their designation can submit petitions to the Treasury Department's Office of Foreign Assets Control, according to a fact sheet shared by the US Department of State.\nThe sanctions also targeted companies in Turkey, the UAE, China, and Indonesia as part of what US officials describe as a global network facilitating Iranian oil and petrochemical trade. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The US Department of State announced the sanctions on Wednesday, alleging the Indian firms knowingly engaged in &quot;significant transactions&quot; for the purchase and marketing of Iranian petroleum products, violating American sanctions on Iran.","url":"https://www.latestly.com/agency-news/world-news-us-sanctions-hit-indian-companies-over-iran-oil-trade-7034071.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250730222021.jpg","video":null,"publish_date":"2025-07-31 00:40:18","author":null,"language":"en","category":"business","source_country":"in","sentiment":-0.054},{"id":346773088,"title":"Congressional anti-stock trading ban is also known as the ‘Pelosi act,’ says GOP senator","text":"to top close Video This video is playing in picture-in-picture.\n\nJesse Watters Primetime July 30, 2025 04:07 \n\n Congressional anti-stock trading ban is also known as the ‘Pelosi act,’ says GOP senator \n Sen. Josh Hawley, R-Mo., assesses the anti-stock trading bill for congresspeople and President Donald Trump’s new nickname for him ‘Jesse Watters Primetime.’\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRJESSE WATTERS PRIMETIMEPERSONALITIESV-VIDEOPOLITICS","summary":"Sen. Josh Hawley, R-Mo., assesses the anti-stock trading bill and President Donald Trump’s new nickname for him on ‘Jesse Watters Primetime.’","url":"https://www.foxnews.com/video/6376352359112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/acad8337-c692-4b25-a36a-d268f0472360/80d5c55f-0390-45b0-a6cb-8154b64f0075/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 00:38:31","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.006},{"id":346772744,"title":"Donald Trump's son claims Chelsea stars asked him to join Club World Cup celebrations before awkward moment","text":"Donald Trump's son claims Chelsea stars asked him to join Club World Cup celebrations before awkward moment\n\nREAD MORE: Lionel Messi spotted wearing '$2m' watch on Inter Miami sidelines \n\nBy JAMES COHEN\n\nPublished: 01:23 BST, 31 July 2025 | Updated: 01:23 BST, 31 July 2025\n\nEric Trump has claimed that Chelsea invited Donald Trump on stage for their Club World Cup celebrations - and recognized it as 'the greatest honor of their life'. \n\nEarlier this month, the US President watched on as Chelsea secured a surprise 3-0 win against PSG, with Cole Palmer scoring a brace at the MetLife Stadium.\n\nAfterwards, Trump was on stage - handing medals to the players - before passing over the Club World Cup trophy and remained on stage as the side lifted the title. \n\nMany fans were left bemused by the incident and that confusion also stretched to some of the Chelsea stars - who seemed unaware that Trump would be on stage.\n\nHowever, now, Trump's second-eldest son Eric has lifted the lid on the situation and asserted that the US President was invited by the team to join the festivities.\n\nSpeaking to BBC Sport, Eric said: 'Listen, he's the Commander-in-Chief of the United States of America. \n\nDonald Trump took center stage as he joined Chelsea's Club World Cup celebrations\n\nThough some fans - and players - were confused, it's now claimed Trump was invited on stage \n\nTrump's son Eric (right) claimed that Chelsea wanted Trump on stage to celebrate the moment\n\n'The winning team invited him to the stage because they said it would be the greatest honor of their life if the president of the United States could present the Club World Cup trophy.\n\n'And by the way, I was there, I was watching it. The place went crazy. And there's no one that's done more for sport than him'. \n\nDespite claiming that Chelsea were aware that Trump would be on stage for the trophy lift, the bemused faces of some of their players in the moment said otherwise. \n\nNotably, England star Cole Palmer was left bewildered by Trump's on-stage presence and appeared to utter: 'What's he doing?' \n\nThe England soccer star later spoke out on his confusion, confirming the president's celebration participation was entirely unplanned. \n\n'I knew he was going to be here but I didn't know he was going to be on the stand when we lifted the trophy so I was a bit confused, yeah,' he said. \n\nTrump had earlier presented Palmer with the golden ball award with the 23-year-old midfielder looking as equally baffled during that presentation.\n\nMeanwhile, Chelsea defender Marc Cucurella admitted he was 'scared s***less' by Trump when the US president joined their Club World Cup lift. \n\nPalmer had appeared baffled by Trump's continued presence during the trophy presentation\n\nCucurella told Spanish press: 'We had been told that, as a rule, Donald Trump would come to present us with the trophy and that we couldn't lift it until he left.\n\n'And of course, we were all there waiting for him to leave, but the guy didn't want to leave, and on top of that, we looked at him and he said, 'Get him up, I'll stay here, and so on.'\n\n'And I wondered who would say anything to him, you know... I was scared s***less!'\n\nTrump and wife Melania had touched down around 35 minutes before kickoff at the MetLife Stadium at the nearby Teterboro Airport on the presidential Marine One helicopter.\n\nAfter being spotted touching down near MetLife, Trump surfaced inside the stadium loud cheers could be heard from the 80,000 in attendance.\n\nChelseaClub World CupEric TrumpCole Palmer\n\nShare or comment on this article:\nDonald Trump's son claims Chelsea stars asked him to join Club World Cup celebrations before awkward moment\n\nAdd comment","summary":"Earlier this month, the US President watched on as Chelsea secured a surprise 3-0 win against PSG , with Cole Palmer scoring a brace at the MetLife Stadium.","url":"https://www.dailymail.co.uk/sport/football/article-14957015/Donald-Trumps-son-claims-Chelsea-stars-asked-join-Club-World-Cup-celebrations-awkward-moment.html","image":"https://i.dailymail.co.uk/1s/2025/07/31/01/100790209-0-image-m-46_1753921333824.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/07/13/1659974911994907154/1024x576_MP4_1659974911994907154.mp4","publish_date":"2025-07-31 00:23:37","author":"Editor,James Cohen","authors":["Editor","James Cohen"],"language":"en","source_country":"gb","sentiment":-0.264},{"id":346771372,"title":"Trump-South Korea Trade Deal: 15% Tariffs, $350 Billion Investment, And AI Corridor","text":"On Wednesday, President Donald Trump unveiled a sweeping trade agreement with South Korea, the US’s sixth-largest trading partner, securing a 15% tariff on its exports—down from a threatened 25%—and $350 billion in investments directed by Trump himself. Announced via Truth Social, the deal also includes $100 billion in US LNG and energy purchases and opens South Korea’s markets to American cars, trucks, and agricultural products without tariffs. The agreement, finalized after months of tense negotiations, averts a steeper levy set to hit on August 1. South Korea’s new President Lee Jae Myung, fresh off a June election win, faces domestic pressure over concessions on sensitive beef and rice markets, which sparked protests in 2008. Trump praised Lee’s “electoral success” and invited him to the White House within two weeks to iron out details. The deal, likened to Japan’s $550 billion investment pledge, raises questions about its feasibility, with analysts like Nomura’s Takahide Kiuchi calling such figures “vaporware”. Yet, Trump insists the investments will bolster US industries like energy and semiconductors, according to a Pravda USA report. A Strategic Trade Win The agreement builds on a 2007 US-South Korea trade pact, revised in 2018, which already slashed most tariffs. South Korea’s $350 billion commitment, to be managed like a sovereign wealth fund under Trump’s direction, targets sectors like energy infrastructure and shipbuilding. The $100 billion LNG purchase, potentially tied to an Alaska pipeline project, aligns with Trump’s energy dominance push, though South Korea’s declining gas demand raises doubts, The New York Times stated in a report. Seoul’s agreement to accept US safety standards for cars could boost exports from firms like Ford. Also Read: Trump Strikes Trade Deal with Pakistan to Develop ‘Massive Oil Reserves': 'Maybe They’ll Sell To India' South Korea’s concessions come amid fears of economic fallout from Trump’s tariffs, which hit 50% on Brazil and threaten others. The deal’s structure, offering tariff-free US access while imposing a 15% levy on Korean exports, aims to shrink the US’s $971 billion trade deficit. However, South Korea’s $206 billion sovereign wealth fund may struggle to meet the $350 billion pledge. Domestic and Global Stakes Lee Jae Myung’s government, riding high on post-election optimism, risks political fractures over opening beef and rice markets. The 2008 protests over US beef imports loom large, with farmers wary of further concessions. Meanwhile, Trump’s trade strategy, including a paused 25% tariff on USMCA countries like Canada until April 2025, pressures allies to align with US interests. South Korea’s deal mirrors Japan’s, which secured a 15% tariff with $550 billion in investments, a model Bank of America sees as a blueprint for auto-exporting nations. Meanwhile, South Korea’s Hyundai and Samsung have already committed billions to US manufacturing, but scaling to $350 billion may strain Seoul’s resources. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"President Donald Trump announced a trade deal with South Korea, imposing a 15% tariff on its exports while securing $350 billion in US-directed investments and $100 billion in LNG purchases. South Korea gains tariff-free access for US goods like cars and agriculture, averting a 25% levy set for August 1.","url":"https://www.timesnownews.com/world/us/us-news/trump-south-korea-trade-deal-15-tariffs-350-billion-investment-and-ai-corridor-article-152377755","image":"https://images.timesnownews.com/thumb/msid-152377800,thumbsize-33450,width-1280,height-720,resizemode-75/152377800.jpg","video":null,"publish_date":"2025-07-31 00:20:15","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":0.233},{"id":346772928,"title":"Fed's reticence on rate cuts forces market to rethink outlook - Reuters","text":"SummaryTraders back away from bets on interest rate cut in SeptemberTreasury yields and the dollar rise, while stocks retreatPositioning ahead of Fed decision may have amplified bond reactionInvestors warn against reading too much into one-day market reaction\n\nNEW YORK, July 30 (Reuters) - The Federal Reserve's decision to avoid signaling imminent rate cuts despite relentless political pressure underscores its prevailing caution and has forced investors to dial back expectations for an easing at the next policy meeting.\n\nThe Federal Open Market Committee held interest rates on Wednesday in a split decision that gave little indication of when borrowing costs might be lowered. It also drew dissent from two Fed governors, both appointees of President Donald Trump who agree with him that monetary policy is too tight.\n\nAdvertisement · Scroll to continue\n\nThe overnight policy rate controlled by the Fed remains in a 4.25%-4.50% range. The last rate cut was in December and the Fed hiked rates from March 2022 to July 2023 to fight inflation.\n\nThe lack of a clear signal that the Fed was warming to interest rate cuts as soon as the next meeting in September lifted Treasury yields and the dollar in late trade and turned stocks lower.\n\n\"I think the Fed has pushed out the probability of a rate cut,\" Sonu Varghese, global macro strategist at Carson Group.\n\n\"They're going to wait for more data, but more data means more time, and more time means rates are going to remain restrictive for a few more months,\" Varghese said.\n\nAdvertisement · Scroll to continue\n\nFed funds futures traders are pricing in a 46% probability of a rate cut by September, down from about 65% a day ago, according to the CME Group's FedWatch Tool. They are no longer pricing in two full 25 basis point cuts by year-end as they were in recent days.\n\nFed Chair Jerome Powell was careful to keep his options open on monetary policy. \"We have made no decisions about September,\" he said in a press conference. He also noted there was still time to take in a wide range of data before the central bank next met in mid-September.\n\n\"There was some possibility that (Powell) would softly signal that a September rate cut is the base case, and (that it) would only not happen if the data didn't play out in a way that's consistent with that,\" said David Seif, chief economist for Developed Markets at Nomura in New York.\n\n\"I'd say he did not do that at all.\"\n\nBond yields climbed on Wednesday as Powell reiterated the economy was showing resilience despite interest rates remaining \"modestly restrictive\". Benchmark Treasury 10-year yields and two-year yields both rose by about two basis points after those remarks.\n\nInvestor positioning may have amplified the bond market reaction, said Jamie Patton, co-head of global rates at TCW.\n\n\"I think the market had gotten a bit ahead of itself thinking we already had enough data to justify a cut in September,\" said Patton, who remains bullish on short-term bonds due to expectations of imminent interest rate cuts.\n\nPowell has come under intense pressure from the White House to lower interest rates, with President Trump regularly berating him for being too slow to lower borrowing costs.\n\nPowell's reticence in guiding when the Fed may start cutting rates will leave investors to parse two more months' worth of inflation and employment data for the timing of policy easing, and put some pressure on small-cap stocks in the near term, investors said.\n\nThe Russell 2000 small-cap index (.RUT), opens new tab, which had been outperforming the S&P 500 index on the day before Powell took the stage, finished the session down 0.47% against a 0.12% loss for the large-cap benchmark.\n\nFor the dollar, which has come under intense selling pressure this year, the Fed's relatively hawkish message gave some support, lifting the currency to a two-month high against a basket of peers. The dollar index ended up 1%, leaving it down about 8% for the year.\n\n\"We still envision medium-term weakness for the USD, but in the near-term the risk profile is more two-way,\" BofA Global Research strategists said in a note.\n\nHigher rates in the U.S. help boost the allure of the dollar relative to other developed market currencies.\n\n\"This patience from the Fed and strength of the U.S. economy coming through is putting a little bit of a pause to that dollar depreciation,\" Vishal Khanduja, head of broad markets fixed income at Morgan Stanley Investment Management, said.\n\nKhanduja, however, warned against reading too much into the market's reaction to the Fed meeting.\n\n\"Overall, I thought they did not change their stance at all,\" he said.\n\nKhanduja expects three to five cuts by the end of next year, though he sees the next two inflation releases as important.\n\n\"They're still going to be wait-and-see, still very convinced that inflation is going to be slightly higher in the next two prints,\" he said. \"But they are still very convinced it's going to be a one-time bump.\"\n\nReporting by Saqib Iqbal Ahmed and Davide Barbuscia; Additional reporting by Carolina Mandl and Laura Matthews; Editing by Alden Bentley and Sam Holmes\n\nPurchase Licensing Rights\n\nDavide BarbusciaThomson ReutersDavide Barbuscia covers macro investment and trading out of New York, with a focus on fixed income markets. Previously based in Dubai, where he was Reuters Chief Economics Correspondent for the Gulf region, he has written on a broad range of topics including Saudi Arabia’s efforts to diversify away from oil, Lebanon’s financial crisis, as well as scoops on corporate and sovereign debt deals and restructuring situations. Before joining Reuters in 2016 he worked as a journalist at Debtwire in London and had a stint in Johannesburg.","summary":"Fed's reticence on rate cuts forces market to rethink outlook  Reuters","url":"https://www.reuters.com/business/feds-reticence-rate-cuts-forces-market-rethink-outlook-2025-07-31/","image":"https://www.reuters.com/resizer/v2/M4ZEBBH27FPUDMXXQEXTHA4YSE.jpg?auth=39b999a977b8a0b8f85c4452e612003e53bf38fe94338119ffe866a2c6d71839&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-31 00:17:00","author":"Davide Barbuscia,Saqib Ahmed","authors":["Davide Barbuscia","Saqib Ahmed"],"language":"en","source_country":"gb","sentiment":-0.349},{"id":346766892,"title":"Ukraine war briefing: Kremlin says it has ‘immunity’ to US sanctions as Trump deadline looms","text":"The Kremlin said on Wednesday it continues to monitor statements by US president Donald Trump regarding sanctions against Moscow, but that Russia had acquired immunity to such measures thanks to long experience. Trump said on Tuesday the United States would start imposing tariffs and other measures on Russia in 10 days if Moscow showed no progress towards ending its more than three-year-long war in Ukraine. “We have been living under a huge number of sanctions for quite a long time, our economy operates under a huge number of restrictions,” Kremlin spokesperson Dmitry Peskov told reporters. “Therefore, of course, we have already developed a certain immunity in this regard, and we continue to note all statements that come from President Trump, from other international representatives on this matter.”\n\nUkrainian President Volodymyr Zelenskyy said on Wednesday that he had approved key principles for large-scale weapons agreements with the United States. “These are large-scale agreements, which I discussed with President [Donald] Trump, and I hope very much that we will be able to implement them all,” Zelenskyy said in his evening video address to the nation, adding that it would strengthen both countries. He provided no specifics.\n\nUkraine’s domestic security agency has detained an air force officer on charges of having spied for Russia by leaking the location of prized F-16 and Mirage 2000 fighter jets, officials said on Wednesday. The unidentified officer, a flight instructor holding the rank of major, stands accused of helping Russia carry out airstrikes by providing coordinates and suggesting strike tactics, the Security Service of Ukraine (SBU) said in a statement.\n\nMore than 200 Kremlin critics including former political prisoners voiced outrage on Wednesday at the visit of a high-ranking Moscow delegation to Switzerland, accusing Europe of hosting “war criminals” despite the invasion of Ukraine. Opponents of Russia’s leader Vladimir Putin fear that, more than three years into Moscow’s invasion of Ukraine, some western powers and institutions are at risk of normalising relations with Moscow.\n\nThe delegation, led by Valentina Matvienko, speaker of Russia’s upper house of parliament, arrived in Geneva on Sunday for the three-day gathering of global parliamentarians. Matvienko and two other Russian participants attending are under EU and international sanctions. “While Geneva hosts war criminals Matvienko, Tolstoi, and Slutsky, Russian troops continue to launch missile strikes on Ukrainian cities. Civilians, children, and women are dying,” the signatories said.\n\nTrump said on Wednesday that he would impose a 25% tariff on goods from India, plus an additional trade tax beginning on Friday, because he says India’s purchasing of Russian oil is extending the war in Ukraine. He added that India has “always bought a vast majority of their military equipment from Russia, and are Russia’s largest buyer of ENERGY, along with China, at a time when everyone wants Russia to STOP THE KILLING IN UKRAINE.”\n\nThere has been a significant rise in child casualties in Ukraine in recent months as Russia indiscriminately targets heavily populated civilian areas, with 222 children killed or injured between March and May this year and 2,889 in total since the start of the invasion. Given the delay in verifying deaths, the UN says the true number is likely to be much higher.\n\nMoldova’s pro-European president Maia Sandu on Wednesday accused Russia of seeking to meddle in the September national elections, warning that Moscow was planning “unprecedented” action to “get its people into the next parliament”. Sandu, a vocal critic of Russia, in particular since the start of its invasion of Ukraine in 2022, has repeatedly accused Moscow of political interference in the former Soviet republic that lies between war-torn Ukraine and EU and Nato member Romania.","summary":"Russia says it has been living under ‘a huge number of sanctions’ for some time, with its economy already operating under restrictions. What we know on day 1,254\n\nThe Kremlin said on Wednesday it continues to monitor statements by US president Donald Trump regarding sanctions against Moscow, but that Russia had acquired immunity to such measures thanks to long experience. Trump said on Tuesday the United States would start imposing tariffs and other measures on Russia in 10 days if Moscow showed no progress towards ending its more than three-year-long war in Ukraine. “We have been living under a huge number of sanctions for quite a long time, our economy operates under a huge number of restrictions,” Kremlin spokesperson Dmitry Peskov told reporters. “Therefore, of course, we have already developed a certain immunity in this regard, and we continue to note all statements that come from President Trump, from other international representatives on this matter.”\n\nUkrainian President Volodymyr Zelenskyy said on W","url":"https://www.theguardian.com/world/2025/jul/31/ukraine-war-briefing-kremlin-says-it-has-immunity-to-us-sanctions-as-trump-deadline-looms","image":"https://i.guim.co.uk/img/media/5b360ac77befc8635f842c2ae8b1483216f25049/877_0_4518_3615/master/4518.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-07-31 00:12:10","author":"Guardian staff and agencies","authors":["Guardian staff and agencies"],"language":"en","category":"politics","source_country":"us","sentiment":0.144},{"id":346773098,"title":"America's economy is looking very bright, Laura Ingraham says","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle July 30, 2025 06:55 \n\n America's economy is looking very bright, Laura Ingraham says \n Fox News host Laura Ingraham discusses the Federal Reserve keeping interest rates steady and President Donald Trump's immigration policies on 'The Ingraham Angle.'\n Tags POLITICSV-VIDEOTHE INGRAHAM ANGLESHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIR","summary":"Fox News host Laura Ingraham discusses the Federal Reserve keeping interest rates steady and President Donald Trump&apos;s immigration policies on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6376352916112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a774dc4f-b4ef-45e2-95ca-d2759acd4791/7bbe4ed2-11d5-4c49-9915-10c56e7aaa57/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 00:10:52","author":null,"language":"en","source_country":"us","sentiment":0.679},{"id":346766272,"title":"Inside Biden confidante Steve Ricchetti's 'combative' eight-hour grilling in House Oversight cover-up probe","text":"A member of former President Joe Biden's inner circle sat with House Oversight Committee investigators for a marathon closed-door interview that lasted more than eight hours on Wednesday. Steve Ricchetti, who served as counselor to the president for all four years of Biden's term, was described as \"combative and defensive\" during his voluntary meeting, a source familiar with the sitdown told Fox News Digital. The source described Ricchetti as defiant in the face of doubts about Biden's mental acuity, though he \"admitted that they all knew President Biden’s age was an issue and were dealing with it as a political matter,\" they said. \"Mr. Ricchetti stated that he believed President Biden had the ability to be president and that he was performing the capacity of president every day. He believes that Joe Biden is capable to being president today, and that he could have won in 2024,\" the source told Fox News Digital. COMER DISMISSES BIDEN DOCTOR'S BID FOR PAUSE IN COVER-UP PROBE: 'THROWING OUT EVERY EXCUSE' Ricchetti, a longtime Democratic operative and lobbyist, first began working for Biden in March 2012 when he was appointed counselor to the vice president under former President Barack Obama. He was elevated to be Biden's chief of staff in December 2013. He touted his closeness to Biden over the last 13 years, the source said, and described having personal relationships with former first lady Jill Biden and Hunter Biden as well. Ricchetti's own children were also close to the White House during Biden's tenure – at least three of them had jobs in the Democratic administration at some point. House Oversight Committee Chairman James Comer, R-Ky., is investigating whether Biden's top White House aides concealed signs of mental decline in the president, and if that meant executive actions were signed via autopen without his knowledge. Ricchetti is the seventh ex-Biden aide to come in, but just the fourth to appear on voluntary terms. Former White House doctor Kevin O'Connor and former White House aides Annie Tomasini and Anthony Bernal all pleaded the Fifth Amendment to avoid answering questions. Ricchetti told investigators that he was not involved in O'Connor's physical evaluation letters for Biden, \"but he did have conversations with senior staff on how to communicate and present President Biden’s physical evaluation letters,\" the source told Fox News Digital. He also defended Biden's frequent gaffes, describing them as \"common mistakes\" that anyone could make, the source said. \"He said the frequency of these mistakes have not increased since Joe Biden was vice president,\" the source said. RON KLAIN DODGES REPORTERS AFTER MARATHON GRILLING IN BIDEN COVER-UP PROBE CLICK HERE TO GET THE FOX NEWS APP The majority of questioning during the eight-hour session came from Republicans – the source said Democrats frequently attempted to change the topic to discuss President Donald Trump. Ricchetti said nothing to reporters when leaving the meeting on Wednesday evening. No lawmakers were present for the sitdown, as is usually the case with such transcribed interviews. Fox News Digital reached out to Ricchetti's attorney for comment but did not hear back by press time.","summary":"Former Biden aide Steve Ricchetti spoke with House investigators for roughly eight hours on Wednesday.","url":"https://www.foxnews.com/politics/inside-top-biden-aide-steve-ricchettis-combative-eight-hour-grilling-house-oversight-cover-up-probe","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/steve-ricchetti-house.jpg","video":"https://www.foxnews.com/video/6376350627112","publish_date":"2025-07-31 00:09:45","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":-0.307},{"id":346769340,"title":"Trump tech initiative proposed to streamline healthcare services","text":"July 30 (UPI) -- Sharing healthcare information among medical service providers might be easier under a plan proposed by President Donald Trump on Wednesday.\n\nTrump and U.S. Health and Human Services Secretary Robert Kennedy Jr. proposed a partnership with tech firms to make it easier for Americans to share their personal healthcare information with health services providers.\n\n\"This will allow patients to easily transmit information from one doctor to another, even if they're [in] different networks and using different record keeping systems,\" Trump said during an event dubbed Make Health Tech Great Again on Wednesday.\n\n\"America's healthcare networks have been overdue for a high-tech upgrade, and that's what we're doing,\" Trump said.\n\n\"The existing systems are often slow, costly and incompatible with one another,\" he added. \"But with today's announcement, we take a major step to bring healthcare into the digital age.\"\n\nHe called the move \"vital\" for making it more convenient and faster for people to obtain improved healthcare services and enjoy better health.\n\nOfficials with more than 60 companies agreed to partner with the Trump administration to make the sharing of health information easier and more efficient through apps and other forms of electronic communications.\n\n\"For decades, bureaucrats and entrenched interests buried health data and blocked patients from taking control of their health,\" Kennedy said during the event.\n\n\"That ends today,\" he said. \"We're tearing down digital walls, returning power to patients and rebuilding a health system that serves the people.\"\n\n\"This is how we begin to make America healthy again,\" he added.\n\nIn addition to Trump and Kennedy, many others in the Trump administration attended the event that was held at the White House on Wednesday afternoon.\n\nThe announcement has raised concern about the security of people's sensitive health information, which Centers for Medicare and Medicaid Services spokeswoman Catherine Howden downplayed.\n\nThe \"initiative aims to build a smarter, more secure and more personalized healthcare system,\" Howden said in a prepared statement.\n\nThe initiative \"improves patient outcomes, reduces provider burden and drives greater value through private sector innovation,\" she added.","summary":"Sharing healthcare information among medical service providers might be easier under a plan proposed by President Donald Trump and others on Wednesday.","url":"https://www.upi.com/Top_News/US/2025/07/30/healthcare-information/3451753918386/","image":"https://cdnph.upi.com/sv/ph/og/upi/3451753918386/2025/1/7eb3492af0efa5a351593a3d27739f3b/v1.5/Trump-tech-initiative-proposed-to-streamline-healthcare-services.jpg","video":null,"publish_date":"2025-07-31 00:05:36","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"US","sentiment":0.222},{"id":346771368,"title":"Trump Attacks Close Ally Josh Hawley Over Congressional Trading Ban Bill: 'Very Much Like SABOTAGE'","text":"President Donald Trump lashed out at Sen. Josh Hawley (R-Mo.) on Wednesday after Hawley joined Democrats in a Senate committee vote to advance a sweeping stock trading ban for elected officials. The bill passed 8–7, with Hawley as the only Republican voting in favor. The bill, introduced by Hawley and Sen. Gary Peters (D-Mich.), would immediately ban elected officials, including the president, vice president, and their spouses, from buying stocks and prohibit them from selling stocks for 90 days following its enactment. It would also require divestment from covered investments at the beginning of their next term. Trump, reacting to the vote, posted on Truth Social accusing Hawley of betrayal and claimed the Missouri senator was being “used” by Democrats to undermine him. He took particular issue with Hawley voting against a Republican-backed amendment to investigate Rep. Nancy Pelosi’s stock trading history, a longtime target of Trump’s unfounded insider trading accusations. Trump also criticized the defeat of another amendment, introduced by Sen. Rick Scott (R-Fla.), which would have carved out an exemption for the president, vice president, their spouses, and dependent children. Hawley again voted with Democrats to reject that proposal. “This is sabotage,” Trump said, accusing Hawley of passing a bill “Nancy Pelosi is in absolute love with” and warning that “real Republicans” won’t tolerate being “targeted” by their own party members. Despite GOP efforts to negotiate with the White House for a carve-out to shield the presidency, the amendment failed, deepening tensions within Republican ranks over ethics reforms that may ultimately affect the Trump administration. Will Trump Be Affected by This Bill? The proposed legislation, known as the Honest Act, would ban members of Congress, the president, vice president, and their spouses from holding, buying, or selling stock. However, the executive branch provisions would not apply retroactively. This means President Trump, currently serving his second term, would not be affected. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"President Donald Trump slammed Sen. Josh Hawley for siding with Democrats to advance a stock trading ban for elected officials. The bill, which includes the president and vice president, passed 8–7. Trump called it sabotage after Hawley opposed GOP amendments to exempt presidents and investigate Rep. Nancy Pelosi’s stock history.","url":"https://www.timesnownews.com/world/us/us-news/trump-attacks-close-ally-josh-hawley-over-congressional-trading-ban-bill-very-much-like-sabotage-article-152377782","image":"https://images.timesnownews.com/thumb/msid-152377787,thumbsize-1284735,width-1280,height-720,resizemode-75/152377787.jpg","video":null,"publish_date":"2025-07-31 00:04:50","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.208},{"id":346772856,"title":"‘South Park’ Episode Ridiculing Trump Draws 5.9 Million Viewers","text":"A promotional image for the Season 27 debut of 'South Park' on Comedy Central\nComedy Central\n\nComedy Central’s South Park has had a very good month, with the long-running show’s Season 27 premiere drawing a total audience of 5.9 million viewers, according to Paramount, which streams the show on Comedy Central and Paramount+. It marks South Park’s biggest premiere episode since 1999, fueled in part by the significant buzz the episode generated with its mockery of Donald Trump and Comedy Central’s parent company, Paramount Global.\n\nIn the premiere episode, titled “Sermon on the ‘Mount,\" Trump is seen in bed with the Devil, and wielding his power to arrest and sue his enemies. The episode is noteworthy as it comes just days after the approval of a merger between Paramount and Skydance, which South Park creators Trey Parker and Matt Stone suggested led to a delay in the show’s premiere date.\n\nShow creators Matt Stone and Trey Parker tear into the Paramount Skydance merger\n\n“In response to the press release from Comedy Central about the change in premiere date for South Park,\" said a statement posted to the show’s page on X, \"Trey Parker and Matt Stone said – ‘This merger is a s--- show and it’s f---ing up South Park. We are at the studio working on new episodes and we hope the fans get to see them somehow.’”\n\nThe White House was unimpressed with the Trump-focused episode, with spokesperson Taylor Rogers telling multiple outlets the show “hasn’t been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention.”\n\nMORE FOR YOU\n\nThe show’s merciless ridicule of Trump--which included graphic taunts about the president’s manhood--comes as the fallout from the $8 billion Paramount and Skydance merger included an agreement that Paramount would pay $16 million to settle a lawsuit brought by Trump over a 60 Minutes interview with Kamala Harris and a concession that CBS install a “bias monitor” at the network.\n\nCBS also announced it would cancel its decades-long franchise in late night, The Late Show with Stephen Colbert, citing financial difficulties in continuing production of the show. The timing of the decision led many to suggest the decision to cut Colbert was likely related to the hosts frequent jokes made about the president.\n\nNew York, USA - JULY 21: Dozens of anti-Trump protesters gathered outside the Ed Sullivan Theater, home of The Late Show with Stephen Colbert, to protest CBS's reported decision to fire the longtime host. Demonstrators held signs and chanted in support of Colbert, blaming political pressure and criticizing the network's move as a blow to free speech and satire. The protest came shortly after rumors surfaced that Colbert's termination was linked to his outspoken criticism of President Donald Trump. (Photo by Lokman Vural Elibol/Anadolu via Getty Images)\nAnadolu via Getty Images\n\n‘Cowardly capitulation that could set a dangerous precedent’\n\nIn an interview with PBS, FCC Commissioner Anna Gomez, the lone dissenting vote in the 2-1 FCC vote to approve the merger, described as “cowardly capitulation that could set a dangerous precedent, reshaping the future of entertainment, while eroding the freedom of the press.”\n\nNo such capitulation coming from South Park, it would seem. On the heels of its season premiere--which generated huge traffic on YouTube for its Trump segments--a trailer for the second episode shows that the show isn’t done with the president just yet, showing Trump sharing a dinner with Satan, and rubbing his leg under the table.\n\nEditorial StandardsReprints & Permissions","summary":"It's the long-running show's biggest premiere since 1999, fueled by segments ridiculing Donald Trump.","url":"https://www.forbes.com/sites/markjoyella/2025/07/30/south-park-episode-ridiculing-trump-draws-59-million-viewers/","image":"https://imageio.forbes.com/specials-images/imageserve/688aa995febdb969b9d11ce9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-07-31 00:02:46","author":"Mark Joyella,Senior Contributor","authors":["Mark Joyella","Senior Contributor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.025},{"id":346766276,"title":"Anti-Trump NY Times columnist admits president is 'much more successful' than expected","text":"New York Times columnist and longtime critic of President Donald Trump, Bret Stephens, admitted that the Trump administration is having more success than he expected. In a column published Tuesday, Stephens marveled at Trump’s recent slew of successes, saying that the president’s term has had a better turn since his first 100 days in office. \"Egads! After a disastrous first 100 days, Donald Trump is starting to have a much more successful presidency. This is not what we, his foam-at-the-mouth critics, had planned or perhaps secretly hoped for,\" he wrote. MARK HALPERIN: DEMOCRATS TRY TO CONSTRUCT A FRANKENSTEIN CANDIDATE WHILE JD VANCE GAINS MOMENTUM FOR 2028 Stephens, who's described himself as a \"Never Trump conservative,\" listed Trump’s accomplishments – and pointed out whether he’s achieved them through good policy or sheer luck. Among Trump’s positive policies, the columnist pointed to Trump getting NATO countries on board with increased defense spending. \"Far from destroying the Atlantic alliance, as his critics feared, Trump may wind up being remembered for reviving and rebalancing it, to the advantage of both sides,\" he added. He even praised Trump for \"courageous policy.\" Namely, the bombing of Iran’s nuclear facilities last month. \"Joining Israel in its strikes on Iran, which Trump carried out in the teeth of political resistance from parts of his own base, did not lead us into a calamitous Middle East war, though Tehran may yet seek retaliation. Instead, it helped bring the war between Israel and Iran to a swift end,\" he said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The columnist went on to encourage Trump’s adapted policy on the Russia-Ukraine war, stating, \"Speeding the delivery of arms to Ukraine, after Trump’s disastrous initial pressure campaign on Ukraine backfired by emboldening Vladimir Putin, is the only way to end the war.\" He also praised Trump’s immigration policy, though he noted it is \"good policy that’s gone too far\" in terms of its enforcement. Additionally, Stephens expressed some relief that trade deals Trump recently secured with the European Union and Japan did not lead to worse outcomes than they did. Despite noting there are \"many unbeautiful parts\" to Trump’s $3.3 trillion spending package that was passed in early July, the columnist admitted it was a \"needed\" political victory for the president. COLUMBIA PROFESSORS DEMAND ANSWERS AS WHITE HOUSE FINALIZES NEGOTIATIONS WITH IVY LEAGUE UNIVERSITY He also noted that Trump’s legal shakedown of Columbia University for antisemitism on its campus – while not the way to go about it – did yield results. Stephens, who wrote last year he no longer considers himself \"Never Trump\" because the movement was too dogmatic, said Trump's recent successes were a valuable lesson to his critics. \"If Trump’s opponents want to someday be effective — and let’s face it, we haven’t been — then we have to come to grips with realities that have so far eluded us. Such as: Not everything Trump does is bad,\" he wrote. The White House did not immediately reply to Fox News Digital's request for comment. CLICK HERE TO GET THE FOX NEWS APP","summary":"Trump critic Bret Stephens acknowledged President Trump&apos;s accomplishments including NATO spending, Iran strikes, immigration policy and economic growth in new column.","url":"https://www.foxnews.com/media/anti-trump-ny-times-columnist-admits-president-much-more-successful-than-expected","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/president-trump-winning.jpg","video":"https://www.foxnews.com/video/6376335117112","publish_date":"2025-07-31 00:00:29","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","category":"politics","source_country":"us","sentiment":0.008},{"id":346765122,"title":"Brown University strikes $50m deal to end Trump administration pressure","text":"Brown University has become the third Ivy League campus to reach a deal with the administration of United States President Donald Trump, in a bid to restore frozen federal funding.\n\nThe agreement, announced on Wednesday, is the latest instance of an elite US school bargaining with the president and acceding to his demands.\n\nAs part of the deal, Brown will pay $50m over 10 years to improve Rhode Island’s workforce development programmes. It will also commit to supporting its local Jewish community and restricting its acknowledgement of transgender students.\n\nThe agreement comes amid a wider campaign by the Trump administration to withhold federal funds from elite universities in an effort to stem “woke” ideology and combat anti-Semitism.\n\nOpponents say the administration’s efforts are politically motivated and out of step with reality, but have acknowledged that many administrators feel they have little choice but to acquiesce amid the funding pressures.\n\nEarlier this month, the University of Pennsylvania and Columbia University both inked their own deals with Trump.\n\nThe University of Pennsylvania agreed to comply with Trump’s stance on transgender athletes, but Columbia was forced to pay a settlement of $200m, in addition to complying with several demands about admission and hiring.\n\nHis administration had severed funds and opened investigations into both schools, as it has with Brown as well.\n\nIn a statement, Brown President Christina Paxson said her school’s deal preserves its academic independence.\n\nShe highlighted a clause that says the government cannot dictate curriculum or the content of academic speech at Brown.\n\n“The University’s foremost priority throughout discussions with the government was remaining true to our academic mission, our core values and who we are as a community at Brown,” Paxson said in a statement.\n\nStill, the agreement includes many similarities to the controversial Columbia University deal, including measures to address alleged anti-Semitism following widespread protests against Israel’s war in Gaza.\n\nAdvocates have accused the Trump administration of intentionally mischaracterising the demonstrations to silence pro-Palestine voices.\n\nAs part of the new deal, Brown will be required “to support a thriving Jewish community, research and education about Israel, and a robust Program in Judaic Studies”.\n\nIt will also have to conduct a survey to ensure a welcoming campus climate, including for Jewish students and faculty.\n\nIn addition, the deal reflects other Trump priorities, including his opposition to the inclusion of transgender people in campus housing and sports teams that reflect their gender identity.\n\nTrump issued an executive order on January 20 saying that his government would only recognise two sexes, male and female, rejecting transgender identity altogether.\n\nThe president has also attempted to stamp out diversity initiatives, accusing them of being inherently discriminatory.\n\nIn his government’s agreement with Brown, the school agreed to provide a trove of data on the race, grades and standardised test scores of students who apply and are admitted to the university for a “comprehensive audit”.\n\nThe deal further bans Brown from using any “proxy for racial admission”, such as personal statements or “diversity narratives”.\n\nBrown did, however, dodge a demand imposed on Columbia that would see an independent monitor appointed to ensure compliance with the deal.\n\nIn a statement, Education Secretary Linda McMahon said the agreement showed the Trump administration was “successfully reversing the decades-long woke-capture of our nation’s higher education institutions”.\n\nWhile Brown will pay $50m into workforce development in its home state of Rhode Island, the Trump administration is slated to pay $50m in unpaid federal grant costs as part of the deal.\n\nThe Trump administration had been projected to withhold nearly $510m in grants and research funding from the school.\n\nThe president remains locked in a standoff with Harvard University, with administrators reportedly signalling this week that they were open to spending up to $500m to reach a deal.","summary":"Trump has withheld hundreds of millions in federal funds from top universities in effort to reshape US higher education.","url":"https://www.aljazeera.com/news/2025/7/30/brown-university-strikes-50m-deal-to-end-trump-administration-pressure?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/07/AP25211755105865-1753914430.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-07-30 23:59:40","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.106},{"id":346771850,"title":"MSNBC Democrats mock Cory Booker’s ‘political theater’ stunt on the Senate floor","text":"Democratic MSNBC panelists mocked Sen. Cory Booker, D-N.J., on Wednesday for his recent grandstanding behavior on the Senate floor, arguing it was more about boosting his public image rather than solving problems. \n\nBooker accused his fellow Democratic senators on Tuesday of aligning themselves with Trump because they are in favor of passing new police legislation. \n\nHe claimed that without amendments, the legislation would allow the president to pick winners and losers in terms of who receives the benefits. \n\n“That is complicity with an authoritarian leader who is trashing our country,” Booker said. \n\n“It is time for Democrats to have a backbone. It’s time for us to fight. It’s time for us to draw a line, and when it comes to the safety of my state being denied these grants, that’s why I’m standing here.”\n\nPanelists of MSNBC’s “Morning Joe” were not impressed.\n\n“Well, it’s great theater that we just saw. Cory Booker, a good guy, standing up and yelling on the floor of the United States Senate,” MSNBC contributor Mike Barnicle said on Wednesday. \n\n“What I don’t understand is he’s yelling at two other Democrats. The Democrats have enough problems in this country defining themselves to people, making sure people know they are alive, they are interested in your life, they are interested in you, solving problems.”\n\nMSNBC analyst and former Democratic senator Claire McCaskill argued that Booker is simply playing to the desires of the Democratic Party’s base.\n\n“Here’s what’s going on. The Democratic base is starving for a fighter. They’re starving for a fight,” she said. \n\n“They want people to fight Donald Trump, because everyone is so frustrated and angry and depressed at everything he’s doing and how he’s doing it, and the cowardice of the Republicans across the aisle in the Senate who are knowingly doing terrible things and casting votes that I would never dreamt they would have cast, when I was serving with them in the Senate.”\n\nBut there’s another key aspect to this as well, she said, defending Democrats like Sen. Amy Klobuchar, D-Minn., as people trying to do the best they can under the Trump administration.\n\n“On the other side, you have Cory Booker unfairly criticizing two strong Democrats that are doing everything they can in their power to fight Donald Trump. And, you know, Amy’s right. There’s a way to change a bill. And then there’s a way to get in the opening segment of ‘Morning Joe’ and on the front page of The New York Times. And Cory chose the latter, rather than the former,” she said. \n\n“He knew if he did this, it would be a viral moment, and he would be associated with Democrats who are willing to fight.”\n\n“Meanwhile, this bill didn’t impact funding, and there probably was not the leverage to do what Cory would like to do, which is defy Donald Trump, because we don’t have the votes in the Senate,” McCaskill said.\n\nShe later added, “Cory knows we don’t have the votes in the Senate to do what the base wants us to do. So the way he criticized his colleagues is really unusual, kind of unheard of, and frankly, to me, a little worrisome, with what we have in front of us and the fights we have to — the Democratic Party needs to wage next year in the midterms.”\n\nFox News’ Alec Schemmel contributed to this report.","summary":"Democratic MSNBC panelists mocked Sen. Cory Booker on Wednesday for his recent grandstanding behavior on the Senate floor, arguing it was more about boosting his public image rather than solving problems.","url":"https://nypost.com/2025/07/30/media/msnbc-democrats-mock-cory-bookers-political-theater-stunt-on-the-senate-floor/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/www-msnbc-com-morning-joe-108995452.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2025-07-30 23:59:09","author":"Alec Schemmel,Fox News","authors":["Alec Schemmel","Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.272},{"id":346772948,"title":"Trump hits Brazil with tariffs, sanctions but key sectors excluded - Reuters","text":"SummaryCompaniesTariffs imposed over prosecution of BolsonaroOver half of Brazilian exports have 50% tariff from August 6Aircraft, energy and others on lower tariff\n\nSAO PAULO/BRASILIA, July 30 (Reuters) - U.S. President Donald Trump on Wednesday slapped a 50% tariff on most Brazilian goods to fight what he has called a \"witch hunt\" against former President Jair Bolsonaro, but softened the blow by excluding sectors such as aircraft, energy and orange juice from heavier levies.\n\nTrump announced the tariffs, some of the steepest levied on any economy in the U.S. trade war, as his administration also unveiled sanctions on the Brazilian supreme court justice who has been overseeing Bolsonaro's trial on charges of plotting a coup.\n\nAdvertisement · Scroll to continue\n\n\"Alexandre de Moraes has taken it upon himself to be judge and jury in an unlawful witch hunt against U.S. and Brazilian citizens and companies,\" Treasury Secretary Scott Bessent said in a statement.\n\nBessent said Moraes \"is responsible for an oppressive campaign of censorship, arbitrary detentions that violate human rights, and politicized prosecutions — including against former President Jair Bolsonaro.\"\n\nLast week, the Brazilian justice levied search warrants and restraining orders against Bolsonaro over allegations he courted Trump's interference in his criminal case, in which he is accused of plotting to stop President Luiz Inacio Lula da Silva from taking office in 2023.\n\nAdvertisement · Scroll to continue\n\nTrump's final tariff order and the sanctions followed weeks of sparring with Lula, who has likened the U.S. president, a close ideological ally of Bolsonaro's, to an unwanted \"emperor.\"\n\nOn Wednesday, Lula and his government closed ranks behind Moraes, calling the U.S. sanctions \"unacceptable.\"\n\n\"The Brazilian government considers the use of political arguments to defend the trade measures announced by the U.S. government against Brazilian exports to be unjustifiable,\" it said in a statement.\n\nLula added that Brazil was willing to negotiate trade with the U.S., but that it would not give up on the tools it had at hand to defend itself, hinting that retaliation was possible.\n\nStill, Trump's tariff order threatened that if Brazil were to retaliate, the U.S. would also up the ante.\n\nDIPLOMACY AT WORK\n\nDespite Trump's effort to use the tariffs to alter the trajectory of a pivotal criminal trial, the range of exemptions came as a relief for many in Brasilia, who since Trump announced the tariff earlier this month had been urging protections for major exporters caught in the crossfire.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV600299 \nAbout ConnatixV600299 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\n\"We're not facing the worst-case scenario,\" Brazilian Treasury Secretary Rogerio Ceron told reporters.\n\nThe new tariffs will go into effect on August 6, not on Friday as Trump announced originally.\n\nTrump's executive order formalizing a 50% tariff excluded dozens of key Brazilian exports to the United States, including civil aircraft, pig iron, precious metals, wood pulp, energy and fertilizers.\n\nPlanemaker Embraer (EMBR3.SA), opens new tab, whose chief executive has met with officials in Washington and U.S. clients in recent days to plead its case for relief, said an initial review indicated that a 10% tariff imposed by Trump in April remains in place, with the exclusion applying to the additional 40%.\n\nThe exceptions are likely a response to concerns from U.S. companies, rather than a step back from Trump's efforts to influence Brazilian politics, said Rafael Favetti, a partner at political consultancy Fatto Inteligencia Politica in Brasilia.\n\n\"This also shows that Brazilian diplomacy did its work correctly by working to raise awareness among U.S. companies,\" he said.\n\nBrazil's minister of foreign affairs, Mauro Vieira, said he met with U.S. Secretary of State Marco Rubio on Wednesday to express the nation's willingness to discuss tariffs after negotiations stalled in June, though he stressed Bolsonaro's legal troubles were not up for debate.\n\nIt remains unclear what Brazilian authorities \"are bringing to the negotiating table to, for instance, open the domestic market,\" Goldman Sachs said in a note to clients.\n\nIMPACT SMALLER THAN EXPECTED\n\nThe effective tariff rate on Brazilian shipments to the U.S. should be around 30.8%, lower than previously expected due to the exemptions, according to Goldman.\n\nOil shipments to the U.S., which had been suspended, are set to restart after being spared, lobby group IBP said. Meanwhile, mining lobby Ibram said the exemptions covered 75% of mining exports.\n\nHowever, it was still too soon to celebrate, said former Brazilian trade secretary Welber Barral, estimating that Brazil exports some 3,000 different products to the United States.\n\n\"There will be an impact,\" Barral said.\n\nTrump's tariff exemptions did not shield two of Brazil's key exports to the U.S., beef and coffee.\n\nMeatpackers expect to log $1 billion in losses in the second half of the year on the new tariffs, lobby group Abiec, which represents beef producers including JBS and Marfrig (MRFG3.SA), opens new tab, said.\n\nCoffee exporters will also continue to push for exemptions, they said in a statement.\n\nThe government said it was readying measures to protect Brazil's businesses and workers.\n\nIf Brazil were to retaliate against Trump's measures, that \"would generate a larger negative impact\" on activity and inflation, Goldman said.\n\n\"The political inclination may be to retaliate, but exporters and business associations have been urging the Brazilian administration to engage, negotiate and de-escalate.\"\n\nReporting by Luciana Magalhaes, Gabriel Araujo and Ana Mano in Sao Paulo, Lisandra Paraguassu and Marcela Ayres in Brasilia, Ismail Shakil in Ottawa, and Kanishka Singh in Washington; Writing by Manuela Andreoni and Kylie Madry; Editing by Brad Haynes, Rosalba O'Brien and Michael Perry\n\nPurchase Licensing Rights","summary":"Trump hits Brazil with tariffs, sanctions but key sectors excluded  Reuters","url":"https://www.reuters.com/world/americas/trump-hits-brazil-with-tariffs-sanctions-key-sectors-excluded-2025-07-30/","image":"https://www.reuters.com/resizer/v2/PRFAKKZTE5LQLHUHPRHUUCTRRU.jpg?auth=0ba7d3dfe1e1b3268868848c61032f038e8bcf00ef0165698c42da0933afb5e5&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-30 23:59:02","author":"Lisandra Paraguassu,Luciana Magalhaes","authors":["Lisandra Paraguassu","Luciana Magalhaes"],"language":"en","source_country":"gb","sentiment":-0.138},{"id":346772564,"title":"Donald Trump Announces Pre-Deadline Trade Pact with South Korea","text":"President Donald Trump on Wednesday said a new trade agreement with South Korea includes a set, 15 percent tariff on the country's exports to the United States.As part of the deal, announced ahead of Friday's tariff deadline, South Korea has committed to purchasing $100 billion in U.S. energy exports and allocating $350 billion for investments that Trump said would be \"owned and controlled by the United States, and selected by myself, as president.\"Trump shared the news in a statement and on Truth Social, framing the agreement as a major win for American industry and energy producers. He also said that newly elected South Korean President Lee Jae-myung is expected to visit the White House in August.This is a breaking news story. Updates to follow.","summary":"President Trump also said that newly elected South Korean President Lee Jae-myung is expected to visit the White House in August.","url":"https://www.newsweek.com/donald-trump-announces-pre-deadline-trade-pact-south-korea-2106708","image":"https://d.newsweek.com/en/full/2693682/trump-hyundai-leaders.jpg?w=1600&h=900&q=88&f=ebada4ac89f2d135fa85255d75c716b3","video":null,"publish_date":"2025-07-30 23:56:48","author":"Gabe Whisnant,Robert Birsel","authors":["Gabe Whisnant","Robert Birsel"],"language":"en","category":"politics","source_country":"US","sentiment":0.26},{"id":346763276,"title":"Virginia city councilman set on fire by man who dumped bucket of petrol on him","text":"Danville City Councilman Lee Vogler was allegedly set on fire after Shotsie Michael Buck Hayes, 29, barged into Showcase Magazine, a local monthly publication, and dumped a five-gallon (19-litre) bucket of gasoline on the politician around 11.30am, according to the Danville Police Department and the outlet’s publisher, Andrew Brooks.\n\nMr Vogler, 38, managed to escape the office and ran to the front of the building, but Hayes followed him and torched him.\n\n“This type of senseless act of violence has to stop,” Mr Brooks said in an emotional video published on Facebook on Wednesday morning, where he described the horrifying moment Hayes “forced his way” into their offices and drenched the councilman with the fire accelerant.\n\n“You do not have the right as a human being to get upset with someone enough to lash out and attempt to harm them in any way, much less this way.”\n\nFirst responders rendered aid to the politician, who identified his suspected attacker at the harrowing scene, before he was airlifted to a hospital in North Carolina.\n\nThe extent of Mr Vogler’s injuries is unknown, but Mr Brooks noted he was awake and talking following the terrifying incident and was being taken to a burn centre in Lynchburg.\n\nHayes, a Danville resident, initially fled the horrific scene and was captured in his vehicle several blocks from where he allegedly lit the local politician ablaze, according to police.\n\nAuthorities said Mr Vogler and Hayes are known to each other, but added the attack stems from a personal matter that is not related to the councilman’s elected position or political affiliation.\n\nThe alleged arsonist has been charged with first-degree murder and aggravated malicious wounding, police said.\n\nHe is being held without bond at the Danville City Jail. \n\nThe investigation is ongoing.\n\n“Our prayers go out to Danville City Councilman Lee Vogler who was violently attacked at his workplace earlier today,” Virginia Governor Glenn Youngkin posted on X.\n\n“We pray for a swift recovery Lee and for peace to be on the entire Danville community.”\n\nMr Vogler was elected to the Danville City Council in May 2012, becoming the youngest person ever elected to that position at the age of 24, according to his bio.\n\nThe four-term councilman graduated from Virginia Commonwealth University in 2010 with a bachelor’s degree in political science and is the managing partner for Andrew Brooks Media Group.\n\nHe also serves on the Virginia Small Business Commission, a position Mr Youngkin appointed him to in July 2022, according to Mr Vogler’s LinkedIn.\n\nWednesday’s attack is the latest in a disturbing wave of violence targeting elected officials, including President Donald Trump, who narrowly escaped death when a would-be assassin fired at him during a 2024 campaign rally in Butler, Pennsylvania. The then-candidate was struck in the ear before the 20-year-old gunman was taken out by a Secret Service sniper.\n\nLast month, former Minnesota Democratic House Speaker Melissa Hortman, her husband Mark and beloved family dog, Gilbert, were gunned down and killed in their Minneapolis home in a twisted, politically motivated attack. Alleged assassin, Vance Boelter, is also accused of shooting state Senator John Hoffman and his wife, Yvette, who both survived.\n\nPennsylvania Governor Josh Shapiro’s home was firebombed overnight during Passover in April by an attacker allegedly motivated by antisemitism while the Jewish politician and his family slept.\n\nDemocratic Michigan Governor Gretchen Whitmer was also the victim of a domestic terror scheme aimed at abducting the politician and overthrowing the state government in 2020.\n\nThis article originally appeared on NY Post and was reproduced with permission","summary":"A councilman in the US has been set on fire by a man who stormed into his workplace carrying a bucket of fuel, in the latest sickening attack against an elected official.","url":"https://www.news.com.au/world/north-america/us-politics/virginia-city-councilman-set-on-fire-by-man-who-dumped-bucket-of-petrol-on-him/news-story/aa0b35448a4a1a9c61ad08c0c14e3148?from=rss-basic","image":"https://content.api.news/v3/images/bin/4e28be1494f6b54d52d9be14fb4c092f","video":null,"publish_date":"2025-07-30 23:54:42","author":"Anthony Blair","authors":["Anthony Blair"],"language":"en","category":"politics","source_country":"au","sentiment":-0.359},{"id":346763278,"title":"US politics live: Kamala Harris’ major election announcement","text":"The prospect of Australia getting a decent trade deal with the US are looking dimmer with Donald Trump signalling he is determined to put in place tariffs of potentially as high as 20 per cent on nations that haven’t finalised an agreement with Washington hy Friday. \n\nThe US President on Wednesday, US time, said the August 1 deadline for tariffs “will not be extended”.\n\nTo get all the latest news from US President Donald Trump and what it means for Australia as soon as it drops — download the news.com.au app direct to your phone.\n\nAustralia was initially set to have a 10 per cent “baseline tariff”. But in recent days, Mr Trump has suggested that “baseline” could be as high as 15 or 20 per cent. \n\nOn Wednesday, he said India could be whacked with a 25 per cent tariff and an unknown “penalty” for doing so much trade with China and Russia. \n\nIn the US itself, Kamala Harris has said she won’t stand for California Governor. That does, however, open up the possibility of her standing for president once again in 2028. \n\nThe Federal Reserve has again kept interest rates on hold which is sure to infuriate Mr Trump and reignite the campaign against the Central Bank’s chair Jerome Powell. \n\nBut there are signs the Fed could well cut rates soon. \n\nMeanwhile, the Democrats have been trying to use a little known and rarely used law to force the White House to publish the so-called “Epstein files”.\n\nRead on for more updates.","summary":"Former US vice president and 2024 presidential candidate Kamala Harris has made a huge call on her future. Follow our live coverage.","url":"https://www.news.com.au/world/north-america/us-politics/us-politics-live/live-coverage/538d4d10648fe66aec0ddf6ba30cc2e5?from=rss-basic","image":"https://content.api.news/v3/images/bin/21b63830414589a2d12d0e6ffc912a77","video":null,"publish_date":"2025-07-30 23:54:42","author":"Benedict Brook In The Us","authors":["Benedict Brook In The Us"],"language":"en","category":"politics","source_country":"au","sentiment":-0.575},{"id":346772940,"title":"Samsung Q2 profit drops 55% on weak AI chip sales, China curbs - Reuters","text":"SummaryCompaniesChip profit slumps to 400 billion won from 6.5 trillion won a year earlierSamsung sees market gradually improving in second halfForecasts robust AI-driven demand backed by continued investment by major cloud service providers\n\nSEOUL, July 31 (Reuters) - Samsung Electronics (005930.KS), opens new tab forecast a gradual second-half recovery for its chips business after second-quarter operating profit at the division plunged 94% from a year earlier due to shipment delays and U.S. export curbs on advanced semiconductor sales to China.\n\nThe South Korean tech giant said on Thursday it expected the industry environment would improve in the second half, driven by artificial intelligence demand due to continued investments by major cloud service providers.\n\nAdvertisement · Scroll to continue\n\nBut hours after U.S. President Donald Trump announced he would place 15% tariffs on South Korean goods, Samsung added there were concerns about slowing global growth due to an uncertain trade environment and geopolitical risks.\n\nThe world's largest memory chip maker posted 4.7 trillion won ($3.37 billion) in operating profit for the April-June period, its weakest in six quarters and roughly in line with an earlier estimate that had disappointed investors.\n\nIts revenue rose 0.7% to 74.6 trillion won, in line with its earlier estimate of 74 trillion won.\n\nSamsung's chip division posted a profit of 400 billion won during the quarter, down from 6.5 trillion won a year earlier, marking the first time in six quarters that the figure has dropped below the 1 trillion won mark.\n\nAdvertisement · Scroll to continue\n\nSamsung said in a statement that inventory value adjustments to memory chips and one-off costs from the impact of U.S. export restrictions on sales to China on its contract chipmaking business lowered the division's profit.\n\nProlonged weakness in its financial performance has deepened investor concerns over the South Korean tech giant's ability to catch up with smaller rivals in developing high-bandwidth memory chips sold to customers including Nvidia (NVDA.O), opens new tab and used in AI data centres.\n\nBut Samsung reported earnings just days after Tesla (TSLA.O), opens new tab said it had signed a $16.5 billion deal to source chips from the tech giant, a move that could bolster the South Korean company's struggling foundry business that makes chips on contract.\n\nMajor tech companies Meta Platforms (META.O), opens new tab and Microsoft (MSFT.O), opens new tab on Wednesday pointed to strong AI chip demand and major investments in data centres in their earnings announcements.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV600299 \nAbout ConnatixV600299 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nShares of Samsung were up 0.7% in the morning trade, in line with the benchmark KOSPI's (.KS11), opens new tab 0.7% rise.\n\n($1 = 1,393.4100 won)\n\nReporting by Heekyong Yang and Joyce Lee and Hyunjoo Jin; Editing by Jamie Freed\n\nPurchase Licensing Rights","summary":"Samsung Q2 profit drops 55% on weak AI chip sales, China curbs  Reuters","url":"https://www.reuters.com/world/china/samsung-predicts-gradual-second-half-recovery-after-q2-chip-profits-plunge-94-2025-07-30/","image":"https://www.reuters.com/resizer/v2/ETNEFY4ZDRI5PE7WRP7MRAT4BQ.jpg?auth=a1e1bb61572f63cb0986cadbc6ed0d192b13e6cb2355c1d0ee90b8954ec9ab79&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-30 23:54:18","author":"Heekyong Yang,Hyunjoo Jin,Joyce Lee","authors":["Heekyong Yang","Hyunjoo Jin","Joyce Lee"],"language":"en","source_country":"gb","sentiment":-0.279},{"id":346761978,"title":"Love Island viewers criticise producers for 'breaking the fourth wall' as they allow Blu to reveal drama from his time on the outside","text":"Black Friday\n\nBritain's Got Talent\n\nCelebrity Big Brother\n\nPrivacy Policy\n\nWednesday, Jul 30th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nLove Island viewers criticise producers for 'breaking the fourth wall' as they allow Blu to reveal drama from his time on the outside\n\nHave YOU got a story? Email tips@dailymail.co.uk\nBy LAURA PARKIN \n Published:23:06 BST, 30 July 2025 |Updated:00:47 BST, 31 July 2025 \n\nLove Island viewers criticised the producers for 'breaking the fourth wall' during Wednesday's episode when they allowed Blu to discuss the outside. \nIn a shock twist former contestants Blu and Megan re-entered the villa last week despite being dumped and fans of the show aren't happy. \nUpon his return, Blu wasted no time in revealing drama from his time on the outside and relayed information to the boys. \nDejon was speaking to Blu and Harry about Megan and said: 'You know how much I love Megan but I just feel like the first time Megan came in compared to this time is completely different.'\nBlu asked: 'Is that because she’s been on the outside?' \nHe then went on to reveal what had happened during their time back at home and explained: 'Megan and Tommy were speaking before they came in here. I've heard it.'\n\nLove Island viewers criticised the producers for 'breaking the fourth wall' during Wednesday's episode when they allowed Blu to discuss the outside\n\nIn a shock twist former contestants Blu and Megan re-entered the villa last week despite being dumped and fans of the show aren't happy\nBlue continued: 'When Tommy and Lucy were in Tape [London club], cracking on... she was fuming.'\nDejon asked: 'Connor is our boy man, it's such a hard situation to be in. Don't you think we should tell him?' \nHarry agreed and added: 'We have to chat with Con, mate.'\nMegan and Conor's relationship was cut short when she was dumped but her return saw them reunite. \nGoing over to chat with Connor, Harry passed on the news and said: 'Lucy was getting with Tommy and Megan was behind and she was fuming.'\nConnor questioned: 'Fuming that Lucy and Tommy were getting together?' \nBlu added: 'She's going to tell you that it's a lie and come at me but that is what I saw.' \nFans at home were left furious over the conversation and aired their feelings on X: 'This is why producers shouldn’t bring back previous islanders…';\n\nUpon his return, Blu wasted no time in revealing drama from his time on the outside and relayed information about Megan to the boys\n\nBlue continued: 'When Tommy and Lucy were in Tape [London club], cracking on... Megan was fuming.'\n\nDejon asked: 'Connor is our boy man, it's such a hard situation to be in. Don't you think we should tell him?'\n\nGoing over to chat with Connor, Harry (pictured) passed on the news and said: 'Lucy was getting with Tommy and Megan was behind and she was fuming'\n\nMegan and Conor's relationship was cut short when she was dumped but her return saw them reunite this week\nOthers shared: 'Nooo this needs to be like Big Brother, if you're talking about what you know on the outside you need to be dumped. Get Blu gone'; 'I don’t like this outside intel'; \n'Producers allowing Blu to give away the whole dynamic??'; 'No because doesn’t that fully defeat the entire purpose of the show??';\n'Surely there’s some sort of policy/contract breaking here Blu telling the opinions and info from the outside people shouldn’t be allowed to be brought back after being dumped!!!' \nLove Island fans have already accused Blu of '‘stirring drama’ to get more 'air time' as the final approaches.\nThe former dumped Islander returned to the villa on Tuesday alongside Megan after being the second contestant to leave the show earlier in the season.\nDuring Friday night's episode, the Spanish lad had plenty to say about Toni during the infamous Grafties.\nAs part of the game, a clip was shown of Cach - who Toni had previously split from to pursue things with Harrison - crying on the terrace.\n\nFans at home were left furious over the conversation and aired their feelings on X: 'This is why producers shouldn’t bring back previous islanders…'\nAfter the clip was shown, Blu turned to Toni and said: 'Did you see what you did to Cach?'\nToni quickly responded: 'Shut the f* up, talk about situations that you've been here for.'\nBlu hit back: 'What you on about? I am here now, so I can speak if I want to.'\nYasmin then jumped in to defend Toni, saying: 'She was upset about that though, she was crying about that too. She wasn't heartless about it — she was genuinely really upset.'\nAfter the game wrapped, Blu pulled Toni for a chat in the outside lounge.\n'I don't agree with what you said,' Blu began. 'Like, I have respect for you, but if I have something to say - my opinion - and then you have your opinion, which is completely fine, why are you being hypocritical?'\nToni replied: 'I just feel like you're involving yourself with something that has nothing to do with you.'\nBlue said: 'We're all sat around here, we all live in the same villa. I can have my own opinion - just like you always have your own opinion.'\nYou've been outside watching it,' Toni said.\n'Exactly,' Blu fired back before Toni continued: 'You know how I felt. You saw me sit there crying. When I apologised to Cach, was I not up on the terrace bawling my eyes out?'\n\nLove Island fans have already accused Blu of 'starting a row' to get more 'air time' as the final approaches\n\nAfter the game wrapped, Blu pulled Toni for a chat in the outside lounge\n\n'I don't agree with what you said,' Blu began. 'Like, I have respect for you, but if I have something to say - my opinion - and then you have your opinion, which is completely fine, why are you being hypocritical?'\n\nToni replied: 'I just feel like you're involving yourself with something that has nothing to do with you.'\n'\"Toni how do you feel?\" - you know how I felt. I don't understand what you want.'\n'You can make Cach cry and that's fine?' Blu said.\nToni responded: 'Did I ever say that it was fine?\nBlu responded: 'You've just done the same thing.'\nToni said: 'I'm not going to lie to you. I literally don't care about this conversation.'\nBlu dismissed her with: 'Pfft, all right... so I have the right to have my own opinion and voice my own opinion. What are you on about?'\n'Go for it. I don't care,' Toni added.\nBlu then said: 'OK cool, so don't tell me I can't put my two pence in when you're the one always putting your f*ing 50p in.'\n\n Love Island fans rage over Megan's return and raise concerns for Shakira's mental health \n'I still don't get what the point here is,' Toni question.\nBlu replied: 'Are you trying to belittle me or something? I'm pulling you here because I genuinely think you're a nice girl and I'm trying to, like, brush it under the f*ing bridge.'\nToni pushed back: 'Then why were you trying to get a reaction out of me? Did you want me to say I'm sorry again?'\nBlu replied: 'Can I not ask my question? I'm asking a question. So you can ask a question but I can't ask my question?'\nToni said: 'But I was involved.'\nBlu shot back: 'What are you on about? So? I'm involved now and I can ask my question.'\nAt that point, Toni stood up and walked away from the conversation.\nBlu muttered: 'You walk away when it's convenient for you to walk away - coz you know I'm fing right. Absolute fu**ing weirdo.'\n\nLOVE ISLAND 2025: MEET THE CONTESTANTS\n\nDejon Noel Williams\nNAME: Dejon Noel Williams\n\nFROM: London\nOCCUPATION: Semi-pro footballer and personal trainer\nWHAT ARE YOU LOOKING FOR? Someone who is beautiful on the inside and out, looks after themselves and is healthy\nCLAIM TO FAME? My dad being an ex-professional footballer. I've met all kinds of famous people through him. When I was younger it was weird because he was just my dad, but we'd go to a game and fans were asking for photos. I've met David Beckham, he was really nice.\n\nMegan Moore\nNAME: Megan Moore\n\nFROM: Southampton\nOCCUPATION: Payroll specialist\nWHAT ARE YOU LOOKING FOR? I'd like to meet someone who is tall, with a nice tan, nice eyes and a nice smile. He needs to have a good fashion sense and a really good, funny personality that I can get on with \nHOW WOULD YOU DESCRIBE YOUR LOVE LIFE? Bankrupt, right now. But we're going to make sales and get on that corporate ladder and be booming. Profits, profits, profits!\n\nHelena Ford\nNAME: Helena Ford\n\nFROM: London\nOCCUPATION: Cabin Crew\nWHAT ARE YOU LOOKING FOR? Somebody funny or Northern. I feel like Northern people have much more banter than Southerners. If you look through my previous dating history, you'll see I clearly go for personality. You can pretty much laugh me into bed.\nWOULD MAYA HIRE YOU FOR YOUR FLIRTING SKILLS? I would say hire but then quickly fire soon after. It would only be a temporary contract.\n\nShakira Khan\nNAME: Shakira Khan\n\nFROM: London\nOCCUPATION: Construction Project Manager\nWHAT ARE YOU LOOKING FOR? Someone who is tall, charming, witty, with big arms, a good smile and just really funny.\nHOW WOULD YOU DESCRIBE YOUR LOVE LIFE? Booming, but they're all frogs. It's a busy love life but I've not found 'the husband', I'm looking for 'the one'. I'm looking for the ring.\n\nHarry Cooksley\nNAME: Harry Cooksley \n\nFROM: Guildford\nOCCUPATION: Gold trader, semi-professional footballer and model\nWHAT ARE YOU LOOKING FOR? The girl next door that makes me laugh and can hold eye contact with me. I don't think I'd go for the most obvious girl, I like a real sweet girl. \nCLAIM TO FAME? I'm the body double for Declan Rice. So when he does a shoot, any body close ups will actually be me. You'll never see my face, but you'll see my shoulder or chest, that kind of thing.\n\nConor Phillips\nNAME: Conor Phillips\n\nFROM: Limerick\nOCCUPATION: Professional rugby player\nWHAT ARE YOU LOOKING FOR?Someone who is really sure of themselves, ambitious, a bit of a go-getter and good craic. I like dark eyes and I don't mind a dominant woman.\nWOULD MAYA HIRE YOU FOR YOUR FLIRTING SKILLS? Definitely hire. I ask girls if they want to go halves on a baby. It doesn't work, but it gets them laughing. It's an ice-breaker, not a serious question of course!\n\nToni Laites\nNAME: Toni Laites\n\nFROM: Connecticut \nOCCUPATION: Las Vegas Pool Cabana Server\nWHAT ARE YOU LOOKING FOR? I'm looking for darker hair, definitely muscular but not too muscular. Super fit. Clean hair cut. Someone that can make me laugh - I'm super outgoing. And someone that's quite active. Maybe one day we could start our own family together. \nI WANT TO DATE A BRITISH GUY BECAUSE... I've lived in three different states and I'm still single. It's time to try something new! I have some British friends and they're pretty charming. I think all Americans love a good accent. British men are just more polite, with better manners.\n\nNAME: Yasmin Pettet\n\nFROM: London\nOCCUPATION: Commercial Banking Executive\nWHAT ARE YOU LOOKING FOR? I'm looking for a guy who is fit, has a nice body and who is funny with a bit of banter.\nWHAT'S YOUR BIGGEST ICK? A guy that's stingy\n\nMegan Moore\nNAME: Megan Moore\n\nFROM: Dublin\nOCCUPATION: Musical theatre performer and energy broker\nWHAT ARE YOU LOOKING FOR?\nSomeone who doesn't take themselves too seriously and has a sense of humour. If they're not bad looking, that's always a plus. \nI love a boy that's a bit pasty, like Timothé e Chalamet. I don't mind scrawny, or a bit of a 'dad bod'. I'm 5ft1 so any height really.\nCLAIM TO FAME? Me and my friends made a Derry Girls TikTok for Halloween and it went a bit viral around Brighton. \nSometimes I get stopped in the street about it. I've also done Panto.\n\nBlu Chegini\nNAME: Blu Chegini\n\nFROM: London\nOCCUPATION: Construction Project Manager\nWHAT ARE YOU LOOKING FOR?\nSomeone who is family oriented, has a lot of love to give and a lot of love to receive. Personality goes a long way. \nWOULD MAYA HIRE YOU FOR YOUR FLIRTING SKILLS? She'd fire me, but I've got the charm to smooth things over with a girl. The fact I speak fluent Spanish comes in handy when it comes to flirting!\n\nNAME: Jamie Rhodes\n\nOCCUPATION: Electric Engineer \nWHAT ARE YOU LOOKING FOR? Bubbly, cheeky, outgoing, good face card and a nice bum. \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? I'll be in amongst the drama! It's a once in a lifetime opportunity, I'm gonna take it by the horns and go for it.\n\nNAME: Ty Isherwood\n\nOCCUPATION: Site Engineer \nWHAT ARE YOU LOOKING FOR? I go off energy, if we vibe. I've typically dated brunettes, tanned, nice teeth with a nice smile. \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? A head turner! I get along with lads easily and like to make people laugh.\n\nNAME: Cacherel 'Cach' Mercer\n\nOCCUPATION: Professional Dancer\nWHAT ARE YOU LOOKING FOR? Someone who's emotionally intelligent, beautiful, charismatic, caring, affectionate, and I'd say an intro extrovert. \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? I think I'm gonna get into trouble, I feel like I'll be the joker of the group! I'll also be the person people come to for advice… and a bit of eye candy at the same time.\n.........................................................................................................................\n\nNAME: Angel Swift\n\nOCCUPATION: Aesthetics Practitioner and Salon Owner\nWHAT ARE YOU LOOKING FOR? I'm ready to make memories with someone, go travelling with them and fall in love \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? I feel like people have been getting their heads turned very easily. I do feel like I have quite a good chance of turning someone's head.\n\nAdvertisement\n\nShare or comment on this article: \nLove Island viewers criticise producers for 'breaking the fourth wall' as they allow Blu to reveal drama from his time on the outside\n\nAdd comment\n\n Share what you think\n\nWorst rated\n\nThe comments below have not been moderated.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nMo Gilligan 'has fathered a secret love child after short-lived romance with a model - and is set to welcome another baby with his long-term girlfriend'\n\nBare it like Beckham! Playful Cruz Beckham has a laugh with his brother Romeo mimicking his dad's famous skimpy Speedo look on luxury yacht \n\nIs this what led Cat Deeley's marriage to breaking point? The mammoth £5M house renovation project in upmarket Hampstead that 'shocked' TV star \n\nThere's two things in Myleene Klass's cheating bombshell that don't make sense... and I know exactly why that is: LIZ JONES\n\nJenna Ortega stuns in a semi-sheer snakeskin gown while Catherine Zeta Jones rocks a backless dress as they join co-star Billie Piper at Wednesday series two premiere in London\n\nThe top-rated after sun that shoppers say keeps their tan glowing for WEEKS is on sale in limited-time deal: 'Makes my tan last longer'\n\nOzzy Osbourne's 'favourite child' Kelly makes touching tribute to her beloved father at heartbreaking funeral procession\n\nMeghan's new goldmine: Insiders tell ALISON BOSHOFF why her and Harry are set to make MORE money next year despite being 'horrible at making decisions' - but it's not all good news\n\nJessica Alba and new love Danny Ramirez take hot romance 'to the next level' as they are seen kissing\n\nThe anti-ageing beauty buy with a bizarre name that's delivering jaw-dropping results - users say it 'takes years off you within WEEKS' (and it's 15% off)\n\nLike father, like son! Supportive parents Wayne and Coleen Rooney watch their son Kai, 15, play for Manchester United in the Super Cup NI \n\nKENNEDY uncovers the true origin of Sydney Sweeney's 'Nazi' jeans ad... and it's not what the hysterical Left thinks it is\n\nLove Island viewers are left shocked at the biggest divide in show's history as tensions reach breaking point just days before finale\n\nYellowstone star claims he 'lost everything' after being ousted from Hollywood for shocking reason\n\nThis little-known skincare brand clears skin fast - and it's on sale: 'I FINALLY feel confident going makeup-free at the beach!'\n\nHow 'flirty' Katy Perry 'flattered' Justin Trudeau on pair's shock date after her Orlando Bloom split\n\nPals of Liam Neeson's late wife Natasha Richardson weigh in on Pamela Anderson romance\n\nAlec Baldwin's lawsuit against New Mexico prosecutors over 'malicious' Rust shooting prosecution is THROWN OUT\n\nJamie Lee Curtis reveals the real reason behind the 22-year wait for Freaky Friday sequel\n\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\n\nJessica Alba's ex Cash Warren, 46, has surprising reaction to her new romance with Danny Ramirez, 32\n\nOzzy Osbourne sent gut-wrenching final text to Black Sabbath guitarist before his death at 76\n\nOprah Winfrey hits back at claims she 'refused' to open her private road in Hawaii for people to escape following tsunami warnings\n\nShocking extent of Gwyneth Paltrow's privileged upbringing laid bare\n\nI want to stop renting and buy a place of my own. Where do I start?\n\nSam Faiers is branded 'irresponsible and naive by horrified' skin doctor after admitting her three children don't wear sunscreen\n\n'She was a presence, light, and life-changer': Emma Bunton and Tom Fletcher share emotional tributes to stage school pioneer Sylvia Young after her death at 86\n\nLove Island viewers criticise producers for 'breaking the fourth wall' as they allow Blu to reveal drama from his time on the outside\n\nGwyneth Paltrow's son Moses, 19, reveals if he is following in his dad Chris Martin's footsteps\n\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\n\nMeghan Markle launches ANOTHER product in her As Ever line... but customers may struggle to see what's new\n\nLeonardo DiCaprio comes under fierce fire for investing in luxury hotel in Israel\n\nLove Island viewers accuse Blu of 'begging for screentime' after he takes a brutal swipe at Toni in ANOTHER tense villa clash\n\nAdam Sandler reveals the secret to his 22-year 'very special' marriage to wife Jackie who appears in ALL his films\n\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\n\nEmmerdale couple confirm their wedding date with an array of loved-up snaps two years after romantic proposal\n\nFuture of Ben Affleck and Matt Damon's Hulk Hogan biopic revealed days after WWE icon's shock death\n\nPrincess Andre, 18, puts on a stylish display as she shares sunkissed snaps from her Mexican holiday\n\nSteve Buscemi is supported by rarely seen girlfriend Karen Ho at Wednesday series two premiere in London\n\nYour new life in the country: How to win this stunning £575k four-bed, with an Audi sports car thrown in!\nAdvertising\n\nJoanna Lumley embraces gothic glamour as she steps out in an elegant all-black ensemble at the Wednesday series two premiere in London\n\nEllen guest makes disturbing new bullying claims about disgraced former talk show host\n\nCat Deeley's sexy post split wardrobe revealed as star wows in racy summer outfits- here's where to shop her looks on the high street\n\nTV reality star, 32, embraces natural grey hair in new makeover - can you guess who it is?\n\nFancy a party in paradise? Two tickets for Centreforce's Tenerife Weekender 2025 are up for grabs\n\nX Factor winner to release first album in over ten years as they make huge return to the music industry\n\nGeorgia Toffolo addresses pregnancy speculation after confusing fans by teasing 'major news' with 'bump' picture and scan announcement\n\nPregnant Shaughna Phillips reveals her plans to have a c-section as she recalls 'traumatic' birth of daughter Lucia which saw her suffer a haemorrhage\n\nHacks star Jean Smart, 73, walks with a cane after knee surgery following a scary fall in NYC\n\nHow would you like to win £10,000 on this new prize platform?\n\nClaire Sweeney reveals shock injury as she shares photograph of her very bruised and swollen ankle\n\nSam Thompson reveals a glimpse of the plush house he shared with ex Zara McDermott as he gushes about why he 'loves' coming home\n\nInside Kate and William's mystery holiday Greek island: As Royals said to have been spotted off the coast, what they would have seen, done... and why it's perfect for little Princes and Princesses\n\nMeet the nepo baby with a very famous father who is forging an impressive career AWAY from Hollywood\n\nThe 'unbeatable' cell-signalling hair loss treatment that delivers results in SIX weeks: 'My hair line is filling in'\n\nMatthew McConaughey's role in apprehending sadistic murderer who gunned down young father resurfaces\n\nHarrison Ford, 83, shares he is glad Hollywood hires 'old guys' because he never wants to stop working\n\nJack Whitehall's fiancée Roxy Horner opens up about living with type 1 diabetes as she reunites with comedian in Corfu after 'months apart'\n\nKaia Gerber glows as she performs in Massachusetts... as ex Pete Davidson announces his girlfriend is pregnant\n\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\n\nA-List action star unrecognizable after shaving off his beard for first time in SIX YEARS but can you guess who?\n\nPamela Anderson, 58, looks flustered as she's seen for first time since news broke she's dating Liam Neeson, 73\n\nJenna Ortega smoulders in leather bralette while Catherine Zeta-Jones dazzles in a chic white suit as Wednesday cast unite for vampy portraits \n\nWatch as Coldstream Guards band pay touching tribute to Ozzy Osbourne with rendition of Black Sabbath's Paranoid\n\nYou could win a BMW M3 Touring, a VW Crafter Campervan & £10,000... for JUST 35p!\nAdvertising\n\nSharon Osbourne breaks down in tears at emotional funeral procession for Ozzy as she is joined by their children Jack, Kelly, and Aimee, his son Louis and THOUSANDS of Black Sabbath fan\n\nHulk Hogan felt 'embarrassed' at how fragile he'd become in his final weeks, WWE icon's friend reveals\n\nRoman Kemp reveals he's BANNED from interviewing beloved A-lister as their 'awkward and cringe' exchange resurfaces\n\nAmanda Holden, 54, flashes her peachy bottom in a windswept kaftan as she shares racy poolside snaps during her Greece getaway\n\nThe £30 perfume going viral for surprising effect on your mood: 'Made me feel energised'\n\nGregg Wallace launches private chat room just for middle-aged men in desperate bid to keep earning after he was sacked from MasterChef\n\nEveryone's talking about Pamela Anderson's makeup free appearance - here are the exact products behind her effortlessly natural look\n\nA Place In The Sun's Laura Hamilton, 43, hits back at cruel trolls insisting she is 'too old to wear a bikini' as she wows in stunning swimwear snap\n\nVogue Williams shows off her incredible physique during sunshine break in Spain as presenter models two bikinis while sharing 'big news' about her podcast\n\nThe brand behind the iconic Eight-Hour Cream has a huge sale with 25% off EVERYTHING (plus, how to get a £227 goody bag)\n\nBrooklyn Beckham gets back to the daily grind: Glum star accompanies wife Nicola on a family lunch after break on his in-laws' £85M superyacht \n\nThis teen is already acting in films, can you guess who her very famous model mother is?\n\nLulu makes heartfelt plea to grieving Sharon Osbourne on the day of Ozzy's funeral live on Lorraine - silencing host Christine Lampard\n\nJack P. Shepherd's wife Hanni Treweek admits she is a 'wreck' as she shares update on Italian honeymoon\n\nIs adaptogenic coffee the wellness upgrade YOU need? Our team put it to the test - here's what they really thought\n\nInside Ana de Armas' $7M love nest in Vermont where she is romancing Tom Cruise\n\nWe've got you mum: Emotional moment Jack and Kelly Osbourne cling on to mother Sharon as she almost collapses in grief while viewing floral tributes for Ozzy\n\nSir Michael Palin, 82, confesses he is preparing for the end of his life and has finalised his will following the devastating death of his wife Helen, 80\n\nI made a documentary so disturbing the government banned it from screens for 20 years before a major U-turn by BBC\n\nI swear I spotted Kate and William on a billionaire's superyacht off the coast of Greece... I have all the royal vacation gossip\n\nOzzy's family united in grief: Sharon, Kelly, Jack and Aimee are joined by Black Sabbath legend's grandchildren and son Louis from his first marriage\n\nLorraine Kelly's flattering floral Boden dress is perfect for summer - and it's selling out fast with 30% off\n\nBYOB: Bring your own bread! Richard Madeley whips out a crusty roll from his bag as he tucks into a bowl of soup during boozy pub lunch\n\nTom Cruise, 63, goes official with 'new love' Ana de Armas, 37, as they indulge in telling PDA on romantic getaway\n\nLove Island bombshell Billykiss Azeez reveals the one couple she believes stands NO chance of staying together beyond the show\n\nLinda Robson enjoys star-studded holiday with celebrity pals Bruno Tonioli, Lesley Joseph, Claire Sweeney and Charlie Brooks in Mallorca\n\nThe Sound Of Music star, 81, says he is lucky to be alive after suffering two heart attacks\n\nBrittany Cartwright claims estranged husband Jax Taylor 'threw a coffee table' at her during 'aggressive' fight\n\nLove Island spoilers: Shakira rages 'I can't stand you, we'll never speak on the outside!' at seething Meg as pair come to blows\n\nScott Wolf's son chimes in on ugly divorce as his mom tries to return to family home... after restraining order\n\nRising NBC News star Tom Llamas ruffles co-workers' feathers with 'challenging' management style\n\nOrlando Bloom's ex wife Miranda Kerr makes allegiance clear as she shares video of Katy Perry performing after the singer enjoyed a date with Justin Trudeau\n\nRevealed: Why Hulk Hogan's estranged daughter will receive nothing from wrestling legend's will\n\nPatrick Kielty's family tragedy: Irish comedian was just 16 when he lost his father in a horrific shooting - as star announces split from wife Cat Deeley\n\nLorraine overtakes This Morning in ITV ratings just months before show is ravaged by cuts as part of daytime telly bloodbath\n\nClarkson's Farm star Kaleb Cooper reveals his tractor and post knocker were STOLEN as he makes a desperate plea for help\n\nWhy Cat Deeley and Patrick Kielty REALLY split: Friends tell GRANT TUCKER truth about marriage, their 'separate lives' - and who presenter's now seeking comfort from \n\nEd Sheeran buys lavish £9M New York pad as singer adds to ever-growing property portfolio\n\nThis Morning guest lost for words as he learns life-changing value of his wrestling memorabilia live from car boot sale\n\nHow Katy Perry and Justin Trudeau suffered a remarkably similar fall from grace before unlikely friends were spotted dining in Canada\n\nAmber Heard is showered with support from fans ahead of final performance in Spirit Of The People - after star returned to acting following Depp trial\n\nPriscilla Presley, 80, is unrecognisable as she surfaces with pained look\n\nPrince Harry and Meghan Markle's $14 million Montecito mansion caught up in tsunami warning zone\n\nNewlyweds Eve Jobs and husband Harry Charles honeymoon with BOTH of their families as they buck tradition and opt for a group trip on late father Steve's £105M super yacht to Milos\n\nEverything to watch on Netflix in August, including the return of the most-watched programme ever\n\nAlice Evans shares post about her 'sad feelings' hours after Bianca Wallace accused her of inventing 'disgusting, vile story'\n\nColeen Rooney and husband Wayne arrive to support their son Kai as his team Manchester United take on Glasgow Rangers in Northern Ireland\n\nLila Moss and model aristocrat Lady Lola Bute slip into racy red negligees as they party in Ibiza\n\nFormer X Factor star reveals heartfelt advice Ozzy Osbourne gave him over dinner at his and wife Sharon's LA mansion\n\nRochelle Humes looks radiant as she shares a loved-up album of family snaps with husband Marvin and their children\n\nAll the signs Cat Deeley and Patrick Kielty had split as they announce shock separation after 12 years of marriage\n\nThe One Show fans seriously distracted by Catherine Zeta-Jones 'unreal' appearance as she shares fear about working with Joanna Lumley\n\nThe celebrity guest list at Ozzy Osbourne's homecoming funeral is revealed as Elton John leads A-listers set to offer condolences\n\nIron Maiden legend Paul Mario Day dies: Tributes to band's original frontman after he passes away aged 69\n\nGwyneth Paltrow's savage nickname for Winona Ryder and her beef with Minnie Driver revealed as new book lays bare actress'smean girl past\n\nBrad Pitt, 61, shows off his new look with buzz cut and moustache as he films Once Upon A Time in Hollywood sequel\n\nLoose Women pulled from screens all week as troubled talk show dealt another blow in ITV schedule shake-up\n\nKelsey Parker shares sweet photo with daughter Aurelia during 'much-needed' family holiday in Turkey after tragically losing her third child\n\nLegendary Channel 4 show returning to screens after 25 years with 'very rude and funny' reboot - and its original host is at the helm\n\nSort Your Life Out fans all have the same complaint as Stacey Solomon tackles couple's cluttered London home\n\nTissues at the ready! David Attenborough captures tear-jerking moment between mother gorilla and her newborn baby in BBC documentary\n\nJulia Garner gives major update on much-delayed Madonna biopic she is slated to star in\n\nWhy Zendaya was forced to put her wedding to Tom Holland on hold\n\nSoap fans open-mouthed as legendary star makes debut in blockbuster spy thriller - and is worlds away from his TV roots\n\nPamela Anderson has been dating Liam Neeson 'for a while' as insider reveals where they've been hiding out\n\nKaty Perry spotted on a DATE with Canada's former Prime Minister Justin Trudeau as pair brush off splits and scandals\n\nJanuary Jones' son, 13, joins her on rare red carpet as mystery remains regarding his father's identity\n\nSydney Sweeney faces new 'toxic time bomb' after unholy backlash to 'racist' American Eagle ad\n\nKim Kardashian shocks fans with wild SKIMS product that draws comparisons to Hannibal Lecter\n\nInternet erupts at Katy Perry and Justin Trudeau's VERY cozy dinner date: 'Not on my celeb hookup bingo card!'\n\nCatherine Zeta-Jones details her and husband Michael Douglas' surprisingly low-key UK staycations to Butlins and Legoland with their Hollywood kids\n\nTaron Egerton responds to speculation he is in the running to be the next James Bond after Daniel Craig's exit\n\n007 Road To A Million lineup revealed! From an amputee to a cancer survivor and a model - meet the hopefuls putting their James Bond skills to the test to win the £1million jackpot\n\nKanye West posts disturbing selfie as wife Bianca Censori's Instagram is 'HACKED'\n\nReal Housewives star reveals breast cancer diagnosis just moments before undergoing life-saving surgery\n\nJoanna Lumley insists she hasn't had a career but has simply worked to 'keep herself alive' as she reveals she didn't get into acting 'for stardom'\n\nHailey Bieber posts saucy bedroom snap as Justin admits to 'extremely selfish' behavior\n\nHalle Berry, 58, shows off incredible bikini body on holiday... as she channels her iconic Bond girl Jinx\n\nEmily Blunt dyes her brown hair a ravishing red in first sighting on The Devil Wears Prada 2 set\n\nLily Allen sports a diamond band on her ring finger as she enjoys bike ride in Notting Hill\n\nSir Elton John, 78, celebrates 35 years of sobriety with his family as he receives handmade cards from sons Zachary and Elijah\n\nLove Island star Arabella Chi reveals she kept exercising right up until giving birth at 39 weeks pregnant and admits she wants more kids \n\nMyleene Klass recalls the horrifying moment Harvey Weinstein offered her a sex contract to make her famous and reveals her fear of being unable to escape his advances\n\nQueen of arts! Kate unveils her own 'mini' display at the V&A storehouse featuring items she personally selected\n\nStrictly's Dianne Buswell opens up on her future baby plans with boyfriend Joe Sugg and reveals why she's not worried about taking a break from her career to have children\n\nDrew Barrymore strokes Oscar winner Cate Blanchett in ANOTHER hands-on interview after previous guests told her to 'back off'\n\nDoja Cat takes a swipe at Sydney Sweeney amid American Eagle ad controversy\n\nIconic Julia Roberts rom-com in sequel talks nearly 30 years after the original\n\nLove Island fans accuse Dejon of being a 'game-player' as he takes major step in relationship with Meg in lead-up to final - before 'fake' row in challenge\n\nBrooke Hogan's shock move before dad Hulk's death that involves his $25M estate\n\nEDEN CONFIDENTIAL: Maître d' at the Garrick makes hasty departure\n\nOasis drummer Tony McCarroll reveals what he really thinks of Noel and Liam Gallagher 30 years after bitter feud saw him sacked from the band\n\nMercury Prize-winning British singer cancels all upcoming gigs on advice from doctors due to 'continued illness' as devastated fans send well wishes\n\nSugababes star Keisha Buchanan opens up about break-up from secret boyfriend as she reveals she moved to Canada for him\n\nDean Cain makes shock claim about sexual harassment he was subjected to during Superman stint\n\nOzzy Osbourne's rarely-seen daughter Aimee 'will appear alongside her family in documentary about the metal star in emotional on-screen tribute'\n\nKristin Davis says she was GROPED by an older man during filming of Sex And The City\n\nMaroon 5 star Adam Levine SUED over Instagram post urging fans to give hurricane relief donations\n\nSam Faiers admits her children don't wear sunscreen as she deems many SPF brands 'harmful' in controversial statement\n\nBrad Pitt doesn't look like THIS anymore as he is seen for the first time filming Once Upon A Time In Hollywood sequel\n\nRHONJ star reveals cruel ridicule she endured while struggling with her weight on TV\n\nLove Island fans go wild as Helena's parents say Harry 'wears his d**k on his sleeve' and greet her former flame with 'hello villain'\n\nCat Deeley and Patrick Kielty split: Couple announce they have separated after 12 years of marriage\n\nYellow Wiggle Greg Page slams Justin Timberlake in 'brutal' TikTok: 'Getting roasted by the OG!'\n\nMaya Jama is 'getting serious' with footballer boyfriend Ruben Dias as they 'plan next step in their romance'\n\nDean Cain reveals racist slur he was called after being cast as Superman\n\nNew Pride & Prejudice series has Netflix fans threatening to BOYCOTT: 'You cannot be serious'\n\nVictoria and David Beckham welcome beloved son Cruz and his girlfriend Jackie Apostel onboard their £16M yacht in St Tropez ... but Brooklyn is still missing\n\nEngland rugby ace 'is the latest celebrity being lined up for this year's Strictly Come Dancing' - and his pro pairing looks written in the stars\n\nHarry Styles was 'very behind' his lifestyle brand Pleasing expanding to include X-rated products, says Zoë Ligon who designed sex toys with the singer\n\nUniversity Challenge's 'easy' music question stumps every single BBC contestant - but can YOU beat the odds and solve it?\n\nNetflix 'axe huge reality show after just one series as it's branded the most expensive flop in years'\n\nIconic 90s talk show host looks unrecognisable in rare snaps as she enjoys retirement... can you guess who?\n\nPerrie Edwards looks stylish in a plunging blazer dress after acoustic performance in London\n\nPaulina Porizkova, 60, shares VERY sexy bikini photo before bravely revealing a more realistic snap with 'no filter'\n\nLuke Bryan fans horrified after singer was HIT in the face while performing: 'Shame on whoever did this!\n\nIconic punk rock star dies in freak swimming accident aged 69\n\nMariah Carey names which ex she is 'angry' with... and it's NOT Nick Cannon\n\nJenny From The Bank! Jennifer Lopez beams after shopping for TWO HOURS as she spends thousands of dollars\n\nBond star Sir Sean drove through my golf course plans, claims Donald Trump\n\nTeddi Mellencamp still lives with ex Edwin Arroyave and wants him to date other women as she battles cancer\n\nTom Brady takes a swipe at Gisele Bundchen over their divorce in letter about providing for his family\n\nMyleene Klass reveals she caught her ex husband cheating on her with a famous female celebrity who has built her brand on 'family' values\n\nKate Moss, 51, puts on a leggy display in a skimpy green dress before slipping into sexy lingerie as she poses with actress Chloë Sevigny, 50\n\nOlly Alexander says It's A Sin helped him confront his 'fear of HIV and sex'... as Tatler cover star reveals what he really thinks of his Eurovision nightmare\n\nRuPaul's Drag Race UK star Pixie Polite is 'punched' in 'homophobic assault' at Tesco as police launch hate crime probe\n\nBella Hadid goes bra-free in a plunging silky slip dress as she joins friends for a baby shower\n\nJack Black is seen for the first time since 'drama' with friend George Clooney\n\nHulk Hogan's devastated ex-wife says she is 'melting down' after death of WWE legend\n\nLiverpool and England footballer's daughter lands lead role as Katniss Everdeen in the first ever stage adaptation of The Hunger Games\n\nNetflix axes 'gem of a series' hailed as 'fantastically binge-worthy' despite perfect 100% Rotten Tomatoes score\n\nKylie Bax, 50, posed for Playboy, acted with Kirsten Dunst and dated Donald Trump, see her now\n\nBatman and Rambo star Alon Aboutboul has died: Tributes pour in as Israeli star passes away after collapsing on a beach\n\nSo are Pamela Anderson and Liam Neeson dating... or is it all just a publicity stunt? Body language expert reveals what their flirt fest REALLY means\n\nEsme Creed-Miles appears to confirm engagement to girlfriend Daisy Maybe as Hanna actress shares adorable new snaps with very telling clue\n\nBack to top\n\nVideo Archive\n\nTopics Index\n\nText-based site\nReader Prints\nTop of page\n\nPublished by Associated Newspapers Ltd\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout Daily Mail\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"Upon his return, Blu wasted no time in revealing drama from his time on the outside and relayed information to the boys.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14956651/Love-Island-viewers-criticise-producers-breaking-fourth-wall-allow-Blu-reveal-drama-time-outside.html","image":"https://i.dailymail.co.uk/1s/2025/07/30/22/100785659-0-image-a-128_1753911547249.jpg","video":null,"publish_date":"2025-07-30 23:47:22","author":"Editor,Laura Parkin","authors":["Editor","Laura Parkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.215},{"id":346771978,"title":"Maybe they’ll be selling oil to India someday: Trump says US to help develop ‘massive reserves’ in Pakistan","text":"Washington, July 31 (SocialNews.XYZ) US President Donald Trump on Thursday (Indian time) declared that the United States has struck a deal with Pakistan to jointly develop what he described as \"massive oil reserves\", with a suggestion that this oil could eventually be exported to India.\n\nThe announcement came just a day after Trump imposed 25 per cent tariffs on Indian goods and warned of additional penalties over India's continued oil and arms trade with Russia.\n\nPosting on his social media platform, Truth Social, Trump wrote, \"We have just concluded a deal with the country of Pakistan, whereby Pakistan and the United States will work together on developing their massive oil reserves. We are in the process of choosing the oil company that will lead this partnership. Who knows, maybe they'll be selling oil to India someday!\"\n\nThe statement comes just after Trump announced 25 per cent tariffs on Indian exports and hinted at further economic pressure in response to New Delhi's continued engagement with Russia for crude oil and defence supplies.\n\nIn his post, Trump also said he is engaged in negotiations with multiple countries seeking reductions in tariffs.\n\n\"We are very busy in the White House today working on trade deals. I have spoken to the leaders of many countries, all of whom want to make the United States 'extremely happy',\" he said.\n\nHe mentioned a meeting scheduled with the South Korean trade delegation and noted that Seoul currently faces a 25 per cent tariff rate.\n\n\"They have an offer to buy down those tariffs. I will be interested in hearing what that offer is,\" he added.\n\nTrump asserted that such deals would help reduce America's trade deficit, promising a full report \"at the appropriate time.\"\n\nResponding to a reporter's question on the newly imposed Indian tariffs and broader tensions, Trump reiterated his dissatisfaction with India's role in BRICS, a group of emerging economies comprising Brazil, Russia, India, China, South Africa and several recent entrants.\n\n\"Well, we are negotiating right now, and it's also BRICS. BRICS, which is basically a group of countries that are anti the United States and India is a member of that if you can believe it... It is an attack on the dollar, and we are not going to let anybody attack the dollar. So it's partially BRICS and it's partially trade,\" Trump said.\n\nHe indicated that ongoing discussions with India might yield clarity \"by the end of this week.\"\n\nSource: IANS","summary":"Washington, July 31 (SocialNews.XYZ) US President Donald Trump on Thursday (Indian time) declared that the United States has struck a deal with Pakistan to jointly develop what he described as \"massive oil reserves\", with a...\n\n\nThe post Maybe they&#8217;ll be selling oil to India someday: Trump says US to help develop &#8216;massive reserves&#8217; in Pakistan appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/07/30/maybe-theyll-be-selling-oil-to-india-someday-trump-says-us-to-help-develop-massive-reserves-in-pakistan/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/07/31/202507313467690.jpg?fit=598%2C354&quality=80&zoom=1&ssl=1?v=1753923606","video":null,"publish_date":"2025-07-30 23:45:53","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":0.122},{"id":346775136,"title":"Trump Says US To Impose 15% Tariff On South Korean Goods","text":"President Donald Trump said Wednesday that the United States will impose a 15 percent tariff on imports from South Korea, as he touted a \"full and complete trade deal\" between both countries.\"South Korea will give to the United States $350 Billion Dollars for Investments,\" Trump said in a post on his Truth Social platform, adding that the country would buy $100 billion in liquefied natural gas or other energy products.The 15 percent rate is below a 25 percent rate that Trump had threatened earlier, and was equivalent to levies determined from US trade deals with Japan and the European Union.Trump added that an additional unspecified \"large sum of money\" will be invested by Seoul.\"This sum will be announced within the next two weeks when the President of South Korea, Lee Jae Myung, comes to the White House for a Bilateral Meeting,\" Trump said, offering congratulations to his South Korean counterpart for his \"electoral success.\"The meeting will be their first since Lee assumed the presidency in June.In a statement posted to Facebook, Lee called the deal \"the first major trade challenge\" since his administration took power, adding: \"We have overcome a major hurdle.\"\"Through this deal, the government has eliminated uncertainty surrounding export conditions and ensured that US tariffs on our exports are either lower than or equal to those imposed on our major trade competitors,\" Lee said.Lee was elected in a snap vote last month following the impeachment of his predecessor, Yoon Suk Yeol, over his disastrous martial law declaration in December.Now at the helm of Asia's fourth-largest economy, which is heavily reliant on exports, the trade deal marks an early victory for Lee's tenure.\"This agreement represents the convergence of US interests in revitalizing its manufacturing sector and our determination to strengthen Korean companies' competitiveness in the American market,\" Lee's statement continued.Since returning to the White House in January, Trump has imposed a sweeping 10 percent tariff on allies and competitors alike -- with rates set to increase for dozens of economies on August 1 -- alongside steeper levels on steel, aluminum and autos.In contrast with the 15 percent tariff for South Korea, Trump on Wednesday also placed 25 percent tariffs on imports from India and 50 percent on those from Brazil.The latter rate was determined in part as retaliation for what Trump has called a \"witch hunt\" against his far-right ally Jair Bolsonaro, Brazil's former president who is currently undergoing a criminal trial.","summary":"President Donald Trump said Wednesday that the United States will impose a 15 percent tariff on imports from South Korea, as he touted a \"full and complete trade deal\" between both countries.","url":"https://www.ibtimes.com/trump-says-us-impose-15-tariff-south-korean-goods-3779867","image":"https://d.ibtimes.com/en/full/4613768/us-president-donald-trump-offered-his-congratulations-south-korean-president-lee-jae-myung-his.jpg?w=1600&h=900&q=88&f=dedac551817deeab7a39e4b33ce7809f","video":null,"publish_date":"2025-07-30 23:45:21","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.153},{"id":346763864,"title":"EXCLUSIVE: Sketchy Business! Trump's Personal Drawing Up For Auction After Prez Denies Writing Birthday Card To Pedo Epstein at the Center of Don's $10Billion Lawsuit Against Wall Street Journal","text":"A hand-drawn sketch by Donald Trump has surfaced at auction, and the timing couldn’t be worse for the president, who is in the midst of an ongoing scandal about his relationship with sex predator Jeffrey Epstein.\n\nThe doodle, which is a drawing of the Manhattan skyline, is currently up for sale through Iconic Auctions, with a minimum bid of $3,000 as of July 30, RadarOnline.com can exclusively reveal.\n\nBut while the auction house is marketing the image as a rare and collectible piece of presidential memorabilia, the bigger headline may be what the doodle contradicts: Trump's own denials.Trump's Drawings RevealedAfter a Wall Street Journal report revealed Trump sent a tawdry birthday note and doodle to Epstein — the convicted sex offender whose 2003 birthday bash drew a who’s who of elite guests, including Trump and Bill Clinton – the former president has gone into damage control.\n\nIn response to the report, Trump told the outlet, “I don’t draw pictures,” denying that he had anything to do with the illustration attached to the note. \n\nBut now, the newly surfaced drawing up for auction directly contradicts his claim and begs the question about how deep his connection was with Epstein.Signed By TrumpThe note from Trump to Epstein featured a hand-drawn image and was signed by Trump with the now-infamous message: “We have certain things in common.” \n\nNow, the new image drawn and signed by Trump on behalf of the \"Doodle For Hunger\" Charity — has surfaced on the auction block by an anonymous seller, directly undermining his claim. \n\nThe piece is currently up for sale on Iconic Auctions, with bidding already up to $3,000 and set to close on August 2.While Trump has since attempted to distance himself from Epstein, claiming they fell out “many years ago,” new information continues to surface, including witness testimony placing Trump in disturbing proximity to Epstein’s accusers.\n\nDespite Trump’s public insistence that Epstein was and had been “banned” from Mar-a-Lago, records and reports suggest otherwise. \n\nAs RadarOnline.com revealed, Epstein remained an active member of the Mar-a-Lago club for years after Trump claimed to have cut ties with him. \n\nOne source even alleged that Epstein used the club as a base to “steal young women,” exploiting his proximity to power to groom victims in plain sight.Trump's Bombshell LawsuitMeanwhile, Trump has lashed out at media coverage of the resurfaced birthday letter and filed a $10billion lawsuit against Rupert Murdoch and The Wall Street Journal over the report. \n\nBut with new evidence like the auctioned doodle emerging, Trump’s denials and his carefully curated narrative appear shakier than ever.","summary":"A newly uncovered Donald Trump doodle is heading to auction and it may undermine his denial about ever sketching images, a key detail in the Epstein birthday card controversy.","url":"https://radaronline.com/p/donald-trump-drawing-auction-epstein-birthday-card-denial-doodle/","image":"https://media.radaronline.com/brand-img/7Vzr5tlAb/0x0/feature-1753911334862.jpg","video":null,"publish_date":"2025-07-30 23:44:38","author":"Nate Grant","authors":["Nate Grant"],"language":"en","source_country":"us","sentiment":-0.259},{"id":346764088,"title":"Trade deal delay triggers Trump’s 25% tariff on India, says economic adviser","text":"US President Donald Trump is “frustrated\" with the lack of progress on trade talks with India and feels that the 25 per cent tariff imposed on the country will \"address and remedy” the situation, the White House economic adviser suggested on Wednesday.\n\n National Economic Council Director Kevin Hassett indicated that Trump was upset over the way negotiations on the proposed bilateral trade deal were held.\n\nNo breakthrough despite series of talks\n\n The two sides held a series of negotiations on the trade deal but no concrete outcome emerged in view of certain contentious issues.\n\n Trump on Wednesday announced the imposition of a 25 per cent tariff on all goods coming from India starting August 1, plus an unspecified penalty for buying Russian crude oil and military equipment.\n\n The surprise announcement came a day after Indian officials said that a US trade team would visit from August 25 to negotiate a trade deal.\n\nMove seen as pressure tactic to push India\n\n The announcement by Trump is being seen as a pressure tactic to get New Delhi to agree to demands made by the US, which has, in recent days, got favourable trade deals with major partners like Japan, the UK and the European Union.\n\n Hassett said India has had a market that's been pretty much closed to American products while the US has been wide open to theirs.\n\n He indicated that Trump was frustrated with the lack of progress that the US made with India, but “feels that a 25 per cent tariff will address and remedy the situation in a way that's good for the American people”.\n\n In a post on social media, Trump said that the US has a massive trade deficit with India and also criticised India for buying a “vast majority\" of its military equipment and energy from Russia.\n\n “Remember, while India is our friend, we have, over the years, done relatively little business with them because their Tariffs are far too high, among the highest in the World, and they have the most strenuous and obnoxious non-monetary Trade Barriers of any Country,” Trump said.\n\n “Also, they have always bought a vast majority of their military equipment from Russia, and are Russia’s largest buyer of energy, along with China, at a time when everyone wants Russia to stop the killing in Ukraine — All things not Good!” he added.\n\n \"India will therefore be paying a tariff of 25 per cent, plus a penalty for the above, starting on August 1st,” Trump said.\n\nHassett hints at long-term US strategy on India\n\n Hassett, responding to a question on India facing an additional charge for its purchase of Russian oil, said Trump and US Trade Representative Jamieson Greer will have more information on that “shortly”.\n\n On the 25 per cent tariff on India, Hassett added that \"what's going to happen is that India is going to cut their prices to the US in order to maintain their market share”.\n\n “That's what everybody else has been doing, and then they might reconsider their practices, which have led to this higher rate. And over time, I would guess the Indian firms will be onshoring production in the US, and Indians might even open their markets more to us, so that we reconsider a future trade deal,” he said.\n\n On the tariff, Partner at The Asia Group Nisha Biswal said in a statement that the US is using “hardball tactics” when there is an ambitious deal already on the table.\n\n “There were many reasons why the final deal seems to have faltered. One, President Trump wanted to retain a minimum 20 per cent baseline tariff on India; this was a non-starter for New Delhi,” she said.\n\n Biswal, who was Assistant Secretary for South and Central Asian Affairs at the Department of State from 2013 to 2017, added that Trump wanted US agricultural and dairy exports to India and New Delhi has gone as far as it can for now given domestic sensitivities.\n\nTrump wants direct deal with Modi\n\n Trump also wanted to directly negotiate with Prime Minister Narendra Modi since he felt that the deal did not go far enough, while New Delhi thought it had an expansive deal with the US Trade Representative and “didn’t want Trump to reopen or renegotiate terms like Vietnam”, she said.\n\n “Trump is now exerting maximum pressure on India to get Modi’s attention. Modi may want to examine what Japan, the EU and China did, all of whom have faced Trump’s ire. Keep cool, retaliate if you must, but keep the channel open,” Biswal said.\n\n “Trump wants more than what his negotiators got, and India needs to be ready with what it will give him. While he is throwing everyone in the mix — defence, Russian oil etc. – he is looking for a deal and this is how he negotiates, friend or foe. The real tragedy would be if both sides walk away from a big win. And the implications for US businesses and India’s economy could be quite severe,” she added. \n\nPublished on July 31, 2025","summary":"National Economic Council Director Kevin Hassett said Trump was frustrated by the lack of progress on a bilateral deal, despite months of negotiations","url":"https://www.thehindubusinessline.com/news/trade-deal-delay-triggers-trumps-25-tariff-on-india-says-economic-adviser/article69876154.ece","image":"https://bl-i.thgim.com/public/incoming/f8rh81/article69876360.ece/alternates/LANDSCAPE_1200/2025-06-27T144005Z_1873255560_RC22BFATP5C3_RTRMADP_3_USA-TRUMP.JPG","video":null,"publish_date":"2025-07-30 23:43:14","author":null,"language":"en","source_country":"in","sentiment":-0.201},{"id":346764114,"title":"Trump says US to impose 15% tariff on South Korean goods","text":"President Donald Trump said Wednesday that the United States will impose a 15 percent tariff on imports from South Korea, as he touted a \"full and complete trade deal\" between both countries.\n\n\"South Korea will give to the United States $350 Billion Dollars for Investments,\" Trump said in a post on his Truth Social platform, adding that the country would buy $100 billion in liquefied natural gas or other energy products.\n\nThe 15 percent rate is below a 25 percent rate that Trump had threatened earlier, and was equivalent to levies determined from US trade deals with Japan and the European Union.\n\nTrump added that an additional unspecified \"large sum of money\" will be invested by Seoul.\n\n\"This sum will be announced within the next two weeks when the President of South Korea, Lee Jae Myung, comes to the White House for a Bilateral Meeting,\" Trump said, offering congratulations to his South Korean counterpart for his \"electoral success.\"\n\n 'Overcome a major hurdle' \n\nThe meeting will be their first since Lee assumed the presidency in June.\n\nIn a statement posted to Facebook, Lee called the deal \"the first major trade challenge\" since his administration took power, adding: \"We have overcome a major hurdle.\"\n\n\"Through this deal, the government has eliminated uncertainty surrounding export conditions and ensured that US tariffs on our exports are either lower than or equal to those imposed on our major trade competitors,\" Lee said.\n\nLee was elected in a snap vote last month following the impeachment of his predecessor, Yoon Suk Yeol, over his disastrous martial law declaration in December.\n\nNow at the helm of Asia's fourth-largest economy, which is heavily reliant on exports, the trade deal marks an early victory for Lee's tenure.\n\n\"This agreement represents the convergence of US interests in revitalizing its manufacturing sector and our determination to strengthen Korean companies' competitiveness in the American market,\" Lee's statement continued.\n\nSince returning to the White House in January, Trump has imposed a sweeping 10 percent tariff on allies and competitors alike -- with rates set to increase for dozens of economies on August 1 -- alongside steeper levels on steel, aluminum and autos.\n\nIn contrast with the 15 percent tariff for South Korea, Trump on Wednesday also placed 25 percent tariffs on imports from India and 50 percent on those from Brazil.\n\nThe latter rate was determined in part as retaliation for what Trump has called a \"witch hunt\" against his far-right ally Jair Bolsonaro, Brazil's former president who is currently undergoing a criminal trial.\n\nSource: AFP","summary":"President Donald Trump said Wednesday that the United States will impose a 15 percent tariff on imports from South Korea, as he touted a \"full and complete trade deal\" between both countries. In contrast with the 15 percent tariff for South Korea, Trump on Wednesday also placed 25 percent tariffs on imports from India and 50 percent on those from Brazil.","url":"https://yen.com.gh/business-economy/288242-trump-impose-15-tariff-south-korean-goods/","image":"https://cdn.yen.com.gh/images/1200x675/630bfc1234500b1f.jpeg?v=1","video":null,"publish_date":"2025-07-30 23:42:03","author":"Samuel Obour","authors":["Samuel Obour"],"language":"en","category":"politics","source_country":"gh","sentiment":0.166},{"id":346760348,"title":"Combative Biden White House Aide Disputes Cognitive Decline Claims","text":"A top White House official and campaign chief for former President Joe Biden took probing questions from House investigators on Wednesday, pushing back strongly against assertions of Biden’s cognitive decline while still in office.\n\nSteve Ricchetti, counselor to the president in the Biden White House and a longtime player in Democrat politics, sat down with members and staff of the House Oversight and Government Reform Committee. \n\nMike Donilon, a former senior White House adviser to Biden, is set to take questions from House investigators Thursday. Donilon was Biden’s campaign manager in 2020.\n\nRicchetti and Donilon were both identified in the book “Original Sin,” by Jake Tapper and Alex Thompson, as part of the “Politburo” that helped run the White House during Biden’s cognitive decline. \n\nRicchetti contended that Biden is capable of being president today, and that he could have won in 2024, according to a source familiar with the interview. Ricchetti was combative and defensive during the transcribed interview and often filibustered. Ricchetti’s lawyer repeatedly interrupted and requested questions to be rephrased, according to the source. \n\nHe said famed film director Steven Spielberg helped Biden prepare for the June 2024 debate that led to the Democratic Party pressuring him to drop out of the race. \n\nRicchetti said Biden made only “common mistakes” that have not increased since Biden was vice president.\n\nAxios reported that in his opening statement, Ricchetti defended Biden’s mental capacity. \n\n“The Trump administration’s efforts to taint President Biden’s legacy with baseless assertions about President Biden’s mental health are an obvious attempt to deflect from the chaos of this administration’s first six months,” Ricchetti reportedly said.\n\nHe later added: “Let me be clear: At all times during his presidency, I believed that President Biden was fully capable of exercising his presidential duties and responsibilities, and that he did so. Neither I, nor anyone else, usurped President Biden’s constitutional duties, which he faithfully and fully carried out each and every day.”\n\nRicchetti worked with Biden during his vice presidency during the Obama administration. \n\nThe committee is probing Biden’s cognitive state during single term as president, as well as whether his staff signed presidential orders without his knowledge. \n\nDemocrats did not use their full allotted time, and repeatedly raised concerns about whether President Donald Trump had a colonoscopy, according to the source. \n\nJust last week, Biden’s first White House chief of staff, Ron Klain, voluntarily took questions from the committee. Two other former aides—Neera Tanden and Ashley Williams—also sat with the House investigators for a transcribed interview.","summary":"A top White House official and campaign chief for former President Joe Biden took probing questions from House investigators on Wednesday, pushing back strongly against... Read More\n\n\nThe post Combative Biden White House Aide Disputes Cognitive Decline Claims appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/30/combative-biden-white-house-aide-disputes-cognitive-decline-claims/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/Politburo-scaled.jpg","video":null,"publish_date":"2025-07-30 23:41:31","author":"Fred Lucas,Jake Tapper","authors":["Fred Lucas","Jake Tapper"],"language":"en","category":"politics","source_country":"us","sentiment":-0.13},{"id":346773110,"title":"Trump keeps hitting the 'sweet spot' with each trade partner","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle July 30, 2025 08:12 \n\n Trump keeps hitting the 'sweet spot' with each trade partner \n United States trade representative Jamieson Greer breaks down the new trade deal President Donald Trump reached with South Korea on 'The Ingraham Angle.'\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE INGRAHAM ANGLEV-VIDEOTRADETRADEDONALD TRUMPWORLD","summary":"U.S. Trade Representative Jamieson Greer breaks down the new trade deal President Donald Trump reached with South Korea on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6376351246112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ebc5e669-1901-42f5-abf2-1253cd25f9b4/88879241-9998-4f92-b721-57555ffc1b0d/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-30 23:40:02","author":null,"language":"en","source_country":"us","sentiment":0.063},{"id":346763656,"title":"'Extremely bad': Ex-CIA agent says Trump's 'loyalty enforcer' threatens national security","text":"One prominent far-right social media personality sometimes seen in President Donald Trump's orbit has carved out a niche for herself as the president's \"loyalty enforcer,\" according to the New York Times. But one attorney representing administration officials who have been fired is publicly condemning her influence.\n\nThe Times reported Wednesday on the growing power MAGA activist Laura Loomer has over personnel decisions in the executive branch. Loomer has already gotten Trump to fire several officials who were deemed insufficiently loyal over past social media posts criticizing the president and his base. However, Kevin Carroll — a former CIA official and lawyer who has been retained as counsel by some of those former employees — said that Loomer's attempts to ferret out anyone who has ever spoken negatively about the president could have significant blowback.\n\n \"You have a person, from outside of the government of no national security experience and with extreme views, having de facto hire and fire authority over some of the most senior and important positions in the United States government,\" Carroll told the Times.\n\nREAD MORE: (Opinion) Trump has only one way out of this mess\n\n\"Eventually, when all of the qualified people are driven out and only the people acceptable to Laura Loomer remain, there could be an extremely bad result for the United States in some international crisis,\" he continued.\n\nLoomer has already claimed responsibility for driving out the top two officials at the National Security Agency (NSA) — former director Timothy Haugh (a four-star general), deputy director Wendy Noble and chief counsel April Falcon Doss — along with several others. This week, Dr. Vinay Prasad, who was the top vaccine official at the Food & Drug Administration, also resigned after Loomer discovered that he joked about using Trump as a voodoo doll in a 2020 podcast. \n\nThe Times reported that despite her devotion to Trump, Loomer wasn't given a job either in Trump's 2024 campaign or in the White House. But the social media personality indicated that she aimed to continue screening administration officials to ensure they were staunch Trump loyalists. \n\n\"I was raised to dress for the job you want, and even if you don’t have the job, pretend that you do,” Loomer said. “I want to do vetting, so I’m going to do the job I want.”\n\nREAD MORE: 'Look stupid': Attorney reveals key sign that shows Trump nervous about Epstein questions\n\nClick here to read the full Times report (subscription required).","summary":"One prominent far-right social media personality sometimes seen in President Donald Trump's orbit has carved out a niche for herself as the president's \"loyalty enforcer,\" according to the New York Times. But one attorney representing administration officials who have been fired is publicly condemning her influence.\n\nThe Times reported Wednesday on the growing power MAGA activist Laura Loomer has over personnel decisions in the executive branch. Loomer has already gotten Trump to fire several officials who were deemed insufficiently loyal over past social media posts criticizing the president and his base. However, Kevin Carroll — a former CIA official and lawyer who has been retained as counsel by some of those former employees — said that Loomer's attempts to ferret out anyone who has ever spoken negatively about the president could have significant blowback.\n\n \"You have a person, from outside of the government of no national security experience and with extreme views, having de facto hire and fire authorit","url":"https://www.alternet.org/trump-national-security-2673791543/","image":"https://www.alternet.org/media-library/image.png?id=61388051&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-07-30 23:39:41","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.13},{"id":346761976,"title":"Love Island reveals the show's iconic baby challenge will RETURN as the final couples get an early glimpse at parenthood","text":"Black Friday\n\nBritain's Got Talent\n\nCelebrity Big Brother\n\nPrivacy Policy\n\nWednesday, Jul 30th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nLove Island reveals the show's iconic baby challenge will RETURN as the final couples get an early glimpse at parenthood\n\nHave YOU got a story? Email tips@dailymail.co.uk\nBy LAURA FOX \n Published:00:34 BST, 31 July 2025 |Updated:00:37 BST, 31 July 2025 \n\nLove Island's iconic baby challenge is set to return, as this year's remaining couples get an eye-opening early glimpse at parenthood in Thursday's show.\nThe segment had been a fixture of series past as couples were tasked with looking after some adorable new arrivals, with mixed results.\nAnd in a teaser at the end of Wednesday's episode, it was revealed the babies would once again be heading back into the villa.\nFor some couples it will no doubt be a rude awakening, with many yet to even declare themselves exclusive.\nBut for others, it could bring them closer together, as they get a glimpse at what their future could be when they leave the villa in a matter of days.\nThe baby challenge had previously sparked a string of viral moments, including the naming of Chris Hughes and Olivia Attwood's child Cash Hughes, or Molly-Mae Hague's incredulous reaction to her boyfriend Tommy Fury's hilarious treatment of their bundle of joy.\n\nLove Island's iconic baby challenge is set to return, as this year's remaining couples get an eye-opening early glimpse at parenthood in Thursday's show\nElsewhere in Wednesday's episode, the girls proved the divide was still well and truly in place. \nCalled the biggest divide in the show's history, the entire series has centred around the ongoing feud between the two groups of girls: Shakira, Toni and Yas versus Meg and Helena. \nThe Islanders continued to take part in the tense Couple Goals challenge - but when the Islanders were asked 'Which couple are you most scared to give your honest opinion on?' shockwaves were sent through the Villa.\nShakira and Harry chose Meg and Dejon, which did not go down well. \n'I think if people were honest in the first place and told us to our faces instead of saying it constantly behind our back, it would be a different story,' Meg raged.\nShakira responded: 'You throwing around the fake word is rich to be honest. I don't know why you keep acting like we're the best of mates in here. \n'From day one, you were very standoffish with any girl that was posed as a threat.'\n'I think you've called every single person in this Villa fake,' Meg bit back, to which Shakira said: 'No, I will never pretend to be your mate.'\n\nFor some couples it will no doubt be a rude awakening, with many yet to even declare themselves exclusive\n\nBut for others, it could bring them closer together, as they get a glimpse at what their future could be when they leave the villa in a matter of days\n\n Love Island fans criticise show for 'breaking fourth wall' as they discuss the outside \nMeg interrupted 'You won't be my friend on the outside' before Shakira said: 'I will never speak to you on the outside. I honestly can't stand you sometimes.'\nBut that wasn't all because when it comes to Meg and Dejon's turn to answer, both Meg and Blu become embroiled in a back and forth with Toni before Blu brands Toni a 'pick-me girl'.\nThe chaos came just two episodes after Toni brought the girls around the firepit to try and bridge the divide and call a truce. \nBut recent scenes have shown the divide is as strong as ever. \nViewers said: 'The divide is actually insane… i'm sat here raging at my TV screen,';\n'I've watched love island since Series 1 and this series is hands down the most uncomfortable to watch. This girl divide is f****n awful. The smart ass comments thrown about, the sly digs, the ganging up on 1 girl…it's actually draining,';\n'The Great Villa Divide of 2025 is alive and well,'; 'I've never seen THIS strong of a divide in the villa before,';\n'so funny they had a whole convo about no more divide and now it's like even worse AHAHAHAH,';\n'So much for Tonie and Meg wanting to squash the divide between the girls .. It's gone further apart since their girls intervention the other night'. \nWhile others noted that they had never seen such a 'toxic' series, especially with the finale just days away. \nLove Island continues on Thursday at 9pm on ITV2 and ITVX. \n\nLOVE ISLAND 2025: MEET THE CONTESTANTS\n\nDejon Noel Williams\nNAME: Dejon Noel Williams\n\nFROM: London\nOCCUPATION: Semi-pro footballer and personal trainer\nWHAT ARE YOU LOOKING FOR? Someone who is beautiful on the inside and out, looks after themselves and is healthy\nCLAIM TO FAME? My dad being an ex-professional footballer. I've met all kinds of famous people through him. When I was younger it was weird because he was just my dad, but we'd go to a game and fans were asking for photos. I've met David Beckham, he was really nice.\n\nMegan Moore\nNAME: Megan Moore\n\nFROM: Southampton\nOCCUPATION: Payroll specialist\nWHAT ARE YOU LOOKING FOR? I'd like to meet someone who is tall, with a nice tan, nice eyes and a nice smile. He needs to have a good fashion sense and a really good, funny personality that I can get on with \nHOW WOULD YOU DESCRIBE YOUR LOVE LIFE? Bankrupt, right now. But we're going to make sales and get on that corporate ladder and be booming. Profits, profits, profits!\n\nHelena Ford\nNAME: Helena Ford\n\nFROM: London\nOCCUPATION: Cabin Crew\nWHAT ARE YOU LOOKING FOR? Somebody funny or Northern. I feel like Northern people have much more banter than Southerners. If you look through my previous dating history, you'll see I clearly go for personality. You can pretty much laugh me into bed.\nWOULD MAYA HIRE YOU FOR YOUR FLIRTING SKILLS? I would say hire but then quickly fire soon after. It would only be a temporary contract.\n\nShakira Khan\nNAME: Shakira Khan\n\nFROM: London\nOCCUPATION: Construction Project Manager\nWHAT ARE YOU LOOKING FOR? Someone who is tall, charming, witty, with big arms, a good smile and just really funny.\nHOW WOULD YOU DESCRIBE YOUR LOVE LIFE? Booming, but they're all frogs. It's a busy love life but I've not found 'the husband', I'm looking for 'the one'. I'm looking for the ring.\n\nHarry Cooksley\nNAME: Harry Cooksley \n\nFROM: Guildford\nOCCUPATION: Gold trader, semi-professional footballer and model\nWHAT ARE YOU LOOKING FOR? The girl next door that makes me laugh and can hold eye contact with me. I don't think I'd go for the most obvious girl, I like a real sweet girl. \nCLAIM TO FAME? I'm the body double for Declan Rice. So when he does a shoot, any body close ups will actually be me. You'll never see my face, but you'll see my shoulder or chest, that kind of thing.\n\nConor Phillips\nNAME: Conor Phillips\n\nFROM: Limerick\nOCCUPATION: Professional rugby player\nWHAT ARE YOU LOOKING FOR?Someone who is really sure of themselves, ambitious, a bit of a go-getter and good craic. I like dark eyes and I don't mind a dominant woman.\nWOULD MAYA HIRE YOU FOR YOUR FLIRTING SKILLS? Definitely hire. I ask girls if they want to go halves on a baby. It doesn't work, but it gets them laughing. It's an ice-breaker, not a serious question of course!\n\nToni Laites\nNAME: Toni Laites\n\nFROM: Connecticut \nOCCUPATION: Las Vegas Pool Cabana Server\nWHAT ARE YOU LOOKING FOR? I'm looking for darker hair, definitely muscular but not too muscular. Super fit. Clean hair cut. Someone that can make me laugh - I'm super outgoing. And someone that's quite active. Maybe one day we could start our own family together. \nI WANT TO DATE A BRITISH GUY BECAUSE... I've lived in three different states and I'm still single. It's time to try something new! I have some British friends and they're pretty charming. I think all Americans love a good accent. British men are just more polite, with better manners.\n\nNAME: Yasmin Pettet\n\nFROM: London\nOCCUPATION: Commercial Banking Executive\nWHAT ARE YOU LOOKING FOR? I'm looking for a guy who is fit, has a nice body and who is funny with a bit of banter.\nWHAT'S YOUR BIGGEST ICK? A guy that's stingy\n\nMegan Moore\nNAME: Megan Moore\n\nFROM: Dublin\nOCCUPATION: Musical theatre performer and energy broker\nWHAT ARE YOU LOOKING FOR?\nSomeone who doesn't take themselves too seriously and has a sense of humour. If they're not bad looking, that's always a plus. \nI love a boy that's a bit pasty, like Timothé e Chalamet. I don't mind scrawny, or a bit of a 'dad bod'. I'm 5ft1 so any height really.\nCLAIM TO FAME? Me and my friends made a Derry Girls TikTok for Halloween and it went a bit viral around Brighton. \nSometimes I get stopped in the street about it. I've also done Panto.\n\nBlu Chegini\nNAME: Blu Chegini\n\nFROM: London\nOCCUPATION: Construction Project Manager\nWHAT ARE YOU LOOKING FOR?\nSomeone who is family oriented, has a lot of love to give and a lot of love to receive. Personality goes a long way. \nWOULD MAYA HIRE YOU FOR YOUR FLIRTING SKILLS? She'd fire me, but I've got the charm to smooth things over with a girl. The fact I speak fluent Spanish comes in handy when it comes to flirting!\n\nNAME: Jamie Rhodes\n\nOCCUPATION: Electric Engineer \nWHAT ARE YOU LOOKING FOR? Bubbly, cheeky, outgoing, good face card and a nice bum. \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? I'll be in amongst the drama! It's a once in a lifetime opportunity, I'm gonna take it by the horns and go for it.\n\nNAME: Ty Isherwood\n\nOCCUPATION: Site Engineer \nWHAT ARE YOU LOOKING FOR? I go off energy, if we vibe. I've typically dated brunettes, tanned, nice teeth with a nice smile. \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? A head turner! I get along with lads easily and like to make people laugh.\n\nNAME: Cacherel 'Cach' Mercer\n\nOCCUPATION: Professional Dancer\nWHAT ARE YOU LOOKING FOR? Someone who's emotionally intelligent, beautiful, charismatic, caring, affectionate, and I'd say an intro extrovert. \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? I think I'm gonna get into trouble, I feel like I'll be the joker of the group! I'll also be the person people come to for advice… and a bit of eye candy at the same time.\n.........................................................................................................................\n\nNAME: Angel Swift\n\nOCCUPATION: Aesthetics Practitioner and Salon Owner\nWHAT ARE YOU LOOKING FOR? I'm ready to make memories with someone, go travelling with them and fall in love \nWHAT KIND OF ISLANDER DO YOU THINK YOU'LL BE? I feel like people have been getting their heads turned very easily. I do feel like I have quite a good chance of turning someone's head.\n\nAdvertisement\n\nShakiraChris HughesTommy Fury\n\nShare or comment on this article: \nLove Island reveals the show's iconic baby challenge will RETURN as the final couples get an early glimpse at parenthood\n\nAdd comment\n\n Share what you think\n\nNo comments have so far been submitted. Why not be the first to send us your thoughts,\nor debate this issue live on our message boards.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nMo Gilligan 'has fathered a secret love child after short-lived romance with a model - and is set to welcome another baby with his long-term girlfriend'\n\nBare it like Beckham! Playful Cruz Beckham has a laugh with his brother Romeo mimicking his dad's famous skimpy Speedo look on luxury yacht \n\nIs this what led Cat Deeley's marriage to breaking point? The mammoth £5M house renovation project in upmarket Hampstead that 'shocked' TV star \n\nThere's two things in Myleene Klass's cheating bombshell that don't make sense... and I know exactly why that is: LIZ JONES\n\nJenna Ortega stuns in a semi-sheer snakeskin gown while Catherine Zeta Jones rocks a backless dress as they join co-star Billie Piper at Wednesday series two premiere in London\n\nThe top-rated after sun that shoppers say keeps their tan glowing for WEEKS is on sale in limited-time deal: 'Makes my tan last longer'\n\nOzzy Osbourne's 'favourite child' Kelly makes touching tribute to her beloved father at heartbreaking funeral procession\n\nMeghan's new goldmine: Insiders tell ALISON BOSHOFF why her and Harry are set to make MORE money next year despite being 'horrible at making decisions' - but it's not all good news\n\nJessica Alba and new love Danny Ramirez take hot romance 'to the next level' as they are seen kissing\n\nThe anti-ageing beauty buy with a bizarre name that's delivering jaw-dropping results - users say it 'takes years off you within WEEKS' (and it's 15% off)\n\nLike father, like son! Supportive parents Wayne and Coleen Rooney watch their son Kai, 15, play for Manchester United in the Super Cup NI \n\nKENNEDY uncovers the true origin of Sydney Sweeney's 'Nazi' jeans ad... and it's not what the hysterical Left thinks it is\n\nLove Island viewers are left shocked at the biggest divide in show's history as tensions reach breaking point just days before finale\n\nYellowstone star claims he 'lost everything' after being ousted from Hollywood for shocking reason\n\nThis little-known skincare brand clears skin fast - and it's on sale: 'I FINALLY feel confident going makeup-free at the beach!'\n\nHow 'flirty' Katy Perry 'flattered' Justin Trudeau on pair's shock date after her Orlando Bloom split\n\nPals of Liam Neeson's late wife Natasha Richardson weigh in on Pamela Anderson romance\n\nAlec Baldwin's lawsuit against New Mexico prosecutors over 'malicious' Rust shooting prosecution is THROWN OUT\n\nJamie Lee Curtis reveals the real reason behind the 22-year wait for Freaky Friday sequel\n\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\n\nJessica Alba's ex Cash Warren, 46, has surprising reaction to her new romance with Danny Ramirez, 32\n\nOzzy Osbourne sent gut-wrenching final text to Black Sabbath guitarist before his death at 76\n\nOprah Winfrey hits back at claims she 'refused' to open her private road in Hawaii for people to escape following tsunami warnings\n\nShocking extent of Gwyneth Paltrow's privileged upbringing laid bare\n\nI want to stop renting and buy a place of my own. Where do I start?\n\nSam Faiers is branded 'irresponsible and naive by horrified' skin doctor after admitting her three children don't wear sunscreen\n\n'She was a presence, light, and life-changer': Emma Bunton and Tom Fletcher share emotional tributes to stage school pioneer Sylvia Young after her death at 86\n\nLove Island viewers criticise producers for 'breaking the fourth wall' as they allow Blu to reveal drama from his time on the outside\n\nGwyneth Paltrow's son Moses, 19, reveals if he is following in his dad Chris Martin's footsteps\n\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\n\nMeghan Markle launches ANOTHER product in her As Ever line... but customers may struggle to see what's new\n\nLeonardo DiCaprio comes under fierce fire for investing in luxury hotel in Israel\n\nLove Island viewers accuse Blu of 'begging for screentime' after he takes a brutal swipe at Toni in ANOTHER tense villa clash\n\nAdam Sandler reveals the secret to his 22-year 'very special' marriage to wife Jackie who appears in ALL his films\n\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\n\nEmmerdale couple confirm their wedding date with an array of loved-up snaps two years after romantic proposal\n\nFuture of Ben Affleck and Matt Damon's Hulk Hogan biopic revealed days after WWE icon's shock death\n\nPrincess Andre, 18, puts on a stylish display as she shares sunkissed snaps from her Mexican holiday\n\nSteve Buscemi is supported by rarely seen girlfriend Karen Ho at Wednesday series two premiere in London\n\nYour new life in the country: How to win this stunning £575k four-bed, with an Audi sports car thrown in!\nAdvertising\n\nJoanna Lumley embraces gothic glamour as she steps out in an elegant all-black ensemble at the Wednesday series two premiere in London\n\nEllen guest makes disturbing new bullying claims about disgraced former talk show host\n\nCat Deeley's sexy post split wardrobe revealed as star wows in racy summer outfits- here's where to shop her looks on the high street\n\nTV reality star, 32, embraces natural grey hair in new makeover - can you guess who it is?\n\nFancy a party in paradise? Two tickets for Centreforce's Tenerife Weekender 2025 are up for grabs\n\nX Factor winner to release first album in over ten years as they make huge return to the music industry\n\nGeorgia Toffolo addresses pregnancy speculation after confusing fans by teasing 'major news' with 'bump' picture and scan announcement\n\nPregnant Shaughna Phillips reveals her plans to have a c-section as she recalls 'traumatic' birth of daughter Lucia which saw her suffer a haemorrhage\n\nHacks star Jean Smart, 73, walks with a cane after knee surgery following a scary fall in NYC\n\nHow would you like to win £10,000 on this new prize platform?\n\nClaire Sweeney reveals shock injury as she shares photograph of her very bruised and swollen ankle\n\nSam Thompson reveals a glimpse of the plush house he shared with ex Zara McDermott as he gushes about why he 'loves' coming home\n\nInside Kate and William's mystery holiday Greek island: As Royals said to have been spotted off the coast, what they would have seen, done... and why it's perfect for little Princes and Princesses\n\nMeet the nepo baby with a very famous father who is forging an impressive career AWAY from Hollywood\n\nThe 'unbeatable' cell-signalling hair loss treatment that delivers results in SIX weeks: 'My hair line is filling in'\n\nMatthew McConaughey's role in apprehending sadistic murderer who gunned down young father resurfaces\n\nHarrison Ford, 83, shares he is glad Hollywood hires 'old guys' because he never wants to stop working\n\nJack Whitehall's fiancée Roxy Horner opens up about living with type 1 diabetes as she reunites with comedian in Corfu after 'months apart'\n\nKaia Gerber glows as she performs in Massachusetts... as ex Pete Davidson announces his girlfriend is pregnant\n\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\n\nA-List action star unrecognizable after shaving off his beard for first time in SIX YEARS but can you guess who?\n\nPamela Anderson, 58, looks flustered as she's seen for first time since news broke she's dating Liam Neeson, 73\n\nJenna Ortega smoulders in leather bralette while Catherine Zeta-Jones dazzles in a chic white suit as Wednesday cast unite for vampy portraits \n\nWatch as Coldstream Guards band pay touching tribute to Ozzy Osbourne with rendition of Black Sabbath's Paranoid\n\nYou could win a BMW M3 Touring, a VW Crafter Campervan & £10,000... for JUST 35p!\nAdvertising\n\nSharon Osbourne breaks down in tears at emotional funeral procession for Ozzy as she is joined by their children Jack, Kelly, and Aimee, his son Louis and THOUSANDS of Black Sabbath fan\n\nHulk Hogan felt 'embarrassed' at how fragile he'd become in his final weeks, WWE icon's friend reveals\n\nRoman Kemp reveals he's BANNED from interviewing beloved A-lister as their 'awkward and cringe' exchange resurfaces\n\nAmanda Holden, 54, flashes her peachy bottom in a windswept kaftan as she shares racy poolside snaps during her Greece getaway\n\nThe £30 perfume going viral for surprising effect on your mood: 'Made me feel energised'\n\nGregg Wallace launches private chat room just for middle-aged men in desperate bid to keep earning after he was sacked from MasterChef\n\nEveryone's talking about Pamela Anderson's makeup free appearance - here are the exact products behind her effortlessly natural look\n\nA Place In The Sun's Laura Hamilton, 43, hits back at cruel trolls insisting she is 'too old to wear a bikini' as she wows in stunning swimwear snap\n\nVogue Williams shows off her incredible physique during sunshine break in Spain as presenter models two bikinis while sharing 'big news' about her podcast\n\nThe brand behind the iconic Eight-Hour Cream has a huge sale with 25% off EVERYTHING (plus, how to get a £227 goody bag)\n\nBrooklyn Beckham gets back to the daily grind: Glum star accompanies wife Nicola on a family lunch after break on his in-laws' £85M superyacht \n\nThis teen is already acting in films, can you guess who her very famous model mother is?\n\nLulu makes heartfelt plea to grieving Sharon Osbourne on the day of Ozzy's funeral live on Lorraine - silencing host Christine Lampard\n\nJack P. Shepherd's wife Hanni Treweek admits she is a 'wreck' as she shares update on Italian honeymoon\n\nIs adaptogenic coffee the wellness upgrade YOU need? Our team put it to the test - here's what they really thought\n\nInside Ana de Armas' $7M love nest in Vermont where she is romancing Tom Cruise\n\nWe've got you mum: Emotional moment Jack and Kelly Osbourne cling on to mother Sharon as she almost collapses in grief while viewing floral tributes for Ozzy\n\nSir Michael Palin, 82, confesses he is preparing for the end of his life and has finalised his will following the devastating death of his wife Helen, 80\n\nI made a documentary so disturbing the government banned it from screens for 20 years before a major U-turn by BBC\n\nI swear I spotted Kate and William on a billionaire's superyacht off the coast of Greece... I have all the royal vacation gossip\n\nOzzy's family united in grief: Sharon, Kelly, Jack and Aimee are joined by Black Sabbath legend's grandchildren and son Louis from his first marriage\n\nLorraine Kelly's flattering floral Boden dress is perfect for summer - and it's selling out fast with 30% off\n\nBYOB: Bring your own bread! Richard Madeley whips out a crusty roll from his bag as he tucks into a bowl of soup during boozy pub lunch\n\nTom Cruise, 63, goes official with 'new love' Ana de Armas, 37, as they indulge in telling PDA on romantic getaway\n\nLove Island bombshell Billykiss Azeez reveals the one couple she believes stands NO chance of staying together beyond the show\n\nLinda Robson enjoys star-studded holiday with celebrity pals Bruno Tonioli, Lesley Joseph, Claire Sweeney and Charlie Brooks in Mallorca\n\nThe Sound Of Music star, 81, says he is lucky to be alive after suffering two heart attacks\n\nBrittany Cartwright claims estranged husband Jax Taylor 'threw a coffee table' at her during 'aggressive' fight\n\nLove Island spoilers: Shakira rages 'I can't stand you, we'll never speak on the outside!' at seething Meg as pair come to blows\n\nScott Wolf's son chimes in on ugly divorce as his mom tries to return to family home... after restraining order\n\nRising NBC News star Tom Llamas ruffles co-workers' feathers with 'challenging' management style\n\nOrlando Bloom's ex wife Miranda Kerr makes allegiance clear as she shares video of Katy Perry performing after the singer enjoyed a date with Justin Trudeau\n\nRevealed: Why Hulk Hogan's estranged daughter will receive nothing from wrestling legend's will\n\nPatrick Kielty's family tragedy: Irish comedian was just 16 when he lost his father in a horrific shooting - as star announces split from wife Cat Deeley\n\nLorraine overtakes This Morning in ITV ratings just months before show is ravaged by cuts as part of daytime telly bloodbath\n\nClarkson's Farm star Kaleb Cooper reveals his tractor and post knocker were STOLEN as he makes a desperate plea for help\n\nWhy Cat Deeley and Patrick Kielty REALLY split: Friends tell GRANT TUCKER truth about marriage, their 'separate lives' - and who presenter's now seeking comfort from \n\nEd Sheeran buys lavish £9M New York pad as singer adds to ever-growing property portfolio\n\nThis Morning guest lost for words as he learns life-changing value of his wrestling memorabilia live from car boot sale\n\nHow Katy Perry and Justin Trudeau suffered a remarkably similar fall from grace before unlikely friends were spotted dining in Canada\n\nAmber Heard is showered with support from fans ahead of final performance in Spirit Of The People - after star returned to acting following Depp trial\n\nPriscilla Presley, 80, is unrecognisable as she surfaces with pained look\n\nPrince Harry and Meghan Markle's $14 million Montecito mansion caught up in tsunami warning zone\n\nNewlyweds Eve Jobs and husband Harry Charles honeymoon with BOTH of their families as they buck tradition and opt for a group trip on late father Steve's £105M super yacht to Milos\n\nEverything to watch on Netflix in August, including the return of the most-watched programme ever\n\nAlice Evans shares post about her 'sad feelings' hours after Bianca Wallace accused her of inventing 'disgusting, vile story'\n\nColeen Rooney and husband Wayne arrive to support their son Kai as his team Manchester United take on Glasgow Rangers in Northern Ireland\n\nLila Moss and model aristocrat Lady Lola Bute slip into racy red negligees as they party in Ibiza\n\nFormer X Factor star reveals heartfelt advice Ozzy Osbourne gave him over dinner at his and wife Sharon's LA mansion\n\nRochelle Humes looks radiant as she shares a loved-up album of family snaps with husband Marvin and their children\n\nAll the signs Cat Deeley and Patrick Kielty had split as they announce shock separation after 12 years of marriage\n\nThe One Show fans seriously distracted by Catherine Zeta-Jones 'unreal' appearance as she shares fear about working with Joanna Lumley\n\nThe celebrity guest list at Ozzy Osbourne's homecoming funeral is revealed as Elton John leads A-listers set to offer condolences\n\nIron Maiden legend Paul Mario Day dies: Tributes to band's original frontman after he passes away aged 69\n\nGwyneth Paltrow's savage nickname for Winona Ryder and her beef with Minnie Driver revealed as new book lays bare actress'smean girl past\n\nBrad Pitt, 61, shows off his new look with buzz cut and moustache as he films Once Upon A Time in Hollywood sequel\n\nLoose Women pulled from screens all week as troubled talk show dealt another blow in ITV schedule shake-up\n\nKelsey Parker shares sweet photo with daughter Aurelia during 'much-needed' family holiday in Turkey after tragically losing her third child\n\nLegendary Channel 4 show returning to screens after 25 years with 'very rude and funny' reboot - and its original host is at the helm\n\nSort Your Life Out fans all have the same complaint as Stacey Solomon tackles couple's cluttered London home\n\nTissues at the ready! David Attenborough captures tear-jerking moment between mother gorilla and her newborn baby in BBC documentary\n\nJulia Garner gives major update on much-delayed Madonna biopic she is slated to star in\n\nWhy Zendaya was forced to put her wedding to Tom Holland on hold\n\nSoap fans open-mouthed as legendary star makes debut in blockbuster spy thriller - and is worlds away from his TV roots\n\nPamela Anderson has been dating Liam Neeson 'for a while' as insider reveals where they've been hiding out\n\nKaty Perry spotted on a DATE with Canada's former Prime Minister Justin Trudeau as pair brush off splits and scandals\n\nJanuary Jones' son, 13, joins her on rare red carpet as mystery remains regarding his father's identity\n\nSydney Sweeney faces new 'toxic time bomb' after unholy backlash to 'racist' American Eagle ad\n\nKim Kardashian shocks fans with wild SKIMS product that draws comparisons to Hannibal Lecter\n\nInternet erupts at Katy Perry and Justin Trudeau's VERY cozy dinner date: 'Not on my celeb hookup bingo card!'\n\nCatherine Zeta-Jones details her and husband Michael Douglas' surprisingly low-key UK staycations to Butlins and Legoland with their Hollywood kids\n\nTaron Egerton responds to speculation he is in the running to be the next James Bond after Daniel Craig's exit\n\n007 Road To A Million lineup revealed! From an amputee to a cancer survivor and a model - meet the hopefuls putting their James Bond skills to the test to win the £1million jackpot\n\nKanye West posts disturbing selfie as wife Bianca Censori's Instagram is 'HACKED'\n\nReal Housewives star reveals breast cancer diagnosis just moments before undergoing life-saving surgery\n\nJoanna Lumley insists she hasn't had a career but has simply worked to 'keep herself alive' as she reveals she didn't get into acting 'for stardom'\n\nHailey Bieber posts saucy bedroom snap as Justin admits to 'extremely selfish' behavior\n\nHalle Berry, 58, shows off incredible bikini body on holiday... as she channels her iconic Bond girl Jinx\n\nEmily Blunt dyes her brown hair a ravishing red in first sighting on The Devil Wears Prada 2 set\n\nLily Allen sports a diamond band on her ring finger as she enjoys bike ride in Notting Hill\n\nSir Elton John, 78, celebrates 35 years of sobriety with his family as he receives handmade cards from sons Zachary and Elijah\n\nLove Island star Arabella Chi reveals she kept exercising right up until giving birth at 39 weeks pregnant and admits she wants more kids \n\nMyleene Klass recalls the horrifying moment Harvey Weinstein offered her a sex contract to make her famous and reveals her fear of being unable to escape his advances\n\nQueen of arts! Kate unveils her own 'mini' display at the V&A storehouse featuring items she personally selected\n\nStrictly's Dianne Buswell opens up on her future baby plans with boyfriend Joe Sugg and reveals why she's not worried about taking a break from her career to have children\n\nDrew Barrymore strokes Oscar winner Cate Blanchett in ANOTHER hands-on interview after previous guests told her to 'back off'\n\nDoja Cat takes a swipe at Sydney Sweeney amid American Eagle ad controversy\n\nIconic Julia Roberts rom-com in sequel talks nearly 30 years after the original\n\nLove Island fans accuse Dejon of being a 'game-player' as he takes major step in relationship with Meg in lead-up to final - before 'fake' row in challenge\n\nBrooke Hogan's shock move before dad Hulk's death that involves his $25M estate\n\nEDEN CONFIDENTIAL: Maître d' at the Garrick makes hasty departure\n\nOasis drummer Tony McCarroll reveals what he really thinks of Noel and Liam Gallagher 30 years after bitter feud saw him sacked from the band\n\nMercury Prize-winning British singer cancels all upcoming gigs on advice from doctors due to 'continued illness' as devastated fans send well wishes\n\nSugababes star Keisha Buchanan opens up about break-up from secret boyfriend as she reveals she moved to Canada for him\n\nDean Cain makes shock claim about sexual harassment he was subjected to during Superman stint\n\nOzzy Osbourne's rarely-seen daughter Aimee 'will appear alongside her family in documentary about the metal star in emotional on-screen tribute'\n\nKristin Davis says she was GROPED by an older man during filming of Sex And The City\n\nMaroon 5 star Adam Levine SUED over Instagram post urging fans to give hurricane relief donations\n\nSam Faiers admits her children don't wear sunscreen as she deems many SPF brands 'harmful' in controversial statement\n\nBrad Pitt doesn't look like THIS anymore as he is seen for the first time filming Once Upon A Time In Hollywood sequel\n\nRHONJ star reveals cruel ridicule she endured while struggling with her weight on TV\n\nLove Island fans go wild as Helena's parents say Harry 'wears his d**k on his sleeve' and greet her former flame with 'hello villain'\n\nCat Deeley and Patrick Kielty split: Couple announce they have separated after 12 years of marriage\n\nYellow Wiggle Greg Page slams Justin Timberlake in 'brutal' TikTok: 'Getting roasted by the OG!'\n\nMaya Jama is 'getting serious' with footballer boyfriend Ruben Dias as they 'plan next step in their romance'\n\nDean Cain reveals racist slur he was called after being cast as Superman\n\nNew Pride & Prejudice series has Netflix fans threatening to BOYCOTT: 'You cannot be serious'\n\nVictoria and David Beckham welcome beloved son Cruz and his girlfriend Jackie Apostel onboard their £16M yacht in St Tropez ... but Brooklyn is still missing\n\nEngland rugby ace 'is the latest celebrity being lined up for this year's Strictly Come Dancing' - and his pro pairing looks written in the stars\n\nHarry Styles was 'very behind' his lifestyle brand Pleasing expanding to include X-rated products, says Zoë Ligon who designed sex toys with the singer\n\nUniversity Challenge's 'easy' music question stumps every single BBC contestant - but can YOU beat the odds and solve it?\n\nNetflix 'axe huge reality show after just one series as it's branded the most expensive flop in years'\n\nIconic 90s talk show host looks unrecognisable in rare snaps as she enjoys retirement... can you guess who?\n\nPerrie Edwards looks stylish in a plunging blazer dress after acoustic performance in London\n\nPaulina Porizkova, 60, shares VERY sexy bikini photo before bravely revealing a more realistic snap with 'no filter'\n\nLuke Bryan fans horrified after singer was HIT in the face while performing: 'Shame on whoever did this!\n\nIconic punk rock star dies in freak swimming accident aged 69\n\nMariah Carey names which ex she is 'angry' with... and it's NOT Nick Cannon\n\nJenny From The Bank! Jennifer Lopez beams after shopping for TWO HOURS as she spends thousands of dollars\n\nBond star Sir Sean drove through my golf course plans, claims Donald Trump\n\nTeddi Mellencamp still lives with ex Edwin Arroyave and wants him to date other women as she battles cancer\n\nTom Brady takes a swipe at Gisele Bundchen over their divorce in letter about providing for his family\n\nMyleene Klass reveals she caught her ex husband cheating on her with a famous female celebrity who has built her brand on 'family' values\n\nKate Moss, 51, puts on a leggy display in a skimpy green dress before slipping into sexy lingerie as she poses with actress Chloë Sevigny, 50\n\nOlly Alexander says It's A Sin helped him confront his 'fear of HIV and sex'... as Tatler cover star reveals what he really thinks of his Eurovision nightmare\n\nRuPaul's Drag Race UK star Pixie Polite is 'punched' in 'homophobic assault' at Tesco as police launch hate crime probe\n\nBella Hadid goes bra-free in a plunging silky slip dress as she joins friends for a baby shower\n\nJack Black is seen for the first time since 'drama' with friend George Clooney\n\nHulk Hogan's devastated ex-wife says she is 'melting down' after death of WWE legend\n\nLiverpool and England footballer's daughter lands lead role as Katniss Everdeen in the first ever stage adaptation of The Hunger Games\n\nNetflix axes 'gem of a series' hailed as 'fantastically binge-worthy' despite perfect 100% Rotten Tomatoes score\n\nKylie Bax, 50, posed for Playboy, acted with Kirsten Dunst and dated Donald Trump, see her now\n\nBatman and Rambo star Alon Aboutboul has died: Tributes pour in as Israeli star passes away after collapsing on a beach\n\nSo are Pamela Anderson and Liam Neeson dating... or is it all just a publicity stunt? Body language expert reveals what their flirt fest REALLY means\n\nEsme Creed-Miles appears to confirm engagement to girlfriend Daisy Maybe as Hanna actress shares adorable new snaps with very telling clue\n\nBack to top\n\nVideo Archive\n\nTopics Index\n\nText-based site\nReader Prints\nTop of page\n\nPublished by Associated Newspapers Ltd\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout Daily Mail\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"The segment had been a fixture of series past as couples were tasked with looking after some adorable new arrivals, with mixed results.","url":"https://www.dailymail.co.uk/tv/article-14956931/Love-Island-baby-challenge-RETURN.html","image":"https://i.dailymail.co.uk/1s/2025/07/31/00/100788203-0-image-m-18_1753918370012.jpg","video":null,"publish_date":"2025-07-30 23:37:45","author":"Editor,Laura Fox","authors":["Editor","Laura Fox"],"language":"en","source_country":"gb","sentiment":-0.024}]}