{"offset":0,"number":50,"available":13979,"news":[{"id":294355456,"title":"Trump floats selling $5 million 'gold card' as pathway to citizenship","text":"WASHINGTON (KABC) -- President Donald Trump announced his administration plans to sell a \"gold card\" - his version of a green card that will cost $5 million.\n\n\"We're going to be selling a gold card. You have a green card. This is a gold card. We're going to be putting a price on that card of about $5 million. And that's going to give you green card privileges. Plus, it's going to be a route to citizenship, and wealthy people will be coming into our country by buying this card,\" Trump said Tuesday in the Oval Office.\n\n\"They'll be wealthy and they'll be successful and they'll be spending a lot of money and paying a lot of taxes and employing a lot of people. And we think it's going to be extremely successful and never been done before anything like this,\" Trump added.\n\nCommerce Secretary Howard Lutnick suggested the program would begin in two weeks and replace the existing EB-5 immigrant investor program. He said the immigrants would be vetted and help to reduce the budget deficit.\n\nTrump said he expects companies will pay to get educated workers into the U.S. with gold cards and that the country could sell one million cards. The president said the card would be a path to citizenship, but people would not be buying access to citizenship.\n\nABC News and the Associated Press contributed to this report.","summary":"President Donald Trump announced his administration plans to sell a \"gold card\" - his version of a green card that will cost $5 million.","url":"https://abc7.com/post/donald-trump-floats-selling-5-million-gold-card-pathway-citizenship/15955212/","image":"https://cdn.abcotvs.com/dip/images/15955266_022525-trump-gold-card-clean-tn.jpg?w=1600","video":"https://vcl.abcotv.net/video/kabc/022525-kabc-4pm-trump-gold-card-vid.mp4","publish_date":"2025-02-26 01:00:48","author":"KABC,Marc Cota-Robles","authors":["KABC","Marc Cota-Robles"],"language":"en","category":"politics","source_country":"US","sentiment":-0.496},{"id":294355894,"title":"The king of chaos: Wall Street is losing faith in Donald Trump","text":"The Wall Street honeymoon Donald Trump experienced in the initial months of his new administration appears to be ending, with the share market sliding, bond yields falling, cryptocurrencies tumbling and consumer confidence evaporating.\n\nUntil a week ago, the US sharemarket was up 7.6 per cent from its level immediately before the November election. It has since fallen 3 per cent. The “Magnificent Seven” big technology stocks have fallen more than 6.5 per cent in the past week. Bitcoin, having soared 56 per cent in the post–election period, has lost 11 per cent of its value since last Friday.\n\nThe yields on Treasury bonds are also dropped with the yield on the benchmark 10–year bonds down from 4.55 per cent a week ago to 4.32 per cent.\n\nThe sudden loss of what had seemed significant momentum within the markets appears tied to the difference between the expectation Wall Street investors and US consumers had of the Trump administration and its reality.","summary":"The Wall Street honeymoon Donald Trump experienced in the initial months of his new administration appears to be ending.","url":"https://www.smh.com.au/business/markets/the-king-of-chaos-wall-street-is-losing-faith-in-donald-trump-20250226-p5lf7d.html","image":"https://static.ffx.io/images/$zoom_0.2763940972222222%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_480%2C$y_87/t_crop_custom/q_86%2Cf_auto/9188e091c4617bb63bac432d4333013953c2a8c7","video":null,"publish_date":"2025-02-26 00:59:27","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.576},{"id":294355558,"title":"Trump says he will offer ‘gold cards’ for $5 million path to citizenship, replacing investor visas","text":"By ELLIOT SPAGAT, Associated Press\n\nPresident Donald Trump said Tuesday that he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors.\n\n“They’ll be wealthy and they’ll be successful, and they’ll be spending a lot of money and paying a lot of taxes and employing a lot of people, and we think it’s going to be extremely successful,” Trump said in the Oval Office.\n\nCommerce Secretary Howard Lutnick said the “Trump Gold Card” would replace EB-5 visas in two weeks. EB-5s were created by Congress in 1990 to generate foreign investment and are available to people who spend about $1 million on a company that employs at least 10 people.\n\nLutnick said the gold card — actually a green card, or permanent legal residency — would raise the price of admission for investors and do away with fraud and “nonsense” that he said characterize the EB-5 program. Like other green cards, it would include a path to citizenship.\n\nAbout 8,000 people obtained investor visas in the 12-month period ending Sept. 30, 2022, according to the Homeland Security Department’s most recent Yearbook of Immigration Statistics. The Congressional Research Service reported in 2021 that EB-5 visas pose risks of fraud, including verification that funds were obtained legally.\n\nInvestors’ visas are common around the world. Henley & Partners, an advisory firm, says more than 100 countries around the world offer “golden visas” to wealthy individuals, including the United States, United Kingdom, Spain, Greece, Malta, Australia, Canada and Italy.\n\nTrump made no mention of the requirements for job creation. And, while the number of EB-5 visas is capped, Trump mused that the federal government could sell 10 million “gold cards” to reduce the deficit. He said it “could be great, maybe it will be fantastic.”\n\n“It’s somewhat like a green card, but at a higher level of sophistication, it’s a road to citizenship for people, and essentially people of wealth or people of great talent, where people of wealth pay for those people of talent to get in, meaning companies will pay for people to get in and to have long, long term status in the country,” he said.\n\nCongress determines qualifications for citizenship, but Trump said “gold cards” would not require congressional approval.","summary":"Commerce Secretary Howard Lutnick said the “Trump Gold Card” would replace EB-5 visas.","url":"https://www.ocregister.com/2025/02/25/trump-investor-visas/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/AP25030754942193.jpg?w=1024&h=684","video":null,"publish_date":"2025-02-26 00:56:31","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.047},{"id":294354530,"title":"DAILY MAIL COMMENT: A welcome first step to rebuilding defence","text":"For years, Britain's politicians have shamefully run down the Armed Forces that they have been so ready to send into battle or on vital operations. \n\nDriven too much by electoral imperatives and not enough by what is best for the country, successive governments' military policy amounted to cut, cut and cut again. \n\nThe end of the Cold War encouraged prime ministers to cash in what became known as the 'peace dividend'. \n\nMuch less was spent on defence and much more on voter-friendly programmes such as health and welfare. \n\nThis has left the Army, Royal Navy and RAF on their knees, with far fewer soldiers, ships and aircraft than they had in 1989. \n\nSuch neglect has inevitably jeopardised our security as a free nation. That's why, a year ago, the Mail launched our Don't Leave Britain Defenceless campaign, calling for a rise in defence spending – a case that seemed unarguable. \n\nSo Sir Keir Starmer is to be congratulated for agreeing to boost the MoD budget from 2.3 per cent of GDP to 2.5 per cent by 2027. This amounts to an extra £6billion a year. \n\nTo put that into context, in the last financial year the cost of defence was £54billion. The Prime Minister's intention to hit 3 per cent in the next Parliament is also welcome. \n\nDefence has historically been Labour's weak spot. \n\nBut given the growing threats encircling us – particularly from Russia – Sir Keir is right to start rebuilding our desperately undermanned and underequipped armed forces. \n\nAs he said, peace can only be won through strength. \n\nHis decision to slash the bloated overseas aid budget to accelerate military spending was commendably brave, bringing a predictable outpouring of hysteria from the Left. \n\n'A moral mistake,' moaned one Labour MP. To any reasonable person this is a welcome piece of realpolitik. \n\nMuch as the international development zealots wish otherwise, defence of the realm has to be the number one priority.\n\nThis is especially the case if Donald Trump is, as he suggests, serious about turning his back on Nato in such dangerous times. \n\nWith some justification, the President believes that penny-pinching European allies have been shirking their military obligations, leaving the US to pick up the tab. \n\nThe US siding with Russia in a UN vote over Ukraine has heightened concerns that Mr Trump will desert the 80-year-old transatlantic pact. \n\nIn just two weeks, his administration has demonstrated how alliances that seemed unshakeable can shift. \n\nBy pledging to boost military spending on the eve of his trip to Washington, Sir Keir hopes to persuade a sceptical President that Britain will play a greater part in the defence of the Continent – and convince other European nations to follow suit. \n\nHowever, we must not be wide-eyed. \n\nThere is some doubt Sir Keir's sums add up. While the £6 billion a year increase is positive, experts say that, given the deep cuts in recent years and a gaping hole in the MoD's finances, the PM is simply papering over the cracks.\n\n Indeed, have we enough troops to send as peacekeepers to Ukraine? So he must spend more. \n\nBorrowing to boost defence would increase our already gargantuan debt repayments, while imposing even higher taxes would risk sending Britain into a slump. \n\nThere is an obvious answer. Slashing some of the billions hideously frittered on sickness benefits to shore up our crumbling defences.\n\nBut has Sir Keir the backbone to press ahead with something else his backbenches would find unpalatable? He has little option. \n\nWith Europe in greater peril than at any time since the Second World War, it is essential Britain starts to stand on its own two feet.","summary":"DAILY MAIL COMMENT: Driven too much by electoral imperatives and not enough by what is best for the country, successive governments' military policy amounted to cut, cut and cut again.","url":"https://www.dailymail.co.uk/news/article-14436569/DAILY-MAIL-COMMENT-welcome-step-rebuilding-defence.html","image":"https://i.dailymail.co.uk/1s/2025/02/26/00/95588747-0-image-a-51_1740530118380.jpg","video":null,"publish_date":"2025-02-26 00:48:36","author":"Daily,Editor","authors":["Daily","Editor"],"language":"en","source_country":"gb","sentiment":-0.208},{"id":294353238,"title":"Ukraine, U.S agree to terms for rare earth minerals deal, sources say","text":"Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include access to Ukraine's rare earth minerals, three senior Ukrainian officials said Tuesday.The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that Ukraine urgently needs.The agreement could be signed as early as Friday and plans are being drawn up for Ukrainian President Volodymyr Zelenskyy to travel to Washington to meet Trump, according to one of the Ukrainian officials.Another official said the agreement would provide an opportunity for Zelenskyy and Trump to discuss continued military aid to Ukraine, which is why Kyiv is eager to finalize the deal.President Donald Trump, speaking to reporters in the Oval Office, said he'd heard that Zelenskyy was coming and added that \"it's okay with me, if he'd like to, and he would like to sign it together with me.\"Trump called it \"a very big deal,\" adding that it could be worth a trillion dollars. It could be whatever, but it's rare earths and other things.\"According to one Ukrainian official, some technical details are still to be worked out. However, the draft does not include a contentious Trump administration proposal to give the U.S. $500 billion worth of profits from Ukraine's rare earth minerals as compensation for its wartime assistance to Kyiv.Instead, the U.S. and Ukraine would have joint ownership of a fund, and Ukraine would in the future contribute 50 percent of future proceeds from state-owned resources, including minerals, oil, and gas. One official said the deal had better terms of investments and another one said that Kyiv secured favorable amendments and viewed the outcome as \"positive.\"The deal does not, however, include security guarantees. One official said that this would be something the two presidents would discuss when they meet.The progress in negotiating the deal comes after Trump and Zelenskyy traded sharp rhetoric last week about their differences over the matter.Zelenskyy said he balked at signing off on a deal that U.S. Treasury Secretary Scott Bessent pushed during a visit to Kyiv earlier this month, and the Ukrainian leader objected again days later during a meeting in Munich with Vice President JD Vance because the American proposal did not include security guarantees.Trump then called Volodymyr Zelenskyy \"a dictator without elections\" and claimed his support among voters was near rock-bottom.But the two sides made significant progress during a three-day visit to Ukraine last week by retired Lt. Gen. Keith Kellogg, Trump's special envoy to Ukraine and Russia.The idea was initially proposed last fall by Zelenskyy as part of his plan to strengthen Kyiv's hand in future negotiations with Moscow.","summary":"The agreement could be signed as early as Friday, Ukrainian officials say.","url":"https://www.cbsnews.com/news/ukraine-us-economic-deal-rare-earth-minerals/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/12/07/1b794327-d394-4877-a136-f40d25dcf80c/thumbnail/1200x630/4f3cc516d1eb6e317fb61030dd7868f7/gettyimages-2188178846.jpg?v=78c95795a48cecb960a56aa16b9fa6dd","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3565715_hls/master.m3u8","publish_date":"2025-02-26 00:44:16","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.368},{"id":294353150,"title":"LILLEY: Trump’s threats on Canada’s economy simply won’t stop","text":"All the while, Trump continues to talk about Canada as a 51st state, an offer that the overwhelming majority of Canadians reject.\n\nAre these just negotiation tactics or is this something different?\n\nTrump clearly doesn’t like Prime Minister Justin Trudeau, and the feeling is mutual. The hatred between these two men is partly why Canada is in the crosshairs of the American president. This wouldn’t be happening with almost anyone else in power in Canada, there could be a discussion or negotiation, but not between Trump and Trudeau.\n\nTwo recent polls, from Leger and Ipsos, two of Canada’s most respected polling firms, show that if an election were held now, a Mark Carney-led Liberal Party would squeak past Pierre Poilievre and the Conservatives to hold onto power. Based on Carney’s policies, this is exactly the wrong move for voters to be making.\n\nWhile voters might look at Carney’s resume as a central banker and economist, he has no ability or experience to deal with a political animal like Donald Trump. Nor do his policies, all rooted in green net-zero ideology, light the path forward that Canada needs.\n\nTo respond to Trump, we need thinking that is racially different from the last decade, we need Pierre Poilievre and the Conservatives. Without that, Canada will wither on the vine.","summary":"He threatens tariffs, says Keystone XL should come back and then says America doesn't need Canadian oil at all.","url":"https://torontosun.com/opinion/columnists/trumps-threats-on-canadas-economy-simply-wont-stop","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/07/IMG_4918-e1690750157834.jpg?quality=5&strip=all&w=100&sig=eoHem78C-zh8eyqD8ZarMA","video":null,"publish_date":"2025-02-26 00:41:25","author":"Brian Lilley","authors":["Brian Lilley"],"language":"en","category":"politics","source_country":"CA","sentiment":0.098},{"id":294351156,"title":"Opinion Piece: Criticism of Armored Teslas Sparks Online Backlash","text":"Sometimes, you look at an X thread, started (almost always) by a clueless leftist, and wonder just what the heck they were thinking. Or, perhaps, not thinking, as when one of them gets something catastrophically wrong, as in, blaming one administration for the acts of the previous administration, thereby stepping on a certain protuberance in front of the whole world when about six seconds on Google could have told them the truth.\n\nCase in point: Congressman Greg Casar (D-TX), who took to X to lambaste the Trump administration for dumping $400 million in taxpayer’s money into Teslas. \n\nDonald Trump’s State Department tried to funnel $400 million to Elon Musk’s Tesla.They got caught. Then they lied about it.This isn’t efficiency — it’s corruption.https://t.co/LsXf3GyPFb— Congressman Greg Casar (@RepCasar) February 25, 2025\n\nThe problem? The Tesla deal was the Biden administration’s baby. Trump had nothing to do with it. No money ever changed hands. (Maybe Tesla wouldn’t agree to a 10 percent takeoff for “the Big Guy.”) Tesla’s own CEO, Elon Musk, replied and, as my grandfather would have said, laid a whoopin’ on the clueless Texas Democrat.\n\nGreg Casar is a big fat liar 🤥 pic.twitter.com/U2r17IuYcX— Elon Musk (@elonmusk) February 25, 2025\n\nNow, as if getting called out as a “big fat liar” by Elon Musk wasn’t enough, all of X leaped on the Texas Congressman like a pack of wolverines tearing apart a moose carcass.\n\nYou are keep lying about everything these Tesla contract started in 2022 because the insane Green new deal you guys preach about. here’s the source pic.twitter.com/laIqiIbKHL— Al Ebadi (@awsalebadi) February 25, 2025\n\nHonestly, Congressman Casar could have looked it up himself. In, like I said, maybe six seconds. To Greg Casar, we can only say this: There’s this new thing all the kids are doing, Congressman, it’s called “the internet,” and it allows you to look things up without having to get in your car and drive to the library. You should look into it.\n\nBut wait! There’s more!\n\nIt was Biden State Department that issued that contract.Trump asserted he has no intention of following through on it.You are an idiot and a liar.A.K.A. a Democrat.@CommunityNotes pic.twitter.com/y1CzeHMmEa— Viva Frei (@thevivafrei) February 25, 2025\n\nHilarious! Taking a break from defending the @DNC‘s USAID theft of Billions of tax dollars… Desperate America-hating, Marxist Islamist serial liar @RepCasar is so pathetic that he forgets to mention it was a Biden contract!https://t.co/F63otpQ3Js— ConserValidity (@ConserValidity) February 25, 2025\n\nOh, look – just as I was saying:\n\nCongressman you are young, I’m sure you know about technology. All you need to do, or advise your staff to do, before putting something out like this is fact check in AI. You can use Perplexity or ChatGPT if you hate Elon/X/Grok. pic.twitter.com/Qzjehq1Oix— David Nage🎯 (@DavidNage) February 25, 2025\n\nThis is a serious case of “open mouth, insert foot.” But Tesla, a year ago the darling of the left for their “emissions-free” automobiles, has become the favorite target of the left’s corruption claims because the company’s CEO had the temerity to disagree with the leftist swamp.\n\nMy colleague Nick Arama did a couple of great pieces on this non-contract","summary":"Internewscast Journal\n\nInternewscast\n\n\nSometimes, you look at an X thread, started (almost always) by a&#8230;\n\n\nThis Post: Opinion Piece: Criticism of Armored Teslas Sparks Online Backlash first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/opinion-piece-criticism-of-armored-teslas-sparks-online-backlash/","image":"https://media.townhall.com/cdn/hodl/2023/348/c8d4334a-54b7-4fc2-af87-c70898c52873.png","video":null,"publish_date":"2025-02-26 00:31:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.504},{"id":294353900,"title":"Tesla Shares Fall 8% as Postelection Surge Dissipates","text":"Shares of Tesla had been on a tear since Donald Trump won the presidential election. Investors were betting that the carmaker would benefit from the more than $250 million that its CEO, Elon Musk, spent to support the Trump campaign.\n\nBut an 8% decline in Tesla's stock Tuesday all but wiped out what was left of that rally. Investors who once thought that Trump could help clear regulatory hurdles for Tesla autonomous driving technology have grown concerned that Musk is spending too much time in Washington while Tesla sales plummet.\n\nThey also worry that Musk's immersion in right-wing politics, including his endorsement of a far-right party in German elections on Sunday, is alienating significant numbers of buyers. In the United States, even some Republicans have become alarmed at Musk's slash-and-burn cost cutting as head of the so-called Department of Government Efficiency.\n\nThe decline in the shares, which has pulled Tesla's market value below $1 trillion, threatened Musk's status as the richest person in the world because much of his wealth is in Tesla stock. And the declines will stir further unrest among investors and employees who are upset that Musk has not articulated a plan to halt steady erosion of market share in the United States, Europe and China.\n\nThe shares closed at $302.80 Tuesday, the lowest since Nov. 7, two days after the election. That was down 37% from a peak of $479.86 at the close on Dec. 17.\n\nThe losses Tuesday were at least partly a reaction to a catastrophic decline in Tesla's European sales, which fell 50% in January from a year earlier, according to new-car registrations tallied by the European Automobile Manufacturers' Association. Tesla sales fell in the region even as the overall market for electric vehicles surged 34%, according to a report by the association on Tuesday.\n\nTesla's performance recently has shaken the faith of some investors who have long been optimistic about the company's prospects. Gary Black, managing partner of the Future Fund, who has 488,000 followers on X, said on the social network Sunday that he had been \"wrongly bullish\" about Tesla \"for four years now.\"\n\nBlack noted that sales of the Cybertruck pickup, Tesla's newest vehicle, have been disappointing and that the company has been forced to cut prices for its Model 3 sedan and Model Y sport utility vehicle to prop up sales, cutting deeply into profit.\n\nBut he said that his firm still owned Tesla shares and that it expected them to recover to $380 in six to 12 months.\n\nThis article originally appeared in The New York Times.","summary":"Shares of Tesla had been on a tear since Donald Trump won the presidential election. Investors were betting that the carmaker would benefit from the more than $250 million that its CEO, Elon Musk, spent to support the Trump campaign.","url":"https://www.berkshireeagle.com/nyt/tesla-shares-fall-8-as-postelection-surge-dissipates/article_62d43d83-d33b-597b-8e43-fa4354d65805.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:30:54","author":"Jack Ewing","authors":["Jack Ewing"],"language":"en","source_country":"us","sentiment":-0.329},{"id":294350656,"title":"Letters: Oakland mayor is the wrong job for Barbara Lee","text":"Mayor is the wrong\njob for Barbara Lee\n\nRe: “Lee wants to be mayor. What’s her platform?” (Page A1, Feb. 22).\n\nAccording to your profile Saturday, Barbara Lee has accepted large donations from PG&E as well as from unions representing Oakland city employees. Do we really want a mayor beholden to PG&E, the criminal utility ripping us off, and to the unions she would be negotiating with on behalf of the city? I think not.\n\nFurther, Lee doesn’t seem to understand some real basics about Oakland realities, like why Oakland police work so much overtime — we don’t have enough police. And we can’t get more of them on patrol if there aren’t enough bodies, no matter how much “bureaucracy” we cut. We also can’t solve immediate budget problems by addressing the long process of modifying Oakland’s governmental structure.\n\nI supported Barbara Lee as our representative in Congress, where she did a fine job, but she’s not the right person for mayor of Oakland.\n\nBeth Weinberger\n\nTyler’s Law could do\nmore for transparency\n\nRe: “New anti-hazing law aims to hold California colleges accountable” (Feb. 20).\n\nIt’s unfortunate that it took a hazing death from six years ago for California’s government to hold colleges accountable, especially for Greek life.\n\nFraternities and sororities can only do so much to maintain the secrecy of some activities under the guise of “protecting tradition” and fostering brotherhood and sisterhood. I know how significant tradition is, but pledges’ safety is more important. Although I’m not involved in Greek life, I’m concerned about my peers planning to join recruitment. I sometimes wonder if they’re hiding pain from hazing under color-coordinated initiation posts.\n\nI’m glad the Hilliard family coordinated with a past assemblymember to draft Tyler’s Law. If the law can be extended to require schools to publicize cases on their Greek life pages and have fraternities and sororities mention their number of violations (similar to Sam’s Law in Washington), it can encourage transparency and accountability.\n\nVictoria Rose Leon\nAmerican Canyon\n\nTrump, Vance corrupting\ndemocracy for own ends\n\nRe: “Vance’s Munich disgrace is an echo of the past” (Page A6, Feb. 21).\n\nBret Stephens’ commentary about J.D. Vance’s trip to Germany to “lecture” attendees at the Munich Security Conference raises an important consideration for all living in democratic societies.\n\nBasically, democracy’s liberal process can be “weaponized”; that is, it can be used, often through lies or other devious means, to install regimes that are the antithesis of “democratic.” Once installed, such regimes can quickly proceed to destroy established government and democratic processes and to install totalitarian rule.\n\nAnyone who fails to see how all this might relate to what presently is happening in our own country should schedule an appointment with their optometrist.\n\nBill Gilbert\n\nCongressional GOP\nholds blame for Trump\n\nDonald Trump’s tendency to lie, bully, cheat, and misuse laws and policies for personal gain were well-known by all prior to the election, as was his lack of interest or knowledge about our country’s Constitution, system of checks and balances, laws and policies. Yet I don’t blame those who voted for him. Nobody, regardless of their political allegiance, ever expected him to misuse and abuse his powers to the extent that he has and continues to do.\n\nInstead, I blame the congressional majority who knows better, those whose oath of office pledged them to uphold the Constitution and the system of checks and balances created to assure this endeavor.\n\nSince that majority have placed loyalty to Trump and his agenda above their oath of office, their constituents are our nation’s last hope. Only you, their voters, have the power to hold them accountable for their inactions.\n\nLinda Thorlakson\nCastro Valley\n\nIs time running out\non U.S. democracy\n\nOn Feb. 19, Illinois Governor JB Pritzker, who is Jewish, delivered his State of the State address to the people of Illinois.\n\nHe described how the Nazis destroyed Germany’s Constitution post-election in 1933. He stated that the “root that tears apart your house’s foundation begins as a seed of distrust, hate and blame.” The everyday Germans were angry about inflation and looked for someone to blame, so they blamed all who didn’t look exactly like them, especially the Jews.\n\nGiven what has occurred here since our election, he stated the “authoritarian playbook is laid bare here” and asked, “What comes next?” He stated, “It took the Nazis one month, three weeks, two days, eight hours and forty minutes to dismantle a constitutional republic. Tyranny requires your fear, silence and compliance. Democracy requires your courage.”\n\nFeb. 20 was one month since Trump took office. Is our time almost up, too?\n\nRamona Krausnick","summary":"Also: Tyler's Law &#124; Corrupting democracy &#124; GOP's blame &#124; Time's up? East Bay Times reader letters to the editor for Feb. 26, 2025.","url":"https://www.mercurynews.com/2025/02/25/letters-oakland-mayor-wrong-job-barbara-lee/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/EBT-L-LEEMAYOR-0107-4.jpg?w=1024&h=698","video":null,"publish_date":"2025-02-26 00:30:04","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.269},{"id":294353780,"title":"US ‘not providing’ military assistance to Ukraine – Trump","text":"President Donald Trump has claimed that Washington is currently not providing any new military assistance to Kiev, insisting that American taxpayers should first recover their already invested money, while the EU and NATO states should take on greater responsibility for Ukraine’s security.\n\nTrump has been demanding access to Ukraine’s natural resources as compensation for the aid provided to Kiev throughout its conflict with Russia. Reports suggest that after multiple delays Kiev has agreed, and the document could be signed as early as Friday.\n\nWhen asked what Kiev would get in return, Trump stated on Tuesday that Ukraine had already received “$350 billion in lots of equipment, military equipment, and the right to fight on, and originally the right to fight.”\n\n“Look… without the United States and its money and its military equipment, this war would have been over in a very short period of time,” Trump told journalists at the White House. “Without American equipment, this war would have ended quickly – American money too, a lot of money.”\n\nWhen questioned about the sustainability of continued weapons and ammunition deliveries to Ukraine, Trump said shipments could “go forward for a while, maybe until we have a deal with Russia.”\n\n“Look, we need to have a deal with Russia, otherwise it’s gonna continue. It could go on for a while, or it could get settled quickly. I spoke with President Putin, and I think he wants to settle it,” Trump stated.\n\n“I just told you. Right now, we are not providing anything,” Trump claimed, when pressed on whether the US would send Kiev additional air defenses. When asked if Washington would resume military support in the future, he reiterated that “Europe will be largely responsible for that.”\n\nKiev has disputed Trump’s estimate of $350 billion, insisting that Washington has actually provided less than $100 billion in aid. Since February 2022, the US Congress has appropriated $183 billion for Ukraine, including more than $66 billion in direct security assistance, according to the Pentagon and Ukraine Oversight, the interagency group responsible for presenting reports to Congress.\n\nThe Trump administration has repeatedly signaled its intent to minimize US involvement once a potential truce is reached, instead aiming to transfer the financial and logistical burden of supporting Kiev to regional allies.","summary":"President Donald Trump has claimed that Washington is currently not providing any new military assistance to Kiev \nRead Full Article at RT.com","url":"https://www.rt.com/news/613311-trump-ukraine-military-aid/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67be5f5d85f54011fd1d9723.jpg","video":null,"publish_date":"2025-02-26 00:29:37","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.493},{"id":294353898,"title":"What We Know About the U.S.-Ukraine Minerals Deal","text":"Ukraine has agreed to a deal to turn over the revenue from some of its mineral resources to the United States, an American and a Ukrainian official said Tuesday, after an intense pressure campaign from President Donald Trump.\n\nTerms of the Agreement\n\nThe final details of the agreement, including the amount of money that Ukraine will pay the United States, are not yet known.\n\nBut a draft agreement discussed Tuesday no longer included the demand that Ukraine contribute $500 billion to a fund owned by the United States. It also did not include a clause requiring Ukraine to pay back the United States twice the amount of any future U.S. aid.\n\nThe Ukrainians became more comfortable with the deal in the past few days after the Americans removed some of the more onerous conditions.\n\nThe draft agreement said Ukraine would contribute to a fund half of its revenues from the future monetization of natural resources, including critical minerals, oil and gas. The United States would own the maximum financial interest in the fund allowed under U.S. law, though not necessarily all. And the fund would be designed to reinvest some revenues into Ukraine.\n\nSecurity Guarantee\n\nUkrainian President Volodymyr Zelenskyy had repeatedly pressed for security guarantees for his country in exchange for mineral rights as Russia's war has entered its fourth year. But draft agreements reviewed by The New York Times included no such security commitment.\n\nApproval Process\n\nA final translated draft of the agreement was sent to Ukraine on Tuesday, according to the American official.\n\nTreasury Secretary Scott Bessent and his Ukrainian counterpart, the American official said, are expected to sign the agreement first, and then Zelenskyy is expected to go to Washington for a signing with Trump.\n\nWhat's at Stake\n\nUkraine controls more than 100 major deposits of critical minerals, according to a study by the Kyiv School of Economics, along with modest oil and natural gas reserves.\n\nTitanium is used in construction, airplanes, orthopedic implants and as an additive in paint and cosmetics, including sunscreen, among many other things. Titanium mines in central Ukraine account for about 6% of global production, according to Ukrainian media.\n\nLithium is a crucial element in batteries, including those in electric vehicles, and in other industrial products, including some medications. Ukraine has a third of Europe's total reserves, although some sites are in war-contested areas. Before the war with Russia, Ukrainian officials suggested to Elon Musk that he invest in Ukrainian lithium mines.\n\nUranium is used in nuclear power plants and nuclear weapons. Ukraine has the largest uranium reserves in Europe.\n\nRare earths are a group of more than a dozen metals, much less abundant than titanium or lithium, that are used in many high-tech sectors, including green energy, electronics and aerospace. Ukraine has substantial reserves that are mostly untapped, and it is unclear how expensive they would be to extract.\n\nThis article originally appeared in The New York Times.","summary":"Ukraine has agreed to a deal to turn over the revenue from some of its mineral resources to the United States, an American and a Ukrainian official said Tuesday, after an intense pressure campaign from President Donald Trump.","url":"https://www.berkshireeagle.com/nyt/what-we-know-about-the-u-s--ukraine-minerals-deal/article_07686a35-e698-589a-ae90-8ff12ff9f662.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:28:02","author":"The New York Times","authors":["The New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":0.051},{"id":294354508,"title":"Kremlin denies Donald Trump's claim it agreed to plans for British and international peacekeepers in Ukraine","text":"Kremlin denies Donald Trump's claim it agreed to plans for British and international peacekeepers in Ukraine\n\nPODCAST: All the biggest news and insider gossip from the Trump administration – listen to Welcome to MAGAland here\n\nBy MARK NICOL\n\nPublished: 00:07 GMT, 26 February 2025 | Updated: 00:25 GMT, 26 February 2025\n\nThe Kremlin has denied White House claims that it has approved plans for British and international troops to act as peacekeepers in Ukraine.\n\nThere was optimism this week after US President Donald Trump said he had asked Vladimir Putin about Nato and European members serving in the war zone and the Russian president confirmed he had ‘no problem with it’.\n\nBut yesterday the Kremlin flatly denied there had been any change in Russia’s position, insisting such a scenario was a red line.\n\nIts denial means Russia is yet to make any concessions as part of a deal to end the war. \n\nHowever, UK military chiefs are continuing with plans for the deployment of between 10,000 to 15,000 troops.\n\nThere was optimism this week after US President Donald Trump, pictured, said he had asked Vladimir Putin about Nato and European members serving in the war zone and the Russian president confirmed he had ‘no problem with it’ \n\nBut yesterday the Kremlin flatly denied there had been any change in Russia’s position, insisting such a scenario was a red line. Pictured: Russian president Vladimir Putin\n\nBrit defence experts fear US has 'changed sides' to give Putin a victory - and dub America an ENEMY\n\nThey would be drawn from across the Army, RAF and Royal Navy in a move expected to cost £4billion a year.\n\nPutin’s spokesperson Dmitry Peskov, while denying plans for peacekeepers to deploy to Ukraine from Nato countries, said he welcomed the US’s more ‘balanced’ approach to the conflict.\n\nHe added he hoped the US would be able to persuade Ukraine’s European partners, such as Britain, to ‘gravitate towards greater balance’.\n\nMeanwhile, as Ukraine sealed its deal with the US over its rare earth minerals, Putin said he was ready to ‘offer’ resources to American partners in joint projects, including mining in what he described as Russia’s ‘new territories’.\n\nBy this, Putin meant land in Ukraine occupied by Russian troops. He said: ‘As for the new territories, we are ready to attract foreign partners . . . these are historical territories which have returned to the Russian Federation. I want to emphasise Russia has significantly more resources of this kind than Ukraine.’\n\nNATOVladimir PutinRussiaWhite House\n\nShare or comment on this article:\nKremlin denies Donald Trump's claim it agreed to plans for British and international peacekeepers in Ukraine\n\nAdd comment","summary":"Yesterday the Kremlin flatly denied there had been any change in Russia 's position, insisting such a scenario was a red line.","url":"https://www.dailymail.co.uk/news/article-14436455/Kremlin-denies-Trumps-claim-plans-British-international-peacekeepers-Ukraine.html","image":"https://i.dailymail.co.uk/1s/2025/02/26/00/95588099-0-image-m-40_1740528370410.jpg","video":null,"publish_date":"2025-02-26 00:25:13","author":"Editor,Mark Nicol","authors":["Editor","Mark Nicol"],"language":"en","category":"politics","source_country":"gb","sentiment":0.044},{"id":294353912,"title":"Some Republicans Sharply Criticize Trump's Embrace of Russia at the U.N.","text":"WASHINGTON -- A band of traditional Republicans in Congress sharply criticized the Trump administration this week for siding with Russia at the United Nations on resolutions regarding the war in Ukraine, even as the majority of the GOP turned a blind eye to the United States' sudden embrace of a longtime adversary.\n\n\"The Trump Administration royally screwed up today on Ukraine,\" Rep. Don Bacon, R-Neb., wrote on social media Monday night. \"The vast majority of Americans stand up for independence, freedom and free markets, and against the bully and invader.\"\n\nThe reproach from Bacon and others came after the United States on Monday voted against a U.N. General Assembly resolution, introduced by Ukraine, that condemned Russia for invading Ukrainian territory and demanded that it withdraw and face repercussions for war crimes. Shortly afterward, the United States succeeded in passing a U.N. Security Council resolution calling for peace in Ukraine that did not chastise Russia. Key U.S. allies, including Britain and France, abstained.\n\n\"This posture is a dramatic shift from American ideals of freedom and democracy,\" Sen. John Curtis, R-Utah, wrote on social media Monday night, saying he was \"deeply troubled by the vote,\" which had \"put us on the same side as Russia and North Korea.\"\n\nThe Russian representative to the United Nations welcomed the move by the United States and said the new stance gave Moscow \"a certain optimism\" about the future of European security.\n\nThe position adopted by the Trump administration would have been anathema in recent years, during which the United States shipped arms to help Ukraine's fighters beat back Russia's invasion and sent funds to prop up the war-torn country's civilian infrastructure. Even many Republicans who bristled at the tens of billions of dollars in aid packages that Congress approved for Ukraine were resolute that Russia and Vladimir Putin, its president, were the aggressors in the conflict.\n\nBut as President Donald Trump makes a point of pursuing friendlier relations with Moscow -- a pivot that recently included accusing Ukraine's president, Volodymyr Zelenskyy, of being a \"dictator\" and even suggesting that Ukraine started the war -- few Republicans in Congress have been willing to denounce the shift.\n\nEven some of those who did criticize Trump for his administration's alignment with Russia at the United Nations this week did so without calling out the president or his advisers by name.\n\n\"Refusing to acknowledge Russia as the undeniable and unprovoked aggressor is more than an unseemly moral equivalency -- it reflects a gross misunderstanding of the nature of negotiations and leverage,\" Sen. Mitch McConnell, R-Ky., wrote in a statement Monday. He blamed the Biden administration in part for the present state of affairs with Trump, arguing that President Joe Biden's \"shameful hesitation and half-measures threaten to give way to something even more disgraceful: the obstinate denial of America's security interest in Ukraine's success.\"\n\nSen. Bill Cassidy, R-La., used the words of a judge at the Nuremberg Trials in 1946, in which an international military tribunal prosecuted Nazi officials after World War II, to express his disapproval of the Trump administration's U.N. votes.\n\n\"To initiate a war of aggression, therefore, is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole,\" he wrote on social media.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- A band of traditional Republicans in Congress sharply criticized the Trump administration this week for siding with Russia at the United Nations on resolutions regarding the war in Ukraine, even as the majority of the GOP turned a…","url":"https://www.berkshireeagle.com/nyt/some-republicans-sharply-criticize-trumps-embrace-of-russia-at-the-u-n/article_8fff9846-3070-5c9a-bc5e-b366cc1df03e.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:24:36","author":"Karoun Demirjian","authors":["Karoun Demirjian"],"language":"en","category":"politics","source_country":"us","sentiment":0.004},{"id":294351602,"title":"Trump Media, Rumble get favorable ruling from American judge in censorship dispute with Brazil","text":"A US judge on Tuesday sided for now with President Donald Trump’s media company in a dispute over whether a top Brazilian judge illegally censored right-wing voices on social media in the United States.\n\nIn a case brought by Trump Media & Technology Group and the video-sharing platform Rumble, US District Judge Mary Scriven said Rumble need not comply with the Brazilian judge’s order it remove US-based accounts of a leading supporter of former Brazilian President Jair Bolsonaro.\n\nTrump Media and Rumble had sued Brazilian Supreme Court Justice Alexandre de Moraes on Feb. 19, accusing him of trying to “censor legitimate political discourse in the United States” protected by the US Constitution’s First Amendment, by ordering the removal of the accounts.\n\nScriven, however, said Moraes’ order has yet to be enforced, and was not served upon Trump Media and Rumble in accordance with international treaties.\n\nAs a result, the Tampa, Florida-based judge said Trump Media and Rumble are not obligated to comply with Moraes’ orders, making their lawsuit and request for a temporary restraining order premature.\n\nIn a statement, Rumble called the order “a complete victory for free speech” that “sends a strong message to foreign governments that they cannot bypass US law to impose censorship on American platforms.”\n\nTrump Media and its lawyers did not immediately respond to requests for comment. Brazil’s Supreme Court did not immediately respond to a similar request.\n\nMoraes had ordered Rumble to block accounts belonging to Allan dos Santos, a digital influencer close to Bolsonaro.\n\nDos Santos lives in the United States and is considered a fugitive in Brazil, where he faces an arrest warrant in connection with probes into the spread of disinformation and hate.\n\nTrump Media and Rumble sued several hours after Moraes was asked to consider whether Bolsonaro, a Trump ally, should be arrested for plotting to overthrow Brazil’s government following his 2022 election loss.\n\nTrump, a Republican, was also indicted on charges he tried to overturn his own 2020 presidential election loss to Democrat Joe Biden. That case has been dropped.\n\nOn Feb. 21, Brazil’s Supreme Court suspended Rumble, citing its failure to comply with court orders.\n\nRumble’s suspension mirrored a since-lifted suspension against Elon Musk’s X last year.\n\nMoraes has spearheaded a crusade against perceived attacks on democracy and political use of disinformation, drawing the ire of Bolsonaro supporters and Musk.\n\nTrump owns about 53% of Trump Media, which runs his Truth Social platform.\n\nHis stake is in a trust overseen by his son Donald Trump Jr. Vice President JD Vance invested in Rumble in 2021.\n\nScriven was appointed district judge by former President George W. Bush in 2008, after serving 11 years as a federal magistrate judge.","summary":"Truth Social parent Trump Media and Rumble had sued Brazilian Supreme Court Justice Alexandre de Moraes on Feb. 19.","url":"https://nypost.com/2025/02/25/business/trump-media-rumble-can-ignore-brazilian-order-they-deem-censorship-for-now-us-judge/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/trump-media-brazil-judge.jpg?quality=75&strip=all&1740509797&w=1200","video":null,"publish_date":"2025-02-26 00:23:38","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.23},{"id":294353936,"title":"Under Trump, America's New Friends: Russia, North Korea and Belarus","text":"(News Analysis)\n\nWASHINGTON -- If the old saying is true, that you are known by who your friends are, then President Donald Trump may be telling the world something about who he plans to be in this second term.\n\nIn a move that redrew the international order, Trump this week had the United States vote against a U.N. General Assembly resolution condemning Russia's invasion of Ukraine on the third anniversary of the war.\n\nAmong the countries that Trump joined in siding with Russia? North Korea, Belarus, Syria and Sudan.\n\nThose he stood against? Britain, France, Germany, Canada, Italy, Japan and most of the rest of the world.\n\nIt would be hard to think of a starker demonstration of how radically Trump is recalibrating America's place in the world after barely a month back in office. He is positioning the United States in the camp of the globe's chief rogue states in opposition to the countries that have been America's best friends since World War II or before.\n\nThe fracturing of the U.S. bond with its traditional allies carries profound implications for the future of American foreign policy. Even as leaders from Poland, France and Britain are heading to Washington this week to try to lure Trump back into the fold, they and their compatriots face the reality that he does not share their values or see their priorities being in concert with American interests.\n\nIf the United States is going to align itself with international outcasts like Russia and the others, it could force Europe, Canada and Asian allies such as Japan and South Korea to go their own way and look elsewhere for alliances. At the same time, Trump's deference to Moscow has allowed Russia out of the diplomatic isolation chamber that Washington and the West sought to construct in the three years since its full-fledged invasion of Ukraine.\n\n\"Trump is transparently and unabashedly doing Russia's bidding in this and many other ways, aligning the U.S. with our adversaries and against our treaty allies,\" said Susan E. Rice, who served as President Barack Obama's ambassador to the United Nations and later his national security adviser. \"We all have to ask ourselves why?\"\n\nEuropean leaders were stunned and flummoxed by the U.S. vote at the U.N. General Assembly on Monday as well as the American push for an alternate resolution through the Security Council that did not blame Russia for the invasion. On that measure, the United States, China and Russia voted together while Britain, France and other European nations abstained.\n\n(BEGIN OPTIONAL TRIM.)\n\nEven some Republicans, who have strained to avoid publicly breaking with Trump even over decisions they privately deplored, were finally provoked into speaking out.\n\n\"I was deeply troubled by the vote at the U.N. today which put us on the same side as Russia and North Korea,\" Sen. John Curtis, R-Utah, wrote on social media. \"These are not our friends. This posture is a dramatic shift from American ideals of freedom and democracy. We all want an end to the war, but it must be achieved on terms that ensure Ukraine's sovereignty and security and that deter Putin from pursuing further territorial ambitions.\"\n\nRep. Don Bacon, R-Neb., expressed consternation that the president would take the side of the invader. \"The Trump Administration royally screwed up today on Ukraine,\" he said online. \"The vast majority of Americans stand up for independence, freedom and free markets, and against the bully and invader.\"\n\n(END OPTIONAL TRIM.)\n\nTrump's advisers argue that he is initiating a complicated, sensitive negotiation to end the war and that those criticizing him for adopting Russia's talking points must oppose an end to the violence in Ukraine. The last president, Joe Biden, did not make peace, therefore Trump's approach must be better, or so the reasoning goes.\n\n\"The president knows how to make a deal better than anyone who has ever assumed the office of the American presidency, and in order to make a deal, you have to bring both sides to the table,\" Karoline Leavitt, the White House press secretary, said at her briefing Tuesday. \"And typically when you make a good deal, both sides leave that table a little bit unhappy.\"\n\nBut if the goal was not to alienate President Vladimir Putin of Russia as Trump seeks an agreement, he has demonstrated no reticence about alienating the person on the other side of the war, President Volodymyr Zelenskyy of Ukraine. While declining to criticize Putin or Russia, Trump has falsely claimed that Ukraine \"started\" the war and called the popularly elected Zelenskyy a \"dictator without elections.\"\n\nThe United States has rarely found common cause with the likes of North Korea and Belarus on questions of major importance while stiff-arming Britain and France. A State Department report in 2023 found that among the countries that the United States voted with most often at the United Nations that year were Canada, Britain, Australia and France. The countries that United States was most at odds with on contested U.N. votes included Syria, Nicaragua, Iran, North Korea, China, Cuba, Belarus and Russia.\n\n(BEGIN OPTIONAL TRIM.)\n\nThe main area where the United States typically finds itself at odds with its major allies is the Israeli-Palestinian conflict, where America mostly has stood against U.N. resolutions criticizing Israel even as European nations more often vote for them. Past diplomats at the U.N. said they could not recall a time when the United States had joined Russia and other outlier states on a question of such importance.\n\n\"When I was U.N. ambassador, had I received instructions from the State Department and White House to hang our European allies out to dry and vote with the axis of autocrats, including Russia, North Korea and Belarus, I would have concluded that the Russians had hacked and corrupted our communications systems,\" Rice said.\n\n(END OPTIONAL TRIM.)\n\nTrump evinces no concern about being left outside the global consensus. He hosted President Emmanuel Macron of France this week without evident rancor even as the visiting leader tried to gently coax him into being more wary of Russia and more willing to defend Ukrainian security. Trump smiled and shook hands and seemed thoroughly unmoved.\n\nHe will host Prime Minister Keir Starmer of Britain on Thursday at the White House for another session that will further test the new reality of the Atlantic alliance as the British leader seeks to convey the importance Europe attaches to standing together with the United States. But European officials are not holding out great hope for success.\n\nThe reality is that Trump is not offended by leaders like Putin and Kim Jong Un of North Korea. He has always expressed admiration for autocrats. On the wall of his office at Mar-a-Lago after he left the White House in 2021, he happily hung a picture of himself with Kim, a ruthless dictator whose government is accused by the State Department of extrajudicial killings, arbitrary arrest, torture, repression, coerced abortion and forced sterilization, among other human rights abuses.\n\nOther presidents have made common cause with unsavory characters and countries in realpolitik concessions to national interests, but generally without much enthusiasm and not usually at the expense of close allies. And Trump is willing to go further than most of his predecessors.\n\nDuring a news conference with Macron, the president brought up Crown Prince Mohammed bin Salman of Saudi Arabia. The CIA has called the prince a killer, reporting that he ordered the brutal murder and dismemberment of Jamal Khashoggi, a Washington Post columnist. Trump called the prince \"a fantastic young guy\" who is \"tremendously respected all over the world.\"\n\nTrump has had no such laudatory words lately for Zelenskyy, the embattled leader of a democracy invaded by a dictatorship. Ukraine is not part of the U.S. alignment, as Trump envisions it. While the United States was the only Group of 7 country to vote against the U.N. resolution, Trump is effectively assembling a new club, one with chapters in Moscow, Minsk and Pyongyang instead of London, Paris and Berlin.\n\nThis article originally appeared in The New York Times.","summary":"(News Analysis)","url":"https://www.berkshireeagle.com/nyt/under-trump-americas-new-friends-russia-north-korea-and-belarus/article_06da36e9-cb2a-535b-b983-46b7cde9d270.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:22:20","author":"Blox Content Management,Peter Baker","authors":["Blox Content Management","Peter Baker"],"language":"en","category":"politics","source_country":"us","sentiment":0.355},{"id":294351776,"title":"Trump Launching $5 Million ‘Gold Card’ Visas For Wealthy—What We Know About New Path To Citizenship","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nPresident Donald Trump told reporters Tuesday his administration plans to sell a “gold card” for $5 million that will provide wealthy non-citizens U.S. residency and a route to citizenship, announcing the visas as he spearheads a mass deportation initiative.\n\nTrump announced the card Tuesday. (Photo by JIM WATSON/AFP via Getty Images)\nAFP via Getty Images\n\nTrump said the card will cost “about $5 million” and give buyers the same privileges as green card holders, who have permanent residency and work authorizations in the U.S.\n\nThe president said the “wealthy people” who buy the card would be investing in the U.S. by “spending a lot of money, paying a lot of taxes and employing a lot of people.”\n\nThe card will launch some time over the next two weeks, according to Trump, who claimed his administration would not need congressional approval to establish the card “because we’re not doing citizenship, we’re doing the card.”\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\nWhat Will Happen To The Eb-5 Program?\n\nCommerce Secretary Howard Lutnick said the card will replace the EB-5 program, which allows immigrants to secure green cards if they create a business and at least 10 permanent full-time jobs for U.S. workers. It is unclear if EB-5 visa holders will lose their privileges if the program ends. EB-5 visa usage reached its highest point ever in fiscal year 2024, with at least 12,839 EB-5 visa numbers used through last July, according to State Department data cited by trade organization Invest In The USA. Lutnick also blasted the EB-5 program, calling it “full of nonsense” and “a way to get a green card that was low priced.”\n\nWhat Will The Gold Card Sales Be Used For?\n\nTrump said funds created by the gold card would primarily be used to pay down the national debt, estimating his administration will be able to sell 1 million cards and generate trillions in revenue.\n\nWill The Gold Card Provide U.s. Citizenship?\n\nNot outright, no. If the gold card has the same privileges as the green card, that means wealthy buyers will still lack citizenship rights including the right to vote, the right to run for public office and the right to obtain a U.S. passport. However, being a lawful permanent resident, which one can do with a green card, for at least five years is the most common path to U.S. citizenship, according to Citizenship and Immigration Services.\n\nTrump said Russian oligarchs would “possibly” be eligible for a gold card, adding “I know some Russian oligarchs that are very nice people.” Lutnick noted those applying for the card “will have to go through vetting, of course,” adding “we’re going to make sure they’re wonderful world-class global citizens.”\n\nKey Background\n\nThe Trump administration has attempted to ramp up the rate of deportations and arrests as the president looks to fulfill his campaign promise of mass deportations. A little over 37,000 people were deported in January, falling below the average deportations carried out by the Biden administration last year. Trump has signed executive orders calling for the detention of deported migrants at the Guantánamo Bay naval base, sending the military to the southern border and aiming to stop undocumented migrants from “taxpayer-funded benefits.” Illegal border crossings have decreased 94% year-over-year, Border Patrol Chief Mike Banks told CBS recently, with agents apprehending around 285 migrants at the southern border in a seven-day period compared to the 4,800 arrested during the same period last year.\n\nFurther Reading\n\nEverything To Know About Trump’s ‘Mass Deportation’ Plans—ICE Chief Removed Amid Push For More Arrests (Forbes)\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nAntonio Pequeño IV\n\nEditorial Standards\n\nForbes Accolades","summary":"Trump told reporters the card would come with green card privileges and create a route to U.S. citizenship for wealthy people.","url":"https://www.forbes.com/sites/antoniopequenoiv/2025/02/25/trump-launching-5-million-gold-card-visas-for-wealthy-what-we-know-about-new-path-to-citizenship/","image":"https://imageio.forbes.com/specials-images/imageserve/67be5d0c9e67975dbdfc41f8/0x0.jpg?format=jpg&crop=2046,1364,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-02-26 00:17:06","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.236},{"id":294355176,"title":"Some GOP lawmakers start to call out DOGE","text":"Republican lawmakers are starting to call out Elon Musk’s U.S. DOGE Service amid fierce pushback from their constituents, who have packed town halls and bombarded congressional offices with objections to the Trump administration’s dramatic cuts to the federal government.\n\nCongressional Republicans have been extremely reluctant to criticize President Donald Trump and his deputies, and GOP leaders remain broadly supportive of Musk’s project to shrink the federal government. But some lawmakers have publicly questioned the billionaire Trump donor’s methods in recent days. One House Republican called a social media post from Musk “unacceptable” on Tuesday after raising concerns about DOGE’s coordination with Congress in a meeting with colleagues.","summary":"Rep. Austin Scott (R-Georgia,)confirmed in an interview that he told colleagues DOGE needs to “measure twice, cut once” as it overhauls the government and objected to Musk sharing a post that suggested recipients of federal benefits are part of a “parasite class.”","url":"https://www.washingtonpost.com/politics/2025/02/25/doge-gop-lawmakers-concerns-musk/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DTHJCUQ5HWL6PDEDGENIZBN34Q_size-normalized.jpg&w=1440","video":null,"publish_date":"2025-02-26 00:17:01","author":"Hannah Knowles,Mariana Alfaro,Marianna Sotomayor","authors":["Hannah Knowles","Mariana Alfaro","Marianna Sotomayor"],"language":"en","category":"politics","source_country":"us","sentiment":0.188},{"id":294354372,"title":"Volodymyr Zelenskyy's big move with Donald Trump to stride towards peace settlement","text":"The European Union is reportedly making moves to secure its own deal for a share of Ukraine's mineral wealth. It comes amid rumours that Donald Trump and Kyiv are on the brink of signing an agreement this week.\n\nSince Mr Trump's return to the White House, US-Ukrainian relations have become increasingly strained and this week Donald Trump is ramping up pressure on Ukrainian President Volodymyr Zelenskyy to sign away up to 50% of its mineral supplies in exchange for more weapons. If a deal is reached between Trump and Kyiv it would grant US mining rights as part of a peace agreement.\n\nStephane Sejourne, the EU's industry commissioner claims: \"Twenty-one of the 30 critical materials Europe needs can be provided by Ukraine in a win-win partnership. The added value Europe offers is that we will never demand a deal that's not mutually beneficial,\" the French official stated after meeting with Ukrainian officials.\n\nREAD MORE: Meet and greet parking firm 'crashed couple's £157k BMW and dumped it in hedge'\n\nHis remarks came as Ukrainian officials indicated they were nearing a deal with the US over access to Ukraine's minerals. Trump has been promoting the £395 billion ($500 billion) agreement, seeking compensation for his country's wartime support for Kyiv, saying: \"I want them to give us something for all of the money that we put up.\" \n\nBut there is more to the deal than just the minerals agreement, Olha Stefanishyna, Ukraine's deputy prime minister, said: \"The minerals agreement is only part of the picture. We have heard multiple times from the US administration that it's part of a bigger picture.\"\n\nEuropean lawmaker Mr Sejourne's remarks are being seen as an effort to get in on the action regarding President Trump's anticipated deal. Brussels' interference would likely increase tensions across the Atlantic, amidst his attempts to mediate between Ukraine and Russia.\n\nThe European Commission tried to clarify matters on Tuesday, dismissing any notion of a fresh proposal from Mr Sejourne following his visit to Kyiv. A commission spokesperson explained that he was alluding to an existing 2021 memorandum with Kyiv concerning critical materials, insisting: \"This is about cooperation with Ukraine, not competition with the US.\"\n\nThe proposed US-Ukraine minerals deal is likely to provide insight into how the war-torn country could be divided as part of any peace settlement. Many of Ukraine's mineral deposits are located in territories currently occupied by Russian forces but earlier this week Putin expressed his willingness to grant the US access to rare earths in both Russia and occupied Ukraine, reports The Telegraph.\n\nDuring his first term in the White House, Mr Trump sought to restrict China's access to advanced technology, including semiconductors and electric vehicles. Rare earths and other minerals are crucial components of these technologies, and the US is eager to secure its own supply. The essential materials for the production of these technologies are sourced from beneath Ukraine and Russia.","summary":"A proposed US-Ukraine minerals deal is likely to provide insight into how the war-torn country could be divided as part of any peace settlement - and it appears close","url":"https://www.mirror.co.uk/news/world-news/volodymyr-zelenskyys-big-move-donald-34749987","image":"https://i2-prod.mirror.co.uk/news/world-news/article34749985.ece/ALTERNATES/s1200/2_Russia-Ukraine-Putin-Trump-25037643042761.jpg","video":null,"publish_date":"2025-02-26 00:16:22","author":"Paige Ingram","authors":["Paige Ingram"],"language":"en","category":"politics","source_country":"gb","sentiment":0.048},{"id":294352718,"title":"World News | Canadian PM Visits Kyiv on Third Anniversary of Russia-Ukraine Conflict; Discusses Defence, Sanctions","text":"Kyiv [Ukraine], February 26 (ANI): On the third anniversary of the Russian invasion of Ukraine, Canadian Prime Minister Justin Trudeau visited Kyiv to meet with Ukrainian President Volodymyr Zelenskyy. During their meeting, the two leaders discussed key topics including defense cooperation, sanctions against Russia, and continued financial support for Ukraine amidst the ongoing war.\nThe Canadian Prime Minister's visit to Ukraine on February 24 aimed to reaffirm Canada's commitment to supporting Ukraine, both militarily and financially, according to the Ukrainian President's office.\nAlso Read | Russian President Vladimir Putin Says 'Ready To Work With Foreign Partners', Offers Rare Earth Metals to US.\n\"Thank you, Justin - especially for your leadership. We are deeply grateful to the Canadian people for their support, as well as for the military and humanitarian assistance. You have truly done a lot,\" Volodymyr Zelenskyy said, according to the president's office.\nWhile expressing his gratitude to Canada, the Ukraine President posted on X, \"I am grateful to Canada for its leadership in supporting Ukrainians throughout these difficult three years and to Justin for organizing and hosting a productive G7 leaders' meeting. Canada continues to support Ukraine by providing military equipment and strengthening our energy security.\"\nAlso Read | US-India Start Working on Joint Agenda, Days After Donald Trump and PM Narendra Modi Meeting.\nhttps://x.com/ZelenskyyUa/status/1894126831143620897\nAccording to the President's office, the \"main focus of the meeting was reliable security guarantees for Ukraine, including NATO membership.\" With Zelenskyy emphasising the importance of the principle \"Nothing about Ukraine without Ukraine, nothing about Europe without Europe.\"\nThe leaders also discussed Canada's efforts within the Group of Seven (G7) to consolidate international support for Ukraine\n\"In particular, the parties discussed the consolidation of international efforts to support Ukraine under the Canadian presidency of the Group of Seven,\" read the statement. The meeting also covered the topic of \"defense cooperation,\" and the Ukrainian President thanked Canada for its \"substantial contributions to Ukraine's security and financial assistance.\"\nThe leaders also addressed the continuation of sanctions against Russia, particularly focusing on tightening restrictions on Russia's shadow fleet and oil sector.\nCanada's Office of the Prime Minister released a statement marking the third anniversary of Russia's invasion of Ukraine.\n\"On February 24, 2022, Russia launched an illegal, full-scale invasion of Ukraine, unleashing a campaign of unimaginable brutality that has left hundreds of thousands dead. The invasion was an escalation of a war of aggression, an unequivocal violation of Ukraine's sovereignty and territorial integrity, and an attack against freedom, democracy, and international law, including the United Nations Charter,\" read the Canadian PM's statement. \"When Putin ordered his tanks across the Ukrainian border, he thought Kyiv would quickly fall and the people of Ukraine would surrender. He was wrong. Three years later, Ukraine stands defiant. Ukrainians are valiantly protecting their territory against relentless Russian attacks. Russian aggression has been met with fierce defence and, winter after winter, the Ukrainian flag flies over Kyiv,\" the statement added. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Canadian Prime Minister's visit to Ukraine on February 24 aimed to reaffirm Canada's commitment to supporting Ukraine, both militarily and financially, according to the Ukrainian President's office.","url":"https://www.latestly.com/agency-news/world-news-canadian-pm-visits-kyiv-on-third-anniversary-of-russia-ukraine-conflict-discusses-defence-sanctions-6670366.html","image":"https://st1.latestly.com/wp-content/uploads/2025/02/ANI-20250225203246.jpg","video":null,"publish_date":"2025-02-26 00:16:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.365},{"id":294352104,"title":"The most shocking Pentagon firing wasn't the top general, legal experts say. It was the lawyers.","text":"When President Donald Trump's Pentagon chief sacked top military officers last week, the most startling firings were the lawyers, legal experts told Business Insider.The abrupt firing of the chairman of the Joint Chiefs of Staff, US Air Force Gen. Charles Q. Brown Jr., drew condemnation and spurred headlines. But it was the dismissal of top JAG officers — a single line of text at the end of the Friday night announcement — that had those aware of the potential deep impacts on military legal affairs more concerned.\"These firings with the JAGs are more concerning than the firings of the four stars that accompany them,\" Franklin D. Rosenblatt, a retired US Army JAG officer and president of the National Institute of Military Justice, told Business Insider in a phone interview on Monday.\"I don't want to engage in hyperbole, but I do see this as one of the bigger threats to the rule of law that the Pentagon has faced in a long time.\"In the same memo in which Secretary of Defense Pete Hegseth said that he was removing Brown and Chief of Naval Operations Adm. Lisa Franchetti, and Air Force Vice Chief General James Slife, he also announced a solicitation for \"nominations for the Judge Advocates General for the Army, Navy and Air Force,\" effectively removing these three senior JAG officers.The move deepened a sense of upheaval as the administration shifts departmental funding priorities and invites DOGE cost-cutters fresh from gutting USAID.Speaking to reporters on Monday about the recent developments, Hegseth called the JAGs potential \"roadblocks\" to the president's orders.\"We are looking for the best\" to replace the fired officers, he said, suggesting that those career officers were not well suited to the task of providing the best recommendations to commanders.When reached for comment, the Office of the Secretary of Defense directed BI to the transcript of the engagement between Hegseth and reporters in which he characterized the dismissed officers as potential hindrances.Colorado Rep. Jason Crow, a former Army Ranger, was one of the first to raise concerns about the firing of the JAG officers, writing on X last Friday that purging JAG officers worries him the most.Judge advocates general, or JAGs, are military lawyers and part of the niche and often complex realm of military justice and oversight. Legal experts say that the decision to kneecap these apolitical roles and replace them with a fresh lot could cause harmful ripple effects.JAG officers serve as legal advisors to commanders at all levels, from battalion leadership directing gunfights and interrogations during the Global War on Terror to the quiet corridors of the Pentagon, where top JAGs can advise commanders spread out across the globe. They don't set rules for commanders to follow, Rosenblatt said, but instead advise leaders on the legality of their desired employment of US forces.Mark Nevitt, a former Navy JAG, said in a Just Security post that \"summary removals\" of these lawyers are \"unprecedented in modern times.\" He said the \"firing without apparent cause of the service JAGs is particularly disturbing.\"These officers practice a wide range of law, supporting not just the military force employment decisions but also endeavors associated with contract and fiscal law through litigation of disputes and advising contracting boards.JAGs are the military equivalent to general counsels at large companies that advise CEOs on the legality of policies and practices, often recommending courses of action to avoid unnecessary liabilities.\"JAGs are instrumental in that they're the right hand of commanders and helping commanders affect their command vision and their goals,\" said Rachel VanLandingham, a law professor at Southwestern Law School and former Air Force JAG, in a phone call with BI on Monday.\"We have the Constitution, and flowing from that, a plethora of federal laws and federal regulations that apply to the military,\" she said.JAGs are guardrails for commanders, VanLandingham said. This role is particularly important should a military leader, or even the commander-in-chief, consider wading into the gray areas of military law, like Trump's previous musings about deploying active-duty troops to American cities.Former Air Force Secretary Frank Kendall, who wrote in a New York Times op-ed this week that Trump is a rogue president, said that he was deeply troubled by the JAG departures.\"One has to ask why JAG leadership was singled out for replacement,\" Kendall wrote, highlighting the authority JAGs have to advise commanders on whether an order from a president or the secretary of defense is lawful.Prior to Hegseth's Friday memo on the big shake-ups at DoD, Air Force Lt. Gen. Charles Plummer, Army Lt. Gen. Joseph Berger, and Navy Rear Adm. Lia Reynolds were the top uniformed military lawyers for each of their armed services.Rosenblatt said that it was surprising to see Berger's relief, given that he had advocated for less restrictive legal procedures on the battlefield.The lack of pre-identified JAG replacements in Hegseth's Friday memo seems to undermine any assumptions that political leadership has specific, sufficiently \"loyal\" options in mind, Rosenblatt said. Rather, he said, \"it just really seemed to give more credence to the view that Hegseth just doesn't like military lawyers.\"Hegseth has criticized JAGs in the past as unnecessary and self-serving and has referred to them disparagingly as \"JAG-offs\" because of their often methodical processes, which Hegseth views as unnecessarily burdensome and harmful to units across the board.Hegseth is an infantry veteran who served in the Army National Guard and deployed to Iraq and Afghanistan.\"I have a lot of confidence in the people who may come next,\" Rosenblatt said, referring to other high-ranking JAGs who could hold the job. \"But there is no doubt that this is sending a chilling message to all of those who may follow the advice of JAGs,\" he said.\"This is very much, I think, a message that they want legal advice that's going to be more politically-minded,\" he concluded.","summary":"The Pentagon's firing of top JAG officers sends a 'chilling message' about political interference in military legal affairs, a former JAG said.","url":"https://www.businessinsider.com/most-shocking-pentagon-firing-lawyers-not-top-generals-legal-experts-2025-2","image":"https://i.insider.com/67be221ee015c5d98a6ae5af?width=911&format=jpeg","video":null,"publish_date":"2025-02-26 00:16:01","author":"Kelsey Baker","authors":["Kelsey Baker"],"language":"en","category":"politics","source_country":"us","sentiment":0.157},{"id":294353940,"title":"BC-BIZ-COVER-NYT","text":"Here are the top business stories from The New York Times for Wednesday, Feb. 26. They are scheduled to move by 9 p.m. ET unless otherwise noted. To reach The New York Times News Service, email newsservice@nytimes.com. For information on photos and graphics, email nytnsphotos@nytimes.com.\n\nON THE BUSINESS COVER\n\nLede display:\n\nEGG-PRICES (Undated) -- As consumers confront empty shelves in their grocery stores and prices soar in some places to more than $10 for a dozen eggs, the concentration of egg production in fewer hands is raising concerns, stoked by previous findings. Two years ago, the largest producers were found liable for inflating prices in the 2000s. Now, some lawmakers are calling for federal regulators to investigate the industry. By Danielle Kaye and Julie Creswell.\n\nPackaged with:\n\nFED-INFLATION (Undated) -- Fresh off the worst inflation shock in decades, Americans are once again bracing for higher prices. Expectations about future inflation have started to move up, according to metrics closely watched by officials at the Federal Reserve. If those worries persist, it could be a political problem for President Donald Trump, whose promise to control prices was a central part of his message during last year's campaign. It would also add to the challenge facing policymakers at the Fed. By Colby Smith and Ben Casselman.\n\nWith graphic and photo. Page 1 refer.\n\nTRUMP-ECON-IMPACT (Undated) -- Even by Washington standards, the second Trump presidency has begun in frenetic fashion. Business leaders and corporate investors are confident that things will turn out fine, at least for them. But that could change, with high-stakes implications for the markets and the U.S. economic outlook. Investors fully expect the tax cuts from President Trump's first term, which mostly benefited businesses and the wealthy, to be fully extended before the end of the year. Still, the arithmetic remains tenuous. By Talmon Joseph Smith.\n\nWith photos. Page 1 refer.\n\n[Story first moved Saturday, Feb. 22, at 12:23 p.m. ET.]\n\nTRUMP-PRESS-POOL (Undated) -- White House press secretary Karoline Leavitt said Tuesday that the Trump administration would start handpicking which media outlets were allowed to participate in the presidential pool, the small, rotating group of journalists who relay the president's day-to-day activities to the public. The change announced by Leavitt breaks decades of precedent. The White House Correspondents' Association, a group representing journalists who cover the administration, has long determined on its own which reporters would participate in the daily pool. By Michael M. Grynbaum.\n\nWith photos.\n\nADDITIONAL BUSINESS STORIES\n\nGERMANY-ECON (Berlin) -- The president of Germany's central bank, which Tuesday reported an annual loss for the first time in more than 40 years, said Germany faced another year of economic stagnation, more gloomy news for a country that is struggling to grow. \"It is not possible to rule out a third consecutive calendar year with no growth,\" Joachim Nagel, the head of the Bundesbank, said in Frankfurt, Germany. The comments highlighted the economic challenges facing Germany's next government. By Melissa Eddy.\n\nWORLD-BANK-OUTLOOK (Undated) -- As the Trump administration imposes deep cuts on foreign aid and renewable energy programs, the World Bank, one of the most important financiers of energy projects in developing countries, is facing doubts over whether its biggest shareholder, the United States, will stay on board. While the Trump administration has voiced neither support nor antipathy for the bank, it has issued an executive order promising a review of U.S. involvement in all international organizations. And Project 2025, the right-wing blueprint for overhauling the federal government, has pressed for withdrawal from the World Bank. By Max Bearak and Somini Sengupta.\n\nWith photos.\n\nTRUMP-TARIFFS-COPPER (Washington) -- President Donald Trump signed an executive order Tuesday directing his commerce secretary, Howard Lutnick, to begin an investigation into whether foreign production of copper and imports of the material into the United States poses a risks to America's economic and national security. White House officials said that, depending on the results of the investigation, new tariffs could be applied on foreign copper, a material that is widely used in manufacturing and construction but is also key to the U.S. military and emerging technologies like artificial intelligence. By Ana Swanson and Shawn McCreesh.\n\nCHINA-TESLA-AUTOPILOT (Hong Kong) -- Elon Musk, the CEO of Tesla, tried for years to persuade Chinese regulators to let him offer self-driving capabilities in one of the company's most important markets. After a series of false starts, Musk is now closer than ever. Tesla said Tuesday that some drivers in China would be able to use the company's Autopilot feature on city streets to help with lane changes and other more advanced tasks. The update is available to Tesla owners who paid an extra $8,800. By Alexandra Stevenson.\n\nWith related story:\n\nTESLA-STOCK (Undated) -- Shares of Tesla had been on a tear since Donald Trump won the presidential election. Investors were betting that the carmaker would benefit from the more than $250 million that its CEO, Elon Musk, spent to support the Trump campaign. But an 8% decline in Tesla's stock Tuesday all but wiped out what was left of that rally. Investors who once thought that Trump could help clear regulatory hurdles for Tesla autonomous driving technology have grown concerned that Musk is spending too much time in Washington while Tesla sales plummet. By Jack Ewing.\n\nWith photo.\n\nGOVT-WORKERS-HOUSING (Washington) -- After losing his job at the U.S. Forest Service, Cameron McKenzie, 27, was worried about finding a new job. But first, he had a more immediate concern: How was he going to pay the mortgage? McKenzie's termination was among thousands of federal job cuts, part of a purge of the workforce under an executive order signed by President Donald Trump. The firings have left federal workers and contractors throughout the country in flux, with many distressed over their housing. By Matt Yan.\n\nWith photos.\n\nHEALTH-PRICES-TRANSPARENCY (Undated) -- In a new executive order, President Donald Trump will reaffirm his commitment to one of his favorite health care policies of his first term: his push to make the prices paid for medical services more public and transparent. After years of half-hearted compliance from hospitals and insurance companies with the previous policies, Trump is signaling a more aggressive approach to enforcing the rules and making pricing data accessible to patients, the official said. By Margot Sanger-Katz.\n\nWith photo.\n\nAI-COPYRIGHT-PROTEST (London) -- Sometimes, silence speaks louder than song. That's the hope, at least, for more than 1,000 musicians who released a lyricless album Tuesday to protest the British government's proposal to expand the ways that developers can use copyright-protected works to train artificial intelligence models. By Amelia Nierenberg.\n\nAPPLE-DICTATION-FLUB (San Francisco) -- While using Apple's automatic dictation feature to send messages Tuesday, some iPhone users reported seeing a peculiar bug: the word \"racist\" temporarily appearing as \"Trump,\" before quickly correcting itself. The message blip, which was replicated several times by The New York Times, provoked controversy after appearing in a viral TikTok post, raising questions about Apple's artificial intelligence capabilities. An Apple spokesperson blamed the issue on phonetic overlap between the two words, and said the company was working on a fix. By Tripp Mickle and Eli Tan.\n\nWith photo.\n\nHEAVYWEIGHT-PODCAST-RETURN (Undated) -- Almost nine years ago, a Minneapolis writer revealed a family skeleton to a podcast host. Steve Marsh had a \"secret sister\" -- an older sibling his parents had placed for adoption before they were married. He wanted help finding her. The thorny problem fit neatly into the premise of a new podcast: \"Heavyweight\" was dedicated to ultra-personal quests, confronting regrets and healing resentments. An early hit, \"Heavyweight\" was canceled by Spotify in 2023, as the audio giant made significant company layoffs. But on Tuesday, media company Pushkin Industries announced that \"Heavyweight\" had joined its podcast network and would release new episodes this year. By Jessica Testa.\n\nWith photos.\n\nCRYPTO-FIRM-PLEA (Undated) -- An offshore cryptocurrency trading firm pleaded guilty Monday in U.S. District Court in New York City to a charge of operating as an unlicensed money transmitting business in the United States while seeking customers in New York and other states. In pleading guilty, the Seychelles-based company that operates OKX, which the government described as one of the world's largest crypto firms, also agreed to pay $504 million in fines and penalties. The company still has operations in the United States. By Matthew Goldstein and Olivia Bensimon.\n\n[Story first moved Monday, Feb. 24, at 7:40 p.m. ET.]\n\nNY-PUBLIC-RADIO-LAYOFFS (Undated) -- New York Public Radio said Tuesday that it would lay off about 7% of its staff as it continued to struggle with a financial shortfall. Twenty-one full-time roles will be eliminated, with three of them becoming part time, CEO LaFontaine Oliver said in an email to the staff. Seven open roles will also be eliminated. New York Public Radio operates the WNYC news station and WNYC studios, the Gothamist local news website, the classical music station WQXR, New Jersey Public Radio and the Jerome L. Greene Performance Space. By Katie Robertson.\n\nWith photo.\n\n[Editors: Budgets and advisories are internal documents not for publication or redistribution outside of client news organizations. Unauthorized use of budgets and advisories constitutes a violation of our contract terms. All clients receive all budgets, but only full-service clients receive all stories. Please check your level of service to determine which stories you will receive.]","summary":"WEDNESDAY","url":"https://www.berkshireeagle.com/nyt/bc-biz-cover-nyt/article_b7187fc4-a2a9-5f6b-b23f-487949df3d87.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:16:00","author":"Amelia Nierenberg","authors":["Amelia Nierenberg"],"language":"en","category":"sports","source_country":"us","sentiment":0},{"id":294352712,"title":"World News | Nepal's Pashupatinath Temple Comes Alive with Flow of Devotees","text":"Kathmandu [Nepal], February 26 (ANI): Nepal's Pashupatinath Temple, the revered Hindu pilgrimage site, came alive with devotees and ascetics on Tuesday, the eve of Mahashivaratri.\nEntry gates have been set up leading to the main temple complex, which has been decorated with flower garlands, further embellishing the area and attracting more devotees.\nAlso Read | Russian President Vladimir Putin Says 'Ready To Work With Foreign Partners', Offers Rare Earth Metals to US.\nAscetics from various parts of India and Nepal have gathered and are staying at Annapurna Bhandar, Swargadwari Ashram, Nirmala Akhada, and Parmananda Ashram, which are located within the Pashupatinath Temple premises.\n\"The environment is filled with excitement and fervour. Devotees have continued to flock to the temple. I come to the temple every year, and I am today's environment around the temple filled with gaiety,\" Bholanath Upadhyay, one of the devotees, told ANI.\nAlso Read | US-India Start Working on Joint Agenda, Days After Donald Trump and PM Narendra Modi Meeting.\nThe Mahashivaratri- night dedicated to Lord Shiva, the protector falls on Wednesday this year. An estimated 1 million pilgrims are expected to visit the temple this year.\n\"Mahashivaratri, known as the night of Lord Shiva, is observed with great fervour in Nepal as well as in India and other Hindu populous countries. Generally, the Day of Mahashivaratri falls on every 13th night or 14th day of luni-solar month according to the Lunar Calendar. Every temple of Lord Shiva is flocked with pilgrims on the day of Shivaratri.\nOne of the major festivals of Nepal, Mahashivaratri literally means \"Night of the Shiva\". It is celebrated on the 14th day of the dark fortnight of the Magha month, as per the Hindu lunar calendar.\nIt is believed that on this day, the stars in the Northern Hemisphere are at the most optimum positions to help raise a person's spiritual energy. It is also believed that the Shiva principle is most active on this day of the year.\nMahashivaratri is celebrated marking the convergence of Shiva and Shakti. The festival also celebrates the cosmic dance, or Tandav, performed by Lord Shiva.\nHundreds of thousands of devotees visit Pashupatinath Temple in Kathmandu, one of the holiest shrines of the Hindus. Pashupatinath is considered the Guardian and Protector of the Kathmandu Valley and Nepal.\nIn order to ensure security, the Nepal Police has implemented special security on the occasion of Mahashivaratri in the Pashupati area. The Kathmandu Valley Police Office, Ranipokhari, has prepared and implemented a special security plan since Monday night.\nAccording to the office, a special security plan has been implemented to address potential criminal incidents that could arise due to the large crowd of devotees and visitors during Shivaratri. Over 3,500 police officers will be mobilized under the\ncommand of Apil Raj Bohara, Superintendent of Police (SP) of the District Police Range, Kathmandu. A total of 3,511 police officers will be mobilized in three shifts under SP Bohara.\nSimilarly, 41 policemen, including 31 men from the District Police Range, Kathmandu and 10 women from Ranipokhari will be deployed at the command post. There will be 133 policemen at the sub-command post.\nPolice will work in three shifts for the security in the Pashupati area. Around 1,244 policemen will be deployed in one shift. The police are preparing to provide security in three shifts with an 8-hour duty rate.\nThere will be 41 police officers in the command post, 133 in the sub-command post, 40 in plain clothes, six photographers, 10 in communications, 135 in reserve force, 135 striking, 14 for mobile patrols and 3,072 deployed in three shifts at a rate of 1,024 officers per shift.\nOut of these, 1,307 police officers, including 1,114 men and 153 women, will be mobilised from the District Police Range. Similarly, 2,204 police officers, including 1,432 men and 772 women, will be mobilized from Ranipokhari. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Entry gates have been set up leading to the main temple complex, which has been decorated with flower garlands, further embellishing the area and attracting more devotees.","url":"https://www.latestly.com/agency-news/world-news-nepals-pashupatinath-temple-comes-alive-with-flow-of-devotees-6670364.html","image":"https://st1.latestly.com/wp-content/uploads/2025/02/ANI-20250225200227.jpg","video":null,"publish_date":"2025-02-26 00:14:21","author":null,"language":"en","source_country":"in","sentiment":0.358},{"id":294353904,"title":"White House Moves to Pick the Pool Reporters Who Cover Trump","text":"The Trump administration said Tuesday that it would start handpicking which media outlets were allowed to participate in the presidential press pool, the small, rotating group of reporters who relay the president's day-to-day activities to the public.\n\nThe change breaks decades of precedent. It allows the White House to assert more control over which journalists can witness his activities up-close and ask him questions.\n\nThe White House Correspondents' Association, a 111-year-old group representing journalists who cover the administration, has long determined on its own which reporters would participate in the daily pool.\n\nBecause presidents often hold events in smaller settings like the Oval Office, the pool format ensures that the public is provided with an accurate record of a president's comments and actions. The pool reporters who witness the events distribute their reporting to the hundreds of other news outlets that cover him.\n\nThe pool is most often made up of journalists from organizations like CNN, Reuters, The Associated Press, ABC News, Fox News and The New York Times.\n\nTuesday's announcement was the latest in a string of aggressive efforts by the Trump administration to erode the access and influence of major news organizations that cover the White House. It is a sharp break from generations of Republican and Democratic presidents who abided by the White House press corps' deciding on its own which reporters were granted more access.\n\nThe administration has barred reporters from the AP, which supplies information to thousands of news organizations around the world, from entering the Oval Office or traveling on Air Force One, prompting a legal battle.\n\nThe White House press secretary, Karoline Leavitt, said the new policy was intended to allow \"new media\" outlets -- such as digital sites, streaming services and podcasts -- \"to share in this awesome responsibility.\" She added, \"Legacy media outlets who have been here for years will still participate in the pool, but new voices are going to be welcomed in as well.\"\n\nThe White House Correspondents' Association rebuked the move in a blistering statement.\n\n\"This move tears at the independence of a free press in the United States,\" wrote Eugene Daniels, a Politico reporter and the president of the association. \"It suggests the government will choose the journalists who cover the president. In a free country, leaders must not be able to choose their own press corps.\"\n\nThe association said that it had been given no warning of Leavitt's announcement and that there had been no prior discussions about it with the White House. \"The WHCA will never stop advocating for comprehensive access, full transparency and the right of the American public to read, listen to and watch reports from the White House, delivered without fear or favor,\" Daniels wrote.\n\nThe Trump administration recently added a \"new media\" seat in the White House briefing room. In recent weeks, the seat has been occupied by some journalists who strive for accuracy and fairness, such as reporters at Axios and Semafor, and by partisan figures who are sympathetic to the Trump administration, such as the podcast host Sage Steele.\n\nIn announcing its plans for the press pool, Leavitt said that \"by deciding which outlets make up the limited press pool on a day-to-day basis, the White House will be restoring power back to the American people.\"\n\nJacqui Heinrich, a senior White House correspondent at Fox News, responded to that remark on social media, writing: \"This move does not give the power back to the people -- it gives power to the White House.\" Heinrich is a board member of the correspondents' association.\n\nA spokesperson for The New York Times said Tuesday: \"The White House's move to handpick favored reporters to observe the president -- and exclude anyone whose coverage the administration may not like -- is an effort to undermine the public's access to independent, trustworthy information about the most powerful person in America.\"\n\nThe White House's attitude toward a news outlet is often predicated on whether its coverage fits the administration's agenda.\n\nPresident Donald Trump's dispute with the AP is based on the news agency's decision to continue using the name \"Gulf of Mexico\" to refer to the body of water that Trump decreed \"Gulf of America.\" Most of the Gulf of Mexico lies outside the maritime regions controlled by the United States.\n\nAt Tuesday's briefing, however, Leavitt cited reporting by the AP -- approvingly. She highlighted AP articles about migrants who had decided not to pursue their journeys to the United States.\n\nA First Amendment advocacy group, the Reporters Committee for Freedom of the Press, said Tuesday that the move represented \"a drastic change in how the public obtains information about its government.\"\n\n\"The White House press pool exists to serve the public, not the presidency,\" said the group's president, Bruce D. Brown.\n\nThis article originally appeared in The New York Times.","summary":"The Trump administration said Tuesday that it would start handpicking which media outlets were allowed to participate in the presidential press pool, the small, rotating group of reporters who relay the president's day-to-day activities to the public.","url":"https://www.berkshireeagle.com/nyt/white-house-moves-to-pick-the-pool-reporters-who-cover-trump/article_88e9884a-ee8f-5a31-b7de-1ebff1e1a910.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:13:05","author":"Blox Content Management,Michael M. Grynbaum","authors":["Blox Content Management","Michael M. Grynbaum"],"language":"en","category":"politics","source_country":"us","sentiment":0.31},{"id":294355444,"title":"ADF was in the dark for 40 minutes on Chinese navy’s live fire exercises","text":"The Australian military has confirmed it only learned the Chinese navy was conducting a live firing exercise in the Tasman Sea after civil aviation authorities raised the alarm, 40 minutes after it began.\n\nIt took another 50 minutesbefore the Australian Defence Force was notified by its New Zealand counterpart, which was monitoring the Chinese task force.\n\nAirservices Australia officials revealed earlier this week that they had only learnt about the exercises - due to run between 9.30am and 3pm - at 9.58am on Friday after a Virgin Australia pilot was alerted.\n\nAppearing at Senate estimates on Wednesday, defence force chief David Johnston confirmed Airservices Australia had been the first to inform the military, about 10 minutes after the initial alert.\n\nHe said while it could have been the case Airservices Australia and the New Zealand navy were notified at the same time, word was only receieved by New Zealand defence officials at 11.01am.\n\nPrime Minister Anthony Albanese insisted the notification from New Zealand happened at “around the same time” as Aisrservices Australia was told.\n\n“We had been monitoring along with New Zealand and the New Zealand vessel of course was tailing the taskforce as well, so they were conscious and notified Defence as well,” he said when asked about the surprise live firing exercise late last week.\n\n“New Zealand notified the Australian Defence Force, which is what we were cooperating on.\n\n“At around the same time, there were two areas of notification. One was from the New Zealand vessels that were tailing (the Chinese ships) … that occurred around the same time as when something like this was occurring Airservices got notified.”\n\nThe Coalition has argued that it was still the case that China had not given Australia adequate advance notice.\n\nAdmiral Johnston said China had given “inadequate notification” of the exercise, to which Liberal senator James Paterson responded Beijing had given “no notification at all”.\n\nAdmiral Johnston confirmed Joint Operations Command was alerted at 10.10am, with Admiral Johnston and Defence Minister Richard Marles briefed at about 11.30am. He took a question about when Mr Albanese was first briefed on notice.\n\nInfrastructure officials confirmed on Monday that Infrastructure Minister Catherine King had been notified at 11.20am.\n\nForty-nine commercial flights were forced to divert their routes on Friday because of the Chinese military drills. No live firing was witnessed.\n\nThe three Chinese vessels, currently 250km southwest of Hobart, had made their way along Australia’s east coast before moving to the Tasman Sea to conduct live fire exercises on Friday and Saturday.\n\nDefence officials were notified at 11.50am on Saturday that China planned to conduct live firing exercises between 12-3pm. On that occasion, live firing was observed at 1.08pm.\n\nThe ADF is continuing to monitor the three vessels, who are now within Australia’s Economic Exclusion Zone and could sail through the Great Australian Bight.\n\nAdmiral Johnston also conceded the task group could be travelling with an undetected nuclear submarine.\n\n“I don’t know whether there is a submarine with them. It is possible: task groups occasionally do deploy with submarines, but not always. I can’t be definitive on whether that’s the case,” he said.\n\nShadow defence minister Andrew Hastie had earlier said China was “testing” US allies as US President Donald Trump “resets relationships in Europe”.\n\nHe also accused Labor of downplaying the risk the flotilla’s presence presented.\n\nMore to come.","summary":"The Australian military only learned the Chinese navy was conducting a live firing exercise in the Tasman Sea after civil aviation authorities raised the alarm, 40 minutes after it began.","url":"https://thewest.com.au/politics/defence/adf-was-in-the-dark-for-30-minutes-on-chinese-navys-live-fire-exercises-c-17852630","image":"https://images.thewest.com.au/publication/C-17852630/6c2ec7682890c3f615d7b00e05624af11d0bab8f-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-02-26 00:12:49","author":"Ellen Ransley","authors":["Ellen Ransley"],"language":"en","source_country":"au","sentiment":-0.353},{"id":294352706,"title":"World News | Six Former Indian Army Chiefs Perform Special Pooja at Pashupatinath Temple in Kathmandu","text":"Kathmandu [Nepal], February 26 (ANI): Six former Chiefs of the Indian Army performed a special pooja at the Pashupatinath temple in Kathmandu, Nepal, on Tuesday, marking the eve of Mahashivratri. The former army chiefs are in Nepal at the invitation of the Nepal Army.\nThe delegation, which includes General Joginder Jaswant Singh (Retd.), General Deepak Kapoor (Retd.), General Vijay Kumar Singh (Retd.), General Dalbir Singh Suhag (Retd.), General Manoj Mukund Naravane (Retd.), and General Manoj Pande (Retd.), were escorted to the temple for the pooja by local officials. Following the rituals, the Pashupati Area Development Trust conferred the chiefs with Rudraksha malas and scarves.\nAlso Read | Russian President Vladimir Putin Says 'Ready To Work With Foreign Partners', Offers Rare Earth Metals to US.\nAt the invitation of the Nepal Army, the six former Indian Army Chiefs arrived in Nepal on Tuesday to participate in the Mahashivaratri celebrations and the 262nd Anniversary of the establishment of the Nepal Army.\nThe armies of Nepal and India entertain a longstanding tradition of conferring honorary ranks to each other which reflects the deep-rooted and strategic ties between the two neighbouring nations. This exchange symbolises mutual respect and military cooperation, which has continued for over seven decades.\nAlso Read | US-India Start Working on Joint Agenda, Days After Donald Trump and PM Narendra Modi Meeting.\nIn November 2024, Indian Army Chief General Upendra Dwivedi visited Nepal, where he was conferred the honorary rank of General of the Nepali Army by President Ramchandra Paudel. Similarly, in December 2024, the Chief of the Army Staff (COAS) of the Nepali Army, Ashok Raj Sigdel, received the honorary rank of General of the Indian Army from Indian President Droupadi Murmu during his visit to India.\nThe visit of the former army chiefs is expected to further strengthen military and diplomatic relations between Nepal and India.\nThe Pashupatinath temple, dedicated to Pashupati (a form of Lord Shiva), is located on the banks of the Bagmati River and was designated a UNESCO World Heritage site in the 1970s. It is one of the most revered pilgrimage sites for Hindus.\nMahashivratri will be celebrated on February 26 (Wednesday) and is considered a sacred occasion for spiritual growth, symbolizing the victory over darkness and ignorance. The festival also marks the divine marriage of Lord Shiva, the god of destruction, with Goddess Parvati, the goddess of fertility, love, and beauty, also known as Shakti (power).\nAccording to Hindu mythology, on the night of their wedding, Lord Shiva was escorted to Goddess Parvati's house by a diverse assembly of Hindu gods, goddesses, animals, and demons.\nThe Shiva-Shakti duo is considered the epitome of love, power, and togetherness. The festival marking their sacred union, Maha Shivratri, is celebrated with great devotion and enthusiasm across India. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  At the invitation of the Nepal Army, the six former Indian Army Chiefs arrived in Nepal on Tuesday to participate in the Mahashivaratri celebrations and the 262nd Anniversary of the establishment of the Nepal Army.","url":"https://www.latestly.com/agency-news/world-news-six-former-indian-army-chiefs-perform-special-pooja-at-pashupatinath-temple-in-kathmandu-6670362.html","image":"https://st1.latestly.com/wp-content/uploads/2025/02/ANI-20250225194553.jpg","video":null,"publish_date":"2025-02-26 00:12:21","author":null,"language":"en","source_country":"in","sentiment":0.581},{"id":294352704,"title":"World News | Trump Moves to Suspend Security Clearances of Lawyers at DC Law Firm Helping Jack Smith","text":"Washington, Feb 26 (AP) President Donald Trump on Tuesday ordered the suspension of any security clearances held by lawyers at a prominent Washington law firm who provided legal services to special counsel Jack Smith, the latest move in the Republican's campaign of retribution over the criminal investigations that dogged him before he returned to office. Trump's memo signed at the White House seeks to punish the law firm Covington & Burling days after it was revealed that the firm provided pro bono legal services to Smith, who charged Trump in two criminal cases that were later dismissed after Trump won back the presidency in November. Also Read | Russian President Vladimir Putin Says 'Ready To Work With Foreign Partners', Offers Rare Earth Metals to US. Covington & Burling is an international law firm whose current attorneys include former Attorney General Eric Holder and Lanny Breuer, an ex-Justice Department official who in 2010 hired Smith to lead the agency's Public Integrity Section. The firm had no role in Smith's investigation of Trump, according to a person familiar with the matter who spoke on the condition of anonymity because they were not authorized to discuss the situation. The firm recently agreed to represent Smith “when it became apparent that he would become subject of a government investigation,\" it said in a statement Tuesday. Also Read | US-India Start Working on Joint Agenda, Days After Donald Trump and PM Narendra Modi Meeting. “Covington serves as defense counsel to Jack Smith in his personal, individual capacity,” a spokesperson for the firm said. “We look forward to defending Mr. Smith's interests and appreciate the trust he has placed in us to do so.” The move is part of Trump's effort to exact revenge on his perceived political enemies, and Smith in particular. After signing the directive, Trump suggested the pen he used be sent to Smith, eliciting laughter in the Oval Office. It's not the first time that Trump as president has sought to suspend clearances of Washington figures who have provoked his ire. Last month, for instance, he moved to revoke the clearances of more than four dozen former intelligence officials who signed onto a letter who said the Hunter Biden laptop saga bore the hallmarks of a Russian disinformation campaign. The memo directs Attorney General Pam Bondi to suspend any active security clearances held by Peter Koski, an attorney representing Smith, and “all members, partners, and employees” of Covington who assisted Smith during his time as special counsel. It says they will be suspended “pending a review and determination of their roles and responsibilities, if any, in the weaponization of the judicial process.” Asked by a reporter Tuesday about the targeting of the law firm, Trump replied: “I've been targeted for four years, longer than that, so don't you tell me about targeting. I was the target of corrupt politicians for four years and then four years after that, so don't talk to me about targeting.” A financial disclosure firm filed by Smith and reported on by Politico earlier this month revealed that Smith had disclosed receiving $140,000 in pro bono legal services from Covington & Burling before he left his position in January after more than two years on the job. It follows the firings of members of Smith's team and appears designed to deter lawyers and major law firms from offering legal services to the investigators who investigated Trump, many of whom -- like Smith -- have sought their own counsel from attorneys. Bondi and other Republicans have argued the Justice Department under President Joe Biden had become “weaponized” against conservatives and Trump in particular. In one of her first actions in office, Bondi announced the creation of a “weaponization working group” that will examine Smith's work and the prosecutors and law enforcement who participated in what Bondi's memo described as the “unprecedented raid on President Trump's home.” Smith was appointed in November 2022 by then-Attorney General Merrick Garland to take over in-progress investigations into Trump's hoarding of classified documents at his Mar-a-Lago estate in Florida and his efforts to overturn the 2020 presidential election. Both investigations resulted in indictments, though the classified documents case was dismissed by a judge who concluded that Smith's appointment was illegal and the election interference prosecution was significantly narrowed by a Supreme Court opinion last summer. Smith dismissed both shortly after Trump's election win in November, citing longstanding Justice Department policy against prosecuting a sitting president. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump on Tuesday ordered the suspension of any security clearances held by lawyers at a prominent Washington law firm who provided legal services to special counsel Jack Smith, the latest move in the Republican's campaign of retribution over the criminal investigations that dogged him before he returned to office.","url":"https://www.latestly.com/agency-news/world-news-trump-moves-to-suspend-security-clearances-of-lawyers-at-dc-law-firm-helping-jack-smith-6670360.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-02-26 00:12:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.05},{"id":294353930,"title":"Two Planes, in Washington and Chicago, Abort Landings to Avoid Collisions","text":"WASHINGTON -- Within the span of 90 minutes Tuesday morning, two airplanes, at Ronald Reagan Washington National Airport and at Chicago's Midway International Airport, were forced to abort landings to avoid collisions, federal aviation officials said.\n\nAmerican Airlines Flight 2246, arriving at Reagan National from Boston was making its final descent around 8:20 a.m. when it suddenly canceled its landing, climbed toward the skies and accelerated away from the airport. The last-minute move allowed it to avoid colliding with another plane that was ready to take off from the same runway, the Federal Aviation Administration said.\n\nThe airplane's pilots were told to scrap the landing by an air traffic controller to \"ensure separation was maintained between this aircraft and a preceding departure from the same runway,\" the FAA said in a statement.\n\nAround 8:50 a.m. Central time, the pilots of Southwest Airlines Flight 2504, traveling from Omaha, Nebraska, canceled the plane's landing at Chicago Midway after \"a business jet entered the runway without authorization,\" the FAA said in a statement.\n\nTuesday morning's near misses continued a spotlight put on concerns raised about the safety of the nation's airspace following last month's deadly midair crash outside Reagan National. On Jan. 29, American Airlines Flight 5342 and an Army Black Hawk helicopter collided above the Potomac River, killing all 67 people aboard both aircraft.\n\nInvestigators have yet to determine the cause of the Jan. 29 crash.\n\nOn Tuesday, Itai Vardi, who said he was a passenger on American Airlines 2246, was nervous about his flight into Reagan National for work meetings because of the recent crash.\n\nVardi, who lives in Boston, said he felt relief when his flight appeared to be less than a minute from landing, as he watched the airplane descend closer and closer to the runway from his window seat.\n\nThen, without warning, the airplane took a sharp and rapid ascent, leaving him overwhelmed with fear wondering what was happening and how it would end, he said.\n\n\"Obviously, because of the crash, I was wondering if I should look out for helicopters, then all of sudden this happened,\" Vardi said in an interview. \"There was nothing gradual about it. It felt like the pilot had to make an emergency maneuver.\"\n\nThe airplane eventually safely landed at Reagan National. No one was hurt.\n\nAmerican Airlines did not immediately respond to a request for comment about the incident.\n\nThe National Transportation Safety Board is investigating the Chicago Midway incident.\n\nSouthwest Airlines, in a statement confirming the incident had occurred, said that \"the crew followed safety procedures and the flight landed without incident.\"\n\nNear misses and deadly plane crashes have beset the FAA this year as it tries to navigate through upheaval at the agency. About 400 employees were recently laid off as part of a restructuring of the federal government under President Donald Trump, though air traffic controllers were exempt from the layoffs.\n\nThe collision last month at Reagan National was the deadliest crash in the United States since a Colgan Air flight went down near Buffalo, New York, in 2009. Further adding to the FAA's recent struggles were two other deadly crashes -- one in Philadelphia, the other in Alaska -- that happened within 10 days of the crash in Washington.\n\nThe recent string of aviation woes has caught the attention of the Trump administration, which has vowed to overhaul the FAA's air traffic control systems. Trump has previously said that he would talk to Congress about a bill to revamp the country's aviation safety infrastructure.\n\nThe transportation secretary, Sean Duffy, recruited Elon Musk's aerospace company, SpaceX, and Musk's so-called Department of Government Efficiency to help with the effort. SpaceX employees have already visited the FAA's air-traffic command center in Virginia.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- Within the span of 90 minutes Tuesday morning, two airplanes, at Ronald Reagan Washington National Airport and at Chicago's Midway International Airport, were forced to abort landings to avoid collisions, federal aviation officials said.","url":"https://www.berkshireeagle.com/nyt/two-planes-in-washington-and-chicago-abort-landings-to-avoid-collisions/article_e9e689de-2156-5eb2-a415-2a696d142139.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 00:10:21","author":"Blox Content Management,Mark Walker","authors":["Blox Content Management","Mark Walker"],"language":"en","source_country":"us","sentiment":-0.249},{"id":294349064,"title":"5 Big Controversies Facing the Fed’s ‘Consumer Watchdog’ Agency as DOGE Eyes Its End","text":"Democrats and the media—along with federal employee unions—have rallied around the Consumer Financial Protection Bureau, an agency that has been in the sights of the Department of Government Efficiency initiative for its censorship, waste, and hindering of businesses disfavored by the Left, among other issues. \n\nCBS’ “60 Minutes” also aired a highly sympathetic piece about the agency on Sunday with an interview with ousted CFPB Director Rohit Chopra, the Joe Biden appointee whom President Donald Trump fired earlier this month. \n\nSen. Elizabeth Warren, D-Mass., who as a Harvard law professor was the architect of the agency, denounced the Trump administration and DOGE chief Elon Musk. \n\nThe CFPB was established by the 2010 Dodd-Frank financial reform legislation to regulate banks, credit card companies, lenders, and other financial services companies. It is funded through the Federal Reserve.\n\nThe agency has had a string of controversies, including censorship, a massive data breach, internal financial waste, and complaints of workplace discrimination. \n\nIt will likely take an act of Congress to completely shut it down, but John Berlau, senior fellow and director of finance policy for the Competitive Enterprise Institute, says the agency that has operated outside its legal authority can be reined in.\n\n“Under the Trump administration, the agency should refocus on going on the offense to make it better for entrepreneurs and reversing the damage the Biden CFPB did,” Berlau told The Daily Signal. \n\nTrump named Office of Management and Budget Director Russ Vought acting director the CFPB, which is under the Federal Reserve. Vought eliminated the agency’s budget request for the next quarter and ordered about 1,700 employees not to perform any work.\n\nRep. Byron Donalds, R-Fla., introduced a bill to eliminate the agency entirely. \n\nA CFPB spokesperson did not respond to an inquiry for this story. \n\nOn Feb. 13, the National Treasury Employees Union sued to stop what it called the unlawful dismantling of the agency. \n\n“The employees of the CFPB are nonpartisan professionals who swore an oath to uphold the Constitution, and they believe in the mission of their agency,” union President Doreen Greenwald said in a public statement. “Locking them out of their jobs or firing them is a gift to predatory lenders and unscrupulous actors who prey on consumers.”\n\nA union spokesperson did not respond to an inquiry from The Daily Signal.\n\nHere’s five of the biggest controversies the agency has been involved in. \n\n1. Censorship in Chicago \n\nThe CFPB scored a $105,000 settlement late last year with the Chicago-based Townstone Financial, a non-bank mortgage firm, in a case that critics say amounted to policing speech. \n\n“This was German-like censorship by the CFPB,” Berlau said. “No financial services owner is free to speak on a podcast or radio show under this very dangerous precedent.”\n\nBerlau said the Trump administration should cancel the settlement and fire anyone involved. \n\nIn 2020, the CFPB sued Townstone, accusing owner Barry Sturner of making “statements that would discourage African-American prospective applicants from applying for mortgage loans.” \n\nHowever, the lawsuit didn’t identify anyone who was actually discouraged. It said that comments by Sturner on the “Townstone Financial Show” spoke poorly of some Chicago areas and suburbs and said police kept city neighborhoods from “turning into a real war zone.”\n\nBut Berlau previously noted that Chicago Mayor Brandon Johnson made similar assertions about crime in Chicago. \n\nThe CFPB contended that Townstone drew only five or six applications a year for properties in neighborhoods that were more than 80% African American. The U.S. 7th Circuit Court of Appeals sided with the CFPB in the case. \n\n“The CFPB will continue to prosecute those who engage in modern-day redlining,” Chopra said after the settlement.\n\n2. Discriminating Tastes\n\nLast year, the CFPB settled a decade-old class action racial discrimination lawsuit for $6 million brought by 85 black and Hispanic employees. The agency also paid $1.5 million for attorneys fees. \n\nThe case began a decade after The Washington Times first reported on incidents that included a supervisor calling a CFPB bank examiner who wasn’t born in the United States a “f***ing foreigner.’’ In a separate instance, a CFPB department was labeled “the plantation” by its white supervisor for having a high number of African-American employees.\n\nThe complaint said the plaintiffs were “minority employees and women … subjected to and harmed by the bureau’s agency-wide pattern or practice of discrimination and retaliation and discriminatory policies and practices.” \n\n3. Data Breach of 256,000 Consumers’ Information\n\nCFPB defenders assert it protects consumers when accessing records from financial institutions.\n\nBut the CFPB hasn’t yet resolved a 2023 data breach that forwarded the confidential information of 256,000 consumers to a personal email address, Berlau noted. \n\n“They have a broad financial database that has been breached, and it still hasn’t been resolved,” Berlau said. \n\nA CFPB spokesperson said in a statement at the time, “The CFPB takes data privacy very seriously, and this unauthorized transfer of personal and confidential data is completely unacceptable.” \n\nThe breach may have contained customer information from more than 50 financial institutions, according to Rep. Bill Huizenga, R-Mich., chairman of the House Financial Services Subcommittee on Oversight and Investigations.\n\n4. Surpassing the Trump Tower\n\nA Federal Reserve inspector general report released in 2014 found renovations for the CFPB’s Washington headquarters exceeded $215 million—or about $120 million over the original estimate. \n\nThe House Financial Services Committee noted this was more than $590 per square foot. That meant the agency was spending more per square foot than it cost to build the Trump World Tower in New York, which was $334 per square foot, the Bellagio Hotel and Casino in Las Vegas, which was $330 per square foot, and the Burj Khalifa in Dubai, which was $450 per square foot.\n\nThe inspector general report also said the CFPB “was unable to locate any documentation of the decision to fully renovate the building.” \n\nThe report said the agency failed to follow all of its own guidelines for gaining approval from its Investment Review Board for the building renovation and that a “sound business case is not available to support the funding of the renovation.”\n\n5. Operation Choke Point\n\nThe CFPB was involved in the Obama administration’s Operation Choke Point debanking initiative, according to a 2015 report by the inspector general of the Federal Deposit Insurance Corporation. \n\nThe operation spearheaded by the Justice Department encouraged banks not to do business with gun stores, pawn shops, payday lenders, and other legal industries considered “high risk.” The CFPB reportedly warned banks against disclosing publicly about any of its investigations.","summary":"Democrats and the media—along with federal employee unions—have rallied around the Consumer Financial Protection Bureau, an agency that has been in the sights of the... Read More\n\n\nThe post 5 Big Controversies Facing the Fed’s ‘Consumer Watchdog’ Agency as DOGE Eyes Its End appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/25/5-big-controversies-facing-feds-consumer-watchdog-agency-doge-eyes-end/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/CFPB-Warren-scaled.jpg","video":null,"publish_date":"2025-02-26 00:09:30","author":"Fred Lucas","authors":["Fred Lucas"],"language":"en","source_country":"us","sentiment":-0.344},{"id":294346904,"title":"Wisconsin Governor Defends Push To Redefine 'Mother' as 'Inseminated Person'","text":"Wisconsin Governor Tony Evers this week defended a proposal to change the term \"mother\" to \"inseminated person\" under Wisconsin state law.The ContextEvers called for more inclusive and gender-neutral language in his state budget proposal covering the fiscal period from 2025 to 2027.The proposal, which was first introduced last week, includes a section on \"gender neutral terminology\" that seeks to change the terms \"mother\" and \"father\" to \"person\" and \"spouse,\" according to a CBS affiliate in Wisconsin.But Republicans in the state were particularly rankled by a proposal to change the term \"mother\" to \"inseminated person\" in a section regarding in vitro fertilization (IVF) procedures done in Wisconsin. Among other things, critics said Evers, a Democrat, is \"woke virtue signaling\" and that the proposal makes Wisconsin a \"national embarrassment.\"What To KnowEvers defended his proposal while speaking at an event in Wausau, Wisconsin, on Monday.\"What we want is legal certainty that moms will be able to get the care they need,\" he said. \"That's it, end of story.\"The Wisconsin Democrat also accused Republicans of politicizing the proposal.\"What the Republicans say is a lie, so of course, I'm pretty [pissed off] about that,\" he said. \"It gives people using IVF legal certainty. That's it ... moms are moms. Dads are dads. What we want is legal certainty.\"Evers' comments come as the Trump administration cracks down on diversity, equity and inclusion (DEI) programs across the country, which critics have described as an effort to scale back LGBTQ rights in the workplace and society writ large.President Donald Trump and his allies have taken aim at transgender rights in particular by seeking to ban transgender women from participating in women's sports or using women's restrooms and by barring transgender people from serving in the U.S. military.Trump also signed an executive order after taking office last month claiming that there are only two sexes: male and female.At least one federal judge has sharply pushed back on that characterization, telling the Justice Department in a case challenging Trump's ban on transgender troops that the claim that there are only two sexes is \"biologically incorrect.\"Trump, for his part, has repeatedly called himself the \"father of IVF\" and recently signed another executive order that seeks to protect IVF access and \"aggressively reduce out-of-pocket and health plan costs for such treatments.\"The New York Times reported that the order does not change existing policy or mention Trump's campaign pledge of making IVF treatment free. One fertility doctor in New York also said that while she backs Trump's move to expand IVF access, executive action alone \"is not going to fix the deep rooted issues that we have when it comes to fertility care access.\"What People Are SayingRepublican State Representative Amanda Nedweski wrote on X, formerly Twitter, on Monday: \"If you believed moms are moms, and dads are dads, then there would be no need for this change. Apparently, Evers believes dads can be moms too.\"Wisconsin State Assembly Speaker Robin Voss told FOX 11: \"Once again our woke DEI-loving Governor reminds us just how liberal and out of touch today's Democratic Party really is.\"Voss also told reporters Evers' proposal makes Wisconsin a \"national embarrassment.\"The Republican Governors Association said in a statement: \"Tony Evers is either caving to the most radical elements of his party or he's entirely asleep at the wheel as Democrat activists use his budget proposal to push an insane social agenda on Wisconsin.\"SpaceX CEO Elon Musk, who oversees the Department of Government Efficiency, slammed Evers' proposal, writing on X: \"Hi Mom, I mean 'inseminated person'. This is crazy!!\"What Happens NextEvers' budget proposal is currently being considered in the state Senate. It's also unclear whether the Trump administration will push back if the budget proposal, which breaks with his executive actions seeking to clamp down on gender-neutral terminology, is signed into law.The president last week sparred with Maine Governor Janet Mills and threatened to withhold federal funding from her state if it doesn't comply with his executive order prohibiting trans women from competing in women's sports.Mills responded: \"See you in court.\"","summary":"\"What we want is legal certainty that moms will be able to get the care they need,\" Governor Tony Evers said this week.","url":"https://www.newsweek.com/wisconsin-governor-defends-proposal-gender-neutral-language-2036255","image":"https://d.newsweek.com/en/full/2595567/tony-evers.jpg","video":null,"publish_date":"2025-02-26 00:08:45","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"us","sentiment":-0.261},{"id":294349060,"title":"‘It’s Called Having a Boss’: Scott Jennings Reminds Panelists Federal Workers Work for Trump","text":"DAILY CALLER NEWS FOUNDATION—Republican strategist Scott Jennings gave CNN panelists upset over an email asking government workers to outline their accomplishments a reality check Monday night, reminding them that all federal employees have President Donald Trump as their boss.\n\nWhite House Senior Advisor Elon Musk posted on X Saturday that federal employees needed to tell the Office of Personnel Management what they accomplished the previous week in an email due by 11:59 p.m. Monday. “The View” co-host Ana Navarro claimed the email was “abusive” to government employees and that the cuts were “haphazard.”\n\n“If they did it surgically, if they did it strategically, if they did it deliberately and thoughtfully, I don’t think anybody would have an issue with cutting some government waste with identifying programs that are not working, but the way they are doing it is haphazard, it is dangerous, it is, frankly, abusive of federal workers and it is just plain wrong,” Navarro proclaimed, touching off a back-and-forth involving her, co-panelist Tara Setmayer and Jennings.\n\n“It’s abusive to send an email?” Jennings asked, with Navarro responding, “Yes, I do. I do think that I think the way that they are. Yeah, I think the way that they are treating them-”.\n\nTrump appointed Musk and former Republican presidential candidate Vivek Ramaswamy as co-chairs of the Department of Government Efficiency Nov. 12, with Ramaswamy stepping down Jan. 20 to prepare to run for governor of Ohio. According to the DOGE website, at least $55 billion in savings have been identified since Trump established DOGE in a Jan. 20 executive order.\n\n“How is this abusive?” Jennings asked, with Setmayer complaining about workers being told that a failure to respond would mean they were fired.\n\n“It‘s called having a boss in the private sector,” Jennings responded, with Setmayer shooting back, “From someone who’s not your boss?”\n\n“Well, the White House is every federal worker’s boss, that’s number one,” Jennings said as Setmayer and “CNN NewsNight host Abby Phillip” tried to talk over him, adding, “The test was are you even paying attention to your email? Are you even at your terminal?”\n\nIn a post on X Monday afternoon, Musk granted federal employees a “second chance” to reply to an email asking what they accomplished. Some agencies, notably the FBI and Department of Defense, have said they won’t respond to the email.\n\nOriginally published by Daily Caller News Foundation.","summary":"DAILY CALLER NEWS FOUNDATION—Republican strategist Scott Jennings gave CNN panelists upset over an email asking government workers to outline their accomplishments a reality check Monday... Read More\n\n\nThe post ‘It’s Called Having a Boss’: Scott Jennings Reminds Panelists Federal Workers Work for Trump appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/25/its-called-having-a-boss-scott-jennings-reminds-panelists-federal-workers-work-for-trump/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/ElonMuskchain.jpg","video":null,"publish_date":"2025-02-26 00:08:27","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","source_country":"us","sentiment":-0.546},{"id":294351126,"title":"Japan's Nikkei seen rising 4.6% by end-June on stronger corporate outlook: Reuters poll","text":"TOKYO : Japan's Nikkei share average will rise 4.6 per cent by end-June based on the view that Japanese firms will revise up their outlook once uncertainties over U.S. tariff policy are cleared, according to equity strategists in a Reuters poll.\n\nThe Nikkei is forecast to trade at 40,000 at the end of June, according to the median estimate of 19 analysts polled February 13-25, from Tuesday's close of 38,237.79. It is forecast to trade at 42,500 by end-year, up over 11 per cent. \n\nGains on Japan's benchmark equity index have been capped so far this year as investors assess the impact of U.S. President Donald Trump's tariff threat to global businesses.\n\n\"Japanese firms' outlook for this year may be modest initially, but once they have a clearer view of Trump's tariff plans, their outlook may turn strong,\" said Yugo Tsuboi, chief equity strategist at Daiwa Securities, who predicts the Nikkei to trade at 43,000 at end-June.\n\nTsuboi expects local companies to report record profits for the fiscal year starting in April, and said the Nikkei could go up about 10 per cent within three months. \n\nWhile Trump has announced tariffs on several major U.S. trading partners since returning to the White House last month, he has not yet directly targeted Japan.\n\nBut Japanese firms, such as automakers, could significantly be impacted by tariffs as many of them make products at factories in Canada or Mexico.\n\nThe Bank of Japan's interest rate policy will also be key for the Nikkei, strategists said. \n\nThere are growing expectations the BOJ will raise policy rates higher and faster amid stronger growth in Japan's economy.\n\nThe BOJ is expected to lift its policy rate, currently 0.50 per cent, to at least 0.75 per cent this year, a separate Reuters poll showed. \n\n\"Once the market finds out when the rate...will peak, the Nikkei will rise as foreign investors will come back to the Japanese market,\" said Kiyohide Nagata, chief strategist at Tokai Tokyo Intelligence Laboratory, who sees the Nikkei at 41,000 at end-June. \n\nMasayuki Kubota, chief strategist at Rakuten Securities, says the Nikkei could fall about 10 per cent if potential U.S. tariff plans cause a trade war. \n\n\"Global manufacturers, mainly automakers, will be hit and the economy will deteriorate,\" Kubota said. \n\nStrategists had mixed views about corporate earnings growth for 2025, with some expecting it will accelerate this year because the rising prices will boost profits. \n\nSome predicted growth will slow because of the yen's gain against the dollar. \n\nHiroshi Namioka, chief strategist and fund manager at T&D Asset Management, said corporate performance significantly improved due to a weaker yen this fiscal year, but it is hard to expect this to happen in the coming year.\n\nThe yen hit a 2-1/2-month high last week. A stronger Japanese currency tends to hurt shares of exporters, as it decreases the value of overseas profits in yen terms when firms repatriate them to Japan.\n\n(Other stories from the Reuters Q1 global stock markets poll package)\n\n (Additional reporting by Brigid Riley, Fumiya Mizuno and Noriyuki Hirata; additional polling by Sarupya Ganguly and Jaiganesh Mahesh, Editing by William Maclean)","summary":"","url":"https://www.channelnewsasia.com/business/japans-nikkei-seen-rising-46-end-june-stronger-corporate-outlook-reuters-poll-4960331","image":"https://dam.mediacorp.sg/image/upload/s--AGwfAdmu--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-02-26t000810z_1_lynxnpel1p006_rtroptp_3_global-markets.jpg?itok=PEm","video":null,"publish_date":"2025-02-26 00:08:10","author":null,"language":"en","source_country":"sg","sentiment":-0.272},{"id":294348712,"title":"House budget plan to advance Trump agenda moves toward final floor vote","text":"Feb. 25 (UPI) -- House Republican leaders are one step closer to advancing a budget plan and President Donald Trump's agenda, as several conservative members hold out for deeper spending cuts. A final floor vote is expected Tuesday night.\n\nHouse Speaker Mike Johnson spent much of the day in meetings with Republicans who were unsure or demanding more. With 218 Republicans and 215 Democrats in the House, GOP leaders know they can not afford defections if members' budget votes break down along party lines.\n\n\"We are trying to work through concerns and issues. A lot of people want to make sure we are cutting an appropriate amount ... it's a very complicated negotiation ... we will get there,\" Johnson told reporters.\n\n\"The president has talked to a number of members. He's made his intentions well known and he wants them to vote for this and move it along so we can start the process,\" Johnson added.\n\nAmong those undecided holdouts was Republican Rep. Nicole Malliotakis, who said she was focused on her aging constituency in New York.\n\n\"I'm still undecided, but I'm leaning more towards yes because I've gotten some clarity and assurances that make me feel comfortable allowing this process to move forward,\" Malliotakis said. \"We have to make sure that leadership includes those of use who have large Medicaid populations in that process.\"\n\nGeorgia Rep. Rich McCormick said he'd \"like us to be more aggressive on spending cuts so we can save on things like Social Security, Medicare and Medicaid.\"\n\nA procedural test vote earlier Tuesday ended at 217 to 211. One Republican and four Democrats did not vote.\n\nEarlier Tuesday, Johnson was unsure as to whether the House budget vote might get pushed to another day.\n\n\"There may be a vote tonight. There may not be. Stay tuned. That's why you get paid. Hang around here,\" the House Speaker told reporters.\n\nThe budget plan, which moved out of the House Budget Committee earlier this month, includes approximately $300 billion in new spending for defense and the border, along with a debt limit increase of $4 trillion. In the budget, $150 billion is for the U.S. Department of Defense and another $175 billion would go toward immigration enforcement and border security.\n\nThe budget also directs the Energy and Commerce Committee to make at least $880 billion in spending cuts, which some lawmakers argue can only be done by making large cuts to Medicaid.\n\nHouse Minority Leader Hakeem Jeffries called the GOP plan \"reckless\" and claimed it represents \"the largest Medicaid cut in American history.\"\n\n\"Children will be devastated. Families will be devastated. People with disabilities will be devastated. Seniors will be devastated. Hospitals will be devastated. Nursing homes will be devastated,\" Jefferies said.\n\nHouse Majority Leader Steve Scalise accused Democrats of \"lying\" about cuts to Medicaid.\n\n\"This bill doesn't even mention the word 'Medicaid' a single time, and yet, all Democrats are doing is lying about what's in the budget because they don't want to talk about the truth,\" Scalise said.\n\n\"Instead of just sitting back and licking their wounds that they're completely out of touch with the American people, their only choice is to resort to lying about what's in this vote today,\" Scalise added. \"There is no Medicaid in this bill. There are no Medicaid cuts in this bill. Yet that's all they're saying.\"","summary":"House Republican leaders are one step closer to advancing their budget plan and President Donald Trump's agenda, as several conservative members remain undecided. A final floor vote is expected Tuesday night.","url":"https://www.upi.com/Top_News/US/2025/02/25/house-budget-floor-vote/7591740526379/","image":"https://cdnph.upi.com/ph/st/th/7591740526379/2025/upi/53f67f4e887611213d0c00a7183c3b77/v1.2/House-budget-plan-to-advance-Trump-agenda-moves-toward-final-floor-vote.jpg","video":null,"publish_date":"2025-02-26 00:06:05","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","category":"politics","source_country":"us","sentiment":-0.165},{"id":294350928,"title":"Boris Johnson pitches European 'deterrence force' led by 2 key US allies as a Ukrainian security guarantee","text":"Former U.K. Prime Minister Boris Johnson said a European \"deterrence force\" led by the British and French could be a security guarantee for Ukraine as the Trump administration pushes forward with talks to end Russia’s war. Johnson, who was the first Western leader to visit Kyiv during the 2022 full-scale invasion, told \"The Story\" on Tuesday that the United Kingdom and France are the two countries likely to lead the deterrence force because they \"let Ukraine down\" in the 1994 Budapest Memorandum. FRENCH PRESIDENT MACRON TELLS TRUMP TO ‘BE CAREFUL’ IN THE NEGOTIATION PROCESS TO END RUSSIA'S WAR IN UKRAINE \"We said to Ukraine, ‘You give up your nuclear weapons, we'll defend you against attack, right?’ We didn't do that, and shame on us,\" he said. \"And so, I think what we need to do is go forward with a deterrence force composed of the Brits, the French, other European countries backstopped by the U.S. with intelligence support and command and control stuff that they need to do to make that viable, but no American boots on the ground.\" US VOTES AGAINST CONDEMNING RUSSIA FOR UKRAINE WAR AS TRUMP ADMIN CHASES PEACE DEAL Johnson praised the idea of a rare earth mineral rights deal between Washington and Kyiv, explaining that it would commit the United States to the \"freedom, sovereignty and security of Ukraine.\" The former U.K. foreign secretary acknowledged that the proposed deal is more of an economic proposition than a security guarantee. Two sources told Reuters Tuesday afternoon that the United States and Ukraine agreed to a draft of a rare earth minerals deal after weeks of negotiations. Ukrainian President Volodomyr Zelenskyy initially declined to sign a proposal brought by U.S. Treasury Secretary Scott Bessent, saying it didn't provide enough security guarantees for his country. President Donald Trump told reporters at the Oval Office that Zelenskyy may visit the White House on Friday to sign the deal. A reporter asked the commander-in-chief what Ukraine gets out of the minerals deal, to which Trump responded, \"$350 billion and lots of equipment, military equipment and the right to fight on.\" CLICK HERE TO GET THE FOX NEWS APP Johnson told Fox News anchor Martha MacCallum that European countries ultimately want to strengthen Ukraine and turn it into a \"steel-quilled porcupine\" that is \"fundamentally indigestible\" to future Russian attacks.","summary":"Former U.K. Prime Minister Boris Johnson breaks down how a security guarantee for Ukraine could play out with a &quot;deterrence force&quot; on &quot;The Story.&quot;","url":"https://www.foxnews.com/media/boris-johnson-pitches-european-deterrence-force-led-2-key-us-allies-ukrainian-security-guarantee","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/boris-johnson.png?ve=1&tl=1","video":null,"publish_date":"2025-02-26 00:05:25","author":"Ashley Carnahan","authors":["Ashley Carnahan"],"language":"en","category":"politics","source_country":"us","sentiment":0.233},{"id":294348514,"title":"Starmer to meet Trump in Washington as Kyiv and US agree minerals deal","text":"Sir Keir Starmer will fly to the USA on Wednesday ahead of crunch talks with Donald Trump, as the Chancellor urged European allies to follow the UK in raising defence spending.\n\nThe Prime Minister will travel to Washington after facing his weekly grilling in the House of Commons, following his announcement of a dramatic increase in the size of the UK’s war chest, paid for by cutting the international aid budget.\n\nMeanwhile, European nations must “step up and do more on defence”, Rachel Reeves said after the UK pledged to raise defence spending from its current 2.3% to 2.5% of the UK’s economic output by 2027.\n\nSir Keir will follow French president Emmanuel Macron in visiting Mr Trump in Washington DC and Ukrainian leader Volodymyr Zelensky is expected to visit on Friday.\n\nKyiv has agreed to a minerals deal which had been pushed for by the new US administration, according to Ukrainian officials, which could be signed off when their president visits Washington.\n\nMr Zelensky had claimed the 50% share of rare minerals initially demanded by America would have been akin to selling his nation, but Ukraine now appears satisfied the deal will lead to a continued flow of US military support in its war against Russia.\n\nSir Keir insisted the increase in defence funding was “very much my decision” when questioned whether the US was now setting UK defence policy.\n\nThe UK will spent £13.4 billion more on defence every year from 2027, according to Sir Keir, something he acknowledged will require “extremely difficult and painful choices”.\n\nTo fund “the biggest sustained increase in defence spending since the end of the Cold War”, development assistance aid will be slashed from its current level of 0.5% of gross national income to 0.3% in 2027, a move which triggered fierce criticisms from charities.\n\nThe Prime Minister defended his choice, telling reporters it was “necessary for the protection of our country”.\n\nWriting in The Daily Telegraph newspaper, Chancellor Ms Reeves urged European nations to follow the UK’s lead in raising defence spending, amid uncertainty over the US’s commitment to European security.\n\n“This is a generational moment for our continent. All of us must step up and do more on defence,” she said, as she travels to South Africa to meet with G20 finance ministers.\n\nMs Reeves added: “That is why, over the coming days, I will be talking to European counterparts at the G20 in South Africa about the importance of security and defence for our economies, and how we can work together to bolster them.”\n\nEuropean leaders will meet in the UK over the weekend to discuss future defence, Sir Keir revealed, a gathering likely to feature a similar group to those who appeared at a recent summit convened in Paris, including leaders from Germany, Spain, Italy, France, the Netherlands and the EU Commission.\n\nSir Keir and Mr Macron both “reiterated that Ukraine must be at the heart of any negotiations” when they spoke over the phone on Tuesday.","summary":"Sir Keir Starmer will fly to the USA on Wednesday ahead of crunch talks with Donald Trump, as the Chancellor urged European allies to follow the UK in raising defence spending. The Prime Minister will travel to Washington after facing his weekly grilling in the House of Commons, following his announcement of a dramatic increase [&#8230;]\n\n\nThe post Starmer to meet Trump in Washington as Kyiv and US agree minerals deal appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/02/26/starmer-to-meet-trump-in-washington-as-kyiv-and-us-agree-minerals-deal/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/02/efc9df62dea54aa6b314adfc1b58df57-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-02-26 00:01:56","author":"Newsdesk","authors":["Newsdesk"],"language":"en","category":"politics","source_country":"gb","sentiment":0.208},{"id":294354290,"title":"Sir Keir Starmer must bazooka more Labour sacred cows to truly fix our armed forces","text":"Keir armour\n\nFOR years The Sun has railed against the obscene waste of our foreign aid.\n\nOnly a tiny fraction ever did any good.\n\nSo it is right to take billions from that budget to bolster our defences against Russia and China.\n\nGiven how painful that is for some Labour MPs, Keir Starmer deserves considerable credit for doing it.\n\nIncreasing our forces’ budget from 2.3 to 2.5 per cent of GDP in two years is hardly a game-changer. \n\nThree per cent could be, though that’s nine years off.\n\nBut hiking spending IS the right call.\n\nSignificantly, as the PM prepares to meet Donald Trump, it was welcomed by the US Defence Secretary as a “strong step from an enduring partner”.\n\nUnlike many of his MPs, Sir Keir now knows how hard being in power actually is.\n\nAnd he must find more steel to cull other ideological Labour fixations and release billions more for defence along with tax cuts to foster growth.\n\nThe crushing welfare burden. NHS waste. Net Zero madness. And the £9billion-plus Chagos Islands fiasco which looks even more inexplicable now.\n\nSir Keir has been left holding the baby after decades of scandalous under-investment in our forces.\n\nHe must bazooka more Labour sacred cows to truly fix it.\n\nBreaking Britain\n\n“WARMER homes, lower bills” . . . Ed Miliband’s pledge last year was a blatant deceit.\n\nHomes got colder for OAPs stripped of their heating payment. Energy bills have soared three times in seven months.\n\nAcross Britain once-thriving, decades-old firms are closing, destroyed by the world’s highest electricity prices. Families owe billions in unaffordable bills.\n\nAnd still Labour’s witless Energy Secretary claims Net Zero is the solution, not the problem we all know it to be.\n\nHe could green-light fracking and North Sea drilling for cheap UK-made energy.\n\nHe refuses, merely expressing false concern — like a drunk driving a bus off a cliff telling passengers: “I know how worried you must be.”\n\nToday Miliband’s zealous allies at the “Climate Change Committee” which advises the Government will make matters worse, releasing a one-sided report packed with swivel-eyed optimism about Net Zero saving us all money one day.\n\nAfter, that is, we have bankrupted ourselves buying battery cars and heat pumps and given up meat and holidays.\n\nIt’s electoral poison for Keir Starmer.\n\nPM . . . Miliband has sold you a pup.\n\nApocalypse? No\n\nSO the YR4 asteroid isn’t now going to smash into Earth at 38,000mph.\n\nTypical of our luck.\n\nWith wars, chaos and strife everywhere we’d been hoping that vast fiery rock might put us out of our misery.\n\nMaybe the chatbots can rise up and do for us instead.","summary":"","url":"https://www.thesun.co.uk/news/33563553/sun-says-starmer-armed-forces-budget/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/02/crop-33563779.jpg?1740512669&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-02-26 00:01:00","author":"The Sun","authors":["The Sun"],"language":"en","source_country":"gb","sentiment":-0.505},{"id":294353240,"title":"Trump says Zelenskyy set to visit White House on Friday to sign minerals deal","text":"Donald Trump has said that Volodymyr Zelenskyy is likely to visit the White House on Friday to sign a rare earth minerals deal to pay for US military aid to defend against Russia’s full-scale invasion.\n\nThe announcement followed days of tense negotiations between the US and Ukraine in which Zelenskyy alleged the US was pressuring him to sign a deal worth more than $500bn that would force “ten generations” of Ukrainians to pay it back.\n\nMedia outlets reported late on Tuesday that the terms of an agreement had been reached.\n\n“I hear that he’s coming on Friday,” Trump told reporters in the Oval Office. “Certainly it’s OK with me if he’d like to.”\n\nAccording to the Financial Times, which first reported the deal, the new terms of the deal did not reportedly include the onerous demands for a right to $500bn in potential revenue from exploiting the resources, which include rare earth metals and Ukrainian oil and gas resources.\n\nA framework for the deal included joint ownership of a fund to develop Ukraine’s mineral resources with certain caveats for those resources already contributing to the state budget.\n\nIt was more favourable to Ukraine than the original deal proposed by Washington, but did not include references to long-term security guarantees that Kyiv wanted to receive in the deal.\n\nCertain details of the deal remained unclear, including the US’s ownership stake in the new fund.\n\nAsked what Ukraine would receive in the deal, Trump said: “$350bn, military equipment and the right to fight on.”\n\n“We’ve pretty much negotiated our deal on earth and various other things,” Trump added. “We’ll be looking … general security for Ukraine later on. I don’t think that’s going to be a problem. There are a lot of people that want to do it, and I spoke with Russia about it. They didn’t seem to have a problem with it. So I think they understand they’re not going back. And once we do this, they’re not going back.”\n\nNeither the US nor Ukrainian governments immediately responded to requests for comment from the Guardian on whether the deal had been agreed.","summary":"President says ‘I hear he’s coming on Friday’ amid reports that terms of US-Ukraine aid exchange have been reached\n\nDonald Trump has said that Volodymyr Zelenskyy is likely to visit the White House on Friday to sign a rare earth minerals deal to pay for US military aid to defend against Russia’s full-scale invasion.\n\nThe announcement followed days of tense negotiations between the US and Ukraine in which Zelenskyy alleged the US was pressuring him to sign a deal worth more than $500bn that would force “ten generations” of Ukrainians to pay it back.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/feb/25/trump-zelenskyy-ukraine-minerals-deal","image":"https://i.guim.co.uk/img/media/ee8736272dedaa7e6dd690f9209183dae574dfeb/0_0_4418_2651/master/4418.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmY","video":null,"publish_date":"2025-02-26 00:00:47","author":"Andrew Roth","authors":["Andrew Roth"],"language":"en","category":"politics","source_country":"us","sentiment":-0.366},{"id":294346826,"title":"Letters: PG&E shareholders aren’t getting rich","text":"Stockholders feel\npain of PG&E bills\n\nRe: “PG&E profits built on ratepayers’ backs” (Page A6, Feb. 21).\n\nThis letter and others complaining about how “wealthy” the shareholders are getting from PG&E dividends just isn’t true. The company has gone through two bankruptcies which caused a stop to dividends for a long time.\n\nDividends resumed in 2024 at the rate of one penny a share, which cost more to issue than the check was worth. Only the last dividend this year produced a 2½ cents per share check, again really nothing for a small shareholder. The current share price is so low compared to the size of this utility it isn’t worth investing in. The only ones who are probably making bank here are the overpaid executives and the board of directors.\n\nI too have to pay overpriced bills for gas and electricity like everyone else. Stop wasting money on advertising and patting yourselves on the back, and lower rates now.\n\nBruce Krutel\n\nTrump is marching\nU.S. toward autocracy\n\nRe: “Vance’s Munich disgrace is an echo of the past” (Page A6, Feb. 21).\n\nThe column is smack on with its insights for today.\n\nIn 1933, the Nazi Party with Hitler as its leader used all the tools and rules of democracy to diminish and then destroy democracy in Germany, resulting in an authoritarian state. The same scenario is going on in the USA today. Trump’s version of “Mein Kampf,” the Project 2025 Report, is his blueprint for success.\n\nThe Republicans in Congress are fearful of Trump, and the Democrats appear to be powerless; hence we are headed toward an autocracy.\n\nStan Kaplan\n\nTrump’s waste crusade\nto fund tax cut for rich\n\nRe: “Hundreds rally against firings, citing threats to public health” (Page A3, Feb.20).\n\nDonald Trump’s crusade to “cut government waste” is just another deceptive charade to fund huge tax cuts for the ultra-wealthy — subsidized by the rest of us.\n\nTrump is cutting funding and staff of the U.S. Department of Health, Veterans Administration, Medicaid, Medicare, NIH and CDC — threatening the health of military veterans, seniors and the entire U.S. population (remember the 2020 COVID world pandemic?) — all so the wealthiest 1% can pay even less than they already do.\n\nTrump’s 2017 tax cuts for billionaires already added $2 trillion to our budget deficit — his new tax cuts will add an estimated $5 trillion to the 10-year deficit. I wonder how many Trump voters will enjoy paying much higher taxes to help the wealthiest 1%?\n\nDave Whitaker\n\nTime for citizens to\nshow up against Trump\n\nIs America great again?\n\n• Trump supports veterans by cutting thousands of federal jobs. Nearly 30% of federal workers are veterans.\n\n• Trump protects consumers by stopping work at the Consumer Financial Protection Bureau. It protects us from predatory financial practices, saved consumers nearly $20 billion since inception, capped credit card late fees at 8% and caught scammers.\n\n• Trump brought down egg prices on Day One? A dozen eggs cost $10 last week at my local supermarket.\n\n• Trump made the FAA efficient by firing its chief Administrator and Aviation Security Committee. Five airplane crashes and two ground collisions occurred during his first month in office.\n\nIs this “greatness”? Let’s stop it: join one of several national movements to check this self-proclaimed “king”; call for town hall meetings with your congressional representative and demand action; contact your U.S. senator about your experiences; donate or volunteer to elect Democrats and take control of Congress in ’26; show up.\n\nVirginia Carpio","summary":"Also: Toward autocracy &#124; Funding tax cuts &#124; Show up. Mercury News reader letters to the editor for Feb. 26, 2025.","url":"https://www.mercurynews.com/2025/02/25/letters-puc-firmer-hand-over-pge-rates/","image":"https://www.mercurynews.com/wp-content/uploads/2024/04/SJM-L-PGEBILLSPOPPE-0423-1-01.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-26 00:00:44","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.512},{"id":294354084,"title":"Japan reaffirms ‘unwavering’ support for Ukraine, calls for peace on third anniversary of war","text":"Japan’s political leaders have marked the third anniversary of the Russian invasion of Ukraine with expressions of support for Kyiv, reiterating their commitment to lasting peace achieved through discussions that involve the Ukrainian government.\nObservers note, however, that Tokyo chose not to repeat the criticisms of European and other global leaders of what is widely seen as a betrayal of Ukraine by the administration of US President Donald Trump.\nJoining an online summit with Volodymyr Zelensky on Monday, Prime Minister Shigeru Ishiba reaffirmed Japan’s “unwavering” commitment to the war-torn country and again condemned the 2022 Russian invasion as a “reckless act”, voicing hope that lasting peace could be achieved through diplomatic efforts involving Kyiv.\nSince returning to the White House in January, Trump has undermined global backing for Ukraine, describing Zelensky as a “dictator” and blaming Kyiv for starting the war.\nTrump has also demanded Ukrainian minerals in return for military aid that was provided under the administration of former president Joe Biden and supported Moscow’s plans for ending the fighting, which would entail Russia retaining the land it has seized and Ukraine not being permitted to join Nato or the European Union.\nFriedrich Merz, Germany’s chancellor-elect, said the Trump administration “is largely indifferent to the fate of Europe”, while French President Emmanuel Macron told Trump in the White House earlier this week that peace must not mean surrendering Ukraine.\n\nJapanese politicians, however, were far more circumspect in their statements.\n“The Japanese government is taking great care to express its position in ways that do not contradict or antagonise Trump,” said Ryo Hinata-Yamaguchi, associate professor in Tokyo International University’s Institute for International Strategy.\n“Ishiba has done a pretty good job of stating Japan’s position on Ukraine and making clear that it is different to Washington’s position, but not doing it in a way that upsets Trump,” he told This Week in Asia.\n“Basically, the government here does not want to find itself in a similar situation to Canada.”\nTrump had threatened to invade America’s northern neighbour and turn it into the 51st state after the Canadian government rebuffed his demands to hand over its sovereignty to Washington.\nAccording to Hinata-Yamaguchi, Japan would also very much prefer the US to take a firm line with Moscow as Russia has a powerful Far East military presence that poses a threat to Japan’s security, while the two countries still dispute the sovereignty of islands off northern Hokkaido that were seized by the Soviet Union in the closing stages of World War II.\n“Japan is also thinking about the impact on Taiwan and there are concerns that if the US allows Russia to change the status quo in eastern Europe by force, then China could use the same strategy over Taiwan,” he added.\n\nForeign Minister Takeshi Iwaya expressed sentiments similar to Ishiba’s on Friday, saying that the post-war peace “must be fair and lasting” and linking the crisis in eastern Europe with challenges to peace in the Asia-Pacific region.\n“Efforts must be made not to draw the wrong lessons from the negotiations,” Iwaya said, hinting that any agreement that legitimised Russia’s territorial claims could equally be used by Beijing to support its claims over Taiwan.\nSpeaking at the Munich Security Conference on Saturday, Iwaya added, “It must not end with Russia becoming the victor.”\nConcern over North Korean forces\nGovernment officials have also expressed concern about the new military skills that North Korean troops have learned on the battlefields of Ukraine since being deployed to support their Russian allies, although a military expert told This Week in Asia that any improvement in North Koreans’ ability to wage war on the Korean peninsula in the future was “minimal”.\nChief Cabinet Secretary Yoshimasa Hayashi told a press conference in Tokyo on Friday that Japan should be “seriously concerned” about the North Korean troops committed to Ukraine “in light of the security environment surrounding our country”.\nAn unnamed official in the Defence Ministry was quoted by Jiji Press as saying it was “significant” that North Korea had gained experience of drone warfare at the same time as obtaining Russian military hardware for its own armed forces.\n\n“It has been widely reported that the North Koreans had to withdraw their infantry units from the front lines because they were taking such heavy losses, but that they are now being filtered back,” said Garren Mulloy, a professor of international relations at Daito Bunka University and a specialist in military issues.\n“It appears that the North Koreans adopted some of the tactics that the Russian infantry have had to introduce over the last three years, primarily ways of avoiding thermal detection and defence against drone attacks,” he added. These tactics involve operating in smaller groups, the importance of concealment and manoeuvring.\nWhile those skills would be useful at the small unit level, Mulloy said, the North Korean army was still equipped with largely outdated weapons and its personnel were poorly trained and less physically capable than their counterparts in South Korea should fighting break out on the peninsula.\n“They may be learning at the squad level, but it would be impossible to scale that up across the military for the large-scale warfare that would be needed on the peninsula,” he said.\n“The North has missiles that can cause damage to other nations, but their aircraft and tanks are of such poor quality that should they try to go up against the South Koreans, they would be wiped out.”","summary":"Tokyo’s circumspection shows how its stance on Ukraine differs from Washington in a way that does not upset Trump, analysts note.","url":"https://www.scmp.com/week-asia/politics/article/3300112/japan-reiterates-unwavering-support-ukraine-calls-peace-3rd-anniversary-war","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/25/75c8015a-928d-48a8-97e5-3c931e175cbe_838e5de2.jpg","video":null,"publish_date":"2025-02-26 00:00:14","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","source_country":"cn","sentiment":0.263},{"id":294354082,"title":"Alibaba’s US$52 billion capex seen as catalyst for China’s Big Tech in AI race","text":"Alibaba Group Holding is spearheading China’s Big Tech sector in the race for global leadership in artificial intelligence (AI) technology and infrastructure with its spending plan, competing with US giants like Apple and Microsoft for first-mover advantage, analysts said.\nThe e-commerce leader’s 380 billion yuan (US$52.4 billion) capital expenditure for computing resources and AI infrastructure is the biggest allocation yet by a private Chinese entity, a move that is likely to draw local peers like Tencent Holdings and ByteDance into the fray, they added.\nAlibaba, based in Hangzhou in eastern Zhejiang province, owns the South China Morning Post.\nThe AI-focused spending budget, triggered by quick availability of open-source large language models (LLMs) for businesses to adapt, mirroring similar but bigger plans in the US amid heightened tech war and geopolitical tensions. The massive investment in AI infrastructure may be about “democratising generative AI [GenAI] to the local markets”, according to Su Lian Jye, chief analyst at research firm Omdia.\n\n“As China and the US are the two largest single markets, investing in AI data centres allows vendors like Alibaba, Apple, and OpenAI to tap into the economies of scale and offer their services at a much cheaper cost,” Su added. “Whichever market can accelerate GenAI adoption and innovation will have an upper hand in the tech race.”\nApple announced a US$500 billion four-year budget on Monday to boost its computing resources and other facilities, while Microsoft last month allocated more than US$80 billion for data centres this financial year. Amazon earlier this month said that it would spend US$100 billion in 2025 to capture “once-in-a-lifetime” opportunities in AI.\nUS President Donald Trump last month unveiled the Stargate Project, a mega AI infrastructure project being jointly developed by Japan’s most aggressive tech investor SoftBank group and OpenAI. The project’s initial US$100 billion investment outlay could be upsized to US$500 billion over the next four years.\n\nAlibaba is among the world’s top players in AI model development, with Qwen being one of the most widely adopted open-source models. The company is poised to unveil its next reasoning model called QwQ-Max, which could rival other LLMs like OpenAI’s o1 and DeepSeek’s R1, analysts said.\nWith Alibaba’s AI capabilities and its extensive client base, the company is preparing for surging demand by budgeting an amount for the next three years that exceeds its total spending on AI infrastructure over the past decade. To reflect the market’s underlying confidence in its AI bets, investors have pushed its share price up by 60 per cent this year, boosting its market value by more than US$120 billion.\nAlibaba Cloud has also expanded its footprint in key overseas markets, including Thailand and Mexico, jostling for global market share against Amazon Web Services, Microsoft’s Azure and Google Cloud.\nAlibaba’s investment plan might encourage its peers in China to step up capital expenditure as well, said Kenny Ng, a strategist at Everbright Securities International. They are eyeing the first-mover advantages “in the initial stage of artificial intelligence development”, he added.","summary":"Global tech giants are eyeing the first-mover advantages in the initial stage of artificial intelligence development, Everbright Securities says.","url":"https://www.scmp.com/tech/big-tech/article/3300111/alibabas-us52-billion-capex-seen-catalyst-chinas-big-tech-ai-race","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/25/a3f13c5e-e73a-4bbf-99f7-b20a6d75880e_d1137adf.jpg","video":null,"publish_date":"2025-02-26 00:00:08","author":"Ann Cao","authors":["Ann Cao"],"language":"en","source_country":"cn","sentiment":0.031},{"id":294352024,"title":"Kanye West Makes Another Sick Move by Questioning Whether Cassie Ventura 'Extorted' Abusive Ex Sean 'Diddy' Combs Over Sexual Assault Case — Even Though Savage Hotel Beating Was Caught on Camera","text":"Kanye West is claiming his ex Cassie Ventura used her lawsuit against Sean 'Diddy' Combs to cash in.\n\nVentura's sexual assault lawsuit against Combs has sparked yet another explosive rant from West, who's now accusing the singer of \"extorting\" the jailed rapper in a since-deleted X tirade, RadarOnline.com can reveal.The Me & U hitmaker, Combs' ex-girlfriend for over a decade and former signee, sued the Bad Boy Records mogul of physical assault and rape in November 2023.\n\nThe case was quickly settled, though Combs denied the allegations. However, months later, shocking CCTV footage surfaced showing the him dragging, kicking, and hitting Ventura in a Los Angeles hotel – backing up her claims.The incident was referenced in her suit, which read: \"He followed her into the hallway of the hotel while yelling at her.\n\n\"He grabbed at her, and then took glass vases in the hallway and threw them at her, causing glass to crash around them as she ran to the elevator to escape.\"Combs later apologized for his \"inexcusable\" behavior captured in the video.\n\nHowever, his mess didn't end with Ventura's settlement. Combs is currently in jail awaiting his trial on sex trafficking charges, set for May 2025. \n\nHe has been accused of abusing and blackmailing several women over a span of 15 years.Last week, West, 47, posted a series of now-deleted controversial tweets regarding Combs' lawsuit.\n\nOne of them asked: \"Did Cassie extort Puff?\" while raising doubts about how quickly their case was settled.Despite a past feud between Combs and West, the Heartless rapper has recently shown support for his former foe while he's been detained.\n\nEarlier this month, West launched an extensive social media tirade calling for President Donald Trump to \"Free Puff\" while announcing a new Yeezy clothing line in partnership with Combs' Sean John brand.Combs thanked West in return, sharing his tweets about their clothing collaboration from behind bars.\n\nWest's support for Combs came as a surprise for many, considering their feud since 2022 when West released his controversial \"White Lives Matter\" merchandise.After Combs called the message \"tone deaf\" in a podcast, West shared heated texts between them – including a warning about money and a strange admission of understanding how he hurt people he loves.\n\nIt's also no surprise to see West bring up the question of extortion, as his since-deleted tweet comes after he accused his former assistant Lauren Pisciotta of trying to blackmail him.\n\nPisciotta filed a lawsuit against him in June for sexual harassment and wrongful termination, later amending it to include claims West drugged and raped her at a studio session with Combs.The Yeezy founder denied the accusations in a series of fiery tweets, alleging she was extorting him and bringing up her supposed sexual history with NBA players.\n\nReports say West has relocated to Tokyo, complicating efforts to serve him legal documents – and his court hearing has been rescheduled from January 29 to March 27.","summary":"Kanye West has opened the floodgates with another since-deleted X post, questioning if Cassie Ventura 'extorted' her ex Sean 'Diddy' Combs.","url":"https://radaronline.com/p/kanye-west-questions-cassie-ventura-extorted-sean-diddy-combs-sexual-assault-case/","image":"https://media.radaronline.com/brand-img/LKQ7XI1RP/0x0/kanye-west-questions-cassie-ventura-extorted-sean-diddy-combs-sexual-assault-case-1740522144804.jpg","video":null,"publish_date":"2025-02-26 00:00:00","author":"Juliane Pettorossi","authors":["Juliane Pettorossi"],"language":"en","source_country":"us","sentiment":-0.451},{"id":294348740,"title":"Nearly 6,000 veterans have lost jobs in Musk purge, Democrats say","text":"Donald Trump, in concert with Elon Musk’s Department of Government Efficiency, have reportedly fired nearly 6,000 veterans this year. \n\nHouse Appropriations Committee Ranking Member Congresswoman Rosa DeLauro and Subcommittee on Military Construction and Veterans Affairs and Related Agencies Ranking Member Congresswoman Debbie Wasserman Schultz issued a statement on Tuesday saying that the Trump administration had fired nearly 6,000 veterans since it began gutting federal agencies. \n\n“Our veterans make significant sacrifices in service of our country, but those sacrifices do not seem to matter to President Trump and unchecked billionaire Elon Musk,” DeLauro wrote. \"They are an essential part of our federal workforce, bringing their expertise to every single agency. Republicans are turning their back on them, allowing Musk to fire at least 6,000 veterans and leave them with no way to feed their families or keep a roof over their heads.\"\n\nDeLauro said that the firings should \"outrage anyone who respects our veterans and servicemembers and believes our promises to them should be upheld.\" \n\nMusk, under the auspices of DOGE, has been making cuts to the federal government by firing federal workers he deems unnecessary. His actions have effectively shuttered USAID, which engages in foreign development and influence work, and he has threatened to \"delete\" the US Department of Education. More than 10,000 USAID staffers have been placed on leave, according to ABC News. \n\nDozens of \"probationary employees\" at the Department of Education were let go on February 12, according to two sources who spoke to the broadcaster.. \n\nMusk's team has also targeted the Department of Homeland Security — which saw more than 400 employees fired, half of which were members of the Federal Emergency Management Agency, which provides relief after disasters. \n\nApproximately 2,000 federal employees at the Department of Energy have been fired, including some from the National Nuclear Security Administration. \n\nMusk's culling has not only cost veterans their jobs, but it's targeting the agency that provides them services, including healthcare; the Department of Veterans Affairs. \n\nOne of those employees was Andrew Lennox, who spent 10 years as a US Marine and deployed to Iraq, Afghanistan, and Syria during his time in the armed forces. \n\nLennox told Mother Jones he was shocked when he saw the email informing him that he no longer had a job. He joined the VA to help other veterans and assumed his job would be safe under a Republican administration that ostensibly valued its veterans. \n\n“My thought process was: This is the VA. We are going to be at the very end of the list. And it might sound kind of selfish, but I thought, I’m a vet. I’m safe,” he told Mother Jones.\n\nHe pointed to Project 2025 co-author and Office of Management and Budget Director Russ Vought’s comments that the Trump administration wants to “make life so miserable that these people don’t want to come to work every day,” and that he wants working in the federal government to be a “traumatic experience” as evidence that the administration doesn’t care about its federal workers, including veterans. \n\n“You want this to be a traumatic experience for government employees, 30 percent of whom are veterans?” Lennox said. “How could you stand behind a podium—and now stand in a position where there’s the flag of the United States behind you—and say that to people who dedicated their lives to serving this country both in uniform and out of uniform? It’s cowardly.”\n\nAccording to ABC News, Musk's cuts have eliminated 2,400 people in the VA, and more than 1,000 probationary employees were released from their roles on February 13, according to the agency. \n\nThe Trump administration defended its cuts by saying that the firings were part of its \"government-wide Trump Administration effort to make agencies more efficient, effective and responsive to the American People.\"\n\n“Trump and Musk have launched an unwarranted and unjustified attack on the veterans and military spouses who sacrificed so much for all of us,\" Wasserman Shultz said. \"By upending their lives and careers, these groundless firings are a disgraceful assault on heroes who admirably served our country. It is deeply offensive that this Administration would attempt to balance our budget on the backs of our veterans.”\n\nThe federal government is the single largest employer of veterans in the US. Veterans make up 30 percent of the approximately 2.3 million person civilian federal workforce, according to the release. \n\nThe congresswomen warned that Musk's goal of cutting 75 percent of the federal workforce would mean that up to 500,000 veterans could lose their jobs. \n\nThe Independent has requested comment from the White House.","summary":"If DOGE chief does trim down 75 percent of the federal workforce, up to 500,000 veterans could lose their jobs","url":"https://www.independent.co.uk/news/world/americas/us-politics/veterans-lost-jobs-elon-musk-purge-b2704652.html","image":"https://static.independent.co.uk/2025/02/24/21/CPAC_2025_70594.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/4ObvusTM-OhrQWqOm.mp4","publish_date":"2025-02-25 23:56:39","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.138},{"id":294345168,"title":"DOGE Republicans Skeptical of Trump’s Idea to Halve Defense Budget in Deal With China, Russia","text":"WASHINGTON—In a Feb. 25 press conference, Republicans with the House DOGE Caucus spoke about their alignment with Elon Musk’s Department of Government Efficiency (DOGE), a time-limited organization created via executive order to address waste, fraud, and abuse in federal spending, in line with President Donald Trump’s agenda.\n\nBut some sounded skeptical of one massive possible spending cut that Trump has also floated—namely, working to halve the defense budget if Russia and China agree to the same.\n\nRep. Ralph Norman (R-S.C.) told The Epoch Times that Trump “can only control America.”\n\n“Putin’s a thug,” Norman said of Russian President Vladimir Putin.\n\n“He can’t control China. China’s our enemy,” Norman added.\n\nRep. Pete Sessions (R-Texas), the co-chair of the DOGE Caucus, told The Epoch Times that the talk from Trump amounted to “a negotiation.”\n\n“Do I think it’s worthy? Yes, I do. Am I willing to listen? Yes, I am. But it needs to be with a by-and-large understanding about what the world’s going to look like. I am not at all for us leaving ourselves unprepared in the future,” Sessions said.\n\n“I’m going to say there’s no reason for us to be spending almost $1 trillion on the military,” he said, adding that he hoped to move towards denuclearization alongside those two great powers on the world stage.\n\n“I want to say, ‘Let’s cut our military budget in half.’ And we can do that. And I think we’ll be able to,” Trump said of prospective meetings he would like to have with Chinese leader Xi Jinping and Russian President Vladimir Putin.\n\nShares of the defense companies Lockheed Martin, Northrup Grumman, and General Dynamics dropped after that executive-level talk.\n\nThe Department of Defense, led by Pete Hegseth, is already making moves geared toward efficiency, though nothing on the scale of halving spending.\n\nAdditionally, on Feb. 19, the Pentagon announced plans to redirect 8 percent of planned defense spending, or $50 billion, to the president’s goals.\n\nIn a statement on the move, Darin Selnick, who is acting Under Secretary of Defense for Personnel and Readiness, said that the department was acting on the new president’s intentions.\n\n“Including securing our borders, building the Iron Dome for America, and ending radical and wasteful government DEI [diversity, equity, and inclusion] programs and preferencing.”\n\nAs the Republicans spoke at the DOGE Caucus press conference, activists with Code Pink protested nearby. They held signs calling on lawmakers to cut the Pentagon’s budget. The group describes itself as “a feminist grassroots organization working to end U.S. wars and militarism, support peace and human rights initiatives.”\n\nMedea Benjamin, the co-founder of Code Pink, told The Epoch Times that Trump’s plan to redirect 8 percent of Pentagon funding was “a scam,” aimed at, among other things, “focusing on China as our adversary.”\n\nThe activist was more supportive of the sweeping defense cuts with Russia and China and denuclearization that the president mentioned earlier in the month.\n\n“We think all of those things are great,” she said. “The problem is, there’s this huge military-industrial-security complex, and they’re not going to want him to do that. So that’s why we’re here.”","summary":"'He can’t control China. China’s our enemy,' Rep. Ralph Norman (R-S.C.) said.","url":"https://www.theepochtimes.com/us/doge-republicans-skeptical-of-trumps-idea-to-halve-defense-budget-in-deal-with-china-russia-5816343","image":"https://img.theepochtimes.com/assets/uploads/2025/02/25/id5816287-02252025-L1190287-DOGE-Day-300x180.jpg","video":null,"publish_date":"2025-02-25 23:56:31","author":"Nathan Worcester","authors":["Nathan Worcester"],"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":294347424,"title":"Former Keystone Pipeline worker ‘praises the lord’ the Biden admin is gone","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Evening Edit February 25, 2025 04:29 \n\n Former Keystone Pipeline worker ‘praises the lord’ the Biden admin is gone \n Former Keystone Pipeline worker Bugsy Allen discusses how detrimental the Biden administration was to the oil industry and how it will improve under President Donald Trump on ‘The Evening Edit.’\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags WHAT TO WATCHSHOWSTHE EVENING EDIT | LATEST EPISODESTHE EVENING EDITV-VIDEOSPOLITICS","summary":"Former Keystone Pipeline worker Bugsy Allen discusses how detrimental the Biden administration was to the oil industry and how it will improve under President Donald Trump on ‘The Evening Edit.’","url":"https://www.foxbusiness.com/video/6369319419112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/23dedcb2-d4fb-4376-9239-b973ab72f197/434c5ada-8190-4cd8-b417-548b46a9b950/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-25 23:55:44","author":null,"language":"en","source_country":"us","sentiment":-0.514},{"id":294345162,"title":"Trump Says Zelenskyy to Sign Critical Minerals Deal at White House Friday | Capitol Report","text":"Feb-25-2025\n\nPresident Donald Trump is exploring tariffs on copper to counter national security risks posed by China. We have the details of Trump’s latest executive order. Meanwhile, Ukrainian officials say Washington and Kyiv have reached an agreement on a critical minerals deal, setting up a possible meeting between the leaders of the two...","summary":"President Donald Trump is exploring tariffs on copper to counter national security risks posed by China. We have the details of Trump&#8217;s latest executive order. Meanwhile, Ukrainian officials say Washington and Kyiv have reached an agreement on a critical minerals deal, setting up a possible meeting between the leaders of the two countries. House Republican [&#8230;]","url":"https://www.theepochtimes.com/epochtv/trump-says-zelenskyy-to-sign-critical-minerals-deal-at-white-house-friday-capitol-report-5816285","image":"https://img.theepochtimes.com/assets/uploads/2025/02/25/id5816383-Captiol_0225_v1.jpg","video":null,"publish_date":"2025-02-25 23:53:04","author":"Steve Lance","authors":["Steve Lance"],"language":"en","category":"politics","source_country":"us","sentiment":-0.052},{"id":294353920,"title":"Trump Announces Investigation That Could Lead to Tariffs on Foreign Copper","text":"WASHINGTON -- President Donald Trump signed an executive order Tuesday directing his commerce secretary, Howard Lutnick, to begin an investigation into whether foreign production of copper and imports of the material into the United States pose risks to America's economic and national security.\n\nWhite House officials said that, depending on the results of the inquiry, new tariffs could be applied on copper, which is widely used in manufacturing and construction and is crucial to the U.S. military and emerging technologies including artificial intelligence.\n\nWhite House officials were scant on details during a call with reporters Tuesday about when the inquiry might conclude or what rate tariffs might be set at, saying they did not want to prejudge the results of the investigation.\n\nPeter Navarro, a senior counselor for trade and manufacturing, said that Lutnick would move \"in Trump time, which is as quickly as possible, and get the results of his investigation to the president's desk for possible action.\"\n\nThe potential tariffs would help to protect the domestic copper industry that the White House says has been undermined by unfair trade practices by other countries and is struggling to compete. Copper is, among other things, an essential component in the building of ships, aircraft and tanks.\n\nThe Trump administration framed it Tuesday as an issue of national defense as much as an economic one, saying that the metals would be needed for the military, electric vehicles and artificial intelligence, and that geopolitical turmoil could sever the United States from needed supplies.\n\n\"Tariffs can help build back our American copper industry, if necessary, and strengthen our national defense,\" Lutnick said. \"American industries depend on copper, and it should be made in America -- no exemptions, no exceptions.\"\n\n\"It's time for copper to come home,\" he added.\n\nLike the tariffs on steel and aluminum that Trump is promising to reinstate next month, copper tariffs would raise costs for a variety of other industries that depend on the metal and could generate pushback from them. That includes makers of automobiles, electronics and telecommunications equipment, as well as construction companies, which use copper for plumbing, roof construction and other uses.\n\nThe tariffs could also spur new fights with countries that ship metal to the United States. America's largest foreign source of copper is Chile, which sends the equivalent of $4.63 billion of the metal to the United States each year, followed more distantly by Canada, Peru, Mexico and Congo.\n\nU.S. copper production has been falling over time. The country mined an estimated 1.1 million metric tons of copper in 2024, down roughly 20% in a decade, according to data from the U.S. Geological Survey.\n\nChina is also a major global producer of copper but sends relatively little to the United States because of previously imposed tariffs. But White House officials say that Chinese copper production has still driven down global prices and that China has been snapping up copper resources globally.\n\nNavarro said in the call with reporters Tuesday that China had \"long used industrial overcapacity and dumping as an economic weapon to dominate global markets\" and systematically undercut competitors from other countries.\n\n\"It is now using that same model to gain control of the world's copper markets,\" he said.\n\n(BEGIN OPTIONAL TRIM.)\n\nCopper prices have climbed this year due to expected tariffs and continued resilience in manufacturing activity, according to a note earlier this month from analysts at Citigroup. The United States consumed about $17 billion of copper in 2024, and imported about 45% of that amount, the analysts said.\n\nAsked how the president had chosen to take up the issue of copper, a Trump administration official on the call said that Trump has the ability to foresee far into the future what others might miss. The official made a reference to a 1988 interview in which Trump talked to Oprah Winfrey about trade with Japan, and said that exchange presaged how the president would think about retaliation against foreign governments that were \"cheating\" the United States.\n\nTrump has threatened to impose tariffs on a variety of imports, including steel, aluminum, automobiles and pharmaceuticals. He also came within hours earlier this month of imposing tariffs on Canadian and Mexican exports, saying the countries were not doing enough to stop the flow of drugs and migrants into the United States. He paused those tariffs for a month, but said this week they would go into effect March 4 as planned.\n\nTrump also imposed an additional 10% tariff on all products from China, which brought retaliatory tariffs from the Chinese on American exports. And he has introduced a plan to dramatically reform U.S. tariff rates on other countries, by changing them to reciprocate the tariff levels that other countries charge the United States, as well as capturing certain trade behaviors he deems unfair.\n\n(END OPTIONAL TRIM.)\n\nThe copper investigation will be carried out under Section 232 of the Trade Expansion Act, which allows the president to impose tariffs on foreign products in the interest of national security. By law, the commerce secretary has 270 days to present findings from the investigation to the president.\n\nA White House official said the investigation would include raw mined copper, refined copper, alloys, scrap and certain derivative products that are made with copper.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- President Donald Trump signed an executive order Tuesday directing his commerce secretary, Howard Lutnick, to begin an investigation into whether foreign production of copper and imports of the material into the United States pose risks to America's economic…","url":"https://www.berkshireeagle.com/nyt/trump-announces-investigation-that-could-lead-to-tariffs-on-foreign-copper/article_37d5a6d0-19b7-562a-941a-8350521aadda.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-25 23:52:59","author":"Ana Swanson and Shawn McCreesh,Blox Content Management","authors":["Ana Swanson and Shawn McCreesh","Blox Content Management"],"language":"en","category":"politics","source_country":"us","sentiment":-0.185},{"id":294348754,"title":"Questions swirl after Trump is pictured with large bruises on his hands","text":"Questions have been raised over President Donald Trump’s wellbeing after what looked like a bruise was spotted on the back of his right hand.\n\nZoomed-in photos of the 78-year-old’s clasped hands during a Monday meeting with French president Emmanuel Macron revealed what appeared to be a makeup-covered bruise. \n\n\"President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other President in history. His commitment is unwavering and he proves that every single day,” White House Press Secretary Karoline Leavitt told The Independent in a statement.\n\nBut others on X speculated about what could have caused the bruising.\n\nSome X users attributed the markings to an IV, others believed he could be on blood thinning medications, and others still thought it could just be from aging.\n\nOne X user remarked: “To be fair my grandma also has bruises on her hands at age 79 and has had them for years. It’s just something that happens when you're old and trump is OLD.” \n\n“He is constantly bruised up. This is karma for him making fun of an aging Joe Biden,” another said.\n\nSome even compared his hand to those of the late Queen Elizabeth II, who died in 2022 aged 96.\n\nOne user joked that his ego bruises “easily”: “Trump is a few months shy of being 80 and is technically ‘elderly’…. But that’s not the only reason he has a big bruise on his hand… he’s very thin skinned … susceptible to bruising easily when criticized.” The user added: “It’s also possible he’s on blood thinner medication.”\n\nAnother quipped: “Looks like he had one of his handshaking competitions with Macron.”\n\nThe world leaders have a history of strange handshakes, or what the commentator Piers Morgan once called “Trump-Macron arm-wrestles.”\n\nAnother thought there was a link to the French president’s visit: “That would be Macron's rap on the knuckles when he told Trump off for lying.”\n\nDuring the pair’s meeting, Trump claimed that Europe was only “loaning” money to Ukraine in its efforts to fight the war against Russia. But Macron stepped in to correct him. Placing his hand on Trump’s arm, he said: “No, in fact, to be frank, we paid 60 percent of the total effort and it was – like the US – loans, guarantees, grants. We provided real money, to be clear.”\n\nThis is far from the first time Trump’s wellbeing has been under scrutiny. The oldest-ever inaugurated president said in August he would “gladly” release his medical records to the public, but never did on the campaign trail. \n\nThe health of presidents has become a political issue in recent years, especially since the Covid-19 pandemic when Trump reportedly tested positive for the virus in September 2020, just three days before attending a presidential debate against Joe Biden, raising questions about what his physicians were sharing publicly about his health.\n\nFollowing his treatment at Walter Reed Medical Center, there were again questions over how forthcoming his physicians had been. According to a New York Times report, the then-president had experienced “extremely depressed blood oxygen levels” and officials feared that he was on the verge of being put on a ventilator.\n\nTrump’s team did not comment on those reports at the time, but sources close to the former president denied he was ever seriously ill.\n\nAs president, Biden’s health was also under scrutiny. A persistent cough and a stiffened gait highlighted his age, while there were also questions over his mental fitness. Eventually, after he stumbled in his debate against Trump last July, concerns over his mental capacities and ability to serve a second term led to him stepping down from the Democratic ticket.\n\nWhen Trump first entered the race for the presidency in 2015, Dr. Harold Bornstein wrote a letter touting his patient’s health: “If elected, Mr. Trump, I can state unequivocally, will be the healthiest individual ever elected to the presidency.” Years later, Bornstein confessed to CNN that those words were not his own: “He dictated that whole letter. I didn’t write that letter,” Bornstein told CNN. “I just made it up as I went along.”","summary":"‘President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other President in history,’ the White House said","url":"https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-large-bruises-hands-b2704624.html","image":"https://static.independent.co.uk/2025/02/25/21/37/Social-media-users-are-speculating-what-caused-bruises-on-President-Donald-Trumps-hands-as-the-White.jpeg?trim=119,0,21,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/v6DjTJXx-OhrQWqOm.mp4","publish_date":"2025-02-25 23:50:56","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.344},{"id":294350648,"title":"Who is Amy Gleason, the person named DOGE’s acting leader by the White House?","text":"By Ryan J. Foley | Associated Press\n\nThe acting administrator of the Department of Government Efficiency is a low-profile executive who has expertise in health care technology and worked in the first Trump administration.\n\nThe White House on Tuesday afternoon identified Amy Gleason as the acting leader of DOGE, which has been pushing agencies to fire employees, cancel contracts and make other budget cuts.\n\nAlthough DOGE’s cuts have been championed by billionaire Elon Musk and his associates, the White House has insisted that Musk is overseeing the effort as a senior adviser to President Donald Trump, not a DOGE employee.\n\nThe identity of who was technically running DOGE had been a mystery, even though an executive order signed by Trump last month called for the appointment of an administrator to report to the White House. A government lawyer on Monday told a judge that he didn’t know who that person was, and White House press secretary Karoline Leavitt had declined to identify the person earlier Tuesday in a press briefing.\n\n“There are career officials and there are political appointees who are helping run DOGE on a day-to-day basis,” she said.\n\nGleason, 53, worked from 2018 through 2021 in the United States Digital Service, an agency that has been renamed the US DOGE Service, according to her LinkedIn profile. In that role, she worked with the White House on the federal response to the coronavirus pandemic.\n\nShe returned to the agency in January after Trump took office. DOGE and Gleason did not respond to an email seeking comment on Tuesday.\n\nMore than 20 members of the former digital service resigned Tuesday with a letter criticizing Musk for working to “dismantle critical public services.”\n\nIn the interim, she had been working as “chief product officer” at two small Nashville-based health care startups, Russell Street Ventures and Main Street Health, according to her LinkedIn profile.\n\nBoth companies were founded by health care entrepreneur Brad Smith, who worked in the first Trump administration in several key health care roles and has also been working on the DOGE initiative.\n\nRussell Street Ventures’ website has recently been deleted, but the company has called itself “an innovative healthcare firm focused on launching and scaling companies that serve some of the nation’s most vulnerable and underserved patient populations.”\n\nMain Street Health says it works with primary care physicians in rural areas to provide clinics “with the data and opportunities they need to succeed in value-based care.”\n\nThe company’s website deleted Gleason’s biography. But an archived version shows that it said she “spearheaded technology efforts for the federal COVID-19 response” and worked on projects with the Centers for Disease Control and Prevention and Centers for Medicare and Medicaid Services.\n\nGleason also has a consulting firm, Gleason Strategies, according to her LinkedIn profile.\n\nGleason has long been an advocate to cure a condition called juvenile myositis, a rare autoimmune disease that can cause muscle weakness and a skin rash in children. It affects her now-adult daughter.\n\nGleason shared her frustrations with how the health care system handles such diseases in a 2020 TED talk and called for technology and data changes that could help patients and doctors.\n\nShe worked as vice president for research at the Cure JM Foundation from 2014 to 2018, according to her LinkedIn profile. She was also a co-founder and executive at Care Sync, a telehealth company based in Florida.\n\nFoley reported from Iowa City, Iowa.","summary":"Although DOGE’s cuts have been championed by Elon Musk and his associates, the White House has insisted that Musk is overseeing the effort as a senior adviser to President Donald Trump.","url":"https://www.mercurynews.com/2025/02/25/who-is-amy-gleason-the-person-named-doges-acting-leader-by-the-white-house/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/Trump_09331_e8dc49.jpg?w=1024&h=684","video":null,"publish_date":"2025-02-25 23:50:37","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":294346338,"title":"Over 250,000 sign petition to revoke Elon Musk’s Canadian citizenship","text":"A petition calling for the revocation of Elon Musk's Canadian citizenship has garnered more than 250,000 signatures as of Tuesday, accusing the billionaire tech mogul of undermining Canada’s sovereignty. Musk, who holds Canadian citizenship through his mother, Maye Musk, was born in Pretoria, South Africa.The petition, which launched on February 20, claims Musk has engaged in actions contrary to Canada's national interests, alleging that he \"has become a member of a foreign government that is attempting to erase Canadian sovereignty.\" It also cites Musk’s support for US President Donald Trump, who has repeatedly expressed the desire to annex Canada and incorporate it as the 51st US state.Musk responded to the petition with mockery, posting on his social media platform X that “Canada is not a real country.” (The post is now unavailable)— nexta_tv (@nexta_tv) The petition was spearheaded by Canadian federal lawmaker Charlie Angus, a member of the New Democratic Party, who stated that it provides an opportunity for Canadians to voice their concerns over the influence of powerful figures like Musk. \"People like Elon Musk are enemies of our country,\" Angus added.Musk, who also holds US citizenship, is known for his political activities and his ongoing support for Trump. The petition follows Musk's endorsement of Pierre Poilievre, leader of Canada's Conservative Party, as the next prime minister.Under Canadian federal law, citizenship may be revoked in cases of fraud or misrepresentation on immigration applications or if a person serves in a foreign army against Canada. However, petitions presented to Parliament cannot mandate any action, though they may elicit an official government response.As of now, Parliament is suspended until March 24, and the Canadian government has not indicated any immediate action regarding Musk's citizenship.","summary":"A petition with over 250,000 signatures is calling for the revocation of Elon Musk's Canadian citizenship. The billionaire is accused of undermining Canada's sovereignty and supporting US President Donald Trump. Canadian lawmaker Charlie Angus initiated the petition to address concerns over Musk's political activities.","url":"https://timesofindia.indiatimes.com/world/us/elon-musk-under-fire-as-petition-to-revoke-his-canadian-citizenship-tops-250000-signatures-mp-calls-him-enemy-of-our-country/articleshow/118568752.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-118568794/118568794.jpg","video":null,"publish_date":"2025-02-25 23:49:44","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.068},{"id":294345164,"title":"Texas Measles Outbreak Escalates to 124 Cases","text":"In Texas, the measles outbreak—the largest the state has seen in recent decades—has grown to 124 confirmed cases, state health officials reported on Tuesday.\n\nFive patients had already been already vaccinated, while the remainder were unvaccinated or had unknown vaccination status.\n\nAs of Feb. 21, state health officials had reported 90 cases across seven counties. The virus has since spread to Dallam and Martin counties, bringing the total number of affected counties to nine.\n\nFor now, the outbreak remains concentrated in Gaines County (80 cases) and Terry County (21 cases), while other counties report single-digit infections.\n\n“Due to the highly contagious nature of this disease, additional cases are likely to occur in the outbreak area and the surrounding communities,” the state health department said.\n\nAdditionally, New Mexico’s Lea County, which borders Gaines County, has reported nine cases.\n\nMeasles is caused by an airborne virus that spreads easily via coughing and sneezing. Symptoms typically include high fever, cough, runny nose, and a distinctive rash that begins on the face before spreading across the body.\n\nTexas and federal health officials have consistently said that vaccination is the best way to prevent getting sick with measles. The vaccination process includes two separate doses.\n\nRobert F. Kennedy Jr., a prominent advocate of vaccine safety who recently took office as Secretary of Health and Human Services, has announced a new initiative to investigate potential health risks associated with vaccines and many other factors.\n\nIn his first remarks to HHS staff, Kennedy said the Make America Healthy Again Commission, created last week through an executive order by President Donald Trump, will examine vaccines, pesticides, and antidepressants to determine if they contribute to the rise in childhood chronic conditions like ADHD and obesity.\n\n“The childhood vaccine schedule, electromagnetic radiation, glyphosate, other pesticides, ultra-processed foods, artificial food allergists, SSRI and other psychiatric drugs, BFAs, PFOAs, microplastics—nothing is going to be off limits.”","summary":"State officials said cases will likely continue to rise due to the 'highly contagious nature' of the disease.","url":"https://www.theepochtimes.com/us/texas-measles-outbreak-escalates-to-124-cases-5816268","image":"https://img.theepochtimes.com/assets/uploads/2025/02/25/id5816340-Measles_Outbreak_25052653529724-300x180.jpg","video":null,"publish_date":"2025-02-25 23:49:43","author":"Bill Pan","authors":["Bill Pan"],"language":"en","source_country":"us","sentiment":-0.182},{"id":294351588,"title":"With Ukraine war aid reaching $280 billion, who’s really funding the most – the US or EU?","text":"Defending Ukraine in its war with Russia has cost $280 billion so far – and the US has contributed more than any other country.\n\nPresident Donald Trump has raised concerns about the cost of the war in Ukraine in recent days and the topic dominated his Monday meeting with French president Emmanuel Macron.\n\nCountries around the world have donated billions to the Ukrainian war effort since Russia invaded the country in February 2022, but the two largest sources of funding are the US and the 27 country bloc of the European Union.\n\nCollectively the European Union has given $138 billion in financial, military and humanitarian aid, according to reports.\n\nThe US has allocated the most of any single country, $119 billion, according to the Germany-based Kiel Institute for the World Economy, which catalogues aid to the war-torn country through its Ukraine Support Tracker, focusing on government-to-government transfers.\n\nIn its most recent report, released Feb. 14, the German think tank reported that the US doled out $64 billion in military aid, $46 billion in financial aid, and $3.5 billion humanitarian aid.\n\nMost of the aid given to Ukraine from the European Union was financial aid, which totaled $68 billion, with $53 billion in military spending.\n\nHumanitarian aid from the EU totaled $17 billion during the three year period since the war began.\n\nThe costs of the war on the other side are harder to calculate, but Russia has spent more than $211 billion to fight its war against its neighbor and lost some $10 billion in canceled or paused arms sales, according to statistics compiled by the Pentagon.\n\nIn addition some $300 billion in Russian assets located in foreign bank accounts have been frozen.\n\nDuring Monday’s meeting Macron said Europe would commit peacekeeping troops to help end the conflict. He also attempted to correct Trump, who said most of the EU’s aid to Ukraine has been made as loans rather than grants. Trump insisted that Europe should finance the cost of a peacekeeping force in Ukraine.\n\nHowever, Britain’s The Economist has reported sixty percent of the financial aid doled out by the US has been given to Ukraine in the form of grants, which do not need to be repaid, while 90 percent of financial aid to Ukraine from the EU is in the form of loans with generous repayment schedules.\n\nTrump and Ukrainian president Volodymyr Zelensky have been going back and forth on a deal over valuable rare minerals from Ukraine to help repay the Ukrainian war effort, which was settled on Tuesday, although the exact terms have not been revealed.\n\n“I do not recognize [that Kyiv owes the US] even $100 billion,” Zelensky told reporters at the weekend.\n\n“We agreed with [former President] Biden that this was a grant. A grant is not a debt,” Zelensky said.\n\nZelensky has also said he rejected an earlier version of the deal because he didn’t see enough “security guarantees” offered by the US in exchange for billions in mineral rights.\n\nUS military aid to Ukraine has included more Infantry Fighting Vehicles, Multiple Launch Rocket Systems and Howitzers than any other country.\n\nPoland has donated the most tanks with 354, followed by the Netherlands with 104 then Denmark with 77 followed by the US with 76, according to Kiel institute’s figures.\n\nGermany has donated the most air defense systems with 27, worth $4.8 billion, followed by the US with 17, at an estimated cost of $1.5 billion, according to the researchers.","summary":"Countries around the world have contributed nearly $300 billion to Ukraine over the last three years.","url":"https://nypost.com/2025/02/25/world-news/ukraine-war-has-cost-280-billion-whos-paying-the-most/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-2vyfxlkfw-1740528394770.jpg?quality=75&strip=all&1740510450&w=1200","video":"https://cdn.jwplayer.com/videos/4ah4yO5H-RyIcpnTz.mp4","publish_date":"2025-02-25 23:49:09","author":"Isabel Vincent","authors":["Isabel Vincent"],"language":"en","category":"politics","source_country":"us","sentiment":-0.154}]}