{"offset":0,"number":50,"available":11102,"news":[{"id":359724204,"title":"Trump dubs Russian drones entering Polish airspace 'a mistake' as he fobs off move that landed the West the closest it's been to open conflict since WWII","text":"Donald Trump said incursions by Russian drones into Polish airspace 'could have been a mistake' but stressed that he was 'not happy' by the incident that was condemned by NATO and its allies. \n\nPoland on Wednesday shot down what it said were Russian drones that violated its airspace. \n\nWarsaw was backed by its NATO allies in taking down the devices - the first time a member of the military alliance is known to have fired shots during Russia's war in Ukraine. \n\nRussia said it had not intended to hit any targets in Poland, and that it would make no further comment on the incident, while senior NATO commander said it was not yet known whether the drone incursions were intentional. \n\n'It could have been a mistake, but regardless I'm not happy about anything having to do with that whole situation,' Trump told reporters on Thursday outside the White House. \n\nEuropean leaders expressed alarm on Thursday over Russian hostility threatening their countries after the incursion into NATO-member Poland deepened fears that the three-year war in Ukraine could lead to World War III.\n\nIt comes as US-led efforts to steer Moscow and Kyiv toward a peace settlement have so far failed to gain traction.\n\nEuropean officials described the incursion as a deliberate provocation, forcing the NATO alliance to confront a potential threat in its airspace for the first time and compelling it to think carefully about its military response and capabilities. \n\nTrump's comments also come as British Prime Minister Keir Starmer spoke about the incursion with French President Emmanuel Macron and German Chancellor Friedrich Merz on Thursday.\n\nStarmer said that it was 'clear that Russia was continuing to ramp up its aggression, systematically stepping up its attacks through a campaign of increasingly belligerent actions.' \n\nThe German government said it will 'extend and expand air policing over Poland.'\n\nMeanwhile, the foreign ministers of Ukraine, Poland and Lithuania published a joint statement calling the incursion 'a deliberate and coordinated strike constituting an unprecedented provocation and escalation of tension.' \n\nThe Kremlin said it had nothing to add to a Wednesday statement by Russia's Defense Ministry, which insisted that Russian forces had not targeted Poland and that it was open to discuss the incident with Polish officials.\n\nThe U.N. Security Council scheduled an emergency meeting on the drone incursion for Friday afternoon at Poland's request. \n\nPolish Prime Minister Donald Tusk addressed Polish troops at an air base in the central city of Lask on Thursday, praising the quick response from the troops and NATO allied forces from the Netherlands.\n\nHe pledged to push ahead with a 'great modernisation program' for his country's military.\n\nThe Polish Air Navigation Agency announced that Poland was introducing air traffic restrictions in the eastern part of the country. \n\nIt said the step was taken at the request of the Polish army for national security reasons but did not elaborate.\n\nPoland said some of the drones that entered its airspace Wednesday came from Belarus, where Russian and local troops have begun gathering for war games scheduled to start Friday. \n\nPoland is closing its border with Belarus at midnight, a planned move also associated with the military exercises.","summary":"European leaders expressed alarm on Thursday over Russian hostility threatening their countries after the incursion into NATO-member Poland deepened fears over WWIII.","url":"https://www.dailymail.co.uk/news/article-15090225/Trump-Russian-drones-Polish-airspace-mistake-West-conflict-WWII.html","image":"https://i.dailymail.co.uk/1s/2025/09/11/23/102064313-0-image-a-57_1757631400763.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/10/7492074128082748043/1024x576_MP4_7492074128082748043.mp4","publish_date":"2025-09-12 00:30:39","author":"Editor,Sabrina Penty","authors":["Editor","Sabrina Penty"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.052},{"id":359723894,"title":"Advocates warn LA County-area car wash operators to be ready for more raids, decry ICE tactics","text":"More than 80 immigration raids have been conducted at car washes throughout Southern California in recent weeks, with approximately 250 workers detained, a coalition of carwash workers and their families announced Thursday. Car wash operators had best be ready for more, they added.\n\nOn the heels of the U.S. Supreme Court defending the use of “roving patrols” for such actions by Immigration and Customs Enforcement agents, members of the CLEAN Carwash Worker Center assembled Thursday, Sept. 11, to voice concerns and rally support at the La Cienega Car Wash.\n\nThe West L.A. business, in operation for more than 50 years, has been closed since an immigration raid occurred on the site on Aug. 21. Other frequent targets for increased immigration enforcement, part of President Trump’s have included big-box home-improvement stores such as Home Depot, the bustling MacArthur Park neighborhood in Westlake plus myriad open-air markets.\n\nAnd it’s clear, with this week’s Supreme Court ruling paving the way, there will likely be more such raids in the weeks and months ahead. The court’s 6-3 decision means that ICE can continue the raids and aggressive street sweeps based primarily on perceived race or ethnicity that began in June to comply with President Donald Trump’s mass deportation order. The legal push was set in motion in the weeks following June 18, when a handful of men, including Pedro Vasquez Perdomo, Carlos Alexander Osorto and Isaac Villegas Molina, were detained at a bus stop near Orange Grove Boulevard and Los Robles Avenue in Pasadena.\n\nTrump campaigned on a promise to deport millions of immigrants working in the U.S. illegally. He has said he is focusing deportation efforts on “dangerous criminals,” but most people detained by ICE have no criminal convictions, according to government documentation. At the same time, the number of illegal border crossings has plunged under his policies.\n\nIn anticipation of more such actions, CLEAN leaders presented a preparedness checklist for car wash operators, including keeping emergency contact information for all workers stored in a safe place, modes of alerting workers about a raid, such as sirens or whistles, and creating an advance plan if a raid were to happen.\n\nTrump and his administration have long argued that the nation is witnessing an “invasion” of immigrants, with particular ire toward the Biden administration, which reversed many of the tough immigration policies of Trump’s first term.\n\nCLEAN members and others who gathered at Thursday, however, said that the raids are breaking up families, creating health risks for many working people and unfairly detaining many more people without criminal records.\n\n“I was detained at a car wash in Torrance, California, on June 22, 2025,” said a man who identified himself as Hans, speaking in Spanish via an interpreter.\n\n“I did my best to endure many things, like inhumane conditions, when I was detained for over two months in (ICE processing center in) Adelanto,” he said. “It’s very easy to fall into depression under those conditions, but I knew I had to endure.”\n\n“There are many car wash workers who are detained, who were taken, like me, for going out to earn a living,” he said. “We go out to work out of necessity and we have to face this very difficult situation.”\n\nMariana Lemus of Ontario is distraught over her aunt being held while she struggles with poor health.\n\n“Basically she’s fighting cancer and diabetes,” she said. “They didn’t allow her to get her medications at all. Right now, she’s currently having some health issues and we’re just trying to get her out as fast as possible.”\n\n“For 18 years we have organized alongside carwash workers to fight exploitation, to build leadership and create worker power,” said Flor Melendrez, executive director of CLEAN.\n\n“The car wash industry is built on the hard labor of immigrant workers,” she said. “For decades, car wash workers have endured long hours, low wages, unsafe conditions and exploitation, but despite those challenges, they have built families, they have built community.”\n\nAs part of their efforts, CLEAN is encouraging interested community members to get trained and connect with local businesses, to help aid workers before and during raids.\n\nThe Department of Homeland Security said earlier this month that more than 5,000 immigration arrests have been made since June 6.\n\nICE and Border Patrol officials dismiss allegations of profiling. In a recent interview with the Associated Press, Gregory Bovino, chief patrol agent of the U.S. Border Patrol’s El Centro Sector, said he identifies targets based on intelligence, and he defended the optional use of masks for agents who fear that being identified may jeopardize their personal safety.\n\n“The officers are instructed to find reasonable suspicion before an arrest,” U.S. Department of Justice Attorney Jacob Roth testified in oral arguments in front of the 9th Circuit court in August.\n\nPablo Alvarado, co-executive director of the National Day Laborer Organizing Network, said immigrants need to continue to stand strong amid intensified immigration enforcement. “We’ve got to stand up with our community, so that we can fight back together,” he said.\n\nAlvarado said that public concern is growing.\n\n“Public opinion is shifting around immigration,” he said, “and the reason why it’s shifting is not because the political opposition is fighting back, it’s because decent Americans — people with consciences — are actually documenting the cruelty, the civil and human rights violations taking place.”\n\n“We’re showing the country its ugly side,” he said.\n\n“We want to believe that most Americans disagree with what is happening,” Alvarado said. “Most Americans don’t like to see men in masks with big guns, like they were going to a conventional war, in armored vehicles, coming into our neighborhoods.”\n\n Jarret Liotta is a Los Angeles-based writer and photographer.\n\nStaff writer Madeline Armstrong and the Associated Press contributed to this report.","summary":"On the heels of the U.S. Supreme Court defending the use of \"roving patrols\" for such actions by Immigration and Customs Enforcement agents, members of the CLEAN Carwash Worker Center assembled Thursday, Sept. 11, to voice concerns and rally support at the La Cienega Car Wash.","url":"https://www.ocregister.com/2025/09/11/advocates-warn-la-county-area-car-wash-operators-to-be-ready-for-more-raids-decry-ice-tactics/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/LDN-L-CAR-WASH-0911-03.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-12 00:25:50","author":"Gqlshare,Jarret Liotta","authors":["Gqlshare","Jarret Liotta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":359722716,"title":"Appeals court allows Trump's administration to block Medicaid funds to Planned Parenthood","text":"BOSTON -- A U.S. appeals court panel on Thursday allowed President Donald Trump's administration to block Medicaid funds to Planned Parenthood while legal challenges continue.\n\nA federal judge in July ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation's largest abortion provider fights Trump's administration over efforts to defund the organization in his signature tax legislation.\n\nMedicaid is a government health care program that serves millions of low-income and disabled Americans. Nearly half of Planned Parenthood's patients rely on Medicaid.\n\nA provision in Trump's tax bill instructed the federal government to end Medicaid payments for one year to abortion providers that received more than $800,000 from Medicaid in 2023, even to those like Planned Parenthood that also offer medical services like contraception, pregnancy tests and STD testing.\n\nPlanned Parenthood Federation of America and its member organizations in Massachusetts and Utah filed a lawsuit in July against Health and Human Services Secretary Robert F. Kennedy Jr.\n\n\"While the Trump administration wants to rip away reproductive freedom, we're here to say loud and clear: we will not back down,\" Dominique Lee, President and CEO of Planned Parenthood League of Massachusetts said in a statement. \"This is not over.\"\n\nThe U.S. Department of Health and Human Services didn't immediately respond to an online request for comment.\n\nPlanned Parenthood said Thursday's ruling means that more than 1.1 million patients can't use their Medicaid insurance at its health centers. That also puts as many as 200 of those health centers at risk of closure, Planned Parenthood said in a statement.\n\nPlanned Parenthood says it is the nation's leading provider and advocate of affordable sexual and reproductive health care, as well as the nation's largest provider of sex education.\n\nThe video in the player above is from an earlier report.","summary":"A U.S. appeals court panel on Thursday allowed President Donald Trump's administration to block Medicaid funds to Planned Parenthood while legal challenges continue.","url":"https://abc7.com/post/appeals-court-allows-president-donald-trumps-administration-block-medicaid-funds-planned-parenthood/17796899/","image":"https://cdn.abcotvs.com/dip/images/17796914_AP25254841857230.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/062625-wls-ravi-scotus-planned-p-4p-vid.mp4","publish_date":"2025-09-12 00:19:51","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.35},{"id":359725022,"title":"UNSC disokong AS, kutuk serangan ke atas Qatar","text":"NEW YORK: Majlis Keselamatan Pertubuhan Bangsa-Bangsa Bersatu (UNSC) semalam mengutuk serangan udara ke atas ibu negara Qatar, Doha.\n\nKetetapan itu dibuat dalam satu kenyataan sebulat suara oleh kesemua 15 negara anggota, termasuk Amerika Syarikat (AS) iaitu sekutu rapat Israel.\n\nKenyataan itu bagaimanapun tidak menyebut nama Israel, yang dipercayai melancarkan serangan pada Selasa lalu, dalam usaha membunuh pemimpin politik Hamas. \n\nSerangan itu mencetuskan kebimbangan berikutan peningkatan tindakan ketenteraan yang disifatkan AS adalah tindakan sebelah pihak serta tidak selari dengan kepentingan bersama antara Washington dan Tel Aviv.\n\nDuta Israel ke PBB, Danny Danon, berkata serangan itu membawa mesej tiada tempat selamat untuk pengganas, tidak kira di Gaza, Tehran atau Doha. \n\n\"Kami akan bertindak terhadap pemimpin keganasan, di mana saja mereka bersembunyi,\" katanya.\n\nAS secara tradisi melindungi sekutunya, Israel, di Pertubuhan Bangsa-Bangsa Bersatu (PBB). \n\nNamun, sokongan Washington terhadap kenyataan UNSC kali ini, yang hanya boleh diluluskan menerusi konsensus, mencerminkan ketidakpuasan hati Presiden AS, Donald Trump, terhadap serangan yang diarahkan oleh Perdana Menteri Israel, Benjamin Netanyahu.\n\nMenurut kenyataan yang dirangka oleh Britain dan Perancis, anggota UNSC menekankan kepentingan untuk meredakan ketegangan dan menyatakan solidariti mereka bersama Qatar selain turut menyuarakan sokongan terhadap kedaulatan dan integriti wilayah Qatar.\n\nSelain itu, anggota Majlis juga menegaskan pembebasan tebusan termasuk yang dibunuh oleh Hamas, dengan penamatan perang dan penderitaan di Gaza turut menjadi keutamaan mereka.\n\nOperasi di Doha itu menerima kecaman meluas, lebih-lebih lagi kerana Qatar sedang menjadi tuan rumah dan pengantara rundingan bagi mencapai gencatan senjata dalam konflik Gaza.\n\nSementara itu, Perdana Menteri Qatar, Sheikh Mohammed Abdulrahman al-Thani, menuduh Israel cuba menggagalkan usaha menamatkan perang di Gaza dengan menyerang pemimpin Hamas di Doha, namun berikrar untuk meneruskan usahanya sebagai pengantara.\n\n\"Menyerang wilayah kami ketika sedang giat berunding mendedahkan niat sebenar Israel untuk menafikan sebarang peluang keamanan dan mahu meneruskan penderitaan rakyat Palestin.\n\n\"Ia juga membuktikan bahawa golongan pelampau yang memerintah Israel hari ini tidak peduli mengenai nasib tebusan kerana ia bukan keutamaan mereka,\" katanya kepada UNSC. – REUTERS","summary":"NEW YORK: Majlis Keselamatan Pertubuhan Bangsa-Bangsa Bersatu (UNSC) semalam mengutuk serangan udara ke atas ibu negara Qatar, Doha.","url":"https://www.bharian.com.my/dunia/amerika/2025/09/1445188/unsc-disokong-kutuk-serangan-ke-atas-qatar","image":"https://assets.bharian.com.my/images/articles/bh12una-o_BHfield_image_listing_featured.var_1757636272.jpg","video":null,"publish_date":"2025-09-12 00:17:58","author":null,"language":"en","source_country":"my","sentiment":0.962},{"id":359721954,"title":"India News | Delhi Riots Larger Conspiracy Case: Umar Khalid Alleges Bias Against Him, Calls FIR Joke","text":"New Delhi [India], September 12 (ANI): Delhi Karkardooma Court on Thursday heard the arguements on the charge on behalf of Umar Khalid, former JNU Student leader, now accused in the larger conspiracy of the Delhi riots case 2020. During the arguements, his counsel alleged bias against Umar Khalid and called the UAPA FIR a joke.\nUmar Khalid is an accused alongwith Sharjeel Imam, Tahir Hussain and 15 other accused booked under the Unlawful Activities (Prevention) Act for alleged conspiracy of the Delhi riots 2020, which claimed 53 lives. Khalid was arrested on September 13, 2020. Also Read | Donald Trump's Pick for US Ambassador to India, Sergio Gor, Reveals Delhi Invitation to Washington Next Week As Trade Deal Nears Completion.\nAdditional Sessions Judge (ASJ) Sameer Bajpai heard the arguements advanced by senior advocate Tridip Pias, counsel for Umar Khalid. After hearing the arguements, the matter was listed for September 17.\nSenior advocate Pais submitted that there is apparent bias on the part of the probe agency against Umar Khalid. False documents were prepared after his arrest. Also Read | Alliance in West Bengal Will Be Decided by State Unit, Final Call With High Command: Congress MP KC Venugopal.\nIt was also submitted that the present FIR has been lodged under UAPA, allegedly dealing with the deaths during riots in North East Delhi. These deaths are the subject matter of other FIR registered for riots case. It was further argued that while discharging or acquitting the accused in other riot cases, the court made several observations in favour of them. In the case of Umar Khalid, there is apparent bias.\nThe counsel also submitted that Umar Khalid has been in custody for more than five years for the alleged Conspiracy of riots, and he was not present in Delhi on the day of the riots.\nOn September 2, the Delhi High Court dismissed the bail pleas of 10 accused, alongwith Sharjeel Imam and Umar Khalid. The High Court had said that the role of Sharjeel Imam and Umar Khalid in the conspiracy is prima facie grave in view of the allegations against them. Delhi Police have alleged that they delivered inflammatory speeches on communal lines to instigate a mass mobilisation of members of the Muslim Community.\n\"In the conspectus of the allegations levelled, it emerges that the role of Sharjeel Imam and Umar Khalid is prima facie grave in the entire conspiracy, having delivered inflammatory speeches on communal lines to instigate a mass mobilisation of members of the Muslim Community,\" the High Court had said in the judgement.\nWhile opposing the bail pleas, SG Tushar Mehta had argued that each of the conspirators had played a vital role in the planning, strategising, and execution of the criminal conspiracy, all under the guise of protest against the CAA/NRC. \"The masterminds/top conspirators disseminated their messages through various speeches, pamphlets, WhatsApp Groups, etc., and their instructions were carried out by the foot soldiers,\" SG Mehta argued.\nHe also contended that keeping in view the large-scale violence that was sought to be undertaken, and which eventually took place in late February 2020, resulting in the loss of 53 lives, causing injuries to numerous members of the public, Police Officers and causing damage to public properties, the Appellants are not entitled to bail. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Delhi Karkardooma Court on Thursday heard the arguements on the charge on behalf of Umar Khalid, former JNU Student leader, now accused in the larger conspiracy of the Delhi riots case 2020. During the arguements, his counsel alleged bias against Umar Khalid and called the UAPA FIR a joke.","url":"https://www.latestly.com/agency-news/india-news-delhi-riots-larger-conspiracy-case-umar-khalid-alleges-bias-against-him-calls-fir-joke-7106561.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250911200751.jpeg","video":null,"publish_date":"2025-09-12 00:16:29","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.478},{"id":359722948,"title":"‘Desensitised’ UFC champion Sean Strickland ‘was excited to see video’ of Charlie Kirk murder","text":"Former UFC champion Sean Strickland has admitted he “was excited” to see a video of Charlie Kirk’s murder, also asking: “How did I become such a sociopath?”\n\nStrickland, who held the UFC middleweight title from September 2023 until January 2024, is among the most controversial fighters in mixed martial arts’ (MMA) flagship promotion.\n\nThe American, 34, previously admitted he wanted to kill an opponent in the cage one day, while he has also been dismissive of women’s MMA, and was the subject of media furore in Australia when he criticised the country’s gun laws before fighting there.\n\nNow, in a video on his Instagram story, Strickland has reacted to the murder of Kirk – a right-wing political activist and ally of US president Donald Trump – who was shot dead at a Utah college campus on Wednesday (11 September).\n\n“I’m on Twitter [X], and somebody says: ‘Hey, did you hear that Charlie Kirk got shot?’” Strickland said. “And my gut reaction was like: ‘No, I f***ing didn’t, but I’m excited.’ Like, I felt this little dopamine spike in me, where I’m like: ‘Dude, I want to see the video.’\n\n“Then I see the video. Real bad, real bad, but I’m still kind of excited from it. Like, ‘Oh, s***,’ like I can feel my muscles tensing. And then I start thinking: ‘Man, well, what’s gonna come from this? Was the shooter black? Was it a liberal? Am I gonna get more fun? Am I gonna get more violence? Let’s burn this motherf***** down! I need some excitement!’\n\n“And then you start thinking, man, like: ‘How the f*** did I become such a sociopath? Like, how am I so [detached] from human beings. When people walk down the street, I don’t even see people; I just see potential threats and problems.\n\n“Then I think about the last news cycle. We watched a girl get stabbed, murdered on the subway. We’re watching little kids get pulled out of buildings, because maybe somebody launched a rocket [at] it; I don’t know why. We are so desensitised and we’re such sociopaths, it’s kinda sad.”\n\nStrickland seemed to be referring to the stabbing of Iryna Zarutska, a Ukrainian woman who was killed in an attack in Charlotte last month.\n\n“I just watched a man get murdered and found it exciting,” Strickland continued. “I have to ask myself: ‘How did we become a generation of sociopaths? [...] It’s just sad and frustrating.”\n\nStrickland also accused the United States of being overcome by consumerism, saying: “Slowly they just manipulated us to be sociopathic consumers, and the only thing we want is stuff and things, stuff and things. \n\n“It’s just so sad [...] It’s taken the soul from us, they took God from us, they’ve taken everything from us. And we’re just mindless, sociopathic consumers. I don’t know how to fix it.”","summary":"Strickland, who held the UFC middleweight title from 2023 until 2024, previously said he wanted to kill an opponent in the cage","url":"https://www.independent.co.uk/sport/ufc/sean-strickland-charlie-kirk-shooting-video-b2825080.html","image":"https://static.independent.co.uk/2025/02/06/14/14/GettyImages-1940927212.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/10mW6cGJ-4VHSaSK0.mp4","publish_date":"2025-09-12 00:15:38","author":"Alex Pattle","authors":["Alex Pattle"],"language":"en","source_country":"gb","sentiment":-0.607},{"id":359726402,"title":"Watch: Donald Trump booed at Yankee stadium in New York; echoes of US Open jeers","text":"US president Donald Trump, on Thursday was booed at Yankee Stadium during a game held to commemorate the September 11th attacks.Videos later shared online showed both cheering and booing as the president took his seat at the game. When the national anthem played and Trump appeared on the stadium jumbotron, sections of the crowd booed while others cheered.This comes just a week after Trump was met with boos on Sunday at the US Open men’s final in New York, where his arrival caused long security delays for spectators. Earlier in the day, Trump spoke at the Pentagon as part of the 9/11 remembrance events, where he also addressed the killing of conservative activist Charlie Kirk, a figure well-connected to his circle including vice president JD Vance and Donald Trump Jr.","summary":"","url":"https://timesofindia.indiatimes.com/world/us/watch-donald-trump-booed-at-yankee-stadium-in-new-york-echoes-of-us-open-jeers/articleshow/123840601.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123840644/123840644.jpg","video":null,"publish_date":"2025-09-12 00:12:56","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.176},{"id":359723462,"title":"Trump Says ‘Big Progress’ Made as Manhunt for Charlie Kirk’s Killer Continues","text":"WASHINGTON—President Donald Trump on Sept. 11 said law enforcement had made “big progress” in the search for conservative commentator Charlie Kirk’s assassin, as the manhunt entered its second day. Federal authorities released images of the suspected gunman and urged the public’s help in identifying the individual.\n\nKirk was shot and killed on Sept. 10 at the age of 31 while speaking to a crowd of students at Utah Valley University in Orem, Utah.","summary":"The president said he had 'an indication' of the killer’s motive but added that details would be shared later.","url":"https://www.theepochtimes.com/us/trump-says-big-progress-made-as-manhunt-for-charlie-kirks-killer-continues-5913934","image":"https://img.theepochtimes.com/assets/uploads/2025/09/11/id5913906-09112025-DSC03642-donald-trump-300x180.jpg","video":null,"publish_date":"2025-09-12 00:11:11","author":"Emel Akan","authors":["Emel Akan"],"language":"en","source_country":"us","sentiment":-0.426},{"id":359723868,"title":"Trump mocked by famous Yankee Stadium sound effect after being shown on Jumbotron","text":"President Donald Trump returned to his hometown of New York City on Thursday to participate in ceremonies commemorating the 24th anniversary of the September 11, 2001 attack on the World Trade Center. This also included a visit to Yankee stadium to watch the New York Yankees play against the Detroit Tigers.\n\nThe crowd responded to Trump on two different occasions. As he was being seated in a VIP box (surrounded by bulletproof glass), fans can be heard booing the president while he made his initial entrance.\n\n\"Quite a few Bronx cheers and boos, as President Trump arrives to his box at Yankee Stadium,\" Washington Post White House bureau chief Matt Viser tweeted.\n\nREAD MORE: House Republican demands Trump tone down 'ridiculous rhetoric' after Charlie Kirk shooting\n\nHowever, Trump's presence also appeared to prompt a reaction from the stadium's sound engineer. During the second inning, Yankee Stadium's announcer can be heard introducing Trump to the crowd as the \"45th and 47th president of the United States on the solemn anniversary of September 11, 2001.\" At that point, a loud whistle is heard echoing throughout the stadium.\n\nThat sound effect is known as the \"P.C. Richard Whistle,\" which is typically played after a batter on the visiting team strikes out. It can also be heard in several other videos showing Trump at Yankee Stadium.\n\n\"Donald Trump introduced to the crowd at Yankee Stadium in the middle of the second inning and whoever is in charge of sound effects played the PC Richard whistle, which is what is traditionally played after a strikeout,\" one X user posted. \"This person should and will be fired.\"\n\nREAD MORE: 'Massively ignorant': why this MAGA candidate is getting threats from Trump supporters","summary":"President Donald Trump returned to his hometown of New York City on Thursday to participate in ceremonies commemorating the 24th anniversary of the September 11, 2001 attack on the World Trade Center. This also included a visit to Yankee stadium to watch the New York Yankees play against the Detroit Tigers.\n\nThe crowd responded to Trump on two different occasions. As he was being seated in a VIP box (surrounded by bulletproof glass), fans can be heard booing the president while he made his initial entrance.\n\n\"Quite a few Bronx cheers and boos, as President Trump arrives to his box at Yankee Stadium,\" Washington Post White House bureau chief Matt Viser tweeted.\n\nREAD MORE: House Republican demands Trump tone down 'ridiculous rhetoric' after Charlie Kirk shooting\n\nHowever, Trump's presence also appeared to prompt a reaction from the stadium's sound engineer. During the second inning, Yankee Stadium's announcer can be heard introducing Trump to the crowd as the \"45th and 47th president of the United States on th","url":"https://www.alternet.org/trump-yankee-stadium/","image":"https://www.alternet.org/media-library/image.jpg?id=61593274&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-09-12 00:10:48","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"US","sentiment":0.195},{"id":359720600,"title":"Moment Joe Rogan finds out Charlie Kirk had died","text":"The podcaster and his guest had just returned from a break, two-and-a-half hours into the episode, when Rogan addressed the breaking news of the fatal shooting of the Turning Point USA founder at a college in Utah at around midday on Wednesday, local time.\n\nSheen, 60, appeared on the episode released on Thursday to promote his new memoir, The Book of Sheen.\n\n“Should we bring this up? I guess we have to,” Rogan said, clutching his head.\n\n“So this has just happened. We just found out that Charlie Kirk got shot.”\n\n“That’s f**king awful,” Sheen said.\n\n“And … is he dead?” Rogan asked his producer Jamie Vernon. “One of the guys out there just said it was confirmed that he was dead.”\n\n“Murdered for having a different opinion from somebody else,” Sheen said. “Different ideology from somebody else … beliefs that didn’t align.”\n\n“Yeah. Yeah,” Rogan said, at a loss for words. “I mean … I don’t know who did it or …”\n\nVernon then confirmed news reports that Kirk had died.\n\n“Rest in peace. F**k,” Sheen said. “He didn’t deserve that. Nobody deserves that.”\n\n“F**k,” Rogan said.\n\n“There’s going to be a lot of people celebrating this. It’s so scary. It’s so dangerous too, to celebrate or to in any way encourage this kind of behaviour from human beings. He’s not a violent guy, he’s talking to people on college campuses. He wasn’t even particularly rude. He tried to be pretty reasonable with people.”\n\n“Everything I saw seemed reasonable,” Sheen said.\n\n“He’s a very intelligent guy whether you agree with him or don’t,” Rogan said. “And there’s a lot of stuff I didn’t agree with him on, that’s fine. You’re allowed to disagree with people without celebrating the fact that he got shot.”\n\n“Sure, but you can’t disrespect his passion,” Sheen said.\n\n“What you’re supposed to do with a guy like that if you’re opposing him is debate him, have a conversation where your argument is more compelling than his,” Rogan said. “That’s what people should be celebrating, discourse, we used to do that.”\n\n“Do some homework and bring it to the table,” Sheen agreed.\n\n“This is horrible, but I know people are going to celebrate it because this is a f**ked up time,” Rogan said. “People have really fallen into this trap of us against them.”\n\n“But it’s also going to make people not want to be as courageous and as forthright with the things they believe,” Sheen said.\n\nThe Two and a Half Men star said it was the kind of incident that was always “in the back of our minds” as celebrities during public appearances.\n\n“Right now it doesn’t seem real,” Rogan said. “It seem so crazy … it’s not registering.”\n\nRogan said he had met Kirk once at a gun range. “He was a nice guy,” he said. \n\n“This is a f**ked up time, people are so divided in this country. There’s so many people that love it, that profit off that division. It’s so gross. One of the most horrific things you could do after someone dies horribly like this is celebrate. It should be a wake-up call for everybody. This is nuts.”\n\n“It’s a dark day,” Sheen said.\n\n“One of two things is going to happen — either people are going to realise how f**king insane this is and we have to have a conversation about being able to have conversations, or it’s going to get a lot worse,” Rogan said. “That’s what’s scary.”\n\nKirk, 31, was shot in the neck with a single bullet from a high-powered rifle about 150 metres away while speaking to a large crowd at an event at Utah Valley University.\n\nHe was rushed to hospital but died a short time later.\n\nA massive manhunt for the shooter is still underway.\n\nOn Thursday, the FBI released the first images of the “college-age” suspect, as they revealed that the rifle used to kill Kirk had been recovered.\n\nThe images of the alleged shooter show a man wearing a baseball cap, dark sunglasses and a black long-sleeve shirt with an image on it.\n\nIn one of the pictures, he appears to be walking up a stairwell.\n\nFBI Salt Lake City special agent in charge Robert Bohles earlier said authorities had “recovered what we believe is the weapon in yesterday’s shooting, a high-powered bolt action rifle”.\n\nMr Bohles said the firearm was found in a wooded area where the assassin had fled.\n\nAmmunition engraved with expressions of transgender and anti-fascist ideology has been found inside the rifle, according to an internal law-enforcement bulletin and a person familiar with the investigation, as cited by The Wall Street Journal.\n\nUS President Donald Trump said on Thursday authorities were “making big progress” in their investigation into Charlie Kirk’s assassination.\n\n“I hear they’re making big progress, and we’ll have to see what happens,” he told reporters at the White House as he departed for New York, without providing further detail.\n\nMr Trump added that the shooter was “an animal, a total animal”.\n\n“Hopefully they’ll have him,” he said.\n\nAsked if he had any thoughts on the shooter’s motivation, Mr Trump said, “I have an indication, yeah, but we’ll let you know about that later.”\n\nHe said he was “not really” concerned about his safety following the shooting.\n\n“I’m really concerned for our country,” he said. “We have a great country. We have a radical left group of lunatics out there, just absolute lunatics, and we’re going to get that problem solved. I’m only concerned for the country.”\n\nMr Trump also told reporters he spoke with Kirk’s widow Erika.\n\n“She’s devastated. She’s absolutely devastated, as you can imagine,” he said.\n\nKirk, who founded the conservative campus organisation in 2012 and rose to become one of the most influential political figures in the country, leaves behind a three-year-old daughter and one-year-old son.","summary":"Podcast host Joe Rogan was recording an interview with actor Charlie Sheen when he received news that conservative activist Charlie Kirk had been shot.","url":"https://www.news.com.au/entertainment/moment-joe-rogan-finds-out-charlie-kirk-had-died/news-story/4db030cf9ac90111840df8665d2765ef?from=rss-basic","image":"https://content.api.news/v3/images/bin/243bdc4132b7826f797657336633467f","video":null,"publish_date":"2025-09-12 00:09:15","author":"Frank Chung","authors":["Frank Chung"],"language":"en","source_country":"au","sentiment":-0.404},{"id":359723658,"title":"Former Brazilian President Bolsonaro sentenced to over 27 years in prison for coup attempt","text":"Bolsonaro is the first former Brazilian president to be convicted of attempting a coup.\n\nPresident Donald Trump said it was “very surprising” that Bolsonaro was convicted of the coup.\n\n“I watched that trial. I know him pretty well — foreign leader. I thought he was a good president of Brazil. And it’s very surprising that that could happen,” Trump told reporters at the White House. “That’s very much like they tried to do with me, but they didn’t get away with it at all. But I can always say this: I knew him as president of Brazil. He was a good man, and I don’t see that happening.”\n\nThe judges ruled that Bolsonaro and other figures “implemented a progressive and systematic plan to attack democratic institutions, with the aim of harming the legitimate alternation of power in the 2022 elections.”\n\nSecretary of State Marco Rubio called Bolsonaro’s prosecution a “witch hunt.”\n\n“The political persecutions by sanctioned human rights abuser Alexandre de Moraes continue, as he and others on Brazil’s supreme court have unjustly ruled to imprison former President Jair Bolsonaro. The United States will respond accordingly to this witch hunt,” he said.\n\nBolsonaro has been banned from running for political office until 2030 and is expected to pick a political heir to challenge President Lula Da Silva.\n\nHis oldest son, Sen. Falvio Bolsonaro, has called the prosecution of Bolsonaro “SUPREME PERSECUTION” and added that they want to kill him.\n\nDEMOCRATS MUM ON GUN CONTROL BUT CONDEMN POLITICAL VIOLENCE AFTER CHARLIE KIRK ASSASSINATION\n\nThe charges against Bolsonaro carry sentences that could land him decades in prison.\n\nHe is expected to appeal the ruling within five days of it being published by the court, which could be up to 60 days from now.","summary":"Former Brazilian President Jair Bolsonaro has been sentenced to 27 years and three months in prison for his alleged 2022 coup attempt following the country&#8217;s presidential election. A panel of Brazilian Supreme Court justices handed down Bolsonaro&#8217;s sentence after convicting him of the attempted coup. Four of the five justices found Bolsonaro guilty on five [&#8230;]","url":"https://www.washingtonexaminer.com/news/world/3804547/brazil-jair-bolsonaro-sentenced-coup-attempt/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/jair-bolsonaro.jpg?w=696","video":null,"publish_date":"2025-09-12 00:08:31","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.386},{"id":359726404,"title":"Jair Bolsonaro sentenced to 27 years: Brazil's Supreme Court convicts ex-president for coup attempt; US slams 'witch hunt'","text":"Former Brazilian President Jair Bolsonaro was sentenced to 27 years and three months in prison on Thursday after the country’s Supreme Court convicted him of attempting a coup to remain in power following his 2022 electoral defeat to President Luiz Inacio Lula da Silva.The unprecedented ruling handed down by a panel of five justices, four of whom voted to convict, makes Bolsonaro the first former Brazilian leader found guilty of trying to overturn a democratic election. He was convicted on five counts, including plotting to abolish the rule of law, belonging to an armed criminal organisation, and inciting violence.Bolsonaro, who has consistently denied wrongdoing, remains under house arrest in Brasilia. He can still appeal the decision. The court now has 60 days to publish the ruling, after which his lawyers will have five days to file motions for clarification. Legal experts say such appeals rarely change outcomes.US condemns decision, warns of responseThe ruling immediately sparked international backlash, most notably from Washington. US President Donald Trump said he was “very unhappy” with the conviction, calling Bolsonaro “outstanding.”Secretary of state Marco Rubio denounced the ruling as a “witch hunt” in a post on X, vowing the Trump administration would “respond accordingly.” The United States had already slapped a 50 per cent tariff on Brazilian goods earlier this year, citing the case against Bolsonaro — a move analysts say foreshadowed further sanctions.Divided Brazil, inflamed politicsIn Brazil, the trial has inflamed political tensions. Supporters of the far-right leader have taken to the streets, claiming the case is political persecution. His eldest son, Sen. Flávio Bolsonaro, called the verdict a “supreme persecution,” insisting history would vindicate his father.Justice Cármen Lúcia, siding with the majority, said she was persuaded by evidence from the Attorney General’s Office. “He is the instigator, the leader of an organisation that orchestrated every possible move to maintain or seize power,” she said. Justice Alexandre de Moraes, who oversaw the case, branded Bolsonaro the head of a criminal coup plot.President Lula said Thursday that “hundreds of pieces of evidence” showed Bolsonaro attempted a coup against Brazil’s democracy.Bolsonaro’s futureBolsonaro is already barred from running for office until 2030 in a separate case, but he remains an influential figure in Brazilian politics. Observers expect him to back a political heir to challenge Lula in the next election.Despite Thursday’s ruling, Bolsonaro will not immediately go to prison. But with appeals unlikely to succeed and diplomatic tensions rising, Brazil now faces a volatile period of political and international fallout.","summary":"Jair Bolsonaro, the former president of Brazil, has been sentenced to 27 years and three months in prison after being convicted by the Supreme Court for attempting a coup following his 2022 electoral defeat. The unprecedented ruling has sparked international backlash, particularly from the US, while inflaming political tensions within Brazil, with supporters claiming political persecution. Despite the ruling, Bolsonaro remains an influential figure.","url":"https://timesofindia.indiatimes.com/world/rest-of-world/jair-bolsonaro-sentenced-to-27-years-brazils-supreme-court-convicts-ex-president-for-coup-attempt-us-slams-witch-hunt/articleshow/123840635.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123840638/123840638.jpg","video":null,"publish_date":"2025-09-12 00:06:57","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.294},{"id":359726810,"title":"Even as they condemn it, the left gaslights us about Charlie Kirk’s death","text":"Charlie Kirk and I had a lot we didn’t agree on, but he used to bring me on his show.\n\nUnlike his leftist haters, the man who was martyred this week in Utah for spreading his conservative beliefs with vigor and love wasn’t afraid to engage with views that contradicted his own.\n\nThe opposite: He sought them out.\n\nIn an age of podcasters ensconced in the safety of their home studios, Charlie Kirk met young people where they were, on college campuses, and invited them to debate.\n\nThis is how you fight polarization.\n\nThis is how you fight violence.\n\nThis is what it means to be an American — to crave the voices of those you disagree with, and the rush of trying to convince them.\n\nAnd it is this that led to his murder.\n\nA culture on the Left, opposed to honest, spirited debate, has demonized the views of the other side as “hateful,” as fascism, as Nazism.\n\nWhen you call your political opponents Hitler enough times, you’ve signed their death warrant. \n\nWho wouldn’t kill Hitler if given the chance?\n\nYet even in their condemnations of Kirk’s murder, Democrats are doubling down on the rhetoric that led to it.\n\n“The scourge of gun violence and political violence must end. The shooting of Charlie Kirk is the latest incident of this chaos and it must stop. We cannot go down this road,” tweeted Rep. Alexandria Ocasio-Cortez.\n\n“This kind of despicable violence has no place in our democracy,” former President Barack Obama posted, language echoed almost word-for-word by Sen. Bernie Sanders and Zohran Mamdani.\n\nNote the both-sidesing.\n\nNote the passive voice. \n\nEven in their denunciations, the left is gaslighting us about the truth: The vast majority of the political violence in this country is coming from their side.\n\nAnd they are unwilling to take an ounce of responsibility for it.\n\nThey can’t — because there’s nothing in their philosophy to explain why the cold-blooded murder of Charlie Kirk is wrong.\n\nThey view the world not through the Judeo-Christian lens of right versus wrong, but through the lens of power.\n\nIn their view, people with less power have no moral responsibilities.\n\nMoreover, they claim language is violence, and believing things counter to leftist orthodoxy is a form of violence, too.\n\nAnd they believe that when victims, as they see themselves, are threatened by such “violence,” physical violence is a righteous response.\n\nIt’s doubly ironic that the left’s own language these days is replete with fighting words.\n\n“Our only chance to save our democracy is to fight fire with fire,” Connecticut Sen. Chris Murphy said earlier this week. “We’re in a war right now to save this country, so you have to be willing to do whatever is necessary to save the country.”\n\n“We’re gonna punch these sons of bitches in the mouth,” Gov. Gavin Newsom vowed last month.\n\nYet in the wake of Charlie’s murder, Democrat after Democrat is decrying political violence “on both sides.”\n\nThey have the absolute chutzpah to bemoan the dangers of Donald Trump and his supporters before Charlie’s body is even buried.\n\nIt’s not just projection; it’s an inversion of victim and perpetrator.\n\nThey called for war, and when someone heeded them and picked up a gun to murder a conservative icon, they cast themselves as the victims.\n\nHere’s the truth, leftists: The violence is coming from inside your house.\n\nIt’s the result of decades of demonizing right-wing voices with legitimate views — views in fact shared by most Americans.\n\nAnd when censorship and deplatforming and cancel culture failed to silence those voices, the left’s fanatics picked up guns.\n\nI want the country to come together. I want us to unify against the scourge of political violence.\n\nBut we can’t do that while the left is lying to our faces.\n\nThis only stops when they take responsibility for their actions.\n\nWhen they confess that their rhetoric has led to the murder of innocents.\n\nIt starts when they admit it was wrong to paint political differences as evil hatreds, and commit now, in Charlie’s memory, to return to the values of civil debate.\n\nLet Obama admit that even if he disagrees, it is legitimate to vote for Donald Trump — that it doesn’t make you a Nazi or a fascist.\n\nLet AOC admit that even if she disagrees, it is legitimate to believe there are only two genders — that it’s not hateful or bigoted, but what most Americans believe.\n\nLet Murphy admit that even if he disagrees, it is legitimate to believe that life begins at conception — that it doesn’t make you a misogynist who wants women to die.\n\nThen we can truly turn down the temperature, honor Charlie’s legacy — and unite.\n\nBatya Ungar-Sargon is the author of “Second Class: How the Elites Betrayed America’s Working Men and Women” and hosts “Batya” on NewsNation.","summary":"Even in their denunciations of Charlie Kirk's murder, the left is gaslighting us: The vast majority of the political violence in this country is coming from their side.","url":"https://nypost.com/2025/09/11/opinion/even-as-they-condemn-it-the-left-gaslights-us-on-charlie-kirks-death/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/charlie-kirk-speaks-shot-turning-111105302_7c102b.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-09-12 00:06:47","author":"Batya Ungar-Sargon","authors":["Batya Ungar-Sargon"],"language":"en","source_country":"us","sentiment":-0.411},{"id":359722188,"title":"Donald Trump labels Anthony Albanese a ‘good man’ after phone call","text":"Donald Trump has labelled Anthony Albanese a “good man” when asked about the Australian Prime Minister following a call between the pair.\n\nThe two leaders spoke on the phone late last week, their fourth conversation, but are yet to lock in a new date for a face-to-face meeting.\n\nThe President was asked about that phone call as he got onto his helicopter to depart the White House overnight.\n\n“He’s a good man,” he said in reply.\n\nThe Australian side said after the call that Mr Albanese and Mr Trump had discussed economic cooperation, trade, critical minerals and the importance of shared security interests.\n\nMr Albanese is seeking to line up a meeting with the President when he travels to New York for the United Nations General Assembly the week after next.\n\nBoth the Prime Minister and the President are due to address the international gathering.\n\nThe pair had a meeting scheduled on the sidelines of the G7 meeting in Canada in June but Mr Trump cancelled it to return to Washington and deal with the Israel-Iran conflict that flared up at that time.\n\nTensions have arisen in the longstanding Australia-US relationship over Mr Trump’s tariffs and ongoing uncertainty around the commitment to the AUKUS Defence pact.","summary":"Donald Trump has labelled Anthony Albanese a ‘good man’ when asked about the Australian Prime Minister following a call between the pair.","url":"https://thewest.com.au/politics/federal-politics/donald-trump-labels-anthony-albanese-a-good-man-after-phone-call-c-19994419","image":"https://images.thewest.com.au/publication/C-19994419/6e0b17eff0f899dc87edb654cefdee9b669ecd24-16x9-x0y0w3840h2160.jpg?imwidth=1200","video":null,"publish_date":"2025-09-12 00:06:31","author":"Katina Curtis","authors":["Katina Curtis"],"language":"en","category":"politics","source_country":"au","sentiment":-0.1},{"id":359726976,"title":"Trump Urges Peaceful Response To Charlie Kirk's Killing","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-urges-peaceful-response-to-charlie-kirk-killing-amid-ongoing-manhunt-9262037\" on this server.\nReference #18.1d011002.1757639662.ed19bca\nhttps://errors.edgesuite.net/18.1d011002.1757639662.ed19bca","summary":"President Donald Trump urged supporters Thursday to respond peacefully to the killing of right-wing campaigner Charlie Kirk, as the murderer continued to evade a manhunt more than 24 hours after the...","url":"https://www.ndtv.com/world-news/donald-trump-urges-peaceful-response-to-charlie-kirk-killing-amid-ongoing-manhunt-9262037","image":null,"video":null,"publish_date":"2025-09-12 00:05:12","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":359724756,"title":"Paramount Skydance prepping bid to buy Warner Bros. Discovery: report","text":"Paramount Skydance is preparing a bid to buy Warner Bros. Discovery, according to The Wall Street Journal. A report published Thursday cited sources who told the Journal that Paramount Skydance, which went through its own merger last month and is now being led by David Ellison, is seeking to acquire the movie studio and cable networks run by one of the company&apos;s top rivals. If completed, the deal would mark the largest merger of two legacy Hollywood studios under one corporate umbrella. NEW PARAMOUNT CEO ISSUES ULTIMATUM TO WORKERS: RETURN TO OFFICE FULL-TIME OR LEAVE Warner Bros. Discovery announced in June that the company was splitting the studio from its cable networks. The spinoff company, dubbed Discovery Global Networks, included CNN, TBS and TNT. It is unclear whether the corporate split would be halted as a result of a Paramount Skydance bid. Paramount&apos;s potential acquisition of Warner Bros. Discovery would put HBO and CNN in the same corporate umbrella as CBS, Showtime, and several other cable networks, including Nickelodeon, MTV, BET and Comedy Central. PARAMOUNT, SKYDANCE COMPLETE $8 BILLION MERGER AS FCC CONTINUES CBS PROBE The Journal noted that \"a bid hasn’t yet been submitted and the plans could still fall apart.\" Warner Bros. Discovery declined to comment. Paramount did not immediately respond to a request for comment. Last month, Paramount merged with Skydance in an $8 billion transaction, which was ultimately approved by the FCC following Paramount&apos;s months-long legal battle with President Donald Trump. Trump had sued Paramount and CBS News over election interference in the network&apos;s handling of its \"60 Minutes\" interview with then-Vice President Kamala Harris that aired in the weeks leading up to the November election. Paramount settled Trump&apos;s lawsuit in July. PARAMOUNT, CBS FORCED TO PAY EIGHT FIGURES, CHANGE EDITORIAL POLICY IN SETTLEMENT WITH PRESIDENT TRUMP Warner Bros. Discovery isn&apos;t the only media asset Ellison reportedly has his eyes set on. Ellison is also seeking to buy The Free Press for $100-200 million and reportedly plans to give its founder, independent journalist Bari Weiss, a leading editorial role at CBS News. Fox News&apos; Brian Flood contributed to this report. GET FOX BUSINESS ON THE GO BY CLICKING HERE","summary":"The Wall Street Journal reported that Paramount Skydance is preparing a bid to buy Warner Bros. Discovery that could shake up Hollywood and the media landscape.","url":"https://www.foxbusiness.com/media/paramount-skydance-prepping-bid-buy-warner-bros-discovery-report","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/09/paramount-warner-bros.jpg","video":null,"publish_date":"2025-09-12 00:00:54","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.354},{"id":359721948,"title":"World News | Israel, Ukraine Team Up to Safeguard Tens of Thousands of Worshippers in Uman","text":"Tel Aviv [Israel], September 12 (ANI/TPS): Israel and Ukraine announced on Thursday a joint security operation to protect tens of thousands of pilgrims traveling to Uman for Rosh HaShanah.\nIsrael's Minister of National Security, MK Itamar Ben Gvir hosted Ukrainian Ambassador Yevgen Korniychuk, Israeli security officials, and representatives of the Haredi Orthodox community on Wednesday to hammer out a comprehensive plan involving the deployment of dozens of police officers, paramedics, and volunteers from both countries.\nAlso Read | Donald Trump's Pick for US Ambassador to India, Sergio Gor, Reveals Delhi Invitation to Washington Next Week As Trade Deal Nears Completion.\nThe initiative also includes a dedicated medical and security network, coordinated with Ukraine's Chief Rabbi, Rabbi Moshe Reuven Asman, whose teams will operate at border crossings and on the ground to ensure the pilgrims' safety.\n\"The State of Israel places supreme importance on the safety of travelers,\" Ben Gvir said. \"I welcome the cooperation with the Ukrainian government, which allows for a safe and well-organized pilgrimage to Uman. This is an unprecedented operation, with dozens of police officers and volunteers ensuring a holiday of prayer and joy.\"\nAlso Read | 'India One of the Most Important Relationships Our Nation Has in World', Says Next US Ambassador to Delhi Sergio Gor.\nAmbassador Korniychuk emphasized Ukraine's commitment despite the ongoing Russian war. \"Ukraine, despite the burden of the Russian war and the severe security situation on the ground, is committed to holding a safe and respectful event in close cooperation with Israel,\" he said.\nRabbi Asman welcomed the coordination, noting, \"I welcome this cooperation to ensure that every worshipper can arrive with peace of mind and complete safety.\"\nRabbi Shimson Blumental, representing the Israeli Chief Rabbi's office, added, \"We will be present on the ground for every need -- to provide immediate assistance and care, ensuring no worshipper feels alone.\"\nAmichai Gabai, who mediated between the parties, described the initiative as historic. \"An event of this scale requires unprecedented coordination. The cooperation between Israel's and Ukraine's security bodies will undoubtedly yield excellent results on the ground,\" he said.\nUman, a city in central Ukraine, is the burial site of Rabbi Nachman of Breslov (1772-1810), the founder of the Breslov Hasidic movement. Rabbi Nachman encouraged his followers to visit his grave for spiritual inspiration and prayer, especially during Rosh HaShanah, the Jewish New Year. He taught that praying at his gravesite could bring divine blessings, and this practice has grown steadily over the centuries.\nIsraeli pilgrims make up the largest group attending Uman for Rosh HaShanah. Numbers have grown dramatically since the 1990s, with tens of thousands traveling annually. Many travel through organized groups that handle visas, accommodation, and logistics, often coordinating with Ukrainian authorities and local volunteers for safety and support.\nUkraine designated the grave as a national heritage site in July. But pilgrimages have become more complicated since Russia invaded Ukraine and recently stepped up missile and drone strikes.\nRosh HaShanah, the Jewish New Year, begins at sundown on September 22. (ANI/TPS) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Israel and Ukraine announced on Thursday a joint security operation to protect tens of thousands of pilgrims traveling to Uman for Rosh HaShanah.","url":"https://www.latestly.com/agency-news/world-news-israel-ukraine-team-up-to-safeguard-tens-of-thousands-of-worshippers-in-uman-7106549.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250911183355.jpg","video":null,"publish_date":"2025-09-12 00:00:25","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.359},{"id":359722704,"title":"Trump vows justice for Charlie Kirk, calls shooter \"an animal\"","text":"Washington, DC [US] September 12 (ANI): US President Donald Trump on Thursday (US local time) said investigators are making progress in tracking down the suspect behind the assassination of conservative activist Charlie Kirk, calling the killer “a total animal.”Trump told reporters he had spoken at length with Kirk’s widow, Erika. “We had a long talk, and she’s devastated. She’s absolutely devastated, as you can imagine,” he said. When asked about a possible motive for the attack, Trump said he had “an indication” but declined to share details. “We’ll let you know about that later,” he added. Kirk, 31, was shot in the neck on Wednesday while answering a question on mass shootings during an open debate at Utah Valley University, as per The New York Times. He is survived by his wife, Erica, and two young daughters.A prominent conservative activist, Kirk was the founder of Turning Point USA and often travelled to college campuses promoting free speech.Trump was also asked about his own safety in the wake of the killing. “Not really,” he replied, though he confirmed that his security measures had been increased. He said his real concern was the safety of the country, blaming what he called the “radical left” for fostering political violence.“We have a great country. We have a radical left group of lunatics out there, just absolute lunatics, and we’re going to get that problem solved. I’m only concerned for the country,” Trump said.On Wednesday night, Trump had earlier described the killing as a “dark moment for America.” In an emotional statement, he said Kirk was a patriot who “devoted his life to open debate and to the country he loved so much.”“He’s a martyr for truth and freedom,” Trump said, while accusing political opponents of spreading a culture of hatred against conservatives.As a mark of respect, Trump ordered American flags to be flown at half-mast until September 14 across federal buildings, military posts, naval stations, and US embassies worldwide. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/trump-vows-justice-for-charlie-kirk-calls-shooter-an-animal-9566561.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-09-12 00:00:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.022},{"id":359725658,"title":"New Mexico is the first state to promise free child care for all families","text":"By MORGAN LEE, Associated Press\n\nSANTA FE, N.M. (AP) — New Mexico’s governor is promising universal free child care to families of all income levels.\n\nGov. Michelle Lujan Grisham announced her plans this week, saying she wants to leverage a financial windfall from oil and gas production to help more parents by removing the state’s income eligibility limit starting Nov. 1.\n\nRules for the program are being hashed out and lawmakers still have to approve funding, but New Mexico already is several steps ahead of other states when it comes to subsidizing child care.\n\nThe latest initiative expands on previous early childhood education investments by extending access to another 12,000 children and making low-interest loans available to spur construction of new child care centers as demands surge.\n\nLujan Grisham says it’s life-changing for parents to have free child care, since it means more money can be spent on utilities and groceries.\n\nGaining traction\n\nAmericans overwhelmingly view the cost of child care as a significant issue, but there are deep divisions over what the government’s role should be in addressing it, mainly whether it should foot the costs.\n\nMany states are limited in what they can take on as President Donald Trump’s administration cuts or freezes billions of dollars in education funding.\n\nLujan Grisham hopes the initiative stirs conversations beyond New Mexico.\n\n“My hope is, as we watch elections take hold around the country, that our congressional candidates are talking about these investments, our gubernatorial candidates are talking about these investments” in child care, the second-term Democrat said.\n\nThe concept of free child care is being embraced by lawmakers including Zohran Mamdani, the Democratic nominee for mayor of New York City, through proposed tax hikes. Oregon’s most populous county ramped up its universal preschool program this year despite funding issues, and enthusiasm for early childhood education spawned the creation last year of a dedicated state agency in Illinois.\n\nFooting the bill\n\nNew Mexico in 2020 began diverting surplus government income linked to surging oil and gas production to a trust for early childhood education. The balance is nearing $10 billion, with about $500 million in investment earnings being funneled each year to early childhood education programs.\n\nThe child care expansion will draw on those savings, some federal funding and a request that state legislators provide an additional $120 million annually. That’s a 26% increase over current spending of $463 million, Lujan Grisham spokesperson Michael Coleman said.\n\nThe Democratic-led Legislature has balked at entitlement programs before, repeatedly rejecting paid family leave requirements for the private sector. Republican lawmakers are concerned that the governor’s latest plan would result in a handout for wealthy families.\n\nNew Mexico in 2022 expanded eligibility and waived copayments for child care assistance to families earning as much as four times the federal poverty rate — about $128,000 for a family of four this year.\n\nPaul Gessing, president of the libertarian Rio Grande Foundation in New Mexico, said it’s baffling that a Democratic governor would come to the financial aid of upper-income parents.\n\n“We’re already doing this up to 400% of the poverty level — that’s a pretty decent amount of money to be making,” he said.\n\nBy eliminating the income cutoff, state officials aim to improve family financial stability, encourage participation in the economy and better prepare toddlers for school.\n\nTo meet increased demand, the Lujan Grisham administration says it will need more than 50 new licensed child care centers, 120 licensed homes that accommodate a dozen children and as many as 1,000 new registered homes that serve four children.\n\nChild care slots already are in short supply across New Mexico. And attendance from low-income families declined as assistance expanded to higher income brackets, according to a review by the Legislature’s budget and accountability office.\n\nThere’s also little evidence that New Mexico children are better prepared for school than children in other states. The 2025 survey by the Annie E. Casey Foundation ranked New Mexico’s public education system last among 50 states.\n\nThe governor’s plan includes incentives to improve quality — raising hourly base pay for child care workers to at least $18 where excellence is demonstrated.\n\nThe universal child care guarantee will cover crucial infant and toddler years before and after children become eligible for public preschool — defraying average annual costs of about $12,000 per year.\n\nEligibility for child care assistance also will extend to grandparents who are in charge of grandchildren, often because of parents struggling with addiction, with no work requirement.\n\nAssociated Press writer Claire Rush contributed from Portland, Ore.\n\nThe Associated Press’ women in the workforce and state government coverage receives financial support from Pivotal Ventures. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"New Mexico's governor is promising universal free child care to families of all income levels.","url":"https://www.bostonherald.com/2025/09/11/new-mexico-free-child-care/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/AP25254658889287.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-11 23:56:56","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.11},{"id":359723898,"title":"New Mexico is the first state to promise free child care for all families","text":"By MORGAN LEE, Associated Press\n\nSANTA FE, N.M. (AP) — New Mexico’s governor is promising universal free child care to families of all income levels.\n\nGov. Michelle Lujan Grisham announced her plans this week, saying she wants to leverage a financial windfall from oil and gas production to help more parents by removing the state’s income eligibility limit starting Nov. 1.\n\nRules for the program are being hashed out and lawmakers still have to approve funding, but New Mexico already is several steps ahead of other states when it comes to subsidizing child care.\n\nThe latest initiative expands on previous early childhood education investments by extending access to another 12,000 children and making low-interest loans available to spur construction of new child care centers as demands surge.\n\nLujan Grisham says it’s life-changing for parents to have free child care, since it means more money can be spent on utilities and groceries.\n\nGaining traction\n\nAmericans overwhelmingly view the cost of child care as a significant issue, but there are deep divisions over what the government’s role should be in addressing it, mainly whether it should foot the costs.\n\nMany states are limited in what they can take on as President Donald Trump’s administration cuts or freezes billions of dollars in education funding.\n\nLujan Grisham hopes the initiative stirs conversations beyond New Mexico.\n\n“My hope is, as we watch elections take hold around the country, that our congressional candidates are talking about these investments, our gubernatorial candidates are talking about these investments” in child care, the second-term Democrat said.\n\nThe concept of free child care is being embraced by lawmakers including Zohran Mamdani, the Democratic nominee for mayor of New York City, through proposed tax hikes. Oregon’s most populous county ramped up its universal preschool program this year despite funding issues, and enthusiasm for early childhood education spawned the creation last year of a dedicated state agency in Illinois.\n\nFooting the bill\n\nNew Mexico in 2020 began diverting surplus government income linked to surging oil and gas production to a trust for early childhood education. The balance is nearing $10 billion, with about $500 million in investment earnings being funneled each year to early childhood education programs.\n\nThe child care expansion will draw on those savings, some federal funding and a request that state legislators provide an additional $120 million annually. That’s a 26% increase over current spending of $463 million, Lujan Grisham spokesperson Michael Coleman said.\n\nThe Democratic-led Legislature has balked at entitlement programs before, repeatedly rejecting paid family leave requirements for the private sector. Republican lawmakers are concerned that the governor’s latest plan would result in a handout for wealthy families.\n\nNew Mexico in 2022 expanded eligibility and waived copayments for child care assistance to families earning as much as four times the federal poverty rate — about $128,000 for a family of four this year.\n\nPaul Gessing, president of the libertarian Rio Grande Foundation in New Mexico, said it’s baffling that a Democratic governor would come to the financial aid of upper-income parents.\n\n“We’re already doing this up to 400% of the poverty level — that’s a pretty decent amount of money to be making,” he said.\n\nBy eliminating the income cutoff, state officials aim to improve family financial stability, encourage participation in the economy and better prepare toddlers for school.\n\nTo meet increased demand, the Lujan Grisham administration says it will need more than 50 new licensed child care centers, 120 licensed homes that accommodate a dozen children and as many as 1,000 new registered homes that serve four children.\n\nChild care slots already are in short supply across New Mexico. And attendance from low-income families declined as assistance expanded to higher income brackets, according to a review by the Legislature’s budget and accountability office.\n\nThere’s also little evidence that New Mexico children are better prepared for school than children in other states. The 2025 survey by the Annie E. Casey Foundation ranked New Mexico’s public education system last among 50 states.\n\nThe governor’s plan includes incentives to improve quality — raising hourly base pay for child care workers to at least $18 where excellence is demonstrated.\n\nThe universal child care guarantee will cover crucial infant and toddler years before and after children become eligible for public preschool — defraying average annual costs of about $12,000 per year.\n\nEligibility for child care assistance also will extend to grandparents who are in charge of grandchildren, often because of parents struggling with addiction, with no work requirement.\n\nAssociated Press writer Claire Rush contributed from Portland, Ore.\n\nThe Associated Press’ women in the workforce and state government coverage receives financial support from Pivotal Ventures. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"New Mexico's governor is promising universal free child care to families of all income levels.","url":"https://www.ocregister.com/2025/09/11/new-mexico-free-child-care/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/AP25254658889287.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-11 23:56:56","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.11},{"id":359718900,"title":"New Mexico is the first state to promise free child care for all families","text":"By MORGAN LEE, Associated Press\n\nSANTA FE, N.M. (AP) — New Mexico’s governor is promising universal free child care to families of all income levels.\n\nGov. Michelle Lujan Grisham announced her plans this week, saying she wants to leverage a financial windfall from oil and gas production to help more parents by removing the state’s income eligibility limit starting Nov. 1.\n\nRules for the program are being hashed out and lawmakers still have to approve funding, but New Mexico already is several steps ahead of other states when it comes to subsidizing child care.\n\nThe latest initiative expands on previous early childhood education investments by extending access to another 12,000 children and making low-interest loans available to spur construction of new child care centers as demands surge.\n\nLujan Grisham says it’s life-changing for parents to have free child care, since it means more money can be spent on utilities and groceries.\n\nGaining traction\n\nAmericans overwhelmingly view the cost of child care as a significant issue, but there are deep divisions over what the government’s role should be in addressing it, mainly whether it should foot the costs.\n\nMany states are limited in what they can take on as President Donald Trump’s administration cuts or freezes billions of dollars in education funding.\n\nLujan Grisham hopes the initiative stirs conversations beyond New Mexico.\n\n“My hope is, as we watch elections take hold around the country, that our congressional candidates are talking about these investments, our gubernatorial candidates are talking about these investments” in child care, the second-term Democrat said.\n\nThe concept of free child care is being embraced by lawmakers including Zohran Mamdani, the Democratic nominee for mayor of New York City, through proposed tax hikes. Oregon’s most populous county ramped up its universal preschool program this year despite funding issues, and enthusiasm for early childhood education spawned the creation last year of a dedicated state agency in Illinois.\n\nFooting the bill\n\nNew Mexico in 2020 began diverting surplus government income linked to surging oil and gas production to a trust for early childhood education. The balance is nearing $10 billion, with about $500 million in investment earnings being funneled each year to early childhood education programs.\n\nThe child care expansion will draw on those savings, some federal funding and a request that state legislators provide an additional $120 million annually. That’s a 26% increase over current spending of $463 million, Lujan Grisham spokesperson Michael Coleman said.\n\nThe Democratic-led Legislature has balked at entitlement programs before, repeatedly rejecting paid family leave requirements for the private sector. Republican lawmakers are concerned that the governor’s latest plan would result in a handout for wealthy families.\n\nNew Mexico in 2022 expanded eligibility and waived copayments for child care assistance to families earning as much as four times the federal poverty rate — about $128,000 for a family of four this year.\n\nPaul Gessing, president of the libertarian Rio Grande Foundation in New Mexico, said it’s baffling that a Democratic governor would come to the financial aid of upper-income parents.\n\n“We’re already doing this up to 400% of the poverty level — that’s a pretty decent amount of money to be making,” he said.\n\nBy eliminating the income cutoff, state officials aim to improve family financial stability, encourage participation in the economy and better prepare toddlers for school.\n\nTo meet increased demand, the Lujan Grisham administration says it will need more than 50 new licensed child care centers, 120 licensed homes that accommodate a dozen children and as many as 1,000 new registered homes that serve four children.\n\nChild care slots already are in short supply across New Mexico. And attendance from low-income families declined as assistance expanded to higher income brackets, according to a review by the Legislature’s budget and accountability office.\n\nThere’s also little evidence that New Mexico children are better prepared for school than children in other states. The 2025 survey by the Annie E. Casey Foundation ranked New Mexico’s public education system last among 50 states.\n\nThe governor’s plan includes incentives to improve quality — raising hourly base pay for child care workers to at least $18 where excellence is demonstrated.\n\nThe universal child care guarantee will cover crucial infant and toddler years before and after children become eligible for public preschool — defraying average annual costs of about $12,000 per year.\n\nEligibility for child care assistance also will extend to grandparents who are in charge of grandchildren, often because of parents struggling with addiction, with no work requirement.\n\nAssociated Press writer Claire Rush contributed from Portland, Ore.\n\nThe Associated Press’ women in the workforce and state government coverage receives financial support from Pivotal Ventures. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"New Mexico's governor is promising universal free child care to families of all income levels.","url":"https://www.sandiegouniontribune.com/2025/09/11/new-mexico-free-child-care/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/AP25254658889287.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-11 23:56:56","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":-0.11},{"id":359719888,"title":"Trump dismisses claims of ‘Russian drone incursion‘ into Poland","text":"US President Donald Trump has downplayed Poland’s accusation that Russian drones intentionally violated its airspace this week, suggesting that the alleged incident “could have been a mistake.”\n\nMoscow has rejected accusations that it committed an “act of aggression” against the NATO state, after Warsaw claimed to have intercepted several drones on Tuesday night.\n\nAsked by reporters on Thursday about Warsaw’s claims, Trump responded: “Could have been a mistake… But regardless, I’m not happy about anything having to do with that whole situation. But hopefully it’s going to come to an end.”\n\nPolish Prime Minister Donald Tusk said the country’s military had tracked at least 19 alleged airspace violations over a seven-hour period, with at least three drones shot down. He described the situation as “unprecedented” and accused Moscow of staging a deliberate provocation.\n\nThe Russian Defense Ministry has insisted that the drones it used in strikes on Ukrainian military targets could not have flown as far as Poland, and emphasized that no targets were planned in Polish territory. With little evidence provided by the Polish side, Moscow could neither confirm nor deny the alleged violations, but stressed it was ready to hold consultations with Warsaw.\n\nThe Kremlin has accused Western leaders of issuing “daily” provocation claims without evidence, while Belarus said it had warned Poland of stray drones disrupted by electronic warfare between Russian and Ukrainian forces.\n\nEuropean leaders, including French President Emmanuel Macron and European Commission chief Ursula von der Leyen, condemned the alleged incursion as “reckless” and expressed solidarity with Poland. NATO Secretary General Mark Rutte likewise described the reported breaches as “dangerous,” though he added the bloc had not confirmed whether they were intentional and voiced doubts about Poland’s claims regarding the number of drones.\n\nPoland has invoked Article 4 of NATO’s founding treaty, which mandates consultations if a member believes its security is threatened, and requested an emergency UN Security Council meeting on Friday.\n\nLast week, former Polish President Andrzej Duda recalled how Kiev tried to draw the US-led bloc into a direct confrontation with Russia in November 2022, when a Ukrainian missile landed on Polish territory but Kiev insisted it was an intentional Russian attack and called for NATO-level retaliation.","summary":"US President Donald Trump has downplayed Poland’s accusation that Russian drones intentionally violated its airspace this week \nRead Full Article at RT.com","url":"https://www.rt.com/news/624548-poland-russian-drones-trump/","image":"https://mf.b37mrtl.ru/files/2025.09/article/68c35fd885f540271672cab9.jpg","video":null,"publish_date":"2025-09-11 23:49:41","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.458},{"id":359715952,"title":"Brisbane news live: Thief steals and crashes hearse, driver trapped in other vehicle | Accused food truck police chase driver identified | Trump praises ‘good man’ Albanese","text":"A hearse was stolen from a funeral home at the Gold Coast this morning and was involved in a crash with other vehicles minutes later.A hearse was reported stolen from a Gold Coast funeral home on Friday morning and crashed minutes later.Credit: Nine NewsThe alleged thief, a 38-year-old, was taken into custody at the scene of the crash and is this morning in hospital under police guard. Nine News reported that the hearse was stolen from Integrity Funerals in Parkwood before 5am.A van was knocked on its side in the crash, and the driver needed to be freed by emergency services.Credit: Nine NewsAbout 15 minutes later, the hearse was in a traffic crash, with one of the other vehicles, a van, knocked on its side, trapping its driver.Police and fire crews freed that driver, Nine reported.The accused was expected to be charged today.Latest postsLatest postsWest End Markets are having their Spring Solstice Market tonight from 4pm. Enjoy an Aperol spritz and some slow-cooked meats as well as live music and 150 stalls to browse.On Sunday, thousands of keen runners will jog from Murarrie across the Gateway and all the way to the Showgrounds for the annual 10-kilometre Bridge to Brisbane (the shorter 5km run skips the bridge). Watch out for road closures.Ken Done in his studio.Credit: Luisa BrimbleKen Done was an icon of the 1980s in Australia with his colourful artworks and the many products on which they appeared. Now 85, he’s the subject of Ken Done: No Rules, a retrospective at HOTA on the Gold Coast, opening tomorrow and running for five months.Also on the Goldie, Swell Sculpture Festival begins today with 80 artworks installed at Currumbin Beach and in other pop-up locations (say hi to Sheila).Violin virtuoso Ray Chen is redefining what a classical musician is in the 21st century, with 1 million Instagram followers and a flamboyant stage act – see him at QPAC on Sunday.In Brisbane Festival, Australian pop musical The Lovers is opening at QPAC, with its plot updating A Midsummer Night’s Dream and a cast featuring Hamilton’s Jason Arrow.Also in the festival, The Platypus by Mad as Hell comedian Francis Greenslade is a black comedy about the messy denouement of a marriage, while Batshit is Leah Shelton’s one-woman show about how psychiatry has been shaped by gender bias.And in AFL, the Brisbane Lions will take on the Gold Coast Suns at the Gabba in what will be a monster QClash semi-final on Saturday.Anthony Albanese has backed the flow of migrants to Australia in “appropriate numbers”, saying it plays an “important role” while landing a thinly veiled jab on firebrand senator Jacinta Nampijinpa Price after she made false claims about Indian migration.“We welcome people from all over the world in appropriate numbers. They importantly provide a skilled workforce in areas where it’s needed,” Albanese told 4CA Cairns radio moments ago.Anthony Albanese.Credit: Alex Ellinghausen“People need to address these issues, also in a way that promotes social inclusion, that doesn’t target any communities. And unfortunately, on the other side of politics, as we’ve seen, there has been a targeting of particular communities, and we’re a better country than that.”Price was dismissed from the Coalition frontbench on Wednesday after failing to apologise for her remarks about Indian migration, and for failing to back Liberal leader Sussan Ley.\n\nAnthony Albanese has condemned political violence following the assassination of US conservative influencer Charles Kirk, saying his thoughts were with Kirk’s family.“There is no place for political violence,” Albanese told 4CA Cairns radio moments ago. “Our thoughts are certainly with Charlie Kirk’s loved ones at this time.”A well-wisher places flowers at a makeshift memorial set up at Turning Point USA headquarters.Credit: APAlbanese said he was observing a “polarisation of politics”, finding that social media was contributing in pushing people “towards extremes”, which he said was “not a good thing here in Australia”.“The fact we have compulsory voting, the fact we have preferential voting as well, pushes people towards more mainstream views of mainstream politics, rather than being at the edges and trying to make people angry and respond emotionally, and it is a real concern when you look at the world, there’s no place you’d rather be than here in Australia.”\n\nAdvertisement\n\nA hearse was stolen from a funeral home at the Gold Coast this morning and was involved in a crash with other vehicles minutes later.A hearse was reported stolen from a Gold Coast funeral home on Friday morning and crashed minutes later.Credit: Nine NewsThe alleged thief, a 38-year-old, was taken into custody at the scene of the crash and is this morning in hospital under police guard. Nine News reported that the hearse was stolen from Integrity Funerals in Parkwood before 5am.A van was knocked on its side in the crash, and the driver needed to be freed by emergency services.Credit: Nine NewsAbout 15 minutes later, the hearse was in a traffic crash, with one of the other vehicles, a van, knocked on its side, trapping its driver.Police and fire crews freed that driver, Nine reported.The accused was expected to be charged today.Liberal senator Jane Hume says there has been “mishandling on all sides” in the internal saga resulting in the dismissal of Jacinta Nampijinpa Price from the Coalition frontbench, sharing relief at the apparent conclusion of the affair and “absolutely” backing Sussan Ley’s leadership.Hume signalled her disapproval at the involvement of party colleague Alex Hawke in the affair, which started after Price made false claims about Indian migration last week, eventually resulting in the firebrand senator’s sacking after she continually refused to apologise and failing to back in Ley’s leadership this week.Opposition Leader Sussan Ley dismissed Jacinta Price from the Coalition frontbench on Wednesday.Credit: Alex Ellinghausen“This has been an entirely unedifying week for the Coalition, not something that we want to repeat, something we should learn from,” Hume told Seven’s Sunrise this morning.“I think there has been mishandling on all sides, but the good news is we have cauterised the wound, we are going to move on now and talk about what’s important to ordinary Australians.”Our Chief Political Commentator, James Massola, writes today that “Price was demoted, not discarded – and that spells trouble for Ley”.Billy Walters has opened up on the controversial sacking of his father, club legend Kevin, from coaching duties at the Brisbane Broncos, and admitted he considered leaving the team.He has spent his Broncos’ days fighting cries of nepotism to ensure he stood on his own.Thrust into the No.9 jumper, cries of father-son privilege rained until the younger Walters became a pivotal figure in the club’s charge to the 2023 NRL grand final.All in the family: Billy and Kevin Walters’\n with Billy’s son, Hugo.Now, in sports reporter Nick Wright’s story, he has revealed why he stayed after his father’s axing.\n\nAdvertisement\n\nUS President Donald Trump has praised Prime Minister Anthony Albanese as a “good man” in the first and only comments he has made about the phone call the two leaders had last week.“He’s a good man,” Trump told this masthead as he left the White House moments ago, after he was asked about the call with Albanese. He did not elaborate.Prime Minister Anthony Albanese and US President Donald Trump spoke on the phone last week in what the prime minister described as a “warm and constructive” call.Credit: VariousTrump spent most of his doorstop talking about the assassination of conservative activist Charlie Kirk. He answered this correspondent’s question immediately before boarding a waiting Marine One helicopter bound for the airport and New York.But the positive assessment of Albanese backs up the prime minister’s description of his “warm and constructive” call with Trump last Thursday night, covering economics, trade and security.Despite that, there has been no official readout from the White House or other comment from Trump about the call.And there has been no confirmation of a possible meeting while Albanese is in the US later this month for a United Nations meeting.The driver accused of leading officers on an hours-long chase in a stolen food van has been identified.Dylan Fitzgerald has been identified as the driver accused of leading police on a chase in a stolen food truck.Credit: Nine NewsMore than a dozen police cars and a helicopter pursued the vehicle on Wednesday from the Brisbane CBD to just south of Maryborough, where it was stopped.The alleged driver, 39-year-old Dylan Jake Fitzgerald, was arrested and police laid seven charges, including unlawful use of a motor vehicle, dangerous driving, driving under the influence, evading police and driving while suspended.He faced Hervey Bay Magistrates Court on Thursday.Fitzgerald did not apply for bail and will remain behind bars.The big bluster blew hats off all over Brisbane yesterday, but we’ve returned to calmer conditions to close out the week. Today we’re expecting a partly cloudy day with a mild top temperature of 24 degrees – although the apparent temperature means it could feel much cooler – and light winds, and the weather bureau predicts the slight chance of a shower around lunchtime.Here’s how the weekend’s weather is looking to pan out, along with a glance at much of next week:\n\nAdvertisement\n\nHere’s what’s making news further afield this morning:American authorities have recovered a high-powered rifle believed to be used in the assassination of conservative political activist Charlie Kirk, as they home in on clear vision of a “college age” shooter who moved through stairwells to a rooftop to fire the fatal shot. Sussan Ley is expected to placate frustrated conservatives with plum gigs in a reshuffle forced by Senator Jacinta Nampijinpa Price’s sacking, as the Coalition’s right faction splinters over the opposition leader’s future.The scandal over Jeffrey Epstein has spilled into British politics in a slow-motion drama that has claimed the scalp of an influential Labour insider, Lord Peter Mandelson, over his years of friendship with the convicted sex offender.Anthony Albanese was the odd one out in his pink floral shirt.Prime Minister Anthony Albanese was caught in an awkward fashion faux pas at the Pacific Islands Forum Leaders Meeting in the Solomon Islands when he walked in sporting a red-and-white, short-sleeved, tropical-style shirt that screamed Sunday arvo beers and snags on the barbie. He stood out like a sore thumb as every other leader at the forum was wearing a sober dark-blue batik shirt – but the PM excused himself and quickly reappeared in another shirt.Former Brazilian president Jair Bolsonaro has been convicted by a Supreme Court majority of plotting a coup to remain in power after losing the 2022 election.","summary":"For today’s news updates as they happen in Brisbane and beyond, follow us here.","url":"https://www.smh.com.au/national/queensland/brisbane-news-live-accused-food-truck-police-chase-driver-identified-trump-praises-good-man-albanese-20250911-p5mu5j.html","image":"https://static.ffx.io/images/$zoom_1.779831932773109%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Ce_sharpen:60%2Cf_auto/fa145070434b7f87b34f560683bbe17288cf2f6d5f31ee88f148955828c85eb5","video":null,"publish_date":"2025-09-11 23:49:20","author":"Senator Jacinta Nampijinpa","authors":["Senator Jacinta Nampijinpa"],"language":"en","category":"politics","source_country":"au","sentiment":0.269},{"id":359724192,"title":"TOM LEONARD: Family man and champion of free speech whose assassination has left the US facing dark and dangerous times","text":"Espousing a fiery – and usually provocative – brand of conservatism, Charlie Kirk took the battle for converts to the place where he felt his opponents were most deeply entrenched: America's university campuses.\n\nThe activist and social media influencer – credited with turning many young voters to Donald Trump at the last election – believed students were brainwashed by Left-wing ideology and that free speech was desperately needed in the country's supposed temples of learning.\n\nAnd although his views – which included banning gay marriage and all abortion, while condemning Martin Luther King as 'a bad man' – were frequently inflammatory for many Americans, he was always ready to sit down and debate them calmly with his critics rather than shout them down.\n\nSo it's an irony that will be lost on few of his supporters that he of all people was shot dead on the campus of Utah Valley University just after he'd taken a question about mass shootings.\n\nThe death of a father of two, hailed as 'the youth whisperer of the American Right', has sent profound shockwaves through a country now contending with a surge in political violence.\n\nKirk loved a fight – albeit only verbal – during a short but stellar career that saw him earn a place in Trump's inner circle as the political wizard who really knew how to win the youth vote.\n\nSome pundits believed it might have been a prelude to a White House run but Kirk, though highly ambitious, made it clear he was happier being an activist on the ground, working to defeat a 'wokeism' that he believed was destroying his country and needed rooting out at its source.\n\nHe co-founded conservative youth movement Turning Point USA in 2012 when he was 18, later dropping out of university to start touring college campuses to try to get a conversation going with his target market. By 2023, the total revenue of Turning Point and associated enterprises had soared to £68million.\n\nKirk was initially concerned about economics – supporting small government and free markets – but, after becoming an evangelical Christian, he turned into more of a culture warrior.\n\nIn 2021, he married a former Miss Arizona, Erika Frantzve, and became an exponent of traditional family values, including the woman's place in marriage.\n\n'Submit to your husband, Taylor. You're not in charge,' he once advised pop star Taylor Swift.\n\nSetting up home in Arizona –although temporarily relocating to Trump's Mar-a-Lago base in Florida – the Kirks started a family with a daughter, now three, and a boy aged one. Their names have never been made in public.\n\nIf Kirk and Erika have insisted on strict privacy when it comes to their home life, he seemed to relish his public notoriety. An unashamed provocateur, Kirk soaked up what his critics said about him.\n\nBranded racist, xenophobic, misogynistic and homophobic by the Left, he championed myriad controversial views – opposing abortion even for rape victims and claiming that an anti-malaria drug could treat Covid-19 (for which he was temporarily banned from pre-Elon Musk Twitter).\n\nKirk argued that white men were the people who were truly oppressed in today's America.\n\nIn 2021, he described George Floyd, the black man whose murder by a Minneapolis police officer sparked the Black Lives Matter unrest, as 'a bad man'. A 'Christian Nationalist', Kirk opposed immigration on the grounds that it was part of a plot – dubbed the Great Replacement Theory – to displace white Americans.\n\nWhile he admitted he wasn't immediately drawn to Trump –and had actually supported some of his Republican challengers for the White House – Kirk was won over by Trump's children, particularly Donald Trump Jr, to whom he became close after working for him during the 2016 election. Becoming a devout Trump loyalist, he eventually believed the President was heaven sent: when Trump came close to death in Pennsylvania last year, Kirk suggested that a 'gust of wind' sent by God had pushed the bullet 'ever so slightly'.\n\nKirk himself was not so fortunate. Yesterday, commentators said they fear the US now faces a dark and dangerous moment – one which can only be overcome if Americans come together.\n\nThere is little sign of that happening, however. Easily available guns, the poisonous level of debate on social media and an increasingly polarised population have all fed in to a toxic mix.\n\nPolls show that Americans overwhelmingly reject the idea of political violence but politicians from both sides have been targeted in recent months and years.\n\nIn June, a Democratic Minnesota state congresswoman and her husband were murdered in their home.\n\nTrump himself came within inches of being shot at a Pennsylvania rally in July last year.\n\nLove him or hate him, Kirk was at least prepared to sit down and thrash out his differences with his opponents.\n\nIt was, tragically, this very openness that cost him his life.","summary":"Espousing a fiery - and usually provocative - brand of conservatism, Charlie Kirk took the battle for converts to the place where he felt his opponents were most deeply entrenched.","url":"https://www.dailymail.co.uk/news/article-15090343/Family-man-champion-free-speech-assassination-US-dark-dangerous.html","image":"https://i.dailymail.co.uk/1s/2025/09/11/23/102064379-0-image-m-43_1757629907021.jpg","video":null,"publish_date":"2025-09-11 23:48:53","author":"Editor,Tom Leonard","authors":["Editor","Tom Leonard"],"language":"en","source_country":"gb","sentiment":-0.106},{"id":359724220,"title":"Detectives offer $100,000 reward to find Charlie Kirk's assassin as police release images of suspect and murder weapon","text":"A reward of $100,000 was offered last night to catch the killer of conservative activist Charlie Kirk after he was shot dead on a US university campus.\n\nOfficials released images yesterday of the suspect thought to have murdered the MAGA cheerleader on Wednesday with a single shot fired from a rooftop 142 yards away.\n\nAs the hunt continued, aided by the offer of £73,650, enforcement agencies ditched a press conference due to 'rapid developments in our investigation'.\n\nDetectives found a 'high-powered bolt action rifle' yesterday – said to be an imported .30-calibre Mauser – wrapped in a towel in a wooded area near Utah Valley University, which they believe to be the murder weapon.\n\nThe gun was said to have contained ammunition engraved with 'transgender and anti-fascist statements', according to a preliminary report from the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) reported by the Wall Street Journal.\n\nBut a senior law enforcement official later told the New York Times that these symbols may have been misinterpreted or misread.\n\nThe official added that the information had not been verified by FBI analysts, and the engravings did not match up with other evidence collected.\n\nThe assassin, whom police chiefs said appeared to be 'of college age', is believed to have jumped from the roof of the Losee Center building, which overlooks the courtyard where Mr Kirk, a 31-year-old father-of-two, was speaking.\n\nThe killer is then understood to have blended in with the panicking crowd before making his escape from the campus.\n\nBeau Mason, Utah's public safety chief, said investigators had 'good video footage' of the suspect. \n\nHe added that they were able to track his movements from the moment he arrived at Utah Valley University at 11.52am, about 30 minutes before Mr Kirk was shot. However, it remains unclear where the killer has gone into hiding.\n\nMr Kirk's widow, Erika, does not know how she will tell their children about their father's death, a colleague said last night.\n\nJack Posobiec, a contributor to Kirk's Turning Point USA group, told the NewsNation TV station: 'Erika is unbelievably strong. At the same time someone's going to have to explain to his son and daughter why their dad didn't come home yesterday.\n\n'Erika is a prayer warrior, her and Charlie are very devout believers. They are very, very, deeply Christian.\n\n'When you see the cameras turn off, the lights go down, they immediately go back to faith – this is something they live 24/7.\n\n'It is not something that only exists in front of the camera, that is something that they absolutely walk every single day. Because they have that firm reliance in faith, [Erika] has that ability to be able to go through this with that kind of strength that really only comes from Heaven.'\n\nMr Kirk and his wife, who won Miss Arizona USA in 2012, celebrated their fourth wedding anniversary in May.\n\nFBI director Kash Patel was last night believed to be on his way to Orem, Utah, where he was expected to hold a press conference with the state's Department of Public Safety.\n\nMr Patel is facing scrutiny for posting a statement claiming a suspect in the murder was in custody, only to have to backtrack two hours later after the individual was released. \n\nThe statement was made during a press conference held by law enforcement officials in Utah, spreading confusion about whether the gunman was still at large.\n\nThe FBI said it had received at least 130 pieces of information about the gunman, and asked residents living near Utah Valley University to check their surveillance cameras.\n\nThe grainy images show a man in a stairwell wearing a baseball cap, dark sunglasses and a black jumper bearing an American flag with the words 'Land of the Free.... Home of the Brave'.\n\nThe body of Mr Kirk, who was pronounced dead less than three hours after the shooting, will be flown to Arizona, his home state, on Air Force Two, the plane used by Vice President JD Vance.\n\nMr Vance travelled to Utah yesterday to meet Kirk's family, skipping 9/11 memorial events in Washington to do so.\n\nHe posted a tribute online to his friend's bravery and debating skills, saying: 'He exemplified a foundational virtue of our Republic: the willingness to speak openly and debate ideas.'\n\nTikTok said last night it would remove gruesome videos showing Mr Kirk being struck in the neck with the bullet that killed him, following a request from Republican congresswoman Anna Paulina Luna, who was a friend of the activist.\n\nThe graphic footage of the shooting quickly received millions of views across various social-media platforms.\n\nTurning Point USA, the group founded by Mr Kirk as a teenager to spread conservative ideas on US campuses, released a statement last night from the campaigner's official X account, saying: 'All of us have lost a leader, a mentor and a friend.'\n\nTurning Point described Mr Kirk as a 'natural builder and problem solver' who 'loved a challenge and saw every setback as a chance to learn, grow, pray and try again'.\n\n'Although Charlie is gone, his legacy will endure,' the statement continued.\n\nPresident Donald Trump yesterday pledged that he would posthumously award his ally the Presidential Medal of Freedom, the highest civilian award in the United States.\n\n'Charlie was a giant of his generation, a champion of liberty, and an inspiration to millions and millions of people,' the US President said after attending a 9/11 memorial service at The Pentagon.\n\n'We miss him greatly, yet I have no doubt that Charlie's voice and the courage he put into the hearts of countless people, especially young people, will live on.'\n\nDonald Trump Jr said he was the one who broke the news of Mr Kirk's assassination to the President.\n\nThe President's son told CNN commentator Scott Jennings on his radio show that he heard of Mr Kirk's shooting 'right before my father called me on something', adding: 'I'd found out that he had passed, and I think I was the one that broke the news to him, and it was a rough day.'\n\nMr Trump Jr was said to have been close to Mr Kirk and said he spoke to him 'practically every day', as insiders told The Atlantic magazine that he was 'shattered' by his death.\n\nSir Keir Starmer paid tribute to Mr Kirk on X, posting: 'It is heartbreaking that a young family has been robbed of a father and a husband.\n\n'We must all be free to debate openly and freely without fear –there can be no justification for political violence.'\n\nMr Kirk, who was followed by millions of people on social media, was a prominent figure in US politics and is thought to have helped Mr Trump to win two presidential elections through his strong connection with young conservatives.\n\nHe served as a personal aide to Mr Trump Jr during a general election campaign. In 2024 Turning Point USA increased its staff from 400 to 1,000 to 'chase the vote' in swing states.\n\nHis 'prove me wrong' table, which saw him debate a range of issues with members of the public, helped him garner 15billion social media views last year.\n\nHe courted controversy with various remarks, including claims that women should only go to college to find a husband.\n\nAnd last year, he faced a fierce backlash after admitting he would question the qualifications of a black pilot.\n\n'If I see a black pilot, I'm going to be like, 'Boy, I hope he is qualified,' he said on his podcast.\n\nThe author of several books, including one on the Second Amendment, Mr Kirk was a staunch supporter of gun rights.\n\n'I think it's worth a cost of, unfortunately, some gun deaths every single year so that we can have the Second Amendment to protect our other God-given rights,' Mr Kirk said in 2023.","summary":"As the hunt continued, aided by the offer of £73,650, enforcement agencies ditched a press conference due to 'rapid developments in our investigation'.","url":"https://www.dailymail.co.uk/news/article-15090449/Detectives-reward-Charlie-Kirks-assassin-police-suspect-murder-weapon.html","image":"https://i.dailymail.co.uk/1s/2025/09/12/00/102064795-0-image-m-25_1757632923786.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/10/7386732049582015370/1024x576_MP4_7386732049582015370.mp4","publish_date":"2025-09-11 23:48:21","author":"Editor,George Odling,Kamal Sultan","authors":["Editor","George Odling","Kamal Sultan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.311},{"id":359724160,"title":"Trump receives warm welcome from Yankees fans, 'USA' chants break out at stadium","text":"President Donald Trump saluted the national anthem on Thursday night at Yankee Stadium, receiving a good hand from the Bronx faithful in the process. Trump arrived in New York shortly after 6 p.m. ET and was spotted in his suite on the third base side less than an hour later. It was a mostly positive crowd toward Trump on the 24th anniversary of Sept. 11, with moderate boos. However, all were on hand to loud \"USA\" chants both before and after the anthem. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM A faint \"F--- Joe Biden\" chant was heard, but it drowned out quite quickly. The ovation came after Trump visited the Yankees in the home clubhouse where he shook everyone's hand and had extensive chats with Aaron Judge and Anthony Volpe. TRUMP ARRIVES AT YANKEE STADIUM, GIVES SPEECH TO TEAM AHEAD OF 9/11 ANNIVERSARY GAME Fans were urged by the Yankees to take public transportation to the game and arrive early. Gates opened three hours before the game — normally, it is 90 minutes beforehand. Trump was in a suite with Yankees team owner Hal Steinbrenner and president Randy Levine after being at the Pentagon for a 9/11 ceremony early Thursday. In his first at-bat after meeting Trump, who complimented his power and muscles, he hit a solo homer 110 mph off the bat. CLICK HERE TO GET THE FOX NEWS APP This is the first time Trump has attended a baseball game since the 2021 World Series, roughly a year after he lost the 2020 election to Joe Biden. The last time he was at an MLB game as a sitting president was the 2019 Fall Classic. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"President Donald Trump received a warm welcome from the crowd at Yankee Stadium on Thursday night, the 24th anniversary of the Sept. 11 attacks.","url":"https://www.foxnews.com/sports/trump-receives-warm-welcome-from-yankees-fans-usa-chants-break-out-stadium","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/trump-salute-911.jpg","video":"https://www.foxnews.com/video/6379168013112","publish_date":"2025-09-11 23:47:40","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"us","sentiment":0.157},{"id":359715200,"title":"EastEnders Christmas special to feature the 'past, present and future' of the soap with the Branning and Slater families set for 'drama'","text":"Britain's Got Talent\n\nCelebrity Big Brother\n\nPrivacy Policy\n\nFriday, Sep 12th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nEastEnders Christmas special to feature the 'past, present and future' of the soap with the Branning and Slater families set for 'drama'\n\nHave YOU got a story? Email tips@dailymail.co.uk \nBy LAURA PARKIN, SHOWBUSINESS REPORTER \n Published:00:23 BST, 12 September 2025 |Updated:00:47 BST, 12 September 2025 \n\nThe EastEnders Christmas special will feature the 'past, present and future' of the soap with the Branning and Slater family set for 'drama.' \nBen Wadey, the new executive producer of the show, has teased details of the eagerly-awaited episode and assured fans that bosses have 'bought their A-game'.\nBen told RadioTimes.com: 'This Christmas, we're looking past, present and future, so we've got a lot of stuff that we're very excited to share with the audience.' \nHe also revealed that various families, including the Brannings and the Slaters, will find themselves in the midst of drama in upcoming episodes. \n'Of course, Zoe is now back in the square, and Zoe and Kat's relationship is complicated. There are 20 years there for them to try and recover and get to know each other.\n'Zoe has a lot of secrets that she's going to bring into the Square with her, so the Slaters are in for a whole ride this autumn,' Ben added. \n\nThe EastEnders Christmas special will feature the 'past, present and future' of the soap with the Branning and Slater family set for 'drama' \n\nBen Wadey, the new executive producer of the show, has teased details of the eagerly-awaited episode and assured fans that bosses have 'bought their A-game'\nZoe came face-to-face with her mother Kat last week after 20 years.\nViewers of the long-running BBC soap were left stunned as the mother and daughter duo stood in the exact same spot where Kat declared she was her mother - a scene that has gone down in soap history.\nHowever, in heartbreaking scenes, she told Kat she couldn't stay in Walford and took off from the pub.\nAs a devastated Kat chased after Zoe through the Square, Jack and Ravi fought over the gun the copper tried to plant on him and it accidentally went off.\nThe shot was fired in the direction of Kat and Zoe as a horrified Jack looked on at the unfolding scene. \nAs Zoe fights for her life in hospital a flashback revealed how the daughter of Kat Moon has been seeing Max Branning away from the Square.\nThe revelation has left fans floored - particularly as the ladies man previously had an affair with her cousin Stacey Slater.\nTheir infidelity was exposed during the Christmas Day episode in 2007 as Max's wife Tanya and Stacey's boyfriend Bradley - Max's son, watched a secret recording of them both. \n\n'Zoe has a lot of secrets that she's going to bring into the Square with her, so the Slaters are in for a whole ride this autumn,' Ben added \n\nViewers last saw Max in 2021 as he left Walford after his affair with Linda Carter (Kellie Bright) was exposed and she decided to stay with Mick over him. \nHis brother Jack (Scott Maslen) told him to move on with his life, which inspired him to leave and go to New Zealand to be with his daughter Lauren (Jacqueline Jossa).\nMeanwhile, Rudolph Walker previously claimed that the soap will be tackling storylines that 'we've never seen on television before' under Ben's leadership.\nThe actor, 85 - who has played Patrick Trueman on EastEnders since 2001 - told Best of British magazine: 'Ben is great. He's come in. He's very positive about the future of EastEnders. \n'And I have very high hopes that we are going to see things that maybe we've never seen on television before. Or if we did, it hasn't been highlighted. I think we're going to see a lot more of that.' \n\nShare or comment on this article: \nEastEnders Christmas special to feature the 'past, present and future' of the soap with the Branning and Slater families set for 'drama'\n\nAdd comment\n\n Share what you think\n\nNo comments have so far been submitted. Why not be the first to send us your thoughts,\nor debate this issue live on our message boards.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nBold and Beautiful! Margot Robbie looks incredible in breathtaking sheer gown with a daring open back for London premiere of new movie \n\nPICTURED: Saoirse Ronan and her husband Jack Lowden put on a loved-up display as they're seen with their new baby for the first time \n\nHollywood superstar is unrecognisable in her most explosive role yet - can you guess who?\n\nBRYONY GORDON: I was at the Great North Run with Tommy Fury. Here's the truth about his bad behaviour and what happened when I found myself sitting behind him\n\nSharon Osbourne is seen for the first time since husband Ozzy's funeral as her daughter Kelly reveals their new shared passion for falconry has 'put a smile back on mum's face'\n\nDenim is back in fashion like never before: Here's our guide to finding the style that works for you (and your PERFECT fit!)\n\nCameron Diaz, 53, and husband, 46, seen together in public for first time in ONE YEAR as they take son out\n\nInside the NTAs: How Ben Shephard supported his 'work wife' Cat Deeley and the celebs that left execs furious... DOLLY BUSBY reveals all the secrets\n\nBrooklyn Beckham's ex spills secret about their past relationship amid family feud with Nicola Peltz\n\nFrom field to flame-grill: How British wagyu cattle and sustainable farming make Burger King's most premium burger ever\n\nIf this is Ed Sheeran's UK swansong, then he's heading to America with a bang... ADRIAN THRILLS reviews his new album Play\n\nCharles is making a mistake by appeasing Harry. The Prince's new addiction means this 'reunion' will end in disaster... RICHARD EDEN\n\nOlivia Attwood is supported by her husband Bradley Dack at the launch of her River Island range - after she admitted their marriage is a 'work in progress' \n\nVictoria Beckham steps out in casual white T-shirt paired with a Birkin bag for shopping spree in NYC after it was revealed son Brooklyn will appear in Netflix doc \n\nImprove the appearance of your eyes 'in SECONDS'! Beauty influencer Emily Tierney reveals her 'DIY eye lift' using an innovative product that is as powerful as retinol but WON'T irritate your skin\n\nI am a cynical woman in her 50s but these are the hot teen brothers that have me and a legion of other midlife women obsessed: HANNAH BETTS\n\nJoey Essex's firm sinks with huge £1.2M debt despite star earning a fortune from top reality shows\n\nPete Wicks puts on a cosy display with Real Housewives Of Cheshire's Seema Malhotra in the smoking area at the NTAs - after admitting he is 'in love' \n\nLaura Carmichael makes chic appearance at Michael Kors' New York Fashion Week show after her secret marriage to her Downton co-star was revealed\n\nDoes giving up alcohol completely really work? Why cutting down on drinking rather than going cold turkey might be a better solution for you\n\nOlivia Wilde suffers wild wardrobe malfunction while bra-free in sheer top... after Harry Styles 'drama'\n\nFrom Arkansas to Lady Gaga's arm! Stylist Marko Monroe reveals how he became Hollywood's Labubu designer (with Mariah Carey snagging one too!)\n\nVogue Williams is the latest star to take a swipe at Molly-Mae Hague's 'shock' NTAs win - while beaming influencer brushes off the backlash on outing with daughter Bambi\n\nBRIAN VINER reviews Spinal Tap II: The End Continues: Even with names like McCartney and Elton... Spinal Tap hit a few bum notes in spoof sequel \n\nIn only 10 minutes a day, chair yoga is offering thousands of users an easy path to better health, flexibility, and wellbeing at home\n\nNe-Yo parades his FOUR girlfriends at Kim Kardashian's SKIMS store during wild shopping spree\n\nHulk Hogan's daughter Brooke speaks out on being left off wrestling icon's $5million will\n\nCHRISTOPHER STEVENS reviews The Newsreader: To use Lockerbie as the backdrop for light comedy is simply unforgivable \n\nTennis icon appears unrecognisable as she poses next to David Beckham and US Open winner Aryna Sabalenka at glitzy New York party\n\nFrom seeing elephants and orangutans in the wild, to climbing the stunning Mount Kinabalu and postcard-worthy beaches: Discover why Sabah is the gem of Southeast Asia\n\nBig Little Lies Season 3 confirmed but LEAKED plot twist sends fans into meltdown\n\nStrictly Come Dancing in chaos as full list of 2025 pairings leak online just over a week before BBC show launch airs\n\nLily James looks stunning in a slinky black gown as she hits the London premiere of her new dating app movie Swiped\n\n'60s pinup Salli Sachse dead at 82: Actress who starred in The Trip and Wild in the Streets passes away\n\nThe £80 powerhouse serum users say is the secret to younger, plumper looking skin\n\nReal Housewives star's son, 21, arrested for assault and trying to break into a home through a DOG DOOR\n\nStacey Solomon breaks her silence on triple losses at the NTAs as she insists 'it feels like we won' with sweet clip of her family enjoying the ceremony\n\nBenson Boone and girlfriend SPLIT after nearly two years of dating amid his first world tour\n\nGogglebox's Pete Sandiford and his wife Paige Sandiford share a rare glimpse into their family life as they enjoy a day out at the beach\n\nNot another Chatbot: The AI that thinks like a veterinarian\nAdvertising\n\nThis Morning's Cat Deeley and Ben Shephard break with major TV tradition after FINALLY winning NTA gong - after sharing VERY drunken videos\n\nNepo baby takeover! Leni Klum, Isan Elba, Delilah Belle Hamlin and Ava Phillippe rub elbows at Michael Kors show\n\nLisa Snowdon, 53, shows off her incredible figure in a skimpy bikini as she declares she is 'coming out the other side of menopause and all the years it drained me'\n\nTeddi Mellencamp chillingly urges fans to get life insurance amid stage four cancer battle\n\nThe bestselling Korean skincare products you've never heard of (but absolutely should) - backed by thousands of five-star reviews\n\nImogen Thomas shows off the results of her breast reduction surgery as she poses in a white bralet after going under the knife in Istanbul\n\nNaomi Campbell, 55, shows off her incredible figure as she enjoys a private yoga session at her swanky villa in Spain\n\nConor McGregor cosies up to partner Dee Devlin at BGC Group Charity Day after the couple were rocked by 'cheating scandal'\n\nKylie Kelce reveals why she refused to publicly congratulate brother-in-law Travis and Taylor Swift on engagement\n\nTired of slow, unreliable Wi-Fi holding back your business? Vodafone Business slashes prices on full fibre and super plans\n\nMichelle Keegan gets drenched by pouring rain as she is seen filming with Douglas Booth for the first time in their thrilling police drama The Blame\n\nPregnant Katherine Ryan, 42, stuns in a heart print dress as she joins her glam mother Julie McCarthy, 65, at gala night of Mamma Mia! The Party\n\nJennifer Lopez lost a film role to Madonna in the '90s after 'practicing for weeks' to nail audition\n\nTrans influencer Dylan Mulvaney calls herself a 'retired twink' to promote new one-woman show\n\nStrictly champion Bill Bailey kicks himself after stumbling over obvious £10k Celebrity Catchphrase question - shouting 'of course!' when he learns the answer\n\nSerena Williams' coach reveals they had FIGHTS about her post-pregnancy weight after tennis star's drug revelation\n\nDownton Abbey star Dan Stevens looks almost unrecognisable at the London premiere of his new film Swiped\n\nBillie Shepherd's husband Greg reveals his dad Dave has died at the age of 77 as he shares heartbreaking tribute after his 'sudden' passing\n\nBritish drama soars to top of UK charts after quietly being added to Netflix - boasting star-studded cast including Olivia Colman and Stephen Graham\n\nDua Lipa and her fiancé Callum Turner are 'on the hunt for a £9million bolthole' as they eye up mansions in the sun\n\nNina Dobrev and Shaun White looked loved up DAYS before ending engagement\n\nMegan Barton-Hanson shows off her pert bottom in a colourful bikini during holiday to Greece\n\nCall The Midwife star hints there's 'so much change' in the upcoming 15th series of the hit drama - after BBC bosses hit back at axe rumours\n\nHollywood conservative Tim Allen includes 'somber prayer' for slain Charlie Kirk's family in 9/11 tribute post\n\nLorraine Kelly takes a swipe at Elizabeth Hurley's jaw-dropping NTAs outfit\n\nLove Island's Molly Marsh breaks her silence on 'emotional, challenging and deeply personal' split from boyfriend Zachariah Noble\n\nJennifer Aniston enjoys night out with boyfriend Jim Curtis at members-only club as romance continues to heat up\n\nSonja Morgan, 61, reveals heartbreaking end to romance with 'The Viking' after nearly two years of dating\n\nJodie Whittaker and Suranne Jones transform into criminal masterminds in first trailer for ITV heist drama Frauds\n\nThese 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal)\n\nVictoria Beckham's documentary announcement spawns viral throwbacks to career highs... including her off-shore website, Spice World, a Secret Rose Tattoo and Dane Bowers\n\nShaun White and Nina Dobrev call off engagement after five years together\n\nMatt Dillon, 61, leaves fans speechless with his age-defying good looks\n\nGary Lineker tipped to appear on I'm A Celebrity after NTAs win that broke Ant and Dec's 23-year victory streak\n\nBruce Willis' wife reveals how she told young daughters their father couldn't live at home anymore\n\nErin Doherty is almost unrecognisable as she sports blunt blonde wig, blue eyeshadow and 70s style dress as she's spotted filming new BBC drama California Avenue for the first time\n\nKate's grey suit may look a bit staid, says LAURA CRAIK, but the detail you might have missed sends a clear message to Harry and Meghan after Duke's reunion with the King \n\nMargot Robbie displays her jaw-dropping figure in racy pink bra as she joins co-star Colin Farrell at London photocall for A Big Bold Beautiful Journey\n\nMadonna's daughter Lourdes, 28, looks exhausted while exiting NYC club as sheer dress almost falls off her\n\nThomas Skinner reveals his exact five-figure salary for Strictly after moaning he's paid less than other celebrities as bookies make surprise change to his odds \n\nDavinia Taylor reveals her intense daily routine that's turned back the clock after her hell-raising days\n\nShirtless Yungblud returns to the stage after sparking concern with his bizarre appearance with Aerosmith at the MTV Video Music Awards\n\nInsiders reveal Olivia Wilde's response to ex Harry Styles dating her good friend Zoe Kravitz\n\nThe Summer I Turned Pretty fans are convinced they know what happens in the final episode after Belly's HUGE seven word clue in latest installment\n\nAntiques Roadshow guest left stunned after learning the value of macabre item bought for pounds at a flea market\n\nSam Thompson and ex Samie Elishi sneak out for a cigarette at the NTAs as pair enjoy another cosy chat after their romance 'fizzled out'\n\nBillie Piper puts on a stylish display as she fronts Russell & Bromley's first celebrity campaign in its 145-year history\n\nInside Britney Spears' 'very fragile' bond with mom as dad remains cut off... three years after conservatorship\n\nKing Charles is set to reunite with his grandchildren Archie and Lilibet after 3 years following reconciliation talks with Prince Harry\n\nHugh Bonneville says final Downton Abbey movie is a 'de facto tribute to Dame Maggie Smith' as he gushes her presence loomed over the film \n\nAll Creatures Great and Small finally confirms season 6 date - with beloved drama set for return in DAYS\n\nMyleene Klass sports a dramatic curly hairdo as she struts out of Smooth Radio studios\n\nLaura Carmichael and Michael C. Fox are married! Downton Abbey stars tie the knot in secret and admit they 'owe a lot' to the ITV show\n\nBillie Piper looks chic in a black faux-fur jacket as she works the phones alongside pal Lily James at the BGC Group Charity Day in London\n\nRadiohead fans left 'devastated' as they miss out on tickets to band's first tour in seven years as glaring issue with presale is revealed\n\nSoap legend Rita Simons confirms she's quit Hollyoaks and teases explosive final scenes in emotional post\n\nMolly-Mae Hague breaks silence on NTA backlash after being criticised for beating 'more powerful and inspirational' nominees\n\nJeremy Clarkson appears to make a dig at Stacey Solomon after beating her at the National Television Awards\n\nRhian Sugden shows off the results of her breast reduction surgery in a plunging animal print swimsuit as she celebrates her 39th birthday in Spain\n\nLoose Women stars boycott NTAs after losing out to rivals This Morning for years amid looming budget cuts\n\nTaylor Swift, 35, set to break major music milestone held by Madonna, 67, ahead of her twelfth studio album release next month\n\nKim Kardashian's bestie Jonathan Cheban cheats on her with her ex-pal Larsa Pippen as 'feud' hits 5 year mark\n\nGame Of Thrones creators cast Matthew Macfadyen in upcoming Netflix historical drama\n\nGolden girls of TV! Holly Willoughby does her bit for charity as she joins Davina McCall and Amanda Holden at star-studded annual BGC Group Charity Day\n\nCelebrity farmer Jimmy Doherty is 'absolutely heartbroken' as polar bear dies during dental operation at his wildlife park\n\nFans are furious as beloved BBC series comeback is axed after news of highly-anticipated reboot\n\nYorkshire Shepherdess Amanda Owen details bizarre recent argument she had with ex husband Clive as she opens up about co-parenting\n\nAnt and Dec break their silence after ending 23 YEAR Best Presenter NTA winning streak... as they congratulate 'thoroughly-deserving' victor Gary Lineker\n\nNeighbours star Madeleine West reveals gruesome injury after leech attack during bushwalk\n\nNetflix reveals glittering line-up for upcoming drama based on 'completely absorbing' Marian Keyes novel - as Line Of Duty's Adrian Dunbar leads stellar cast\n\nThe NTAs no-shows: Why TV's biggest stars including Claudia Winkleman, Holly Willoughby and Ant and Dec snubbed the award's 30th anniversary\n\nJimmy Kimmel reacts to assassination of Charlie Kirk: 'No finger pointing please'\n\nWhoopi Goldberg begs public to stop 'politicizing' Ukrainian immigrant Iryna Zarutska's murder\n\nNTAs stars head home! Maura Higgins lets loose as she leaves solo after awkward reunion with Danny Jones following THAT kiss as takeaway-wielding Lucy Fallon joins Josie Gibson\n\nHarry Potter fans go wild as Keira Knightley is cast to voice Hogwarts' most reviled villain in audiobook series - as devotees laud 'absolutely magical' all-star line-up\n\nSaoirse Ronan gives birth! Little Women star and husband Jack Lowden welcome their first child\n\nThe moment 'devastated' Sam Faiers discovers her cleaner has been stealing from her after noticing her nan's engagement ring had gone missing\n\nPete Wicks left red-faced as Clarkson's Farm star Kaleb Cooper makes cheeky dig during NTAs red carpet interview\n\nPrince Harry promised King Charles that details of their first meeting in 19 months would remain private - because he is determined to 'rebuild their relationship'\n\nPrincess of Wales will join US First Lady Melania Trump during Donald Trump's state visit to the UK - and the US President will go to the late Queen's grave\n\nCancer survivor Amy Dowden reacts to Molly-Mae Hague beating her and the late motor neurone disease sufferer Rob Burrow in NTA's documentary category \n\nKate dons apron and ties her hair back to try her hand at a silk-screen press - as she praises 'craftsmanship' of British textile firms during visit\n\nPrince Harry 'has loved' being back in the UK: Duke prepares to fly home to Meghan in Montecito after reconciling with King Charles\n\n'I'm interested to see if the audience spot them!': Strictly Come Dancing's Shirley Ballas reveals new series will feature several changes\n\nOasis fan who died when he fell from height at one of the band's Wembley dates suffered 'multiple body injuries', inquest told\n\nRuth Jones oozes glamour in a purple sequin gown at the NTAs in her first appearance since her split from ex-husband David Peet\n\nGillian Taylforth, 70, leaves fans in shock with her incredibly youthful looks at NTAs - as they marvel at the star playing Ian Beale's MUM\n\nReal Housewives Of Cheshire's Tanya Bardsley undergoes surgery in hospital and is forced to miss NTAs after agonising health battle\n\nInside Married At First Sight star's wild transformation from a clean cut reality TV figure to a reclusive cattle farmer - after his sudden death at 47\n\nStephen Colbert reacts to fatal shooting of right-wing firebrand Charlie Kirk\n\nAndy Carroll is a loser and Lou can do better - but she's absolutely obsessed with him: Lou Teasdale's friends tell KATIE HIND \n\nLauren Sánchez oozes glamour in a sheer black skirt as she joins ab-flashing Gracie Abrams at Chanel book launch event in New York\n\nOprah Winfrey, 71, displays her youthful looks at the Ralph Lauren spring show in NYC amid dramatic weight loss journey\n\nMarried At First Sight's Susie Bradley and her husband Todd Carney announce they're expecting their second child\n\n'Nostalgic' new drama inspired by hit 2000s show is trending in the UK - as fans rave 'it's exactly what's missing on TV nowadays'\n\nKirstie Allsopp is left in tears as couple manage to buy 'gorgeous' £280,000 home in sought-after area on Location Location Location \n\nGary Lineker BEATS Ant and Dec for Best Presenter gong at the NTAs in shock win - as Strictly and This Morning also win big\n\nThe cup of tea at Clarence House that could change everything: Prince Harry's meeting with King Charles is the first tentative step on the road to reconciliation\n\nNicholas Lyndhurst honours late son Archie's memory by relaunching his streetwear fashion range - five years after his sudden death aged 19\n\nAlice Evans admits she's living through some 'dark times' since her brother's 'unexpected death' as she discusses his passing for the first time\n\nNetflix fans cannot wait for upcoming crime thriller starring Ben Affleck and Matt Damon - as first trailer draws praise for 'epic cast'\n\nCharlie Sheen had gay sex on crack and did so much cocaine a Mexican cartel refused to sell to him... just two of his stunning confessions: TOM LEONARD\n\nNaomi Watts suffers a major wardrobe malfunction in VERY revealing outfit at swanky New York Fashion Week\n\nNational Television Awards 2025 worst dressed stars revealed: Tasha Ghouri, Olivia Hawkins, and Brooke Vincent lead the red carpet fashion flops\n\nMarried At First Sight and Farmer Wants A Wife star Lachlan Rofe dies suddenly at 47\n\nJeremy Clarkson's partner Lisa Hogan rushes to pull up his trousers as they fall down after two stone Mounjaro weight loss\n\nOur exclusive audio of the moment Thomas Skinner stormed out of the Strictly press launch: GRANT TUCKER had a ringside seat\n\nIs Molly-Mae trying to be the next Meghan? Influencer's 'strategic' transformation is turning her into a 'royal-adjacent socialite', expert reveals\n\nMoment Prince Harry scolds Invictus Games reception guests after saying they were 'probably hammered' \n\nCould an engagement be on the cards for Harry Styles and Zoë Kravitz? Actress attends celeb diamond expert's dazzling event - days after singer met her dad\n\nMarried At First Sight CLEARED by watchdog over 'door punching' incident - despite 50 furious complaints about domestic violence portrayal\n\nElizabeth Hurley, 60, puts on a jaw-dropping display in sheer dress with plunging neckline as she's joined by boyfriend Billy Ray Cyrus and son Damian for NTAs\n\nGavin and Stacey's chaotic NTAs as show villain goes barefoot before Ruth Jones channels Nessa and declares she'll celebrate with a 'pint of wine'\n\nCat Deeley looks incredible in emerald dress as she, Maura Higgins and Olivia Attwood lead the stars on the red carpet at the National Television Awards\n\nRarely seen 90s movie icon, 72, is unrecognisable as he makes a low key arrival in Sydney\n\nStacey Solomon suffers another awards show blow as she misses out on THREE NTAs - after complaining both of her shows were nominated in the same category\n\nMolly-Mae Hague leaves NTAs viewers 'fuming' as she beats favourite Rob Burrow to win major gong\n\nDavina McCall parties the night away as she shares behind the scenes selfies from the NTAs with Maya Jama and Gary Lineker\n\nJennifer Aniston, 56, puts on VERY leggy show in racy black mini dress as she promotes The Morning Show in NYC\n\nCameron Diaz, 53, is a doting mom to daughter Raddix, 5, in rare public sighting\n\nJustin Bieber bizarrely goes for a Segway ride in nothing but his UNDERWEAR\n\nKourtney Kardashian gives rare glimpse of son Rocky's face on tour with husband Travis Barker\n\nDermot O'Leary acknowledges the scandals that have rocked This Morning for the past two years in NTAs speech and says colleagues have been put 'through the mill'\n\nNational Television Awards viewers react to VERY awkward moment Maura Higgins and Danny Jones reunite on stage to collect gong six months after Brits kiss\n\nOwen Cooper paves the way for a record-breaking Emmy win as he scores NTA for his performance in Adolescence \n\nGregg Wallace 'rejected by I'm A Celebrity after his decision to sue BBC over his sacking from MasterChef'\n\nGary Lineker takes aim at the BBC as he wins major gong at the NTAs and declares 'this demonstrates that it's ok to speak up for those who have no voice'\n\nAlison Hammond says 'the natural order has been restored' as This Morning wins National Television Award after being 'humbled' by missing out the last two years\n\nMaya Jama oozes glamour in a £4,500 vintage lace and ostrich feather gown as she graces the red carpet at the National Television Awards\n\nDemi Moore cradles her beloved pup as she arrives at NY's JFK Airport after candid remarks on ex Bruce Willis' dementia decline\n\nEastEnders star Steve McFadden tears up as he scoops first ever National Television Award for hard-hitting Phil Mitchell depression storyline\n\nLila Moss cuts a chic figure in a chocolate brown maxi dress as she joins Paris Jackson at glitzy Desigual bash in Barcelona\n\nMichelle Collins wows in plunging black gown as she joins EastEnders co-stars Jessie Wallace, Gillian Taylforth, Diane Parish, and Harriet Thorpe at the NTAs\n\nChanning Tatum, 45, and Inka Williams, 26, make their red carpet debut as a couple following his heartfelt birthday tribute\n\nJerry Seinfeld compares Free Palestine movement to the Ku Klux Klan\n\nJennifer Lopez slips into stylish suit for LA screening of Kiss Of The Spider Woman amid Oscar buzz\n\nIce Spice reveals the advice she got from Taylor Swift that she 'always thinks about'\n\nKanye West's teen documentarian breaks silence on REAL reason he filmed rapper's explosive downfall\n\nRob Rinder can't take his eyes off his The Inheritance co-star Elizabeth Hurley as she puts on a very busty display in plunging gown at the NTAs\n\nCheska Hull's wholesome new life in Thailand: Original Made in Chelsea star has moved 5,800 miles with her son after admitting she 'lost her life' because of the show\n\nStrictly Come Dancing wins Talent Show gong at the National Television Awards after string of scandals\n\nJeremy Clarkson fires back at accusations the Cotswolds has been 'ruined' by A-listers as Beyonce and Jay-Z 'buy spectacular rural estate'\n\nMaura Higgins wows in leather cut-out gown at NTAs before a very awkward onstage reunion with Danny Jones\n\nSophie Turner puts on a united display with boyfriend Peregrine Pearson as they squash split rumours after claims she joined celeb dating app Raya\n\nSelena Gomez poses in her underwear while at a NYC hotel as she makes extra flirty post before wedding\n\nCHRISTOPHER STEVENS reviews The Rumour: Emily Atack's spiteful school mum ought to have been in Motherland\n\nStacey Solomon complains it's 'absolutely ludicrous' both her TV shows are nominated in the same category at the National Television Awards after being 'robbed' of BAFTA\n\nRICHARD EDEN: Why lawless London is now a no-go zone for socialite Caroline Stanbury\n\nChris Pratt leads the Hollywood stars reacting to Charlie Kirk shooting: 'God help us'\n\nMystery as Cat Deeley wears ring on wedding finger for NTAs red carpet - two months after announcing her split from husband Patrick Kielty\n\nDavina McCall puts on a very leggy display in a sparkly gold mini dress as she larks about with fans on the National Television Awards red carpet\n\nMolly Smith stuns in a diamond-embellished crop top as she shows off her new engagement ring alongside fiancé Tom Clare at the National Television Awards\n\nPrince Harry's 55-minute summit with the King: Duke reunites with his father for the first time in 18 months... but after a cup of tea it's over in less than an HOUR\n\nJennifer Aniston stuns in plunging purple dress after being supported by boyfriend Jim Curtis at premiere\n\nBobby Brazier breaks his silence on brother Freddy's baby news as he insists he and dad Jeff will help raise the child despite family rift\n\nNational TV Awards viewers fume over 'abysmal' ad breaks as ITV airs just ONE gong before cutting to the commercials\n\nStacey Solomon stuns in a slinky black dress as she arrives hand-in-hand with her daughters Rose, 3, and Belle, 2, at the National Television Awards\n\nHolly Ramsay flaunts her toned figure in skimpy white lingerie and flashes dazzling yellow diamond ring as she marks one-year anniversary of engagement \n\nOlivia Attwood makes solo arrival at NTAs without husband Bradley Dack as she reunites with Pete Wicks on the red carpet - after admitting her marriage is 'a work in progress' \n\nBad Bunny says ICE fears kept him from touring United States\n\nThis Oscar-nominated actress, 68, will soon reunite with her ex in Spain for their daughter's wedding, can you guess who?\n\nPrincess Andre, 18, dazzles in sequined evening gown for first solo NTAs red carpet as she's supported by big brother Junior, 20\n\nColeen Rooney looks chic in a fitted gown at the National Television Awards as I'm a Celebrity... Get Me Out of Here! is nominated for a gong\n\nMamma Mia! star Georgina Castle marries West End actor in stunning ceremony - with her famous father Andrew walking her down the aisle\n\nAlison Steadman reunites with Gavin and Stacey co-star Larry Lamb at the National Television Awards\n\nDenise Richards reveals she made 'white trash sandwiches' for Charlie Sheen's sex workers after drug-fueled parties\n\nFresh Prince star gives update on Will Smith reconciliation amid $1M payout rumors after bitter decades-long feud\n\nEd Sheeran touches down in New York as he 'sets the record straight' on his plans to move to US\n\nKathy Bates models slimmed down physique as she sends defiant message to weight loss cynics after Ozempic use\n\nSydney Sweeney and Amanda Seyfried seen in first photos from their thriller about 'secrets and scandal'\n\nReese Witherspoon, 49, shares rare picture with lookalike daughter, 26, as they celebrate a milestone\n\nJulia Roberts, 57, makes rare comments about how she raised her three kids who are all now in college\n\nFormer party boy Charlie Sheen slams Brooke Mueller and tells how Denise Richards 'discarded' him in fiery memoir revelations\n\nGraham Norton confirms the fate of his hit chat show after he sparked concern putting both his homes up for sale ahead of a 'big change'\n\nMyleene Klass snaps at Loose Women co-star Coleen Nolan in awkward spat live on air\n\nVictoria Beckham doc FIRST LOOK: Star flashes her diamonds in artwork for new Netflix show as release date is announced and son Brooklyn WILL appear\n\nFormer GB News anchor Isabel Webster reveals incredible weight loss and 'divisive' reason why she left channel and her co-host Eamonn Holmes as she launches podcast\n\nFour Weddings And A Funeral vet Andie MacDowell, 67, says she is sick of trying to 'look young'\n\nThomas Skinner tries to gloss over THAT Strictly meltdown as he shares cheesy photo from the stylist's chair after issuing apology over his behaviour\n\nMystery behind Sheridan Smith and Charley Webb's 'fall out' as they unfollow each other after 'intense' friendship saw them move in together\n\nRobocop and Dick Tracy star dead at 81 as tributes pour in\n\nBen Affleck and BFF Matt Damon sport matching beards for new movie... 28 years after Good Will Hunting\n\nBrad Pitt caught in awkward faux pas as he returns to Cliff Booth role in Once Upon A Time In Hollywood sequel\n\nStar of iconic 70s sitcom Alice dies at 88\n\nNewlyweds Patrick Schwarzenegger and Abby Champion get dinner with Maria Shriver after Idaho nuptials\n\nIn defence of Apple Martin! Why Gwyneth's daughter is not your average nepo baby - despite heated backlash over new modelling job\n\nSelena Gomez beams as she says she feels 'very lucky' to marry Benny Blanco... as wedding is 'weeks away'\n\nChanning Tatum brings daughter, 12, he shares with ex Jenna Dewan to premiere on rare public outing\n\nBack to top\n\nVideo Archive\n\nTopics Index\n\nText-based site\nReader Prints\nTop of page\n\nPublished by Associated Newspapers Ltd\n\nHow to complain\nLeadership Team\nAdvertise with us\nWork with Us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout Daily Mail\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"Ben Wadey, the new executive producer of the show, has teased details of the eagerly-awaited episode and assured fans that bosses have 'bought their A-game'.","url":"https://www.dailymail.co.uk/tv/article-15090345/EastEnders-Christmas-special-soap-Branning-Slater.html","image":"https://i.dailymail.co.uk/1s/2025/09/11/23/102064649-0-image-a-70_1757631488293.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/02/8630140660530105826/1024x576_MP4_8630140660530105826.mp4","publish_date":"2025-09-11 23:47:00","author":"Editor,Laura Parkin","authors":["Editor","Laura Parkin"],"language":"en","source_country":"gb","sentiment":0.381},{"id":359716518,"title":"Donald Trump Visits Yankee Stadium On 9/11 Anniversary, Pumps Up Players W/ Speech","text":"\"You think that was easy sitting with him for a game? It wasn't. It was brutal. You were exhausted at the end, but he won and you're gonna win, you're gonna go all the way and you'll get in the playoff and I think you're gonna,\" POTUS said before pumping the brakes.","summary":"Donald Trump just arrived at Yankee Stadium in the Bronx, and despite being in town to commemorate the anniversary of the September 11th attacks, POTUS still found an opportunity to deliver a rousing pump-up speech to the players! 47, just a day&hellip;","url":"https://www.tmz.com/2025/09/11/donald-trump-yankee-stadium-charlie-kirk/","image":"https://imagez.tmz.com/image/9a/4by3/2025/09/11/9afb873de05d45dfae484a5d7b75d936_xl.jpg","video":null,"publish_date":"2025-09-11 23:46:37","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","category":"politics","source_country":"US","sentiment":0.053},{"id":359714350,"title":"Comment on Modi turns to Asia amid US tariff strain by rental mobil cirebon","text":"NEW DELHI: Indian Prime Minister Narendra Modi headed overseas on Thursday to meet the leaders of China, Japan and Russia, seeking to build closer diplomatic ties as New Delhi battles fallout from US President Donald Trump’s escalating tariff offensive.\n\nBy drawing nearer to some of the world’s largest economies, including his first visit to China in seven years, Modi hopes to to boost support for his flagship “Make in India” initiative, mainly from Japan, as Trump’s measures spur new partnerships.\n\n“This will be an opportunity to launch several new initiatives to build greater resilience in the relationship, and to respond to emerging opportunities and challenges,” Foreign Secretary Vikram Misri said of the Japan visit.\n\nWhile New Delhi says it is relying on talks to resolve Trump’s additional tariffs of up to 50% on Indian exports, Japan’s top trade negotiator cancelled a US visit over a snag in the two nation’s tariff deal.\n\nRyosei Akazawa was due to fly to Washington to craft a written confirmation of the terms of the package, such as the split of investment returns between US and Japan but canceled last minute on Thursday.\n\nModi’s visit to Japan slated for Friday and Saturday gains significance as both belong to the Quad grouping, along with Australia and the United States, which seeks to counter China’s growing influence in the Indo-Pacific region.\n\nThe Quad, officially the Quadrilateral Security Dialogue, is a group of four countries: United States, Australia, India, and Japan that ensures and sustain an open, free and prosperous Indo-Pacific region\n\nDespite strained ties with Washington, India said Modi and Japanese Prime Minister Shigeru Ishiba would discuss expanding cooperation within the framework of the regional security grouping.\n\nJapanese companies are set to invest up to 10 trillion yen ($68 billion) in India in the next decade, public broadcaster NHK said, as Suzuki Motor pledged to pump in about $8 billion over the next five to six years.\n\nThe two nations were partners ‘made for each other’ Modi said this week, after visiting a Suzuki plant in India.\n\nTheir leaders are expected to discuss tie-ups on critical minerals and Japanese investments in high-value manufacturing in India, officials said.\n\nIndia is believed to hold substantial deposits of rare earths, used in everything from smartphones to solar panels, but lacks the technology to mine and process them extensively.\n\nIndia, China rapproachement\n\nModi next travels to China for a two-day summit of regional security bloc Shanghai Cooperation Organisation from Sunday. His visit comes as the neighbours strive to defuse tension following deadly border clashes in 2020.\n\nHe is expected to meet both Chinese President Xi Jinping and Russian President Vladimir Putin for two-way talks.\n\nChina and India seek to resume direct flights after a gap of five years and are discussing easing trade barriers, including reopening border trade at three Himalayan crossings.\n\nIndia is also considering easing investment rules that put greater scrutiny on Chinese companies, while Beijing recently agreed to lift curbs on exports of fertilisers, rare earth minerals and tunnel boring machines to India.\n\nThe meeting comes against the backdrop of Washington’s long-held desire for the world’s largest democracy to act as a counterweight to China, which analysts say could offer New Delhi leverage in the effort to secure lower tariffs.","summary":"Appreciate it for helping out, great info .","url":"https://www.pakistantoday.com.pk/2025/08/28/modi-turns-to-asia-amid-us-tariff-strain/","image":"https://www.pakistantoday.com.pk/wp-content/uploads/2024/07/MODI-HATE-SPEECH-696x464.jpg","video":null,"publish_date":"2025-09-11 23:45:55","author":"Agencies,rental mobil cirebon","authors":["Agencies","rental mobil cirebon"],"language":"en","source_country":"pk","sentiment":0.2},{"id":359725014,"title":"Hamas dakwa AS 'bersekongkol' dalam serangan Israel di Qatar","text":"DOHA: Hamas menuduh Amerika Syarikat (AS) bersekongkol dalam serangan maut Israel ke atas perundingnya di Qatar dan mengecam Israel kerana cuba gagalkan rundingan gencatan senjata Gaza ketika Doha mengebumikan mangsa.\n\nSerangan Israel pada Selasa, yang belum pernah berlaku sebelum ini di sebuah negara Teluk, mencetuskan kejutan di rantau yang sekian lama tersisih daripada konflik, sekali gus menghentikan rundingan Gaza yang sudah pun tergendala.\n\n\"Tindakan jenayah ini adalah... satu pembunuhan terhadap keseluruhan proses rundingan serta serangan disengajakan terhadap peranan saudara-saudara kami sebagai pengantara di Qatar dan Mesir,\" kata pegawai Hamas, Fawzi Barhoum dalam kenyataan disiarkan televisyen.\n\nDi Doha, kawalan keselamatan ketat dipasang di sekitar masjid tempat solat jenazah diadakan dengan pemerintah negara Teluk itu turut menyertai pengiring.\n\nSiaran langsung televisyen Qatar menunjukkan sebuah keranda berbalut bendera Qatar dan lima lagi berbalut bendera Palestin dibawa masuk ke dalam masjid.\n\nMenghadap keranda, Emir Qatar, Sheikh Tamim bin Hamad Al Thani, menunaikan solat bersama puluhan hadirin, ada yang memakai jubah putih tradisional manakala sebahagian lain berpakaian seragam tentera.\n\nJenazah kemudian dikebumikan di Tanah Perkuburan Mesaimeer selepas upacara di Masjid Sheikh Mohammed bin Abdul Wahhab. \n\nPihak berkuasa turut memperketat kawalan dengan mengadakan sekatan jalan menuju ke masjid berkenaan.\n\nBarhoum menuduh Washington sebagai 'bersekongkol sepenuhnya' dalam serangan Israel itu.\n\nBagaimanapun, Rumah Putih berkata Presiden AS, Donald Trump, tidak bersetuju dengan tindakan ketenteraan Israel. \n\nBeliau mendakwa tidak dimaklumkan lebih awal dan apabila mengetahui, beliau mengarahkan utusannya Steve Witkoff memberi amaran segera kepada Qatar, namun serangan sudah bermula.\n\nIsrael menegaskan sasarannya adalah pemimpin Hamas tetapi kumpulan itu berkata pegawai kanan mereka terselamat. \n\nHamas memaklumkan lima anggotanya terbunuh iaitu anak kepada ketua perunding Khalil al-Hayya, Hamam; pengarah pejabatnya, Jihad Labad serta pengawal peribadi Ahmad Mamlouk, Abdallah Abdelwahd dan Mumen Hassoun.\n\nSeorang anggota tentera Qatar berpangkat Lans Koperal, Badr Saad Mohammed al-Humaidi al-Dosari, turut terbunuh.\n\nBarhoum berkata isteri Hayya, menantu serta cucu-cucunya cedera dalam serangan ke atas kediaman beliau.\n\nDalam temu bual bersama CNN kelmarin, Perdana Menteri Qatar Sheikh Mohammed bin Abdulrahman Al Thani berkata beliau tidak dapat mengesahkan keadaan Hayya. \n\nKetua perunding Hamas itu juga tidak kelihatan pada upacara pengebumian dalam rakaman yang diperoleh AFP.\n\nGambar yang dikongsi di saluran Telegram Hamas menunjukkan tokoh kanan Osama Hamdan hadir pada pengebumian bersama ahli biro politik, Izzat al-Rishq. Satu kenyataan kumpulan itu menyebut beberapa pemimpin Hamas lain turut hadir.\n\nSheikh Mohammed berkata serangan Israel itu memusnahkan sebarang harapan untuk membebaskan tebusan Israel di Gaza, sambil menegaskan Qatar kini menilai semula 'semua perkara' berkaitan peranannya sebagai pengantara rundingan gencatan senjata. - AFP","summary":"DOHA: Hamas menuduh Amerika Syarikat (AS) bersekongkol dalam serangan maut Israel ke atas perundingnya di Qatar dan mengecam Israel kerana cuba gagalkan rundingan gencatan senjata Gaza ketika Doha mengebumikan mangsa.","url":"https://www.bharian.com.my/dunia/asia/2025/09/1445173/hamas-dakwa-bersekongkol-dalam-serangan-israel-di-qatar","image":"https://assets.bharian.com.my/images/articles/bh12kutu-o_BHfield_image_listing_featured.var_1757634308.jpg","video":null,"publish_date":"2025-09-11 23:45:17","author":null,"language":"en","category":"politics","source_country":"my","sentiment":-0.78},{"id":359722706,"title":"Trump draws cheers, boos while marking 9/11 by attending New York Yankees game","text":"New York, Sep 12 (AP) President Donald Trump attended the New York Yankees game on Thursday night, drawing a mixed reaction while marking the 24th anniversary of the September 11 attacks, after honouring the memories of the victims at the Pentagon earlier in the day.\n Authorities installed security glass outside an upper level suite on the third base side, over the visiting Detroit Tigers dugout, for the president. During the National Anthem, Trump was shown on the stadium jumbotron and received boos from some in the crowd, cheers from others.\n Moments earlier, as he first took his seat, the president briefly waved to the crowd and flashed a thumb’s up — but not all fans noticed because there was no announcement he was arriving.\n The stadium also briefly played Trump’s unofficial campaign anthem, “God Bless the USA,” but to little reaction. There were chants of “USA! USA! USA!” but they were more related to marking September 11 than Trump’s attending the game.\n All that followed Trump stopping by the home team’s clubhouse about 15 minutes before the game. He shook hands with the players and team staff members, and talked about being close for years with late Yankees owner George Steinbrenner, calling him “a great friend of mine, the whole family.” Trump predicted the Yankees would win, noting of his past attending games with Steinbrenner, “We won every time I came.” “You think that was easy sitting with him for a game? It wasn’t. It was brutal. But he won, and you’re going to win,” the president said.\n He later added: “You’re going to go all the way, and you’ll get in the playoff — and I think we’ll start off, how about tonight? We’ll start from tonight on, and you’re going to do well.” The Tigers beat the Yankees during the first two games of the series Tuesday and Wednesday by a combined score of 23-3.\n Trump said he wanted to “wish you guys a lot of luck. You’re great players, I know, every one of you.” He also recalled that the Yankees’ archrival, the Boston Red Sox, had visited him in the Oval Office earlier this summer and then went on a long winning streak.\n Manager Aaron Boone said before Trump’s arrival that Yankees leftfielder Anthony Volpe had quietly been playing with a partial labrum tear in his left shoulder. As he greeted him, Trump patted him softly on the shoulder.\n “It’s something that I’m excited to be a part of,” Boone said of Trump being on-hand.\n A presidential visit always prompts extra security at sporting events, but things were heightened after conservative activist and close Trump ally Charlie Kirk was assassinated in Utah on Wednesday. When Trump attended the September 11 observance ceremony at the Pentagon earlier Thursday, authorities moved the ceremony inside as an added precaution.\n Trump’s attendance recalled President George W. Bush’s ceremonial first pitch 24 years earlier as the Yankees played the Arizona Diamondbacks in the 2001 World Series — a moment that came to symbolise national resilience after the attacks mere weeks earlier.\n Since the attacks, the Yankees and their fans have marked September 11 during the seventh-inning stretch by singing “God Bless America” in addition to the traditional “Take Me Out to the Ballgame,” and they were doing so again Thursday. They also held a moment of silence before the first pitch.\n Security at the stadium was tight, with entrance featuring metal detectors and Secret Service agents, some with sniffer dogs, while New York Police Department helicopters thundered overhead.\n Stadium authorities opened the gates three hours before the first pitch, and long lines began forming even before that, though most of the crowd appeared to be moving into the stadium smoothly. The Yankees said ticketholders were “strongly urged to arrive as early as possible.” The Secret Service said extra time would likely be needed to enter the game and asked fans to consider leaving their bags at home.\n Trump’s attendance at the US Open men’s final in Queens last weekend sparked security lines long enough that some fans didn’t make it to their seats until more than an hour into the match, despite organisers delaying its start by 30 minutes.\n The game is Trump’s eighth major sporting event since returning to the White House in January.\n The large American flag behind the left field bleachers and the smaller flags for each of baseball’s 30 teams that ring the stadium’s upper level were lowered to half-staff after Trump issued an executive order honouring Kirk. Before Wednesday’s game, the Yankees held a moment of silence for Kirk and flashed his picture on their stadium’s big screen. (AP) GRS GRS","summary":"","url":"https://www.news18.com/agency-feeds/trump-draws-cheers-boos-while-marking-9-11-by-attending-new-york-yankees-game-9566559.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-09-11 23:45:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.2},{"id":359724200,"title":"He was the Trump whisperer. Now, in their own deeply moving words, the president's family opens up to the Daily Mail about their 'boy wonder' Charlie Kirk","text":"He was known affectionately as 'the Trump whisperer' for his closeness to the President and a regular and always welcome visitor to the White House and Mar-a-Lago.\n\nSo, it comes as little surprise that the brutal assassination of Charlie Kirk has led to a deep sense of grief within the First Family, according to insiders. They regarded him as one of their own.\n\nIndeed, one insider said that President Trump viewed Kirk as an 'adopted' son alongside his five children - Don Jr., Ivanka, Eric, Tiffany and Barron.\n\nIn the wake of Wednesday's tragedy, the shock has been clearly etched on the President's face during public appearances, and he was visibly upset when talking about Kirk at the 9/11 memorial service at the Pentagon on Thursday.\n\nWhile Kirk had millions of followers on social media, insiders say that few will have known quite how close the young conservative activist was to the President of the United States, and his children, behind the scenes.\n\nThey say that the relationship between Kirk and the Trumps cut across the usual transactional nature of politics. It was a personal and heartfelt bond, a genuine friendship that transcended the frequently ugly business of Washington power play, according to those familiar with both parties.\n\nDespite their age difference Kirk, 31, was described by friends as an 'old soul' who connected with the 79-year-old president.\n\nOne friend of the First Family told the Daily Mail: 'Our hearts are broken.'\n\nOthers close to the Trumps described Kirk as the 'absolute best of us' and 'a great friend to us all.'\n\n'I know that the president felt very close to Charlie, he was like family,' said House Speaker Mike Johnson.\n\nIn a tribute shared with the Daily Mail, Eric Trump said: 'Mar-a-Lago was always such a special place for Charlie Kirk. He will be so sorely and forever missed.' \n\nPerhaps the closest member of the First Family to Kirk, even more so than the president, was Donald Trump Jr.\n\nThe friendship between the two men went back years. In the early days of MAGA, they would campaign together on college campuses and face down hostile political audiences.\n\nThey had been in the political trenches together on the road and in the bearpit of social media.\n\nAt 47, Don Jr. was 16 years older, but he saw in Kirk a young man of great conviction who would carry the MAGA torch in the future. \n\nDon Jr.'s grief was clear in a tribute he wrote to a man he regarded as a sibling. \n\n'I love you brother,' the president's eldest son wrote on X. 'This isn't my strong suit and I don't even know how to begin to put into words the loss I am feeling right now. \n\n'Charlie wasn't just a friend - he was like a little brother to me - and to millions of people around the world - he was a true inspiration. He was one of the most courageous, principled men I've ever known.'\n\nKimberly Guilfoyle, Don Jr.'s former fiancée, was witness to the beginning of his relationship with his wife-to-be Erika Frantzve, a former Miss Arizona USA winner. The couple went on to have two young children, a daughter, now 3, and one-year-old son. Erika is currently studying for a doctorate in Biblical studies at Liberty University. \n\nGuilfoyle told the Daily Mail: 'I actually remember being with Charlie the day of his first date with Erika and seeing their relationship build and blossom since then was so profound and powerful.\n\n'He was so excited and nervous, which was cute to see. And looking back, it's clear he was really excited about that next chapter and to be such a devoted father and husband.'\n\nShe added: 'He put faith and family at the center of his mission and his love for my dear friend Erika and their young children was just so beautiful to see.'\n\nLara Trump told the Daily Mail about the time she and Kirk spoke at an event at her alma mater, North Carolina State University, and there were threats protests could get out of control.\n\nWhile she was flying in he texted her saying: 'If you decide it's too crazy and you want to sit this out, totally understand.'\n\n'But it was clear, with or without me, Charlie was going. If he was in, I was in,' the President's daughter-in-law told the Daily Mail. 'He never flinched. The respect I gained for him that day was immense. \n\n'There was never a single time that I asked him for help with something that he didn't reply immediately to let me know that, of course, he would help. Whatever I needed. There will only be one Charlie Kirk, and I'm honored to have called him a friend.'\n\nPolitically, the belief that Kirk, co-founder of youth organization Turning Point USA, changed history by getting young people to vote - and that without him there would be no Trump in the Oval Office for a second term - is a sentiment echoed across the MAGA sphere, and by the President's family.\n\nLara Trump added: 'I believe that Donald Trump probably would not be president right now without the assistance of Charlie Kirk. Charlie, you changed the world - you will be so deeply missed, my friend.' \n\nOne Republican consultant told the Daily Mail the impact Kirk had on young voters was seismic, and something the President was deeply appreciative of.\n\n'He was a tour de force for the conservative movement,' the consultant said. 'He helped make conservatism cool for the youth and showed millions of people how to fight in the battlefield of ideas with the facts and win.'\n\nFirst Lady Melania Trump has also reflected movingly on the devastation of Kirk's death on his family. \n\n'Charlie's children will be raised with stories instead of memories, photographs instead of laughter, and silence where their father's voice should have echoed,' the First Lady said.\n\n'Charlie Kirk's life should serve as a symbolic reminder that compassionate awareness elevates family, love, and country.'\n\nIvanka Trump, meanwhile, shared a photograph of Kirk, Ericka and his two young children together.\n\n'Rest in Peace, Charlie,' she wrote.\n\nTrump's esteem for Kirk is becoming clearer by the day. It was the President who confirmed his death publicly, and he ordered flags at the White House to fly at half-staff until Sunday.\n\nWithin the White House, where Kirk was also known as the 'conservative boy wonder,' there was stunned disbelief. He held no official staff position, but he was a constant presence, including in the Oval Office, and even vetted some of the President's hires.\n\nIt was a meteoric rise which began in 2012 when, at the age of 18, he co-founded Turning Point USA, which now has over 250,000 student members and a presence on 3,500 high school and college campuses\n\nPresident Trump frequently praised his 'tremendous talent' and said he was 'just incredible.'\n\nIn 2020, he was the opening speaker at the Republican National Convention and, after the election defeat, remained close to Trump.\n\nHe then had a huge impact getting out the vote in battleground states. \n\nOn Thursday morning, a clearly moved President Trump announced at the 9/11 ceremony at the Pentagon that he would be awarding Kirk the President Medal of Freedom. \n\n'We miss him greatly,' Trump told the crowd. 'Yet I have no doubt that Charlie's voice and the courage he put into the hearts of countless people, especially young people, will live on.'\n\nAs tributes poured in Bill White, a friend of both Kirk and the Trumps, told the Daily Mail: 'A great light has been dimmed, and I can promise you this we will do great things to honor Charlie and keep his dream alive.'\n\nWhite, who is Trump's ambassador to Belgium, added: 'His life will not have been in vain. You cannot put a light like Charlie's out.'\n\nThose who worked with Kirk said he had changed politics for good by the way he had brought young people into the Republican fold.\n\nTrump 2024 communications advisor Alex Bruesewitz told the Daily Mail he was 'a giant.'\n\n'He was a true patriot whose contributions to our nation and the MAGA movement over the past decade were surpassed only by President Trump.\n\n'We will all miss him dearly but we know his legacy will live for eternity.","summary":"The family of President Donald Trump mourned the assassanation of their 'little brother' Charlie Kirk, after he was shot and killed by an unknown assailant.","url":"https://www.dailymail.co.uk/news/article-15088827/donald-trump-mourns-charlie-kirk.html","image":"https://i.dailymail.co.uk/1s/2025/09/11/18/102053399-0-image-m-20_1757610803830.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/11/6825731016032797917/1024x576_MP4_6825731016032797917.mp4","publish_date":"2025-09-11 23:43:46","author":"Charlie Spiering,Editor,Katelyn Caralle,Laura Collins,Nick Allen,Nikki Schwab","authors":["Charlie Spiering","Editor","Katelyn Caralle","Laura Collins","Nick Allen","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":0.428},{"id":359723460,"title":"US Deficit Climbs to Record $1.97 Trillion Through August Despite Tariff Windfall","text":"The U.S. budget deficit rose to a record $1.973 trillion through August in fiscal year 2025, the Treasury Department said, as tariff revenues surged to historic highs under President Donald Trump’s trade policy.\n\nAccording to the Treasury’s monthly statement released on Sept. 11, the shortfall through the first 11 months of the fiscal year eclipsed the $1.897 trillion gap recorded during the same period in fiscal 2024. With one month left before the fiscal year closes on Sept. 30, the deficit is up $76 billion, or 4 percent, from a year ago, making it the largest year-to-date figure Treasury has ever reported for this point in the calendar.","summary":"The Treasury reported the largest year-to-date shortfall in U.S. history, as Trump's global tariffs generated a record $165 billion in revenues.","url":"https://www.theepochtimes.com/us/us-deficit-climbs-to-record-1-97-trillion-through-august-despite-tariff-windfall-5913776","image":"https://img.theepochtimes.com/assets/uploads/2025/09/07/id5911687-shipping-containers-GettyImages-2228223470-300x180.jpg","video":null,"publish_date":"2025-09-11 23:43:00","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","source_country":"us","sentiment":-0.559},{"id":359722688,"title":"Bolsonaro Sentenced To 27 Years In Prison For Military Coup; Trump Condemns Verdict","text":"Former Brazilian President Jair Bolsonaro was found guilty on Thursday in a landmark Supreme Court case involving a 2022 coup attempt and an assassination plot. The court sentenced Bolsonaro to 27 years in prison, according to reports from the BBC.\nThe ruling followed the decision of four out of five Supreme Court justices who convicted Bolsonaro and seven of his co-defendants, while one justice dissented from the majority opinion. This verdict marks a pivotal moment in Brazil’s recent political and judicial history.\nBolsonaro was convicted of leading a conspiracy aimed at overturning the results of the 2022 presidential election, which he lost to his left-wing opponent, Luiz Inácio Lula da Silva. Prosecutors also charged him with orchestrating an assassination attempt targeting Lula, his vice president Hamilton Mourão, and Supreme Court Justice Alexandre de Moraes. According to investigators, the plot was part of Bolsonaro’s efforts to cling to power despite the democratic vote that favoured Lula.\nThroughout the trial, Bolsonaro remained under house arrest and did not appear in court. He has repeatedly characterised the proceedings as a “witch hunt,” dismissing the charges against him.\nIn reaction to the guilty verdict, his ally and US President Donald Trump expressed surprise, comparing Bolsonaro’s legal challenges to his own experiences. Trump stated, “That’s very much like they tried to do with me. But they didn’t get away with it at all.” He further condemned the conviction as “a terrible thing” and warned that it could have negative consequences for Brazil. When asked about potential new sanctions on Brazil, Trump did not provide a definitive response.\nThe case follows a 2023 decision by Brazil’s electoral court that barred Bolsonaro from running for public office until 2030, after he spread false claims about the integrity of the country’s electronic voting system. The conviction has been praised by Lula’s Institutional Relations Minister, Gleisi Hoffmann, who declared that the ruling “ensures that no one dares again to attack the rule of law or the will of the people as expressed at the ballot box.”\n70-year-old Bolsonaro now faces the prospect of spending the remainder of his life in prison. His legal team is expected to appeal the verdict, arguing that he should remain under house arrest rather than be incarcerated.","summary":"A 2023 decision by Brazil’s electoral court barred Bolsonaro from running for public office until 2030","url":"https://www.news18.com/world/bolsonaro-sentenced-to-27-years-in-prison-for-military-coup-trump-condemns-verdict-ws-l-9566554.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/Untitled-design-16-2025-09-e8ea957fe02c33e17179ba8c460acce4.png","video":null,"publish_date":"2025-09-11 23:42:32","author":"New.storytailors,News18,World Desk","authors":["New.storytailors","News18","World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.722},{"id":359724424,"title":"How Charlie Kirk's Wife Erika Is Coping After His Death","text":"Erika Frantzve Kirk is trying to cope with a painful loss. \n\nOne day after her husband Charlie Kirk was shot dead at age 31 while speaking at an event at Utah Valley University, President Donald Trump shared that he's spoken to Erika about the tragedy and provided an update on how she's feeling. \n\nAs he told reporters on Sept. 11, per CNN journalist Kaitlan Collins, \"She's absolutely devastated.\"\n\nWhile Erika—who shares a 3-year-old daughter and a 15-month-old son whose names have not been publicly revealed with the conservative activist—has been in contact with the POTUS, she has yet to speak publicly on Charlie's fatal shooting, which occurred after a suspect fired a gunshot from a building about 200 yards away from where her partner was speaking at the Orem, Utah, school.\n\nCharlie was taken to a hospital shortly after, a spokesperson for the university told NBC News, but Trump confirmed he had died later that day. (A suspect is not in custody in connection with the attack.)","summary":"Erika Frantzve Kirk is trying to cope with a painful loss. \nOne day after her husband Charlie Kirk was shot dead at age 31 while speaking at an event at Utah Valley University, President Donald...","url":"https://www.eonline.com/news/1422404/update-on-charlie-kirks-wife-erika-after-his-death-donald-trump?cmpid=rss-syndicate-genericrss-us-top_stories","image":"https://akns-images.eonline.com/eol_images/Entire_Site/20250910/20db1594-3664-4792-b4dd-1789a9208b9d_1757537892.jpg?fit=around%7C1200:1200&output-quality=90&crop=1200:1200;center,top","video":null,"publish_date":"2025-09-11 23:41:04","author":"Roy Rochlin","authors":["Roy Rochlin"],"language":"en","source_country":"US","sentiment":-0.796},{"id":359713856,"title":"JD Vance transports Charlie Kirk’s body home in touching tribute to pal who took him from Trump skeptic to champion","text":"Vice President JD Vance personally accompanied Charlie Kirk’s body from Utah back home to Arizona — a touching final tribute in a long friendship that helped launch the former President Trump critic into the White House and onto the international stage.\n\nVance cancelled plans to attend a 9/11 commemoration at Ground Zero in Manhattan at the last minute Thursday, opting instead to travel to Utah with his wife, Usha, aboard Air Force 2 to be with Kirk’s family and friends.\n\nFrom there, the Turning Point USA founder’s remains were loaded onto the vice president’s plane and flown back to Phoenix with Vance at their side.\n\nThe presidential transport is a touching close to a friendship that began around 2017, when Vance was just coming around to Trump after staunch opposition during the 2016 election — a trajectory Kirk had also followed, before becoming one of the president’s loudest champions himself.\n\nIt’s a story Vance recounted in an extensive tribute to Kirk he posted on X Wednesday night, hours after the 31-year-old conservative icon was assassinated while holding one of his public debate events at Utah Valley University.\n\n“A while ago, probably in 2017, I appeared on Tucker Carlson’s Fox show to talk about God knows what. Afterwards a name I barely knew sent me a DM on twitter and told me I did a great job. It was Charlie Kirk,” Vance wrote.\n\n“Charlie was fascinated by ideas and always willing to learn and change his mind. Like me, he was skeptical of Donald Trump in 2016. Like me, he came to see President Trump as the only figure capable of moving American politics away from the globalism that had dominated for our entire lives,” he added.\n\n“When others were right, he learned from them. When he was right–as he usually was–he was generous. With Charlie, the attitude was never, ‘I told you so.’ But: ‘welcome.'”\n\nThe pair became fast friends after that first interaction, with Vance telling how Kirk was one of the first calls he made when he decided to run for Ohio senator in 2021. Vance was skeptical he could win, but said Kirk calmly convinced him there was a way and took the time to talk out strategy.\n\nEven before Vance decided his campaign was serious, Kirk asked him to speak at one of his Turning Point USA events — and afterwards walked the underdog candidate around the room to introduce everybody, and offered feedback on his remarks that day.\n\nStay up to date on the shooting of conservative activist Charlie Kirk\n\nCharlie Kirk shot dead at UVU event\n\nWho is Charlie Kirk? — the young MAGA star behind Turning Point USA\n\nCharlie Kirk shot while answering question about transgender shooters, ex-Utah congressman says\n\nCharlie Kirk assassin picked spot that could allow him to get ‘miles and miles away’ in just minutes: retired FBI agent\n\nCharlie Kirk assassin most likely ‘internet shooter’ who took advantage of low-security spot: elite sharpshooter\n\n“He had no reason to do this, no expectation that I’d go anywhere. I was polling, at that point, well below 5 percent,” Vance, 41, wrote. “He did it because we were friends, and because he was a good man.”\n\nVance and Kirk were around 27 and 37 then — both youngsters by political measure — and their shared youth meant they were well-positioned to reach a younger generation of conservatives. Kirk was already well-known at the time and became instrumental in championing Vance as one of the right’s shining stars.\n\nAnd Kirk was such a believer in the future veep that he even introduced him to Donald Trump Jr. at a time when the president and his family were still deeply skeptical of the bestselling “Hillbilly Elegy” author’s former criticisms.\n\n“Don took a call from me because Charlie asked him too (sic),” Vance wrote.\n\nJust three years later, Vance became the vice presidential nominee, but found his family was having a difficult time adjusting to the extremes of their new way of life — and said Kirk was always there to help him at every turn of the trying campaign trail.\n\n“Our kids, especially our oldest, struggled with the attention and the constant presence of the protective detail. I felt this acute sense of guilt, that I had conscripted my kids into this life without getting their permission,” the former Ohio senator wrote.\n\n“Charlie was constantly calling and texting, checking on our family and offering guidance and prayers,” he continued. “After every event, he would give me a big hug, tell me he was praying for me, and ask me what he could do.”\n\nAfter Vance and Trump finally won the White House, the new vice president took Kirk onstage and personally thanked him for his friendship — a friendship many in the White House and conservative community recognized as a palpable force.\n\n“I was talking to President Trump in the Oval Office today,” Vance continued on X. “And he said, ‘I know he was a very good friend of yours.’ I nodded silently, and President Trump observed that Charlie really loved his family.\n\n“Charlie Kirk was a true friend. The kind of guy you could say something to and know it would always stay with him,” he added. “Charlie died doing what he loved: discussing ideas.”\n\n“He exemplified a foundational virtue of our Republic: the willingness to speak openly and debate ideas.”","summary":"Vance, a close personal friend of Kirk's, escorted the body of the slain activist home.","url":"https://nypost.com/2025/09/11/us-news/jd-vance-transports-charlie-kirks-body-home-on-air-force-2-in-touching-tribute-to-pal-who-took-him-from-trump-skeptic-to-champion/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/charlie-erika-kirk-seen-undated-111172418.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/U207fRg1-RyIcpnTz.mp4","publish_date":"2025-09-11 23:37:18","author":"Alex Oliveira","authors":["Alex Oliveira"],"language":"en","source_country":"zm","sentiment":-0.04},{"id":359724212,"title":"A murder that shocked the world: How a public appearance that almost didn't happen led to the assassination of one of America's most divisive and engaging political figures","text":"A crowd of about 3,000 had assembled on the grassy steps of the Utah Valley University courtyard around a marquee emblazoned with the words ‘Prove Me Wrong’.\n\nIt was late on Wednesday morning, and the jumbled mass of students, supporters and protesters were eagerly anticipating a fiery debate with one of the most divisive yet engaging figures in the US.\n\nIt should have been the first of 15 university campus appearances in Charlie Kirk’s The American Comeback Tour, during which the 31-year-old activist intended to spread his conservative ideals at liberal-leaning colleges through his uncompromising debating style.\n\nThe controversial speaking event almost didn’t happen, given that nearly 1,000 people had signed a petition calling for the university to cancel Kirk’s appearance at its campus.\n\n‘Charlie Kirk is known for his divisive rhetoric that often supports policies and laws which aren’t inclusive and can marginalise various communities,’ the petition’s author claimed.\n\nBut the university stood firm, released a statement about its commitment to free speech – and every free ticket for the event was snapped up in a matter of hours.\n\nAs was typical with Kirk’s public appearances, security was light, with just six university police officers assigned to the event, alongside the activist’s team of eight private security guards.\n\nThere were no metal detectors or bag searches carried out on people entering the campus.\n\nAt 11.52am, as those with tickets gathered around the tent outside the Sorensen building and others watched on from any vantage point they could find, a lone gunman armed with a .30 calibre hunting rifle arrived on the campus and made his way to the Losee Centre building.\n\nAt 12.04pm, a live-streamer named Adam Bartholemew, who had his camera trained on a mass of protesters on the upper deck of the Losee building, captured a lone figure standing on its roof.\n\nAt 12.09pm, Charlie Kirk burst into the courtyard wearing a white T-shirt bearing the slogan ‘Freedom’. The activist, a close ally of Donald Trump, immediately began working the crowd and threw ‘Make America Great Again’ baseball caps at cheering supporters who chanted ‘USA!’\n\nTaking his seat in the middle of the tent, Kirk grabbed the microphone, surveyed the animated crowd and declared, to more cheers: ‘That’s a lot of people, Utah! We’re going to be here for a couple hours, get comfortable. Bring the best libs that Utah has to offer.’\n\nThen, the session began with Kirk fielding questions – both combative and adoring – from audience members.\n\nAt about 12.23pm Kirk, a father of two, was asked by an audience member how many transgender Americans had been mass shooters in the past decade.\n\n‘Too many,’ he replied, to more cheers. The man in the crowd told him the number was five, before asking: ‘Do you know how many mass shooters there have been in America over the last 10 years?’\n\nKirk sought some clarification, then said: ‘Counting or not counting gang violence?’\n\nIt was at this moment – as one of America’s most influential Right wingers began to lock horns in a debate over the country’s gun crime epidemic – that a single shot rang out over the packed university courtyard.\n\nKirk’s body flinched with the force of the bullet, blood immediately began pouring from his neck and he lurched to the left, still in his chair. The microphone slowly slipped from his grip and then fell to the ground.\n\nThe shot had been fired from the roof of the Losee building, roughly 420ft from where Kirk had been sitting.\n\nSeconds later a figure, who appeared to be dressed in dark clothing, was filmed sprinting from the roof, which can be reached by an external staircase and three other access routes.\n\nPanic-stricken members of the crowd began screaming, ducking for cover and scrambling over the lawns away from the tent.\n\nEmma Pitts, a reporter from the local Deseret News, who was covering the event, said: ‘We all dropped to the ground, and I want to say we sat like that for about 30 to 45 seconds, and then everyone around us got up and started running.\n\nAttendee Andrew Piskadlo, 28, said: ‘It was surprising, and no one really got down until the people in front of the stage did. People got down in waves.’\n\nSophie Anderson, 45, who was standing 100ft from the stage, said she was almost trampled by the stampeding crowd as she ran off towards the food court, where she hid in a cupboard.\n\nSix first responders rushed to grab Kirk’s crumpled body and quickly carried him into the back of a large private car as a police officer shouted at shrieking onlookers to keep their distance.\n\nThe car sped off to Timpanogos Regional Hospital in Orem, about two and a half miles away.\n\nBy 12.24pm, screaming members of the crowd scattered in all directions across the courtyard as officials fought desperately to lock down the campus.\n\nAt 12.26pm, a police alert went out to Orem Police: ‘Units be advised: UVU in Orem has had an active shooter at the Charlie Kirk event. We’re getting several calls. We’re trying to get more information.’\n\nBy 12.48pm, the university had sent out an alert to its students that a single shot had been fired on campus towards a visiting speaker.\n\nAt 1.08pm, the campus had been closed and all university classes were cancelled.\n\nMore police officers and FBI agents arrived and began sweeping the rooftops with rifles raised, combing through camera footage and interviewing traumatised witnesses. But it was too late.\n\nThe killer, thought to have been ‘college age’, is believed to have jumped from the roof and blended in with panicked students as they fled the campus.\n\nRetired FBI agent James Gagliano said the shooter appeared to have selected his vantage point because it allowed a quick escape.\n\n‘If you come off that roof – and I’ve seen the drone footage of this – there’s an open-air parking lot behind that building,’ he said.\n\n‘So this is a big concern because this person, within three to five minutes of that shot going off, that person could have been in a vehicle on his way out and miles and miles away.’\n\nLocal activist George Zinn, 71, was seen being dragged away by police in handcuffs shortly after the shooting as furious onlookers screamed abuse at him. But he was later released from custody after officials established he could not have been the shooter.\n\nBy 1.30pm Kirk was reported to be undergoing surgery as supporters began gathering outside the hospital, some praying aloud.\n\nConfusion spread across the campus as rumours swirled about his condition.\n\nBut at 2.40pm, his spokesman confirmed he was dead.\n\nAt 2.50pm, the White House official X account posted a photograph of President Trump next to the activist under a portrait of former president Ronald Reagan.\n\n‘The Great, and even Legendary, Charlie Kirk, is dead,’ the post stated. ‘No one understood or had the Heart of the Youth in the United States of America better than Charlie. He was loved and admired by ALL, especially me, and now, he is no longer with us.\n\n‘Melania and my Sympathies go out to his beautiful wife Erika, and family. Charlie, we love you!’ The post was signed ‘Donald J Trump’.\n\nFBI director Kash Patel posted on X at 4.21pm that a suspect for the shooting was in custody, but shortly afterwards he confirmed that this individual – like Mr Vinn – had also been released after a short interrogation.\n\nAs news of the killing spread, vigils were organised at venues around the country. At one, held in Seattle, Washington State, a large crowd held candles and prayed in tribute to Charlie Kirk.\n\nMeanwhile, the manhunt continued through the night, and at an early morning press conference yesterday officials said they had recovered the weapon thought to have been used in the shooting.\n\nIt was described as an older model Mauser .30-06, a high-powered bolt-action rifle, and had been found in a nearby wooded area wrapped in a towel with a spent cartridge still in the chamber and three unused rounds in the magazine.\n\nIt was described as an older model Mauser .30-06, a high-powered bolt-action rifle, and had been found in a nearby wooded area wrapped in a towel with a spent cartridge still in the chamber and three unused rounds in the magazine.\n\nOn this ammunition, investigators are said to have discovered engravings with expressions of transgender and antifascist ideology, according to an internal law enforcement bulletin.\n\nBut a senior law enforcement official later told the New York Times these engravings may have been ‘misinterpreted or misread’.\n\nThe FBI agent in charge of the investigation, Robert Bohls, told journalists that the agency was analysing a palm imprint, a forearm imprint and a footwear impression.\n\nBy 10am on Thursday in the US, the FBI shared images of the suspect taken from what appeared to be surveillance footage.\n\nThe grainy images show a man in a stairwell wearing a baseball cap, dark sunglasses and a black jumper bearing an American flag.\n\nCommentators speculated this move indicated that law enforcement had been unable to identify the gunman through facial recognition technology so needed the public’s help.\n\nAnd as the manhunt continued last night, it appeared they are no closer to unmasking the killer of an activist, described by the most powerful man in the world as ‘legendary’.","summary":"It was late on Wednesday morning, and the jumbled mass of students, supporters and protesters were anticipating a fiery debate with one of the most divisive yet engaging figures in the US.","url":"https://www.dailymail.co.uk/news/article-15090393/Charlie-Kirk-Murder-US.html","image":"https://i.dailymail.co.uk/1s/2025/09/11/23/102064797-0-image-m-24_1757630788843.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/10/7386732049582015370/1024x576_MP4_7386732049582015370.mp4","publish_date":"2025-09-11 23:36:44","author":"Editor,George Odling,Kamal Sultan","authors":["Editor","George Odling","Kamal Sultan"],"language":"en","source_country":"gb","sentiment":-0.001},{"id":359722190,"title":"Trump’s tariffs are slowly finding their way into consumer prices","text":"From clothing to auto parts to electronics and more, tariffs are making everyday items cost more at a time when the labour market is looking increasingly fragile.\n\nA key Bureau of Labor Statistics inflation report released overnight Thursday showed price increases for a variety of tariff-sensitive items.\n\nApparel prices rose 0.5 per cent as did video and audio products. Motor vehicle parts climbed 0.6 per cent while new car prices were up 0.3 per cent and energy increased 0.7 per cent. Groceries accelerated 0.6 per cent, the biggest monthly move since August 2022.\n\nFurniture and bedding saw a 0.3 per cent hit and are up 4.7 per cent from a year ago while tools and hardware had a 0.8 per cent jump, part of manufacturing-related goods that are particularly impacted.\n\nMore broadly, goods excluding food and energy rose 0.3 per cent on the month and are up 1.5 per cent from a year ago, the fastest rate since May 2023, according to Fitch Ratings. Coffee rose 3.6 per cent on the month and is up 20.9 per cent from a year ago.\n\nTogether, the increases may not sound dramatic. But they are enough to give both consumers and Federal Reserve policymakers at least some cause for concern.\n\n“We’ve already been seeing tariffs in the data for several months,” said Luke Tilley, chief economist at Wilmington Trust. “Consumers were not in a really good place to handle the increased prices that are coming from tariffs.”\n\nConsumers feel the hit\n\nMoreover, the inflation numbers might be worse if it weren’t for consumers, wary of the higher prices from tariffs, cutting back on spending, particularly on services, Tilley added. That has meant companies have less pricing power, so the tariff impact has been less acute.\n\nStill, inflation running near 3 per cent on both core and headline is a good distance from the Fed’s 2 per cent target and could jeopardise an economy that relies on consumer spending as the primary growth engine.\n\n“The middle-class squeeze from tariffs is here,” said Heather Long, chief economist at Navy Federal Credit Union. “It’s troubling that so many basic necessities now cost more. Food, gas, clothing and shelter all had big cost jumps in August. And this is only the beginning of the price hikes. The situation will worsen in the coming months as more costs are passed along to American consumers.”\n\nPresident Donald Trump and administration officials have insisted that the tariffs will not drive inflation higher.\n\nHistorically, that has been the case.\n\nEconomists generally view tariffs as a temporary price impetus but not contributing to longer-lasting inflation. Still, the persistence in prices combined with weakness in the labor market presents a stagflationary conundrum for the Fed.\n\nPolicy impact\n\nCentral bank officials are set to meet next week to vote on whether to lower their key overnight funds rate, currently running around 4.3 per cent.\n\nMarkets rallied Thursday as hopes built that the Fed not only will cut when the meeting concludes Wednesday but also will lower rates at its ensuing two meetings this year and will continue easing through 2026, according to the CME Group’s FedWatch.\n\nIn all, the market is pricing in the equivalent of six quarter-percentage-point cuts during the period, well ahead of the four that Fed officials pencilled in during their last outlook published in June. The view is based on the idea that policymakers will look through the price increases and focus on job weakness.\n\n“We expect over the next several months for it to be pretty clear that the Fed should be cutting rates,” Tilley said. “The somewhat minor pressure that we’re getting from tariffs on the goods side really is being outweighed by the slowdown in the economy, the slowdown in the labor market, the slowdown in consumer spending.”\n\nWhile the Fed ponders inflation, it also will have to weigh labour market weakness.\n\nInitial unemployment insurance claims last week hit their highest level since October 2021, though the main cause was what could be an anomalous spike in Texas and distortions from the Labor Day holiday. However, recent data indicate that the economy added virtually no jobs this year, a factor that would push the Fed to lower rates.","summary":"From clothing to auto parts to electronics and more, tariffs are making everyday items cost more at a time when the labor market is looking increasingly fragile.","url":"https://thewest.com.au/business/cnbc/trumps-tariffs-are-slowly-finding-their-way-into-consumer-prices-c-19994226","image":"https://images.thewest.com.au/publication/C-19994226/ff7ef650b2ca173c22f1816d9765819ab915631f-16x9-x66y0w1778h1000.jpg?imwidth=1200","video":null,"publish_date":"2025-09-11 23:36:22","author":"Jeff Cox,Jeff Coxcnbcfri","authors":["Jeff Cox","Jeff Coxcnbcfri"],"language":"en","category":"politics","source_country":"au","sentiment":-0.219},{"id":359723866,"title":"'This is who he is': Trump family member accuses him of 'stoking' political violence","text":"Mary Trump — the niece of President Donald Trump — recently said her uncle plays a significant role in the escalation of political violence in the United States.\n\nDuring a Thursday interview with former CNN host Jim Acosta, Mary Trump agreed with Acosta when he said that Trump was incapable of being a \"consoler-in-chief\" in the wake of the murder of 31 year-old MAGA activist Charlie Kirk. She said her uncle was \"pouring gasoline on a raging fire\" by singularly blaming the political left for Kirk's death, despite the shooter remaining at large and with the official motive still under investigation.\n\n\"He will never change. He's been the same person for decades. And quite frankly, he's been rewarded for being this person. So it's a fool's errand to suggest that he will ever change.\"\n\nREAD MORE: House Republican demands Trump tone down 'ridiculous rhetoric' after Charlie Kirk shooting\n\nAcosta reminded viewers that despite Trump's promise to find and prosecute the person responsible for shooting Kirk, he said nothing about the death of former Minnesota House Speaker Melissa Hortman (D) when she was assassinated by a far-right activist in June. And he lamented that Trump didn't call Minnesota Governor Tim Walz (D) after Hortman's shooting, saying it would have been a \"waste of time.\"\n\nMary Trump agreed with Acosta, and went on to argue that the media was so far absolving the president for his role in exacerbating political divisions in the U.S.. She argued that her uncle was engaging in a \"slippery slope\" of suggesting that Democrats should be \"targeted\" in the wake of Kirk's murder.\n\n\"I see people still giving him the benefit of the doubt, and it is mystifying to me. Because how much more evidence do we need really, that this is who he is and this kind of behavior benefits him?\" She said. \"Just as the divisiveness — he is largely responsible for stoking n this country over the last decade — benefits him and protects him.\"\n\n - YouTube www.youtube.com \n\nREAD MORE: 'Bratty children at Mar-a-Lago' party while Americans are 'financially squeezed': analyst","summary":"Mary Trump — the niece of President Donald Trump — recently said her uncle plays a significant role in the escalation of political violence in the United States.\n\nDuring a Thursday interview with former CNN host Jim Acosta, Mary Trump agreed with Acosta when he said that Trump was incapable of being a \"consoler-in-chief\" in the wake of the murder of 31 year-old MAGA activist Charlie Kirk. She said her uncle was \"pouring gasoline on a raging fire\" by singularly blaming the political left for Kirk's death, despite the shooter remaining at large and with the official motive still under investigation.\n\n\"He will never change. He's been the same person for decades. And quite frankly, he's been rewarded for being this person. So it's a fool's errand to suggest that he will ever change.\"\n\nREAD MORE: House Republican demands Trump tone down 'ridiculous rhetoric' after Charlie Kirk shooting\n\nAcosta reminded viewers that despite Trump's promise to find and prosecute the person responsible for shooting Kirk, he said noth","url":"https://www.alternet.org/trump-political-violence-2673986473/","image":"https://www.alternet.org/media-library/image.jpg?id=60071642&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-09-11 23:34:25","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.492},{"id":359718598,"title":"Letters: Overly broad bill is bad for campus free speech","text":"Overly broad bill is\nbad for free speech\n\nRe: “California must make schools safer for Jews” (Page A8, Sept. 7).\n\nI agree with Daniel Klein’s Sept. 7 column that antisemitism is wrong, and schools should protect Jewish students from harassment or discrimination. However, I oppose the proposed law (AB 715), based on hearing it equates criticism of Israel or Zionism with antisemitism.\n\nIndividuals should not be mistreated for their identity or opinions, but the government of Israel and of the Zionist movement are fair game for criticism. I support the existence of Israel, but I am deeply troubled by the actions of the Israeli government in Gaza over the past 23 months and its Jewish settlements in the West Bank over many years, which make self-government nearly impossible for Palestinians. Jewish people should have their safety and rights protected but so should Palestinians.\n\nI want peace and security for Israel and its citizens, but that will not be possible without peace, security and self-government for Palestinians too.\n\nJoseph Easley\nWalnut Creek\n\nEscrow account could\nright federal wrongs\n\nRe: “State should create an account for taxes” (Page A6, Sept. 5).\n\nKudos to letter-writer Diana Mead for suggesting that California create an escrow agency to hold taxpayers’ IRS payments until the Trump administration releases all the grants and contract dollars that have already been authorized and appropriated.\n\nPerhaps the California Franchise Tax Board could serve as that escrow agency.\n\nI wrote to my state Assembly member and state senator, encouraging them to create such escrow powers. It just isn’t right that the Humboldt wind project and other environment-saving, previously funded projects have been canceled by an ignorant, arrogant and corrupt presidential administration.\n\nBruce Joffe\n\nState should stop end\nto EV carpool access\n\nRe: “EV carpool lane access ending soon” (Page A1, Sept. 9).\n\nIt is with sorrow and angst that I read about the end of carpool lane access for EVs.\n\nWhile the current administration is in denial about climate change, the legislators in Sacramento are not bound by this short-sightedness. After all, the idea of having a carpool lane is to lower greenhouse gas and pollutant emissions. The ability to use carpool lanes is a great, non-financial perk that makes EV ownership more attractive — especially given that EVs are more expensive up front.\n\nOf course, if a majority of the vehicles on the road are EVs, then the removal of this incentive makes sense. Given that EVs are about 25% of new car sales and less than 3% of all registered vehicles in California, as of 2024, they are a long way from being a majority.\n\nWhat would it take to restore carpool access to EVs?\n\nPrakash Narayan\n\nSpecial election donors\nshould redirect money\n\nGov. Newsom is asking wealthy donors to pony up money to promote his special election. Meanwhile, there’s not enough money for public transit, schools, Medicaid or affordable housing.\n\nPerhaps these would be better places to urge his wealthy supporters to put their money.\n\nMike Cluster\nPleasant Hill\n\nMasked agents a step\non path to dictatorship\n\nRe: “Masked agents face pushback” (Page A1, Sept. 10).\n\nThe pictures on the front page should leave no doubt in anybody’s mind. Donald Trump only understands authoritarian leadership. It is one of the steps toward dictatorship.\n\nAmerica used to understand that the military and policing do not mix. Now we see the military in D.C., and in the future, probably elsewhere.\n\nOnce you understand that, you must understand that being nice will not stop a dictator. Gerrymandering? Bring it on. Protests? Let’s shut down cities.\n\nTrump is only warming up. After the midterms, he will start the serious business of staying in power. Don’t take a knife to a gunfight.\n\nDeployment of Guard\nto D.C. is textbook irony\n\nDoes anyone else see how ironic it is that the National Guard has been deployed in D.C.? Remember that horrible day in January 2021 when our outgoing president allowed the brutal attack on our Capitol and legislators to progress. Not only that, but the criminals caught on camera doing unspeakable crimes were sentenced to prison, and he pardoned those thugs. He is the criminal. He is the felon.\n\nOur legislators are buckling under White House pressure as little people do under a mob boss. This man is not a Republican; he is a MAGA, but America is not turning great again. In fact, what made America great is being crushed under his heel. This is the time to speak up, to tell your representatives to regain their integrity and move against this imposter president.\n\nKathy Nielsen","summary":"Also: Escrow account &#124; EV access &#124; Redirect money &#124; Path to dictatorship &#124; Textbook irony. East Bay Times reader letters to the editor for Sept. 12, 2025.","url":"https://www.mercurynews.com/2025/09/11/letters-bill-bad-campus-free-speech/","image":"https://www.mercurynews.com/wp-content/uploads/2024/06/OCR-L-UCIDAY3-0502-09-PB.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-11 23:30:56","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.593},{"id":359724108,"title":"UK announces £400m Google Cloud classified info contract","text":"Google Cloud’s latest technology will be used by the UK government to enhance cooperation among defence and security experts. (EPA Images pic)\nLONDON: The UK government said Thursday it has agreed a £400 million contract with Google Cloud under a partnership to share classified information with the US, days before President Donald Trump's visit.\nThe deal \"will strengthen secure communication links between the UK and US, in addition to the extensive intelligence and security partnership our two countries already share,\" Britain's Ministry of Defence (MOD) said.\nIt added Google Cloud's latest technology, including \"AI, data analytics, and cyber security\", will be used by defence intelligence and national security specialists to boost cooperation.\nThe ministry touted millions of pounds of inward investment from Google Cloud, noting the US tech giant will recruit a specialist UK team to manage the programme.\nDefence secretary John Healey said the tech \"has strict data sovereignty and security controls\" which ensures that \"critical data remains under direct UK control\".\nTara Brady, Google Cloud's EMEA President, said the contract would help the UK government \"develop a robust and resilient infrastructure and harness the latest technology innovations\".\n\"This partnership will enable the MOD to accelerate its digital modernisation efforts while maintaining the highest levels of security and data sovereignty,\" she added.\nThe announcement of the deal comes ahead of Trump's state visit to Britain next week, with several major US tech executives reportedly set to join the American leader.","summary":"The deal leverages AI, data analytics, and cybersecurity to enhance secure communication links between the UK and US.","url":"https://www.freemalaysiatoday.com/category/business/2025/09/12/uk-announces-400m-google-cloud-classified-info-contract","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/09/5b907240-google-cloud.jpg","video":null,"publish_date":"2025-09-11 23:30:06","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":-0.148},{"id":359726620,"title":"‘Donald Trump Wouldn’t Be in the White House Without Charlie Kirk’","text":"Conservative youth organizer Charlie Kirk laid the groundwork for President Donald Trump’s historic presidential victories, supporters recalled in the wake of his tragic assassination on Wednesday.\n\n“There is no question that Charlie’s work and his voice helped my father win the presidency,” Donald Trump Jr. wrote on the social media platform X of the 31-year-old husband and father of two.\n\n“Donald Trump wouldn’t be in the White House without Charlie Kirk,” Brilyn Hollyhand, chairman of the Republican National Committee’s Youth Advisory Council, told Fox News.\n\nAt just 18 years old at the time, Kirk launched Turning Point USA in 2012 to mobilize conservative students on college campuses. By 2016, it had grown into a national youth organization equipped to organize support for Trump among young voters.\n\nAt age 23, Kirk, the youngest speaker at the Republican National Convention, said in an interview he “was not the world’s biggest Donald Trump fan,” though he said he would vote for him.\n\nBut Vice President JD Vance explained Kirk’s move toward becoming a powerful Trump ally.\n\n“Like me, he was skeptical of Donald Trump in 2016,” Vance wrote on X after Kirk’s death. “Like me, he came to see President Trump as the only figure capable of moving American politics away from the globalism that had dominated for our entire lives. When others were right, he learned from them. When he was right—as he usually was—he was generous. With Charlie, the attitude was never, ‘I told you so.’ But: ‘welcome.’”\n\nKirk grew close with Donald Trump Jr., who went on to headline TPUSA’s December 2016 summit. Kirk spent much of 2016 after the convention advocating for Trump, and he reportedly helped with the younger Trump’s travel and media during the campaign.\n\nKirk appeared at a pro-Trump Fox News event for millennials in October 2016 alongside Donald Trump Jr.; his brother, Eric Trump; and Lara Trump, Eric Trump’s wife.\n\nTrump won the election in 2016, but Kirk’s work rallying young people didn’t stop there.\n\nIn 2019, he launched a podcast and founded Turning Point Action, TPUSA’s political arm, created to “embolden the conservative base through grassroots activism and provide voters with the necessary resources to elect true conservative leaders.” Turning Point Action held numerous rallies and bus tours for Trump in swing states, such as Arizona, Florida, Georgia, North Carolina, and Pennsylvania.\n\nKirk remained close to Trump after former President Joe Biden was declared the winner of the presidential election in 2020.\n\nIn the 2024 election, Kirk’s “You’re Being Brainwashed” tour reached 25 colleges. Videos of Kirk debating Generation Z leftists acquired millions of views on social media.\n\nKirk told Fox News that transforming “supporters into voters” marked Turning Point’s most “decisive” impact on the 2024 presidential election.\n\n“You need to do the hard work to turn the low-propensity voters and actually get their ballots into boxes, and that requires bodies,” Kirk said. “So, we quietly hired well over 1,000 full-time people across all the battleground states, in Arizona, Wisconsin, partially in Michigan and Pennsylvania.”\n\nKirk privately and publicly advocated for Vance to be chosen as Trump’s vice president and supported the former Ohio senator when he was chosen, Vance wrote on X.\n\n“Some of our most successful events were organized not by the campaign, but by TPUSA,” Vance wrote. “He wasn’t just a thinker, he was a doer, turning big ideas into bigger events with thousands of activists. And after every event, he would give me a big hug, tell me he was praying for me, and ask me what he could do. ‘You focus on Wisconsin,’ he’d tell me. ‘Arizona is in the bag.’ And it was.”\n\nTurning Point’s headquarters are in Arizona, and Kirk made a specifically significant impact there. CNN reported that Turning Point secured more than 125,000 irregular voters for Trump in Arizona. \n\nPolls show Kirk’s hard work paid off. A remarkable 46% of young people voted for Trump in 2024, up from 36% in 2020, according to Tufts Center for Information and Research on Civic Learning and Engagement. Trump received about 37% of the youth vote in 2016.\n\nThe president won the youth vote in 17 states in 2024, compared with seven states in 2020.\n\n“And Charlie Kirk will tell you, TikTok helped, but Charlie Kirk helped also,” Trump said after returning to the Oval Office for his second term. \n\nIn a video reacting to Kirk’s death, Trump said, “There’s never been anyone who was so respected by youth.”\n\nTrump thanked Kirk for bringing “young people into the political process.”\n\n“He did better than anybody ever to share his love of country and to spread the simple words of common sense on campuses nationwide,” the president said.","summary":"Conservative youth organizer Charlie Kirk laid the groundwork for President Donald Trump&#8217;s historic presidential victories, supporters recalled in the wake of his tragic assassination on... Read More\n\n\nThe post ‘Donald Trump Wouldn’t Be in the White House Without Charlie Kirk’ appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/11/how-charlie-kirk-powered-rise-trump/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/ch.jpg","video":null,"publish_date":"2025-09-11 23:30:00","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","category":"politics","source_country":"us","sentiment":0.277},{"id":359724198,"title":"I've analyzed Charlie Kirk's guards' mysterious hand signals. As a top cop I know exactly what they're doing...","text":"A veteran lawman has confirmed the curious hand gestures seen in a video of Charlie Kirk's bodyguards just before the conservative firebrand was gunned down in Utah were security signals.\n\nFootage circulating online shows two members of Kirk's modest detail standing behind him as he addressed a crowd of 3,000 at Utah Valley University on Wednesday.\n\nOne appeared to adjust his cap while holding a phone, while another shifted his arms and cast glances across the courtyard.\n\nMoments later, Kirk, 31, a rising star of the conservative movement and close ally of Donald Trump , was struck in the neck by a single rifle round apparently fired from a rooftop some 200 yards away.\n\nHe slumped under the white 'Prove Me Wrong' tent as horrified supporters screamed and ran. \n\nSocial media sleuths have pored over the clip and spread wild conspiracies at what the signals could mean.\n\nNow, in an exclusive interview with the Daily Mail, veteran law enforcement officer and security consultant Stan Kephart said that, in his expert view, the movements were deliberate but not unusual.\n\n'I can tell you from experience — those were definitely hand signals. The way they were done was not casual. It was more than one signal,' said Kephart, a former California police chief who has advised on security for the Olympic Games and other major events.\n\nBut he cautioned against jumping to the darkest conclusions. 'My suspicion is that he's checking off with somebody else, perhaps a supervisor, saying everything is okay,' he added.\n\n'It doesn't arouse my suspicions. If he wasn't okay, or if he had something to say, he would have reverted not to hand signals, but to his communication system.'\n\nKirk's group, Turning Point USA, did not reply to our request for comment.\n\nAuthorities believe the assassin slipped on to the university roof shortly before Kirk's appearance, lined up his target with a high-powered, bolt-action rifle, and fled into a nearby neighborhood within minutes of pulling the trigger.\n\n'This was a political assassination,' Utah Gov. Spencer Cox declared. The FBI has since released grainy images of a black-clad 'person of interest' wearing sunglasses and a cap with the image of a bald eagle flying across a US flag.\n\nAgents recovered the rifle, palm prints, and footprints in a wooded area near campus. But as of Thursday evening, no suspect had been identified.\n\nKephart, 85, said the apparent precision of the attack meant federal investigators would be leaving no stone unturned — including scrutinizing every frame of video from before, during, and after the shot. \n\n'The Bureau's investigation will be a deep dive,' he said.\n\nKirk's appearance at Utah Valley University was the first stop of his 'American Comeback Tour,' and his team had brought along a small private security detail.\n\nUnlike elected officials, he was not afforded federal protection. Kephart said this left him vulnerable.\n\n'There were only six campus police officers on duty. They are well-trained, but that's not enough for a 2,000-plus crowd.\n\n'And without federal resources like rooftop surveillance or shot-spotter technology, it's a decided disadvantage,' he explained. \n\nSome attendees are asking why rooftops overlooking the courtyard were not cleared, and whether Kirk's team was prepared for the worst.\n\n'In a federal operation, the site would have been sanitized days ahead,' Kephart noted.\n\n'That means mapping rooftops, assigning areas of responsibility, and deploying specialized technology. Unfortunately, as a private citizen, Charlie Kirk didn't get that.'\n\nKirk's killing marks the latest grim episode in America's escalating wave of political violence.\n\nRecent years have seen attacks across the ideological spectrum — from the shooting of Donald Trump at a Pennsylvania rally to the firebombing of a Colorado parade and the slaying of a Minnesota state lawmaker.\n\nKirk, who founded Turning Point USA in 2012 at just 18, had become a fixture of the conservative movement, praised by Trump as a 'martyr for truth and freedom.'\n\nWithin hours of the shooting, videos, photos, and eyewitness accounts began circulating on social media, with users rushing to dissect every frame for clues.\n\nConspiracy theorists have seized on brief clips and images, spinning intricate narratives despite investigators' warning that no verified evidence supports these claims.\n\nLaw enforcement agencies have urged the public to rely on official updates rather than online posts.","summary":"Footage circulating online shows two members of Kirk's modest detail standing behind him as he addressed a crowd of 3,000 at Utah Valley University on Wednesday.","url":"https://www.dailymail.co.uk/news/article-15089705/Security-suspicious-hand-signals-Charlie-Kirk.html","image":"https://i.dailymail.co.uk/1s/2025/09/11/23/102059813-0-image-m-13_1757630698111.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/11/562021641465384222/1024x576_MP4_562021641465384222.mp4","publish_date":"2025-09-11 23:27:43","author":"Editor,James Reinl","authors":["Editor","James Reinl"],"language":"en","source_country":"gb","sentiment":-0.329},{"id":359723886,"title":"Appeals court allows Trump’s administration to block Medicaid funds to Planned Parenthood","text":"BOSTON (AP) — A U.S. appeals court panel on Thursday allowed President Donald Trump’s administration to block Medicaid funds to Planned Parenthood while legal challenges continue.\n\nA federal judge in July ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation’s largest abortion provider fights Trump’s administration over efforts to defund the organization in his signature tax legislation.\n\nMedicaid is a government health care program that serves millions of low-income and disabled Americans. Nearly half of Planned Parenthood’s patients rely on Medicaid.\n\nA provision in Trump’s tax bill instructed the federal government to end Medicaid payments for one year to abortion providers that received more than $800,000 from Medicaid in 2023, even to those like Planned Parenthood that also offer medical services like contraception, pregnancy tests and STD testing.\n\nPlanned Parenthood Federation of America and its member organizations in Massachusetts and Utah filed a lawsuit in July against Health and Human Services Secretary Robert F. Kennedy Jr.\n\n“While the Trump administration wants to rip away reproductive freedom, we’re here to say loud and clear: we will not back down,” Dominique Lee, President and CEO of Planned Parenthood League of Massachusetts said in a statement. “This is not over.”\n\nThe U.S. Department of Health and Human Services didn’t immediately respond to an online request for comment.\n\nPlanned Parenthood said Thursday’s ruling means that more than 1.1 million patients can’t use their Medicaid insurance at its health centers. That also puts as many as 200 of those health centers at risk of closure, Planned Parenthood said in a statement.\n\nPlanned Parenthood says it is the nation’s leading provider and advocate of affordable sexual and reproductive health care, as well as the nation’s largest provider of sex education.","summary":"The ruling means that more than 1.1 million Planned Parenthood patients can’t use Medicaid insurance.","url":"https://www.ocregister.com/2025/09/11/planned-parenthood-medicaid/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/AP25254841857230.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-11 23:27:43","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.376},{"id":359716802,"title":"Appeals court allows Trump’s administration to block Medicaid funds to Planned Parenthood","text":"BOSTON (AP) — A U.S. appeals court panel on Thursday allowed President Donald Trump’s administration to block Medicaid funds to Planned Parenthood while legal challenges continue.\n\nA federal judge in July ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation’s largest abortion provider fights Trump’s administration over efforts to defund the organization in his signature tax legislation.\n\nMedicaid is a government health care program that serves millions of low-income and disabled Americans. Nearly half of Planned Parenthood’s patients rely on Medicaid.\n\nA provision in Trump’s tax bill instructed the federal government to end Medicaid payments for one year to abortion providers that received more than $800,000 from Medicaid in 2023, even to those like Planned Parenthood that also offer medical services like contraception, pregnancy tests and STD testing.\n\nPlanned Parenthood Federation of America and its member organizations in Massachusetts and Utah filed a lawsuit in July against Health and Human Services Secretary Robert F. Kennedy Jr.\n\n“While the Trump administration wants to rip away reproductive freedom, we’re here to say loud and clear: we will not back down,” Dominique Lee, President and CEO of Planned Parenthood League of Massachusetts said in a statement. “This is not over.”\n\nThe U.S. Department of Health and Human Services didn’t immediately respond to an online request for comment.\n\nPlanned Parenthood said Thursday’s ruling means that more than 1.1 million patients can’t use their Medicaid insurance at its health centers. That also puts as many as 200 of those health centers at risk of closure, Planned Parenthood said in a statement.\n\nPlanned Parenthood says it is the nation’s leading provider and advocate of affordable sexual and reproductive health care, as well as the nation’s largest provider of sex education.","summary":"The ruling means that more than 1.1 million Planned Parenthood patients can’t use Medicaid insurance.","url":"https://www.bostonherald.com/2025/09/11/planned-parenthood-medicaid/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/AP25254841857230.jpg?w=1024&h=683","video":null,"publish_date":"2025-09-11 23:27:43","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.376},{"id":359718874,"title":"Appeals court allows Trump’s administration to block Medicaid funds to Planned Parenthood","text":"BOSTON (AP) — A U.S. appeals court panel on Thursday allowed President Donald Trump’s administration to block Medicaid funds to Planned Parenthood while legal challenges continue.\n\nA federal judge in July ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation’s largest abortion provider fights Trump’s administration over efforts to defund the organization in his signature tax legislation.\n\nMedicaid is a government health care program that serves millions of low-income and disabled Americans. Nearly half of Planned Parenthood’s patients rely on Medicaid.\n\nA provision in Trump’s tax bill instructed the federal government to end Medicaid payments for one year to abortion providers that received more than $800,000 from Medicaid in 2023, even to those like Planned Parenthood that also offer medical services like contraception, pregnancy tests and STD testing.\n\nPlanned Parenthood Federation of America and its member organizations in Massachusetts and Utah filed a lawsuit in July against Health and Human Services Secretary Robert F. Kennedy Jr.\n\n“While the Trump administration wants to rip away reproductive freedom, we’re here to say loud and clear: we will not back down,” Dominique Lee, President and CEO of Planned Parenthood League of Massachusetts said in a statement. “This is not over.”\n\nThe U.S. Department of Health and Human Services didn’t immediately respond to an online request for comment.\n\nPlanned Parenthood said Thursday’s ruling means that more than 1.1 million patients can’t use their Medicaid insurance at its health centers. That also puts as many as 200 of those health centers at risk of closure, Planned Parenthood said in a statement.\n\nPlanned Parenthood says it is the nation’s leading provider and advocate of affordable sexual and reproductive health care, as well as the nation’s largest provider of sex education.","summary":"The ruling means that more than 1.1 million Planned Parenthood patients can’t use Medicaid insurance.","url":"https://www.sandiegouniontribune.com/2025/09/11/planned-parenthood-medicaid/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/AP25254841857230.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-11 23:27:43","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.376},{"id":359724102,"title":"Trump urges peaceful response to Charlie Kirk killing","text":"President Donald Trump speaks to reporters about the murder of Turning Point founder Charlie Kirk as he departs the White House. (EPA Images pic)\nOREM: President Donald Trump urged supporters Thursday to respond peacefully to the killing of right-wing campaigner Charlie Kirk, as the murderer continued to evade a manhunt more than 24 hours after the shooting put an already divided US on edge.\nTrump, who soon after the killing angrily pledged a wide-ranging response against the \"radical left,\" told reporters that Kirk had been \"an advocate of nonviolence.\"\n\"That's the way I'd like to see people respond,\" he said.\nKirk, a 31-year-old superstar on the Republican right who sparked surging youth support for Trump, was shot while addressing a large crowd at Utah Valley University on Wednesday.\nTrump cited \"big progress\" in the investigation.\nHowever, authorities said the gunman remained at large a day later.\n\"Multiple leads are currently being investigated, but no suspect is in custody,\" Utah law enforcement officials posted, after cancelling a previously scheduled media briefing.\n\"We're doing everything we can to find him, and we're not sure how far he has gone yet,\" FBI special agent Robert Bohls said earlier.\nThe FBI, which described the attack on Kirk as \"targeted,\" published grainy photos of a young person it called \"the potential shooter.\"\nThe pictures showed a man wearing a black baseball cap, dark sunglasses, and what appeared to be jeans, with a long-sleeved top emblazoned with a design that included an American flag.\nA reward of up to US$100,000 was posted for information leading to his capture.\nPolice say they believe the shooter fired a single bullet from a rooftop up to 180m, hitting Kirk in the neck.\nA high-powered bolt-action rifle was recovered in a wooded area.\n'Dark moment'\nReflecting the highly political nature of the incident, it was Trump, not law enforcement authorities, who first announced to Americans on Wednesday that Kirk had died.\nShortly after, Trump addressed the nation in a social media video address where he cited a \"dark moment for America.\"\n\"For years, those on the radical left have compared wonderful Americans like Charlie to Nazis and the world's worst mass murderers and criminals,\" he said. \"This kind of rhetoric is directly responsible for the terrorism that we're seeing.\"\nConspiracy theories ricocheted around the internet, while calls for a return to civility vied with those demanding vengeance.\n\"THIS IS WAR\" wrote the popular right-wing X account of @LibsofTikTOK\nFox News host Jesse Watters on Wednesday said the killing signified that his side of the political spectrum was under attack.\n\"Whether we want to accept it or not, they are at war with us. And what are we going to do about it?\" he asked his audience.\n'Martyr' for the right\nKirk was shot while speaking to the crowd and immediately collapsed in his chair.\nStudents at the university described the ensuing panic - and their broader fears as political divisions deepen across the country.\n\"It makes me feel like I should be very careful about expressing my political ideas,\" said Samuel Kimball, a software engineering student, told AFP.\nKirk, who supporters have hailed as a \"martyr\" for conservative ideals, had an outsized influence in US politics.\nHe co-founded Turning Point USA in 2012 to drive conservative viewpoints among young people, with his natural showmanship making him a go-to spokesman on television networks.\nKirk used his enormous audiences on TikTok, Instagram and YouTube to build support for anti-immigration policies, outspoken Christianity and gun ownership, and to spread carefully edited clips of his interactions during debates at his many college events.\nThree months ago, a Minnesota man shot dead a Democratic lawmaker and her husband in their home, and Trump survived an assassination attempt during his election campaign in July 2024.\nVice president JD Vance arrived in Utah to meet Kirk's family Thursday.","summary":"Conspiracy theories have surged across the internet as pleas for calm compete with demands for vengeance.","url":"https://www.freemalaysiatoday.com/category/world/2025/09/12/trump-urges-peaceful-response-to-charlie-kirk-killing","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/09/13ca268b-donald-trump-3.jpg","video":null,"publish_date":"2025-09-11 23:20:54","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.068},{"id":359714670,"title":"Columbia student satire site jokes about Charlie Kirk’s death","text":"Columbia University's student-run satirical newspaper, The Federalist, published an article on Wednesday roasting Turning Point USA founder Charlie Kirk in the wake of his assassination because of his support for gun rights. The article, published just hours after Kirk's death, satirized the staunch Second Amendment advocate being shot and killed, with the headline, \"Turning Point USA Undergoes Unexpected Ideological Shift, States Second Amendment Actually Not That Important Anymore.\" \"'The Turning Point USA leadership team recently convened to discuss the role of the Second Amendment in our propaganda, I mean, education. We’ve decided to reconsider our stance on gun control and personal freedoms. This decision was made completely independently of recent events,'\" the mock statement written by the satire site read. COMPLETE COVERAGE OF CHARLIE KIRK \"'Guns kill people. That is a truth that we have only recently learned. It turns out, ignoring all of those public health experts and grieving parents and nationwide statistics wasn’t a good idea. Our bad!'\" The short article continued, slamming both the Turning Point USA organization and conservatives at large for their \"terrible politics.\" \"In typical conservative fashion, it seems, Turning Point USA only realizes how terrible their politics are when it f---s with their own lives. Go figure,\" the outlet concluded. VIGILS HELD ACROSS US AFTER ASSASSINATION OF CHARLIE KIRK: 'WE MUST HEAL' Kirk, a husband and father of two, was shot and killed during a campus event at Utah Valley University Wednesday. He was 31. Kirk was shot in the neck as he spoke to the large crowd from under a white pop-up tent. He was rushed to the hospital and pronounced dead later Wednesday afternoon. Kirk's shocking death has been met with widespread mourning and outrage. President Donald Trump, who counted Kirk as a friend and close political ally, called him a patriot and man of deep faith. \"An assassin tried to silence him with a bullet, but he failed, because together, we will ensure that his voice, his message and his legacy will live on for countless generations to come,\" Trump said Wednesday from the Oval Office. CHARLIE KIRK MOURNED BY WORLD LEADERS AFTER SHOCKING UTAH ASSASSINATION As of Thursday morning, Kirk's killer remains at large. Fox News Digital has reached out to The Columbia Federalist for comment. The satirical paper was co-founded by future Supreme Court Justice Neil Gorsuch as a student in 1986. Kirk frequently defended the Second Amendment as a necessary means to \"defend yourself against a tyrannical government.\" Some of his ideological foes noted he said some gun deaths were an unfortunate and unavoidable consequence, so \"we can have the Second Amendment to protect our other God-given rights.\" CLICK HERE TO GET THE FOX NEWS APP Editor's Note: This article previously stated below the headline that the publication was the \"Columbia Spectator.\" This has been corrected to show it was the Columbia Federalist.","summary":"A Columbia University student-run satire site published an article joking about the assassination of Turning Point USA founder Charlie Kirk after his death on Wednesday.","url":"https://www.foxnews.com/media/columbia-student-satire-site-jokes-about-charlie-kirks-death","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/charlie-kirk-student-event.jpg","video":"https://www.foxnews.com/video/6379114065112","publish_date":"2025-09-11 23:20:06","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","source_country":"us","sentiment":-0.011},{"id":359714570,"title":"Brazil’s Jair Bolsonaro sentenced to 27 years for plotting coup","text":"BRASILIA, Brazil >> Brazil’s Supreme Court today convicted former President Jair Bolsonaro of overseeing a failed conspiracy to overturn the 2022 Brazilian election in a coup plot that included disbanding courts, empowering the military and assassinating the president-elect.\n\nFour of the five justices weighing the case voted to convict Bolsonaro and seven co-conspirators, including his running mate, defense minister and navy commander, in a forceful rebuke by one of the very institutions the men sought to overthrow.\n\nBolsonaro, 70, was sentenced to 27 years and three months in prison, though his lawyers are likely to request house arrest because of his health problems.\n\nThe conviction is a landmark ruling for Latin America’s largest nation. In at least 15 coups and coup attempts with links to the military since Brazil overthrew its monarchy in 1889, today marked the first time the leaders of one of those plots have been convicted.\n\nIt also could deal a definitive blow to one of Latin America’s most important and influential political figures. Bolsonaro galvanized a right-wing movement that transformed Brazil into a more polarized and, in some ways, conservative nation — but his conviction now leaves the right without a clear leader.\n\nAt the same time, the ruling will very likely escalate the conflict between Brazil and the United States. President Donald Trump had demanded that Brazil drop the charges against Bolsonaro, saying that, like him, the former Brazilian president was being politically persecuted for trying to reverse a rigged election.\n\nThe White House had sought to force Brazil to drop the case with steep tariffs, a trade investigation and severe sanctions against the Supreme Court justice leading it. Instead, several Brazilian justices criticized the U.S. attempts to intervene as they voted to convict.\n\nAsked about Bolsonaro’s conviction, Trump told reporters today that he was “very unhappy about it. I know President Bolsonaro” and like him, he said. “I think it’s a terrible thing, very terrible. I actually think it’s very bad for Brazil.”\n\nBolsonaro’s conviction relied upon troves of evidence showing that he and his inner circle had spent months undermining voters’ confidence in Brazil’s elections systems and then, after narrowly losing the 2022 vote, attempted to find ways to keep him in power.\n\nThe plans envisaged declaring a state of emergency that would have dissolved the Supreme Court, annulled the election result and given the military sweeping powers. It also included a plot to assassinate Bolsonaro’s opponent, now the president, Luiz Inacio Lula da Silva; Lula’s running mate; and Alexandre de Moraes, the Supreme Court justice who had overseen the election and launched several investigations into Bolsonaro.\n\nBolsonaro denied the charges and said he had no knowledge of an assassination plot. Instead, he testified that he sought ways within Brazil’s Constitution to correct what he claimed was a stolen election. A review by Brazil’s military found no evidence of electoral fraud.\n\nFor months, Bolsonaro and his allies have called the case an abuse of power by the Supreme Court to politically oppress him and smother his movement.\n\n“He never intended to stage a coup d’etat. This is effectively a political movement being judged, not just its leadership,” Bolsonaro’s lawyer, Paulo Cunha Bueno, said in an interview before the verdict. A conviction, he added, “will leave a scar on the court’s history.”\n\nAs the trial marched toward a verdict over the past two weeks, Bolsonaro found himself abandoned by some allies accused of plotting the coup alongside him. That included his former defense minister, whose lawyer claimed he had tried to persuade the former president to abandon the plans.\n\nHe also faced damaging testimony from his personal secretary and records showing that the assassination plot was printed out and brought to the presidential palace, among other evidence.\n\nMuch of the turmoil also played out publicly. Bolsonaro openly spread misinformation about voter fraud; Brazil’s highway police stopped voters in left-leaning districts on election day; and, a week after Lula’s inauguration, thousands of Bolsonaro’s supporters stormed Brazil’s halls of power in a failed bid to induce a military takeover.\n\nAs a result, Bolsonaro’s conviction was widely expected, a view reinforced by the makeup of the five-member panel of Supreme Court justices judging the case. In addition to de Moraes, whom Bolsonaro attacked openly, the panel includes a justice who was Lula’s former personal lawyer, and another who is Lula’s former justice minister and close ally.\n\nThat led Bolsonaro to place his faith in a Hail Mary from abroad: Trump.\n\nFor months, one of Bolsonaro’s sons has lobbied the White House to help his father avoid a prison sentence. Then, in July, Trump stepped in.\n\nHis government levied eye-watering 50% tariffs on Brazil that have pushed the nation toward China, and then it hit de Moraes with some of the harshest sanctions the United States has at its disposal, usually reserved for people who have committed human rights abuses.\n\nThe White House has cited de Moraes’ aggressive campaign to combat what he says are threats against Brazil’s democracy, including moves to jail people for threatening the court, censor voices online and block entire social networks across Brazil.\n\nEven as Brazil has stood its ground, it is now bracing for further punitive measures in response to Bolsonaro’s conviction. The Trump administration has made clear that it is ready to continue the fight, casting both Trump and Bolsonaro as victims of a global attempt to muzzle conservative voices.\n\nBolsonaro, a former army captain turned longtime member of Congress, was elected president in 2018, lifted to power by a wave of voter frustration over corruption and crime. At the time, his most potent adversary, Lula, was in prison on a corruption conviction that was later thrown out.\n\nHe transformed Brazil’s politics with his freewheeling, combative and sometimes belligerent style that included dismantling regulations, questioning the credibility of scientific findings, harshly attacking his opponents and praising the military dictatorship that ruled the country from 1964 to 1985.\n\nWhile he and Trump came from starkly different backgrounds, the two men shared strikingly similar approaches to politics. Like Trump, Bolsonaro pulled his nation’s conservative movement further to the right and remains its standard-bearer, evidenced by the large crowds that protested his prosecution across Brazil ahead of his conviction.\n\nOpinion surveys show that nearly two-fifths of Brazil view his prosecution as unjust and that he would be the leading right-wing candidate in next year’s presidential election. A previous ruling in a separate case has barred Bolsonaro from running until the end of the decade. His conviction in the coup plot, if it stands, makes him ineligible to hold office ever again.\n\nIn Brazil, a country with a long history of leaders who have tried, and at times succeeded, to seize power through coups, Bolsonaro’s conviction was seen by many as a victory for democracy.\n\nAs he cast his vote, de Moraes insisted that the evidence showed Brazil had come dangerously close to being plunged back into a dictatorship similar to the one it had endured for more than two decades, because of the actions of “a political group that doesn’t know how to lose an election.”\n\n“It’s impossible to trivialize this return to dark moments in history that we’ve already lived through,” de Moraes said. “And the evidence is abundant.”\n\nIn the sole dissent, one justice, Luiz Fux, absolved Bolsonaro and all but two of his seven collaborators in the plot. In a scathing 14-hour presentation of his vote — which at times lulled some, including Brazil’s top prosecutor, to sleep — he picked apart the evidence in the case and argued that it failed to link Bolsonaro and others to the coup plans.\n\n“It would set a very serious precedent, it would be very dangerous to hold political agents responsible based on generic allegations,” Fux said, while referencing, on more than one occasion, the ill-fitting glove that helped absolve O.J. Simpson.\n\nAnd, offering a glimmer of hope to Bolsonaro, Fux questioned why the case was not being weighed by the full bench of 11 Supreme Court justices, and claimed that the defense had been given too little time to review the evidence.\n\nThis, analysts say, could give Bolsonaro a window to appeal his conviction. Yet, given the makeup of the court, even a vote by the full bench would be expected to uphold the ruling.\n\nIn total, Bolsonaro’s crimes had carried a maximum sentence of 43 years. He had been awaiting the verdict under house arrest, watched closely by the police because the court deemed him a flight risk.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"BRASILIA, Brazil >> Brazil&#8217;s Supreme Court today convicted former President Jair Bolsonaro of overseeing a failed conspiracy to overturn the 2022 Brazilian election in a coup plot that included disbanding courts, empowering the military and assassinating the president-elect.","url":"https://www.staradvertiser.com/2025/09/11/breaking-news/brazils-jair-bolsonaro-sentenced-to-27-years-for-plotting-coup/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/web1_20250910_WEB_BRAZIL-BOLSONARO-4.jpeg","video":null,"publish_date":"2025-09-11 23:20:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"US","sentiment":-0.363},{"id":359722056,"title":"A bitter blame game is pushing the US towards the precipice","text":"The United States has moved one tragic step closer towards the precipice of civil unrest.\n\nThe assassination of conservative commentator Charlie Kirk has placed the already bitterly divided US in a precarious position. \n\nThis is a country with more guns than people — and with an increasingly violent and threatening public discourse, the danger is that it could take only one or two people to resort to the use of a gun to draw armed mobs onto the streets in revenge attacks.\n\nThis is a very dangerous time for the US.\n\nHopefully, it can be drawn back from that precipice. What is needed now is for a president to show real leadership and quickly reduce the heat underneath a country fast approaching boiling point.\n\nDoes Donald Trump have the inclination, or ability, to do that?\n\nAmerica has been rocked by the assassination of Kirk. Even the usually unflappable Speaker of the House of Representatives, Mike Johnson, appeared emotional and shaken when he appeared on television after the shooting. He talked about how US politicians had begun urgent discussions about how to upgrade their security.\n\nIn recent months, many of them have avoided public meetings, after such events — hosted by both Republicans and Democrats — descended into anger to the point where police had to be called.\n\nIn this so-called Land of the Free, many prominent politicians are reluctant to even appear in public. The killing of Kirk with a single shot to the neck from almost 200 metres away will only add to this fear of appearing in public.\n\nSecurity concerns have already been high since last year's attempted assassinations of then-candidate Trump.\n\nIn the hours after the Kirk shooting, two members of Congress who had scheduled media conferences outside the Capitol moved them indoors.\n\nDangerous threats and ghoulish celebrations\n\nIn the wake of Kirk's assassination, social media has been filled with people on the right of US politics calling for \"revenge\" and others on the left celebrating the killing.\n\nIn one video, a university student, asked her reaction to the killing of Kirk, replied with a smile: \"Someone had to do it.\"\n\nAnother, when asked how she felt, replied: \"Happy.\"\n\nOn the other side of this divide were supporters of Kirk. One woman posted: \"Americans are ready for war.\" Another man says to camera: \"This video is for the f***ing liberals. It's war motherf*****s. We're coming for you. We're coming for you.\"\n\nIn the hours after the killing, an ominous scene played out in front of the Idaho State Capitol: a crowd gathered for a vigil for Kirk, but when someone rode a scooter through the crowd people claimed he had come to gloat, and a mob began bashing the scooter rider.\n\nThe US desperately needs a leader who will try to unite the country at this time. But if anything, Trump — who was close to Kirk — has only added to the sense of anger, rather than tried to de-escalate it.\n\nIn an address from the Oval Office, the president told Americans: \"Radical left political violence has hurt too many innocent people and taken too many lives.\"\n\nHe doubled down on the assumption that the assassin was someone from \"the radical left\". \n\nHe said: \"For years, those on the radical left have compared wonderful Americans like Charlie to Nazis and the world's worst mass murderers and criminals. This kind of rhetoric is directly responsible for the terrorism that we're seeing in our country today, and it must stop right now.\"\n\nThe comments were ironic coming from a president who uses his Truth Social website to launch almost-daily attacks on his political opponents, regularly branding them corrupt or part of \"a witch-hunt\" to destroy him.\n\nTrump's deployment of National Guard in Los Angeles and, in recent weeks, Washington DC has only further turned up the temperature.\n\nYears of swelling anger\n\nThe Charlie Kirk killing has galvanised underlying tensions and anger that have been building for many years.\n\nThe divide between the hard right and the hard left of US politics has been growing for a long time.\n\nThe storming of the Capitol building in Washington DC on January 6, 2021, showed how quickly anger in America can translate into violence.\n\nThe left in America insists that Trump dog-whistled for his supporters to storm the seat of US power by proclaiming, as he stood a short distance from the Capitol, that the 2020 election had been stolen from him.\n\nThe right in America responds by saying: examine the words of his speech. He never incited violence, they argue, this was merely individuals angry that an election had been \"stolen\".\n\nRegardless of these contrary arguments, the result was horrific: mobs of pro-Trump thugs stormed the building, terrifying the politicians within and giving the mobs a sense that the storming of the symbol of US democracy and stability was possible.\n\nThose images struck fear into many in America. When Trump ran for re-election, many here braced themselves for violence if he lost.\n\nIn fact, the ambassador of one of the biggest embassies in Washington told me that he and his security staff had drawn up a detailed evacuation plan in the event that Trump lost and the mob decided to take the matter into their own hands. Trump won, so the angry Trump mobs had no reason to take to the streets.\n\nA cycle of violence\n\nEvery few weeks or months, there's a mass shooting in the US.\n\nOnly two weeks ago, a shooter in Minneapolis opened fire in a Catholic church filled with children celebrating the beginning of the new school year, killing two and injuring 18.\n\nSo entrenched is the National Rifle Association (NRA) lobby group with its funding for political candidates that few politicians are game to even mention gun control after yet another shooting.\n\nIf you want money from the NRA, don't mention guns — and if you do mention them say something like \"the US constitution gives the inalienable right for Americans to defend themselves with guns\" and you will not alienate the gun lobby.\n\nIn fact, about the time Kirk was being assassinated there was another shooting in Colorado — a shooter opened fire at the Evergreen High School, killing two fellow students and then himself.\n\nThese frequent mass shootings reveal the madness of America's insistence — entrenched in the constitution to allow Americans to defend themselves from militia groups — that in some states, even someone with a potentially dangerous psychiatric disorder can be entitled to a gun.\n\nAlready, both the far right and the far left are fuelling the flames. Fox News, Trump's network of choice and the flagship of the right in the US, is featuring guest after guest blaming \"the left\" for the assassination of Kirk.\n\nMeanwhile, MSNBC has carried at least one commentator who argued, essentially, that Kirk had been asking for it by his public statements.\n\nThis is even before the shooter has been caught and without any evidence of the killer's motives.\n\nIn the hours after Trump announced to Americans that Kirk had died, the president's son, Eric Trump, appeared on Fox to blame two media outlets — MSNBC and NBC — for the climate that led to the killing of Kirk.\n\nHow it feels here right now\n\nLiving here, you can feel the temperature going up. On a recent Sunday morning, from my apartment in the Washington neighbourhood of Columbia Heights, I heard shouting from the street below.\n\nGoing downstairs, I discovered that someone living in a nearby apartment had been stuck in a lift, so the DC police were called.\n\nBut accompanying them were US Marshals — federal law enforcement officers who have been deployed to the streets as part of Trump's \"law and order crackdown\" on Washington DC.\n\nVarious neighbours in my area have set up WhatsApp groups to notify each other when US marshals or immigration agents turn up.\n\nIt appeared that the US marshals followed the police into the building and took the opportunity to ask people for their residency papers.\n\nNot far away, near a shopping centre on 14th Street, ICE agents raided and took away about 20 people of Hispanic background.\n\nIn Los Angeles, I spoke to one young man of Hispanic background who said ICE agents had been turning up to the Home Depot where he worked and demanding to see the residency papers of anyone judged to be of Latin American appearance.\n\nAnd in Washington DC, a parent from a nearby school told me parents had set up a WhatsApp group to alert parents of Latin American background not to turn up at pick-up time if ICE agents are spotted waiting nearby.\n\nInto all this growing tension comes the horror of 31-year-old Kirk, cut down in his prime by an assassin's bullet.\n\nNow is the time for everyone of influence in the US to use that influence to try to calm the country.\n\nBut if the president himself adds fuel, then the danger will grow.","summary":"In a country with more guns than people, an increasingly violent and threatening public discourse is creating serious dangers. ","url":"https://www.abc.net.au/news/2025-09-12/charlie-kirk-assassination-test-for-donald-trump/105765246","image":"https://live-production.wcms.abc-cdn.net.au/c93fb38b99bddcb41eecb7e733b06c83?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=261&width=862&height=485","video":null,"publish_date":"2025-09-11 23:16:35","author":"John Lyons","authors":["John Lyons"],"language":"en","source_country":"AU","sentiment":-0.25}]}