{"offset":0,"number":50,"available":11743,"news":[{"id":392478812,"title":"US accuses Russia of 'dangerous and inexplicable escalation' of Ukraine war","text":"UNITED NATIONS (AP) — The United States accused Russia on Monday of a “dangerous and inexplicable escalation” of its nearly four-year war in Ukraine at a time when the Trump administration is trying to advance negotiations toward peace.\n\nU.S. deputy ambassador to the United Nations Tammy Bruce singled out Russia’s launch of a nuclear-capable Oreshnik ballistic missile last week close to Ukraine’s border with Poland, a NATO ally.\n\nShe told an emergency meeting of the Security Council that the United States deplores “the staggering number of casualties” in the conflict and condemns Russia’s intensifying attacks on energy and other infrastructure.\n\nUkraine called for the meeting after last Thursday’s overnight Russian bombardment with hundreds of drones and dozens of missiles, including the powerful, new hypersonic Oreshnik missile, which Moscow used for only the second time in what was a clear warning to Kyiv’s NATO allies.\n\nThe large-scale attack came days after Ukraine and its allies reported major progress toward agreeing on how to defend the country from further Moscow aggression if a U.S.-led peace deal is struck.\n\nThe attack also coincided with a new chill in relations between Moscow and Washington after Russia condemned the U.S. seizure of an oil tanker in the North Atlantic. And it came as U.S. President Donald Trump signaled he is on board with a hard-hitting sanctions package meant to economically cripple Russia.\n\nMoscow has given no public signal it is willing to budge from its maximalist demands on Ukraine. And Russia’s U.N. ambassador on Monday blamed the diplomatic impasse on Ukraine. \n\nEurope’s leaders condemned the attack using the Oreshnik as “escalatory and unacceptable,” and U.S. envoy Bruce was equally tough on Monday.\n\n“At a moment of tremendous potential, due only to President Trump’s unparalleled commitment to peace around the world, both sides should be seeking ways to de-escalate,” she said. “Yet Russia’s action risks expanding and intensifying the war.”\n\nBruce reminded Russia that nearly a year ago it voted in favor of a Security Council resolution calling for an end to the conflict in Ukraine.\n\n“It would be nice if Russia matched their words with deeds,” she said. “In the spirit of that resolution, Russia, Ukraine and Europe must pursue peace seriously and bring this nightmare to an end.”\n\nBut Russia’s U.N. Ambassador Vassily Nebenzia told the Security Council that until Ukrainian President Volodymyr Zelenskyy “comes to his senses and agrees to realistic conditions for negotiations, we will continue solving the problem by military means.”\n\n“He was warned long ago, with each passing day, each day which he squanders, the conditions for negotiations will only get worse for him,” Nebenzia said. “Similarly, each vile attack on Russian civilians will elicit a stiff response.”\n\nUkraine’s U.N. Ambassador Andriy Melnyk countered that Russia is more vulnerable now than at any time since the start of the full-scale invasion in February 2022. Its economy is slowing and oil revenue is down. \n\n“Russia wants to sell to this council and the whole U.N. family the impression that it is invincible, but this is another illusion,” he told the council. “The carefully staged image of strength is nothing but smoke and mirrors, completely detached from reality.”","url":"https://apnews.com/article/un-us-russia-ukraine-war-oreshnik-nato-3fa1fda56fe6c537ec762829b145296d","image":"https://dims.apnews.com/dims4/default/e11287c/2147483647/strip/false/crop/4240x2832+0+0/resize/1486x993!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F1c%2F80d0b1c002c943f3dfd34c4bff83%2F14ffa2d6bc20453c8fe40f848f263cd5","video":null,"publish_date":"2026-01-13 00:16:23","author":"Edith M. Lederer","authors":["Edith M. Lederer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.134},{"id":392479412,"title":"US congressman introduces Greenland annexation bill","text":"President Donald Trump has not ruled out the use of force to acquire the island for national security\n\nA bill seeking to make Greenland the 51st US state has been introduced in the House of Representatives, escalating a controversial push by President Donald Trump to bring the Danish territory under American control.\n\nTrump claimed last week that the US must annex Greenland - an autonomous former Danish colony under Copenhagen's sovereignty - to contain Russia and China, suggesting that the two countries would \"take over\" the island unless Washington did it first.\n\nThe \"Greenland Annexation and Statehood Act,\" introduced by Representative Randy Fine (R-FL) on Monday, would authorize the President to take \"whatever steps necessary to annex or acquire Greenland,\" and mandates a report to Congress outlining the steps required for its eventual admission as a US state.\n\n\"Greenland is not a distant outpost we can afford to ignore - it is a vital national security asset,\" Fine stated in a press release. \"Whoever controls Greenland controls key Arctic shipping lanes and the security architecture protecting the United States.\"\n\nWhite House Press Secretary Karoline Leavitt told journalists on Monday that acquiring Greenland remains a \"priority\" for Trump, although she stated there is no specific timeline for action. Following the recent US intervention in Venezuela, media reports indicate that Trump has ordered military commanders todevelop a planfor a potential invasion.\n\nThe legislation's fate in Congress remains uncertain, as the prospect of forceful acquisition has drawn criticism even from within the US political establishment. Republican Senator Rand Paul noted that the plan would likely backfire, while Democratic Senator Chris Murphy warned that any attempt to take Greenland by force would effectively \"end NATO.\"\n\nDenmark maintains that Greenland will not be sold or ceded. Denmark's ambassador to the US, Jesper Moller Sorensen, has insisted the island's future should be decided by its people, the vast majority of whom voted in 2008 to maintain self-governing status within the Kingdom.\n\nBeijing has criticized Trump's attempt to use China and Russia as \"pretexts\" for a deeper push into the region, where seven of the eight Arctic nations are NATO members.\n\nRussian officials have also repeatedly spoken out against the militarization of the Arctic, framing it instead as a zone for peaceful cooperation. While Moscow has yet to officially respond to Trump's latest remarks, it has previously stressed that Greenland's future must be determined by its citizens.","url":"https://www.shanghainews.net/news/278805710/us-congressman-introduces-greenland-annexation-bill","image":"https://image.chitra.live/api/v1/wps/0243f8e/3a269e76-1db9-472d-937f-a79b328aa198/0/ZGMyODExYjgtODY-600x315.jpg","video":null,"publish_date":"2026-01-13 00:00:00","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","category":"politics","source_country":"cn","sentiment":0.037},{"id":392479352,"title":"US Supreme Court now expected to rule on tariffs by January 14","text":"WASHINGTON, D.C.: President Donald Trump's decision on global tariffs received an unexpected breather when the U.S. Supreme Court postponed its rulings on several major cases to January 14.\n\nThe court indicated on its website on January 9 that it could release decisions in argued cases when the justices take the bench during a scheduled sitting on January 14.\n\nThe ruling on tariffs would be a significant test of presidential powers and also decide whether the court is willing to check some of Trump's far-reaching assertions of authority since he returned to office in January 2025. The outcome will also impact the global economy.\n\nOn November 5, both conservative and liberal Supreme Court justices appeared to question whether the tariffs were legal. Trump imposed the tariffs using a 1977 law meant for national emergencies. His administration is appealing lower-court rulings that found he exceeded his authority.\n\nTrump has said the tariffs made the United States financially stronger. In a January 2 social media post, he warned that a Supreme Court ruling against the tariffs would be a \"terrible blow\" to the country.\n\nTrump used the International Emergency Economic Powers Act to impose \"reciprocal\" tariffs on imports from nearly all U.S. trading partners, saying large trade deficits were a national emergency. He also used the same law to impose tariffs on China, Canada, and Mexico, citing fentanyl and illegal drug trafficking as emergencies.\n\nThis week, Trump approved a new bill called the ‘Sanctioning Russia Act of 2025', imposing a 500 percent tariff on any country that buys crude oil from Russia. This would target mainly China, India, and Brazil. \n\nThe lawsuits before the Supreme Court were filed by businesses hurt by the tariffs and by 12 U.S. states, most of them led by Democrats.\n\n\"They can be prosecuted either in state or federal court, by either a U.S. attorney's office or a district attorney's office.\"\n\nThe court, which has a 6–3 conservative majority, is also considering other major cases. One challenge to the Voting Rights Act of 1965 was that it was passed to stop racial discrimination in voting.\n\nAnother case challenges a Colorado law that bans therapists from providing \"conversion therapy\" to LGBT minors, with the challenge based on free speech grounds.","url":"https://www.shanghainews.net/news/278802426/us-supreme-court-now-expected-to-rule-on-tariffs-by-january-14","image":"https://image.chitra.live/api/v1/wps/5d6b52b/993de338-20d5-47ae-aa63-0950cefc9785/2/5-US-Supreme-Court-1-600x315.jpg","video":null,"publish_date":"2026-01-13 00:00:00","author":null,"language":"en","category":"politics","source_country":"cn","sentiment":0.003},{"id":392478898,"title":"Trump Threatens 25% Tariff on Countries Trading With Iran","text":"US President Donald Trump on Monday unveiled a sweeping new trade measure, announcing a 25 percent tariff on any country that does business with Iran, as Washington intensifies pressure on Tehran over its violent response to ongoing protests.\n\n“Effective immediately, any Country doing business with the Islamic Republic of Iran will pay a Tariff of 25% on any and all business being done with the United States of America. This Order is final and conclusive,” Trump wrote on Truth Social.\n\nAccording to data from economic database Trading Economics, Iran’s key trading partners include China, Turkey, the United Arab Emirates and Iraq.\n\nThe tariff announcement comes as Trump considers potential military responses to the situation in Iran, where rights groups say the death toll from the crackdown on protesters is continuing to rise.\n\n“Air strikes would be one of the many, many options that are on the table,” White House Press Secretary Karoline Leavitt said earlier on Monday.\n\nShe added, however, that Iran still has a diplomatic channel open through Trump’s special envoy, Steve Witkoff, noting that Tehran has adopted a “far different tone” in private discussions compared to its public rhetoric.\n\nOpinion Nigeria News","url":"https://www.opinionnigeria.com/trump-threatens-25-tariff-on-countries-trading-with-iran/","image":"https://www.opinionnigeria.com/wp-content/uploads/2025/07/DonaldTrump.jpg","video":null,"publish_date":"2026-01-12 23:48:37","author":"Opinion Nigeria","authors":["Opinion Nigeria"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.147},{"id":392480802,"title":"BBC told to modernise 'outdated' Wimbledon: All England Club urge broadcaster to revamp coverage - including 'out of touch' presenters - with contract up for renewal in 2027","text":"The All England Club have reportedly urged the BBC to improve its 'stale' coverage of Wimbledon if the broadcaster is to continue showing the tournament. \n\nThe BBC, which first aired radio coverage from Wimbledon 100 years ago, will see its current deal end after the 2027 tournament.\n\nIt's thought chiefs have already begun talks over a potential renewal, with the BBC almost certainly in-line to continue its partnership with the home of British tennis beyond next year.\n\nHowever, according to The Times, there's a 'strong' feeling among those at the All England Club that coverage of the sport's oldest Grand Slam must improve. \n\nThe BBC's programme, which was fronted by Clare Balding, Isa Guha and Qasa Alom last year, has been dubbed outdated in some quarters, the publication reports, with some of the presenters branded 'out of touch'.\n\nAn insider industry source said: 'John McEnroe is great - although he can split opinion - but some of the other presenters and pundits seem out of touch and not really up to date with a lot of the players. \n\n'There is obviously a balance to be struck to cater for those who like the traditional aspect of the BBC's Wimbledon coverage, but it definitely needs to look at what is happening in other tennis coverage.'\n\nThe quality of both Sky and TNT Sports' coverage is understood to have left directors at Wimbledon concerned that the BBC's could be outshone. \n\nSky, which holds rights to show the Premier League, darts and the summer of cricket, has recently launched its own tennis channel which broadcasts the ATP and WTA tournaments as well as the US Open until 2029. \n\nIts coverage is fronted by legendary British tennis player Tim Henman and former female star Laura Robson, who was rumoured to be spearheading TNT's broadcasts of The Ashes, though a deal never materialised. \n\nTNT meanwhile covered the French Open back in May, won by Carlos Alcaraz, and will broadcast the Australian Open when it gets underway later this week.\n\nDespite its coverage of The Ashes being dubbed 'very amateur', its tennis showing has largely impressed.\n\nBut it's ultimately hugely unlikely that the BBC could lose its long-standing deal with Wimbledon, particularly because the men's and women's finals are classed as Group A Listed Events, meaning they must be shown on free-to-air television. \n\nIf the tournament moved away from the BBC, there would also be fears of viewing numbers decreasing. A whopping 8.8million people tuned in to watch Jannik Sinner lift his maiden Wimbledon trophy last summer.\n\nA source at Wimbledon told The Times: 'It's not about the money or necessarily the highest bidder, it is about what is right for Wimbledon and it is almost impossible for another broadcaster to provide the viewership the BBC does.'\n\nIt's likely that any decision on the next rights deal will wait until the BBC have appointed a successor for Tim Davie. \n\nThe former director-general resigned in early November amid a row over the doctoring of a Donald Trump speech for a Panorama episode. \n\nThe All England Club declined to comment when approached by Daily Mail Sport.","summary":"The BBC, which first aired radio coverage from Wimbledon 100 years ago, will see its current broadcast deal end after the 2027 tournament.","url":"https://www.dailymail.co.uk/sport/football/article-15457417/BBC-told-modernise-outdated-Wimbledon.html","image":"https://i.dailymail.co.uk/1s/2026/01/12/22/105456847-0-image-m-22_1768256497243.jpg","video":null,"publish_date":"2026-01-12 23:45:57","author":"Editor,Gethin Hicks","authors":["Editor","Gethin Hicks"],"language":"en","source_country":"gb","sentiment":0.223},{"id":392479600,"title":"Trump says any country doing business with Iran will face 25 percent tariff","text":"United States President Donald Trump has said that countries that engage in trade with Iran will face a 25 percent tariff on any business done with the US.\n\nTrump announced the decision in a social media post on Monday, stating that it was “final and conclusive”, but offering few additional details.\n\n“Effective immediately, any Country doing business with the Islamic Republic of Iran will pay a Tariff of 25% on any and all business being done with the United States of America,” Trump said in a post on his website, Truth Social.\n\nIt is not clear which countries might be affected, but major economies such as Russia, China, Brazil and Turkiye all trade with Iran, which has been roiled by widespread antigovernment protests and riots over the past week.\n\nIraq and the United Arab Emirates are also important trading partners, according to the database Trading Economics.\n\nIn recent weeks, Trump has ratcheted up pressure on Tehran and threatened further military strikes on the country, should it fail to abide by US demands to wind down its nuclear and military programmes.\n\n“Now, I hear that Iran is trying to build up again, and if they are, we’re going to have to knock them down,” Trump told reporters in December. “We’ll knock them down. We’ll knock the hell out of them. But, hopefully, that’s not happening.”\n\nIn June, the US bombed three Iranian nuclear facilities as part of a 12-day war initiated by Israel. US strikes on Iran likely constitute a violation of international law, according to legal experts.\n\n“Air strikes would be one of the many, many options that are on the table,” White House Press Secretary Karoline Leavitt said on Monday, adding that Trump remains interested in diplomacy, if possible.\n\nTrump has also criticised Iran’s harsh crackdown on antigovernment protesters and warned that any violence could also lead to a US strike.\n\nIn a January 2 post on Truth Social, the US president indicated he would consider taking military action should protesters be killed.\n\n“If Iran shots [sic] and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue. We are locked and loaded and ready to go,” he wrote.\n\nThe threat came one day before the US launched a military attack in Venezuela, which resulted in the abduction of President Nicolas Maduro and his wife, Cilia Flores.\n\nStill, human rights groups have warned that hundreds of people have been killed in Iran, but an internet blackout in the country has restricted the flow of information.","summary":"The US president has threatened Iran with military strikes amid widespread antigovernment protests there.","url":"https://www.aljazeera.com/news/2026/1/12/trump-says-any-country-doing-business-with-iran-will-face-25-percent-tariff?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2026/01/ap_6964d05a02e8a-1768214618.jpg?resize=1920%2C1440","video":null,"publish_date":"2026-01-12 23:24:28","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.214},{"id":392477552,"title":"New Travel Warning Issued for US Citizens in Iran: &#039;Leave Now&#039;","text":"The U.S. State Department and Virtual Embassy Tehran issued a sweeping warning to American citizens in Iran to “leave now,” citing a surge in nationwide protests, violence and internet blackout. The advisory came Monday as Iran entered its third week of anti-government demonstrations, with hundreds killed and thousands detained, according to rights groups and news reports. Why It Matters This urgent call to leave Iran highlights the soaring risks amid ongoing civil unrest in the Middle Eastern nation. The U.S. has no embassy or consulate there. The Swiss Embassy in Tehran provides emergency services only, with routine consular assistance unavailable. U.S. citizens in detention—especially dual nationals—rarely receive outside aid. Recent events—including security crackdowns, restrictions on foreign travel and a near-complete telecommunications blackout—have made conditions highly perilous for foreigners in Iran. In a frame grab from footage circulating on social media, protesters dance and cheer around a bonfire as they take to the streets despite an intensifying crackdown as the Islamic Republic remains cut off from the rest of the world, in Tehran, Iran, on January 9. (UGC via AP, File) What To Know The U.S. State Department has maintained its highest travel advisory—Level 4: Do Not Travel—for Iran, explicitly warning that U.S. citizens risk arbitrary detention, torture and denial of consular support as anti-government protests have spread nationwide. Last month, the department reported cases in which Americans, especially dual U.S.-Iranian citizens, faced lengthy imprisonment and were denied legal due process. Iranian law does not recognize dual citizenship, treating U.S.-Iranian dual nationals solely as Iranians and excluding them from U.S. or Swiss consular intervention. Human rights organizations on Sunday reported at least 503 protesters had been killed and nearly 10,700 arrested across the country. Iranian authorities have imposed a near-total blockade of mobile, landline and internet services, with users losing connectivity for up to four straight days. In parallel, the government has intensified security across urban centers by closing roads, disrupting transit and raiding homes suspected of illicit satellite communications. Authorities said the blackout would remain in place until they restore what they define as national security, CNN reported. On Monday, U.S. President Donald Trump announced a 25 percent tariff on nations conducting business with Iran, as the administration weighed possible military options. The White House said that while private messages from Iranian officials hint at a willingness to negotiate, public rhetoric remained hostile. Iranian officials, including Supreme Leader Ayatollah Ali Khamenei, blamed foreign interference for unrest and threatened retribution against U.S. interests in the region, CNN also reported. Due to suspended flights and heightened risks, Americans are advised to leave Iran by land—particularly to Armenia or Turkey, where border crossings remained open as of Monday. Those seeking to cross into Turkmenistan require advance authorization, while entry into Azerbaijan may be restricted, the embassy alert said. What People Are Saying Virtual Embassy Tehran, in a security alert: “Protests across Iran are escalating. Increased security measures, road closures, public transportation disruptions, and internet blockages are ongoing. Airlines continue to limit or cancel flights to and from Iran, with several suspending service until Friday, January 16. U.S. citizens should expect continued internet outages, plan alternative means of communication, and, if safe to do so, consider departing Iran by land to Armenia or Türkiye. U.S.-Iranian dual nationals must exit Iran on Iranian passports. The Iranian government does not recognize dual nationality and will treat U.S.-Iranian dual nationals solely as Iranian citizens. U.S. nationals are at significant risk of questioning, arrest, and detention in Iran. Showing a U.S. passport or demonstrating connections to the United States can be reason enough for Iranian authorities to detain someone.“ The U.S. State Department, via its website: “Do not travel to Iran due to the risk of terrorism, unrest, kidnapping, arbitrary arrest of U.S. citizens, and wrongful detention. Do not travel to Iran for any reason. U.S. citizens in Iran should leave immediately. There is no U.S. Embassy in Iran.“ Trump, in a Truth Social post Monday: “Effective immediately, any Country doing business with the Islamic Republic of Iran will pay a Tariff of 25% on any and all business being done with the United States of America. This Order is final and conclusive. Thank you for your attention to this matter!“ Mohammad Baqer Qalibaf, Iranian parliament speaker, via Press TV Monday, per CNN: “Come and see what will happen to American ships and military bases in the region. Come and burn in the fire of the Iranian nation so severely that it becomes a lasting lesson in history for all oppressive U.S. rulers. Come and find out what will happen to you and to the region.“ White House Press Secretary Karoline Leavitt, on Monday: “What you’re hearing publicly from the Iranian regime is quite different from the messages the administration is receiving privately, and I think the president has an interest in exploring those messages.“ What Happens Next U.S. officials continue advising citizens to avoid travel to Iran and to leave the country immediately if present, warning that the risks—arrest, violence or prolonged detention—outweigh all other considerations. Flights remain restricted, making land borders the primary exit option. The U.S. government is monitoring the developments for any opportunities to assist remaining citizens, but emphasizes that Americans should not rely on U.S. help. Diplomatic engagement between the U.S. and Iran remains strained, as both sides consider their response to the ongoing protests and crackdown.","summary":"Human rights organizations reported at least 503 deaths and 10,700 arrests across the country on Sunday.","url":"https://www.newsweek.com/new-travel-warning-issued-for-us-citizens-in-iran-leave-now-11348437","image":"https://assets.newsweek.com/wp-content/uploads/2026/01/AP26012611948846.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-01-12 23:11:03","author":"Hollie Silverman","authors":["Hollie Silverman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.454},{"id":392477498,"title":"Trump Reportedly Isn’t Happy With Pam Bondi","text":"President Donald Trump has privately criticized Attorney General Pam Bondi as weak and an ineffective enforcer, according to a Wall Street Journal report published Monday.\n\nTrump has expressed particular anger, according to the Journal, over the Justice Department’s failure to keep high-profile cases against former FBI Director James Comey and New York Attorney General Letitia James alive after a judge dismissed the charges, citing an allegedly improper appointment. The president has floated potential remedies, including the appointment of special counsels, as he pushes for swifter legal action against his adversaries. (RELATED: DOJ Admits Less Than 1% of Epstein Records Have Been Made Public)\n\nThe tensions have been compounded by a protracted controversy surrounding Bondi’s handling of document releases related to Jeffrey Epstein — an episode that fractured her standing with parts of the president’s base and drew pointed criticism from inside the White House.\n\n“I think she completely whiffed on appreciating that that was the very targeted group that cared about this,” White House chief of staff Susie Wiles told Vanity Fair in December, referring to Bondi’s management of the Epstein document release.\n\n The Department of Justice previously stated we will bring charges against anyone involved in the trafficking and exploitation of Jeffrey Epstein’s victims. We reaffirm this commitment, and ask any victim to please come forward with any information pertaining to any individuals… — Attorney General Pamela Bondi (@AGPamBondi) December 21, 2025\n\nThe dispute dates to February 2025, when Bondi presented conservative influencers with binders labeled “The Epstein Files: Phase 1” during a White House visit. The materials were met with swift disappointment: much of the contents had already surfaced through litigation and prior news coverage.\n\nBondi characterized the release as the beginning of a transparency initiative, with the Justice Department announcing “the first phase of declassified Epstein files.” But the spectacle gave way to backlash on the right when the documents failed to deliver the new names and revelations many had anticipated. ABC News reported that senior White House officials were frustrated Bondi had not alerted them beforehand, and that even the pro-Trump activist Laura Loomer denounced what she called the “unprofessional” rollout.\n\nWiles told Vanity Fair that Bondi had distributed “binders full of nothingness,” then compounded the damage by saying a “client list” sat on her desk — a claim Wiles dismissed. Conservative commentator Liz Wheeler, among the influencers who received a binder, later demanded an explanation for why “phase 1” contained “nothing,” as the controversy became a test of loyalty among pro-Trump media figures, according to The Washington Post.","summary":"'I think she completely whiffed'","url":"https://dailycaller.com/2026/01/12/donald-trump-doj-attorney-general-not-happy-pam-bondi/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-2229004130-scaled-e1768257448964.jpg","video":null,"publish_date":"2026-01-12 23:00:31","author":"Thomas English","authors":["Thomas English"],"language":"en","category":"politics","source_country":"us","sentiment":-0.4},{"id":392475754,"title":"The Trump Administration Says It’s Cracking Down On Fraud. It Gave A Red State A Pass.","text":"WASHINGTON – President Donald Trump’s administration has tried to shut down federal welfare spending in Democratic states over fraud cases in Minneapolis, proclaiming it the government’s duty “to protect taxpayer dollars and ensure these programs serve the families they were created to help.”\n\nBut the same administration let Republican-led Mississippi off the hook last year for one of the biggest welfare fraud scandals of all time. \n\nShortly before President Joe Biden left office, the Department of Health and Human Services’ Administration for Children and Families levied a $100 million penalty against Mississippi for allowing fraudsters to embezzle funds from the federal Temporary Assistance for Needy Families program. The penalty reflected the estimated size of the fraud. \n\nBut the Trump administration reversed the decision in April after the Mississippi Department of Human Services said it uncovered records that could validate some of its allegedly improper spending, rescinding the penalty, and telling the state it would “issue a new penalty letter at the appropriate time.” Eight months later, no new letter has been sent. \n\nIn a statement on Monday, a spokesperson for HHS told HuffPost the ACF is “evaluating options to follow up with Mississippi.” \n\nThe deliberative back-and-forth between Mississippi and the federal government stands in stark contrast to the preemptive funding cutoff the Trump administration announced last week for several Democratic-led states. It calls into question whether the administration’s professed desire to stamp out fraud has more to do with politics than good governance.\n\nIn response to the fraud scandal in Minnesota — which includes dozens of well-documented and prosecuted criminal cases in addition to unproven allegations by a right-wing YouTuber — HHS announced a wholesale cutoff of funding under the Temporary Assistance for Needy Families program, as well as two other federal programs that help with child care. And not just in Minnesota, but also in the blue states of California, Colorado, Illinois and New York. \n\n“There’s certainly a disparate effect here, in terms of these five blue states and that one particular red state,” Nick Gwyn, an expert on federal-state welfare programs with the liberal Center on Budget and Policy Priorities, told HuffPost.\n\nOn Friday, a federal judge put a temporary hold on the funding freeze. Child care providers have told HuffPost the freeze could force them to lay off staff and turn children away.\n\nThe Mississippi TANF scandal drew national attention because one of the recipients of the improper payments was former NFL star Brett Favre, who was not charged with a crime and has maintained he had no idea it wasn’t OK for him to receive the money. \n\nThe broad outlines of the Mississippi and Minnesota cases are similar. The way TANF and many other federal social service programs work is that states get funds from the federal government, then issue grants to nonprofits that provide the actual services, such as nutrition and child care, to low-income families. Lawmakers promoted the grant scheme as an alternative to giving money directly to poor people. \n\nIn Mississippi and Minnesota, nonprofits took money without providing services. Six people were charged with crimes in Mississippi and the state filed civil complaints against others for mishandling funds.\n\nDuring congressional testimony in 2024, Favre complained that the scandal wrecked his reputation even though he’d done nothing wrong and gave back the money he’d improperly received. \n\n“I have learned that nobody was or is watching how TANF funds are spent,” he said. “States have too much flexibility in how they spend this money.”","url":"https://www.huffpost.com/entry/minnesota-welfare-fraud-trump-hhs-blue-states_n_69655c91e4b0365ff4dfc607?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/69655ce91700000608aac95a.jpeg?ops=1778_1000","video":null,"publish_date":"2026-01-12 22:11:38","author":"Arthur Delaney","authors":["Arthur Delaney"],"language":"en","category":"politics","source_country":"in","sentiment":-0.328},{"id":392475838,"title":"The Trump Administration Says It’s Cracking Down On Fraud. It Gave A Red State A Pass.","text":"WASHINGTON – President Donald Trump’s administration has tried to shut down federal welfare spending in Democratic states over fraud cases in Minneapolis, proclaiming it the government’s duty “to protect taxpayer dollars and ensure these programs serve the families they were created to help.”\n\nBut the same administration let Republican-led Mississippi off the hook last year for one of the biggest welfare fraud scandals of all time. \n\nShortly before President Joe Biden left office, the Department of Health and Human Services’ Administration for Children and Families levied a $100 million penalty against Mississippi for allowing fraudsters to embezzle funds from the federal Temporary Assistance for Needy Families program. The penalty reflected the estimated size of the fraud. \n\nBut the Trump administration reversed the decision in April after the Mississippi Department of Human Services said it uncovered records that could validate some of its allegedly improper spending, rescinding the penalty, and telling the state it would “issue a new penalty letter at the appropriate time.” Eight months later, no new letter has been sent. \n\nIn a statement on Monday, a spokesperson for HHS told HuffPost the ACF is “evaluating options to follow up with Mississippi.” \n\nThe deliberative back-and-forth between Mississippi and the federal government stands in stark contrast to the preemptive funding cutoff the Trump administration announced last week for several Democratic-led states. It calls into question whether the administration’s professed desire to stamp out fraud has more to do with politics than good governance.\n\nIn response to the fraud scandal in Minnesota — which includes dozens of well-documented and prosecuted criminal cases in addition to unproven allegations by a right-wing YouTuber — HHS announced a wholesale cutoff of funding under the Temporary Assistance for Needy Families program, as well as two other federal programs that help with child care. And not just in Minnesota, but also in the blue states of California, Colorado, Illinois and New York. \n\n“There’s certainly a disparate effect here, in terms of these five blue states and that one particular red state,” Nick Gwyn, an expert on federal-state welfare programs with the liberal Center on Budget and Policy Priorities, told HuffPost.\n\nOn Friday, a federal judge put a temporary hold on the funding freeze. Child care providers have told HuffPost the freeze could force them to lay off staff and turn children away.\n\nThe Mississippi TANF scandal drew national attention because one of the recipients of the improper payments was former NFL star Brett Favre, who was not charged with a crime and has maintained he had no idea it wasn’t OK for him to receive the money. \n\nThe broad outlines of the Mississippi and Minnesota cases are similar. The way TANF and many other federal social service programs work is that states get funds from the federal government, then issue grants to nonprofits that provide the actual services, such as nutrition and child care, to low-income families. Lawmakers promoted the grant scheme as an alternative to giving money directly to poor people. \n\nIn Mississippi and Minnesota, nonprofits took money without providing services. Six people were charged with crimes in Mississippi and the state filed civil complaints against others for mishandling funds.\n\nDuring congressional testimony in 2024, Favre complained that the scandal wrecked his reputation even though he’d done nothing wrong and gave back the money he’d improperly received. \n\n“I have learned that nobody was or is watching how TANF funds are spent,” he said. “States have too much flexibility in how they spend this money.”","url":"https://www.huffpost.com/entry/minnesota-welfare-fraud-trump-hhs-blue-states_n_69655c91e4b0365ff4dfc607?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/69655ce91700000608aac95a.jpeg?ops=1778_1000","video":null,"publish_date":"2026-01-12 22:11:38","author":"Arthur Delaney","authors":["Arthur Delaney"],"language":"en","category":"politics","source_country":"in","sentiment":-0.328},{"id":392478846,"title":"Colombian rebel group ELN calls for a 'national accord' with the government","text":"BOGOTA, Colombia (AP) — Colombia’s largest remaining rebel group called for a “national accord” to overcome political conflicts in the South American nation, as it faces the prospect of attacks from the governments of both Colombia and the United States.\n\nIn a statement published Monday on its X account, the National Liberation Army, or ELN, said that after elections in Colombia this year, the group would like to work with the nation’s new government to design agreements aimed at defeating poverty, protecting ecosystems and “overcoming” the drug trade in rural areas.\n\nThe statement follows reports that the governments of Colombia and the United States are looking for ways to conduct joint operations against the ELN, a group that Colombian President Gustavo Petro has described as “drug traffickers dressed up as guerrilla fighters.”\n\nPressure on ELN has increased since early this month when the United States captured Venezuela’s former President Nicolás Maduro in a pre-dawn raid and flew him to the U.S. to face drug trafficking charges. The indictment against Maduro in the New York case accuses Maduro of providing protection to the ELN in Venezuelan territory and working with the group to traffic cocaine. \n\nSince the raid, officials in Colombia are taking steps to weaken the group’s position in Venezuela.\n\nLast week Colombian Interior Minister Armando Benedetti said that President Petro and U.S. President Donald Trump discussed the ELN and its role in drug trafficking during a phone call that decreased tensions between the two leaders.\n\nAccording to Benedetti, the presidents discussed possible joint operations against the ELN. In an interview with Colombian radio station Blu, Bendetti said that “the issue (with the ELN) is that they need to be attacked when they retreat” into camps in Venezuela.\n\nPetro said in a message posted Monday on X that the ELN has to give up drug trafficking and recruiting minors if it wants peace talks to resume. The president also called on the rebel group to to stop using camps in Venezuela, or face “joint actions” that also involve Venezuela’s government.\n\nThe Colombian government suspended peace talks with the ELN last year, after the group staged an offensive in the northeastern Catatumbo region that forced more than 50,000 people to flee their homes.\n\nThe ELN was founded in the 1960s by students and union leaders inspired by the Cuban revolution. It currently has around 5,000 fighters operating in Colombia and Venezuela.","url":"https://apnews.com/article/colombia-eln-rebels-venezuela-maduro-4cdf09becee1e918bd8610b938f81698","image":"https://dims.apnews.com/dims4/default/ad31439/2147483647/strip/false/crop/4875x3250+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fe3%2F9a80aa819f3da77d659eac065fcd%2F26f5449fe50e410f9796a6eac45cec79","video":null,"publish_date":"2026-01-12 22:00:01","author":"Manuel Rueda","authors":["Manuel Rueda"],"language":"en","category":"politics","source_country":"us","sentiment":-0.131},{"id":392477488,"title":"‘Not A Crisis’: Trump-Loving NATO Boss Shrugs Off Europe’s Greenland Fears","text":"NATO Secretary General Mark Rutte struck a markedly different tone from several European leaders on President Donald Trump renewing his call for the U.S. to take control of Greenland, dismissing concerns that the alliance is facing a crisis over it.\n\nEuropean officials, including Danish Prime Minister Mette Frederiksen and EU Defense Commissioner Andrius Kubilius, have sharply criticized Trump’s renewed pressure campaign, warning that a U.S. takeover of Greenland could effectively spell the end of NATO. Rutte, however — who is often complimentary of Trump — rejected the notion that the alliance is under threat.\n\n“No, not at all. And I think we are really working in the right direction,” Rutte said when asked by a reporter whether NATO was facing a crisis due to Trump’s push on Greenland.\n\n“All allies agree on the importance of the Arctic and Arctic security,” the NATO chief said. “And currently we are discussing … how to make sure that we give practical follow-up on those discussions.” (RELATED: Eurocrats Melt Down Over Trump Barring Censorship Police From US)\n\nThe Trump administration has intensified its insistence in recent weeks that Greenland should become U.S. territory. Trump has long argued that the self-governing territory within the Kingdom of Denmark — strategically positioned between the U.S., Russia, and Europe and rich in critical minerals — is vital to American security interests.\n\n“The president and his team are discussing a range of options to pursue this important foreign policy goal, and of course, utilizing the U.S. military is always an option at the commander-in-chief’s disposal,” the White House said on Jan. 6.\n\nTrump has justified the push by citing increased Russian and Chinese activity near Greenland, warning that Denmark and Greenland are ill-equipped to address the threat.\n\n“Greenland should make the deal because Greenland does not want to see Russia or China take over,” Trump said on Sunday. “Basically, their defense is two dog sleds.”\n\nRutte, on Monday, appeared broadly aligned with Trump’s assessment of the security risks in the region.\n\n“My only worry is, how do we stay safe against the Russians, against any other adversary? Look at what China is doing in rapidly building up its own armed forces,” Rutte said.\n\n“We are working now together to see how we can basically together as an alliance … to work together to indeed build that next step, which is crucial. That’s the United States, that’s Canada, that’s Iceland, Denmark, and the other European countries,” Rutte added.\n\nTrump’s remarks have sparked fierce backlash from Danish, Greenlandic, and European leaders.\n\n“If the United States chooses to attack another NATO country militarily, then everything stops,” Frederiksen said on Jan. 6. “That is, including our NATO and thus the security that has been provided since the end of the Second World War.”\n\nKubilius echoed the warning, telling Reuters on Monday, “It will be the end of NATO, but also among people it will be also very, very negative.”\n\nFrench President Emmanuel Macron also condemned Trump’s rhetoric, urging Europe to reject what he described as a return to “new colonialism.”\n\n“The United States is an established power that is gradually turning away from some of its allies and breaking free from the international rules that it used to promote,” Macron said Thursday. “Every day, people are wondering if Greenland will be invaded.”\n\nRutte, however, pointed to what he described as Trump’s positive impact on NATO, crediting the president with pressuring NATO members to dramatically increase defense spending.\n\n“I believe that Donald Trump is doing the right things for NATO, by encouraging us all to spend more, to equalize this, what the U.S. is spending,” Rutte said. “We had a very successful summit in The Hague, where we decided on the 5% defense spending, including 3.5% from core defense.”\n\n“I’m absolutely convinced without Donald Trump, we would never have had that result at the summit in The Hague,” he added.\n\nTrump declared on his Truth Social platform on Jan. 7 that the U.S would “always be there for NATO, even if they won’t be there for us.”\n\nStill, when asked in a Jan. 8 New York Times interview whether acquiring Greenland or preserving NATO was the higher priority, Trump declined to answer directly, acknowledging only that “it may be a choice.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"‘Not a crisis’","url":"https://dailycaller.com/2026/01/12/not-a-crisis-trump-loving-nato-boss-shrugs-off-europes-greenland-fears/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-2242668193-scaled-e1768252738683.jpg","video":null,"publish_date":"2026-01-12 21:53:23","author":"Melissa O'rourke","authors":["Melissa O'rourke"],"language":"en","category":"politics","source_country":"us","sentiment":0.083},{"id":392475740,"title":"CNN’s Jake Tapper Uses Jan. 6 To Confront Kristi Noem’s Hypocrisy On Cop Safety To Her Face","text":"Kristi Noem turned evasive when CNN’s Jake Tapper suggested she was holding Immigration and Customs Enforcement officers to a “different standard” than law enforcement officers who defended the U.S. Capitol during the Jan. 6, 2021, insurrection. \n\nAppearing on CNN’s “State of the Union” Sunday, the homeland security secretary defended her assertion that Renee Nicole Good, 37, had been committing “an act of domestic terrorism” when she was shot and killed by ICE officer Jonathan Ross in Minneapolis last week. \n\nHowever, when Tapper asked Noem if officers who were present at the Capitol during the 2021 attack would have been “justified in shooting and killing the people causing them physical harm,” she dodged the question completely. \n\n“Every single situation is going to rely on the situation those officers are on,” Noem said. “But they know that when people are putting hands on them, when they are using weapons against them, when they’re physically harming them, that they have the authority to arrest those individuals.”\n\nAfter Tapper pointed out that President Donald Trump pardoned the rioters at the Capitol, including those who had been charged with assaulting police officers, Noem once again deflected. \n\n“That’s one thing that President Trump has been so focused on — is making sure that when we’re out there, we don’t pick and choose which situations are en— which laws are enforced and which ones aren’t,” she said. “Every single one is being enforced under the Trump administration, and the clarity of the law stands. And if people don’t like it, these members of Congress and elected officials should go change the law and make sure they have that debate.”\n\nTapper, however, was not convinced. \n\n“I just showed you video of people attacking law enforcement officers ― undisputed proof, undisputed evidence,” he said. “And I just said President Trump pardoned all of them. And you said that President Trump is enforcing all the laws equally. It’s just not true. There’s a different standard for law enforcement officials being attacked if they’re being attacked by Trump supporters.”\n\nNoem, however, simply doubled down on her claim that the Trump administration was focused on bringing “perpetuators of violence back to justice,” and did not mention Jan. 6 at all. \n\nNoem and other members of the Trump administration have defended Ross’ shooting of Good as self-defense. Multiple video recordings, however, show Good was trying to pull away from the officers when Ross shot into her vehicle.\n\nMoments after Noem’s “State of the Union” appearance, Minneapolis Mayor Jacob Frey quickly rejected her “wild and crazy” claims.\n\n“You know how many shootings we’ve had so far this year? Two, and one of them was ICE,” he told Tapper. “This is a safe city. ICE and Kristi Noem and everything they’re doing is making it far less safe.” \n\nHe went on to note: “Am I biased in this? Of course, and I’m biased because I’ve got two eyes. Anybody can see these videos. Anybody can see that this victim is not a domestic terrorist.” \n\nWatch Jake Tapper’s interview with Kristi Noem here.","url":"https://www.huffpost.com/entry/kristi-noem-jake-tapper-minneapolis-ice-shooting_n_69652128e4b030a990814e0c?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/69652bd51a00001607e4c580.jpeg?cache=iwaWJPr00q&ops=1778_1000","video":null,"publish_date":"2026-01-12 21:51:40","author":"Curtis M. Wong","authors":["Curtis M. Wong"],"language":"en","category":"politics","source_country":"in","sentiment":-0.482},{"id":392475792,"title":"CNN’s Jake Tapper Uses Jan. 6 To Confront Kristi Noem’s Hypocrisy On Cop Safety To Her Face","text":"Kristi Noem turned evasive when CNN’s Jake Tapper suggested she was holding Immigration and Customs Enforcement officers to a “different standard” than law enforcement officers who defended the U.S. Capitol during the Jan. 6, 2021, insurrection. \n\nAppearing on CNN’s “State of the Union” Sunday, the homeland security secretary defended her assertion that Renee Nicole Good, 37, had been committing “an act of domestic terrorism” when she was shot and killed by ICE officer Jonathan Ross in Minneapolis last week. \n\nHowever, when Tapper asked Noem if officers who were present at the Capitol during the 2021 attack would have been “justified in shooting and killing the people causing them physical harm,” she dodged the question completely. \n\n“Every single situation is going to rely on the situation those officers are on,” Noem said. “But they know that when people are putting hands on them, when they are using weapons against them, when they’re physically harming them, that they have the authority to arrest those individuals.”\n\nAfter Tapper pointed out that President Donald Trump pardoned the rioters at the Capitol, including those who had been charged with assaulting police officers, Noem once again deflected. \n\n“That’s one thing that President Trump has been so focused on — is making sure that when we’re out there, we don’t pick and choose which situations are en— which laws are enforced and which ones aren’t,” she said. “Every single one is being enforced under the Trump administration, and the clarity of the law stands. And if people don’t like it, these members of Congress and elected officials should go change the law and make sure they have that debate.”\n\nTapper, however, was not convinced. \n\n“I just showed you video of people attacking law enforcement officers ― undisputed proof, undisputed evidence,” he said. “And I just said President Trump pardoned all of them. And you said that President Trump is enforcing all the laws equally. It’s just not true. There’s a different standard for law enforcement officials being attacked if they’re being attacked by Trump supporters.”\n\nNoem, however, simply doubled down on her claim that the Trump administration was focused on bringing “perpetuators of violence back to justice,” and did not mention Jan. 6 at all. \n\nNoem and other members of the Trump administration have defended Ross’ shooting of Good as self-defense. Multiple video recordings, however, show Good was trying to pull away from the officers when Ross shot into her vehicle.\n\nMoments after Noem’s “State of the Union” appearance, Minneapolis Mayor Jacob Frey quickly rejected her “wild and crazy” claims.\n\n“You know how many shootings we’ve had so far this year? Two, and one of them was ICE,” he told Tapper. “This is a safe city. ICE and Kristi Noem and everything they’re doing is making it far less safe.” \n\nHe went on to note: “Am I biased in this? Of course, and I’m biased because I’ve got two eyes. Anybody can see these videos. Anybody can see that this victim is not a domestic terrorist.” \n\nWatch Jake Tapper’s interview with Kristi Noem here.","url":"https://www.huffpost.com/entry/kristi-noem-jake-tapper-minneapolis-ice-shooting_n_69652128e4b030a990814e0c?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/69652bd51a00001607e4c580.jpeg?cache=iwaWJPr00q&ops=1778_1000","video":null,"publish_date":"2026-01-12 21:51:40","author":"Curtis M. Wong","authors":["Curtis M. Wong"],"language":"en","category":"politics","source_country":"in","sentiment":-0.482},{"id":392478708,"title":"Washington inspector general investigates police force crime data","text":"WASHINGTON (AP) — Washington’s inspector general’s office announced on Monday that it has started an investigation into the Metropolitan Police Department’s crime data reporting system, the latest in a series of probes into how the force has collected its crime statistics.\n\nIn a letter to interim police Chief Jeffery Carroll, Inspector General Daniel Lucas said his overall objective is “to assess the design, implementation, and operation of MPD’s internal control system for collecting, classifying and reporting crime data and statistics.”\n\nThe police force’s crime statistics collection has faced increasing scrutiny from authorities in recent weeks. That has come after President Donald Trump issued a monthlong emergency order last summer that federalized the police force and launched a federal law enforcement operation in the nation’s capital that his Republican administration said was meant to fight crime.\n\nA report released last month by the House Committee on Oversight and Government Reform found that then-police Chief Pamela Smith often threatened, punished and retaliated against police commanders who presented her with “spikes in crime.” The police chief in the nation’s capital pressured subordinates to manipulate department data to artificially lower the city’s crime rates, according to the a report by the Republican-led congressional committee.\n\nA separate investigation by U.S. Attorney Jeanine Pirro’s office also found that a significant number of MPD reports had been misclassified to make crime rates appear lower than they are. Pirro’s office began its investigation in August as Trump ordered a surge of federal law enforcement officers into the heavily Democratic city to battle what he called out of control crime. Part of that surge included an emergency order that gave the president control of the local department for 30 days.\n\nNeither investigation found grounds for charging anybody with a crime. Pirro said at the time it was up to the MPD to take steps to address “these underlying issues.”\n\nA spokesperson for Mayor Muriel Bowser noted that Bowser requested the inspector general’s involvement after the earlier reports were released.\n\nThroughout the emergency order and the law enforcement surge, local officials have argued that while crime has gone down during the federal operation, it was going down beforehand as well. The investigations argued that the increased presence of law enforcement and National Guard members has been even more effective and the errant crime statistics were downplaying that.\n\nAccording to the MPD, there were 127 homicides in the District of Columbia last year, a 32% drop from the year before.\n\nSmith, who has since stepped down, disputed the findings that crime statistics were manipulated during her tenure.\n\nCarroll noted the controversy when he was named interim chief and said the department would be focusing on several steps to address the issues, including improved training for officers in classifying crimes and the creation of an audit team that would examine reports to insure they are properly classified. During the same press conference Bowser said she intended to call in the inspector general to examine the questions raised by the reports because the “reports that have been issued leave a lot to be desired in terms of evidence and context and any back and forth with the affected agency.”","url":"https://apnews.com/article/washington-dc-police-crime-statistics-investigation-ad56483896cf21bdb0ec226668281fb5","image":"https://dims.apnews.com/dims4/default/6c257ee/2147483647/strip/false/crop/5000x3333+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F8b%2Fddf877bbb0a83d7f85958cbd2c15%2F84b50b851ef244ae9fb3dd1c6b68a73a","video":null,"publish_date":"2026-01-12 21:38:18","author":"Gary Fields","authors":["Gary Fields"],"language":"en","category":"politics","source_country":"us","sentiment":-0.263},{"id":392477492,"title":"Feds Accuse Illegal Migrant Gangster Of Ramming Border Patrol With Prostitute’s Car Before Shooting","text":"Federal prosecutors officially charged a suspected Tren de Aragua gangbanger for allegedly using a vehicle as a weapon against Border Patrol agents.\n\nThe Department of Justice (DOJ) lodged criminal charges against Luis Nino-Moncada, a Venezuelan national living unlawfully in the U.S., per a Monday announcement from the agency. During a federal immigration enforcement operation in Portland, Oregon, on Thursday, Nino-Moncada allegedly damaged property and put Border Patrol agents in harm’s way when he repeatedly rammed a law enforcement vehicle with another car. (RELATED: Meet The Murderers, Child Rapists ICE Is Arresting In Minnesota)\n\n“Anyone who crosses the red line of assaulting law enforcement will be met with the full force of this Justice Department,” Attorney General Pam Bondi said in a public statement.\n\n“This man — an illegal alien with ties to a foreign terrorist organization — should NEVER have been in our country to begin with, and we will ensure he NEVER walks free in America again,” Bondi continued.\n\nBorder Patrol agents had initially targeted a vehicle belonging to Yorlenys Betzabeth Zambrano-Contreras, an illegal migrant allegedly involved in a Tren de Aragua-led prosecution ring, according to prosecutors. Zambrano-Contreras was sitting in the passenger seat when Nino-Moncada, in response to commands to exit the vehicle, placed the car in reverse and intentionally collided with a Border Patrol car, driving forward and reversing multiple times.\n\nActing in self-defense, agents fired back at the assailants, resulting in both of them being hospitalized.\n\n“A Border Patrol agent interviewed by FBI special agents described being fearful that Nino-Moncada could strike them and other Border Patrol agents with the target vehicle,” the DOJ stated. “After the attack, Nino-Moncada and the female passenger fled the scene in the target vehicle.”\n\nNino-Moncada admitted to intentionally hitting the Border Patrol car in an attempt to escape and acknowledged knowing that it was an immigration enforcement vehicle, according to prosecutors. He’s been charged with aggravated assault of a federal officer with a deadly weapon and depredation of federal property in excess of $1,000.\n\nThe suspected gangbanger first entered the U.S. unlawfully in 2022 and was released into the country under the Biden administration, according to the Department of Homeland Security (DHS). Zambrano-Contreras, who is also a Venezuelan national, illegally crossed into the country in 2023 and was released by the Biden administration at that time. She is also suspected of being involved in a previous shooting in the Portland area.\n\nPortland Police Chief Bob Day sobbed during a Friday press conference as he publicly acknowledged the two individuals shot by Border Patrol were linked to Tren de Aragua.\n\n“I hesitated to even share this information initially because I’m very aware of the historic injustice of victim blaming often times portrayed by law enforcement, including this very agency that I’ve represented so proudly for so many years, and historically we have not been quick to disclose the potential criminal history of others,” Day said at the time.\n\nThe attack in Portland follows increasing violence against federal immigration agents, with Immigration and Customs Enforcement officers experiencing 66 vehicular attacks against them since President Donald Trump returned to office in January 2025, according to DHS. That figure marks a 3,200% increase from the same time period in the previous year.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Assaulting law enforcement'","url":"https://dailycaller.com/2026/01/12/doj-charges-gangbanger-with-ramming-car/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FImage-e1768249990504.jpeg","video":null,"publish_date":"2026-01-12 21:31:12","author":"Jason Hopkins","authors":["Jason Hopkins"],"language":"en","category":"politics","source_country":"us","sentiment":-0.404},{"id":392475776,"title":"Trump Says Iran Wants To Negotiate As The Death Toll In Protests Rises To At Least 599","text":"DUBAI, United Arab Emirates (AP) — U.S. President Donald Trump said Iran wants to negotiate with Washington after his threat to strike the Islamic Republic over its crackdown on protesters in nationwide demonstrations that activists said Monday had left at least 599 people dead.\n\nIran had no direct reaction to Trump’s comments, which came after the foreign minister of Oman — long an interlocutor between Washington and Tehran — traveled to Iran this weekend. It also remains unclear just what Iran could promise, particularly as Trump has set strict demands over its nuclear program and its ballistic missile arsenal, which Tehran insists is crucial for its national defense.\n\nIranian Foreign Minister Abbas Araghchi, speaking to foreign diplomats in Tehran, insisted “the situation has come under total control” in remarks that blamed Israel and the U.S. for the violence, without offering evidence.\n\n“That’s why the demonstrations turned violent and bloody to give an excuse to the American president to intervene,” Araghchi said, in comments carried by Al Jazeera. The Qatar-funded network has been allowed to report live from inside Iran, despite the internet being shut off.\n\nHowever, Araghchi said Iran was “open to diplomacy.” Iranian Foreign Ministry spokesman Esmail Baghaei said that a channel to the U.S. remained open, but talks needed to be “based on the acceptance of mutual interests and concerns, not a negotiation that is one-sided, unilateral and based on dictation.”\n\nMeanwhile, pro-government demonstrators flooded the streets on Monday in support of the theocracy, a show of force after days of protests directly challenging the rule of 86-year-old Supreme Leader Ayatollah Ali Khamenei. Iranian state television aired chants from the crowd, which appeared to number in the tens of thousands, who shouted “Death to America!” and “Death to Israel!”\n\nOthers cried out: “Death to the enemies of God!” Iran’s attorney general has warned that anyone taking part in protests will be considered an “enemy of God,” a death-penalty charge.\n\nTrump acknowledges proposal for talks\n\nTrump and his national security team have been weighing a range of potential responses against Iran, including cyberattacks and direct strikes by the U.S. or Israel, according to two people familiar with internal White House discussions who weren’t authorized to comment publicly and spoke on condition of anonymity.\n\n“The military is looking at it, and we’re looking at some very strong options,” Trump told reporters on Air Force One on Sunday night. Asked about Iran’s threats of retaliation, he said: “If they do that, we will hit them at levels that they’ve never been hit before.”\n\nTrump said that his administration was in talks to set up a meeting with Tehran, but cautioned that he may have to act first as reports of the death toll in Iran mount and the government continues to arrest protesters.\n\n“I think they’re tired of being beat up by the United States,” Trump said. “Iran wants to negotiate.”\n\nIran, through the country’s parliamentary speaker, warned Sunday that the U.S. military and Israel would be “legitimate targets” if Washington uses force to protect demonstrators.\n\nMore than 10,600 people also have been detained over the two weeks of protests, said the U.S.-based Human Rights Activists News Agency, which has been accurate in previous unrest in recent years and gave the death toll. It relies on supporters in Iran crosschecking information. It said 510 of the dead were protesters and 89 were security force members.\n\nWith the internet down in Iran and phone lines cut off, gauging the demonstrations from abroad has grown more difficult. The Associated Press has been unable to independently assess the toll. Iran’s government hasn’t offered overall casualty figures.\n\nThose abroad fear the information blackout is emboldening hard-liners within Iran’s security services to launch a violent crackdown. Protesters flooded Tehran’s streets and its second-largest city on Saturday night into Sunday morning. Online videos purported to show more demonstrations Sunday night into Monday, with a Tehran official acknowledging them in state media.\n\nAt 2 p.m. Monday, Iranian state television showed images of demonstrators thronging Tehran toward Enghelab Square, or “Islamic Revolution” Square in the capital. It had been airing statements all morning from Iranian government, security and religious leaders to attend the demonstration.\n\nIt called the rally an “Iranian uprising against American-Zionist terrorism,” without addressing the underlying anger in the country over the nation’s ailing economy. State television aired images of such demonstrations around the country, trying to signal it had overcome the protests.\n\nFear pervades Iran’s capital\n\nIn Tehran, a witness told the AP that the streets were empty at the sunset call to prayers each night. By the Isha, or nighttime prayer, the streets are deserted.\n\nPart of that stems from the fear of getting caught in the crackdown. Police sent the public a text message that warned: “Given the presence of terrorist groups and armed individuals in some gatherings last night and their plans to cause death, and the firm decision to not tolerate any appeasement and to deal decisively with the rioters, families are strongly advised to take care of their youth and teenagers.”\n\nAnother text, which claimed to come from the intelligence arm of the paramilitary Revolutionary Guard, also directly warned people not to take part in demonstrations.\n\nThe witness spoke on condition of anonymity due to the ongoing crackdown.\n\nThe demonstrations began Dec. 28 over the collapse of the Iranian rial currency, which trades at more than 1.4 million to $1, as iran’s economy is squeezed by international sanctions in part levied over its nuclear program. The protests intensified and grew into calls directly challenging Iran’s theocracy.\n\nVideo shows corpses outside capital\n\nMeanwhile, video circulating online purports to show dozens of bodies in a morgue on the outskirts of Iran’s capital.\n\nPeople with knowledge of the facility and the U.S.-based Human Rights Activists News Agency said Monday that the video shows the Kahrizak Forensic Medicine Center.\n\nIn the footage, people are seen walking by dozens of bodies in bags laid out in a large room, attempting to identify those there. In some cases, bodies can be seen lying outside on blue tarps. A large truck can be seen in part of the footage.\n\nJulia Nikhinson reported from aboard Air Force One. Melanie Lidman contributed to this report from Tel Aviv, Israel.","url":"https://www.huffpost.com/entry/iran-protests-trump-negotiate-death-toll_n_696562f6e4b0f5f77ec85fb9?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/696563741700007009aac969.jpg?ops=1778_1000","video":null,"publish_date":"2026-01-12 21:12:26","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.392},{"id":392475880,"title":"It’s happening again: The Red Scare has come out of hiding","text":"Imagine you are forced to appear before a government committee that suspects you are a subversive. It’s a less likely scenario for Canadians, but American citizens are facing that threat daily as Donald Trump’s masked ICE agents rampage through the cities of the world’s richest country. For those Americans, it must seem as frightening as it was for millions of people living in the Cold War 1950s, the period covered by Carl Risen’s Red Scare.\n\nRisen offers a fresh investigation of one of the most frightening periods of United States history. The result is a timely mirror image of the country we are seeing today. Both periods are filled with lies, fear, threats, intimidation and illegal invasions of privacy. Citizens cannot exercise their democratic rights or even know the accusations lodged against them.\n\nRisen acknowledges the first red scare as an earlier example of how the American right festers until it sees an opportunity to surface and try to seize power. Like Trump today, the target was immigrants. During the Palmer Raids of the 1920s, attorney general A. Mitchell Palmer assigned an enthusiastic young agent named J. Edgar Hoover to deport thousands of people as undesirable aliens.\n\nHere Risen focuses on the even more toxic repeat performance of the 1950s – the age of McCarthyism. “Tailgunner” Joseph McCarthy, a junior senator from Wisconsin, took the reins of this dark moment. McCarthy’s target was communists. No one was safe from the senator or from Hoover’s FBI. No one’s job was safe regardless of the economic sector. No one who uttered a critical word about the government or voiced a progressive political viewpoint was left untouched.\n\nRisen’s study begins with anti-communist attacks on Hollywood. In 1945, movie studio workers, then under attack by an early version of the House Committee on Unamerican Activity (HUAC), went on strike shutting down 60 per cent of the Hollywood studios.\n\n“The strike forced Hollywood to take sides,” observed Risen. “The ensuing fight would tear Hollywood apart.” The dispute set the tone for a war that would involve public hearings of some of Hollywood’s star players. “Are you or have you ever been a communist?”\n\nUltimately, refusals to answer that question and to cooperate with the committee led to the Hollywood studio owners’ blacklist. Careers were crushed. A group known as the Hollywood Ten were fired along with other suspected communists. Dalton Trumbo, the secret screenwriter of Oscar winners like The Brave One and Roman Holiday, was a survivor of the blacklist, but many never worked again in Hollywood.\n\nIt was just the beginning of a purge of suspects deemed a threat to American democracy. Ironically, the authorities dispensed with the democratic rules to harass writers like Dashiell Hammett (The Maltese Falcon), Lillian Hellman (The Children’s Hour), African-American poet Langston Hughes and caustic social critic Dorothy Parker among others.\n\nHoover’s FBI agents began amassing files on hundreds of thousands of teachers, trade unionists, social activists and politicians deemed potential enemies of the U.S.\n\n“It was a time of lists,” Risen writes. “The FBI had its own vast collection of data, decades worth, spilling over the rumors and hearsay but also carefully documented observations by agents sent to tail suspects, or just the merely suspicious.”\n\nAmong the most notable files were those on Paul Robeson, the celebrated singer and civil rights activist. During his appearance at a HUAC hearing, Robeson was called a “crypto-communist” though he had never joined the community party. The state department later removed his passport, preventing the world-renowned entertainer from earning a living. The committee’s attempt to link Communism and the civil rights movement “tarnished them both.”\n\nAnother thick file was kept on longshore labour leader Harry Bridges, an Australian who later became a U.S. citizen. The leader of the famous 1934 West Coast longshore workers’ strike, was continually harassed by the FBI and even the labour movement. Philip Murray, president of the Congress of Industrial Organizations (CIO) was a stalwart anti-communist who refused to support Bridges. He was supported by famed autoworker leader Walter Reuther.\n\n“The impact of the Red Scare on the American labor movement was immense and tragic,” Rosen wrote. Ironically, Murray and other CIO leaders, including John L. Lewis of the mine workers, had hired communists to unionize millions of industrial workers after the CIO was founded in 1935.\n\nRisen saves some of his most revealing comments for convicted atomic spies Ethel and Julius Rosenberg. The Rosenbergs were tried under the Espionage Act, found guilty and executed, but many Americans witnessed the process of convicting them, protested the sentence, and wondered if “they deserved to die.” Yes, they were guilty, but the Red Scare had sealed their fate. Americans wanted blood.\n\nPerhaps the most prominent file deals with Robert J. Oppenheimer, the creator of the atomic bomb at the Manhattan Project. After the FBI investigated his past, they tried Oppenheimer secretly and stripped him of his security clearance, thus ending his career. Americans wanted his blood, too.\n\nHigh-level government officials were also on the hit list. One of the highest was the patrician Alger Hiss, the high-level State Department official that the young Californian Senator Richard Nixon condemned as a communist. The case spearheaded Nixon’s eventual drive for the White House.\n\nWhen McCarthy decided to take on the U.S. Army, the tables started to turn. After four years of witch hunts and public fear mongering, a Boston lawyer named Joseph Nye Welch finally called out McCarthy revealing his shameful ruthlessness at a public hearing. “Have you left no sense of decency?” he asked.\n\nRisen’s review of Cold War events such as these yields a riveting portrait of one of America’s most vicious periods of paranoia wherein attacks on its own citizens are supported and cheered by a public that lives in fear and is fed a steady flow of disinformation.\n\nIn Red Scare, we revisit the creation of a political playbook invented by the radical right wing of the Republican party and played out so effectively by McCarthy and others. Through Risen’s factual lens, we see a reflection of today’s MAGA movement as it pushes the country ever closer to what some would call a police state.\n\n“The Red Scare had inflamed a passionate core of hard-right conservatives,” Risen concludes. “It was left to future generations of Republican politicians to decide whether to keep such sentiments on the fringe, or to invite them into the center of the party.”","summary":"The Red Scare of the 1950s has returned to America, but instead of hunting communists, the government now hunts immigrants, advocates of DEI, and anyone else who expresses opposition to the regime.\n\n\nThe post It’s happening again: The Red Scare has come out of hiding appeared first on rabble.ca.","url":"https://rabble.ca/books/its-happening-again-the-red-scare-has-come-out-of-hiding/","image":"https://rabble.ca/wp-content/uploads/2026/01/Book-review-template-for-rabble.ca-1640x9241-1.png","video":null,"publish_date":"2026-01-12 21:08:53","author":"Ron Verzuh","authors":["Ron Verzuh"],"language":"en","source_country":"ca","sentiment":0.019},{"id":392478734,"title":"PBS weekend newscasts shut down due to funding cuts","text":"PBS will premiere separate programs on science and foreign affairs next weekend after shutting the doors on its Saturday and Sunday breaking newscasts because of the federal government’s cut of $1.1 billion in funding to public broadcasting.\n\n“PBS News Weekend” signed off Sunday, “at least for the foreseeable future,” anchor John Yang said. The weekend sister of “PBS NewsHour” began broadcasting in 2013 from New York, and moved to Washington in 2022.\n\nStarting Saturday, PBS will air the weekly show “Horizons” on science and technology issues. The new show “Compass Points” will focus on foreign affairs Sunday. Both programs will be taped in advance during the week, enabling PBS to save money by cutting back on weekend staff, said Sara Just, senior executive producer for “NewsHour.”\n\nThe weekend newscast averaged 827,000 viewers per show, roughly 1 million less than what “NewsHour” gets during the week, according to the Nielsen company.\n\nThe Republican-controlled Congress, responding to President Donald Trump’s wishes, eliminated funding for PBS and NPR in July. The president has complained about news programming on public broadcasting being biased against conservatives.\n\nDuring Sunday’s finale, highlights aired by PBS illustrated important news stories that broke over weekends — Hamas’ attack on Israel in October 2023, the assassination attempt on Donald Trump in summer 2024, and Joe Biden’s exit from the presidential race on a Sunday a few weeks later.\n\nAsked if the weekend newscasts could return if a future government restores funding to PBS, Just said, “I never say never, but this is not a temporary decision.”\n\nAlso in response to funding cuts, PBS shut down a bureau in Arizona that had enabled “NewsHour” to update its broadcasts for West Coast viewers. But Just cautioned against interpreting the moves as an indication the weekday newscast is in any danger. Through TikTok and YouTube, the broadcast is seeing more exposure for its journalism, she said.\n\n“I don’t see that program at risk in the near future,” she said.\n\nBoth “Horizons” and “Compass Points” will be 30-minute broadcasts. William Brangham will host “Horizons,” which will focus on a single topic each week, such as artificial intelligence, climate science or medical advances. Each episode of “Compass Points,” with Nick Schifrin as host, will also concentrate on one topic, PBS said.\n\nDavid Bauder writes about the intersection of media and entertainment for the AP. Follow him at http://x.com/dbauder and https://bsky.app/profile/dbauder.bsky.social.","url":"https://apnews.com/article/pbs-news-weekend-eliminated-be615ae15ea45becc7b427cb0ac18f74","image":"https://dims.apnews.com/dims4/default/3a1cb52/2147483647/strip/false/crop/700x450+0+0/resize/700x450!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png","video":null,"publish_date":"2026-01-12 21:08:42","author":"David Bauder","authors":["David Bauder"],"language":"en","source_country":"us","sentiment":-0.137},{"id":392477300,"title":"Trump administration’s criminal probe of Fed Chair Powell sparks rare GOP revolt on Capitol Hill","text":"A simmering feud between the Trump administration and the Federal Reserve reached a boiling point this weekend as the administration opened a criminal investigation into Chair Jerome Powell. What began as a disagreement over interest rate policy has evolved into an unprecedented confrontation, posing the greatest challenge of Powell’s eight-year leadership of the Federal Reserve. The dispute has now reached Capitol Hill, where congressional Republicans — including some close allies of the Trump administration — are pushing back against the investigation and threatening to block future nominees to lead the world’s most powerful central bank. FEDERAL RESERVE CHAIR POWELL UNDER CRIMINAL INVESTIGATION OVER HQ RENOVATION Perhaps the most prominent Republican to join the discourse so far is Rep. French Hill, R-Ark., who chairs the House Financial Services Committee. Hill recalled his longstanding relationship with Powell, dating back to their time together working at the Treasury Department under then-President George H.W. Bush, and said, \"Then, as now, I know Mr. Powell to be a man of integrity with a strong commitment to public service.\" POWELL REVEALS WHAT IT WOULD TAKE TO STEP DOWN FROM THE FED AS PRESSURE MOUNTS \"Pursuing criminal charges relating to his testimony on building renovations at a time when the nation&apos;s economy requires focus creates an unnecessary distraction,\" Hill said. \"The Federal Reserve is led by strong, capable individuals appointed by President Trump, and this action could undermine this and future Administrations&apos; ability to make sound monetary policy decisions.\" Sen. Thom Tillis, R-N.C., was among the first Republicans to sharply criticize the investigation Sunday night, warning it threatened the independence of both the Federal Reserve and the Justice Department. \"If there were any remaining doubt whether advisors within the Trump administration are actively pushing to end the independence of the Federal Reserve, there should now be none,\" Tillis wrote on X. \"It is now the independence and credibility of the Department of Justice that are in question.\" Tillis added that he would oppose the confirmation of any Federal Reserve nominee — including the next Fed chair — until the legal matter is resolved. REPUBLICAN SENATOR VOWS TO BLOCK TRUMP FED NOMINEE OVER POWELL INVESTIGATION The warning comes as Trump weighs candidates to succeed Powell, whose term as Fed chair is set to expire in May. Tillis’s resistance carries particular weight given his seat on the Senate Banking Committee, where any new nominee would be vetted. If he follows through on his threat, it could result in a tied vote on the panel. That would force a vote in the Senate to move forward with whoever Trump picks and, given the brewing GOP resistance, it would likely fail. Sen. Lisa Murkowski, R-Alaska, backed Tillis’ move to block any future Fed chair nominee, adding that \"the stakes are too high to look the other way: if the Federal Reserve loses its independence, the stability of our markets and the broader economy will suffer.\" After speaking with Powell Monday morning, Murkowski said \"it’s clear the administration’s investigation is nothing more than an attempt at coercion.\" \"If the Department of Justice believes an investigation into Chair Powell is warranted based on project cost overruns — which are not unusual — then Congress needs to investigate the Department of Justice,\" Murkowski said. Senate Majority Leader John Thune, R-S.D., said that he hadn’t yet \"seen the case or whatever the allegations are… But I would say they better be real and serious.\" Sen. Elizabeth Warren, D-Mass., the top ranking Democrat on the Senate Banking Committee, similarly panned the criminal investigation into Powell and charged that Trump sought to \"install another sock puppet to complete his corrupt takeover of America’s central bank.\" \"Trump is abusing the authorities of the Department of Justice like a wannabe dictator, so the Fed serves his interests, along with his billionaire friends,\" Warren said in a statement. \"This Committee and the Senate should not move forward with any Trump nominee for the Fed, including Fed Chair.\" TRUMP VS THE FEDERAL RESERVE: HOW THE CLASH REACHED UNCHARTED TERRITORY While Sen. Kevin Cramer, R-N.D., stopped short of backing the investigation, he criticized Powell as \"a bad Fed Chair who has been elusive with Congress,\" particularly over cost overruns tied to renovations of the Federal Reserve’s headquarters. \"I do not believe, however, he is a criminal,\" Cramer said. \"I hope this criminal investigation can be put to rest quickly along with the remainder of Jerome Powell’s term. We need to restore confidence in the Fed.\" GET FOX BUSINESS ON THE GO BY CLICKING HERE The overhaul of the Fed’s two main buildings in Washington’s Foggy Bottom neighborhood is expected to cost $2.5 billion and is slated for completion in 2027. The project is paid for by the central bank rather than taxpayers. The Fed funds its operations independently, relying largely on interest earned from government securities and fees from financial institutions. Even so, the cost overruns have drawn criticism from President Donald Trump, who has repeatedly seized on the project as evidence of what he has described as mismanagement at the Fed. For now, it remains unclear what comes next, with the Federal Reserve navigating largely uncharted territory.","summary":"Criminal probe of Fed Chair Powell over building costs triggers GOP revolt, with key senators threatening to derail Trump&apos;s central bank appointments.","url":"https://www.foxbusiness.com/politics/trump-administrations-criminal-probe-fed-chair-powell-sparks-rare-gop-revolt-capitol-hill","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2026/01/sen-tillis-senate-hearing.png","video":null,"publish_date":"2026-01-12 21:02:31","author":"Alex Miller,Amanda Macias","authors":["Alex Miller","Amanda Macias"],"language":"en","category":"politics","source_country":"us","sentiment":-0.017},{"id":392475334,"title":"UN Chief urges dialogue, diplomacy to resolve escalating US-Iran tensions amid street protests","text":"UNITED NATIONS, Jan 13 (APP): Amid heightening US-Iran tensions, UN Secretary-General Antonio Guterres Monday called for adopting the path of diplomacy and dialogue as Tehran kept lines of communication open with Washington, saying it is ready for either “war” or dialogue.\n\n“As you know, we push for dialogue,” the UN chief’s Spokesperson Stephane Dujarric said in response to a question at his regular noon briefing in New York, as US President Donald Trump reportedly weighs responses — including military options — amid widening protests across the Islamic Republic of Iran.\n\n“We are not warmongers, but we are prepared for war. … We are also prepared for negotiations, but fair negotiations, with equal rights and mutual respect,” Iranian Foreign Minister Abbas Araghchi told a gathering of ambassadors in Iran on Monday, according to media reports.\n\nTrump said aboard Air Force One on Sunday night that Iran had contacted the U.S. to propose talks, but added: “We may have to act before a meeting. … A meeting is being set up.” He declined to elaborate on the options the U.S. was considering on Iran.\n\nTrump said he believed Iran was taking U.S. threats seriously. “They’ve been going through it for years with me,” he said in response to a question, noting the U.S. strike that killed Iranian Quds Force commander Qasem Soleimani in Trump’s first term and the recent U.S. operation to remove Venezuelan leader Nicolas Maduro.\n\nThough Iranian officials had expressed, after the 12-day Israeli war in June, that they would be open to returning to talks, they had also rejected what they called “maximalist demands” by the Trump administration, and so negotiations remained frozen.\n\n“The communication channel between our Foreign Minister Abbas Araghchi and the U.S. special envoy [Steve Witkoff] is open and messages are exchanged whenever necessary,” Foreign Ministry spokesperson Esmaeil Baqaei said during a news conference Monday, Reuters reported. The traditional U.S.-Iran diplomatic channel through Switzerland also remains open, he said.\n\nAraghchi also met Saturday with his Omani counterpart, Badr Albusaidi, who traveled to Tehran for talks and who has acted as a go-between for Tehran and Washington in the past.\n\nIranian authorities, who have shut down internet access, are struggling to contain some of the protests.\n\nTrump told reporters Sunday night that he was getting hourly reports on the crackdown on protests. “We’re looking at it very seriously. The military’s looking at it. And we’re looking at some very strong options,” he added.\n\nOn Monday, Araghchi reiterated the government’s narrative about the protest violence — that it was being committed by “terrorists” and not security forces. “A large number of the people who have unfortunately died in these incidents have been shot in the back by these people,” he said.","summary":"Associated Press Of Pakistan\n\n\n\nUN Chief urges dialogue, diplomacy to resolve escalating US-Iran tensions amid street protests\n\n\nUN Chief urges dialogue, diplomacy to resolve escalating US-Iran tensions amid street protests\n\n\nThis post UN Chief urges dialogue, diplomacy to resolve escalating US-Iran tensions amid street protests first appeared on Associated Press Of Pakistan and owns the property.","url":"https://www.app.com.pk/foreign-correspondent/un-chief-urges-dialogue-diplomacy-to-resolve-escalating-us-iran-tensions-amid-street-protests/","image":"https://www.app.com.pk/wp-content/uploads/2022/09/Fall-Back-Image-2.png","video":null,"publish_date":"2026-01-12 21:00:55","author":"Nnps Desk","authors":["Nnps Desk"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.052},{"id":392479988,"title":"Greenland politician slams Trump 's**tshow' and tells President 'stop lying'","text":"The mayor of Greenland’s capital city has recently admitted that she is \"dreading\" the day that American warships appear on the horizon. Avaaraq Olsen said it is clear the fear felt among the 20,000 strong community of Nuuk is growing by the day. The civic leader has issued a personal message to UK Prime Minister Keir Starmer . Starmer is currently seeking to coordinate a NATO response to the growing crisis over Greenland by sending troops for a major security force to persuade US President Donald Trump that his intervention is not necessary. The mayor said: “ Denmark or others make plans and announcements about Greenland - but they talk about us without us. “So if Keir Starmer wants to plan anything like that, or even talk about it, he should definitely include the inhabitants of Greenland.” Speaking in her office in Nuuk’s Civic Hall, Olsen pointed to the fjord that is visible from the window and shared: “Yesterday I needed to take a walk, on the path we have on our coast line. “There’s always this calming feeling when you listen to the ocean. I was standing myself and it was getting dark, and then a boat came and it was dark and it had no lights on. “And suddenly I was wondering, will they (the US) come without the light? And even though I’ve been the one who’s telling everyone to keep calm I also understand that people are afraid. “I really understand why people are looking towards the sky and the ocean for what might come.” Olsen admitted that she is normally circumspect in dealing with the media - but she has cast aside her caution due to the severity of the US threat. She claimed that people have become distressed due to the “fake news” spread directly by Trump and his top table team - led by his son Donald Jnr, who visited Nuuk last January. She said: “To Donald Trump I would say I don’t want him here. \"That would just show another way of disrespecting us if he came.” She continued: “I really do think that they have to stop lying about Greenland.. like when he said that [...] we have Russian and Chinese ships surrounding Greenland. “That kind of state statement is also hurting people in Greenland. Really the lying has to stop.” Olsen said older people had been traumatised by the fear of hostile ships, as they assumed that when a powerful head of state made a statement it would be true. When Trump Jnr and top ally Charlie Kirk - who was later murdered in a crime that shook the world - visited Nuuk last January, Olsen claimed another round of fake news erupted. She said: “That was a circus - or perhaps a sh**-show. “ The mayor further stated that Trump Jnr’s people rounded up unemployed men who congregated, by habit, close to the city’s mall. They were all offered a free lunch at a swanky restaurant and then asked to wear MAGA hats - which resulted in photos being distributed to suggest the Tump team, who arrived in Greenland on the “Trump Force 1” jet were given a great welcome by Greenlanders. Trump Jnr’s visit also brought, Olsen claimed, a situation where schoolchildren were handed $100 bills, presumably to win their hearts and minds - which she claims local people were furious at. She said: “We had these influencers coming, and they handed out $100 bills for children. And they even went to schools, knocked on the door to the classrooms and wanted to interview children and young people, it was so ugly what happened.” Olsen said the protesting of Greenlanders had led to US Vice President JD Vance abandoning plans to turn up in Nuuk, opting instead to visit the US military base Pituffik - where he could control the messaging. She said: “For Greenlanders, we are very not so outgoing about our opinions, and it takes a lot for us [to] demonstrate. The existential threat to Greenland has jolted its people in a similar way to the coronavirus crisis. Olsen said: “I remember when Corona first hit, it felt surreal, like we were in a movie. \"That’s exactly how we feel right now. It’s really hard to predict what’s next. “People have these feelings of fear yet I also see people really just trying to live our daily life. When we have the hardest time in Greenland, we laugh. \"So I think there is a lot of laughing going on, even though it’s scary. “ Olsen said the people of Greenland don’t want to be American or Danish - they want to be free. She said families are already longing for the day they can get back to normal, with the glare of the world on them. Hopeful that a summit with Greenlandic, Danish and American political leaders next week will offer an unlikely glimmer of hope. Olsen said: “Whatever comes of that can give us an idea of how this is going to develop from here, because right now it’s so hard to imagine. Everything changes from day to day.” It was revealed on Sunday (January 11) that Keir Starmer was brokering talks with NATO allies about beefing up the west’s military presence in the Arctic to fend off Trump’s threat to take over Greenland. Downing Street said the PM took growing Russian aggression in the region “extremely seriously”. Ursula von der Leyen, president of the European Commission, told reporters that the EU was “accelerating our work” in Greenland as part of efforts to boost “Arctic security”. For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters .","summary":"Greenland’s capital mayor has revealed growing dread in Nuuk as fears mount over US warships appearing on the horizon, warning UK PM Keir Starmer not to make NATO plans for the region without consulting Greenlanders","url":"https://www.dailystar.co.uk/news/latest-news/greenland-politician-slams-trump-stshow-36539966","image":"https://i2-prod.dailystar.co.uk/article36540327.ece/ALTERNATES/s1200b/0_DENMARK-US-GREENLAND-DIPLOMACY-GOVERNMENT.jpg","video":null,"publish_date":"2026-01-12 21:00:00","author":"Andrea Oldereide,Mark McGivern","authors":["Andrea Oldereide","Mark McGivern"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.066},{"id":392479574,"title":"Trump administration says still considering military strikes on Iran","text":"The administration of United States President Donald Trump has continued to threaten Iran with military attacks, saying that air strikes are one of “many options” being explored as widespread protests put the Iranian government under growing pressure.\n\nWhite House Press Secretary Karoline Leavitt said on Monday that diplomacy is “always the first option” but that military attacks are “on the table”.\n\n“One thing President Trump is very good at is always keeping all of his options on the table. And air strikes would be one of the many, many options that are on the table for the commander in chief,” Leavitt told reporters.\n\nLarge-scale protests and riots have roiled Iran, with security forces responding with a lethal crackdown over the last several days that is estimated to have killed hundreds of people. Iranian authorities have said that scores of security personnel have also been killed in the riots.\n\nOpposition activists say the death toll is higher and includes hundreds of protesters. Al Jazeera cannot independently verify these figures. Details have been difficult to verify amid an internet blackout.\n\nTrump, who bombed Iranian nuclear facilities in June and has previously threatened Tehran with further strikes if it does not come into greater alignment with US demands, had used the government’s harsh crackdown on protesters as a pretext for further military attacks against the longtime US foe.\n\nA US strike on Iran would likely violate international law, and Trump has frequently threatened countries that defy his will with possible military strikes.\n\nThe Wall Street Journal reported on Monday that some members of the Trump administration such as Vice President JD Vance are urging Trump to consider renewed diplomatic efforts with Tehran or other less severe alternatives to US strikes, citing unnamed US officials. The US president said on Sunday that Iran had “called” and wanted to “negotiate”.\n\n“What you’re hearing publicly from the Iranian regime is quite different from the messages the administration is receiving privately,” Leavitt said.\n\n“The president has shown he’s unafraid to use military options if and when he deems necessary, and nobody knows that better than Iran,” she added.","summary":"The White House says that US could carry out air strikes against Iran but would prefer diplomatic solution.","url":"https://www.aljazeera.com/news/2026/1/12/trump-administration-says-still-considering-military-strikes-on-iran?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2026/01/AP26012117241272-1768254787.jpg?resize=1920%2C1440","video":null,"publish_date":"2026-01-12 20:52:53","author":"Apps Support,Brian Osgood","authors":["Apps Support","Brian Osgood"],"language":"en","category":"politics","source_country":"QA","sentiment":0.021},{"id":392478814,"title":"Beshear: Democrats should focus on everyday concerns","text":"FRANKFORT, Ky. (AP) — Democrats looking to expand their hold on the nation’s governorships should be focused on offering solutions for Americans feeling stressed by high costs for housing, health care and other essentials, Kentucky Gov. Andy Beshear, who is tasked with electing more Democratic governors, said Monday.\n\nThree dozen races for governor are at stake in the November midterm elections as Democrats, looking to build on their 2025 victories in Virginia and New Jersey, try to gain ground in statehouses. While making their case on economic issues, Democrats should be more forthcoming in discussing how their values, including their faith, shape their policy proposals, Beshear said.\n\nAnd they should go on offense against Republican President Donald Trump, who has “absolutely no solutions” for the challenges that families are facing, Beshear said during a sit-down interview with The Associated Press. Beshear is leading the Democratic Governors Association heading into the midterms. \n\n“I believe that Americans are craving authenticity right now,” Beshear said. “They want to know you. They want to at least know what drives you. Because if they’re going to cast their vote for you, believing that you will make their life better, they want you to know that something is driving you to do that that is real and important to you.\n\n“I call that the ‘why,’’' he said. ”Democrats are very good at the ‘what.’ We put out huge policy papers, but we don’t talk enough about the ‘why.’ And so if that’s somebody’s faith, then yes, they ought to be talking about it because that’s intrinsically them.”\n\nThe term-limited Beshear was noncommittal when asked whether he intends to enter the Democratic race for the White House in 2028. Beshear rose to prominence after winning three elections in Republican-trending Kentucky — once for attorney general and twice for governor. He defeated Trump-backed opponents both times he won the governorship. Beshear will travel the country this year campaigning for Democratic gubernatorial candidates, including the party’s nominees in several presidential swing states.\n\nBeshear predicted his party will pick up more governorships in 2026, with a strategy focused on such core issues as jobs, health care, housing, education, public safety and transportation. \n\nThat messaging includes portraying Democratic governors as a crucial line of defense in pushing back against Trump’s sweeping policies that are making life more difficult for Americans, the Kentucky governor said.\n\n“When we elect Democratic governors, it helps the people of that state immensely,” Beshear said. “Democratic governors create good jobs with wages where you cannot only support your family, but you can afford to take that family vacation every once in a while. Democratic governors expand health care, they don’t contract it. And Democratic governors push back against the overreach of this Trump administration that is impacting people’s lives on a daily basis.”\n\nIn Kentucky, Beshear called for greater state investments in housing, education and health care in a speech last week that outlined his budget proposals to the Republican-supermajority legislature.\n\nPushing back against Trump\n\nDemocratic candidates should be on the offense pushing back against the GOP’s big tax and spending bill championed by Trump last year, Beshear said. The measure delivered not just $4.5 trillion in tax breaks for Americans but substantial changes to safety net programs. The trade-off will cut more than $1 trillion over a decade from federal health care and food assistance, largely by imposing work requirements on those receiving aid and by shifting certain federal costs onto the states.\n\n“I think that every Democratic candidate ought to be standing in front of the clinic that is closed because of these cuts,” Beshear said. “I think that every Democratic candidate needs to talk about how many more people are at a food bank because the food assistance is no longer there.\n\n“It’s both an issue of the economy and affordability helping people get by,” he added. “But it’s also a case of just morality. Who cares about you and who is making it that much harder just to survive?”\n\nThe Democratic message will portray its candidates as being willing to stand up to Trump, Beshear said. \n\n“We’re going to say where you have a governor that puts his state or her state above an allegiance to the president, you see services that aren’t in others,” he said.\n\nThe Kentucky governor also condemned the tactics used by federal Immigration and Customs Enforcement officials in carrying out Trump’s immigration crackdown. The fatal shooting of a woman by a federal immigration officer in Minneapolis sparked protests across the country.\n\n“I believe the American people, by and large, believe that ICE is going too far,” Beshear said. “I think the American people rightfully believe that we need real border security, and the borders should matter and that we have to enforce our laws. But how we do it reflects our humanity. And what you see is a highly aggressive agency in ICE. ... And this level of aggressiveness is resulting in things like we saw in Minneapolis.”","url":"https://apnews.com/article/andy-beshear-kentucky-democratic-governors-association-f66575ee093d1deda99ee3e076e6fed5","image":"https://dims.apnews.com/dims4/default/5055605/2147483647/strip/false/crop/8023x5349+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2Fc9%2Fa58d7f8f681a222599573513b900%2Fab514f60a04845e5998eb09c4892fadd","video":null,"publish_date":"2026-01-12 20:45:20","author":"Bruce Schreiner","authors":["Bruce Schreiner"],"language":"en","category":"politics","source_country":"us","sentiment":0.13},{"id":392479602,"title":"Iranian FM Araghchi warns Iran ready for war if US wants to ‘test’ it","text":"Iranian Foreign Minister Abbas Araghchi has warned the United States that his country is ready for war if Washington wants to “test” it, after US President Donald Trump threatened to take military action in response to Iran’s crackdown on antigovernment protests.\n\nIn an exclusive interview with Al Jazeera Arabic on Monday, Araghchi said channels of communication with the US were open amid the ongoing unrest but stressed that his country was “prepared for all options”, claiming that Iran now has “large and extensive military preparedness” compared to last year’s 12-day war.\n\nHis comments follow Trump’s remarks on Sunday, amid nationwide protests in Iran sparked by economic woes that have intensified into broader calls for systemic change. The US president had said he was considering “strong options” for Iran over its leadership’s crackdown on protests, including potential military action.\n\nTrump, who recently ordered the abduction of leftist Venezuelan President Nicolas Maduro in a US Special Forces intervention, said that a meeting was being set up with Tehran to negotiate on its nuclear programme, “but we may have to act because of what is happening before the meeting”.\n\n“If Washington wants to test the military option it has tested before, we are ready for it,” said Araghchi, adding that he hoped the US would choose “the wise option” of dialogue, while warning of “those trying to drag Washington into war in order to serve Israel’s interests”.\n\nIn the interview, Araghchi alluded to the growing death toll, repeating earlier assertions that “terrorist elements” had “infiltrated the crowds of protesters and targeted security forces and demonstrators”. Iran has blamed the US and Israel for provoking unrest in the country over the past two weeks.\n\nMore than 100 security personnel have been killed in recent days, state media has reported, while opposition activists say the death toll is higher and includes hundreds of protesters. Al Jazeera has been unable to independently verify the figures.\n\nThe flow of information from Iran has been hampered by an internet blackout since Thursday. The foreign minister had said on Monday that the service would be resumed in coordination with security services. Monitor NetBlocks said at 16:29 GMT on Monday that Iran had been offline for 96 hours.\n\nAraghchi told Al Jazeera Arabic that his communications with US Special Envoy Steve Witkoff had “continued before and after the protests and are still ongoing”. He said that ideas that had been discussed with Washington were being studied in Tehran.\n\nHowever, he added, “Washington’s proposed ideas and threats against our country are incompatible.”\n\n“We are ready to sit at the nuclear negotiating table, provided that it is without threats or dictates,” said Araghchi, questioning whether Washington was “ready for fair and just negotiations”.\n\n“When it is ready, we will seriously consider the matter,” he said.\n\nIran’s Parliament Speaker Mohammad Bagher Ghalibaf said on Sunday that the US military and Israel would be “legitimate targets” if Washington intervened in the current unrest, warning Washington of a “miscalculation”.\n\nWhite House spokeswoman Karoline Leavitt accused Iran of sending “quite different” messages to the US in private, compared to its public statements, in an interview with the Fox News programme America Reports on Monday.\n\nThe Wall Street Journal reported on Monday that the White House was weighing Iran’s offer to engage in further military talks, even as Trump mulled strikes on the country.\n\nThe US last year bombed Iranian nuclear sites when it joined Israel’s 12-day war with Iran.","summary":"Foreign minister says he hopes Washington will choose ‘wise option’ of dialogue after Trump threatens US intervention.","url":"https://www.aljazeera.com/news/2026/1/12/iranian-fm-araghchi-warns-iran-ready-for-war-if-us-wants-to-test-it?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2026/01/AFP__20250909__73WA7GB__v1__HighRes__EgyptIranIaeaNuclearDiplomacyIsraelUs-1768242318.jpg?resize=1920%2C1440","video":null,"publish_date":"2026-01-12 20:42:45","author":"Apps Support","authors":["Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.388},{"id":392477480,"title":"‘She Can Bring The Smoke, We’ll Bring The Fire’: Tom Homan Claps Back At Sheriff Who Threatened ICE","text":"Border czar Tom Homan fired back at Democratic Philadelphia Sheriff Rochelle Bilal on Monday after she threatened Immigration and Customs Enforcement (ICE) agents with arrest.\n\nBilal made the threat during a Thursday news conference, saying, “You don’t want this smoke, because we will bring it to you.” Homan responded on “The Charlie Kirk Show,” saying, “She can bring the smoke, we’ll bring the fire,” and that ICE would not back down. (RELATED: Border Czar Argues Why ‘Sanctuary’ Minnesota Should Not Probe ICE Shooting)\n\n“I mean, bottom line is her comments themselves speak largely to her intelligence. So, look, we’re going to continue doing this job. I don’t know who she is or why a law enforcement official who took a sworn oath to enforce the laws and protect her communities would not want to work with ICE who are out there arresting the worst of the worst,” Homan said. “We’re taking public safety threats out of her jurisdiction and not just taking them off the street, taking them out of the country.”\n\n“Because number one, they’re here illegally. Number two, they committed a crime against U.S. citizens, some horrendous crimes,” he added. “Like in Minneapolis we looked at a number of arrests we did in the last couple of weeks, and there’s numerous people we arrested for child rape, child sodomy.”\n\nICE agents arrested illegal migrant child rapists and killers in Minnesota amid their enforcement surge in the state, according to an agency press release.\n\n“We’re making her community safer. So you’re welcome. So she can continue to attack, make all the threats she wants. I don’t know what bringing smoke means, but we’re going to continue to bring the fire to those people who are public safety threats and in the country illegally,” Homan said. “We’re coming for them. We’re going to keep doing what we’re doing. And we’re going to remove them and make that community safer.”\n\nBilal’s comments followed an ICE agent fatally shooting 37-year-old Renee Good on Wednesday while conducting an immigration enforcement operation in Minneapolis. She commended Democratic Philadelphia District Attorney Larry Krasner, who pledged to prosecute ICE agents who allegedly committed crimes in his jurisdiction in the wake of the shooting.\n\n“I’m with the DA and we will work with him. If any of them [ICE Agents] want to come in this city and commit a crime, you will not be able to hide,” Bilal said. “Nobody will whisk you off.”\n\nWhile Democrats have claimed the shooting was a murder, President Donald Trump’s administration has asserted that it was an act of self-defense. The shooting occurred when Good allegedly accelerated her car forward as ICE agents surrounded her vehicle.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'You're welcome'","url":"https://dailycaller.com/2026/01/12/tom-homan-claps-back-sheriff-threatened-ice/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FScreenshot-2026-01-12-3.04.20-PM-e1768248340455.png","video":null,"publish_date":"2026-01-12 20:28:19","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.531},{"id":392478132,"title":"Mark Ruffalo attacks President Trump: Worst human being","text":"Los Angeles, Jan 13 (IANS) Hollywood actor Mark Ruffalo recently attended the Golden Globes as a nominee for his performance in HBO’s ‘Task’, but he wasn’t feeling entirely celebratory.\n\nThe actor called out the US President Donald Trump and said he couldn’t b******* when it came to how “not normal” it is to attend a glitzy awards ceremony just days after the death of Renee Good.\n\nThe actor was one of several celebrities wearing a “Be Good” pin to honor Good, who was killed by an ICE agent in Minneapolis last week, reports ‘Variety’.\n\n“It’s for Renee Nicole Good, who was murdered”, Ruffalo said about wearing the pin before calling out J.D. Vance and other political figures who defended the shooting as self-defense. “We have a vice president who is lying about what’s happening. We’re in the middle of a war with Venezuela that we illegally invaded. (Trump) is telling the world that international law doesn’t matter to him. The only thing that matters to him is his own morality”.\n\nNodding to Trump telling The New York Times that “my own morality” and “my own mind” are his only limits when it comes to global power.\n\nHe told ‘USA Today’, “The guy is a convicted felon. He’s the worst human being. If we’re relying on this guy’s morality for the most powerful country in the world, then we’re all in a lot of trouble. So this is for (Renee). This is for the people in the United States who are terrorized and scared today. I know I’m one of them. I love this country, and what I’m seeing here happening is not America”.\n\nWhen asked why it was important to send a political message while attending the Globes, Ruffalo answered, “Listen, I want to pretend like this, I want to be here to celebrate, and I am here to celebrate, and I’m proud to have a Golden Globe nomination. But also, this is not normal anymore, and so I don’t know how I could be quiet, and I’m feeling a little sick, so it’s hard to BS right now”.","summary":"Los Angeles, Jan 13 (IANS) Hollywood actor Mark Ruffalo recently attended the Golden Globes as a nominee for his performance in HBO’s ‘Task’, but he [...]","url":"https://bhaskarlive.in/mark-ruffalo-attacks-president-trump-worst-human-being/","image":"https://i1.wp.com/bhaskarlive.in/wp-content/uploads/2025/12/images-1.jpg?ssl=1","video":null,"publish_date":"2026-01-12 20:27:51","author":"IANS","authors":["IANS"],"language":"en","category":"politics","source_country":"in","sentiment":-0.024},{"id":392477306,"title":"Possible measles exposures took place at Philly airport, Amtrak's 30th Street station, health officials say","text":"Potential measles exposures occurred at Philadelphia International Airport and 30th Street Station earlier this month, city health officials warned Monday. \n\nA person with measles passed through those locations Wednesday, Jan. 7, before taking an Amtrak train traveling toward Washington's Union Station, the Philadelphia Department of Public Health said. The traveler departed the train at the station for BWI Marshall Airport in Maryland, and rode shuttles to and from the airport's drop-off locations, the Maryland Department of Health said. \n\nMORE: SEPTA is running trolleys to Center City again after completing wire repairs in tunnel\n\nMeasles spreads through the air when an infectious person breathes, coughs or sneezes. It is so contagious that airborne viral particles can infect people for up to two hours after an infected person has left the room. Two doses of the measles, mumps and rubella vaccine provide 97% protection , but declining vaccination rates in the U.S. have left more people vulnerable to the virus. \n\nPeople who were in the following locations Jan. 7-8 may have been exposed to measles, the health departments said:\n\n• Philadelphia International Airport, Terminal A East on from 7:50 p.m. to 11 p.m. Wednesday, Jan. 7.• 30th Street Station on from 8:15 p.m. to 11:25 p.m. Wednesday, Jan. 7.• Amtrak Northeast Regional Train No. 175 from Philadelphia's 30th Street Station to Washington's Union Station between 9 p.m. and 11:30 p.m. Wednesday, Jan. 7. The train ran from Boston to Washington.• Amtrak BWI shuttle to and from the BWI train station and the drop-off points outside of the lower level of BWI Marshall Airport between 10:45 p.m. Wednesday, Jan. 7, and 1:30 a.m. Thursday, Jan. 8.• BWI Airport parking shuttle to and from the lower level of BWI Airport and the BWI Airport's long-term parking lots between 11 p.m. Wednesday, Jan. 7, and 2 a.m. Thursday, Jan. 8. \n\nThere were no exposures identified inside the terminals of BWI Airport, health officials said. \n\nWhat to do if exposed to measles\n\nPeople who are considered immune to measles do not need to take any action, health officials said. This includes people who have had two doses of the MMR vaccine, have had measles or were born before 1957. People can request their health records online if they are unsure whether they have been vaccinated.\n\nPeople who are not protected against measles and were potentially exposed are advised to contact their health care providers about receiving an MMR vaccine as soon as possible, Philly health officials said. Infants under 12 months, pregnant women who are not immune and people with weakened immune systems are at greater risk of complications and may require other treatments.\n\nExposed people who are not immune also are advised to wear masks in indoor spaces and around unvaccinated people until three weeks after the exposure, because they may have contracted measles but not yet be showing symptoms. People who develop measles symptoms are advised to contact a doctor immediately. \n\nEarly symptoms include a fever of more than 101 degrees, runny nose, cough and red, watery eyes. A red rash typically appears on the face and body 1-4 days after symptoms begin. People become contagious four days before the rash appears and can continue spreading germs for four days after it appears. \n\nMeasles, caused by the rubeola virus, is particularly dangerous for children under 5, adults older than 20, pregnant women and people with weakened immune systems. They are more likely to develop complications, including pneumonia and encephalitis. About 1 in 5 unvaccinated people who get measles is hospitalized. The virus can be deadly.\n\nSymptomatic individuals are advised to stay home and wear masks indoors to prevent infecting others. They should contact their health provider before entering a waiting room or emergency department, health officials said.\n\n\"We encourage people who were possibly exposed to take action if they are not protected against measles,\" Philadelphia Health Commissioner Dr. Palak Raval-Nelson said. \"... We strongly encourage parents to get their children fully vaccinated as soon as they are able. People planning to travel outside the United States should speak with their doctor about their travel plans and vaccinations needed.\"\n\nRaval-Nelson said the possible exposure does not pose a health threat to the general public. That's because vaccination rates in most communities remain high, though they have been falling.\n\nMeasles vaccinations rates are falling\n\nTo achieve \"herd immunity,\" the threshold that prevents measles from spreading easily, about 95% of community must be fully vaccinated, health experts say. U.S. health officials recommend children receive their first MMR shot at 12-15 months and a second dose between ages 4-6. \n\nBefore the COVID-19 pandemic, about half of the counties in the United States had kindergarten vaccination rates high enough to prevent measles outbreaks. Now, only about 1 in 4 U.S. counties have herd immunity, the Washington Post reported, using data from the 2018-19 and 2024-25 school years. \n\nPennsylvania's vaccination rate fell from 96% to 92% during that period. The state allows people to cite personal and religious exemptions from vaccines. Philadelphia's vaccination rate fell from 95% to 94.65%. \n\nNew Jersey, which allows religious exemptions, saw its measles vaccination rate fall from 95% to 93%. \n\nJames Colgrove, a professor at Columbia University Mailman School of Public Health, said the trend represents a dangerous precedent that could put the American public at grave risk. \n\n\"The most dangerous deadly diseases will come back, and it won't only be kids who suffer,\" he told the Post. \"It'll be adults in the community who are immune-compromised, who are elderly. It'll be infants.\"\n\nMandated vaccinations have been scrutinized by high-ranking members of President Donald Trump's administration. Last week, the Department of Health and Human Services lowered the number of recommended vaccines for children from 17 to 11, a move the American Medical Association called \"dangerous and unnecessary.\" It also \"blindsided\" vaccine experts at the Centers for Disease Control and Prevention, the Post reported. The new guidelines do not include changes to the recommended doses for the MMR vaccine.\n\nWhere to get vaccinated in Philadelphia\n\nThe Philadelphia health department offers free MMR vaccines from 9 a.m. to 1 p.m. Mondays through Fridays at these locations:\n\n• Health Center 3, 555 S. 43rd St.• Health Center 4, 4400 Haverford Ave.• Health Center 5 Annex, 2001 W. Berks St.• Mattie L. Humphrey Health Center, 131 E. Chelten Ave.• Strawberry Mansion Health Center, 2840 W. Dauphin St.","summary":"Possible measles exposures happened Wednesday, Jan. 7, at Philadelphia International Airport and 30th Street Station in University City, health officials say. A person with measles traveled from the airport and boarded an Amtrak train to the BWI Marshall Airport station in Maryland.","url":"https://www.phillyvoice.com/measles-exposure-philadelphia-airport-30th-street-station/","image":"https://media.phillyvoice.com/media/images/111125MeaslesExposureAirport.o.2e16d0ba.fill-1200x630-c0.jpg","video":null,"publish_date":"2026-01-12 20:22:41","author":"Molly McVety","authors":["Molly McVety"],"language":"en","source_country":"us","sentiment":-0.436},{"id":392475878,"title":"Venezuelan heavy oil coming on stream could spell a $9-billion Alberta deficit, former energy minister predicts","text":"Former United Conservative Party energy minister Sonya Savage spoke the truth on Friday when she forcefully suggested on a podcast that without public funding Premier Danielle Smith’s perpetual pipeline project is little more than a pipe dream.\n\nThis has been obvious from the get-go, of course. Still, it’s nice to hear someone long influential in the Alberta oilpatch and once associated with the United Conservative Party, albeit back when Jason Kenney still bestrode this province like a political colossus, saying aloud what no member of Smith’s cowed cabinet dares to admit. \n\nTo wit, as Savage told the CBC’s West of Centre podcast in a widely quoted clip, the chances of any private-sector actor ever stepping up to build another pipeline to Canada’s West Coast are basically zilch. \n\nWhen podcast host Kathleen Petty asked her three panelists – Savage, former Liberal MP Martha Hall Findlay, and former Canadian Energy Regulator CEO Gitane De Silva – if they agreed the chance of a private proponent stepping forward to build the pipeline was diminishing, Savage responded: “I would say it’s not just diminishing … I would say it’s almost zero at this point.”\n\nSavage spoke this so mildly that the exclamation mark her thought deserves can’t be used. Just the same, it was an important point made by someone who has an insider’s knowledge of both the fossil fuel business and the politics of pipeline building.\n\nAs befits the holder of the energy portfolio when Kenney’s bad bet on Donald Trump winning the 2020 U.S. presidential election and quickly restarting work on the Keystone XL pipeline cost Alberta taxpayers $1.5 billion, Savage went on to indicate she doesn’t have a problem with governments paying for pipelines.\n\n“There’s going to be politics in there, and politicians are going to want to reinforce their narrative on how urgent it is to get a new West Coast pipeline going,” she explained calmly.\n\nBut since the hope that a private proponent will come forward is a faint one and with Venezuelan heavy crude re-entering the U.S. market sooner or later, as we have been saying here for months, public investment is the probably the only way Alberta’s pipeline demands can be met. \n\nAnyway, governments playing a big financial role in building pipelines is nothing new in Canada, Savage kept trying to say, despite serial interruptions from the podcast host and the fact that little effort was made to identify which of three guests with similar voices were speaking at any given time.\n\nOf course, as the podcast participants acknowledged, Premier Smith’s deal with Prime Minister Mark Carney requires a proponent to emerge from the private sector, but it seems likely that requirement will be tossed under the bus if the prevailing mood persists that, with Mr. Trump back in the White House, it’s in the national interest to get cracking on another bitumen pipeline to the coast so we can sell the stuff to China. \n\nNever mind that China is electrifying at Manhattan-Project speed to avoid having to strategically depend on anything that must be shipped through the South China Sea and that for similar geopolitical reasons the Trump Administration is unlikely to permit Canada to sell anything of strategic value to China.\n\nSo much for Savage’s views on the likelihood of another pipeline getting built without taxpayers having to pony up. However, she also had some relevant and interesting observations on the likely impact on Alberta government budgets of shipments of Venezuelan heavy crude resuming to the United States. \n\nFor some reason, despite being quite significant, these seem to have generated less interest from the media that jumped all over her pipeline commentary. \n\n“It doesn’t seem to be disputed that 10 per cent of Canadian oil could be at risk in the short term,” she observed. Right now, she added, we ship about four million barrels a day to U.S. refineries – most to the U.S. Midwest, and about 350,000 to 450,000 a day to refineries on the Gulf Coast. “That’s what’s at risk, that 350 to 450 thousand barrels a day to the Gulf Coast.”\n\nSo, never mind the impact on the energy industry and energy users, she continued. “You have to look at what the impact is, not only on the oil producers and the energy industry, but what is the impact on governments, on government revenue? And in Alberta, 10 per cent is not chump change!”\n\n“Ten per cent of the production is a significant impact on the provincial budget and on royalties,” she explained. “Even a $1-a-barrel decrease in the price of oil, or a spread in the differentials, is $750 million dollars to the provincial budget in royalties.\n\n“The provincial budget was predicated and budgeted on $64 a barrel, Western Canada Select is 14 bucks lower than WTI …” (That is, West Texas Intermediate, a global benchmark for international oil prices.) “WTI is about seven bucks lower right now than the provincial budget forecasted.”\n\nCue sinister music … “So we’re looking at about a $9 billion deficit,” she concluded, “and that’s a reason to pull the fire-alarm bell for the provincial budget.”\n\nJust imagine how Alberta politicians will respond to the prospect of a deficit of $9-billion or more!\n\nService cuts and privatization, of course. More covetous eyes cast at your Canada Pension Plan funds, naturally. And with another pipeline proffered as a panacea absent any proponent, what do you think is going to happen?","summary":"Guess who’s going to have to pay when another pipeline with no proponent is proffered as a panacea.\n\n\nThe post Venezuelan heavy oil coming on stream could spell a $9-billion Alberta deficit, former energy minister predicts appeared first on rabble.ca.","url":"https://rabble.ca/politics/canadian-politics/venezuelan-heavy-oil-coming-on-stream-could-spell-a-9-billion-alberta-deficit-former-energy-minister-predicts/","image":"https://rabble.ca/wp-content/uploads/2026/01/SavageMain-1.webp","video":null,"publish_date":"2026-01-12 20:21:08","author":"David J. Climenhaga,More By David J. Climenhaga","authors":["David J. Climenhaga","More By David J. Climenhaga"],"language":"en","source_country":"ca","sentiment":-0.381},{"id":392478856,"title":"Florida Lt. Gov. Jay Collins enters 2026 governor race against Trump-backed rival","text":"FORT LAUDERDALE, Fla. (AP) — Florida Lt. Gov. Jay Collins announced Monday that he’s running for governor in 2026, hoping to take over for term-limited Gov. Ron DeSantis.\n\nThe candidacy places Collins in a Republican primary race against U.S. Rep. Byron Donalds, who has been endorsed by President Donald Trump. DeSantis tapped Collins to be his lieutenant governor last August, but the current governor has not made any endorsement in this year’s gubernatorial race.\n\n“I’m running for Governor because leadership is forged under pressure, not in soundbites,” Collins said in a post on X. “I served over 23 years in the United States military, mainly as a Green Beret, where accountability is real, decisions have consequences, and service comes before self. That experience shaped how I lead and why I believe public office is a public trust.”\n\nBorn in Montana, Collins has talked openly about personal challenges he has overcome, including experiencing homelessness while in high school. He went on to join the Army Special Forces and ultimately lost a leg, but continued to serve five more years as a Green Beret using a prosthetic leg postamputation, according to a campaign biography. \n\nIn recent years, Collins has served as the chief operating officer of Operation BBQ Relief, which deploys cooks and mobile kitchens to deliver hot meals in the aftermath of natural disasters. Last June, Collins also flew to Israel to help support state-funded flights to evacuate Americans as Israel and Iran traded missile strikes.\n\nIn Florida, the lieutenant governor position is largely ceremonial with few official responsibilities, apart from taking over if the governor cannot serve. Collins was first elected to Florida’s Republican-dominated state Senate in 2022 and has been seen as one of DeSantis’ key allies in the Legislature. \n\nDuring a news conference Monday, DeSantis called Collins a “good guy” but added that he hadn’t decided whether he would make any endorsement.\n\n“If I get involved in the primary, you’ll know it,” DeSantis said.\n\nDeSantis was elected governor in 2018 and reelected in 2022. Under Florida law, a governor can only serve two consecutive four-year terms.\n\nOther candidates in the Republican primary are Surfside Mayor Charles Burkett, Azoria CEO James Fishback, former Florida House Speaker Paul Renner and activist Bobby Williams.\n\nDemocratic candidates are Orlando Mayor Jerry Demings and former Republican U.S. Rep. David Jolly.","url":"https://apnews.com/article/florida-governor-election-jay-collins-f415821faf07ed57f26e744133686ef0","image":"https://dims.apnews.com/dims4/default/aeb7d75/2147483647/strip/false/crop/3811x2451+0+0/resize/1486x956!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Ff3%2Fd4dea0ed939d315adb67325aeed8%2F9c5f3493e4f5484bae68603c10d3d8e3","video":null,"publish_date":"2026-01-12 20:10:49","author":"David Fischer","authors":["David Fischer"],"language":"en","category":"politics","source_country":"us","sentiment":0.094},{"id":392479598,"title":"Republican lawmakers break from US president on Fed chair indictment","text":"United States Senator Lisa Murkowski threw her support behind fellow Republican Thom Tillis’s plan to block President Donald Trump’s Fed nominees after the Justice Department over the weekend threatened to indict Fed Chairman Jerome Powell.\n\n“The stakes are too high to look the other way: if the Federal Reserve loses its independence, the stability of our markets and the broader economy will suffer,” Murkowski wrote on X on Monday.\n\nMurkowski is one of a small handful of Trump’s fellow Republicans who have shown themselves willing to vote against his wishes at times in the US Senate, where his party holds a 53-47 majority.\n\nSince returning to office last year, Trump has been increasingly publicly pressuring the Fed to cut interest rates, breaking with longstanding practice meant to insulate the central bank from political pressure and allowing it to focus on economic data.\n\nAlaska lawmaker Murkowski said she had spoken earlier on Monday with Powell, who on Sunday said the US central bank had received subpoenas last week that he called “pretexts” aimed at the Fed’s basing interest rates on policy and not on Trump’s preferences.\n\nMurkowski called the Justice Department threat “nothing more than an attempt at coercion”, adding that Congress should investigate the department if it believes probing the Fed was warranted over renovation cost overruns, which she called “not unusual”.\n\nHassett weighs in\n\nPowell’s term is up in May, and White House economic adviser Kevin Hassett has largely been seen as a potential pick to succeed him.\n\nHassett questioned Powell’s congressional testimony about the Fed’s new building construction, which is at the centre of the Justice Department’s probe.\n\n“Right now, we’ve got a building that’s got like, dramatic cost overruns and plans for the buildings that look inconsistent with the testimony, but again, I’m not a Justice Department person. I hope everything turns out OK for Jay,” Hassett told the CNBC news programme Squawk Box.\n\nLater, Hassett said he would support the investigation if he were in charge of the Fed, telling reporters that it “seems like the Justice Department has decided that they want to see what’s going on over there with this building that’s massively more expensive than any building in the history of Washington”.\n\nTrump, who has long pushed for more aggressive interest rate cuts, said in a post on his Truth Social platform in December, “The United States should be rewarded for SUCCESS, not brought down by it. Anybody that disagrees with me will never be the Fed Chairman!”\n\nFormer officials condemn probe\n\nThe past three heads of the US Federal Reserve on Monday joined with other former federal government economic policy leaders in condemning the Trump administration’s criminal probe of the Fed chair, likening it to the interference with central bank independence more often seen in emerging market countries with “weak institutions”.\n\n“The reported criminal inquiry into Federal Reserve Chair Jay Powell is an unprecedented attempt to use prosecutorial attacks to undermine that independence,” a statement signed by former Fed chairs Janet Yellen, Ben Bernanke and Alan Greenspan said.\n\n“This is how monetary policy is made in emerging markets with weak institutions, with highly negative consequences for inflation and the functioning of their economies more broadly. It has no place in the United States whose greatest strength is the rule of law, which is at the foundation of our economic success.”\n\nThe three were joined by 10 other former top economic policymakers appointed by both Republican and Democratic presidents.","summary":"Former fed chairs called the indictment an &#039;unprecedented attempt&#039; to undermine the independence of the US central bank.","url":"https://www.aljazeera.com/economy/2026/1/12/republican-lawmakers-break-from-us-president-on-fed-chair-indictment?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2026/01/2026-01-12T081104Z_1791278950_RC2VDIAAE42L_RTRMADP_3_USA-FED-POWELL-INVESTOR-1768238237.jpg?resize=1920%2C1440","video":null,"publish_date":"2026-01-12 20:07:57","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.171},{"id":392477484,"title":"Sen. Mark Kelly Sues Pete Hegseth Over Military Rank Demotion Due To Viral ‘Illegal Orders’ Video","text":"Democratic Arizona Sen. Mark Kelly filed a lawsuit against Secretary of War Pete Hegseth on Monday — challenging Hegseth’s move to demote Kelly’s military rank after the senator told service members to defy the Trump administration’s “illegal orders.”\n\nKelly’s lawsuit, which was docketed in Washington D.C., claims Hegseth’s efforts to demote his rank following his November 2025 appearance in a viral video violates the Constitution’s speech or debate clause. Kelly argued in a statement announcing the suit that the executive branch has never before sought to impose military sanctions on a U.S. lawmaker over saying “something that the President or Secretary of Defense doesn’t like.” (RELATED: Pete Hegseth Takes Action Against Sen. Mark Kelly, Who Egged On Military To Defy Trump In Viral Video)\n\n Pete Hegseth is coming after what I earned through my twenty-five years of military service, in violation of my rights as an American, as a retired veteran, and as a United States Senator whose job is to hold him—and this or any administration—accountable. His unconstitutional… — Senator Mark Kelly (@SenMarkKelly) January 12, 2026 \n\n“Now, Pete Hegseth wants our longest-serving military veterans to live with the constant threat that they could be deprived of their rank and pay years or even decades after they leave the military just because he or another Secretary of Defense doesn’t like what they’ve said,” Kelly said in his statement. “That’s not the way things work in the United States of America, and I won’t stand for it.”\n\nHegseth’s move to demote the senator comes after five other Democrats, including Kelly’s colleague Sen. Elissa Slotkin of Michigan, a former intelligence officer, posted a video the social media calling on U.S. military and intelligence personnel to “refuse illegal orders.”\n\nHouse Reps. Jason Crow of Colorado, Chris Deluzio of Pennsylvania, Maggie Goodlander of New Hampshire and Chrissy Houlahan of Pennsylvania, who are all military veterans, were also in the video.\n\nPresident Donald Trump called the video “seditious behavior” and Hegseth dubbed the half dozen Democratic lawmakers, the “Seditious Six.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'I won't stand for it'","url":"https://dailycaller.com/2026/01/12/mark-kelly-sues-pete-hegseth-military-rank-demotion/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-2254316229-scaled-e1768245841753.jpg","video":null,"publish_date":"2026-01-12 19:44:29","author":"Andi Shae Napier","authors":["Andi Shae Napier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.247},{"id":392478826,"title":"Dozens of prisoners released in Venezuela as families of detainees hope for more","text":"CARACAS, Venezuela (AP) — Yaxzodara Lozada woke up Monday freezing after sleeping on the sidewalk outside a prison in Venezuela’s capital, hoping her husband, a police officer who was detained on Nov. 17, will walk free as part of a goodwill effort the government announced last week.\n\nWhile Venezuelan commerce and daily life have begun to resume — with malls, schools and gyms reopening a week after a stunning U.S. attack led to the arrest of President Nicolás Maduro — the promised release of imprisoned opposition figures, civil society leaders and journalists has materialized only in a trickle, prompting criticism.\n\nRelatives of many of the more than 800 people that human rights organizations say are imprisoned in Venezuela for political reasons began gathering outside prisons Thursday, when the government of acting President Delcy Rodríguez pledged to free a significant number of prisoners in what it described as a gesture to “seek peace.” Officials have not identified or given a number of prisoners being considered for release, leaving rights groups scouring for hints of information and families to wait anxiously.\n\nAs of Monday afternoon, the Venezuelan advocacy group Foro Penal had verified the release of 49 prisoners. Among those confirmed freed were several foreign nationals holding Italian, Spanish, Argentine, Israeli and Colombian citizenship.\n\nAlso on Monday, the White House confirmed that Venezuelan opposition leader María Corina Machado is set to meet with U.S. President Donald Trump at the White House on Thursday.\n\nOver the weekend, Trump said the releases came at Washington’s request.\n\n“Venezuela has started the process, in a BIG WAY, of releasing their political prisoners,” Trump wrote Saturday on his Truth Social platform.\n\nOthers criticized the government for not fulfilling its promise of releasing a significant number of people.\n\nOn Monday, the U.N.-backed fact-finding mission on Venezuela welcomed the release of prisoners, but said in a statement that the amount of people released in recent days “falls far short” of the wider demand for the “immediate and unconditional release of all political prisoners.”\n\nLozada said she had not seen her husband since he was detained on Nov. 17 — an arrest for which she says no reason was ever given.\n\nNext to her, relatives of other detainees stretched and looked for water after spending the night on the ground, using old couch cushions and pieces of foam. In front of them, cars kept going by to drop off students at a school adjacent to the prison.\n\n“These are two realities. They want the world to see that everything is normal, that nothing happened here,” said Jenny Quiroz, whose husband was detained Nov. 26 at his pharmacy in Caracas for allegedly criticizing the government in a WhatsApp group. “But it’s a mixture of anguish, despair…. You know what it’s like to have 48 days without knowing if he eats, if they have him isolated, if they are psychologically or physically torturing him?”\n\nQuiroz said she wanted Trump to know that the information he is receiving regarding prison releases “is not 100% true.”\n\nAs relatives awaited news of their loved ones at prisons, the government deployed security forces to public schools around the country for the first day of classes since the holiday break. Uniformed students walked the streets of Caracas some alone and others accompanied by adults.\n\nThe Venezuelan government has tried to push forward a message of normalcy after the U.S. military operation that rocked the nation.\n\nDuring a school tour broadcast on state television, acting President Rodríguez — surrounded by children — railed against the Trump administration while simultaneously striking an optimistic tone about the country’s future. She said her country is “actively resisting” the U.S. while “we’re writing a new page in Venezuelan history.”\n\nWhile teachers braced for questions from students about the Jan. 3 attack, preschool teacher Ángela Ramírez said the topic did not come up in her classroom.\n\n“I didn’t address it because I didn’t notice the interest and a need in them to know what’s going on,” she said. “They are happy to be back at school.”\n\nAssociated Press writer Megan Janetsky contributed from Mexico City.\n\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america","url":"https://apnews.com/article/venezuela-prisoners-released-delcy-trump-machado-75e8d841947695415703dc0dc5502ab5","image":"https://dims.apnews.com/dims4/default/127d390/2147483647/strip/false/crop/8640x5760+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fe1%2F899b14496e1becbf76387a5435a3%2F41f42e9d56074c3dacdef59f71c9bf52","video":null,"publish_date":"2026-01-12 19:34:28","author":"Regina Garcia Cano","authors":["Regina Garcia Cano"],"language":"en","category":"politics","source_country":"us","sentiment":-0.106},{"id":392478760,"title":"A blossoming Texas medical marijuana industry adds new businesses, products and patients","text":"After lawmakers blunted expansion for years, Texas’ medical marijuana industry is slated to see more marijuana operators coming online, current ones opening more facilities and more Texans enrolling in the program this year.\n\nIn September, Texas officially rolled out the most significant expansion of its medical marijuana program, the Texas Compassionate Use Program, since its launch in 2015. The expansion adds new qualifying conditions such as chronic pain, inflammatory bowel disease, Crohn’s disease, traumatic brain injury, and terminal illness. It also added more treatment options like prescribed inhalers, higher THC limits, and better dispensary access across the state. The expansion will also increase the number of marijuana distributors from three to 15.\n\nLawmakers enacted these changes after distributors in the program said strict state regulations on THC amounts, locations, cultivation, and more hampered the program’s growth and, in fact, contributed to them losing patients to cheaper, more accessible, and diverse hemp products.\n\n“What made TCUP expensive in the past was the fact that you had this niche program with a huge regulatory burden on top of it. Now, as you expand the program, the cost of regulation becomes a smaller percentage, and therefore the marginal cost of products will come down over time,” said Nico Richardson, CEO of Texas Original, a Central Texas medical marijuana company.\n\nThe Texas Department of Public Safety reported that by the end of 2025, 135,470 patients were listed in the Compassionate Use Registry by their physicians, about 32% more than the previous year. Distributors are attributing it to the news of the budding expansion.\n\nThe law immediately benefits the state’s three dispensing organizations, Texas Original, goodblend, and Fluent. Since these companies mostly sell their products online, none of them have opened more storefronts yet, but they have created more satellite locations across the state to store their products, allowing products to be cheaper and delivered to customers faster. Before the law, companies would have to return the product to the original dispensary every day, raising overhead costs.\n\n“We are planning to have a satellite location in all 11 public health regions within the next six months,” Richardson said.\n\nTexas Original has also moved from a 7,700-square-foot facility to its new 75,000-square-foot headquarters in Bastrop to cultivate more strains of marijuana and expand their product options.\n\nAustin-based Goodblend has opened its first satellite location in San Antonio that allows for same-day pick-up and plans to expand further into Texas to reach remote locations.\n\n“We are also working on a slew of new products and formats as it relates to vaporization and hopefully have something down the pipe in the next six months,” said Jervonne Singletary, goodblend’s spokesperson.\n\nAnd, more medical marijuana operators will soon join the existing three. One of the most heralded parts of the expansion is the addition of 12 licensed dispensing organizations by April 1, as outlined in House Bill 46.\n\nThe first phase is underway with DPS awarding nine businesses with conditional licenses. These nine businesses are not authorized to cultivate, manufacture, distribute, or sell any cannabis products until the department grants final approval, said Sheridan Nolen, Texas Department of Public Safety spokesperson.\n\nThe dispensing organizations will be assigned a health region. “Additionally, House Bill 46 does not allow dispensing organizations to operate more than one satellite location in a single public health region until they operate at least one satellite location in each public health region,” Nolen said.\n\nMost of these distributors operate in cannabis markets outside of Texas and are expected to leverage existing resources to get a quick start here.\n\n“After being awarded a Conditional Dispensing Organization License in December, we continue to work collaboratively with key stakeholders on all required next steps in the process,” said George Archos, founder and CEO of Chicago-based Vernano, which will serve public health region 10 in West Texas. “…We look forward to putting plants in the ground that are grown in Texas, by Texans, and delivered to patients across the state, in accordance with the law.”\n\nThese new marijuana distributors have up to two years after final approval to become fully operational in Texas, but Singletary expects it might be a little after nine months to a year.\n\nShe said once those additional businesses get up in running, she expects the prices on medical marijuana products that can range from $40 to $70 to continuously drop based on what she has seen in other states that have undergone an expansion like Florida.\n\nAll of these changes are great on paper, but distributors say the one hurdle that is holding the program back from its full potential is the medical providers themselves.\n\nAwareness among medical providers\n\nOne of the key cogs of the Texas Compassionate Use Program when it was first created was medical providers, but very few have registered to prescribe medical cannabis, limiting the options Texans have had to enter the program.\n\nRichardson said there are around 80,000 board-certified physicians in Texas, and only 800 are registered in the TCUP program.\n\n“We’re absolutely laser-focused on doctors, because they are really the patients’ first entry point into the program, by asking your physician if you qualify,” Singletary said.\n\nTo become registered to prescribe medical cannabis in Texas, a provider must visit the Texas DPS registry portal with their Texas Medical Board license, American Board of Medical Specialties certification, and driver’s license to complete the application.\n\nAmong the reasons for the sluggish enrollment is a lack of awareness about the program among medical providers.\n\nRichardson said state agencies have mostly been hands-off in spreading awareness of the program, leaving it up to distributors to boost the number of subscribers.\n\n“That is all we have done for the past seven or eight years is educate doctors on the fact that the program exists. DPS hasn’t had a campaign out there to bring doctors into the program. This has pretty much been a Texas Original effort,” he said.\n\nAlso, most medical providers didn’t see a need to register, since most of their patients weren’t eligible.\n\nMatthew Brimberry, an Austin-based doctor and medical director of the Texas Cannabis Clinic, said he didn’t join the state’s medical program until 2019, when the list of qualifying conditions expanded from only those with intractable epilepsy to include terminal cancer.\n\nOther reasons why medical providers are hesitant to join the program include workload and lack of knowledge around the benefits of cannabis.\n\n“It’s another electronic health system portal that you have to register patients into, which can be a hurdle when you are already dealing with so many portals,” Brimberry said. “Also, the nature of the medicine itself, there is not a lot of education on it. Being a medical provider, you aren’t going to recommend something you don’t know about.”\n\nBrimberry said no health field has taken the lead on prescribing medical cannabis, leaving it up to providers who have a specific interest in it to advocate for it.\n\nTo get around this problem of having a small pool of providers to choose from, local medical marijuana distributors have been using telemedicine to connect patients with specialized providers across the state, but Singletary said in an ideal world, patients would be visiting any doctor to learn more about medical marijuana.\n\n“I am happy there is an alternative route for folks that might not be comfortable talking to their physician about this. But I want to see more Texas doctors in the program,” she said.\n\nNew opportunities on the way\n\nIn December, President Donald Trump signed an executive order to expedite the reclassification of marijuana from a Schedule I drug, alongside heroin and LSD, to Schedule III, like ketamine and some steroids.\n\nIn 2023, the federal Department of Health and Human Services determined marijuana has acceptable medical use after finding that health care practitioners across 43 jurisdictions are authorized to recommend the medical use of marijuana to more than 6 million registered patients for at least 15 medical conditions.\n\nThe rescheduling doesn’t make recreational marijuana legal across the nation. However, it changes how it’s regulated, removing barriers to scientific research and reducing the industry’s tax burden, and improving access to banking services.\n\n“The thawing of the capital market, better banking, and better relationships with the IRS will free up some capital for more investment, create new products, and drive down costs, so this rescheduling, which we still don’t know a lot about yet, is potentially a big opportunity,” Singletary said.\n\nThis changing view of marijuana from the Trump administration might also signal the rest of the Republican Party’s warming toward full legalization.\n\n“We finally have a federal government, which is frankly 10 years behind the times right now, recognizing the medical benefits of medical cannabis, and we’ve known this for a long time,” Richardson said. “I think we have reached the point where denying this no longer makes any sense at this point.”\n\nThe cannabis industry views the expansion in Republican-led Texas as a model for other southern states to expand their cannabis programs, and Texas’ large geographic size and economic infrastructure could make the state a national hub for medical marijuana..\n\n“Most of the structural problems of the TCUP program have now been solved. Whether it’s access through satellite locations, it’s better and available products that patients were looking for, just know it’s a viable and growing program right now,” Richardson said.\n\nThis story was originally published by The Texas Tribune and distributed through a partnership with The Associated Press.","url":"https://apnews.com/article/marijuana-texas-donald-trump-donald-trump-es-general-news-802701ab7fdc8811cd8282b62f4d5332","image":"https://dims.apnews.com/dims4/default/3a1cb52/2147483647/strip/false/crop/700x450+0+0/resize/700x450!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png","video":null,"publish_date":"2026-01-12 19:24:13","author":"Stephen Simpson/the Texas Tribune","authors":["Stephen Simpson/the Texas Tribune"],"language":"en","source_country":"us","sentiment":0.038},{"id":392475836,"title":"Sen. Mark Kelly Sues Pete Hegseth Over Censure","text":"Defense Secretary Pete Hegseth’s bid to censure Sen. Mark Kelly (D-Ariz.), a retired Navy captain, for encouraging service members to resist unlawful orders is nothing more than “punitive retribution,” according to a lawsuit filed by Kelly on Monday. \n\nIn November, Kelly and a handful of other lawmakers appeared in a short video shared on social media that urged U.S. service members and members of intelligence agencies to uphold their oaths to the Constitution in the face of “enormous stress and pressure.” The lawmakers also encouraged them to defy any “illegal orders” as part of that oath. \n\nThe backlash was swift, with President Donald Trump calling the video seditious and suggesting its recommendations were “punishable by death.” Hegseth issued a letter to censure Kelly last week, saying the “reckless and seditious video” was “clearly intended to undermine good order and military discipline.” \n\n“This conduct was seditious in nature and violated Articles 133 and 134 of the Uniform Code of Military Justice, to which Captain Kelly remains subject as a retired officer receiving pay,” Hegseth declared. \n\nHegseth said he had “initiated” proceedings that could result in a reduction of Kelly’s retirement pay and that a decision would be made within 45 days.\n\nIn a statement Monday, Kelly said the self-proclaimed “Secretary of War” is “coming after what I earned through my twenty-five years of military service, in violation of my rights as an American, as a retired veteran, and as a United States Senator whose job is to hold him — and this or any administration — accountable.”\n\nIn the lawsuit, Kelly’s lawyers pointed out that when Hegseth said Kelly would be censured, he also threatened him with criminal prosecution if he continued to make similar statements going forward.\n\n“The First Amendment forbids the government and its officials from punishing disfavored expression or retaliating against protected speech,” Kelly’s lawyers wrote Monday.\n\n“It appears that never in our nation’s history has the Executive Branch imposed military sanctions on a Member of Congress for engaging in disfavored political speech,” they added.\n\nLetting that “unprecedented step here would invert the constitutional structure by subordinating the Legislative Branch to executive discipline and chilling congressional oversight of the armed forces,” the lawsuit states.\n\nThe remarks in the video — Kelly also appeared with Sen. Elissa Slotkin (D-Mich.), Rep. Chrissy Houlahan (D-Pa.), Rep. Chris Deluzio (D-Pa.), Rep. Maggie Goodlander (D-N.H.) and Rep. Jason Crow (D-Colo.) — were straightforward. \n\n“Our laws are clear: You can refuse illegal orders. You can refuse illegal orders. You must refuse illegal orders,” they said. “No one has to carry out orders that violate the law or our Constitution.”\n\nNo specific directive was given in the message.\n\nKelly wants the court to issue an order stopping Hegseth from reducing his retirement pay and to declare his actions were illegal. \n\n“From the moment I drove through the gates of Naval Air Station Pensacola, to when I was shot at over Iraq and Kuwait, to when I landed Space Shuttle Endeavour on its last mission, I gave everything I had to this country and I earned my rank of Captain, United States Navy,” Kelly said in a statement issued Monday. “Now, Pete Hegseth wants our longest-serving military veterans to live with the constant threat that they could be deprived of their rank and pay years or even decades after they leave the military just because he or another Secretary of Defense doesn’t like what they’ve said. That’s not the way things work in the United States of America, and I won’t stand for it.” \n\nA spokesperson for the Defense Department told HuffPost Monday: “We are aware of the litigation. However, as a matter of policy, the Department does not comment on ongoing litigation.”","url":"https://www.huffpost.com/entry/mark-kelly-sues-pete-hegseth-over-censure_n_69654521e4b0f5f77ec84a3f?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/696551761700005005aac94f.jpeg?ops=1778_1000","video":null,"publish_date":"2026-01-12 19:19:03","author":"Brandi Buchman","authors":["Brandi Buchman"],"language":"en","source_country":"in","sentiment":-0.389},{"id":392475818,"title":"Sen. Mark Kelly Sues Pete Hegseth Over Censure","text":"Defense Secretary Pete Hegseth’s bid to censure Sen. Mark Kelly (D-Ariz.), a retired Navy captain, for encouraging service members to resist unlawful orders is nothing more than “punitive retribution,” according to a lawsuit filed by Kelly on Monday. \n\nIn November, Kelly and a handful of other lawmakers appeared in a short video shared on social media that urged U.S. service members and members of intelligence agencies to uphold their oaths to the Constitution in the face of “enormous stress and pressure.” The lawmakers also encouraged them to defy any “illegal orders” as part of that oath. \n\nThe backlash was swift, with President Donald Trump calling the video seditious and suggesting its recommendations were “punishable by death.” Hegseth issued a letter to censure Kelly last week, saying the “reckless and seditious video” was “clearly intended to undermine good order and military discipline.” \n\n“This conduct was seditious in nature and violated Articles 133 and 134 of the Uniform Code of Military Justice, to which Captain Kelly remains subject as a retired officer receiving pay,” Hegseth declared. \n\nHegseth said he had “initiated” proceedings that could result in a reduction of Kelly’s retirement pay and that a decision would be made within 45 days.\n\nIn a statement Monday, Kelly said the self-proclaimed “Secretary of War” is “coming after what I earned through my twenty-five years of military service, in violation of my rights as an American, as a retired veteran, and as a United States Senator whose job is to hold him — and this or any administration — accountable.”\n\nIn the lawsuit, Kelly’s lawyers pointed out that when Hegseth said Kelly would be censured, he also threatened him with criminal prosecution if he continued to make similar statements going forward.\n\n“The First Amendment forbids the government and its officials from punishing disfavored expression or retaliating against protected speech,” Kelly’s lawyers wrote Monday.\n\n“It appears that never in our nation’s history has the Executive Branch imposed military sanctions on a Member of Congress for engaging in disfavored political speech,” they added.\n\nLetting that “unprecedented step here would invert the constitutional structure by subordinating the Legislative Branch to executive discipline and chilling congressional oversight of the armed forces,” the lawsuit states.\n\nThe remarks in the video — Kelly also appeared with Sen. Elissa Slotkin (D-Mich.), Rep. Chrissy Houlahan (D-Pa.), Rep. Chris Deluzio (D-Pa.), Rep. Maggie Goodlander (D-N.H.) and Rep. Jason Crow (D-Colo.) — were straightforward. \n\n“Our laws are clear: You can refuse illegal orders. You can refuse illegal orders. You must refuse illegal orders,” they said. “No one has to carry out orders that violate the law or our Constitution.”\n\nNo specific directive was given in the message.\n\nKelly wants the court to issue an order stopping Hegseth from reducing his retirement pay and to declare his actions were illegal. \n\n“From the moment I drove through the gates of Naval Air Station Pensacola, to when I was shot at over Iraq and Kuwait, to when I landed Space Shuttle Endeavour on its last mission, I gave everything I had to this country and I earned my rank of Captain, United States Navy,” Kelly said in a statement issued Monday. “Now, Pete Hegseth wants our longest-serving military veterans to live with the constant threat that they could be deprived of their rank and pay years or even decades after they leave the military just because he or another Secretary of Defense doesn’t like what they’ve said. That’s not the way things work in the United States of America, and I won’t stand for it.” \n\nA spokesperson for the Defense Department told HuffPost Monday: “We are aware of the litigation. However, as a matter of policy, the Department does not comment on ongoing litigation.”","url":"https://www.huffpost.com/entry/mark-kelly-sues-pete-hegseth-over-censure_n_69654521e4b0f5f77ec84a3f?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/696551761700005005aac94f.jpeg?ops=1778_1000","video":null,"publish_date":"2026-01-12 19:19:03","author":"Brandi Buchman","authors":["Brandi Buchman"],"language":"en","source_country":"in","sentiment":-0.389},{"id":392474736,"title":"Canada MP joins viral Iran protest trend, lights cigar with burning portrait of Khamenei in front of office","text":"Canadian MP Roman Baber followed the viral Iran protest trend and lit a cigar -- standing in front of his office -- from a burning photo of Iran's Supreme Leader Ayatollah Khamenei. He posted the video on social media with a two-word caption that read: 'F Khanemei'.The photo of a woman lighting a cigarette with Khanemei's burning photo became a trend as several women started posting similar videos. The trend, however, did not start in Iran and the woman in the first viral photo was in Canada. The woman was dubbed 'Morticia Addams' on social media. The 25-year-old lives in Canada and reportedly was arrested during the November 2019 protests in Iran. She said she posted the photo as a gesture as she could not be on the street. \"Every time I was on the street. This time I couldn’t be. Forgive me, Mother Iran,\" she wrote in one post. The image gained international attention after JK Rowling shared a poster showing the woman lighting a cigarette from a half-burned portrait of Supreme Leader Ali Khamenei.Rowling wrote: “If you claim to support human rights yet can’t bring yourself to show solidarity with those fighting for their liberty in Iran, you’ve revealed yourself. You don’t give a damn about people being oppressed and brutalized so long as it’s being done by the enemies of your enemies.”Canada praised the bravery of the Iranian people in their protest and condemned the regime for the killing of protesters. “We strongly condemn the killing of protestors, the use of violence, arbitrary arrests, and intimidation tactics by the Iranian regime against its own people. Iran must immediately end the use of excessive and lethal force by its security forces including the Islamic Revolutionary Guard Corps (IRGC) and Basij against protestors. Too many lives – over 40 to date - have already been lost.“The Iranian regime has the responsibility to protect its own population and must allow for the freedom of expression and peaceful assembly without fear of reprisal,\" a joint statement of Canada, Australia and the European Union, issued on January 9, read.According to human rights organizations, at least 599 people have been kulled during the two weeks of protest. US President Donald Trump says Iran has proposed negotiations after his threat to strike the Islamic Republic as a crackdown on demonstrators has led to hundreds of deaths. Trump said late Sunday his administration was in talks to set up a meeting with Tehran. Iran did not acknowledge Trump’s comments immediately. It has previously warned the US military and Israel would be “legitimate targets” if America uses force to protect demonstrators.","summary":"","url":"https://timesofindia.indiatimes.com/world/rest-of-world/canada-mp-joins-viral-iran-protest-trend-lights-cigar-with-burning-portrait-of-khamenei-in-front-of-office/articleshow/126491736.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126491772/126491772.jpg","video":null,"publish_date":"2026-01-12 19:18:04","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.353},{"id":392479582,"title":"Could the US really take over Greenland?","text":"US President Donald Trump has said repeatedly that he wants to take over Greenland – an idea rejected by most people living there.\n\nThere is alarm in Denmark, which owns the world’s biggest island, and in the European Union and NATO, too.\n\nSo, could Trump really get his way?\n\nPresenter: Imran Khan\n\nPele Broberg – Chairman of Naleraq, a pro-independence political party in Greenland\n\nPeter Nielsen – Retired colonel in the Danish armed forces who specialises in NATO readiness\n\nGreg Swenson – Chairman of Republicans Overseas UK and a financial and political commentator","summary":"Donald Trump&#039;s seizure threats unnerve islanders, Denmark, European Union and NATO.","url":"https://www.aljazeera.com/video/inside-story/2026/1/12/could-the-us-really-take-over-greenland?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2026/01/image-1768242897.jpg?resize=1920%2C1061&quality=80","video":null,"publish_date":"2026-01-12 19:12:32","author":"Apps Support","authors":["Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.235},{"id":392478740,"title":"Democratic Sen. Kelly sues the Pentagon","text":"WASHINGTON (AP) — Democratic Sen. Mark Kelly sued the Pentagon on Monday over attempts to punish him for his warnings about illegal orders, claiming the Trump administration trampled on his constitutional rights to free speech.\n\nKelly, a former U.S. Navy pilot who represents Arizona, is seeking to block his censure last week from Defense Secretary Pete Hegseth, who said he censured Kelly over his participation in a video that called on troops to resist unlawful orders.\n\nHegseth said the Jan. 5 censure — by itself simply a formal letter with little practical consequence — was “a necessary process step” to proceedings that could result in a demotion from Kelly’s retired rank of captain and subsequent reduction in retirement pay.\n\nKelly asked the federal court in Washington, D.C., to rule that the censure letter, the proceedings about his rank and any other punishments against him are “unlawful and unconstitutional.”\n\n“The First Amendment forbids the government and its officials from punishing disfavored expression or retaliating against protected speech,” his lawsuit says. “That prohibition applies with particular force to legislators speaking on matters of public policy.”\n\nThe case was assigned to U.S. District Judge Leon, who was nominated to the bench by Republican President George W. Bush. \n\nThe legal action of a sitting U.S. senator suing the defense secretary is rare, if not jarring, and the latest effort from members of Congress to push back against what they see as an out-of-control executive branch.\n\nThe censure stemmed from Kelly’s participation in a video in November with five other Democratic lawmakers — all veterans of the armed services and intelligence community — in which they called on troops to uphold the Constitution and not to follow the Trump administration’s military directives if they were unlawful.\n\nThe 90-second video was first posted on a social media account belonging to Sen. Elissa Slotkin. Reps. Jason Crow, Chris Deluzio, Maggie Goodlander and Chrissy Houlahan also appeared in the video.\n\nRepublican President Donald Trump accused the lawmakers of sedition “punishable by DEATH” in a social media post days later.\n\nKelly and the other lawmakers have not backed down from their video, which was released as the Pentagon began attacking suspected drug-smuggling boats in the waters near Venezuela. The attacks have now killed at least 115 people. \n\nThe Pentagon opened an investigation of Kelly in late November, citing a federal law that allows retired service members to be recalled to active duty on orders of the defense secretary for possible court-martial or other punishment.\n\nAlthough all six lawmakers served in the military or the intelligence community, Hegseth said Kelly was the only one facing investigation because he is the only one who formally retired from the military and still falls under the Pentagon’s jurisdiction.\n\nHegseth, the Defense Department, Navy Secretary John Phelan and the Navy are named as defendants in the lawsuit. The Pentagon said in a statement it was aware of the lawsuit, but “as a matter of policy, the Department does not comment on ongoing litigation.”\n\nKelly said in a statement on Monday that he is “standing up for the rights of the very Americans who fought to defend our freedoms.” He accused Hegseth of trying to suppress dissent by threatening military veterans with depriving them of their rank and pay.\n\n“That’s not the way things work in the United States of America, and I won’t stand for it,” Kelly said.\n\nAssociated Press writer Ben Finley and Congressional Correspondent Lisa Mascaro contributed to this report.","url":"https://apnews.com/article/pentagon-kelly-hegseth-illegal-orders-lawsuit-9c6fe0ed8241f93211a0638a27bfe7d8","image":"https://dims.apnews.com/dims4/default/664c152/2147483647/strip/false/crop/5057x3371+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F99%2F7cb8a6184d80cfb2e05b863d1239%2F2998e630de244a1e8a4cf2d5c0a74645","video":null,"publish_date":"2026-01-12 19:09:18","author":"Michael Kunzelman","authors":["Michael Kunzelman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.101},{"id":392478732,"title":"Bringing charges against the Fed: What we do (and don't) know","text":"WASHINGTON (AP) — President Donald Trump has dramatically escalated his confrontation with the Federal Reserve, his Justice Department investigating and threatening a criminal indictment of the independent central bank and serving it with subpoenas.\n\nThe dispute is ostensibly about Fed Chair Jerome Powell’s testimony to Congress in June over the cost of a massive renovation of Fed buildings. But in a statement Sunday, Powell, abandoning his previous attempt to ignore Trump’s relentless criticism, called the administration’s threat of criminal charges “pretexts’’ in the president’s campaign to seize control of U.S. interest rate policy from the Fed’s technocrats.\n\nTrump has repeatedly criticized Powell and the Fed for not moving faster to cut rates. Economists warn that a politicized Fed that caves in to the president’s demands will damage its credibility as an inflation fighter and likely lead investors to demand higher rates before investing in U.S. Treasurys.\n\nHere’s what to know about the dispute:\n\nThe threat of charges arises from a $2.5 billion Fed renovation project\n\nThe $2.5 billion renovation of two Fed buildings in Washington dates back to Trump’s first term and attracted little attention for years. But over the summer, the administration began to complain about cost overruns in the project — criticisms that coincided with Trump’s increasing pressure on the Fed to slash interest rates to stimulate the economy.\n\nTaxpayers are not footing the bill for the Fed renovations directly. Unlike other government agencies, which receive taxpayer money appropriated by Congress, the central bank is self-financed, drawing on interest from its massive holdings of Treasury debt. \n\nThe Fed says its headquarters, known as the Marriner S. Eccles building, desperately needed an upgrade because its electrical, plumbing and HVAC systems, among others, are nearly obsolete; some date back to the building’s construction in the 1930s.\n\nThe Fed is removing asbestos, lead and other hazardous elements from the building and installing modern electrical and communications systems. The H-shaped building, named after a Fed chair from the 1930s and ’40s, is located near some of Washington’s highest-profile monuments. The central bank is also renovating a building next door that it acquired in 2018.\n\nThe Fed has said: “The construction project identified key architectural features to preserve the historic integrity of the buildings, such as stonework, including marble, façades, meeting rooms, and other spaces. Historic preservation work in the Eccles Building also includes elevators that are original to the building, and historic conference rooms.\"\n\nThe costs of the Fed overhaul have ballooned \n\nOriginally budgeted at about $1.9 billion, the project’s costs have swelled by $600 million.\n\nThe Fed cites many reasons for the greater expense. Construction costs, including for materials and labor, rose sharply during the inflation spike of 2021 and 2022. The project required more asbestos removal than expected. And Washington’s local restrictions on building heights forced it to build underground, which is pricier.\n\nBecause of the rising costs, the Fed’s board canceled planned renovations of a third building in 2024.\n\nThe Fed says the renovations will reduce costs “over time” because it will be able to pack its 3,000 Washington-based employees into fewer buildings and pay less rent.\n\nAt a Senate Banking Committee hearing in June, Chairman Tim Scott, a South Carolina Republican, claimed that renovation included “rooftop terraces, custom elevators that open into VIP dining rooms, white marble finishes, and even a private art collection.” In his testimony, Powell disputed those details, saying “there’s no new marble. ... there are no special elevators.” \n\nIn July, Trump visited the building site and, while standing next to Powell, overstated the cost of the renovation. Still, Trump downplayed concerns later that day, saying “they have to get it done ... Look, there’s always Monday morning quarterbacks. I don’t want to be that. I want to help them get it finished.”\n\nWhen asked if the overruns amounted to a firing offense, Trump said, “I don’t want to put that in this category.”\n\nBut at a December 29 news conference, Trump said his administration would “probably” sue Powell for “gross incompetence” on the cost of renovations, calling it the “highest price of construction per square foot in the history of the world.”\n\nThe Supreme Court signaled last year that Trump can’t fire Powell simply over disagreements about interest rates. But he could do so legally “for cause,” such as misconduct or dereliction of duty.\n\nThe dispute seemed to have died down before flaring up again\n\nThe controversy over the renovations died down after the summer. \n\nBut Trump kept up his pressure on the Fed. In August, he said he was firing Fed governor Lisa Cook, an unprecedented step arising from allegations of mortgage fraud, which she has denied. Cook has sued to keep her job and courts have ruled she can remain in her seat while the case plays out. The Supreme Court will hear arguments in the case Jan. 21.\n\nTrump has repeatedly used investigations — which might or might not lead to an actual indictment — to attack other political rivals, including New York Attorney General Letitia James and James Comey, the former FBI director.\n\nSpeaking briefly NBC News Sunday, Trump claimed that he knew nothing about the investigation into Powell. When asked if it is intended to pressure the Fed chair on rates, Trump said, “No. I wouldn’t even think of doing it that way.”\n\nWhite House press secretary Karoline Leavitt told reporters that Trump did not direct his Justice Department to investigate Powell.\n\nThe subpoenas come at an unusual moment when Trump was teasing the likelihood of announcing his nominee this month to succeed Powell as the Fed chair. While Powell’s term as chair ends in May, he has a separate term as a Fed governor until January 2028.\n\nTrump has been criticized for his own renovations\n\nTrump has come under fire for his own decision to tear down the facade of the East Wing of the White House to put in a $250 million ballroom.\n\nThe 90,000-square-foot ballroom will dwarf the main White House itself: The Executive Mansion occupies just 55,000 square feet. Trump says the ballroom will accommodate 999 people.\n\nLike the Fed’s project, Trump’s ballroom won’t cost taxpayers anything: It is being privately funded by “many generous Patriots, Great American Companies, and, yours truly,” Trump has said on social media.\n\nThe president argues that the White House needs a large entertaining space. He has complained about the capacity of the East Room, which can hold 200 people and is currently the largest space in the White House. He also objects to the practice of past presidents hosting state dinners and other events in tents on the South Lawn.\n\nAP Economics Writer Christopher Rugaber contributed to this story.","url":"https://apnews.com/article/federal-reserve-jerome-powell-investigation-b5676bc638f04b3b528372b59673d804","image":"https://dims.apnews.com/dims4/default/4486ec2/2147483647/strip/false/crop/6000x4000+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2Fac%2F60bb721b5ece8182845a7ef0d919%2F080a927b860742b7ad716872941b455a","video":null,"publish_date":"2026-01-12 19:08:51","author":"Paul Wiseman","authors":["Paul Wiseman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.054},{"id":392477504,"title":"Jennifer Welch So Mad About ICE Shooting She Argues Legacy Media Is Pushing Trump Admin Messaging","text":"Left-wing podcaster Jennifer Welch furiously reacted to the Minnesota Immigration and Customs Enforcement (ICE) shooting, arguing that corporate media was pushing messaging aligned with President Donald Trump’s administration during a Monday episode of “IHIP News.”\n\nDuring a Sunday interview on NBC News’ “Meet the Press,” host Kristen Welker asked Democratic Minneapolis Mayor Jacob Frey if he bore “any responsibility as a local leader” to “bring down the temperature” as volatile anti-ICE protests erupted in his city. Welch said on her podcast that corporate media was promoting a “horrific false equivalency” in its coverage of the shooting, calling Welker’s question a particularly “disgusting” example. (RELATED: Jonathan Turley Says ICE Agent Appeared To Be In His Rights To Shoot At Vehicle)\n\n“The way that she asked him, ‘Do you bear responsibility?’ and then she very passionately said to bring the temperature down — this is echoing the propaganda coming from this murderous regime,” Welch said. “Fascism can never take hold if the press doesn’t go along with it. And what she just did there, that false equivalency, is the biggest part of the problem that has led us to this moment. This didn’t just all come out of a vacuum. This has been building and building and building. And it is an utter false equivalency.”\n\nWelker’s question to Frey followed the mayor telling ICE to “get the fuck out of Minneapolis.” Welch attempted to justify the remark by drawing a hypothetical comparison to Nazi Germany.\n\n“If the mayor of Berlin in the early days of the Gestapo, when they were going door-to-door … starting to make these cities police states and Hitler was flexing his arm before the concentration camps, but he’s seeing signs — this hypothetical mayor of Berlin — and you read about it later and you find out that the mayor of Berlin said to Hitler and the Gestapo, ‘Get the fuck out of Berlin,’ to me, that’s going to age very well … because I’m going to realize that this mayor understood the depravity, the dehumanization, that was already being allowed,” she said.\n\n“And so, shame on NBC News for asking these false equivalency-style questions, for normalizing fascism, for normalizing murder, and saying that this mayor should respond in a way that, quote, brings the temperature down, when Trump’s fascist Nazi Gestapo and their little pink-armed piece of shit foot soldier murdered a woman in cold blood, was unarmed, turning away from him with her dog in the back seat, and her wife fighting for her fellow citizens of Minnesota to not be terrorized by these fucking Nazis,” she added.\n\nFrey told Welker that he did “bear responsibility to bring down the temperature” as mayor, but mocked critics who were “offended” by his profane anti-ICE comment.\n\n“I dropped an F-bomb and they killed somebody,” the mayor said. “I think the killing somebody is the inflammatory element here, not the F-bomb, which I’m sure we’ve all heard before.”\n\nWhile Democrats have described the shooting as a murder, the Trump administration has maintained that it was an act of self-defense. The shooting occurred during a Wednesday operation in Minneapolis as 37-year-old Renee Good allegedly accelerated her car forward as ICE agents surrounded her vehicle.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Shame on NBC News'","url":"https://dailycaller.com/2026/01/12/jennifer-welch-so-mad-about-ice-shooting-she-argues-legacy-media-is-pushing-trump-admin-messaging/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FScreenshot-2026-01-12-1.48.51-PM-e1768243807717.png","video":null,"publish_date":"2026-01-12 19:07:04","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.53},{"id":392475748,"title":"Joe Scarborough Drops F-Bomb On Air While Quoting ICE: ‘F**king Bitch!’","text":"Here’s hoping you take your morning joe with two sugars and a splash of profanity.\n\nDuring Monday’s episode of MS NOW’s “Morning Joe,” host Joe Scarborough became increasingly enraged on air while discussing Immigration and Customs Enforcement officer Jonathan Ross, who fatally shot 37-year-old Renee Nicole Good last Wednesday.\n\nJust hours after Ross killed Good, the Department of Homeland Security characterized the Minneapolis mother as one of several “violent rioters” who were blocking ICE officers during a targeted operation. DHS claimed that Good had “weaponized her vehicle” in an attempt to run over an officer.\n\nYet video footage indicates that Good was trying to pull away when Ross shot at her several times, sparking outrage over the Trump administration’s attempt to justify the shooting.\n\nWhat really seemed to tip Scarborough over the edge during Monday’s broadcast was a video allegedly shot from Ross’ perspective that indicates that someone off-camera had called Good a “fucking bitch” right after Ross killed her — and many have assumed it was Ross himself.\n\n“And then [Good] was called an ‘effing B’ after he shot her,” host Mika Brzezinski said, making sure to use careful language to describe the crude remark.\n\n“After he killed her, he’s then calling her a fucking bitch,” Scarborough clarified, using the language from the video. \n\n“OK, Joe! Wow,” Brzezinski cut in, reacting to her co-host and husband’s use of expletives.\n\n“That’s what he said!” Scarborough protested.\n\n“I know,” Brzezinski said, lowering her head to rest it on one of her hands.\n\n“After he murdered… After he — I take that back — after he killed her… After he killed her, that’s what he called her,” Scarborough concluded.\n\nThis was by no means the only thing Scarborough and Brzezinski had to say about the ICE shooting in Minnesota.\n\nBoth hosts were perplexed by the way President Donald Trump’s administration has been handling Good’s killing — with DHS Secretary Kristi Noem claiming that Good was committing an “act of domestic terrorism” long before any investigation could actually conclude that, and despite video evidence suggesting otherwise.\n\nScarborough suggested that the administration’s knee-jerk reaction was “unprofessional,” arguing that officials should have characterized the shooting as a “deadly mistake” and committed to a “fair and straight investigation.” \n\n“And then, after doing that, let the chips fall where they may,” Scarborough said. “And if there was somebody who was untrained, somebody who made a mistake, somebody who made a deadly mistake, well, you actually announce that in your investigation.”\n\n“And I know this is hard for people in the White House to understand: That would actually make people trust you more,” he added, “instead of lying immediately.”","url":"https://www.huffpost.com/entry/joe-scarborough-shocks-co-host-by-cursing-on-air-i-cant-believe-the-ice-agent-called-her-a-fking-bh_n_696478f7e4b0db619f4ad76c?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/696539f7140000140064c0ac.png?cache=8nY6Sk0kZS&ops=1778_1000","video":null,"publish_date":"2026-01-12 18:55:43","author":"Elyse Wanshel","authors":["Elyse Wanshel"],"language":"en","source_country":"in","sentiment":-0.703},{"id":392478776,"title":"Congress members ask judge to order their access to ICE facility","text":"WASHINGTON (AP) — The Trump administration secretly reimposed a policy limiting Congress members’ access to immigration detention facilities a day after a federal immigration officer fatally shot a woman in Minneapolis, attorneys for several congressional Democrats said Monday in asking a federal judge to intervene.\n\nThree Democratic members of Congress from Minnesota were blocked from visiting an Immigration and Customs Enforcement facility near Minneapolis on Saturday, three days after an ICE officer shot and killed U.S. citizen Renee Good in the city.\n\nLast month, U.S. District Judge Jia Cobb in Washington, D.C., temporarily blocked ICE from enforcing policies limiting Congress members’ access to immigration detention facilities. In a court filing on Monday, plaintiffs’ lawyers asked Cobb to hold an emergency hearing and decide if the duplicate notice policy violates her order. Cobb scheduled a hearing for Wednesday.\n\nCobb ruled on Dec. 17 that it is likely illegal for ICE to demand a week’s notice from members of Congress seeking to visit and observe conditions in ICE facilities. The judge said the seven-day notice requirement likely exceeds the Department of Homeland Security’s statutory authority.\n\nThe attorneys asking Cobb for an emergency hearing say the matter is urgent because members of Congress are negotiating funding for DHS and ICE for the next fiscal year with DHS’s annual appropriations due to expire on Jan. 30.\n\n“This is a critical moment for oversight, and members of Congress must be able to conduct oversight at ICE detention facilities, without notice, to obtain urgent and essential information for ongoing funding negotiations,” the lawyers wrote.\n\nGovernment attorneys didn’t immediately respond in writing to the plaintiffs’ hearing request.\n\nOn Saturday, U.S. Reps. Ilhan Omar, Kelly Morrison and Angie Craig attempted to tour the ICE facility in the Minneapolis federal building. They initially were allowed to enter but then told they had to leave about 10 minutes later.\n\nOfficials who turned them away cited a newly imposed seven-day-notice policy for congressional oversight visits. Last Thursday, a day after Good’s death, U.S. Department of Homeland Security Secretary Kristi Noem secretly signed a new memorandum reinstating the same seven-day notice requirement, according to the plaintiffs’ lawyers.\n\nCobb, who was nominated to the bench by Democratic President Joe Biden, ruled last month in favor of 12 other members of Congress who sued to challenge ICE’s amended visitor policies after they were denied entry to detention facilities. Their lawsuit accused Republican President Donald Trump’s administration of obstructing congressional oversight of the centers during its nationwide surge in immigration enforcement operations.\n\nGovernment attorneys had argued that the plaintiffs didn’t have legal standing to bring their claims. They also said it’s merely speculative for the legislators to be concerned that conditions in ICE facilities change over the course of a week. But the judge rejected those arguments.\n\n“The changing conditions within ICE facilities means that it is likely impossible for a Member of Congress to reconstruct the conditions at a facility on the day that they initially sought to enter,” Cobb wrote.\n\nA law bars DHS from using appropriated general funds to prevent members of Congress from entering DHS facilities for oversight purposes. Plaintiffs’ attorneys from the Democracy Forward Foundation said the administration hasn’t shown that none of those funds are being used to implement the latest notice policy.","url":"https://apnews.com/article/minneapolis-shooting-congress-visit-ice-6076e28eab9201d33e2140a593228e60","image":"https://dims.apnews.com/dims4/default/33d37ae/2147483647/strip/false/crop/5186x3458+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F47%2F86ac48dc15da4a94e3cf4adf2b4c%2F6b715a8f2a1243b3a47da433d56edad8","video":null,"publish_date":"2026-01-12 18:54:52","author":"Michael Kunzelman","authors":["Michael Kunzelman"],"language":"en","source_country":"us","sentiment":-0.342},{"id":392478758,"title":"Wind developers fight Trump's 'windmill' opposition in court appearances","text":"A federal judge ruled Monday that work on a major offshore wind farm for Rhode Island and Connecticut can resume, handing the industry at least a temporary victory as President Donald Trump seeks to shut it down. \n\nAt the U.S. District Court for the District of Columbia, Senior Judge Royce Lamberth said the government did not explain why it could not take action short of a complete stop to construction on Revolution Wind while it considers ways to mitigate its national security concerns. He said it also did not provide sufficient reasoning for its change in position. \n\nRevolution Wind has received all of its federal permits and is nearly 90% complete to provide power for Rhode Island and Connecticut.\n\nTrump says his goal is to not let any “windmills” be built. Three energy developers are challenging the administration’s freeze of their offshore wind projects in the federal courts this week.\n\nDanish energy company Orsted, Norwegian company Equinor, and Dominion Energy Virginia each sued to ask the courts to vacate and set aside the administration’s Dec. 22 order to freeze five big projects on the East Coast over national security concerns. Orsted’s hearing was first on its Revolution Wind project. Orsted said it will soon resume construction to deliver affordable, reliable power to the Northeast.\n\nThe administration did not reveal specifics about its national security concerns, but Trump said Friday while meeting with oil industry executives about investing in Venezuela that wind farms are “losers.” He said they lose money, destroy the landscape and kill birds.\n\n“I’ve told my people we will not approve windmills,” Trump said. “Maybe we get forced to do something because some stupid person in the Biden administration agreed to do something years ago. We will not approve any windmills in this country.”\n\nThe Biden administration sought to ramp up offshore wind as a climate change solution. Trump began reversing the country’s energy policies his first day in office with a spate of executive orders aimed at boosting oil, gas and coal. A federal judge ruled Monday that the Trump administration acted illegally when it canceled $7.6 billion in clean energy grants for projects in states that voted for Democrat Kamala Harris in the 2024 election.\n\nThe Trump administration paused leases for the Vineyard Wind project under construction in Massachusetts, Revolution Wind, Coastal Virginia Offshore Wind, and two projects in New York: Sunrise Wind and Empire Wind. New York’s attorney general sued the Trump administration on Friday over Empire Wind and Sunrise Wind. \n\nRevolution Wind and Sunrise Wind are both major offshore wind projects by Orsted. Rhode Island and Connecticut filed their own request in court to try to save Revolution Wind.\n\n“The law takes precedent over the political whims of one man, and we will continue to fight to make sure that remains the case,” Rhode Island Attorney General Peter Neronha said in a statement.\n\nAt Monday’s hearing, attorney Janice Schneider, representing Revolution Wind, said the stop work order came at a critical stage of construction, with the project nearly 90% built and weeks away from beginning to deliver power to the electric grid. She said the delay is costing more than $1.4 million per day, and a specialized vessel has just enough time now to install the remaining turbines before its contract is up at the site in February. \n\nSchneider said they take national security issues seriously, but the government has not shared more information about its concerns with their experts who have security clearances, or shared unclassified summaries. \n\n“We do think that this court should be very skeptical of the government’s true motives here,” Schneider said, citing Trump’s comments from Friday. \n\nDepartment of Justice attorney Peter Torstensen argued that national security is paramount and protecting against new risks identified in the classified materials outweighs any alleged irreparable harm to the developers.\n\nWork on the Revolution Wind project was previously paused on Aug. 22 for what the Bureau of Ocean Energy Management said were national security concerns. A month later, Judge Lamberth ruled the project could resume, citing the irreparable harm to the developers and the demonstrated likelihood of success on the merits of their claim. Orsted is building it with Skyborn Renewables.\n\nWith four offshore wind projects still stalled, Hillary Bright, executive director of offshore wind advocacy group Turn Forward, said she’s hopeful that they will prevail in court and that the administration will begin to understand “the immense benefits that these nearly complete power sources can bring to our nation’s energy and national security.”\n\nEquinor owns Empire Wind. Its limited liability company, Empire Wind LLC, said the project faces “likely termination” if construction can’t resume by this Friday because the order disrupts a tightly choreographed construction schedule dependent on vessels with very limited availability. Its hearing is Wednesday.\n\n“I would like to think that offshore wind is, and will continue to be, part of an all-of-the-above energy solution, which our country desperately needs,” said Molly Morris, Equinor’s senior vice president overseeing Empire Wind. \n\nDominion Energy Virginia, which is developing Coastal Virginia Offshore Wind, was the first to sue. It’s asking a judge to block the order, calling it “arbitrary and capricious” and unconstitutional. Its hearing is Friday.\n\nAssociated Press writer Matthew Daly contributed to this report.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","url":"https://apnews.com/article/trump-offshore-wind-energy-climate-lawsuits-23b39c946dfe8b83fcd03c6a9c0f1e92","image":"https://dims.apnews.com/dims4/default/db5deea/2147483647/strip/false/crop/9863x6608+0+0/resize/1486x996!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F57%2F15cdeb9a63743071dc1ad83a0df2%2F5126002f469443a7934e9ac9ef73acdc","video":null,"publish_date":"2026-01-12 18:44:20","author":"Jennifer McDermott","authors":["Jennifer McDermott"],"language":"en","category":"politics","source_country":"us","sentiment":-0.001},{"id":392477494,"title":"Meta Hires Former Trump Official, Senator’s Wife To Top Role","text":"Meta Platforms on Monday appointed former Trump adviser Dina Powell McCormick as president and vice chair of the technology conglomerate, which owns Facebook, Instagram and WhatsApp.\n\nPowell McCormick, who is married to Republican Pennsylvania Sen. Dave McCormick, served as President Donald Trump’s deputy national security adviser during his first term, and previously held several roles in the George W. Bush administration. Meta CEO Mark Zuckerberg said Monday that Powell McCormick is “uniquely suited” to oversee multi-billion dollar investments due to her extensive background on Wall Street and in the White House. (RELATED: Meta Ditches Diversity Programs After Trump Win, Supreme Court Cases)\n\n“Dina’s experience at the highest levels of global finance, combined with her deep relationships around the world, makes her uniquely suited to help Meta manage this next phase of growth as the company’s President and Vice Chairman,” Zuckerberg, currently the sixth-richest man in the world, said in a statement via the company’s Monday press release.\n\nTrump quickly congratulated Powell McCormick in a Monday post to Truth Social, saying Zuckerberg made a “great choice” in choosing her for the role.\n\n“She is a fantastic, and very talented, person, who served the Trump Administration with strength and distinction!” the president wrote.\n\nZuckerberg, whose platforms have until recently long censored conservative viewpoints, notably dined with Trump at his Mar-a-Lago residence in November 2024, shortly after the president won a second term. The tech billionaire was also a prominent attendee of Trump’s inauguration on Jan. 20, 2025, and has promised of bringing hundreds and billions of dollars of investment to the United States.\n\nPowell McCormick, an Egyptian immigrant, spent 16 years as partner at Goldman Sachs, and was a top executive at banking company BDT & MSD partners. Her expertise in finance figures to serve as an asset for Meta as they look to expand data centers and artificial intelligence (AI) infrastructure. The company says she will be a part of the company’s management team and will help guide its strategy and execution.\n\nPowell McCormick is now the second high-profile former member of the Trump administration that Meta has hired in 2026. Curtis Joseph Mahoney, who served as deputy U.S. trade representative in Trump’s first administration, was hired on as Meta’s new chief legal officer earlier in January.\n\nIn 2025, the tech giant appointed Trump ally Dana White, the Ultimate Fighting Championship (UFC) CEO, to its board, marking another hiring of a figure from the president’s orbit.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Experience at the highest levels of global finance'","url":"https://dailycaller.com/2026/01/12/meta-trump-official-dina-powell-mccormick/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-1176852827-scaled-e1768239837371.jpg","video":null,"publish_date":"2026-01-12 18:36:04","author":"Andi Shae Napier","authors":["Andi Shae Napier"],"language":"en","category":"politics","source_country":"us","sentiment":0.409},{"id":392473434,"title":"Is Trump the first president who has tried to acquire Greenland? - USA Today","text":"President Donald Trump has expressed interest in acquiring Greenland to keep it out of Russian and Chinese control.The first major U.S. attempt to acquire Greenland was in 1868, one year after America's acquisition of Alaska.In 1910, the U.S. proposed a three-way deal to acquire Greenland with Denmark and Germany, but the plan never materialized.\n\nPresident Donald Trump said he wants to acquire Greenland sooner rather than later, before Russia or China have the chance.\n\n\"We are going to do something on Greenland whether they like it or not,\" Trump said during a press availability on Jan. 9. \"I would like to make a deal the easy way, but if we don't do it the easy way, we're going to do it the hard way.\"\n\nThe president has long said he wants to acquire Greenland for U.S. national security, fearful of what would happen if China or Russia seized it first. Trump has raised the idea since his first presidential term.\n\nBut Trump's recent claims aren't the first time the United States has sought to acquire Greenland. The first major attempt was more than 150 years ago, around the same time Alaska was acquired from Russia in 1867.\n\nBreak out the textbooks. Here's a look at some of the major instances of the United States trying to control Greenland.\n\n1867: Like Alaska, Greenland showed promise of abundance\n\nIn 1867, then-U.S. Secretary of State William Seward led the acquisition of Alaska from Russia, purchasing the largely unexplored piece of land for $7.2 million, as recounted by the U.S. Office of the Historian. With an interest in northern expansion, Seward began looking at Greenland. And in 1867, he ordered a survey of the country, which resulted in a detailed report published the next year.\n\nThe report indicated Greenland had promise as a large island with abundant natural resources, from wildlife, whale blubber and coal, as outlined by the document available online.\n\nBut Seward's desire to acquire Greenland remained just that. The government official received widespread backlash for his acquisition of Alaska, as many didn't understand what the landscape offered, which didn't help in his case to purchase up Greenland. However, Seward's Alaskan purchase would prove fruitful in 1898, with the onset of the Klondike Gold Rush, when more than 100,000 prospectors flocked to the area.\n\n1910: Three-way deal with Denmark, Germany\n\nBy 1910, another plan to acquire Greenland was in the works, but the United States needed outside help.\n\nOn Sept. 20, 1910, U.S. Ambassador to Denmark Maurice Egan penned a letter to the U.S. State Department, outlining a plan to acquire Greenland with the aid of Denmark and Germany. In his letter, available on the U.S. Office of the Historian website, Egan proposed the following:\n\nDenmark surrenders Greenland to United States.The United States, in return, gives southern group of the Philippines, including Islands of Mindanao and Palauan, to Denmark.Denmark surrenders Philippine islands to Germany.Germany, in return, gives Denmark back a part of Schleswig-Holstein, which Germany acquired in 1864.\n\nIn his letter, Egan said he understood the plan to be \"audacious,\" or daring, which the U.S. State Department must have felt too, as the plan never materialized.\n\n1946: US offers $100 million in gold for Greenland\n\nAfter World War II, the United States tried once more to acquire Greenland, this time offering Denmark $100 million in gold for the world's largest island, as reported by History, previously History Channel. But Denmark rejected it.\n\nDuring the war, the United States used Greenland as a fuel stop for more than 10,000 Allied aircraft. When Germany invaded Denmark in 1940, America was concerned Germany would invade Greenland too, giving the Nazis access to Allied operations, according to History. Ultimately, Germany never invaded Greenland during the war, but because the island served as an important asset, the United States had a heightened interest.\n\nThough Denmark didn't accept the offer of $100 million in gold, Denmark did allow the United States to establish Thule Air Base (now Pituffik Space Base) in northeastern Greenland in 1951, according to travel resource Visit Greenland. At the peak of the Cold War the air base housed 10,000 American troops, as reported by History.\n\n1955: Joint Chiefs of Staff recommend acquisition to Eisenhower\n\nFollowing the construction of Thule Air Base, the United States continued to discuss a potential acquisition of Greenland. Several memos drafted by the then Joint Chiefs of Staff, the most senior officials of the U.S. Department of Defense, recommended that former President Dwight Eisenhower try again to purchase Greenland from Denmark.\n\nLargely, the Joint Chiefs of Staff noted Greenland would serve as a military advantage for the United States, reflecting on World War II, as written in memos by then-Secretary of Defense Charles E. Wilson and Joint Chiefs of Staff Chairman Arthur Radford.\n\nUltimately though, Eisenhower never made any official offers.\n\nContributing: Susan Page, Kinsey Crowley, Erin Mansfield and Bart Jansen, USA TODAY\n\nGreta Cross is a national trending reporter at USA TODAY. Story idea? Email her at gcross@usatoday.com.","summary":"Is Trump the first president who has tried to acquire Greenland?  USA Today","url":"https://www.usatoday.com/story/news/politics/2026/01/12/is-trump-first-president-attempt-acquire-greenland/88140846007/","image":"https://www.usatoday.com/gcdn/authoring/authoring-images/2026/01/12/USAT/88142618007-2203283126.jpg?crop=4031,2269,x0,y209&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2026-01-12 18:34:19","author":"Greta Cross","authors":["Greta Cross"],"language":"en","category":"politics","source_country":"us","sentiment":0.043},{"id":392478808,"title":"Trump goes after people who oppose him. Powell is the latest","text":"ATLANTA (AP) — Donald Trump promised in his second inaugural address to fairly apply the law, unlike how he said he’d been treated by federal authorities. \n\n“The vicious, violent and unfair weaponization of the Justice Department and our government will end,” he declared on Jan. 20, 2025. \n\nSince then, Trump’s administration has gone after multiple elected and appointed government officials who have either directly opposed the Republican president or not granted his wishes.\n\nThe most recent is Federal Reserve Chair Jerome Powell, who has defended the independence of the central bank against Trump’s pressure to cut interest rates more sharply. Trump told NBC News over the weekend that he knew nothing about a Justice Department inquiry into the fed’s ongoing construction project in Washington.\n\nBut influential White House chief of staff Susie Wiles has also affirmed that Trump sees his White House return as a sort of vengeance tour.\n\n“There may be an element of that from time to time,” she told Vanity Fair. “Who would blame him? Not me.”\n\nHere’s a look at how Trump’s government has pursued his opponents, real and perceived. \n\nPowell and the Federal Reserve are under investigation\n\nPowell said in an unusual video statement Sunday that the Justice Department has subpoenaed the central bank and threatened criminal indictments after his testimony to the Senate Banking Committee this summer. In that appearance, Powell pushed back at Trump’s criticism of the Fed’s $2.5 billion office renovation project in Washington — criticism that Trump had elevated as he also expressed frustration that Powell and his fellow governors were not lowering interest rates sharply enough for Trump’s taste. \n\nPowell, whom Trump appointed as chairman in 2017, asserted plainly that the Justice Department action is a “pretext” to weaken the Fed’s historic independence to set monetary policy without political influence from the president. The chairman had previously ignored Trump’s pressure and personal insults, other than to emphasize the central bank’s historical independent status.\n\nThe inquiry and Powell’s statement mark a significant escalation in Trump’s battle with the Federal Reserve and his ongoing straining of the U.S. system of checks and balances.\n\nFed member Lisa Cook’s personal finances targeted\n\nBefore the latest subpoena, Trump tried to fire another Federal Reserve board member, Lisa Cook, over allegations of mortgage fraud pushed by the president’s director of the Federal Housing Finance Agency, Bill Pulte. It was the first time in 112 years that a president had sought to remove a Fed governor. \n\nCook, a 2022 appointee of a Democratic president, Joe Biden, and the first Black woman to serve on the seven-member board, sued to keep her job. The Supreme Court ruled last fall that Cook could remain on the board as her case advances. The justices are expected to hear arguments in January. The court already has heard a separate case on Trump’s power to remove officials at independent agencies. \n\nJames Comey indicted — then the case gets tossed\n\nFormer FBI Director James Comey has survived, for now, a federal indictment that charged him with lying to Congress. \n\nComey, whom Trump fired during his first administration, was the first former senior government official to face prosecution after being involved in one of the president’s chief grievances, the long-concluded investigation into Russian electoral interference.\n\nThe September indictment came days after Trump appeared to encourage Attorney General Pam Bondi to punish Comey. “JUSTICE MUST BE SERVED, NOW!!!” he said in a social media post that named Bondi and referenced his own impeachments and prosecutions. \n\nA federal judge in Virginia dismissed the criminal case against Comey in November, finding that prosecutor Lindsey Halligan, who brought the charges at Trump’s urging, was illegally appointed by the Justice Department. That, of course, means that Comey has not been cleared on the charges, which could be leveled against him again. \n\nLetitia James, the New York attorney general, also spared\n\nNew York Attorney General Letitia James has long been a Trump target after she won a massive civil fraud case against him in 2024. The fine was later tossed out by a higher court, but both sides are appealing — and Trump’s Justice Department has gone after James since.\n\nShe was indicted on federal mortgage fraud charges two weeks after Comey’s indictment last year. Her case was thrown out by the same Virginia-based judge and for the same reason that spared Comey: The prosecutor who brought the charges was found to be illegally appointed.\n\nThe Trump administration has continued to go after James but was twice rebuked in December by grand juries that have declined to issue indictments after hearing evidence from federal prosecutors.\n\nEven more recently, another federal judge, this time in James’ home state, disqualified another prosecutor from overseeing investigations into James. The judge found that John Sarcone also was not lawfully serving as an acting U.S. attorney in the Northern District of New York.\n\nFormer CIA Director John Brennan was told he’s being investigated\n\nJohn Brennan’s lawyers say they’ve been informed the former CIA director is a target of a grand jury investigation in Florida.\n\nThat inquiry is related to the U.S. government assessment of Russian interference in the 2016 presidential election — the inquiry that fed Trump’s ire at Comey. \n\nBrennan’s lawyers said in a letter last month that they wanted the Justice Department to be prevented from steering an investigation of him and other former government officials to U.S. District Judge Aileen Cannon. She is the Florida jurist who was appointed by Trump and later dismissed a classified documents case against him. \n\nJack Smith, who led investigations of Trump, still getting probed\n\nAn ostensibly independent federal agency that investigates partisan political activity of federal employees opened an investigation last summer into Jack Smith, the former federal prosecutor who led multiple Trump investigations, including into the Jan. 6, 2021, Capitol insurrection by Trump supporters. \n\nThe Office of Special Counsel in Trump’s Justice Department confirmed in August that it was investigating Smith on allegations he engaged in political activity through his inquiries into Trump. Smith was named a special prosecutor in November 2022 by then-Attorney General Merrick Garland.\n\nIn congressional testimony in December, Smith did not back down, saying his team “developed proof beyond a reasonable doubt” that the president criminally conspired to overturn his 2020 election defeat to Biden.\n\n“I made my decisions in the investigation without regard to President Trump’s political association, activities, beliefs, or candidacy in the 2024 presidential election,” Smith said. “We took actions based on what the facts and the law required — the very lesson I learned early in my career as a prosecutor.”\n\nAdam Schiff’s mortgages draw scrutiny\n\nCalifornia Sen. Adam Schiff has long been among the loudest Trump critics on Capitol Hill, starting when he was a House member during the first Trump presidency. Now he is another official whose mortgages and personal finances are under scrutiny. The investigation into Schiff was being conducted by prosecutors in Maryland as of late last year.\n\nAnd now the investigation itself is the subject of an investigation. Federal authorities in November began inquiring about the roles of Ed Martin, a Justice Department official, and Pulte, the Federal Housing Finance Agency director whose name has surfaced in several of the high-profile mortgage fraud cases leveled by Trump’s administration.\n\nSchiff, who pushed impeachment in Trump’s first term, has consistently said the investigation against him is political retribution. \n\n___ Associated Press reporter Eric Tucker contributed from Washington.","url":"https://apnews.com/article/trump-powell-retribution-cases-d23648817184953bc73cf84cc5a8853c","image":"https://dims.apnews.com/dims4/default/dde6b04/2147483647/strip/false/crop/3936x2632+0+0/resize/1486x994!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fac%2Fcd65a13cb3b124efcdb35954e605%2F7852cb8d959c4a0caaf68021c2f45786","video":null,"publish_date":"2026-01-12 18:26:08","author":"Bill Barrow","authors":["Bill Barrow"],"language":"en","source_country":"us","sentiment":-0.143},{"id":392479562,"title":"Trump to meet with Venezuelan opposition leader Machado on Thursday","text":"United States President Donald Trump will meet with Venezuelan opposition leader Maria Corina Machado on Thursday, according to White House spokesperson Karoline Leavitt.\n\nThe Venezuelan opposition figure has played little role in debates about the country’s future since the US abducted Venezuelan President Nicolas Maduro earlier this month, with Trump expressing doubt that she has the support necessary to govern Venezuela. Machado said last week that she had not spoken to Trump since October.\n\nInstead, Maduro’s former vice president, Delcy Rodriguez, has assumed the role of interim president under the threat of further military attacks if her government does not submit to US demands on a range of issues.\n\nThe Venezuelan government said on Monday that it had freed dozens of political prisoners, some of whom were jailed during protests against Maduro following the disputed 2024 election.\n\n“I think it would be very tough for her to be the leader,” Trump said of Machado after Maduro’s abduction. “She doesn’t have the support or the respect within the country. She’s a very nice woman, but she doesn’t have the respect.”\n\nMachado, the winner of the Nobel Peace Prize in 2025 that Trump had sought for himself, met with Pope Leo XIV on Monday.\n\n“Today I had the blessing and honour of being able to share with His Holiness and express our gratitude for his continued support of what is happening in our country,” Machado said in a statement.\n\n“I also conveyed to him the strength of the Venezuelan people who remain steadfast and in prayer for the freedom of Venezuela, and I asked him to intercede for all Venezuelans who remain kidnapped and disappeared,” she added.\n\nPope Leo has said that Venezuela must remain an independent country following the US attack, stating that he is following developments there with “deep concern”.\n\n“The good of the beloved Venezuelan people must prevail over every other consideration,” said Leo. “This must lead to the overcoming of violence, and to the pursuit of paths of justice and peace.”\n\nMachado has sought to cultivate close ties with the Trump administration, dedicating her Nobel Prize to Trump and, more recently, stating that she would like to share the prize or give it to him outright.\n\n“I do want to say – on behalf of the Venezuelan people – how grateful we are for his [Trump’s] courageous vision, the historical actions he has taken against this narcoterrorist regime, to dismantle this structure and bring Maduro to justice,” Machado said last week in an interview with Sean Hannity on Fox News.\n\nThe Norwegian Nobel Institute said in a statement last week that the peace prize cannot be revoked, transferred, or shared, declaring that “the decision is final and stands for all time”.","summary":"The Venezuelan opposition figure has been largely frozen out of US discussions over the country&#039;s future.","url":"https://www.aljazeera.com/news/2026/1/12/trump-to-meet-with-venezuelan-opposition-leader-machado-on-thursday?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-10T132054Z_1820342659_RC2E6CA6DTGE_RTRMADP_3_NOBEL-PRIZE-PEACE-1760571527.jpg?resize=1920%2C1440","video":null,"publish_date":"2026-01-12 18:26:03","author":"Apps Support","authors":["Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.285},{"id":392474744,"title":"Who is Dina Powell McCormick? Trump’s former adviser takes top role at Meta","text":"Dina Powell McCormick is Meta’s newly appointed President and Vice Chair, a role that puts her at the centre of the company’s push into artificial intelligence and global infrastructure.She reports directly to chief executive Mark Zuckerberg and will help guide Meta’s strategy, especially its work with governments and large investors. Zuckerberg said she will focus on partnering with governments and sovereign funds to help build and finance Meta’s AI projects.McCormick has spent much of her career in both finance and government. She worked at Goldman Sachs for 16 years, rising to partner and later running the bank’s sovereign business, where she dealt closely with government-backed funds, particularly in the Middle East. She left Goldman in 2023 to join a private investment firm.Before Wall Street, she built strong ties in Washington. She was born in Egypt and worked in various US government roles for more than a decade, and later served as deputy national security adviser for strategy during Donald Trump’s presidency.Trump welcomed her appointment and posted online on Truth Social: “A great choice by Mark Z!!! She is a fantastic, and very talented, person, who served the Trump Administration with strength and distinction!”Her move comes as Meta spends most of its income on AI, data centres and energy supply. The company is building a $27 billion data centre in Louisiana and has signed deals linked to nuclear power to support its growing computing needs. Powell McCormick’s background is seen as useful as Meta works more closely with governments and regulators.She is also tied to US politics through her husband, David McCormick, a Republican who won a Pennsylvania Senate seat in 2024. He previously served as a senior Treasury official under President George W Bush.Powell McCormick joined Meta’s board last year and stepped down in December ahead of taking on her new executive role. Her appointment comes at a time when investors are uneasy about Meta’s rising spending on AI and slow returns, with the company’s share price under pressure.","summary":"","url":"https://timesofindia.indiatimes.com/world/us/who-is-dina-powell-mccormick-trumps-former-adviser-takes-top-role-at-meta/articleshow/126490392.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126490392/126490392.jpg","video":null,"publish_date":"2026-01-12 18:25:41","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":0.357},{"id":392478806,"title":"Democrat Seth Clark of Macon enters Georgia's lieutenant governor race","text":"ATLANTA (AP) — A second Democrat has entered the race for Georgia lieutenant governor.\n\nSeth Clark, who recently resigned from the Macon-Bibb County Commission, announced his candidacy Monday. He joins state Sen. Josh McLaurin of Atlanta as the only Democrats who have filed to run.\n\nMcLaurin and Clark will face off in the May 19 primary to succeed Republican Lt. Gov. Burt Jones, who is running for governor. Five Republicans are also running for the office, including state Sens. Steve Gooch of Dahlonega, Greg Dolezal of Cumming, Blake Tillery of Vidalia, former state Sen. John F. Kennedy of Macon and state Rep. David Clark of Sugar Hill.\n\nClark had served as Macon’s mayor pro tem and as executive director of the Ocmulgee National Park and Preserve Initiative, a group pushing to create a national park in middle Georgia and to protect natural lands along the Ocmulgee River. In an announcement video, Clark pledged to focus on affordability\n\n“I’m running because the cost of living shouldn’t break working folks, especially not in a state as rich in talent and heart and possibility as Georgia,” Clark said.\n\nHe said his record in Macon, including supporting tax cuts, strengthening public safety and renewing infrastructure shows what he can do for Georgia. Clark said he will also focus on public schools, affordable housing, child care, health care and higher education.\n\nSeveral state House Democrats endorsed Clark, including Rep. Stacey Evans of Atlanta and Rep. Tangie Herring of Macon.\n\nMcLaurin said he welcomed Clark to the race, but McLaurin characterized himself as “a proven fighter” who can cut through President Donald Trump’s “chaos to deliver real wins for working people.” McLaurin touts his endorsements from top Democrats in the state Senate including Minority Leader Harold Jones II of Augusta and Whip Kim Jackson of Stone Mountain.","url":"https://apnews.com/article/seth-clark-macon-georgia-democrat-lieutenant-governor-179e567b72aa1c57c0a1682ccbd1bf77","image":"https://dims.apnews.com/dims4/default/1e3f3a3/2147483647/strip/false/crop/4032x2688+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fe0%2F3962e95b8fcec700be58ceb2aa8c%2F0cf423aabc6f45179e65e37e746b7dff","video":null,"publish_date":"2026-01-12 18:25:34","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.075}]}