{"offset":0,"number":50,"available":12918,"news":[{"id":270162322,"title":"1257912 French Lawmakers Brace For More Turmoil As No Confidence Vote Looms","text":"PARIS: French lawmakers will vote on Wednesday (today) on no-confidence motions which are all but certain to oust the fragile coalition of Michel Barnier, deepening the political crisis in the euro zone’s second-largest economy.\n\nBarring a last-minute surprise, Barnier’s will be the first French government to be forced out by a no-confidence vote in more than 60 years, at a time when the country is struggling to tame a massive budget deficit.\n\nThe debate is due to start at 4 pm (1500 GMT), with voting expected about three hours later, parliament officials said. President Emmanuel Macron is set to return to France from a state visit to Saudi Arabia during the day.\n\nThe government’s collapse would leave a hole at the heart of Europe, with Germany also in election mode, weeks ahead of US President-elect Donald Trump re-entering the White House.\n\n“If the government is censured, that will throw France and the French into an insufferable situation,” said Interior Minister Bruno Retailleau, adding that those backing the no-confidence motion were playing Russian roulette with its future.\n\nBudget Minister Laurent Saint-Martin said bringing down the government and its budget plans would mean a larger deficit and more instability.\n\nThe risk premium investors demand to hold French government debt rather than German Bunds was close to its highest level in more than 12 years on Tuesday.\n\nAfter weeks of tension, the political crisis came to a head when Barnier, who has been prime minister for barely three months, said he would try to ram the social security part of the budget through parliament without a vote after failing to win support from Marine Le Pen’s far-right National Rally.\n\nBarnier’s entourage and Le Pen’s camp, who had been propping up the minority coalition, each blamed the other and said they had done all they could to reach a deal on the budget.\n\n“Censuring the budget is for us the only way the constitution gives us to protect the French,” Le Pen told reporters as she arrived in parliament.\n\nThe left and the far right combined have enough votes to topple Barnier, and Le Pen has confirmed that her party would vote for a left-wing alliance’s no-confidence bill. The RN’s own no-confidence motion would not be backed by enough lawmakers.\n\nBarnier, who is due to be interviewed on television news programmes at around 1920 GMT, earlier warned lawmakers that voting his government down “would make everything more difficult” for France.\n\nHis draft budget had sought to cut the fiscal deficit, which is projected to exceed 6 percent of national output this year, with 60 billion euros ($63 billion) in tax hikes and spending cuts. It sought to drag the deficit down to 5 percent next year, with ratings agencies keeping a close eye on progress.\n\nIf the no-confidence vote does go through, Macron could ask Barnier to stay on in a caretaker role as he seeks a new prime minister, which could well happen only next year.\n\nAs far as the budget is concerned, if parliament has not adopted it by Dec 20, the caretaker government could propose emergency legislation to roll over spending limits and tax provisions from this year. But that would mean that savings measures Barnier had planned would fall by the wayside.","url":"https://www.thenews.com.pk/print/1257912-french-lawmakers-brace-for-more-turmoil-as-no-confidence-vote-looms","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-04/l_1257912_040840_updates.jpg","video":null,"publish_date":"2024-12-04 00:17:32","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.294},{"id":270162306,"title":"1257916 Ukraine Pushes Nato For Invite As Trump Looms","text":"BRUSSELS, Belgium: Ukraine insisted on Tuesday that Nato membership was the only “real guarantee” for its security, but foreign ministers from the alliance sidestepped Kyiv´s push for an invite ahead of Donald Trump´s return to the US presidency.\n\nTrump has vowed to press for a quick deal to end Russia´s war, leaving Kyiv scrambling to position itself ahead of his January inauguration.\n\nUkraine´s President Volodymyr Zelensky has said getting security guarantees from the Western alliance and supplies of key weaponry are prerequisites for Kyiv to start talking about halting its fight.\n\n“We are convinced that the only real guarantee of security for Ukraine, as well as a deterrent to further Russian aggression against Ukraine and other states, is Ukraine´s full membership in Nato,” the foreign ministry in Kyiv said.\n\nUntil now, the leaders of Nato heavyweights the United States and Germany have backed away from Ukrainian membership out of fear it could drag the alliance into a war with Russia.\n\nDiplomats said that with the administration of US President Joe Biden on its way out and German Chancellor Olaf Scholz´s future in doubt ahead of elections, Kyiv hoped their foreign ministers could have more leeway.\n\nOn the US side, Secretary of State Antony Blinken gave no indication of a policy shift on his last planned visit to Nato -- with officials saying privately the Biden administration will not back Ukraine´s push as they believe any offer would be rescinded by the president-elect.","url":"https://www.thenews.com.pk/print/1257916-ukraine-pushes-nato-for-invite-as-trump-looms","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-04/l_1257916_041937_updates.jpg","video":null,"publish_date":"2024-12-04 00:17:32","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.114},{"id":270162302,"title":"1257914 Us Senate Approves Promotion Of General Involved In Afghanistan Withdrawal","text":"WASHINGTON: The US Senate on Tuesday confirmed the promotion of Army Lieutenant General Christopher Donahue, who had been a commander in Afghanistan during the US withdrawal, after it was briefly blocked by a Republican senator.\n\nSenator Markwayne Mullin had placed a hold on Donahue’s nomination to become a four-star general and the top commander of the US Army in Europe.\n\nPresident-elect Donald Trump and his allies have decried the 2021 US military withdrawal from Afghanistan and vowed to go after those responsible for it. During his successful campaign for re-election, Trump said in August he would ask for the resignation of every senior official “who touched the Afghanistan calamity.”","url":"https://www.thenews.com.pk/print/1257914-us-senate-approves-promotion-of-general-involved-in-afghanistan-withdrawal","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-04/l_1257914_041353_updates.jpg","video":null,"publish_date":"2024-12-04 00:17:32","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.538},{"id":270162288,"title":"1258000 Trump Seeks Dismissal Of Hush Money Case Citing Election Victory","text":"Donald Trump has asked a New York state judge to dismiss the criminal case in which he was convicted in May on 34 felony counts related to hush money paid to adult film actress Stormy Daniels, Reuters reported.\n\nIn a motion filed Tuesday, Trump’s lawyers argued that continuing the case after his election victory would disrupt his ability to govern, as the charges would hang over him when he takes office on January 20.\n\nTrump’s defense team, led by Todd Blanche and Emil Bove, urged Justice Juan Merchan to vacate the guilty verdict and dismiss the charges, calling the case an unwarranted disruption by Manhattan District Attorney Alvin Bragg. \n\nThey argued that local officials like Bragg have no valid reason to cause such a distraction during Trump's presidential term.\n\nThe motion was made public after Merchan delayed Trump’s sentencing, originally scheduled for November 26, to allow time for Trump’s legal team to argue for dismissal. \n\nProsecutors from Bragg’s office have agreed to the delay but indicated they would oppose the dismissal. The judge has not yet set a date for ruling or rescheduling sentencing.\n\nTrump’s lawyers also referenced President Joe Biden’s pardon of his son, Hunter Biden, in their motion, calling it an \"extraordinary condemnation\" of the Justice Department's actions. \n\nThey reiterated their claim that Bragg’s prosecution was politically motivated, alleging coordination with the Biden administration.\n\nThe case stems from a $130,000 payment made to Daniels in 2016 to silence her about an alleged affair with Trump, which he denies. \n\nTrump was found guilty of falsifying business records related to the payment, marking the first time a sitting or former US president has been convicted of a criminal offense.\n\nTrump faces additional legal challenges, including charges related to classified documents and his efforts to overturn the 2020 election results.","url":"https://www.thenews.com.pk/latest/1258000-trump-seeks-dismissal-of-hush-money-case-citing-election-victory","image":"https://www.thenews.com.pk/assets/uploads/updates/2024-12-04/l_1258000_044157_updates.jpg","video":null,"publish_date":"2024-12-04 00:17:32","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.369},{"id":270162280,"title":"1257920 Trump Offers Billionaire Feinberg Deputy Defence Secretary Job","text":"WASHINGTON: Donald Trump has offered the post of deputy secretary of defence to Stephen Feinberg, the billionaire co-founder and CEO of investment firm Cerberus Capital Management, which has stakes in companies that do business with the military, the Washington Post reports.\n\nIt is not clear if Feinberg accepted the job, the Post reports, and Trump has not yet publicly announced the nomination.\n\nCerberus this year disclosed an investment in M1 Support Services, which provides military aircraft training and maintenance services. In 2018, Cerberus took a majority stake in Navistar Defense, which manufactures military vehicles.","url":"https://www.thenews.com.pk/print/1257920-trump-offers-billionaire-feinberg-deputy-defence-secretary-job","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-04/l_1257920_043016_updates.jpg","video":null,"publish_date":"2024-12-04 00:17:32","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.145},{"id":270160584,"title":"Trumps Dea Nominee Withdraws From Consideration N2648584","text":"On Tuesday night, Hillsborough County Sheriff Chad Chronister announced over X that he was withdrawing from consideration. He had recently been selected as President-elect Donald Trump's pick to lead the Drug Enforcement Administration (DEA). \n\nChronister began by noting it was \"the honor of a lifetime,\" in a post that also tagged Trump over X. \"Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration. There is more work to be done for the citizens of Hillsborough County and a lot of initiatives I am committed to fulfilling. I sincerely appreciate the nomination, outpouring of support by the American people, and look forward to continuing my service as Sheriff of Hillsborough County,\" he continued.\n\nTo have been nominated by President-Elect @realDonaldTrump to serve as Administrator of the Drug Enforcement Administration is the honor of a lifetime. Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully… pic.twitter.com/bvNF8m9Bh4— Chad Chronister (@ChadChronister) December 3, 2024\n\nChronister had been selected for the role just days before, on November 30. His most recent post prior to his statement announcing that he was withdrawing his name, was about the honor of being chosen by Trump, and included a screenshot of Trump's own post.\n\nIt is the honor of a lifetime to be nominated by President @realDonaldTrump to serve as the Administrator of the Drug Enforcement Administration, and I am deeply humbled by this opportunity to serve our nation. pic.twitter.com/X5lslYyF1U— Chad Chronister (@ChadChronister) December 1, 2024\n\nChronister's pick faced backlash from some Republicans. As streff wrote for our sister site of RedState, \"Maybe President Trump Should Reconsider His Selection for Drug Enforcement Administration Chief.\" \n\nPlenty of concerning examples abounded, including:\n\nHis support for Pride MonthHis claims that Republicans are \"too far to the right,\" and how he considers himself to be \"the most Democratic of Republicans.\"Donations to Democratic politiciansSupport for DEISupport for Red Flag lawsHolding employees who were unvaccinated for COVID to different standardsArresting a pastor who held a service during a COVID lockdownStand down orders with BLM riotersBeing soft on immigration\n\nAs Newsweek also covered on Monday, there's been plenty of Republicans opposed to such a pick, including Rep. Thomas Massie (R-KY) who cited Chronister ordering the arrest of a pastor for defying COVID lockdowns. \n\nChronister is not the first one of Trump's picks to withdraw from consideration. Last month, former Rep. Matt Gaetz (R-FL), who had been Trump's first nominee to serve as Attorney General, withdrew his name from consideration. He was soon after replaced by Florida's former Attorney General Pam Bondi.","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/03/trumps-dea-nominee-withdraws-from-consideration-n2648584","image":"https://media.townhall.com/cdn/hodl/2024/337/1ddae7b5-9e30-4b1b-b37c-d50293efe5a5.jpg","video":null,"publish_date":"2024-12-04 00:06:32","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.05},{"id":270160248,"title":"Canada Again Supports Un Motion Critical Of Israel Citing Two State Solution 1","text":"MORE POLITICS NEWS \n\n Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead\n\n Freeland says it was 'right choice' for her not to attend Mar-a-Lago dinner with Trump\n\n Canada again supports UN motion critical of Israel, citing two-state solution\n\n NDP won't support Conservative non-confidence motion that quotes Singh\n\n Opposition leaders talk unity following Trudeau meeting about Trump, minister calls 51st state comment 'teasing'\n\n Mexico president says Canada has a 'very serious' fentanyl problem\n\n More RCMP and CBSA 'human resources' destined for border, Public Safety Minister LeBlanc says\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives\n\n NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power.\n\n 'Not the result we wanted': Trudeau responds after surprise Conservative byelection win in Liberal stronghold\n\n Conservative candidate Don Stewart winning the closely-watched Toronto-St. Paul's federal byelection, and delivering a stunning upset to Justin Trudeau's candidate Leslie Church in the long-time Liberal riding, has sent political shockwaves through both parties.\n\n 'We will go with the majority': Liberals slammed by opposition over proposal to delay next election\n\n The federal Liberal government learned Friday it might have to retreat on a proposal within its electoral reform legislation to delay the next vote by one week, after all opposition parties came out to say they can't support it.\n\n Budget 2024 prioritizes housing while taxing highest earners, deficit projected at $39.8B\n\n In an effort to level the playing field for young people, in the 2024 federal budget, the government is targeting Canada's highest earners with new taxes in order to help offset billions in new spending to enhance the country's housing supply and social supports.\n\n 'One of the greatest': Former prime minister Brian Mulroney commemorated at state funeral\n\n Prominent Canadians, political leaders, and family members remembered former prime minister and Progressive Conservative titan Brian Mulroney as an ambitious and compassionate nation-builder at his state funeral on Saturday.\n\n opinion | \n\n Don Martin: Gusher of Liberal spending won't put out the fire in this dumpster\n\n A Hail Mary rehash of the greatest hits from the Trudeau government’s three-week travelling pony-show, the 2024 federal budget takes aim at reversing the party’s popularity plunge in the under-40 set, writes political columnist Don Martin. But will it work before the next election?\n\n opinion | \n\n Don Martin: The doctor Trudeau dumped has a prescription for better health care\n\n Political columnist Don Martin sat down with former federal health minister Jane Philpott, who's on a crusade to help fix Canada's broken health care system, and who declined to take any shots at the prime minister who dumped her from caucus.\n\n opinion | \n\n Don Martin: Trudeau's seeking shelter from the housing storm he helped create\n\n While Justin Trudeau's recent housing announcements are generally drawing praise from experts, political columnist Don Martin argues there shouldn’t be any standing ovations for a prime minister who helped caused the problem in the first place.\n\n opinion | \n\n Don Martin: Poilievre has the field to himself as he races across the country to big crowds\n\n It came to pass on Thursday evening that the confidentially predictable failure of the Official Opposition non-confidence motion went down with 204 Liberal, BQ and NDP nays to 116 Conservative yeas. But forcing Canada into a federal election campaign was never the point.\n\n opinion | \n\n Don Martin: How a beer break may have doomed the carbon tax hike\n\n When the Liberal government chopped a planned beer excise tax hike to two per cent from 4.5 per cent and froze future increases until after the next election, says political columnist Don Martin, it almost guaranteed a similar carbon tax move in the offing.\n\n CTVNews.ca Top Stories\n\n Mexico president says Canada has a 'very serious' fentanyl problem\n\n Foreign Affairs Minister Mélanie Joly is not escalating a war of words with Mexico, after the Mexican president criticized Canada's culture and its framing of border issues.\n\n Freeland says it was 'right choice' for her not to attend Mar-a-Lago dinner with Trump\n\n Deputy Prime Minister and Finance Minister Chrystia Freeland says it was 'the right choice' for her not to attend the surprise dinner with Prime Minister Justin Trudeau at Mar-a-Lago with U.S. president-elect Donald Trump on Friday night.\n\n Quebec doctors who refuse to stay in public system for 5 years face $200K fine per day\n\n Quebec's health minister has tabled a bill that would force new doctors trained in the province to spend the first five years of their careers working in Quebec's public health network.\n\n NDP won't support Conservative non-confidence motion that quotes Singh\n\n NDP Leader Jagmeet Singh says he won't play Conservative Leader Pierre Poilievre's games by voting to bring down the government on an upcoming non-confidence motion.\n\n Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead\n\n After rallying his party's caucus and staffers on Parliament Hill Tuesday, NDP Leader Jagmeet Singh signalled that he's still not ready to help the other opposition parties trigger an early election, yet.\n\n Opposition leaders talk unity following Trudeau meeting about Trump, minister calls 51st state comment 'teasing'\n\n The prime minister’s emergency meeting with opposition leaders on Tuesday appears to have bolstered a more united front against U.S. president-elect Donald Trump’s tariff threats.\n\n Calgary man who drove U-Haul over wife sentenced to 15 years\n\n A Calgary man who killed his wife in 2020 when he drove over her in a loaded U-Haul has been sentenced to 15 years behind bars.\n\n Man severely injured saving his wife from a polar bear attack in the Far North\n\n A man was severely injured Tuesday morning when he leaped onto a polar bear to protect his wife from being mauled in the Far North community of Fort Severn.\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Immigration Minister Marc Miller says that the recent pause in most private refugee sponsorships is because there is an 'oversupply' of applications and they don't want to give people fleeing war zones false hope.\n\n Canadians warned to use caution in South Korea after martial law declared then lifted\n\n Global Affairs Canada is warning Canadians in South Korea to avoid demonstrations and exercise caution after the country's president imposed an hours-long period of martial law.\n\n As propane tanks exploded, homeless Sudbury, Ont., man pulls woman from burning tent\n\n TJ Bedggood is humble about his life-saving actions Sunday evening, when he pulled his friend from a burning tent fire as propane tanks exploded in an encampment in Sudbury.\n\n Calgary man who drove U-Haul over wife sentenced to 15 years\n\n A Calgary man who killed his wife in 2020 when he drove over her in a loaded U-Haul has been sentenced to 15 years behind bars.\n\n Man severely injured saving his wife from a polar bear attack in the Far North\n\n A man was severely injured Tuesday morning when he leaped onto a polar bear to protect his wife from being mauled in the Far North community of Fort Severn.\n\n Video shows 'completely unprovoked' stranger attack in Vancouver, police say\n\n Police in Vancouver are searching for witnesses after a seemingly random and unprovoked assault was captured on video in the city's downtown core.\n\n Family feels abandoned by Canada as woman struggles to flee civil war in Syria\n\n It is the first time control of the city has shifted since 2016, when government forces, backed by Russia and Iran, defeated the rebels who controlled Aleppo's eastern districts.\n\n South Korea lifts president's martial law decree after lawmakers vote against it\n\n South Korean President Yoon Suk Yeol's government early Wednesday lifted the martial law he imposed during a tense night of political drama in which troops surrounded parliament and lawmakers voted to reject military rule.\n\n FBI arrests man allegedly helping prepare 'surprise attack' on South Korea\n\n A California man confessed to helping the North Korean regime prepare for an attack in a 'sophisticated scheme' to illegally obtain restricted weapons and military grade technology, federal prosecutors announced Tuesday.\n\n U.S. president-elect Donald Trump’s lawyers urge judge to toss his hush money conviction\n\n U.S. president-elect Donald Trump’s lawyers formally asked a judge Monday to throw out his hush money criminal conviction, arguing continuing the case would present unconstitutional 'disruptions to the institution of the Presidency.'\n\n Hunter Biden gun case dismissed after President Joe Biden's sweeping pardon\n\n A federal judge dismissed the gun case against Hunter Biden on Tuesday after President Joe Biden issued a sweeping pardon for his son.\n\n Ex-ballerina sentenced to 20 years in Florida for manslaughter in husband's killing\n\n A former Florida ballerina has been sentenced to 20 years in prison following her manslaughter conviction for fatally shooting her estranged husband in 2020.\n\n Italy bans Airbnb self-check-ins\n\n The days of arriving late at an Airbnb in Italy and opening up the key box to let yourself will soon be over after the country issued a ban on self-check-ins under a new law it says is needed to combat potential terrorism.\n\n Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead\n\n After rallying his party's caucus and staffers on Parliament Hill Tuesday, NDP Leader Jagmeet Singh signalled that he's still not ready to help the other opposition parties trigger an early election, yet.\n\n Freeland says it was 'right choice' for her not to attend Mar-a-Lago dinner with Trump\n\n Deputy Prime Minister and Finance Minister Chrystia Freeland says it was 'the right choice' for her not to attend the surprise dinner with Prime Minister Justin Trudeau at Mar-a-Lago with U.S. president-elect Donald Trump on Friday night.\n\n Canada again supports UN motion critical of Israel, citing two-state solution\n\n Canada has again breached its years-long policy and voted in support of a United Nations motion critical of Israel, based on concerns about the viability of a two-state solution.\n\n A California art teacher died from rabies after an encounter with a bat in her classroom\n\n A California art teacher died from rabies November 22, about a month after apparently being infected by a bat she found in her classroom.\n\n Quebec doctors who refuse to stay in public system for 5 years face $200K fine per day\n\n Quebec's health minister has tabled a bill that would force new doctors trained in the province to spend the first five years of their careers working in Quebec's public health network.\n\n Walking pneumonia cases in Ontario have nearly tripled since 2019: report\n\n The number of walking pneumonia cases seen in Ontario this year is triple the amount of what was reported in 2019, before the COVID-19 pandemic.\n\n Meta says generative AI had muted impact on global elections this year\n\n Despite widespread concern that generative AI could interfere with major elections around the globe this year, the technology had limited impact across Meta Platforms' META.O apps, the tech company said on Tuesday.\n\n The most popular Wikipedia pages of 2024\n\n Searching for something? From queries about U.S. politics to cricket in India, Wikipedia has become a source of information for millions of people across the globe.\n\n Warning signs posted after 'aggressive' 12-foot shark spotted in Hawaii\n\n Warning signs have been posted at Makaha Beach after a shark was spotted swimming 100 yards away on Saturday, November 30, 2024.\n\n Entertainment \n\n Eminem's mother Debbie Nelson, whose rocky relationship fuelled the rapper's lyrics, dies at age 69\n\n Debbie Nelson, the mother of rapper Eminem whose rocky relationship with her son was known widely through his hit song lyrics, has died. She was 69.\n\n Billboard names Beyonce the greatest pop star of the 21st century\n\n Beyoncé has been named the greatest pop star of the 21st century by Billboard, the music charting site announced on Tuesday as part of an ongoing series.\n\n Kendrick Lamar to perform in Toronto for the first time since Drake feud\n\n Kendrick Lamar is coming back to Toronto for his first stadium tour – and he's bringing SZA along with him.\n\n Bank fees eating away at your savings? How to avoid the most common ones\n\n You probably know when your paycheque gets deposited and roughly how much your monthly cellphone bill costs, but it might be harder to answer a fundamental question about your bank account: how much are you paying in fees?\n\n Canada Post strike: Kids no longer need to mail their letters to Santa by the end of the week\n\n Canada Post says it has removed the deadline for its Santa Claus letter program amid an ongoing national workers' strike that has halted mail delivery leading up to the holiday season.\n\n Scotiabank reports $1.69B Q4 profit, up from $1.35B a year ago\n\n Scotiabank reported a fourth-quarter profit of $1.69 billion, up from $1.35 billion in the same period last year, as it set aside a smaller amount for bad loans compared with a year ago.\n\n Lifestyle \n\n N.S. teacher, students help families in need at Christmas for more than 25 years\n\n For more than a quarter-century, Lisa Roach's middle school students have been playing the role of Santa Claus to strangers during the holidays.\n\n The most popular Wikipedia pages of 2024\n\n Searching for something? From queries about U.S. politics to cricket in India, Wikipedia has become a source of information for millions of people across the globe.\n\n Here's what the Pizza Hut of the future looks like\n\n Pizza Hut unveiled a new design concept that features a pizza-making station at the centre of the restaurant, allowing customers to see employees make their orders.\n\n B.C. Lions name former quarterback Buck Pierce as head coach\n\n The B.C. Lions have named Buck Pierce as their new head coach.\n\n Brad Lambert making season debut with Jets as they battle the Blues\n\n It might be a quick one-game stop at home, but the Winnipeg Jets are back at Canada Life Centre after wrapping up a six-game road trip.\n\n Alphonso Davies handed one-month driving ban after being pulled over in Munich\n\n Canada captain Alphonso Davies has been handed a one-month driving ban after being pulled over by police in Munich last week.\n\n Jaguar reveals first concept car after controversial rebrand\n\n British luxury automaker Jaguar has revealed its Type 00 concept car, the first glimpse of a new electric vehicle following a controversial rebrand that has divided opinion.\n\n The best tips to prepare your car for the winter\n\n Slippery or snow-covered roads, reduced visibility and bitter cold are all conditions that can make driving difficult and even dangerous during cold weather months. CAA spoke with CTV Morning Live this week on some of the best ways you can winterize your car.\n\n Stellantis CEO resigns as carmaker sales continue to slump\n\n Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep, Citroën and Ram, amid an ongoing struggle with slumping sales.\n\n Local Spotlight \n\n N.S. teacher, students help families in need at Christmas for more than 25 years\n\n For more than a quarter-century, Lisa Roach's middle school students have been playing the role of Santa Claus to strangers during the holidays.\n\n N.S. girl battling rare disease surprised with Taylor Swift-themed salon day\n\n A Nova Scotia girl battling a rare disease recently had her “Wildest Dreams” fulfilled when she was pampered with a Swiftie salon day.\n\n Winnipeg city councillor a seven-time provincial arm wrestling champ\n\n A Winnipeg city councillor doesn’t just have a strong grip on municipal politics.\n\n Watch: Noisy throng of sea lions frolic near Jericho Beach\n\n A large swarm of California sea lions have converged in the waters near Vancouver’s Jericho and Locarno beaches.\n\n Auburn Bay residents brave the cold to hold Parade of Lights\n\n It was pretty cold Saturday night, but the hearts of those in a southeast Calgary neighbourhood warmed right up during a big annual celebration.\n\n Three million grams of cereal collected to feed students in annual Cereal Box Challenge\n\n The food collected will help support 33 breakfast and snack programs in the Greater Essex County District School Board.\n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n Temperature records broken, tied following latest snowfall in Saskatchewan\n\n Saskatchewan received yet more snow as winter continues to ramp up on the prairies. With the increased precipitation, communities have recorded dipping temperatures – with a handful breaking or tying longstanding records.\n\n 'My dear Carmel': Lost letters returned to 103-year-old Guelph, Ont. woman\n\n A young history buff was able to reunite a Guelph, Ont. woman with letters written by her husband almost 80 years ago.\n\n Vancouver \n\n Bad blood? Taylor Swift ticket dispute settled by B.C. tribunal\n\n A B.C. woman and her daughter will be attending one of Taylor Swift's Eras Tour shows in Vancouver – but only after a tribunal intervened and settled a dispute among friends over tickets.\n\n Vancouver Canucks defenceman Hronek out 8 weeks with lower-body injury\n\n Vancouver Canucks defenceman Filip Hronek is expected to be out until the end of January as he recovers from a lower-body injury.\n\n BC SPCA to rescue up to 30 stray cats from one Kamloops home\n\n The BC SPCA is warning of the consequences of feeding stray cats after a person accidentally lured over 25 felines to their home in Kamloops, B.C. \n\n Richmond Hill jewelry store smash-and-grab caught on video, 5 suspects outstanding\n\n Video footage has surfaced on social media of a violent daytime robbery earlier this week at a jewelry store in a Richmond Hill shopping centre.\n\n Walking pneumonia cases in Ontario have nearly tripled since 2019: report\n\n The number of walking pneumonia cases seen in Ontario this year is triple the amount of what was reported in 2019, before the COVID-19 pandemic.\n\n Process around Ontario Place redevelopment was 'unfair' and didn't follow rules: AG\n\n Ontario's auditor general is slamming the Ford government for failing to follow proper process around the redevelopment of Ontario Place, including a revelation that senior staff communicated directly with Therme Canada and other applicants while proposals were still being accepted.\n\n Loved ones seek answers as Pine Creek death deemed a homicide\n\n Calgary police say the death of a man in the community of Pine Creek last month is being investigated as a homicide.\n\n Person found dead in Taradale home with high CO levels: CFD\n\n A person was found dead in a Taradale home where emergency crews discovered high levels of carbon monoxide.\n\n Calgary man who drove U-Haul over wife sentenced to 15 years\n\n A Calgary man who killed his wife in 2020 when he drove over her in a loaded U-Haul has been sentenced to 15 years behind bars.\n\n TRAVEL ADVISORY \n\n TRAVEL ADVISORY | \n\n Winter weather travel advisory in effect as Ottawa expects first notable snowfall\n\n The first winter weather travel advisory of the season is in effect for Ottawa as the city's first dump of snow expected this week.\n\n 1 teen, 4 adults injured in crash involving school bus and vehicle in south Ottawa\n\n Ottawa paramedics say five people were injured following a collision between a school bus and a van in south Ottawa.\n\n 'Adapting is huge': Skiers, snowboarders prepare for first significant snowfall\n\n Winter sports enthusiasts are looking forward to the coming snowfall in eastern Ontario, as are ski resorts, which have had a slow start to the season.\n\n Despite devastating poll, Quebec Premier Legault confident he’s here to stay\n\n Despite a devastating poll, Premier François Legault is confident that he will lead the CAQ troops into the next electoral battle in two years' time.\n\n Quebec doctors who refuse to stay in public system for 5 years face $200K fine per day\n\n Quebec's health minister has tabled a bill that would force new doctors trained in the province to spend the first five years of their careers working in Quebec's public health network.\n\n Quebec man get prison sentence after trying to smuggle fake permanent residence cards, licences\n\n A Quebec man has been sentenced to prison after attempting to smuggle more than 1,000 forged documents into the country, including Canadian permanent resident cards and driver's licences.\n\n Ex-Alberta teacher convicted of sex crime involving child for 2nd time\n\n Former Alberta teacher Brian Davison has been found guilty of one count of sexual exploitation in connection with an incident involving a child.\n\n Giving Tuesday: As the Canada Post strike and inflation affect charities, here's how Edmontonians can help\n\n Across the country, charities are getting ready for the holidays, which is often a busy time for many of them, and are relying on the generosity of Canadians to help get them.\n\n Beaumont teen with 'big heart' starts birthday tradition to help others\n\n On Saturday, Grace Gibson and Bailey Paxman filled a car with warm blankets, coats, thick socks and snacks and headed to Edmonton.\n\n Snow, rain, and wind expected for Maritimes this week with early December storm\n\n A developing low pressure skirting colder air in place across eastern parts of the country will bring snow, rain, and wind to the Maritimes on Thursday.\n\n Cape Breton investigating last year of municipal credit card transactions\n\n The Cape Breton Regional Municipality (CBRM) is investigating more than a year of transactions on a legislative credit card due to a lack of documents.\n\n N.B. woman dies after hit and run in Notre-Dame: RCMP\n\n A 40-year-old New Brunswick woman has died after she was struck by a vehicle in Notre-Dame, N.B.\n\n Manitoba government promises trade office in U.S. capital to boost economy\n\n The Manitoba government is planning to open a trade office in Washington, D.C., in the new year to deal with threatened United States tariffs and promote investment opportunities in provincial sectors such as mining and aerospace.\n\n Every Winnipeg driver pulled over during checkstop program must give breath sample: police\n\n Every driver pulled over in Winnipeg as part of the police’s annual festive season checkstop program will have to provide a breath sample.\n\n Pembina Trails School Division dealing with 'cyber security incident', classes continuing\n\n People within the Pembina Trails School Division are being told to watch for any unusual activity as the division is currently dealing with a “cyber security incident.”\n\n Regulations around foreign ownership of Sask. farmland need better enforcement, auditor finds\n\n The Provincial Auditor of Saskatchewan is recommending that the province improve its system of monitoring sales of farmland to foreign entities.\n\n Formal expectations needed for answering 911 calls: Sask. auditor reports\n\n The Provincial Auditor assessed the Saskatchewan Public Safety Agency’s (SPSA) 911 call taking and dispatching processes for fire emergencies, focusing on the Provincial Emergency Communications Centre.\n\n Attempted murder charge laid after home invasion, series of hit and runs in Regina\n\n Two people in Regina are facing a list of charges following a series of alleged acts that include a home invasion, multiple collisions and attempted murder.\n\n Kitchener \n\n Why Wilmot is proposing a $580 tax increase in its 2025 draft budget\n\n The Township of Wilmot has released its 2025 draft budget which included a one-time capital infrastructure investment.\n\n Teddy Bear Toss happening tonight at the Aud\n\n Calling all Kitchener Rangers fans! The Teddy Bear Toss returns for tonight's game against the Brantford Bulldogs.\n\n Guelph Police looking for missing pregnant woman\n\n Guelph Police are asking for help as they search for a missing pregnant woman.\n\n Saskatoon \n\n Major power outage hits much of Saskatoon's west side\n\n A large power outage lasting several hours affected much of Saskatoon's west side and portions of the east side of the city Tuesday afternoon.\n\n 'That's way, way inappropriate': Saskatoon city councillor raises issue with democratic process, clerk apologizes\n\n Before Saskatoon city council unanimously approved the budget, a fiery discussion about the democratic process dominated chambers.\n\n Man dies at Saskatoon Correctional Centre\n\n A 62-year-old man was declared dead at the Saskatoon Correctional Centre on Dec. 2.\n\n Northern Ontario \n\n Man severely injured saving his wife from a polar bear attack in the Far North\n\n A man was severely injured Tuesday morning when he leaped onto a polar bear to protect his wife from being mauled in the Far North community of Fort Severn.\n\n As propane tanks exploded, homeless Sudbury, Ont., man pulls woman from burning tent\n\n TJ Bedggood is humble about his life-saving actions Sunday evening, when he pulled his friend from a burning tent fire as propane tanks exploded in an encampment in Sudbury.\n\n Five years after toddler's brutal death, Northern Ont. family struggles to find peace, justice\n\n A North Bay family is struggling to find peace and justice as the five-year anniversary of the brutal death of toddler Oliver McCarthy approaches.\n\n Witness sees accused with gun at bush bash shooting scene\n\n A witness for the bush party shooting trial says he saw the accused with a firearm that night.\n\n 'A real gamut': LHSC highlights number of serious seasonal injuries ahead of the holiday season\n\n As we head into the heart of the holiday season, experts at London Health Sciences Centre (LHSC) are cautioning the public in order to help prevent serious injuries.\n\n Tire shops 'spinning' with winter tire changeover demand\n\n London tire and automotive shops remain caught off guard by the sudden arrival of winter.\n\n Woman dies in two-vehicle crash on Highway 118 in Haliburton\n\n An 87-year-old woman has died following a collision on Highway 118 in Haliburton County on Monday afternoon.\n\n Snow-clearing efforts stalled due to tractor-trailers stuck on many roads along Highway 11\n\n Snow-clearing efforts continue on secondary roads that remain closed along Highway 11 on Tuesday.\n\n Crown pushes for 6-year sentence for supervisor convicted in fatal crash case\n\n Victim impact statements were read in a Barrie courtroom on Tuesday ahead of sentencing for a man convicted of criminal negligence causing the death of a dump truck driver four years ago.\n\n Windsor, mayor name-dropped for housing criticism\n\n The City of Windsor and its mayor have been picked out as egregious examples of municipal housing missteps by a prominent expert in the field and author of a recent report identifying poor building performance in Ontario.\n\n Survey raises concerns about cannabis-impaired driving in Ontario\n\n A recent survey conducted by CAA South Central Ontario (CAA SCO) highlights an increase in cannabis use among Ontario drivers, sparking some concern about impaired driving.\n\n Could a co-pay model save the IB and RISE programs?\n\n Windsor-Essex parents are proposing a co-pay model to keep the International Baccalaureate (IB) program running in the Greater Essex County District School Board (GECDSB), but the board’s chair says it’s not feasible.\n\n Vancouver Island \n\n Bad blood? Taylor Swift ticket dispute settled by B.C. tribunal\n\n A B.C. woman and her daughter will be attending one of Taylor Swift's Eras Tour shows in Vancouver – but only after a tribunal intervened and settled a dispute among friends over tickets.\n\n Comox Valley RCMP seek suspect who tried to climb woman's deck wearing a gas mask\n\n Mounties on Vancouver Island are seeking witnesses after a woman reported that a man wearing a gas mask tried to climb onto the deck of her home near Courtenay, B.C.\n\n Canadian military drones enter production, though Arctic modifications will be required\n\n Canada's first combat drones have now entered production, though the remotely piloted aircraft will require years of testing and significant modifications before the first units are delivered in 2028.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Kelowna, B.C., to host the Memorial Cup in the spring of 2026\n\n The Western Hockey League's Kelowna Rockets will host the Memorial Cup in the spring of 2026, the Canadian Hockey League said Wednesday.\n\n 545 vehicles impounded in 332 days: BC Highway Patrol pleads for drivers to slow down\n\n Mounties with the BC Highway Patrol in Kelowna say they've impounded more than 545 vehicles for excessive speed and aggressive driving so far this year. That works out to more than 1.6 per day.\n\n Lethbridge \n\n Lethbridge charities worry Canada Post strike is impacting donations\n\n The Canada Post strike has come at a difficult time of year for most Canadians, but for Lethbridge charities it's the worst-case scenario.\n\n Residents debate Grassy Mountain coal mining project applications at public hearing\n\n Residents in favour and against coal mining in the Eastern Slopes had the chance to have their voices heard as a public hearing for three applications by Northback got underway in Pincher Creek Tuesday.\n\n Hurricanes add Yager, Unger in blockbuster deal with Warriors\n\n The Lethbridge Hurricanes received forward Brayden Yager and goalie Jackson Unger from the Moose Jaw Warriors in an 11-asset blockbuster trade on Monday.\n\n Sault Ste. Marie \n\n Shooting on Manitoulin Island leads to attempted murder charges\n\n Two people have been charged – one with attempted murder – following a shooting in Wikwemikong last week.\n\n Insults on social media lead to real-life assault in northern Ont.\n\n A Mississauga First Nation woman has been charged with assault after she took offence to comments about her on social media.\n\n Snow squall warning in the Sault, heaviest snowfall expected tonight\n\n Sault Ste. Marie's run of severe winter weather will continue Tuesday, with Environment Canada issuing another snow squall warning.\n\n GivingTuesday: Food banks need help, but charity won't end hunger, advocates say\n\n It's GivingTuesday, and some directors of food banks and anti-poverty groups say the day underlines a conundrum for their organizations.\n\n N.L. man not guilty of sex charges, judge cites inadequate police investigation\n\n A Newfoundland and Labrador judge has acquitted a man of six crimes, including sexual assault and sexual interference, citing inadequacies in the investigation by the Royal Newfoundland Constabulary.\n\n Newfoundland's LGBTQ2S+ bar paid drag queens $37.50. Tara Nova called them out.\n\n If the screaming crowd in the twinkling Majestic Theatre in downtown St. John's was any indication, Newfoundland drag queen Tara Nova will never have to accept $37.50 for a show again.\n\n Stay Connected","url":"https://www.ctvnews.ca/politics/canada-again-supports-un-motion-critical-of-israel-citing-two-state-solution-1.7132494","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/3/bob-rae--canada-un-ambassador-1-7132507-1733267021762.jpg","video":null,"publish_date":"2024-12-04 00:04:31","author":"Dylan Robertson","authors":["Dylan Robertson"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.008},{"id":270160950,"title":"Perianne Boring among contenders to lead agency involved with crypto in Trump admin","text":"President-elect Donald Trump is in the process of appointing nominees to key roles throughout his administration and his transition team is considering several candidates to lead the agency that could play a key role in regulating cryptocurrencies and the digital assets industry. During the presidential campaign, Trump pledged to make the U.S. the \"crypto capital of the planet\" and a \"bitcoin superpower.\" His administration is expected to take a different regulatory approach to the emerging industry than the Biden administration, which has been criticized as hamstringing the crypto sector — particularly through actions taken by the Securities and Exchange Commission (SEC). President-elect Trump is expected to release his nomination for the Commodity Futures Trading Commission (CFTC) chair in the near future, an agency that could be poised to play a more prominent regulatory role in the incoming administration as Trump&apos;s team looks to reform cryptocurrency regulations. The agency has five commissioners with the president&apos;s party traditionally appointing a new commissioner to attain a majority when the White House flips from one party to another. Sources familiar with the selection process told FOX Business that one of the leading contenders for the role is Perianne Boring, who is the founder and CEO of The Digital Chamber, the world&apos;s largest trade association representing the blockchain industry. TRUMP ADMIN EYES CFTC TO LEAD DIGITAL ASSET REGULATION Boring&apos;s work with emerging technologies like crypto and blockchain would help boost her candidacy for the role, one source said. She also began her career working as a legislative analyst in the U.S. House of Representatives on finance, economics, tax and health care policy — so her familiarity with Congress could prove an asset in crafting legislation to guide the CFTC&apos;s regulatory mission. She also previously worked as a TV anchor hosting a show discussing international financial topics, and her ability to be conversant and telegenic in presenting financial topics to the public is an attribute the Trump transition team values, one source noted. CRYPTO INVESTOR CASHES IN ON &apos;TRUMP BUMP,&apos; POSES ONE BIG POLICY CHANGE Another top contender for the post is Summer Mersinger, who currently serves as a CFTC commissioner. Mersinger was nominated to the role by President Biden and was confirmed to the role on a voice vote by the Senate. She previously worked in the office of Sen. John Thune, R-S.D., who is set to become the Senate majority leader when the new Congress is seated in January. As a sitting commissioner, Mersinger would have the advantage of being able to start the process of staffing the agency and taking other actions to lay the groundwork for the Trump administration&apos;s vision for the regulatory agency by becoming an acting chair of the CFTC in advance of her confirmation. TRUMP&apos;S FORMER CFTC CHAIR EYED FOR &apos;CRYPTO CZAR&apos; ROLE Caroline Pham is another currently serving CFTC commissioner who could be chosen to lead the agency in the Trump administration with the benefit of being able to serve as acting chair pending Senate confirmation. Pham was unanimously confirmed by the Senate to the role in 2022 and has deep experience in working on financial regulation issues, having worked as an advisor to regulators, industry leaders and policymakers on such topics for more than two decades. Both Mersinger and Pham are well versed in cryptocurrency-related issues. Mersinger has defended crypto firms facing enforcement actions and has called for the CFTC to develop rules of the road for the industry, while Pham has called for the agency to have a program that supports the development of digital asset companies. Jill Sommers is another contender for the role of leading the CFTC after she served as a commissioner from 2007 to 2013. She has also served as the managing director for regulatory affairs at the Chicago Mercantile Exchange as well as the head of government affairs for the International Swaps and Derivatives Association. However, one source noted that it wasn&apos;t clear whether she would be interested in departing her current position as the chief of the derivatives practice group at Patomak Global Partners. GET FOX BUSINESS ON THE GO BY CLICKING HERE Neal Kumar is also believed to be in the running for the CFTC chair, having previously served as a special counsel in the CFTC&apos;s general counsel&apos;s office. In that role, Kumar provided advice on the development of new rules under the Dodd-Frank Act as well as enforcement matters. Kumar is currently the co-head of the commodities and derivatives practice at Willkie Farr & Gallagher LLP, where he has worked on a variety of regulatory, enforcement, legislative and transactional topics — including those related to digital assets. Reuters contributed to this report.","summary":"President-elect Trump is weighing candidates to lead the CFTC in his administration, with the agency set to play a key role in regulating cryptocurrencies and digital assets.","url":"https://www.foxbusiness.com/politics/perianne-boring-among-contenders-lead-agency-involved-crypto-trump-admin","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2024/12/perianne-boring.jpg","video":null,"publish_date":"2024-12-04 00:01:06","author":"Eric Revell","authors":["Eric Revell"],"language":"en","source_country":"us","sentiment":0.219},{"id":270160984,"title":"Lammy to urge Nato to boost support for Ukraine","text":"David Lammy will press Nato to increase military support for Ukraine as he meets allies in Brussels on Wednesday morning.\n\nThe Foreign Secretary is also expected to call for Nato to deter co-operation between Moscow and other countries following the deployment of 10,000 North Korea troops to assist Russia’s invasion of Ukraine.\n\nSpeaking ahead of his first Nato Foreign Ministerial Meeting, Mr Lammy said: “Investment in Ukraine’s security is investment in Euro-Atlantic and global security.\n\n“Ninety-nine per cent of military support to Ukraine has been from Nato allies.\n\n“This support is critical to enabling Ukraine to defend itself against Russian aggression, and the UK and allies must double down on our efforts to ensure Ukraine prevails.”\n\nHis comments come as questions continue to be asked about the impact of a second Donald Trump presidency on Western support for Ukraine, after the incoming president said he wanted to end the conflict on “day one” of his term.\n\nOn Monday, Sir Keir Starmer said Ukraine needed to be put in the “strongest possible position for negotiations”, the first time the Prime Minister has acknowledged the possibility of a negotiated end to the conflict.\n\nBut he also stressed the UK would back Ukraine “for as long as it takes”.\n\nAt his meeting in Brussels, the Foreign Secretary is expected to warn that failing to increase support for Ukraine will embolden Russian President Vladimir Putin, who has seen increasing support from countries such as North Korea and Russia.\n\nMr Lammy will also press European allies to increase defence spending, reaffirming the UK’s commitment to raise its own defence budget to 2.5% of GDP.\n\nHe said: “This Government has been clear that Europe must do more together now by increasing defence spending.\n\n“This is a strategic imperative for our whole continent and is why the UK is committed to 2.5% as soon as possible.”\n\nThe Government has so far declined to set out a timetable for meeting its commitment to spend 2.5% of GDP on defence, saying it will do so in the spring following a strategic defence review.\n\nThe UK currently spends around 2.3% of GDP on defence.","summary":"The Foreign Secretary will attend his first meeting of Nato foreign ministers in Brussels on Wednesday.","url":"https://www.standard.co.uk/news/politics/david-lammy-ukraine-foreign-secretary-nato-brussels-b1197937.html","image":"https://static.standard.co.uk/2024/12/04/00/b86424cfea96079623d885bb9bec47b4Y29udGVudHNlYXJjaGFwaSwxNzMzMzQzNjkz-2.78375204.jpg?width=1200","video":null,"publish_date":"2024-12-04 00:01:00","author":"Christopher McKeon","authors":["Christopher McKeon"],"language":"en","category":"politics","source_country":"GB","sentiment":0.119},{"id":270160986,"title":"Trump tariffs could hit UK goods trade as hard as Brexit, says think tank","text":"Donald Trump’s threatened tariffs could hit UK trade with the US as badly as Brexit affected trade with the EU, a leading think tank has said.\n\nIn a report published on Wednesday, the Resolution Foundation said British trade since Brexit had been “a tale of two sectors”, with service exports growing strongly but goods exports stagnating.\n\nBut authors Emily Fry and Sophie Hale warned that British firms faced another major trade shock if the incoming US president implemented his threat to impose tariffs on all imports.\n\nMs Fry said: “Brexit has driven a trade divide between Britain’s struggling goods sectors and its powerhouse services industries.\n\n“Firms working in areas like advertising, IT and consultancies have found it easier to work around Brexit than goods exporters who can’t avoid transport costs and border checks.\n\n“And with the dust still settling on how Brexit has changed how firms trade, the threat of universal tariffs on goods by President-elect Trump risks widening this trade divide further.”\n\nThe report found that physical trade barriers such as the customs border had meant goods exports have grown by only 0.3% per year since 2019, well below the Organisation for Economic Co-operation and Development (OECD) average of 4.2%.\n\nBut services, which are less affected by physical barriers, have grown by 7.5%, above the OECD average of 6.1%.\n\nMr Trump has vowed to introduce a range of tariffs during his second term in the White House, including a 10-20% levy on all goods imports, with higher tariffs on goods from China, Mexico, Canada and nations that retaliate with protective measures of their own.\n\nThe Resolution Foundation suggested the impact on British businesses exporting to the US of a 10-20% general tariff would be “roughly equivalent in scale to the non-tariff barriers that Brexit imposed on goods sales to the EU” and would further widen the divide between goods and services.\n\nBut despite the threat of tariffs from the US, the think tank urged the Government to focus on easing trade with the EU given 47% of UK goods exports are sold in the bloc, while also pursuing greater services trade with countries beyond Europe.\n\nMs Fry added: “The Government should respond by doing what it can to avoid taking sides on tariffs, easing cross-Channel trade for goods, and taking a truly global approach to reducing barriers to the flow of services trade in and out of Britain.”\n\nTom Brufatto, director of policy and research at campaign group Best for Britain, said: “Maintaining close relations with the US remains vital to our national interest, but to ease the cost-of-living crisis the Government should continue to prioritise improving trade with our European neighbours.\n\n“The Government’s relationship reset with the EU is off to a promising start and they shouldn’t lose sight of the prize at a time when we desperately need to break down barriers to trade.”","summary":"The Resolution Foundation urged the Government to pursue an EU-focused trade policy, despite the threat of tariffs from the US.","url":"https://www.standard.co.uk/business/business-news/trump-tariffs-could-hit-uk-goods-trade-as-hard-as-brexit-says-think-tank-b1197932.html","image":"https://static.standard.co.uk/2024/12/04/00/1d3327a3e1a0d4b82687f8b597645b6bY29udGVudHNlYXJjaGFwaSwxNzMzMzMwOTU2-2.78075825.jpg?width=1200","video":null,"publish_date":"2024-12-04 00:01:00","author":"Christopher McKeon","authors":["Christopher McKeon"],"language":"en","source_country":"GB","sentiment":0.011},{"id":270160890,"title":"Letters: Simitian’s next move | NIH pick | Partisanship | Apology owed | Brave stand | Bad omen","text":"Simitian should run\nfor governor next\n\nIt is my opinion that our county Supervisor Joe Simitian should enter the race and become our next California governor.\n\nHe is and will always be the politician for the people. He proved that when he was state Senator and also as our county supervisor. We Italian-American survivors thank him for helping us get an apology on behalf of our state of California for the horrible mistreatment of 600,000 Italian immigrants here in the United States during World War II. He did a great job and we will always be indebted to him for helping us in our “Fight to Right a Wrong.”\n\nJoe Simitian for governor.\n\nChet Campanella\n\nNIH pick dismissive\nof COVID protocols\n\nRe: “Trump selects Stanford’s Bhattacharya to lead NIH” (Page A1, Nov. 28).\n\nDr. Jay Bhattacharya, Donald Trump’s choice to lead the NIH, has said business and school closings, masks, social distancing and lockdowns were the wrong approach to dealing with the COVID pandemic. I was working as a nurse in an ICU and I couldn’t agree less.\n\nThese measures helped ebb the flow of sick patients needing to be hospitalized which gave us a chance to save lives with finite staff and resources when the hospital was swamped. This didn’t happen in Italy and Spain when they were two of the first countries to get hit with the pandemic and people were literally dying on the sidewalks because there was no space in the overwhelmed hospitals. The pandemic engulfed the whole population all at once in India and there were not even enough oxygen cylinders in the hospitals to save lives.\n\nAnd he’s going to run the NIH?\n\nExtreme partisanship\ncoming to Washington\n\nA most admirable quality of our federal government has always been its nonpartisanship. Yes, there are often party-based appointments, but usually with confidence in the individual’s ability to do the job.\n\nThe military promotes based on merit. The Cabinet secretaries are appointed based on knowledge and experience. Prosecutions by the Justice Department are based on evidence, with verdicts the work of juries of peers.\n\nIn the past, federal appointments would be denied to those with criminal records. In the upcoming administration, the president will be a convicted felon. The ambassador to France will be a fraudster pardoned by No. 45, soon to be No. 47. The nomination to head the military has multiple accusations of abuse of women. The presumptive attorney general has already fallen, due to allegations of sex with minors.\n\nNonpartisan? Only if we have changed the definition to Trump-acolyte. So sad.\n\nLorraine D’Ambruoso\n\nBiden owes nation\napology over pardon\n\nRe: “Biden pardons his son despite earlier pledges that he wouldn’t” (Page A2, Dec. 2).\n\nIt’s interesting how the media sanitizes its reporting of Joe Biden’s decision to pardon his son, Hunter, saying Biden was “reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.”\n\nA more accurate description of present circumstances would be that Biden broke his promise or lied or misled the American people. Biden defends his actions saying, “I hope Americans will understand why a father and a President would come to this decision.” Perhaps Americans do understand this, but shouldn’t they at least have been offered a mea culpa and an apology first?\n\nKathryn Tomaino\n\nUN official took brave\nstand on Gaza war\n\nRe: “U.S. is out of step with world on war” and “Moral implications dire for the war in Gaza” (Page A6, Nov. 26).\n\nTwo recent letter writers described the war in Gaza as genocide. I side with Alice Wairimu Nderitu, United Nations Under-Secretary-General and Special Adviser on the Prevention of Genocide.\n\nMs. Nderitu has held firmly to her view that Israel’s war with Hamas isn’t genocide. As a result of her stand, she will soon be unemployed. Her stand is correct, and I consider her actions a profile in courage. It takes courage not to follow the herd off the cliff.\n\nThose who insist events in Gaza amount to genocide do a disservice to the Palestinian cause and undermine efforts at restoring peace in the region.\n\nDavid Reynolds\nScotts Valley\n\nLoyalty boards a bad\nomen for government\n\nPresident-elect Donald Trump has directed that loyalty review boards assess the loyalty (to him) of certain high ranking U.S. military officers. This will result in the removal of the best-qualified command personnel.\n\nNote: both Hitler and Stalin purged their militaries before and during World War II.\n\nAt the same time, Trump has plans to replace qualified federal civil servants, including in procurement functions, with political appointees loyal to him.\n\nQualifications and experience will be supplanted by loyalty tests and willingness to procure products and services based on political connection, not quality. Our national defense will be directed by political hacks, and our troops will have inferior materials to use.\n\nOur only hope is that there will be enough Republican senators and representatives who will not bend a knee to Trump but will demand that Trump politics be overturned and our national defense be made paramount.\n\nJohn Cormode\nMountain View","summary":"Mercury News Letters to the Editor for Dec. 4, 2024","url":"https://www.mercurynews.com/2024/12/03/letters-1953/","image":"https://www.mercurynews.com/wp-content/uploads/2024/03/SJM-L-HOUSE16-0306-710.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-04 00:00:21","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.007},{"id":270159274,"title":"President Elect Donald Trumps Lawyers Urge Judge To Toss His Hush Money Conviction","text":"President-elect Donald Trump’s lawyers formally asked a judge Monday (December 2, 2024) to throw out his hush money criminal conviction, arguing continuing the case would present unconstitutional “disruptions to the institution of the Presidency”. \n\nIn a filing made public Tuesday (December 3, 2024), Mr. Trump’s lawyers told Manhattan Judge Juan M. Merchan that dismissal is warranted because of the extraordinary circumstances of his impending return to the White House. \r\n\n“Wrongly continuing proceedings in this failed lawfare case disrupts President Trump’s transition efforts,” the attorneys continued, before citing the “overwhelming national mandate granted to him by the American people on November 5, 2024.” \r\n\nProsecutors will have until Dec. 9 to respond. They have said they will fight any efforts to dismiss the case but have indicated openness to delaying sentencing until after Mr. Trump’s second term ends in 2029. \r\n\nFollowing Mr. Trump’s election victory last month, Mr. Merchan halted proceedings and indefinitely postponed his sentencing, previously scheduled for late November, to allow the defence and prosecution to weigh in on the future of the case. He also delayed a decision on Mr. Trump’s prior bid to dismiss the case on immunity grounds. \r\n\nMr. Trump has been fighting for months to reverse the conviction, which involved efforts to conceal a $130,000 payment to porn actor Stormy Daniels, whose affair allegations threatened to disrupt his 2016 campaign. He has denied any wrongdoing. \r\n\nMr. Trump takes office Jan. 20. Mr. Merchan hasn’t set a timetable for a decision. \r\n\nA dismissal would erase Mr. Trump’s historic conviction, sparing him the cloud of a criminal record and possible prison sentence. Mr. Trump is the first former president to be convicted of a crime and the first convicted criminal to be elected to the office. \r\n\nMr. Merchan could also decide to uphold the verdict and proceed to sentencing, delay the case until Mr. Trump leaves office, wait until a federal appeals court rules on Mr. Trump’s parallel effort to get the case moved out of state court or choose some other option.","url":"https://www.thehindu.com/news/international/president-elect-donald-trumps-lawyers-urge-judge-to-toss-his-hush-money-conviction/article68944306.ece","image":"https://th-i.thgim.com/public/incoming/cn9o0x/article68884435.ece/alternates/LANDSCAPE_1200/Trump_Wright_Things_to_Know_48624.jpg","video":null,"publish_date":"2024-12-03 23:58:30","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.149},{"id":270159060,"title":"That Didnt Take Long Canada All Hep To Help On The Border N3797561","text":"unread messages\r\n\r\n\r\n\r\n\n\r\nAccount Settings\r\n\r\nNewsletter Subscriptions\r\nComment Settings\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\nunread messages\r\n\r\n\r\n\r\n\n\r\nAccount Settings\r\n\r\nNewsletter Subscriptions\r\nComment Settings\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n Ed Morrissey Show\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nTerms & Conditions\r\n\r\n\n\r\nPrivacy Policy\r\n\r\n\n\r\n\n\r\nCalifornia – Do Not Sell (ccpa)\r\n\r\n\n\r\nCalifornia - CCPA Notice\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\nAdvertisement\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\nThat Didn't Take Long: Canada All Hep to Help on the Border\r\n\n\r\n\n\r\n\r\nCasey Harper from\r\nThe Center Square\r\n\r\n5:00 PM | December 03, 2024\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nA leading member of Canadian Prime Minister Justin Trudeau's cabinet says that Canada will bolster its border security after meeting with President-elect Donald Trump's Commerce Secretary nominee, Howard Lutnick.\r\n\r\n\n\r\n\nAdvertisement\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nCanadian Public Safety Minister Dominic LeBlanc made the comments to the Canadian Broadcasting Corporation after Trump threatened broad 25% tariffs against Canada and Mexico if they do not help stop the flow of illegal immigrants into the U.S.\n\"As everyone is aware, thousands of people are pouring through Mexico and Canada, bringing Crime and Drugs at levels never seen before,\" Trump said in a statement last week threatening the 25% tariff..\n\n\"Both Mexico and Canada have the absolute right and power to easily solve this long simmering problem,\" Trump continued. \"We hereby demand that they use this power, and until such time that they do, it is time for them to pay a very big price!\"\r\n\r\n\r\n\r\n\nHotair Staff\r\n\nLet's see how long Fidelito takes to come around on the tariffs, now.\r\n\r\n\r\n\r\n\r\nRead More From The Center Square\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nJoin the conversation as a VIP Member\r\n\nLogin to Leave a Comment\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nTrending on HotAir Videos\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\nAdvertisement\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nTaylor Lorenz Refuses to Breathe\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nNinth Circuit Says President Trump May Deport Whatever Illegals He So Chooses \r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nAbout This Year's White House Christmas Decorations...YIKES \r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nActBlue in Trouble? \r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nAOC Wants Oversight Committee Spot \r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nJurors Have Begun Deliberations in the Daniel Penny Case \r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nScott Jennings Torches CNN Panel: Mainstream Media Panicking! \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\nAdvertisement\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\nAdvertisement\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nTRENDING ON TOWNHALL MEDIA\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\nNinth Circuit Court of Appeal Hands Trump Some Good News\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\nYou Mad, Eh? Canadian Didn't Like Trump's 51st State Joke, Turns Himself Into the Joke Instead\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\nBoom: 'Village People' Singer Takes Aim at the MSM, Minces No Words on Trump's Continued Use of 'YMCA'\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\nLibs Are Shocked That Biden Is a Liar. Wait Until They See His Encore. \r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nEd Morrissey Show\r\n\nNewsletters\r\n\n\r\n\nTerms & Conditions\r\n\nPrivacy Policy\r\n\n\r\n\nCalifornia - Do Not Sell My Personal Information\r\n\nCalifornia - CCPA Notice\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nCopyright ©2024 HotAir.com/Salem Media. All Rights Reserved.","url":"https://hotair.com/headlines/2024/12/03/that-didnt-take-long-canada-all-hep-to-help-on-the-border-n3797561","image":null,"video":null,"publish_date":"2024-12-03 23:56:31","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.092},{"id":270159052,"title":"Dreaming Of A Better Government N3797560","text":"It’s the stuff dreams are made of.\n\nThe dreams, that is, of conservatives and libertarians yearning for a return to small government.\n\nAnd maybe also the dreams of millions of Americans fed up with government censorship of social media. Fed up with government lawfare against everyone from Donald Trump to parents protesting woke policies at school board meetings. Fed up with the so-called government experts whose imperious dictates mangled our society in the name of the Covid pandemic.\n\nTrump says he’s ready to tackle the leviathan in Washington and has tasked two of America’s most prominent and successful entrepreneurs to bring the wisdom and common sense of the private marketplace to government. To cut Washington’s colossal administrative state down to size. To make it more efficient. To streamline it. But also to restrain it. To get its too-interfering fingers out of our lives. To return to Congress the responsibility for specifying the laws that hit close to home with us.\n\n“Drain the swamp” is how Trump describes the job he’s given to Elon Musk, the world’s richest man, and Vivek Ramaswamy, a lawyer/investment guru and one-time presidential candidate. They will head the Department of Government Efficiency, called DOGE.","url":"https://hotair.com/headlines/2024/12/03/dreaming-of-a-better-government-n3797560","image":null,"video":null,"publish_date":"2024-12-03 23:56:31","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.254},{"id":270160842,"title":"Kudlow - Tuesday, December 3","text":"to top close Video This video is playing in picture-in-picture.\n\nDon't have a TV subscription? Sign Up\n\nFull Episode December 03, 2024 41:13 \n FULL EPISODE\n\n EXP 8 DAYS\n Kudlow - Tuesday, December 3 \n On today's episode of 'Kudlow', Larry Kudlow discusses Donald Trump's pro-growth agenda, what the 2025 border will look like, and much more. \n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags MOST RECENT EPISODESKUDLOW | FULL EPISODES","summary":"GOP, Donald Trump, Border","url":"https://www.foxbusiness.com/video/6365493463112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/0061a42d-43c1-412d-900c-2c6269fd52a5/44adb4fd-d255-47f4-8bde-e724a0298e46/1280x720/match/1024/512/image.jpg?pubId=854081161001?ve=1&tl=1","video":null,"publish_date":"2024-12-03 23:52:49","author":null,"language":"en","source_country":"us","sentiment":0.246},{"id":270158274,"title":"Breaking Trump Drug Enforcement Agency Nominee Withdraws N2182771","text":"Hillsborough, Florida, County Sheriff Chad Chronister has asked to be removed from consideration to head President Trump's Drug Enforcement Administration. In a terse announcement, Sheriff Chronister laid out his reasons.\n\nTo have been nominated by President-Elect Donald Trump to serve as Administrator of the Drug Enforcement Administration is the honor of a lifetime. Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration. There is more work to be done for the citizens of Hillsborough County and a lot of initiatives I am committed to fulfilling. I sincerely appreciate the nomination, outpouring of support by the American people, and look forward to continuing my service as Sheriff of Hillsborough County.\n\nChronister was appointed Sheriff in 2017 and has since been reelected twice. President Trump nominated him on Saturday, but some of his policies as sheriff (support of DEI, support of red flag laws, for example) quickly developed opposition to his nomination.\n\nREAD MORE: Maybe President Trump Should Reconsider His Selection for Drug Enforcement Administration Chief\n\nOne such policy related to Chronister's stance on COVID vaccine mandates.\n\nIn addition, Chronister refused to stop BLM rioters in 2020, but arrested a pastor for \"illegally\" holding services during the pandemic, and ascribes to soft-on-immigration policies.","url":"https://redstate.com/streiff/2024/12/03/breaking-trump-drug-enforcement-agency-nominee-withdraws-n2182771","image":"https://media.townhall.com/cdn/hodl/rs/images/up/2021/11/rs-breaking-2.png","video":null,"publish_date":"2024-12-03 23:50:31","author":"Streiff","authors":["Streiff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.111},{"id":270158270,"title":"New Federal Judges Decide To Unretire And Mitch Mcconnell Isnt Happy About It N2182765","text":"Politicians are notorious for flip-flopping, typically in whichever direction is most politically expedient for them. Judges generally are not.\n\nYet, two federal judges have done an about-face on their plans to retire — and Senate Minority Leader Mitch McConnell (R-KY) is none too pleased about it. \n\nThe Senate GOP leader on Monday slammed decisions by two federal judges to reverse their announced retirements after Republican former President Trump won re-election in November.Minority Leader Mitch McConnell, R-Ky., criticized the pair of \"partisan Democrat district judges\" after they announced plans to \"unretire\" after \"the American people voted to fire Democrats last month.\" \"Looking to history, only two judges have ever unretired after a presidential election. One Democrat in 2004 and one Republican in 2009. But now, in just a matter of weeks, Democrats have already met that all-time record. It's hard to conclude that this is anything other than open partisanship,\" McConnell said in remarks delivered on the Senate floor.\n\nThe judges in question are Ohio U.S. District Court Judge Algenon Marbley and North Carolina U.S. District Judge Max Cogburn, both of whom had previously announced plans to take senior status (thus creating two vacancies) but then reversed course after Donald Trump won the presidency on November 5. \n\nMcConnell said their decisions to rescind their retirements after Trump won points to \"a political finger on the scale.\" He urged the incoming Trump administration to \"explore all available recusal options with these judges.\" \n\nBut it's two other federal judges at the circuit court (appellate) level that could really throw a wrench into plans if they take a page from the same playbook as Cogburn and Marbley. \n\nAs streiff reported in November, a deal has previously been struck between Senate Republicans and Democrats that will allow President-elect Trump to name four circuit-level judges upon taking office. \n\nIn what could be seen as a historic moment in modern American political history, Senate Democrats have gifted Donald Trump four circuit court seats in exchange for expediting 11 district court vacancies. The deal was brought about by Senate Republicans stalling confirmation hearings so effectively that the Democrat leadership cried, \"Uncle.\"“The reality was we had a serious question as to whether we had the votes on the floor for these four nominees and balancing the opportunity for record number of district court judges against that possibility,” Senate Majority Whip Dick Durbin (D-IL) told the Washington Examiner.\n\nMcConnell made it clear that there had better not be any \"takebacks\" regarding those circuit judge positions.\n\nHe also warned two sitting circuit court judges, who have announced retirements and have vacancies currently pending before the senate, against making similar decisions to \"unretire.\" \"Never before has a circuit judge unretired after a presidential election. It's literally unprecedented. And to create such a precedent would fly in the face of a rare bipartisan compromise on the disposition of these vacancies,\" McConnell said.\n\nIf that were to happen and the carefully crafted deal blown up, one can only imagine the fireworks coming off the Senate floor. My instinct is that the circuit-level judges will not play the same games as the district court judges, particularly given the election (and Trump victory) was already two weeks in the rearview mirror when the deal was reached. But if they do — grab the proverbial popcorn.","url":"https://redstate.com/smoosieq/2024/12/03/new-federal-judges-decide-to-unretire-and-mitch-mcconnell-isnt-happy-about-it-n2182765","image":"https://media.townhall.com/cdn/hodl/2024/87/53b07a0f-58d0-4605-8d84-fd20755521c5.jpg","video":null,"publish_date":"2024-12-03 23:50:31","author":"Susie Moore","authors":["Susie Moore"],"language":"en","source_country":"us","sentiment":-0.187},{"id":270159018,"title":"Last 2 defendants in Atlanta's Young Thug trial are acquitted of murder and gang charges","text":"The long-running gang and racketeering trial that led Atlanta rapper Young Thug to plead guilty in October ended on Tuesday with the last two defendants found not guilty of racketeering, murder and gang-related charges.Deamonte Kendrick, who raps as Yak Gotti, was acquitted of all charges and Shannon Stillwell was found guilty only of gun possession. The verdicts came nearly two years after jury selection began and a year after opening statements in a trial plagued with problems.The original, sweeping indictment used song lyrics and social media posts as evidence and charged 28 people with conspiring to violate Georgia’s Racketeer Influenced and Corrupt Organizations Act. Young Thug, a Grammy-winning artist whose real name is Jeffery Williams, was set free on probation after he pleaded guilty in October to gang, drug and gun charges.RELATED STORY | Rapper Young Thug pleads guilty to gang, drug and gun chargesKendrick and Stillwell were charged in a 2015 drive-by shooting outside an Atlanta barbershop that killed Donovan Thomas Jr., also known as “Big Nut,” who prosecutors said was in a rival gang. Stillwell also was charged with fatally shooting Shymel Drinks at a red light in 2022, allegedly in retaliation for the killings days earlier of two associates in a gang known as YSL, which prosecutors said was co-founded by Young Thug.Stillwell was sentenced to the 10-year maximum for possessing a firearm as a convicted felon previously convicted of a felony involving a gun, with credit for the two years he already served and the balance to be served on probation.Nine of the defendants, including the rapper Gunna, accepted plea deals before the trial began, and four more pleaded guilty during the trial, in October. Charges against 12 others remain pending. Prosecutors dropped charges against one defendant after he was convicted of murder in an unrelated case. That left Kendrick and Stillwell, both of whom were stabbed while in jail — Stillwell last year and Kendrick on Sunday.Tuesday's verdicts were a major setback for Fulton County District Attorney Fani Willis. Critics had criticized her use of the state’s anti-racketeering law, which she also used to bring charges against President-elect Donald Trump for his attempts to overturn the 2020 election.“We always respect the verdict of a jury,” said Jeff DiSantis, a spokesperson for Willis.Defense attorneys said the state relied on faulty evidence — song lyrics, cherry-picked social media posts and unreliable witness testimony — to create a misleading narrative about young men who turned to music to escape economic hardship and difficult pasts.The jury's decision left Tasha Kendrick, Kendrick's mom, in tears.“I’m just thankful for a lot of things right now,” she said. “My emotions are all over the place right now.\"RELATED STORY | Judge removed from gang and racketeering case against rapper Young ThugProsecutors said Williams and two others founded Young Slime Life in association with the national Bloods gang in 2012. The 33-year-old artist also has a record label called Young Stoner Life. Kendrick is featured on two of the most popular songs from the label’s compilation album Slime Language 2, “Take It to Trial” and “Slatty,” as well as Young Thug’s “Slime Sh-t,\" which prosecutors presented as evidence.Williams entered a risky “blind” plea — meaning he pleaded guilty without an agreement on his sentence — in October. Williams’ lawyer said he felt like they were winning, but the rapper complained that sitting in court felt like “hell” and wanted to go home to his family. Judge Paige Reese Whitaker let him out of jail on probation with tight restrictions, including a 10-year ban from metro Atlanta except for certain occasions.The trial shook Atlanta’s rap scene. Williams grew up in a violent Atlanta housing project and became a highly successful artist who added his own melodic twist to the modern Southern trap sound he helped popularize.Fulton County Superior Court Judge Ural Glanville was removed from the case in July after he met with prosecutors and a state witness without defense attorneys present. Kendrick’s attorney Doug Weinstein said defendants got a “fair trial” once Whitaker took over. Among other things, she reprimanded the prosecution for being disorganized and not sharing evidence.During closings, Stillwell’s defense attorney Max Schardt sought to cast doubts on the gang investigators and other state witnesses. Several alleged YSL members testified they had lied to police to stay out of prison. Schardt said officers had threatened them with long prison sentences if they didn’t say the right thing.Prosecutors said those witnesses were honest with police but lied on the stand, in front of the people they had “snitched” on. They said their statements were corroborated by other evidence such as songs and social media posts where they said defendants were “bragging about murder.”RELATED STORY | Why Young Thug's popularity is making his court case so complexProsecutors threw together lyrics, social media posts and irrelevant evidence to “see what sticks,” Weinstein argued, but did not prove they were connected to a criminal enterprise.While defendants did commit crimes in the past, Schardt said during closings, it was to make money for themselves in communities stripped of economic opportunity — not to advance a gang. And music let some of them move on.“As a whole, we know the struggles that these communities have had,” Schardt said. “A sad, tacit acceptance that it’s either rap, prison or death.”Both defense attorneys said Kendrick and Stillwell have other pending charges but hope to get them released from jail as soon as possible.Stillwell is not “blind to the fact that he is getting a second chance at life,\" Schardt said.Weinstein said Kendrick, who is close friends with Young Thug, was laser-focused on his music career before the state pulled him back into the criminal justice system.“I’m so happy that he can kind of draw a line in the sand now,” Weinstein said. “All of this is behind him. He can get on with his life and not worry about this nonsense.”","summary":"The long-running trial that led rapper Young Thug to plead guilty has ended with a jury finding the last two defendants not guilty of racketeering, murder and gang-related charges.","url":"https://www.scrippsnews.com/us-news/crime/last-2-defendants-in-atlantas-young-thug-trial-are-acquitted-of-murder-and-gang-charges","image":"https://ewscripps.brightspotcdn.com/dims4/default/392d44e/2147483647/strip/true/crop/5088x2671+0+404/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fc6%2F6b%2F787c05f04953bd0827aa1c021897%2Fap24331701375016.jpg","video":null,"publish_date":"2024-12-03 23:48:52","author":"AP via Scripps News","authors":["AP via Scripps News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.207},{"id":270160844,"title":"The Big Money Show - Tuesday, December 3","text":"to top close Video This video is playing in picture-in-picture.\n\nDon't have a TV subscription? Sign Up\n\nFull Episode December 03, 2024 41:01 \n FULL EPISODE\n\n EXP 7 DAYS\n The Big Money Show - Tuesday, December 3 \n On today's episode of 'The Big Money Show', the panel take a deep dive into Donald Trump's economic agenda, and so much more. \n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags MOST RECENT EPISODES","summary":"Donald Trump, Economy, White House","url":"https://www.foxbusiness.com/video/6365493843112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/deabd9e7-5a8b-4cd6-a23d-32a6b2230993/1eca41eb-48c3-4ef4-baf9-df65091c3343/1280x720/match/1024/512/image.jpg?pubId=854081161001?ve=1&tl=1","video":null,"publish_date":"2024-12-03 23:47:28","author":null,"language":"en","source_country":"us","sentiment":0.413},{"id":270158808,"title":"Fox News Colleagues Go Public With Concerns About Pete Hegseth’s Drinking","text":"A number of Pete Hegseth’s former Fox news colleagues went public with their concerns about the drinking habits of Donald Trump’s pick for defense secretary—sparking doubts that he would be able to carry out the around-the-clock duties required by the critically important office.\n\nThe former Fox & Friends Weekend co-host has been under intense scrutiny after a number of reports detailed his past exploits—including allegations of sexual assault, lecherous behavior, anti-Muslim sentiments, binge drinking and a history of mismanaging veterans organizations.\n\nA whistleblower report published over the weekend by The New Yorker alleged that he had a history of drinking heavily at work events while he ran a series of veterans’ advocacy groups. Three current and seven former Fox employees shared their own stories of Hegseth’s alleged drinking habits with NBC News Tuesday, adding to the list of concerns about Trump’s embattled pick to lead the Pentagon. \n\nA lawyer for Hegseth, Tim Parlatore, told The New Yorker: “We’re not going to comment on outlandish claims laundered through the New Yorker by a petty and jealous disgruntled former associate of Mr. Hegseth’s. Get back to us when you try your first attempt at actual journalism.” \n\nNeither Fox News nor Hegseth’s lawyer immediately responded to the Daily Beast’s request for comment. \n\nTwo of Hegseth’s former colleagues told NBC that they would often smell alcohol on him before he went on air during his stint as a co-host on Fox & Friends Weekend. They added that he would reportedly talk about being hungover as he was getting ready to go on set or appear live on air. One source reportedly claimed to smell alcohol on him as recently as last month, and said they heard him talk about being hungover this fall. \n\n“Everyone would be talking about it behind the scenes before he went on the air,” one former Fox employee told NBC News. Two other former employees and one current Fox employee also shared that they felt the need to “babysit” Hegseth because of his drinking. \n\n“We’d have to call him to make sure he didn’t oversleep because we knew he’d be out partying the night before,” one source said. None of the sources could remember a moment where Hegseth missed an appearance because he had been drinking, but several noted that he sometimes arrived at the studio with 20 minutes or less before the show began. \n\nThe Daily Beast also obtained pictures of Hegseth taken just before midnight on a Friday night in December 2017, in which he appeared to have been drinking heavily. He appeared on air the next morning. \n\nSome employees also expressed their concerns about Hegseth’s ability to fulfill his role as defense secretary, a demanding, 24-hour-a-day job. One former employee told NBC News, “For the sake of national security, I really hope he has stopped drinking.” \n\n“He should not be secretary of defense,” another former Fox employee added. “His drinking should be disqualifying.\n\nIn an interview with CBS News published Tuesday, Sen. Lindsey Graham (R-SC) described Hegseth’s drinking allegations as “disturbing” while noting they would be hard to defend. \n\n“Some of these articles are very disturbing. He obviously has a chance to defend himself here,” Graham disclosed. “Some of this stuff is going to be difficult. You know time will tell.” \n\n“Some of the things have to be addressed and we’ll see,” he continued. “What we want to do is make sure that we have good order and discipline.” \n\nIn light of Hegseth’s allegations, a spokesperson for the Trump transition team described the accusations as “disgusting” and “completely unfounded and false” \n\n“Anyone peddling these defamatory lies to score political cheap shots is sickening,” they continued. “As a decorated combat veteran, Pete has never done anything to jeopardize that, and he is treating his nomination as the most important deployment of his life.”","summary":"A number of Pete Hegseth’s former Fox news colleagues went public with their concerns about the drinking habits of Donald Trump’s pick for defense secretary—sparking doubts that he would be able to carry out the around-the-clock duties required by the critically important office.\n\nThe former Fox &amp; Friends Weekend co-host has been under intense scrutiny after a number of reports detailed his past exploits—including allegations of sexual assault, lecherous behavior, anti-Muslim sentiments, binge drinking and a history of mismanaging veterans organizations.\n\nA whistleblower report published over the weekend by The New Yorker alleged that he had a history of drinking heavily at work events while he ran a series of veterans’ advocacy groups. Three current and seven former Fox employees shared their own stories of Hegseth’s alleged drinking habits with NBC News Tuesday, adding to the list of concerns about Trump’s embattled pick to lead the Pentagon. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/fox-news-employees-go-public-with-concerns-about-pete-hegseths-drinking/","image":"https://www.thedailybeast.com/resizer/v2/JOSLYXEBBBFGBIECK4GJLP2L3E.jpg?smart=true&auth=0a6b202053b089adc0b065748e4e62d870bbc5274cfc581ef294463e1a5e628f&width=1440&height=1080","video":null,"publish_date":"2024-12-03 23:47:07","author":"Yasmeen Hamadeh","authors":["Yasmeen Hamadeh"],"language":"en","source_country":"us","sentiment":-0.05},{"id":270162040,"title":"Trump making 'joke' about Canada becoming 51st state is 'reassuring': Ambassador Hillman","text":"Canada’s ambassador to the U.S. insists it’s a good sign U.S. president-elect Donald Trump feels “comfortable” joking with Canadian officials, including Prime Minister Justin Trudeau.\n\n\r\n Trudeau made a surprise visit to Mar-a-Lago Friday — accompanied by a small Canadian delegation — to meet with Trump. The trip came just days after the incoming president threatened to implement 25 per cent tariffs on all imports from Canada and Mexico until the border countries stop the flow of illegal drugs and migrants across the borders.\n\n\r\n\r\n The information you need to know, sent directly to you: Download the CTV News App\r\n\n\r\n According to U.S. network Fox News, Trump joked during the meeting in Florida that if said tariffs debilitated the Canadian economy — as the prime minister conveyed to him — perhaps Canada should become the country’s 51st state.\n\n\r\n Canadian politicians responded to the comment on Tuesday, calling it lighthearted teasing.\n\n\r\n Trump later posted what appears to be an artificially generated image depicting him standing on a mountaintop overlooking the Canadian wilderness, with a large Canadian flag next to him, with the caption “Oh Canada!”\n\n\r\n Kirsten Hillman — in an interview on CTV News Channel’s Power Play on Tuesday — said while she hadn’t seen the social media post, the gathering in Florida had “a really happy, joyous kind of atmosphere.”\n\n\r\n “(Trump) made jokes, other people at the table made jokes,” Hillman said, who was part of the Canadian delegation to Mar-a-Lago, though she wasn’t seated at the same table as Trump and Trudeau during the three-hour dinner. “People were making jokes, which, actually, I have to say, I find to be reassuring that people are that comfortable with each other, that they're teasing.”\n\n\r\n “Any good joke always hits a little bit of a nerve, and certainly, president(-elect) Trump is one who likes to hit a nerve,” Hillman told host Vassy Kapelos. “So here's what I would say to Canadians: let's focus on the work that we have ahead of us and the work that has already started with the Trump administration.”\n\n\r\n Hillman also highlighted the significance of Trudeau travelling to Florida for a meeting with Trump within days of the initial tariff threat.\n\n\r\n “Let's focus our attention where it should be, which is on the importance that this dialog is serious and it's continuing, and not on the fact that the president(-elect) is enjoying this this joking moment,” she said. \n\n\r\n Can Canada escape tariffs?\n\n\r\n Two senior government sources told CTV News following Friday’s meeting that it was conveyed to the Canadian delegation the tariffs are unavoidable in the immediacy, but solutions in the longer term are on the table, particularly if the border is better secured.\n\n\r\n When asked whether she believes those in Trump’s orbit are aware of the degree to which the tariffs would impact both the Canadian and American economies, Hillman said she’s “deeply confident” they are.\n\n\r\n According to the Canadian Chamber of Commerce, Trump’s threat of blanket 10 per cent tariffs would have an economic impact totally about $30 billion a year in this country.\n\n\r\n\r\n 5 Things to Know newsletter: Get the biggest headlines in your inbox each morning\r\n\n\r\n Last week, University of Calgary economist Trevor Tombe wrote on social media that adjusting for a 25 per cent tariff would mean the Canadian economy takes an annual real GDP hit of around 2.6 per cent, costing Canadians about $2,000 per person.\n\n\r\n Hillman pointed to the retaliatory tariffs Canada implemented during Trump’s first term as “very difficult for the United States.”\n\n\r\n “I think though, that we have to remember that he is someone who does believe in tariffs as an economic policy tool,” she added. “So our task is to demonstrate to him that that economic policy tool, whether he believes it's a good thing for the United States, vis à vis other partners, when it comes to applying it to Canada, it is going to hurt Americans.”\n\n\r\n When asked whether she believes Canada can escape the imposition of those tariffs, Hillman said she hopes so.\n\n\r\n “I think that is the quid pro quo that was put forward in that (first social media) post,” the ambassador said. “That is what we are working on with them, that was the nature of the conversation at Mar-a-Lago.”\n\n\r\n Hillman also called it a “huge opportunity” for Canada to work with the Americans on issues of common concern, namely the border.\n\n\r\n “I think that one thing that everybody can recognize is that it is very hard to pre-judge what president-elect Trump might do in the future.”\n\n\r\n When pressed on whether and when Canada may impose counter-tariffs, Hillman said “we’re not there yet.”\n\n\r\n She added that while Canada will have to be prepared to take retaliatory measures, she hopes it doesn’t come to that.\n\n\r\n In 2018, during Trump’s first term as U.S. president, Trump triggered a nearly year-long trade war with Canada after imposing a 25 per cent tariff on Canadian steel products and 10 per cent on Canadian aluminum. In response, Canada unveiled a 25 per cent counter tariff on a long list of American steel and aluminum products, along with a 10 per cent surtax on miscellaneous U.S. goods including coffee, prepared meals and maple syrup. Those retaliatory tariffs were eventually lifted in 2019 after Canada, the U.S. and Mexico reached a deal.\n\n\r\n Trump once again announced plans to impose a 10 per cent tariff on Canadian aluminum in August 2020. In a statement at the time, Freeland said “Canada intends to swiftly impose dollar-for-dollar countermeasures,” but one month later, Trump hit pause on those tariffs amid the looming presidential election later that year. Trump went on to lose that election to Joe Biden.\n\n\r\n You can watch Hillman’s full interview in the video player at the top of this article","summary":"Canada’s ambassador to the U.S. insists it’s a good sign U.S. president-elect Donald Trump feels 'comfortable' joking with Canadian officials, including Prime Minister Justin Trudeau.","url":"https://www.ctvnews.ca/politics/trump-making-joke-about-canada-becoming-51st-state-is-reassuring-ambassador-hillman-1.7132608","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/3/trump-canada-social-media-post-1-7132647-1733270645791.png","video":null,"publish_date":"2024-12-03 23:47:00","author":"Spencer Van Dyk","authors":["Spencer Van Dyk"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.054},{"id":270157570,"title":"17081 Tinubu S Tax Reform Bills And Other Stories By Reuben Abati","text":"“Bros, I dey hail oh”\n\n“I dey greet. What’s up?”\n\n“We couldn’t finish our gist last week. But since then, so much has happened. That is why I am calling. Just to pick your brains, bro.” \n\n“You will have to let me finish this bowl of hot piping amala and orisirisi before it gets cold, and then we can talk.”\n\n“You and food. Apparently, there is no food inflation on your side. With the serious food inflation in the country and the cancer of hunger messing up many families under Tinubu, you still get a chance to swallow dollops and draw soup.” \n\n“It is God. Even though I walk in the valley of the shadow of death…Psalm 23 is sufficient for every child of God. In the midst of darkness, and enemies, the good Lord provides for His own. Let me enjoy my amala and ewedu soup. When I worship my stomach, I am also invariably worshipping God and preparing for heaven. Not to deceive you, this amala is going to the very right parts of my stomach”\n\n“Glutton. Wackie and quench”\n\n“Hmm. Ha..Uh. Hu. Ech hen. Hen Hen. Who did you say killed the mother of Jesus Christ? Ha. Ha aaa”\n\n“Food will not kill you one day. You better drink some water.”\n\n“Hen. Hen Jesus is Lord”\n\n“I am actually trying to tell you that the Lord has done it. Port Harcourt Refinery is now working at 70 to 90 percent. The Old refinery is back on stream. The new refinery will join shortly and Warri refinery too. We should be joyous.The Nigeria Labour Congress (NLC) has been put to shame. And it is a bigger shame that they have not deemed it necessary to congratulate President Tinubu and NNPC Limited who have both fulfilled an important pledge.” \n\n“The Labour Congress is not a chorus group. Not an alleluia group like the National Assembly. They are a pressure group, an advocacy movement. You are asking for too much”\n\n“When government does something that is good, we should be able to say so. It is not every time that we condemn and dismiss. We should be fair.” \n\n“There is nothing to be fair about. There are questions that have not been answered. What exactly have they completed? The old refinery or the new. A refinery or a blending plant, relying on Crack 5 from Eleme Petrochemicals now known as Indorama? Who has lifted what? I hear marketers are not yet loading trucks”\n\n“I hear trucks are being loaded”\n\n“Has anybody talked to the elders and youths for whom petrol production is the mainstay of their community?”\n\n“Which community? This is not about community youths and elders looking for hand-outs or royalties or whatever they call it. Oil refining is a sophisticated business. It has no room for street urchins, claiming Nigeria’s oil belongs to their forefathers. This is technical business, not a project for village thugs”\n\n“Be careful. In everything you must carry the people along.”\n\n“Look. Look, the people are oftentimes the problem. Everything that government tries to do for the common good, some people just think it is their lifetime ambition to sabotage everything.”\n\n“More like some people in government suffering from executive arrogance, and we see it all the time. If the people ask questions, you explain to them. Is the refinery already loading products or not? Simple answer.”\n\n“We live in a country where some people don’t want to see anything good in government. Negative people. I listened to one Mr. Tony Ogbuigwe on Arise News discussing this same subject. He is President, Society of Chemical Engineers. He explained everything. He was formerly in charge of the Port Harcourt Refinery. He spoke like an expert, but Nigerians refused to listen. Some people still came on the same TV station the following day to just talk.” \n\n“Mr. Engr. Ogbuigwe spoke for himself. I am not duty-bound to accept his thoughts.” \n\n“You are an Obidient, what else do I expect from you? Is that not the same attitude you people have brought to the issue of tax reform? Four brilliant bills sent to the National Assembly by the Federal Government to reform the tax regime in the country, look at all the confusion you naysayers have generated. Senators from the North are kicking. Northern Governors Forum and the National Governors Forum think the bills are against them. Even Northern Youths are fighting any Northern Leader like the Deputy Senate President, Barau Jibrin who asks for tax reform.”\n\n“Are the Northern youths also Obidients?”\n\n“They are behaving like that. People are all speaking out of mischief and ignorance. I suspect foul play over a subject that should not generate any problem. Mr. Taiwo Oyedele, Chair of the Presidential Committee on Tax and Fiscal Policy and FIRS Chairman, Dr. Zacch Adedeji and others went to the National Assembly to make a presentation on the four bills, Senator Ali Ndume, Senator Abdul Ningi and others staged a walk-out claiming that the presentation was not on the Order Paper for the day.”\n\n“Yes. They were right. Government must learn to do things the proper way.”\n\n“So why did they come back?”\n\n“Because they are more interested in the common good.” \n\n“Leave that matter. Ningi and Ndume have an axe to grind. Ningi was suspended from the Senate for a while. Ndume was removed as Chief Whip. You think they will be happy? The one that surprised me is Professor Baba Gana Zulum going on television to protest. A Professor. Somebody that we all like.” \n\n“Because you all like him, he should not have an opinion?”\n\n“I expected that someone like him would have read the Bills. How would he say openly that if the bills are passed, there would be consequences for the people? Oyedele and Adedeji in their presentations have made it clear that the four tax bills will promote inclusion, equity, fairness and justice. It will defend the interest of the poor. It will task the rich to pay more. It will promote Small and Medium Scale Enterprises. It will change the formula for tax administration. Every state will get 50%, the Federal Government 10%, local councils 35%. Distribution to the states and local governments will be on the basis of derivation. And every state will collect what its people consume through sales tax. No state will collect taxes on imports and exports and international services. Fair enough. I believe the tax reform will encourage competition. Why should Sokoto state or Zamfara collect VAT on beer that is consumed in Lagos, when people in Sokoto and Zamfara are not allowed to drink beer?” \n\n“Very good. Executive arrogance minus political intelligence. This is what we are dealing with here. Not so?” \n\n“There will be public hearings. The Bills have not been passed into law yet. Did you see Oyedele on TV yesterday? He gave brilliant explanations.”\n\n“We have seen kangaroo public hearings in this country. The Federal Government should have carried stakeholders along. Organize a robust debate. The Oyedele committee should also have spoken to the public.” \n\n“To APC members?”\n\n“There was consultation with Governors”\n\n“We know about such consultations. But the Governors are saying not all of them were consulted and they needed more time to understand the bills. Professor Zulum asked the right question: why the rush? Let nobody give the impression that once Tinubu decides, then it is done. This is a democracy. We, the people, have the right to ask questions. Nobody should blackmail us into anything.” \n\n“Nobody is blackmailing anybody. Lazy Nigerian Governors must learn to be productive. President Tinubu wants to teach them to compete and be productive in their states.”\n\n“Okay. The headmaster knows it all. He should just be careful, especially now that members of his own party are beginning to criticize him openly. He has not spent two years in office, his party members are questioning his judgement.”\n\n“Who are those ones?”\n\n“Jesutega Onokpasa for example”\n\n“Who is he to criticize Tinubu?” \n\n“He is Chairman of the Tinubu Media Support Group”\n\n“Who knows him? Let him go and sit down”\n\n“This is the arrogance that I am talking about. By the way, is the President back from France? They told us he would be away for two days on a state visit. I hope he has not gone missing again for a few more days after a fashion?”\n\n“Are you alright? Show some respect please.” \n\n“I asked a simple question. If he is back, yes. If he is not back, No.”\n\n“Google it. He is in South Africa for a bilateral meeting”\n\n“From France straight to South Africa. I know he is the country’s Chief Foreign Policy Officer. I know that economic diplomacy is important. But he cannot travel every market day looking for investors. He must stay at the market and man the stall too. Over 30 trips in less than two years. Haba.”\n\n“Investments and diplomacy are critical parts of his assignment.”\n\n“Accountability is also part of his responsibility. And how would the four tax bills help to attract foreign investments too?”\n\n“Stop beating yourself over nothing. Presidential powers can make anything happen. Look at President Joe Biden of the United States. He has just pardoned his son, Hunter Biden and he hopes all Americans will understand where he is coming from. The fellow was convicted in two cases of federal felony: a gun charge in Delaware and tax convictions in California. His sentencing was scheduled for December 12 and 16. Ahead of that, his father has granted him full and unconditional pardon, not just for the two criminal offences, but also for any offence that he may have committed, or may be suspected to have committed between January 1, 2014 through December 1, 2024.”\n\n“The man simply transferred his immunity to his own son, and saved him from going to jail. This is the same man who in June categorically ruled out a pardon or a commutation for his son. He said he would abide by the jury’s decision”\n\n“That is what it means to be a President. And Biden is not the first American President to use presidential powers to protect a relative. In 2001, President Bill Clinton pardoned his half-brother, Roger Clinton who was in jail for a cocaine-related offence.” \n\n“I stand with Donald Trump in this matter. It is an abuse of Presidential powers. It is a miscarriage of justice.” \n\n“Which Donald Trump? Kettle calling pot black. In 2020, Trump as President pardoned Charles Kushner, the father-in-law of his daughter Ivanka. He has just named the same Charles Kushner as his Ambassador-designate to France. If you were President Joe Biden, you will open your eyes and allow a judge to send your son to jail because you want to be seen to be upright? If you were in his shoes, you will leave office and allow your son to be in jail under a President Trump? He was very clear. He said his son was singled out and that there had been a miscarriage of justice”\n\n“Pardoning his son casts a pall over his legacy.”\n\n“So be it. When you become President, don’t use the powers God has given you. Allow your opponents to ride roughshod over you. The problem with governance is actually the people, particularly journalists who will not mind their business.”\n\n“Journalists are not supposed to mind their business. Any journalist that minds his or her business is not a journalist.”\n\n“And that is why journalists get knocked on the head. I am a journalist. I am a journalist. That was how Fisayo Soyombo found himself in army detention in Port Harcourt. He was lucky the social media cried out. He could have disappeared for a whole year before anybody will trace his whereabouts.”\n\n“Soyombo, founder of the Foundation for Investigative Journalism (FIJ) is not just a journalist. He is one of the finest in the trade. He is a courageous investigative journalist who exposes the underbelly of corruption in our society. A man of courage who has exposed the criminal practices in prisons, the mistreatment of soldiers at the warfront, vehicle smuggling across the border and the inefficiency of the police. He was on duty in Port Harcourt to investigate the menace of illegal oil bunkering and crude oil theft. Rather than arrest the oil bunkerers, Nigerian soldiers arrested him and allowed the oil thieves to go scot-free. Is that what you recommend?” \n\n“If you make yourself a suspect, you can be arrested and interrogated. What is wrong in that?”\n\n“What is wrong is that in this country the good guys get punished, the bad guys get a pat on the back. The army interrogated Soyombo and before they released him, they had reported everything he said to the oil thieves, thus placing him in harm’s way.”\n\n“You have no proof. There is always another side to any story.”\n\n“He was very specific. He mentioned names.”\n\n“You should know. I think you always hear and see things.”\n\n “I hear President Biden is visiting Angola, keeping his promise to visit sub-Saharan Africa before he leaves office. I am surprised he is not visiting Nigeria on his first visit to Africa.” \n\n “What does it matter? He is leaving anyway. He has less than two months in office before he leaves the White House. And you can be sure when that visit is over, he will go straight back home… Maybe Trump will visit Nigeria.”\n\n “He will come and visit you at home”\n\n“Yes. Why not? He is after all, our in-law”\n\n“I also hear the Federal Inland Revenue Service (FIRS) has directed the money deposit banks and the Fintech firms to start charging Electronic Money Transfer Levy of N50 on any electronic inflow of N10, 000 and above.”\n\n“For what? Why?”\n\n“To generate revenue for government distribution”\n\n“No. To further tax the people and punish them and to create another avenue for corruption. Distribute our money to which government? What do they ever do with all the taxes? I am willing to pay tax but I want to be sure that what is taken from me is used to build roads, fund education and healthcare and promote the common good, not the greed of government officials.” \n\n“Nobody has ever liked the tax man. This is the real issue.” \n\n“The real issue is President Tinubu saying Nigerians lived a fake life before he became President. He has forgotten he was part of that fake world too.”","url":"https://www.huhuonline.com/index.php/home-4/guest-columnists/17081-tinubu-s-tax-reform-bills-and-other-stories-by-reuben-abati","image":null,"video":null,"publish_date":"2024-12-03 23:46:31","author":"Reuben Abati","authors":["Reuben Abati"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.257},{"id":270157094,"title":"Donald Trump Lawyers Urge Judge To Toss Hush Money Case Cite Joe Biden Pardoning Son 2644520 2024 12 04","text":"Donald Trump on Tuesday asked a New York state judge to dismiss the criminal case in which he was convicted in May of 34 felony counts involving hush money paid to a porn star in light of his victory in the November 5 US presidential election.In urging Justice Juan Merchan in Manhattan to vacate the guilty verdict and toss the charges, Trump's lawyers said having Manhattan District Attorney Alvin Bragg's case hang over him after he takes office on January 20 would impede his ability to govern.\"Local elected officials such as D.A. Bragg have no valid basis to cause such disruptions,\" defence lawyers Todd Blanche and Emil Bove wrote in a court filing dated Dec. 2 and made public on Tuesday.Trump in November nominated Blanche to serve as deputy attorney general, the second-highest position at the Justice Department, during his administration. He nominated Bove to serve as Blanche's top deputy and to be acting deputy attorney general while Blanche awaits confirmation.Merchan last month delayed Trump's previously scheduled Nov. 26 sentencing indefinitely to give him the chance to seek dismissal.Prosecutors with Bragg's office supported delaying the sentencing to give Trump the chance to make his case for dismissal, though they said they would oppose that bid. The prosecutors have until next Monday to respond.The judge has not indicated when he would rule on Trump's motion to dismiss, and has not set a new date for sentencing.Bragg's office has suggested he defer all proceedings in the case until Trump, 78, leaves the White House in 2029.In their motion to dismiss, Trump's lawyers called that suggestion \"ridiculous.\" They said that would mean sentencing would happen more than a decade after the investigation started in 2018.A spokesperson for Bragg's office declined to comment.The New York case stemmed from a $130,000 payment Trump's former lawyer Michael Cohen made to adult film actress Stormy Daniels for her silence before the 2016 election about a sexual encounter she has said she had a decade earlier with Trump, who denies it.A Manhattan jury found Trump guilty of falsifying business records to cover up his reimbursement of Cohen. It was the first time a US president - former or sitting - had been convicted of or charged with a criminal offense.Trump pleaded not guilty in the case, which he has sought to portray as a politically motivated attempt by Bragg, a Democrat, to interfere with his presidential campaign.Falsification of business records is punishable by up to four years in prison. Before he was elected, experts said it was unlikely - but not impossible - that Trump would face time behind bars, with punishments such as a fine or probation seen as more likely.Trump's victory over Democratic Vice President Kamala Harris in the Nov. 5 election made the prospect of imposing a sentence of jail or probation even more politically fraught and impractical, given that a sentence could have impeded his ability to conduct the duties of the presidency.Trump was charged in three additional state and federal criminal cases in 2023, one involving classified documents he kept after leaving office and two others involving his efforts to overturn his 2020 election loss.He pleaded not guilty in all three cases. None have gone to trial.A Washington judge on Nov. 25 dismissed the federal criminal case over his attempts to hold onto power. Prosecutors had moved to drop both that case and the classified documents case due to a Justice Department policy against prosecuting a sitting president.Trump also faces state criminal charges in Georgia over his bid to reverse his 2020 loss in that state, but that case remains in limbo.As president, Trump would have no power to shut down the New York or Georgia cases because they were filed in state courts.Published By: Nakul AhujaPublished On: Dec 4, 2024Tune InMust Watch","url":"https://www.indiatoday.in/world/us-news/story/donald-trump-lawyers-urge-judge-to-toss-hush-money-case-cite-joe-biden-pardoning-son-2644520-2024-12-04","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202412/donald-trump-293420132-16x9.jpeg?VersionId=1N55ZMxoz77U2eHxSoJrwd8p7LZFILj.?size=1280:720","video":null,"publish_date":"2024-12-03 23:43:30","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.604},{"id":270157068,"title":"Sean Penn Slams Oscars For Its Cowardice In Fiery Rant","text":"Penn’s remarks dovetail with longstanding criticisms of The Academy of Motion Picture Arts and Sciences for lacking diversity within the ranks of its members and the films that they celebrate with awards.\n\nIt has in recent years taken steps to reform and rebrand itself, but has faced criticism for not going far enough. The academy did not immediately respond to request for comment on Tuesday.\n\nPenn also lauded Iranian-Danish director Ali Abassi and his latest film “ The Apprentice ” about President Donald Trump. It faced difficulty finding an American distributor in the lead-up to the U.S. election in November.\n\n“It’s kind of jaw-dropping how afraid this ‘business of mavericks’ is when they get a great film like that with great, great acting,” he said. “They, too, can be as afraid as a piddly little Republican congressman.”\n\nAs part of a career tribute, the Marrakech Film Festival is screening four of Penn’s films this week in Morocco’s tourism capital. Local media in Morocco reported several audience members exiting a screening of “Milk” during a scene that depicted two men in bed. Homosexuality is illegal under Morocco’s penal code, although cases are not frequently prosecuted.\n\nThe actor, whose 2023 film “ Superpower ” documents war in Ukraine, also voiced support for President Volodymyr Zelenskyy and called himself a “patriot in crisis” in response to a question about the American political landscape.","url":"https://calgarysun.com/entertainment/movies/sean-penn-slams-oscars-for-its-cowardice-in-fiery-rant","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/09/CP27631359-scaled.jpg","video":null,"publish_date":"2024-12-03 23:42:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"ca","sentiment":0.134},{"id":270157064,"title":"Comedian Bill Maher Threatens To Quit Show Over Donald Trumps Return To Power","text":"The comedian, who hosts Real Time with Bill Maher on HBO, said he won’t be able to handle Trump for another four years.\n\n“I’m s—ing my pants. I may quit,” Maher told his Club Random podcast guest Jane Fonda on Sunday. “Because I don’t want to do another [Trump term]. I did all the Trump stuff before anybody.\n\n“I called him a con man before anybody, I did, ‘he’s a mafia boss.’ I was the one who said he wasn’t going to concede the election. I’ve done it.”","url":"https://calgarysun.com/news/world/comedian-bill-maher-threatens-to-quit-show-over-donald-trumps-return-to-power","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/05/bill_maher_stormy-e1715618239136.jpg","video":null,"publish_date":"2024-12-03 23:42:31","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.377},{"id":270158366,"title":"New York is 'broke' and can't afford these migrants, columnist explains","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics December 03, 2024 04:28 \n\n New York is 'broke' and can't afford these migrants, columnist explains \n Fox News contributor Liz Peek discusses concerns over President-elect Donald Trump's tariffs plan and the border crisis on 'The Bottom Line.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSTHE BOTTOM LINE | LATEST EPISODES","summary":"Fox News contributor Liz Peek discusses concerns over President-elect Donald Trump&apos;s tariffs plan and the border crisis on &apos;The Bottom Line.&apos;","url":"https://www.foxbusiness.com/video/6365493913112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/e6bb8dc9-6dfa-4c2d-ad1b-dd456c058aae/3180b9e1-ebf1-424f-ab8b-5c7923ca2c7a/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-03 23:42:07","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.064},{"id":270157716,"title":"Chad Chronister, Donald Trump’s pick to run the DEA, withdraws name from consideration","text":"By MICHELLE L. PRICE\n\nNEW YORK (AP) — Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.\n\nSheriff Chronister, the top law enforcement officer in Hillsborough County, Florida, said in a post on X that he was backing away from the opportunity, which he called “the honor of a lifetime.”\n\n“Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration,” Chronister wrote. He did not elaborate, and Trump’s transition team did not immediately respond to a message seeking comment.\n\nChronister follows former Republican congressman Matt Gaetz, Trump’s first pick to serve as attorney general, in withdrawing his name for a post in the administration. Gaetz withdrew following scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.\n\nTrump’s pick of Chronister for the DEA job drew backlash from conservatives, who raised concerns over his actions during the COVID-19 pandemic and his saying that his office “does not engage in federal immigration enforcement activities.”\n\nIn March 2020, Chronister arrested the pastor of a megachurch who held services with hundreds of people and violated a safer-at-home order in place aimed at limiting the spread of the Covid virus.\n\n“Shame on this pastor, their legal staff and the leaders of this staff for forcing us to do our job. That’s not what we wanted to do during a declared state of emergency,” Chronister said at the time. “We are hopeful that this will be a wakeup call.”\n\nU.S. Rep. Thomas Massie, R-Ky, was among those airing public complaints, saying Chronister should be “disqualified” for the arrest.\n\nOthers flagged comments Chronister made in a video about Florida’s immigration laws that he released in 2023 that circulated again online after Trump named him last weekend.\n\nHe said it was important to note his office “does not engage in federal immigration enforcement activities. We do not target individuals based on their immigration status. That’s the authority of federal agencies.”\n\nTrump has made a sweeping crackdown on immigration a central focus of his campaign and his aims for his coming administration.\n\nAssociated Press writer Adriana Gomez Licon in Fort Lauderdale, Florida contributed to this report.","summary":"Chronister is the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.","url":"https://www.mercurynews.com/2024/12/03/chad-chronister-dea-pick-withdraws/","image":"https://www.mercurynews.com/wp-content/uploads/2024/12/Trump_Tariffs_83518.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-03 23:41:56","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0},{"id":270157644,"title":"Chad Chronister, Donald Trump’s pick to run the DEA, withdraws name from consideration","text":"By MICHELLE L. PRICE\n\nNEW YORK (AP) — Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.\n\nSheriff Chronister, the top law enforcement officer in Hillsborough County, Florida, said in a post on X that he was backing away from the opportunity, which he called “the honor of a lifetime.”\n\n“Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration,” Chronister wrote. He did not elaborate, and Trump’s transition team did not immediately respond to a message seeking comment.\n\nChronister follows former Republican congressman Matt Gaetz, Trump’s first pick to serve as attorney general, in withdrawing his name for a post in the administration. Gaetz withdrew following scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.\n\nTrump’s pick of Chronister for the DEA job drew backlash from conservatives, who raised concerns over his actions during the COVID-19 pandemic and his saying that his office “does not engage in federal immigration enforcement activities.”\n\nIn March 2020, Chronister arrested the pastor of a megachurch who held services with hundreds of people and violated a safer-at-home order in place aimed at limiting the spread of the Covid virus.\n\n“Shame on this pastor, their legal staff and the leaders of this staff for forcing us to do our job. That’s not what we wanted to do during a declared state of emergency,” Chronister said at the time. “We are hopeful that this will be a wakeup call.”\n\nU.S. Rep. Thomas Massie, R-Ky, was among those airing public complaints, saying Chronister should be “disqualified” for the arrest.\n\nOthers flagged comments Chronister made in a video about Florida’s immigration laws that he released in 2023 that circulated again online after Trump named him last weekend.\n\nHe said it was important to note his office “does not engage in federal immigration enforcement activities. We do not target individuals based on their immigration status. That’s the authority of federal agencies.”\n\nTrump has made a sweeping crackdown on immigration a central focus of his campaign and his aims for his coming administration.\n\nAssociated Press writer Adriana Gomez Licon in Fort Lauderdale, Florida contributed to this report.","summary":"Chronister is the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.","url":"https://www.bostonherald.com/2024/12/03/chad-chronister-dea-pick-withdraws/","image":"https://www.bostonherald.com/wp-content/uploads/2024/12/Trump_Tariffs_83518.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-03 23:41:56","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0},{"id":270157988,"title":"Chad Chronister, Donald Trump’s pick to run the DEA, withdraws name from consideration","text":"By MICHELLE L. PRICE\n\nNEW YORK (AP) — Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.\n\nSheriff Chronister, the top law enforcement officer in Hillsborough County, Florida, said in a post on X that he was backing away from the opportunity, which he called “the honor of a lifetime.”\n\n“Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration,” Chronister wrote. He did not elaborate, and Trump’s transition team did not immediately respond to a message seeking comment.\n\nChronister follows former Republican congressman Matt Gaetz, Trump’s first pick to serve as attorney general, in withdrawing his name for a post in the administration. Gaetz withdrew following scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.\n\nTrump’s pick of Chronister for the DEA job drew backlash from conservatives, who raised concerns over his actions during the COVID-19 pandemic and his saying that his office “does not engage in federal immigration enforcement activities.”\n\nIn March 2020, Chronister arrested the pastor of a megachurch who held services with hundreds of people and violated a safer-at-home order in place aimed at limiting the spread of the Covid virus.\n\n“Shame on this pastor, their legal staff and the leaders of this staff for forcing us to do our job. That’s not what we wanted to do during a declared state of emergency,” Chronister said at the time. “We are hopeful that this will be a wakeup call.”\n\nU.S. Rep. Thomas Massie, R-Ky, was among those airing public complaints, saying Chronister should be “disqualified” for the arrest.\n\nOthers flagged comments Chronister made in a video about Florida’s immigration laws that he released in 2023 that circulated again online after Trump named him last weekend.\n\nHe said it was important to note his office “does not engage in federal immigration enforcement activities. We do not target individuals based on their immigration status. That’s the authority of federal agencies.”\n\nTrump has made a sweeping crackdown on immigration a central focus of his campaign and his aims for his coming administration.\n\nAssociated Press writer Adriana Gomez Licon in Fort Lauderdale, Florida contributed to this report.","summary":"Chronister is the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.","url":"https://www.twincities.com/2024/12/03/chad-chronister-dea-pick-withdraws/","image":"https://www.twincities.com/wp-content/uploads/2024/12/Trump_Tariffs_83518.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-03 23:41:56","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0},{"id":270157758,"title":"Chad Chronister, Donald Trump's pick to run the DEA, withdraws name from consideration","text":"NEW YORK -- Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.\n\nNOTE: The video is from a previous report. \n\nSheriff Chronister, the top law enforcement officer in Hillsborough County, Florida, said in a post on X that he was backing away from the opportunity, which he called \"the honor of a lifetime.\"\n\n\"Over the past several days, as the gravity of this very important responsibility set in, I've concluded that I must respectfully withdraw from consideration,\" Chronister wrote. He did not elaborate, and Trump's transition team did not immediately respond to a message seeking comment.\n\nChronister follows former Republican congressman Matt Gaetz, Trump's first pick to serve as attorney general, in withdrawing his name for a post in the administration. Gaetz withdrew following scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation's chief federal law enforcement officer.\n\nTrump's pick of Chronister for the DEA job drew backlash from conservatives, who raised concerns over his actions during the COVID-19 pandemic and his saying that his office \"does not engage in federal immigration enforcement activities.\"\n\nIn March 2020, Chronister arrested the pastor of a megachurch who held services with hundreds of people and violated a safer-at-home order in place aimed at limiting the spread of the Covid virus.\n\n\"Shame on this pastor, their legal staff and the leaders of this staff for forcing us to do our job. That's not what we wanted to do during a declared state of emergency,\" Chronister said at the time. \"We are hopeful that this will be a wakeup call.\"\n\nU.S. Rep. Thomas Massie, R-Ky, was among those airing public complaints, saying Chronister should be \"disqualified\" for the arrest.\n\nOthers flagged comments Chronister made in a video about Florida's immigration laws that he released in 2023 that circulated again online after Trump named him last weekend.\n\nIn the video, Chronister praised the \"rich diversity\" of his community and called it \"a place where people from all walks of life come together.\"\n\nHe said it was important to note his office \"does not engage in federal immigration enforcement activities. We do not target individuals based on their immigration status. That's the authority of federal agencies.\"\n\nTrump has made a sweeping crackdown on immigration a central focus of his campaign and his aims for his coming administration.\n\nAssociated Press writer Adriana Gomez Licon in Fort Lauderdale, Florida contributed to this report.","summary":"Chronister follows former Republican congressman Matt Gaetz, Trump's first pick to serve as attorney general, in withdrawing his name for a post in the administration.","url":"https://abc7news.com/post/chad-chronister-donald-trumps-pick-run-dea-withdraws-name-consideration/15620857/","image":"https://cdn.abcotvs.com/dip/images/15620851_trump-transition-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wtvd/120324-wtvd-trump-nominee-backlash-vid.mp4","publish_date":"2024-12-03 23:41:29","author":"Michelle L. Price","authors":["Michelle L. Price"],"language":"en","category":"politics","source_country":"us","sentiment":0.045},{"id":270157106,"title":"Chad Chronister, Donald Trump's pick to run the DEA, withdraws name from consideration","text":"NEW YORK -- Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.\n\nNOTE: The video is from a previous report. \n\nSheriff Chronister, the top law enforcement officer in Hillsborough County, Florida, said in a post on X that he was backing away from the opportunity, which he called \"the honor of a lifetime.\"\n\n\"Over the past several days, as the gravity of this very important responsibility set in, I've concluded that I must respectfully withdraw from consideration,\" Chronister wrote. He did not elaborate, and Trump's transition team did not immediately respond to a message seeking comment.\n\nChronister follows former Republican congressman Matt Gaetz, Trump's first pick to serve as attorney general, in withdrawing his name for a post in the administration. Gaetz withdrew following scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation's chief federal law enforcement officer.\n\nTrump's pick of Chronister for the DEA job drew backlash from conservatives, who raised concerns over his actions during the COVID-19 pandemic and his saying that his office \"does not engage in federal immigration enforcement activities.\"\n\nIn March 2020, Chronister arrested the pastor of a megachurch who held services with hundreds of people and violated a safer-at-home order in place aimed at limiting the spread of the Covid virus.\n\n\"Shame on this pastor, their legal staff and the leaders of this staff for forcing us to do our job. That's not what we wanted to do during a declared state of emergency,\" Chronister said at the time. \"We are hopeful that this will be a wakeup call.\"\n\nU.S. Rep. Thomas Massie, R-Ky, was among those airing public complaints, saying Chronister should be \"disqualified\" for the arrest.\n\nOthers flagged comments Chronister made in a video about Florida's immigration laws that he released in 2023 that circulated again online after Trump named him last weekend.\n\nIn the video, Chronister praised the \"rich diversity\" of his community and called it \"a place where people from all walks of life come together.\"\n\nHe said it was important to note his office \"does not engage in federal immigration enforcement activities. We do not target individuals based on their immigration status. That's the authority of federal agencies.\"\n\nTrump has made a sweeping crackdown on immigration a central focus of his campaign and his aims for his coming administration.\n\nAssociated Press writer Adriana Gomez Licon in Fort Lauderdale, Florida contributed to this report.","summary":"Chronister follows former Republican congressman Matt Gaetz, Trump's first pick to serve as attorney general, in withdrawing his name for a post in the administration.","url":"https://abc13.com/post/chad-chronister-donald-trumps-pick-run-dea-withdraws-name-consideration/15620857/","image":"https://cdn.abcotvs.com/dip/images/15620851_trump-transition-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wtvd/120324-wtvd-trump-nominee-backlash-vid.mp4","publish_date":"2024-12-03 23:41:29","author":"Michelle L. Price","authors":["Michelle L. Price"],"language":"en","category":"politics","source_country":"us","sentiment":0.045},{"id":270156974,"title":"Mark Cuban's War on Drug Prices: 'How Much Fucking Money Do I Need?'","text":"Chatting with WIRED senior writer Lauren Goode, Cuban touted the trajectory of Cost Plus Drugs, the pharmaceutical company he cofounded in 2022. By offering transparency on costs and pricing policies, Cuban says his company has been able to disrupt the drug industry, offering consumers drugs like Droxidopa for something like $20 per month versus the more than $3,000-a-month uninsured patients were being quoted.\n“We’ve lowered the price of [one of our 2,500 medications] every single weekday for 18 months,” Cuban boasted, saying the company has also found great success in publishing its entire price list, something that’s always been incredibly hard to obtain from other drug providers for consumers and researchers alike.\nNow, Cuban says, studies have come out showing that if Medicare bought, for instance, nine specific drugs from Cost Plus Drugs instead of their other sources, the government would save billions of dollars, something that not only shows the bloat of the healthcare system but also the tangible effect that one well-funded company can have.\nIt’s not that Cuban’s not making money on Cost Plus Drugs, either, because he is. He could be making more, he told Goode, but as he put it, “How much fucking money do I need? I’m not trying to land on Mars.”\nThe crack, presumably directed at Elon Musk, was just one of several remarks Cuban made about the billionaire X owner. For one, he spoke about his own move from X to Bluesky in recent months, saying that he thinks it’s an overall “existential moment” for Musk’s platform.\nBecause of Bluesky’s troll-blocking capabilities and what Cuban calls more engagement-friendly policies, he says he’s found it much easier to engage there, whether it’s Kamala Harris, cryptocurrency or the Dallas Mavericks basketball team, in which he owns a minority stake. “If you want to know what Elon thinks, Twitter’s amazing,” Cuban joked, but added that he thinks Bluesky is more of a true “social network” in comparison.\nDigging deeper into crypto, Cuban said that he thinks Securities and Exchange Commission chair Gary Gensler’s villainization of the currency really hurt Harris’ chances during the US election. After polling the audience to see how many people owned crypto and sharing that he owns “a lot” of bitcoin himself, Cuban said that because something like 40 percent of young men have owned or do own crypto, either because it’s the cool thing to do or because they don’t trust or understand the stock market or traditional banking system, “Gary Gensler telling you to ‘roll over and let me stick a bike handle up your ass’ … did not make it good for people who own crypto and didn’t make it good for Kamala.”\nCuban said he told both Harris and her team as much, ultimately asserting that with more young men coming out to the polls for the election than were previously expected, “I don’t think it’s a stretch to connect” the candidate’s loss to what he sees as her team’s antiquated crypto policy.\nHe said he offered the Harris campaign thoughts on how to win over social media as well, though they didn’t take them. For anyone, candidate or not, to control the narrative on any given day, he said they need to “flood the zone,” putting memes, quips, and clickable videos out into the ether to be passed around online and covered in the news. (MAGA architect Steve Bannon has also used \"flood the zone\" to describe his strategies.)\n“It’s not like it was facts that made the difference in this election,” Cuban said, making a joke about Donald Trump’s assertion that Haitian immigrants are eating dogs in Ohio. The democrats, he said, “needed more couch-fucking stuff. Sixteen million couch-fucking extensions and everyone would have seen it.\n“Weird. Brat. Fucking the couch. They started out flooding the zone,” Cuban said, “but then they dropped it and tried to use accuracy. Donald Trump floods the zone continuously [and that’s why he won.”","summary":"“I’m not trying to land on Mars,” Cost Plus Drugs founder Mark Cuban joked at WIRED’s The Big Interview event.","url":"https://www.wired.com/story/big-interview-mark-cuban-2024/","image":"https://media.wired.com/photos/674f8535ea6c0af41b136c36/16:9/w_2000,h_1125,c_limit/TD_MarkCuban_2024_12_03_014.jpg","video":null,"publish_date":"2024-12-03 23:38:58","author":"Marah Eakin","authors":["Marah Eakin"],"language":"en","source_country":"US","sentiment":-0.037},{"id":270156856,"title":"Trump Is Going to Give America a Spectacular 250th Birthday Celebration","text":"DAILY CALLER NEWS FOUNDATION—Celebrating the 250th anniversary of the Declaration of Independence on July 4, 2026, can help bring us together and restore our confidence in America’s future. The nation’s positive experience celebrating America’s Bicentennial in 1976 provides that model.\n\nPresident-elect Donald Trump has already shared his vision to make our 250th birthday the biggest and most spectacular celebration of patriotism. He aims to “showcase the glory of every state in the Union, promote pride in our history, and put forth innovative visions for America’s future.”\n\nTrump’s vision pairs perfectly with the work already underway by America250, the bipartisan commission established by Congress in 2016 to educate, engage, and unite every American in the celebration. America250’s plans complement Trump’s ideas for our big anniversary.\n\nAmerica250 will provide Americans with innumerable opportunities to share stories, volunteer, wave flags, and honor those who have sacrificed to preserve our freedom. Contests and storytelling platforms invite diverse answers to a question that can engage everyone: “What does America mean to you? Through the America’s Field Trip contest, students in third through 12th grade can win unforgettable field trips to the nation’s most iconic historical and cultural landmarks, such as Yellowstone National Park and the Statue of Liberty, by submitting writing or original artwork in response to that prompt.\n\nAmerica250 plans to strengthen civic education by helping teachers instill in young Americans a deep appreciation for the principles of the Declaration of Independence. These enduring principles acknowledge that “all men are created equal” and that our Creator endows us all with unalienable rights to life, liberty, and the pursuit of happiness.\n\nIn addition, America250 has helped create state and territory commissions that will take the celebration to local communities. Outstanding among the state commissions is Virginia, the birthplace of Declaration of Independence author Thomas Jefferson. Under the leadership of Virginia Gov. Glenn Youngkin, the VA250 Commission has already developed education programs and celebrations that other states can model.\n\nAmerica250 is eagerly awaiting further details of Trump’s plan. Celebrating our big anniversary can inspire Americans to reflect on our nation’s past and look toward a more prosperous and free future that embraces America’s spirit and limitless potential. Our nation’s 250th birthday can bring us together, restore our confidence, and increase our optimism as the celebration of our Bicentennial did in 1976.\n\nMuch like today, the 1970s were not a time of peace and tranquility for America. Reeling from Vietnam and the Watergate scandal and struggling to control runaway inflation, Americans experienced deep divisions. In September 1975, President Gerald Ford even dodged two assassination attempts in the span of 17 days. These dynamics fueled America’s disillusionment with Washington politics and stoked a fear that our best days were behind us.\n\nThe Bicentennial provided the antidote, reminding us of the courage and foresight of our Founding Fathers in establishing a system of constitutional self-government that has allowed Americans to strive toward becoming a more perfect union. \n\nAs the oldest constitutional republic in the world, it is our responsibility to preserve the principles on which our nation was founded. President-elect Trump and America250 are positioned to do just that by making July 4, 2026, the Semiquincentennial, a grand birthday celebration that brings us together and moves us forward.\n\nThe views and opinions expressed in this commentary are those of the author and do not reflect the official position of the Daily Caller News Foundation.\n\nOriginally published by the Daily Caller News Foundation\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"DAILY CALLER NEWS FOUNDATION—Celebrating the 250th anniversary of the Declaration of Independence on July 4, 2026, can help bring us together and restore our confidence in America’s future.... Read More\n\n\nThe post Trump Is Going to Give America a Spectacular 250th Birthday Celebration appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2024/12/03/trump-is-going-to-give-america-a-spectacular-250th-birthday-celebration/","image":"https://www.dailysignal.com/wp-content/uploads/2024/12/GettyImages-2184849126.jpg","video":null,"publish_date":"2024-12-03 23:35:41","author":"Victoria Hughes","authors":["Victoria Hughes"],"language":"en","source_country":"us","sentiment":0.574},{"id":270156588,"title":"Donald Trump Jr. joins e-commerce company, sending its shares up 270%","text":"PSQ Holdings, an online commerce and payments company that describes itself as \"valuing life, family and liberty,\" saw its shares shoot up more than 270% on Tuesday amid news that Donald Trump Jr. is joining its board of directors. PSQ, based in West Palm Beach, Florida, operates PublicSquare, an e-commerce platform that offers a range of consumer goods and services. The company, which also sells baby products under the EveryLife brand, describes its mission as one that \"connects patriotic Americans to high-quality businesses that share their values, both online and in their local communities.\"\"With a rapidly growing marketplace and payments ecosystem, PublicSquare has a distinct position in the market based on the core tenets of our nation's founding, paired with a results-driven management team,\" Trump Jr. said in a statement. \"The American people have affirmed the importance of liberty, and PublicSquare is at the forefront of this movement.\"In a news release, PublicSquare CEO Michael Seifert said Trump Jr., the son of President-elect Donald Trump, is focused on creating a \"cancel-proof\" economy. He also touted Trump Jr.'s business experience and highlighted his \"leadership\" in the shooting sports industry. PSQ also announced that financial industry executive Willie Langston, a partner with Houston, Texas-based asset management and advisory firm Corient, will join its board. PSQ in November reported a third-quarter net loss of $13.1 million on revenue of $6.5 million. The company's stock on Monday surged $5.57 to end at $7.63, more than tripling PSQ's market value from around $72 million on Monday to more than $265 million by the close of trade on Tuesday.","summary":"PublicSquare, which describes itself as catering to \"patriotic Americans,\" is adding the son of President-elect Donald Trump Jr. to its board.","url":"https://www.cbsnews.com/news/donald-trump-jr-publicsquare-psq-stock-price/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2023/11/13/0cf332b5-55bf-40cd-8441-d416fd240985/thumbnail/1200x630/981731218af6250c502bd8cbadc0fd18/cbsn-fusion-donald-trump-jr-to-testify-again-in-civil-fraud-trial-this-time-as-defense-witness-thumbnail-2446921-","video":null,"publish_date":"2024-12-03 23:35:33","author":"Alain Sherter","authors":["Alain Sherter"],"language":"en","category":"politics","source_country":"us","sentiment":0.359},{"id":270156500,"title":"Rahm Emanuel, former Chicago Mayor and current US Ambassador to Japan, remains uncertain about his future plans as he expresses dissatisfaction with the Democratic Party after the recent election.","text":"CHICAGO (WLS) — U.S. Ambassador Rahm Emanuel is back home in Chicago, with a very blunt assessment of the election.\n\nBut, he was also very coy about his own future after his time in Japan ends next year.\n\nABC7 Chicago is now streaming 24/7. Click here to watch\n\nABC7 Chicago political reporter Craig Wall sat down with him for a one-on-one interview, during which Emanuel had some tough words for the Democratic Party.\n\nFormer Mayor Emanuel came back to Chicago to celebrate Thanksgiving with his family over the holiday weekend.\n\nBut, the results of the presidential election were nothing for the lifelong Democrat to be thankful for. He’s not pulling punches in assessing what went wrong.\n\nEmanuel, a self-described political junkie, had a lot to say about the outcome of the election.\n\nWhen asked if he was surprised by the results, Emanuel said “yes and no.”\n\n“That’s the honest truth. I don’t know if my head was one place, my heart was another place,” he said.\n\nRELATED: IL Dem Rep. Casten introduces new resolution to force Ethics Committee to release Gaetz report\n\nBut, his frustrations with Kamala Harris’ campaign and the state of the Democratic Party were in many other places.\n\nHe said the campaign’s messaging was wrong. Former two-term Presidents Bill Clinton and Barack Obama were pushed aside, and the Democratic Party became the establishment that voters rejected, he said.\n\n“We, as a party, go from the anti-establishment, in COVID, wear the coat of the establishment: Listen, put a mask on, close the schools, shut this down. And we become the establishment,” Emanuel said.\n\nHe said Donald Trump’s victory was a vote against the establishment instead of a vote for change. And it should be a wake-up call for the Democratic Party, which he said is in disarray.\n\n“And here’s what I would say to the Democrats: You have a YETI cup? Sit down and shut up. Stop telling people how to live their lives. Start listening to them a little more,” Emanuel said.\n\nEmanuel will tender his resignation as ambassador to Japan when Trump takes office. He has served in that position since March of 2022.\n\nWhen asked if he was interested in being chair of the Democratic National Committee, which has been speculated in some political circles, Emanuel said, “That’s not what I was thinking about for my life.”\n\n“But, I think we’re at a very crucial point, and there’s a lot of different ways, doesn’t have to be party chairman to contribute to the development and kind of ‘regirding’ the party for the future because we are on our back heels right now,” he said.\n\nEmanuel also brushed off questions about whether he wants to run for Senate or governor. But, he made it clear he is not done with public service. When he gets back in six weeks, he will take a break, and then evaluate the possibilities.","summary":"CHICAGO (WLS) &#8212; U.S. Ambassador Rahm Emanuel is back home in Chicago,&#8230;","url":"https://internewscast.com/news/us/rahm-emanuel-former-chicago-mayor-and-current-us-ambassador-to-japan-remains-uncertain-about-his-future-plans-as-he-expresses-dissatisfaction-with-the-democratic-party-after-the-recent-election/","image":"https://internewscast.com/wp-content/uploads/2024/12/rewrite-this-title-US-Ambassador-to-Japan-former-Chicago-Mayor-800x430.jpg","video":null,"publish_date":"2024-12-03 23:34:32","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":270155278,"title":"Even These Partisan Mainstream Media Journalists Are Calling Biden Out For Pardoning Hunter N2648567","text":"Chris Cillizza, formerly of CNN, reacted quite strongly on X on Sunday and also put out a video message. \n\nAs an animated Cillizza reminded in just one of his posts, Biden \"spent much of the last year through spokesmen people and himself, saying that there was no way he was going to pardon Hunter Biden, that the justice system had to work its will, that he did not want to interfere, because he was not like Donald Trump.\" \n\nCillizza also posted on X that this pardon \"will have echoes – backward and forward,\" and that \"it taints [Biden's] legacy,\" especially with the \"layup\" it gives Republicans.\n\nA colossally selfish decision that will allow every Trump supporter to note that Democrats say one thing and do another https://t.co/vvQ8GkC14l— Chris Cillizza (@ChrisCillizza) December 2, 2024\n\nJoe Biden's pardon of his son, Hunter, will have echoes -- backward and forward.Backward because it taints his legacy. It will be in the 1st or 2nd paragraph of his obit.Forward because now every single Republican will have a layup when it comes to defending Trump’s… pic.twitter.com/wLB4CwgrCF— Chris Cillizza (@ChrisCillizza) December 2, 2024\n\nOn Monday, Cillizza also spoke with NBC News' Chuck Todd, who was similarly animated in expressing what a mistake Biden had made. Todd shared he \"followed the Hunter Biden trial very closely.\" He especially expressed anger for the transcript of Hallie Biden, the widow of Hunter Biden's brother, Beau, noting \"essentially [Hunter] turned into a crack addict,\" which was going on in 2017 and 2018. Todd also went on to throw Joe Biden and Jill Biden right under the bus for how they handled the situation, noting they \"were so concerned about their family, that they decided to run for president,\" with Cillizza concurring.\n\n\"So when you talk about the word 'selfish,'\" Todd continued, using a term Cillizza had used at length, \"it's almost like the word doesn't, I mean, it’s almost like the word doesn’t, I mean, their decision to run for president put the entire Democratic Party and the United States of America in the position that it’s in now.\"\n\nI talk to @chucktodd every Monday for my newsletter.It's always a good conversation.But, I thought Chuck NAILED it today on why the Hunter Biden trial really mattered when thinking about the Biden presidency and the pardon.Watch the whole thing at the link in my bio. pic.twitter.com/FzBUBKM1cI— Chris Cillizza (@ChrisCillizza) December 3, 2024\n\nSuch admissions, and from someone who covered so much for the Biden-Harris administration as Todd did, as Sister Toldjah reminded at our sister site of RedState, is certainly telling. It also reveals what many of us knew all along, though, that Biden and Jean-Pierre have a penchant for lying to the American people, and being so dismissive about it.\n\nCNN's Jake Tapper is another example. He's been skeptical of the Biden-Harris administration before, notably when he was questioning Jean-Pierre about Biden's fitness, or lack thereof, in August of last year. He's also been a defender, though, and has gone after President-elect Donald Trump and plenty of other Republicans, including and especially on the selective outrage front, when he could be going after Democrats. \n\nDuring Monday's episode of \"The Lead,\" Tapper addressed common arguments against Biden issuing a pardon. He reminded viewers how Biden and the White House have claimed for months that this was something the president supposedly wouldn't do, and called the pardon a \"stunning reversal\" from those assurances.\n\nTapper also revealed another potentially damning point, which is that \"sources told CNN today that President Biden did not go through the office of the pardon attorney at the Justice Department, as is standard. In fact, President Biden has been discussing pardoning his son with top aides since Hunter's conviction in June, according to NBC News reporting, while at the same time, the president was telling the rest of us this.\"\n\nThe segment played plenty of clips about the matter, including Biden and Jean-Pierre offering assurances, though it's also worth focusing even more so on Jean-Pierre, who has once more lied when she claimed that the president made such a decision over the weekend, and actually expects us to believe that. \n\nSurprisingly, Tapper did acknowledge that \"President Biden lying about this, of course, makes others in his administration and allies either credulous or complicit, including White House Press Secretary Karine Jean-Pierre, who's been saying this for months to the American people,\" as a clip of her past comments were played. In such a clip, and during countless other daily press briefings, Jean-Pierre's smugness in telling what turned out to be a lie was certainly shown through. She even laughed at the reporter who asked such a question.\"We've been asked that question multiple times. Our answer stands, which is no,\" Jean-Pierre said in another exchange, with quite a nasty tone.\"The answer does not stand,\" Tapper reminded after playing the clip, adding, \"There was, of course, a political benefit to President Biden and his allies telling this lie. In June, when Hunter Biden was found guilty on three felony gun charges, his father, the president, was still running for reelection against former President Donald Trump, and Democrats and progressives saw this as an opportunity to contrast the current and former president.\"\n\nTapper then played clips of Andrew Weissman, their legal analyst, as well as Rep. Dan Goldman (D-NY), whom the network has continuously mocked for also claiming that Biden wouldn't pardon his son. \n\nThat's when Tapper got into it even further about how Biden lied. \"Beyond the pardon and beyond the lie about the pardon, President Biden is doing what he claimed he would not do. He is undermining his own Justice Department,\" he pointed out, taking issue with the statement Biden issued, especially when it comes to supposed \"political pressure on the pressure\" he lamented. \n\nShockingly enough, Tapper went on to more accurately describe the handling of Hunter's shoddy plea deal, noting, \"The plea deal collapsed in part because Hunter Biden wanted more immunity than prosecutors were offering. And now it's President Biden, not his successor, President-elect Trump, who is blaming his own Department of Justice for being politicized, saying, quote, 'I also believe raw politics has infected this process, and it led to a miscarriage of justice,' unquote.\"\n\nPresident Joe Biden pardons Hunter Biden pic.twitter.com/sS7nBhSKFG— Townhall.com (@townhallcom) December 2, 2024\n\nIt's especially rich for Biden, or anyone else in the Biden-Harris administration to lament how the \"process\" has supposedly been \"infected\" by \"raw politics\" when the Biden-Harris Department of Justice (DOJ) has done just that by going after their political enemies, including but not limited to Trump. \n\nTapper also pointed out how Special Counsel David Weiss has responded, noting that he \"pushed back on the president's justification--justification for pardoning his son in a court filing, quote, there was none and never has been any evidence of vindictive or selective prosecution in this case, Weiss wrote.\"\n\nThe opening segment also focused on Democrats taking issue with Biden's move to pardon Hunter, including Sens. Gary Peters (MI) and Michael Bennet (CO), though they're certainly not the only ones. As Townhall has been covering, Democrats have been thrust into chaos and disarray.\n\nTapper also aptly responded to the argument that Biden was just trying to do right by his son. \"And look, while we all can sympathize with the president, who has already lost two children under tragic circumstances, and surely most of us would help our kids in any way we possibly could. It is also true that today's act further portrays the criminal justice system as one that helps the well-connected. Prisons are full of people who have made bad choices, even broken laws, because of their addictions. It's too bad for them that they have the wrong last name,\" he said as a fitting way to end his opening.\n\nThe show's X account even posted such a clip, which was the day's monologue. \n\nDemocrats openly criticize Biden's reversal to pardon sonWatch the video here: https://t.co/2hPEgpdODL pic.twitter.com/rr5yS2yykY— The Lead CNN (@TheLeadCNN) December 2, 2024\n\nAs an added bonus, there's also Jon Stewart, who, during Monday night's episode of \"The Daily Show,\" focused on a particularly shady part of the pardon, which is that it covered 11 years. \n\nAs he noted, \"11 years is a very specific and not rounded amount of time.\"\n\nEven Jon Stewart admits that Hunter's pardon stretching back 11 years is quite fishy:Jon Stewart: \"Faith in the rule of law: Finally, Democrats have a moral perch for which they can judge without shame hypocrisy or nuance.\"Jessica Dean: \"Breaking news, President Biden has… pic.twitter.com/NHwKEL7dLr— Eric Abbenante (@EricAbbenante) December 3, 2024","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/03/even-these-partisan-mainstream-media-journalists-are-calling-biden-out-for-pardoning-hunter-n2648567","image":"https://media.townhall.com/cdn/hodl/2024/337/09a250b3-7c2d-418e-8222-e06f3502ac88.png","video":null,"publish_date":"2024-12-03 23:33:30","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","source_country":"us","sentiment":-0.212},{"id":270156552,"title":"Trump DEA pick bows out just days after being nominated","text":"On Saturday, Donald Trump tapped Hillsborough County Sheriff Chad Chronister to lead the U.S. Drug Enforcement Agency (DEA), an offer that Chronister initially accepted and, shortly after, celebrated with a post to social media, writing, “I am deeply humbled by this opportunity to serve our nation.” But he appears to have changed his mind.\n\nOn Tuesday, Chronister issued a new statement announcing that he's decided to decline Trump's offer after the \"gravity\" of the job set it.\n\n\"To have been nominated by President-Elect Donald Trump to serve as Administrator of the Drug Enforcement Administration is the honor of a lifetime,\" Chronister wrote in a post to X. \"Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration. There is more work to be done for the citizens of Hillsborough County and a lot of initiatives I am committed to fulfilling. I sincerely appreciate the nomination, outpouring of support by the American people, and look forward to continuing my service as Sheriff of Hillsborough County.\"\n\nAs USA Today highlights in their coverage of Chronister's decision, this is the second Trump administration pick to withdraw, with the first being former Republican U.S. Rep. Matt Gaetz, who withdrew himself from consideration as Trump’s pick to lead the Department of Justice amid sexual misconduct claims.","summary":"Florida Sheriff Chad Chronister said that the \"gravity\" of the job set in, prompting him to decline Trump's offer","url":"https://www.salon.com/2024/12/03/dea-pick-bows-out-just-days-after-being-nominated/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2023/07/drug_enforcement_administration_dea_officer_1126514780.jpg ?>","video":null,"publish_date":"2024-12-03 23:31:27","author":"Kelly McClure","authors":["Kelly McClure"],"language":"en","source_country":"US","sentiment":0.144},{"id":270156510,"title":"Cabinet Nominee Withdraws After Controversial Announcement Amidst Strong Reaction","text":"Donald Trump’s pick to lead the Drug Enforcement Administration shockingly withdrew from consideration after MAGA outrage.\n\nChad Chronister, the Sheriff of Hillborough County, Florida, sparked controversy for ordering the arrest of a pastor for holding church services in the height of the COVID pandemic. \n\nMAGA ally Rep. Thomas Massie, R-Ky., who was leading the charge to get him to step aside, said he simply ‘lost his mind.’ \n\n‘This sheriff ordered the arrest of a pastor for holding services during the COVID panic. He was tapped by Trump to head the DEA. Glad to see him withdraw from consideration,’ he stated.\n\n‘Next time politicians lose their ever-lovin minds, he can redeem himself by following the Constitution.’\n\nConservative Liz Wheeler called him a ‘COVID tyrant’ who ‘abused his power and is unfit to lead the DEA’ and urged him to withdraw.\n\nChronister confirmed his decision to step aside in a post on X, but didn’t disclose what prompted him to exit from consideration.\n\nThe sheriff would have worked closely with another controversial Trump pick, RFK Jr., who was tapped to lead the Department of Health and Human Services.\n\nChronister became the second Cabinet pick to pull out of the Cabinet, following former Rep. Matt Gaetz who withdrew after a sex scandal started plaguing his confirmation chances.\n\nGaetz, a unequivocal supporter of Trump, had earned respect from the president-elect despite the salacious allegations that followed him. \n\nIn his statement reacting to the decision, Trump said he looked forward to Gaetz’s future career.\n\n‘Matt has a wonderful future, and I look forward to watching all of the great things he will do!’ he wrote.\n\nTrump hasn’t yet commented on Chronister’s sudden resignation.\n\n‘To have been nominated by President-Elect to serve as Administrator of the Drug Enforcement Administration is the honor of a lifetime,’ Chronister said in a statement on Tuesday. \n\n‘Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration,’ Chronister went on.\n\n‘There is more work to be done for the citizens of Hillsborough County and a lot of initiatives I am committed to fulfilling. I sincerely appreciate the nomination, outpouring of support by the American people, and look forward to continuing my service as Sheriff of Hillsborough County.’\n\nChronister ordered the arrest of Tampa Bay pastor Rodney Howard-Browne in March 2020.\n\nHe had allegedly violated a ‘safer-at-home’ order for the county.\n\n‘We received an anonymous tip that Dr. Rodney Howard-Browne refused a request to temporarily stop holding large gatherings at his church,’ Chronister said during a press event to announce the arrest. \n\n‘And instead, he was encouraging his large congregation to meet at his church.’\n\nHe went on to call it a ‘reckless disregard for public safety.’\n\nThe pastor ended up endorsing Chronister’s bid for the DEA position in a stunning reversal. \n\n‘All good, the sheriff and I are friends, he has being doing an amazing job in Hillsborough County,’ he said on X. \n\n‘I believe He and Pam Bondi will do an excellent job of cleaning up the place.’\n\nBut it wasn’t enough to save Chronister’s chances at being Senate confirmed. \n\nHis shocking exit came only days after his nomination by the president-elect who praised his numerous accolades. \n\n‘I am pleased to nominate Sheriff Chad Chronister for Administrator of the Drug Enforcement Agency (DEA),’ Trump wrote in a post on Truth Social on November 30.\n\n‘For over 32 years, Sheriff Chad Chronister has served the Hillsborough County Sheriff’s Office, and received countless commendations and awards for keeping his community SAFE.’\n\n‘As DEA Administrator, Chad will work with our great Attorney General, Pam Bondi, to secure the Border, stop the flow of Fentanyl, and other Illegal Drugs, across the Southern Border, and SAVE LIVES,’ Trump stated. \n\nBondi was nominated to fill the position of attorney general after Gaetz’s exit.\n\nShe is the former attorney general of Florida and has been on Capitol Hill this week to meet with senators and shore up support for her bid.","summary":"Donald Trump&#8217;s pick to lead the Drug Enforcement Administration shockingly withdrew from&#8230;","url":"https://internewscast.com/news/us/cabinet-nominee-withdraws-after-controversial-announcement-amidst-strong-reaction/","image":"https://internewscast.com/wp-content/uploads/2024/12/rewrite-this-title-Trump-Cabinet-pick-makes-shocking-announcement-to-800x430.jpg","video":null,"publish_date":"2024-12-03 23:30:20","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.043},{"id":270160012,"title":"With people still living in tents, FEMA begins exodus from Western North Carolina","text":"The Federal Emergency Management Agency has closed four Western North Carolina disaster recovery centers and is tearing down its employee housing village west of Asheville while nearly 5,200 storm-displaced households are still living in hotels with no other shelter options.\n\n The exodus of FEMA staff from the region comes on the heels of the late \n November withdrawal of the National Guard and the pullout of U.S. Army XVIII Airborne Corps service members in late October.\n\n Some local residents say they feel abandoned by the federal and state governments. Storm victim advocates say a massive crisis is brewing with more than 5,000 families slated to lose FEMA hotel vouchers as Christmas approaches.\n\n The landscape of the devastated region is dotted with tents that serve as the only shelter for some families who are forced to brave overnight temperatures that recently dipped into the teens. Some residents are unable to live in their damaged homes, and even more had their homes and property completely swept away by flooding and violent mudslides.\n\n 'It is horrific what’s going on there.'\n\n The pace of federal housing help is far outstripped by the need. Only 27 FEMA mobile homes and trailers have been delivered to Western North Carolina families whose homes were destroyed in the devastating flood spurred by Hurricane Helene in late September. A FEMA official said victims must file for storm aid by Jan. 7.\n\n A FEMA official told Blaze News that 5,179 households are still using FEMA hotel vouchers and have no long-term housing available. The agency has helped 4,950 households find “suitable longer-term housing” as part of its Transitional Sheltering Assistance program.\n\n “As of Nov. 25, 5,179 households remain checked in to hotels, and we will continue to work with these families to assist them in determining their long-term solution,” a FEMA official said in an email to Blaze News. The program typically provides 60 days in the \"immediate aftermath of a disaster,\" the official said.\n\n “Unfortunately, this program cannot continue indefinitely,” the FEMA official said, “and typically partnering hotels will reduce their availability to the program as business patterns resume.”\n\nFEMA housing village packed up\n\n That news is no comfort to storm victims who watched during Thanksgiving week as FEMA dismantled its employee housing village in Candler, N.C., and closed four disaster recovery centers in Western North Carolina.\n\nCotton Logistics, a federal contractor based in Katy, Texas, began tearing down the FEMA employee housing village in Candler before Thanksgiving, according to local relief volunteers who visited the site.\n\n Cotton provides turnkey housing solutions for FEMA staff and contractors who respond to disasters around the nation, according to the company’s website. The company supplies housing units, laundry trailers, dining facilities, restrooms, showers, and other support services.\n\n In a Nov. 22 news release, FEMA said it was closing disaster recovery centers in Sparta, Dallas, Sylva, and Old Fort, N.C. Storm survivors can visit any FEMA assistance center or use the \n agency's website to register for help.\n\nA responder housing village was built in Candler, N.C., to accommodate FEMA staff and free up area hotel rooms for use by storm survivors. The site is now closed down and abandoned.Photo by Steve Baker/Blaze News\n\n The “responder village” site in Candler was one of several built in October with single-unit housing for FEMA employees and federal contractors. The sites were built to allow as much hotel space as possible to be dedicated to storm survivors.\n\n The Candler site offered lodging, showers, medical care, dining, and electrical service, Josh Wert, director of FEMA’s responder support branch, told Blaze News on Oct. 18.\n\n In mid-October, FEMA had more than 1,400 staff in the region. Blaze News reached out to Wert for more details on the closing of the Candler site but did not get a reply by press time.\n\n During Thanksgiving week, local residents who noticed the Candler site was abandoned found pallets of food left behind that were apparently slated to be thrown away. Volunteers loaded the food onto trailers and distributed it to needy Western North Carolina families.\n\n It appears that in some cases, FEMA staff are living out of mobile housing units on the same site as the disaster recovery center where they work. A Bunkhouse trailer is parked near the Asheville disaster recovery center.\n\n Blaze News asked the FEMA News Desk about the closing of the Candler site but did not receive a reply by press time.\n\nBridging the gap\n\n Volunteers and charitable organizations are stepping up in an attempt to fill the huge void between the urgent housing demand and the small dent made to date through placement of FEMA mobile homes and trailers. Solutions being put in place include donated RVs and tiny houses that allow families to remain on their properties.\n\n Groups such as Operation Shelter and EmergencyRV.org were busy during the long Thanksgiving weekend delivering RVs to bring some of the families in from the bitter cold of their wind-battered tents.\n\n Woody Faircloth, founder of EmergencyRV.org, said as of Dec. 1, his charity has delivered 56 free RVs to Western North Carolina families. That’s more than double the number of units placed in the field by FEMA.\n\nSampson Hickox of Operation Shelter loads supplies to be used to stock an RV being donated to a Western North Carolina family left homeless by Hurricane Helene, on Nov. 29, 2024.Photo by Erin Derham\n\n There are still more than 700 families registered with \n EmergencyRV.org in need of shelter, he said.\n\n “It’s really sad,” Faircloth said after spending five days delivering RVs in Western North Carolina over the Thanksgiving holiday, “and it’s going to get worse before it gets better with all these hotel vouchers expiring.\n\n “Nobody, not a single person we’ve talked to, had any kind of flood insurance, and so all their insurance claims are denied,” Faircloth said. “I mean, it is horrific what’s going on there.”\n\n Matt Van Swol, an Asheville resident who helps to coordinate and publicize the local disaster response, said he does not understand why FEMA is downsizing when the region is still badly hurting.\n\n “We are literally driving in an RV from Utah this week for a family of 6,” Van Swol told Blaze News. “Why are they [FEMA] leaving? The work hasn’t even begun.”\n\n Cassie Clark, a North Carolina storm victim advocate with more than 15,000 followers on X, castigated the government for its response to Helene.\n\n “What is happening in Western North Carolina is a disgrace, and it falls on the heads of our federal government, our state government, our local government,” Clark said in a video posted to X. “It’s a disgrace, and I’m not going to pretend otherwise.”\n\n North Carolina Gov. Roy Cooper, a Democrat, in late October said the state was leading an “unprecedented response and recovery effort.” The overall government response in North Carolina pales, however, compared to other storms over the past quarter-century.\n\n The National Guard dispatched more than 51,000 Guardsmen to rescue and relief operations after Hurricane Katrina struck the Gulf coast in August 2005. It was the largest domestic Guard deployment in U.S. history, according to the National Guard's \n online Katrina timeline.\n\n National Guard, U.S. Army, and U.S. Air Force personnel assigned to Hurricane Helene relief \n in North Carolina totaled more than 6,200 over the course of seven weeks in fall 2024. The last of those service members pulled out the week before Thanksgiving.\n\n The Department of Defense committed more than 16,000 personnel after Hurricane Harvey in 2017. Some 17,000 troops were deployed to Puerto Rico and the U.S. Virgin Islands after Hurricanes Maria and Irma later that same year. The U.S. military committed 17,000 troops to Haiti after a 2010 earthquake and sent 15,000 to Indonesia after a tsunami in 2005.\n\n 'Support from the federal and even state government is very, very thin, and that should not be the case.'\n\n Erin Derham, an Asheville filmmaker, accompanied local contractor Sampson Hickox from \n Operation Shelter to stock up and deliver a donated RV to a mother with a 1-year-old baby and five other children who had been living in a tent for two months.\n\n The RV was donated by a member of Crestview Baptist Church in Canton, N.C. Operation Shelter stocked it with food, baby supplies, and cleaning products before turning it over to the family.\n\n “It got down below freezing as we dropped off the last camper tonight,” Derham posted on X Nov. 29. “I have never received so many hugs in my life. Families are sleeping warm.”\n\n Derham connects with families in need of shelter, then coordinates with Hickox to deliver donated RVs.\n\nVolunteers from Operation Shelter deliver and set up a donated RV for a family in Western North Carolina on Nov. 29, 2024.Photos by Erin Derham\n\n “He and I deliver the RVs together,” Derham told Blaze News. “He’s a firefighter and builder. Truly the heart of our team. We have an RV going to a young family this Friday. Sampson got his best friend to drive to Utah to pick up the donated RV.”\n\n Operation Shelter is run by \n Shawn Hendrix, who pledged on social media Dec. 2 to bring gifts on Christmas Eve to children at the Black Mountain Home in Black Mountain, N.C. “We will not let this storm take Christmas from these kids,” Hendrix wrote on X.\n\n Faircloth, who drove a large RV from Colorado to Western North Carolina just before Thanksgiving, said it is difficult to even describe the massive damage done by the unprecedented rains and high-velocity mudslides that devastated the region.\n\n “Just the scope of it is so large,” Faircloth said. “It’s every creek, every river, and anything near it is either totally destroyed or has been completely submerged by water. I mean, it is unbelievable. It is breathtaking, to be honest.”\n\n 'We will never forget about you.'\n\n Debris still lodged high in trees gives testimony to the deadly 35- to 40-foot walls of water, mud, and building materials that swept down the mountains during Helene. Faircloth said he saw sheet metal dangling from a tree 40 feet off the ground. “I've never seen anything like this,” he said.\n\n Van Swol said people on social media have accused him of being overly dramatic about damage and debris conditions on the ground, so he took drone video to prove his point.\n\n “I just went out and shot probably a half-hour worth of video of debris swinging from trees,” Van Swol said. “Eighteen-wheelers upside down in the French Broad River.\n\nDebris remains strewn across the landscape and on the banks of the French Broad River near Asheville, N.C.Photo by Matt Van Swol\n\n “The amount of debris strewn along the riverbanks of the French Broad River is eye-watering,” he said. “I’ve seen the same tanker trucks and shipping containers in the water just floating there for weeks.”\n\n Just before the Nov. 5 presidential election, a former assistant secretary of the U.S. Army \n told Blaze News that the military should have been doing much more in terms of building shelters, stringing temporary power in remote areas, rebuilding washed-out roads, and more.\n\n Casey Wardynski, assistant secretary of the Army for manpower and Reserve affairs under former President Donald J. Trump, said the failing response by the Biden-Harris administration was “pathetic.”\n\n “I know the response one would’ve seen with Trump, and I know the sense of urgency that you would’ve had with Trump,” Wardynski said.\n\n Some 142,000 Guardsmen were activated to fight wildfires in 2022, and 62,000 military troops responded to Hurricane Ivan, Wardynski said. With Hurricane Helene in North Carolina, “support from the federal and even state government is very, very thin, and that should not be the case.”\n\n President Trump visited Swannanoa, N.C., on Oct. 21, pledging to bring a much more robust humanitarian relief effort than that put forth by the Biden-Harris administration.\n\n “We will never forget about you,” Trump pledged. “We’re going to be working with you for a long time to come to get it back together.”\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"The Federal Emergency Management Agency has closed four Western North Carolina disaster recovery centers and is tearing down its employee housing village west of Asheville while nearly 5,200 storm-displaced households are still living in hotels with no other shelter options.\n\n\n\n\tThe exodus of FEMA staff from the region comes on the heels of the late \n\tNovember withdrawal of the National Guard and the pullout of U.S. Army XVIII Airborne Corps service members in late October.\n\n\n\n\tSome local residents say they feel abandoned by the federal and state governments. Storm victim advocates say a massive crisis is brewing with more than 5,000 families slated to lose FEMA hotel vouchers as Christmas approaches.\n\n\n\n\tThe landscape of the devastated region is dotted with tents that serve as the only shelter for some families who are forced to brave overnight temperatures that recently dipped into the teens. Some residents are unable to live in their damaged homes, and even more had their homes and property completely swep","url":"https://www.theblaze.com/news/with-people-still-living-in-tents-fema-abandons-them-to-the-mountains-of-western-north-carolina","image":"https://www.theblaze.com/media-library/with-people-still-living-in-tents-fema-abandons-them-to-the-mountains-of-western-north-carolina.jpg?id=55123589&width=1200&height=600&coordinates=0%2C74%2C0%2C74","video":null,"publish_date":"2024-12-03 23:30:00","author":"Joseph M. Hanneman,Steve Baker","authors":["Joseph M. Hanneman","Steve Baker"],"language":"en","source_country":"US","sentiment":-0.17},{"id":270160006,"title":"Newsweek falls for parody account and gets mocked into oblivion on social media","text":"Newsweek faced fierce mockery on social media after it included a quote from a parody account on social media and had to issue a correction.\n\n The outlet published an article entitled \"How Republicans And Democrats Reacted to Surprise Hunter Biden Pardon\" about President Joe Biden's sweeping pardon issued for his son on Sunday. Among one of the quotes was one falsely attributed to Parik Patel, who was identified as the father of Kash Patel, the nominee to head the Federal Bureau of Investigation.\n\n 'Absolutely humiliating for you, yet not in the least bit surprising.'\n\n \"Joe Biden was so worried about MY SON Kashu becoming director of the FBI that he decided to pardon his so Hunter Biden of all his crimes,\" wrote Dr. Parik Patel, BA, CFA, ACCA Esq.\n\n However, the account was actually a parody account, and Newsweek was immediately ridiculed for failing to confirm the account's identity.\n\n \"Newsweek quoting Kash Patel's father, despite the account they cite not only being a super obvious parody but also clearly marked as such, exemplifies peak 'journalism,'\" replied author Hans Mahncke. \n\n \"WTF! @ParikPatelCFA is a parody account, not @Kash_Patel 's father, you idiots. Legacy media is a joke!\" responded the India Policy account.\n\n \"Such ‘quality’ journalism, can’t even figure out an obvious parody account that literally says ‘parody’ in the bio. Absolutely humiliating for you, yet not in the least bit surprising,\" read another reply.\n\n Newsweek later deleted the quote and issued a correction.\n\n The parody account responded to the embarrassing incident and thanked the outlet.\n\n \"Thank you @Newsweek for amplifying my message - Hunter Biden was pardoned just in time before my son Kashu could prosecute him for his crimes,\" the account posted.\n\nIn October, Newsweek was similarly mocked when it characterized a publicity stunt at McDonald's by President-elect Donald Trump as \"staged.\" \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"Newsweek faced fierce mockery on social media after it included a quote from a parody account on social media and had to issue a correction.\n\n\n\n\tThe outlet published an article entitled \"How Republicans And Democrats Reacted to Surprise Hunter Biden Pardon\" about President Joe Biden's sweeping pardon issued for his son on Sunday. Among one of the quotes was one falsely attributed to Parik Patel, who was identified as the father of Kash Patel, the nominee to head the Federal Bureau of Investigation.\n\n\n\n\t'Absolutely humiliating for you, yet not in the least bit surprising.'\n\n\n\n\t\"Joe Biden was so worried about MY SON Kashu becoming director of the FBI that he decided to pardon his so Hunter Biden of all his crimes,\" wrote Dr. Parik Patel, BA, CFA, ACCA Esq.\n\n\n\n\tHowever, the account was actually a parody account, and Newsweek was immediately ridiculed for failing to confirm the account's identity.\n\n\n\n\t\"Newsweek quoting Kash Patel's father, despite the account they cite not only being a super obvious parody but al","url":"https://www.theblaze.com/news/newsweek-parody-mocked-patel-fbi","image":"https://www.theblaze.com/media-library/image.jpg?id=55132579&width=1200&height=600&coordinates=0%2C111%2C0%2C112","video":null,"publish_date":"2024-12-03 23:30:00","author":"Blaze News","authors":["Blaze News"],"language":"en","category":"politics","source_country":"US","sentiment":-0.434},{"id":270155306,"title":"‘F**ked Up’: Pete Hegseth Admitted to Five Affairs in First Marriage","text":"Pete Hegseth, Donald Trump’s controversial pick for secretary of defense, admitted to his first wife that he had cheated on her five times, calling himself “a f--ked up individual,” as their relationship crumbled amid his infidelity, Vanity Fair has reported.\n\nWhile reports already existed of Hegseth’s penchant for adultery—including a scathing letter published last week by The New York Times in which his own mother accused him of mistreating women—unnamed sources close to the former couple have now shared with Vanity Fair details of the former Fox News host’s tumultuous first marriage, which initially had a storybook beginning. \n\nHegseth and Meredith Schwarz were high-school sweethearts in Minnesota (reportedly voted “most likely to marry” by their 1999 graduating class), who dated long-distance while he was at Princeton and she at Barnard.\n\nAfter graduating college, the two married. But Hegseth’s decision, in 2005, to volunteer for a tour of duty in Iraq meant they were again apart. This didn’t change even after Hegseth returned from overseas—he led the political advocacy group Vets for Freedom in Washington, D.C., while Schwarz pursued an investment banking career at JPMorgan in New York City. \n\nThe sources said that Hegseth’s political aspirations were already apparent, as were his far-right convictions.\n\n“We would argue about women’s reproductive rights,” one person told Vanity Fair. “He had some regressive views on birth control. His position was basically, if you got pregnant it was your fault.”\n\nWhile the couple remained together despite frequently being geographically apart, Hegseth already displayed behavior that troubled the two’s friends. Two sources told Vanity Fair that, on one occasion, Hegseth went out for a night of drinking with his college friends, but didn’t return, prompting Schwarz to call hospitals. He returned in the morning and castigated his wife for fretting about his absence. \n\nA representative for Hegseth did not immediately respond to The Daily Beast’s request for comment on Vanity Fair’s report. When sent a “detailed list of questions” from Vanity Fair, Hegseth’s lawyer, Timothy Parlatore, did not respond “and instead provided a statement that impugned my record as a reporter,” author Gabriel Sherman wrote.\n\nIn spring 2008, Hegseth reportedly told Schwarz that he wanted to move back to Minnesota with her, where he would pursue a graduate degree at the University of Minnesota. Eager to be reunited with her husband, Schwarz quit her finance job, sold her apartment, and moved to Minneapolis. \n\nBut Hegseth didn’t come. He waffled on his plans, sources said, offering different stories to Schwarz about what was going on. Meanwhile, she suffered. \n\n“In her journal she was begging God to help her figure out what was happening,” a friend of Schwarz’s told Vanity Fair. \n\nIn November of that year, Hegseth took a trip to Minnesota (wearing his army uniform) and finally admitted his infidelity to Schwarz. She was crushed, the sources said, and Hegseth himself seemed racked by guilt. \n\nSchwarz’s younger brother called Hegseth the next day for an hours-long conversation, a source familiar with the situation told Vanity Fair.\n\n“Pete said he no longer believed in God and family values,” the source said. “He claimed he no longer wanted to seek the limelight. He said, and this quote is as clear as day, ‘I’m a f--ked up individual.’”\n\nAlthough Schwarz still tried to make the marriage work—she loved him—it didn’t last long. She noticed charges for hotel rooms on her credit card that she didn’t recognize. \n\nConfronted about it, Hegseth couldn’t give a straight answer, sources said, but Schwarz would later learn that the room was for him and Samantha Deering, a woman who also worked at Vets for Freedom whom Hegseth would later marry. \n\nHegseth reportedly admitted to Schwarz that he had had five affairs while the two were married, which was when she decided to end their communication and divorce him. \n\nHe apparently didn’t learn his lesson—in 2017, he had a baby with Fox News producer Jennifer Rauchet, who he began dating while still married to Deering. When she found out, she too divorced Hegseth. He and Rauchet married in 2019, remaining together today. \n\nLess than two months before that the child was born, Hegseth allegedly committed sexual assault against another woman, although he has denied this accusation, saying it was consensual sex. \n\nAlthough Trump—who was reportedly blindsided by the accusation of sexual assault against Hegseth—has so far stood by his nominee to head the Department of Defense, Hegseth will surely face an uphill battle before the Senate.","summary":"Tom WilliamsPete Hegseth, Donald Trump’s controversial pick for secretary of defense, admitted to his first wife that he had cheated on her five times, calling himself “a f--ked up individual,” as their relationship crumbled amid his infidelity, Vanity Fair has reported.\n\nWhile reports already existed of Hegseth’s penchant for adultery—including a scathing letter published last week by The New York Times in which his own mother accused him of mistreating women—unnamed sources close to the former couple have now shared with Vanity Fair details of the former Fox News host’s tumultuous first marriage, which initially had a storybook beginning. \n\nHegseth and Meredith Schwarz were high-school sweethearts in Minnesota (reportedly voted “most likely to marry” by their 1999 graduating class), who dated long-distance while he was at Princeton and she at Barnard.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/im-a-fked-up-individual-pete-hegseth-admitted-to-5-affairs-in-first-marriage-per-report/","image":"https://www.thedailybeast.com/resizer/v2/XIQGMP56RZCYTG4SYFWZWUXWU4.jpg?smart=true&auth=02e7f302a091e931dfe7d7f9bf938086acd16ed61701bba0dc2a9772b5b96842&width=1440&height=1080","video":null,"publish_date":"2024-12-03 23:28:52","author":"Liam Archacki","authors":["Liam Archacki"],"language":"en","source_country":"us","sentiment":-0.121},{"id":270153946,"title":"Trump Tariffs Asymmetric Risk Toronto Equity Investors","text":"Article content\n\nEquity investors in Toronto and New York face vastly different risks following U.S. president-elect Donald Trump’s threat to ramp up tariffs on cross-border trade to 25 per cent from previous expectations of 10 per cent.\n\nThere are 30 S&P/TSX Composite members that derive over half of their revenue from the U.S. with Boyd Group Services leading the list at 92 per cent, according to data compiled by Bloomberg. T-shirt and sweatshirt maker Gildan Activewear Inc. isn’t far behind at 90 per cent, and hydrovac company Badger Infrastructure books 89 per cent of its revenue from the U.S.\n\nThose are merely the names with most exposure to the U.S. economy. More than a third of the stocks on Canada’s main stocks benchmark have revenue booked in the U.S., including some of the country’s largest companies like Canadian National Railway Co., Barrick Gold Corp. and Cenovus Energy Inc. Some of country’s largest manufacturers, including auto parts company Magna International Inc. and watercraft maker BRP Inc., are doubly exposed — producing goods in both Mexico and Canada.\n\n“The risk at hand is not being fully appreciated,” said Jim Thorne, chief market strategist at Wellington-Altus Private Wealth Inc. in Toronto, who said his firm has been aggressively reducing exposure to Canadian equities.\n\nHe said that Canadian investors have a “legendary home bias” and may see their portfolios take a big hit if the tariffs are implemented broadly, as Trump has indicated. “When do the Canadian investors wake up?”\n\nU.S. investors, by contrast, have significantly less to fear in the form of retaliatory tariffs from Canada and the impact to revenue and earnings.\n\nIndeed, the S&P 500 Index member with the highest proportion of its revenue coming from Canada is Dayforce Inc. at just under 22 per cent, Bloomberg data show. Exxon Mobil Corp. and Costco Wholesale Corp. round out the top three with 16 per cent and 14 per cent of their revenue coming from Canada.\n\nThat level of exposure would not crack the top 60 in Canada. Indeed, Dayforce’s level of trade exposure across the 49th parallel between Canada and the U.S. would rank it 63rd, after fuel retailer Parkland Corp. and ahead of insurance provider Manulife Financial Corp.\n\nEven in the face of tariff threats, strategists have remained upbeat on the S&P/TSX Composite Index, which has now closed at a record 43 times this year. “Canada has moved in tandem with the U.S. as a decisive outperformer,” Tim Hayes, chief global investment strategist at Ned Davis Research, wrote in a research note Nov. 29. He added that even after the rally, Canadian stock “valuations are far better and it is less dependent on the sectors of the megacaps.”\n\nSome Toronto investors have expressed a preference for Canadian stocks that have large U.S. businesses, like insurance companies, rather than the industrial stocks that sell goods across the border.\n\nStill, in the face of super-sized tariffs, Scotiabank last week urged investors to “roll up their sleeves” and get granular on stock picking in Toronto.\n\n Share this Story : Trump tariffs pose asymmetric risk to Toronto equity investors Copy Link Email X Reddit Pinterest LinkedIn Tumblr","url":"https://financialpost.com/investing/trump-tariffs-asymmetric-risk-toronto-equity-investors","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/12/no1203tsx.jpg","video":null,"publish_date":"2024-12-03 23:27:30","author":null,"language":"en","source_country":"ca","sentiment":0.136},{"id":270153936,"title":"Trump Trudeau Art Irrational Deal","text":"What do you do?\n\nIt’s not a question asked on your usual hostage-negotiator’s matriculation exam but it’s the question of the hour in this country. The term “irrational psychopath” is not mine, by the way. It’s Andrew Coyne’s. Which is something. A leading mainstream columnist believes our current principal adversary is an irrational psychopath and both writes and says so on TV.\n\nI’m not saying that diagnosis is wrong. But, for one thing, it’s psychiatry, which seems at best an inexact science. And it’s psychiatry practised without a licence, which, not to give undo credit to professional guilds, probably isn’t wise. On the other hand, though the U.S. professional body of psychiatrists still has a rule, the Goldwater Rule, that you don’t diagnose people you haven’t personally examined. Since 2016, that rule has been broken by many different groups and individuals arguing the current president-elect suffers a number of, to put it mildly, “personality problems,” the most intriguing of which is perhaps “malignant narcissism.”\n\nIn 1964, when Republican Barry Goldwater ran against Lyndon Johnson, whose own personality was, you might say, Shakespearean, “social media” was neither a term nor a thing. Yet so many psychiatrists went public with their concerns about a candidate whose main “symptoms” were standard conservative policies, the professional body adopted its rule. But we no longer lack for insight into the thinking of presidential candidates. Joe Rogan did a three-hour interview with Donald Trump. How much more time would a psychiatrist require?","url":"https://financialpost.com/opinion/trump-trudeau-art-irrational-deal","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/12/no1202trudeau-trump.jpg","video":null,"publish_date":"2024-12-03 23:27:30","author":"William Watson","authors":["William Watson"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.261},{"id":270156858,"title":"‘Voters Spoke Overwhelmingly’: Sen. Cruz Calls for Confirming Patel, Other Trump Picks","text":"All of President-elect Donald Trump’s nominees for federal government posts will be confirmed, Sen. Ted Cruz said Tuesday after a conference with his fellow Senate Republicans. \n\n“I think Kash Patel will be confirmed, and I think the rest of them will be confirmed,” Cruz, R-Texas—a member of the Senate Judiciary Committee, which will vote on Patel, Trump’s pick for FBI director—told The Daily Signal.\n\nHowever, some Republicans have reportedly been noncommittal regarding Trump’s nomination of Patel and toward Pete Hegseth, tapped to be the defense secretary. \n\nThat marks a departure from 2021, when several of President Joe Biden’s nominees managed to get the votes of 20 or more Republican senators, along with unified Democratic support. \n\n“You’re going to see Democrats and the media try to turn at least a couple of these confirmation hearings into a circus, and they’re going to throw as much mud at the wall as they can,” Cruz warned. “But at the end of the day, I think we’re going to see all of them confirmed. And I think the president has a mandate, a powerful mandate for change. The voters spoke overwhelmingly on Election Day and gave us a Republican president and Republican Senate, a Republican House.”\n\nThe GOP will have a 53-to-47 seat Senate majority in January. Nevertheless, Trump already suffered a setback when his first choice for attorney general—now-former Rep. Matt Gaetz, R-Fla.—had to step aside when it became clear he lacked unified GOP Senate support. Trump has since announced he would nominate former Florida Attorney General Pam Bondi to run the Justice Department. \n\nAt the Republican senators’ gathering at the Library of Congress, Trump phoned in to welcome the senators, said Sen. Eric Schmitt, R-Mo. \n\n“I think that we’re pretty unified, and I think that, broadly speaking, that members think that President Trump should be given wide latitude, particularly since he ran on a reform agenda,” Schmitt, also a member of the Senate Judiciary Committee, told The Daily Signal. “He wants reformers inside those agencies, and I think that’s really important.” \n\n“Everybody’s pretty unified in trying to move an agenda that’s reflective of where the country is,” the Missouri lawmaker said. “So, I think the country is ready for some real reform, border security, energy dominance, [and] making sure that we have an economy that works for working families.”\n\nStill, a senior member of the Judiciary Committee, Sen. John Cornyn, R-Texas, didn’t assert his absolute support for the Patel nomination. \n\n“I’m anxious to meet with him,” Cornyn told The Daily Signal. “I haven’t met with him yet, but I’ve talked to people who I respect, and they believe he would be a good nominee.”\n\nBiden’s Cabinet nominees generally received uniform Democratic support, and some of the nominees had significant GOP backing. \n\nBiden’s secretary of state, Antony Blinken, who has overseen the administration’s foreign policy–got his job with the help of 28 Senate Republican votes, confirmed 78-22. Treasury Secretary Janet Yellen–a key player in Biden’s economic policies–was confirmed with an overwhelming 84 senators’ votes, of which 34 were from Republicans. \n\nDefense Secretary Lloyd Austin–who has presided over some of the controversial military DEI policies–was confirmed with the help of 43 Republican votes, for a total of 92 senators. Only Sens. Mike Lee of Utah and Josh Hawley of Missouri voted against Austin.\n\nEven Attorney General Merrick Garland–whose Justice Department has been scrutinized for alleged politicization and weaponization of the law–had the backing of 20 Senate Republicans. \n\nIncoming Senate Majority Leader John Thune, R-S.D., voted to confirm Blinken, Yellen, Austin, and Garland. \n\nOthers were far more controversial Cabinet picks. Health and Human Services Secretary Xavier Becerra–known for promoting abortion policies and opposing conscience rights–got only one Republican vote, that of Sen. Susan Collins of Maine. Homeland Security Secretary Alejandro Mayorkas–impeached in the House for refusing to adequately protect the border–got six Republican votes for confirmation. \n\nThe moderate Collins is quoted in USA Today saying she wants the Senate to “thoroughly vet these nominees.” Even the more conservative Sen. John Kennedy, R-La., is quoted in the newspaper as saying, “My attitude about the nominations is that that’s why God made confirmation hearings.”\n\nPatel and Hegseth are being brought in as reformers, Cruz noted during his interview with The Daily Signal. \n\n“This was a change election, and now we’ve got to roll up our sleeves and do the hard work of turning the country around. And I think all of us are excited about that,” the Texas lawmaker said. \n\nThat’s key to the Patel nomination, Cruz said. \n\n“You look at what President Trump campaigned on, and front and center. What the president promised the American people is ‘If you elect me, we will clean out the political corruption at the FBI and at the [Justice Department],’” Cruz said. “And I think nominating Kash Patel is honoring that promise.”\n\nSchmitt, a former Missouri state attorney general, noted Patel’s law enforcement and national security credentials for the FBI job.\n\n“I do think he’s got a lot of great, relevant experience,” Schmitt said. “He’s been the head of these intelligence agencies, was chief of staff at the Pentagon, has been prosecutor and public defender. So, a lot of experience in law enforcement. I think he’ll be great.”","summary":"All of President-elect Donald Trump’s nominees for federal government posts will be confirmed, Sen. Ted Cruz said Tuesday after a conference with his fellow Senate... Read More\n\n\nThe post ‘Voters Spoke Overwhelmingly’: Sen. Cruz Calls for Confirming Patel, Other Trump Picks appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2024/12/03/voters-spoke-overwhelmingly-sen-cruz-calls-confirming-patel-other-trump-picks/","image":"https://www.dailysignal.com/wp-content/uploads/2024/12/Kash-Patel-scaled.jpg","video":null,"publish_date":"2024-12-03 23:25:02","author":"Fred Lucas","authors":["Fred Lucas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.228},{"id":270153278,"title":"Everything to Know About Elon Musk's Inner Circle","text":"Elon Musk started his career back in the '90s by founding major tech companies, including X.com, which eventually became PayPal. Decades later, the South African now owns X (formerly Twitter), SpaceX, Tesla, and more, making him the richest man in the world with a net worth of $343 billion, according to Forbes.Throughout Musk's financial rise, he has been no stranger to controversy. However, he still has maintained a few solid friendships over the years.Here is everything to know about Elon Musk's inner circle.Donald TrumpMusk has been seen a lot more with Donald Trump in late 2024, as Trump plans to give Musk a position on his cabinet after winning the presidential election. Musk will be leading the new Department of Government Efficiency (DOGE) alongside Vivek Ramaswamy, which is intended to \"dismantle government bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure federal agencies,\" according to a social media statement from Trump (via BBC). The publication also points out that Musk referred to the new agency as \"the only path to extending life beyond Earth.\"On August 13, 2024, Musk invited Trump to have a live discussion on X (formerly Twitter), where the president elect called Tesla a \"great\" company, according to BBC. Most recently, Musk joined Trump's Thanksgiving dinner, where the two sat next to each other and performed \"YMCA\" in a viral moment.Peter ThielGiven Musk's power and origins in Silicon Valley, along with the eventual PayPal/X.com merger, it's no surprise that he's close friends with the original co-founder, Peter Thiel. The businessman would also co-found Palantir Technologies, a data analysis firm, and Thiel still serves as the chairman. Thiel has also supported other prominent tech companies over the years, including as Facebook's first outside investor in 2004, according to The Washington Post.After the election, Thiel discussed on the Honestly podcast that Musk's alignment with Trump is encouraging other Silicon Valley leaders to be open about their right-wing views, pointing out, \"There was some degree to which it was safer for people to speak out when other people were speaking out.\" Thiel had donated to the Trump campaign in 2016, according to Business Insider.Talulah RileyPride and Prejudice actress Talulah Riley first married Musk in 2010, but the couple would go on to divorce in 2012. However, the two would try again and remarry in 2013. Although they eventually divorced again in 2016 and Riley went on to marry actor Thomas Brodie-Sangster, it seems things are still amicable between the two exes.\"Well, you know more than anyone how what we read in the mainstream media is not necessarily an absolute truth,\" Riley told The Times in August 2024. \"I loved/love the guy, so I'm incredibly subjective in my opinion, cannot be unbiased and shouldn't be expected to be either. I'm sure, well... You know what being in love is, right?\"Joe RoganPodcast host Joe Rogan has been a close orbiter of Musk as well. Musk appeared on a November 2024 episode of The Joe Rogan Experience podcast and has been a rotational guest over the years, joining for five episodes in total. During the November episode, the duo discussed the death of Peanut the squirrel, who was euthanized by New York state officials.","summary":"Elon Musk's inner circle consists of a few other powerful men.","url":"https://www.newsweek.com/entertainment/celebrity-news/elon-musk-inner-circle-1995191","image":"https://d.newsweek.com/en/full/2535544/elon-musk.jpg","video":null,"publish_date":"2024-12-03 23:24:03","author":"Lexi Lane","authors":["Lexi Lane"],"language":"en","category":"politics","source_country":"US","sentiment":0.112},{"id":270153282,"title":"Fani Willis Update as Judge Deciding Subpoena Fate Over Trump Case","text":"A judge is considering whether a Republican-led Georgia State Senate committee has the power to subpoena Fulton County District Attorney Fani Willis regarding her prosecution of President-elect Donald Trump.The Georgia Senate's Special Committee on Investigations subpoenaed Willis earlier this year as part of an investigation into her alleged misconduct, including a romantic relationship with former special prosecutor Nathan Wade, while prosecuting the Trump case. In August 2023, Willis indicted Trump and 18 co-defendants on felony election subversion and racketeering charges.Willis has so far refused to testify, arguing that the \"validity of the subpoena\" itself is in question while maintaining that the Republican panel is attempting to punish her for daring to prosecute Trump. She has also refused to produce documents and other evidence related to the committee's investigation.Fulton County Superior Court Judge Shukura Ingram presided over a hearing on the matter on Tuesday. Roy Barnes, the former Democratic Georgia governor, represented Willis and argued that the committee does not have the automatic power to issue a subpoena despite the state legislature holding subpoena power, according to the Associated Press.Lawyer Josh Belinfante, who is representing the Republican lawmakers, argued that no law prohibited the Senate panel from issuing a subpoena. Barnes reportedly told the judge that the committee's subpoena was an illegitimate attempt to \"chill the prosecution of Donald Trump and find out what [Willis] had\" in terms of evidence.Willis's case against Trump is currently on hold, pending an appeal. The president-elect's victory in last month's election and his upcoming inauguration have put the future of the case in further doubt due to questions about whether a state can prosecute a sitting president.This is a developing story and will be updated when more information is available.","summary":"Willis indicted Trump on felony election subversion and racketeering charges in August 2023.","url":"https://www.newsweek.com/fani-willis-update-subpoena-trump-case-1995171","image":"https://d.newsweek.com/en/full/2535542/fani-willis-update-subpoena-hearing-state-senate.jpg","video":null,"publish_date":"2024-12-03 23:23:17","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"US","sentiment":-0.1},{"id":270161106,"title":"Chad Chronister, Donald Trump’s pick to run the DEA, withdraws name from consideration","text":"Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position.Chronister, the top law enforcement officer in Hillsborough County, Florida, said in a post on X that he was backing away from the opportunity, which he called “the honor of a lifetime.”“Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration,” Chronister wrote. He did not elaborate, and Trump's transition team did not immediately respond to a message seeking comment.Trump's pick of Chronister for the post drew backlash from conservatives, including for past comments he made that his sheriff’s office was not focused on enforcing federal immigration laws.RELATED STORY | Trump nominates South Dakota Gov. Kristi Noem to lead Homeland SecurityChronister follows former Republican congressman Matt Gaetz, Trump's first pick to serve as attorney general, in withdrawing his name for a post in the administration. Gaetz withdrew following scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.The DEA post requires Senate confirmation.","summary":"Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration.","url":"https://www.scrippsnews.com/politics/chad-chronister-donald-trumps-pick-to-run-the-dea-withdraws-name-from-consideration","image":"https://ewscripps.brightspotcdn.com/dims4/default/c884ce1/2147483647/strip/true/crop/3300x1733+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F1f%2Fe3%2Ff4bfd271438586eba0551fc217ab%2Fap21222524048813.jpg","video":null,"publish_date":"2024-12-03 23:21:31","author":"AP via Scripps News","authors":["AP via Scripps News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.101},{"id":270157560,"title":"Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead","text":"MORE POLITICS NEWS \n\n Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead\n\n Freeland says it was 'right choice' for her not to attend Mar-a-Lago dinner with Trump\n\n Canada again supports UN motion critical of Israel, citing two-state solution\n\n NDP won't support Conservative non-confidence motion that quotes Singh\n\n Opposition leaders talk unity following Trudeau meeting about Trump, minister calls 51st state comment 'teasing'\n\n Mexico president says Canada has a 'very serious' fentanyl problem\n\n More RCMP and CBSA 'human resources' destined for border, Public Safety Minister LeBlanc says\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives\n\n NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power.\n\n 'Not the result we wanted': Trudeau responds after surprise Conservative byelection win in Liberal stronghold\n\n Conservative candidate Don Stewart winning the closely-watched Toronto-St. Paul's federal byelection, and delivering a stunning upset to Justin Trudeau's candidate Leslie Church in the long-time Liberal riding, has sent political shockwaves through both parties.\n\n 'We will go with the majority': Liberals slammed by opposition over proposal to delay next election\n\n The federal Liberal government learned Friday it might have to retreat on a proposal within its electoral reform legislation to delay the next vote by one week, after all opposition parties came out to say they can't support it.\n\n Budget 2024 prioritizes housing while taxing highest earners, deficit projected at $39.8B\n\n In an effort to level the playing field for young people, in the 2024 federal budget, the government is targeting Canada's highest earners with new taxes in order to help offset billions in new spending to enhance the country's housing supply and social supports.\n\n 'One of the greatest': Former prime minister Brian Mulroney commemorated at state funeral\n\n Prominent Canadians, political leaders, and family members remembered former prime minister and Progressive Conservative titan Brian Mulroney as an ambitious and compassionate nation-builder at his state funeral on Saturday.\n\n opinion | \n\n Don Martin: Gusher of Liberal spending won't put out the fire in this dumpster\n\n A Hail Mary rehash of the greatest hits from the Trudeau government’s three-week travelling pony-show, the 2024 federal budget takes aim at reversing the party’s popularity plunge in the under-40 set, writes political columnist Don Martin. But will it work before the next election?\n\n opinion | \n\n Don Martin: The doctor Trudeau dumped has a prescription for better health care\n\n Political columnist Don Martin sat down with former federal health minister Jane Philpott, who's on a crusade to help fix Canada's broken health care system, and who declined to take any shots at the prime minister who dumped her from caucus.\n\n opinion | \n\n Don Martin: Trudeau's seeking shelter from the housing storm he helped create\n\n While Justin Trudeau's recent housing announcements are generally drawing praise from experts, political columnist Don Martin argues there shouldn’t be any standing ovations for a prime minister who helped caused the problem in the first place.\n\n opinion | \n\n Don Martin: Poilievre has the field to himself as he races across the country to big crowds\n\n It came to pass on Thursday evening that the confidentially predictable failure of the Official Opposition non-confidence motion went down with 204 Liberal, BQ and NDP nays to 116 Conservative yeas. But forcing Canada into a federal election campaign was never the point.\n\n opinion | \n\n Don Martin: How a beer break may have doomed the carbon tax hike\n\n When the Liberal government chopped a planned beer excise tax hike to two per cent from 4.5 per cent and froze future increases until after the next election, says political columnist Don Martin, it almost guaranteed a similar carbon tax move in the offing.\n\n CTVNews.ca Top Stories\n\n Mexico president says Canada has a 'very serious' fentanyl problem\n\n Foreign Affairs Minister Mélanie Joly is not escalating a war of words with Mexico, after the Mexican president criticized Canada's culture and its framing of border issues.\n\n Freeland says it was 'right choice' for her not to attend Mar-a-Lago dinner with Trump\n\n Deputy Prime Minister and Finance Minister Chrystia Freeland says it was 'the right choice' for her not to attend the surprise dinner with Prime Minister Justin Trudeau at Mar-a-Lago with U.S. president-elect Donald Trump on Friday night.\n\n Quebec doctors who refuse to stay in public system for 5 years face $200K fine per day\n\n Quebec's health minister has tabled a bill that would force new doctors trained in the province to spend the first five years of their careers working in Quebec's public health network.\n\n NDP won't support Conservative non-confidence motion that quotes Singh\n\n NDP Leader Jagmeet Singh says he won't play Conservative Leader Pierre Poilievre's games by voting to bring down the government on an upcoming non-confidence motion.\n\n Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead\n\n After rallying his party's caucus and staffers on Parliament Hill Tuesday, NDP Leader Jagmeet Singh signalled that he's still not ready to help the other opposition parties trigger an early election, yet.\n\n Opposition leaders talk unity following Trudeau meeting about Trump, minister calls 51st state comment 'teasing'\n\n The prime minister’s emergency meeting with opposition leaders on Tuesday appears to have bolstered a more united front against U.S. president-elect Donald Trump’s tariff threats.\n\n Calgary man who drove U-Haul over wife sentenced to 15 years\n\n A Calgary man who killed his wife in 2020 when he drove over her in a loaded U-Haul has been sentenced to 15 years behind bars.\n\n Man severely injured saving his wife from a polar bear attack in the Far North\n\n A man was severely injured Tuesday morning when he leaped onto a polar bear to protect his wife from being mauled in the Far North community of Fort Severn.\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Immigration Minister Marc Miller says that the recent pause in most private refugee sponsorships is because there is an 'oversupply' of applications and they don't want to give people fleeing war zones false hope.\n\n As propane tanks exploded, homeless Sudbury, Ont., man pulls woman from burning tent\n\n TJ Bedggood is humble about his life-saving actions Sunday evening, when he pulled his friend from a burning tent fire as propane tanks exploded in an encampment in Sudbury.\n\n Calgary man who drove U-Haul over wife sentenced to 15 years\n\n A Calgary man who killed his wife in 2020 when he drove over her in a loaded U-Haul has been sentenced to 15 years behind bars.\n\n Man severely injured saving his wife from a polar bear attack in the Far North\n\n A man was severely injured Tuesday morning when he leaped onto a polar bear to protect his wife from being mauled in the Far North community of Fort Severn.\n\n Video shows 'completely unprovoked' stranger attack in Vancouver, police say\n\n Police in Vancouver are searching for witnesses after a seemingly random and unprovoked assault was captured on video in the city's downtown core.\n\n Family feels abandoned by Canada as woman struggles to flee civil war in Syria\n\n It is the first time control of the city has shifted since 2016, when government forces, backed by Russia and Iran, defeated the rebels who controlled Aleppo's eastern districts.\n\n Another case of 'zombie deer' disease confirmed in B.C.'s Kootenays\n\n Health officials have confirmed a fourth case of chronic wasting disease in B.C.’s Kootenay region, prompting calls for a swift cull to prevent further spread.\n\n South Korea lifts president's martial law decree after lawmakers vote against it\n\n South Korean President Yoon Suk Yeol's government early Wednesday lifted the martial law he imposed during a tense night of political drama in which troops surrounded parliament and lawmakers voted to reject military rule.\n\n FBI arrests man allegedly helping prepare 'surprise attack' on South Korea\n\n A California man confessed to helping the North Korean regime prepare for an attack in a 'sophisticated scheme' to illegally obtain restricted weapons and military grade technology, federal prosecutors announced Tuesday.\n\n U.S. president-elect Donald Trump’s lawyers urge judge to toss his hush money conviction\n\n U.S. president-elect Donald Trump’s lawyers formally asked a judge Monday to throw out his hush money criminal conviction, arguing continuing the case would present unconstitutional 'disruptions to the institution of the Presidency.'\n\n Hunter Biden gun case dismissed after President Joe Biden's sweeping pardon\n\n A federal judge dismissed the gun case against Hunter Biden on Tuesday after President Joe Biden issued a sweeping pardon for his son.\n\n Ex-ballerina sentenced to 20 years in Florida for manslaughter in husband's killing\n\n A former Florida ballerina has been sentenced to 20 years in prison following her manslaughter conviction for fatally shooting her estranged husband in 2020.\n\n Italy bans Airbnb self-check-ins\n\n The days of arriving late at an Airbnb in Italy and opening up the key box to let yourself will soon be over after the country issued a ban on self-check-ins under a new law it says is needed to combat potential terrorism.\n\n Speaker's ruling clears path for Trudeau's government to face successive tests of confidence in days ahead\n\n After rallying his party's caucus and staffers on Parliament Hill Tuesday, NDP Leader Jagmeet Singh signalled that he's still not ready to help the other opposition parties trigger an early election, yet.\n\n Freeland says it was 'right choice' for her not to attend Mar-a-Lago dinner with Trump\n\n Deputy Prime Minister and Finance Minister Chrystia Freeland says it was 'the right choice' for her not to attend the surprise dinner with Prime Minister Justin Trudeau at Mar-a-Lago with U.S. president-elect Donald Trump on Friday night.\n\n Canada again supports UN motion critical of Israel, citing two-state solution\n\n Canada has again breached its years-long policy and voted in support of a United Nations motion critical of Israel, based on concerns about the viability of a two-state solution.\n\n A California art teacher died from rabies after an encounter with a bat in her classroom\n\n A California art teacher died from rabies November 22, about a month after apparently being infected by a bat she found in her classroom.\n\n Quebec doctors who refuse to stay in public system for 5 years face $200K fine per day\n\n Quebec's health minister has tabled a bill that would force new doctors trained in the province to spend the first five years of their careers working in Quebec's public health network.\n\n Walking pneumonia cases in Ontario have nearly tripled since 2019: report\n\n The number of walking pneumonia cases seen in Ontario this year is triple the amount of what was reported in 2019, before the COVID-19 pandemic.\n\n Meta says generative AI had muted impact on global elections this year\n\n Despite widespread concern that generative AI could interfere with major elections around the globe this year, the technology had limited impact across Meta Platforms' META.O apps, the tech company said on Tuesday.\n\n The most popular Wikipedia pages of 2024\n\n Searching for something? From queries about U.S. politics to cricket in India, Wikipedia has become a source of information for millions of people across the globe.\n\n Warning signs posted after 'aggressive' 12-foot shark spotted in Hawaii\n\n Warning signs have been posted at Makaha Beach after a shark was spotted swimming 100 yards away on Saturday, November 30, 2024.\n\n Entertainment \n\n Billboard names Beyonce the greatest pop star of the 21st century\n\n Beyoncé has been named the greatest pop star of the 21st century by Billboard, the music charting site announced on Tuesday as part of an ongoing series.\n\n Kendrick Lamar to perform in Toronto for the first time since Drake feud\n\n Kendrick Lamar is coming back to Toronto for his first stadium tour – and he's bringing SZA along with him.\n\n 'Tiger King' Joe Exotic says Joe Biden should release 'normal citizens' like him after Hunter Biden pardon\n\n Joseph Maldonado, who is known as 'Joe Exotic' from Netflix's 'Tiger King,' said President Joe Biden should pardon anybody who has filed for a clemency application, including himself.\n\n Bank fees eating away at your savings? How to avoid the most common ones\n\n You probably know when your paycheque gets deposited and roughly how much your monthly cellphone bill costs, but it might be harder to answer a fundamental question about your bank account: how much are you paying in fees?\n\n Canada Post strike: Kids no longer need to mail their letters to Santa by the end of the week\n\n Canada Post says it has removed the deadline for its Santa Claus letter program amid an ongoing national workers' strike that has halted mail delivery leading up to the holiday season.\n\n Scotiabank reports $1.69B Q4 profit, up from $1.35B a year ago\n\n Scotiabank reported a fourth-quarter profit of $1.69 billion, up from $1.35 billion in the same period last year, as it set aside a smaller amount for bad loans compared with a year ago.\n\n Lifestyle \n\n N.S. teacher, students help families in need at Christmas for more than 25 years\n\n For more than a quarter-century, Lisa Roach's middle school students have been playing the role of Santa Claus to strangers during the holidays.\n\n The most popular Wikipedia pages of 2024\n\n Searching for something? From queries about U.S. politics to cricket in India, Wikipedia has become a source of information for millions of people across the globe.\n\n Here's what the Pizza Hut of the future looks like\n\n Pizza Hut unveiled a new design concept that features a pizza-making station at the centre of the restaurant, allowing customers to see employees make their orders.\n\n B.C. Lions name former quarterback Buck Pierce as head coach\n\n The B.C. Lions have named Buck Pierce as their new head coach.\n\n Brad Lambert making season debut with Jets as they battle the Blues\n\n It might be a quick one-game stop at home, but the Winnipeg Jets are back at Canada Life Centre after wrapping up a six-game road trip.\n\n Alphonso Davies handed one-month driving ban after being pulled over in Munich\n\n Canada captain Alphonso Davies has been handed a one-month driving ban after being pulled over by police in Munich last week.\n\n Jaguar reveals first concept car after controversial rebrand\n\n British luxury automaker Jaguar has revealed its Type 00 concept car, the first glimpse of a new electric vehicle following a controversial rebrand that has divided opinion.\n\n The best tips to prepare your car for the winter\n\n Slippery or snow-covered roads, reduced visibility and bitter cold are all conditions that can make driving difficult and even dangerous during cold weather months. CAA spoke with CTV Morning Live this week on some of the best ways you can winterize your car.\n\n Stellantis CEO resigns as carmaker sales continue to slump\n\n Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep, Citroën and Ram, amid an ongoing struggle with slumping sales.\n\n Local Spotlight \n\n N.S. teacher, students help families in need at Christmas for more than 25 years\n\n For more than a quarter-century, Lisa Roach's middle school students have been playing the role of Santa Claus to strangers during the holidays.\n\n N.S. girl battling rare disease surprised with Taylor Swift-themed salon day\n\n A Nova Scotia girl battling a rare disease recently had her “Wildest Dreams” fulfilled when she was pampered with a Swiftie salon day.\n\n Winnipeg city councillor a seven-time provincial arm wrestling champ\n\n A Winnipeg city councillor doesn’t just have a strong grip on municipal politics.\n\n Watch: Noisy throng of sea lions frolic near Jericho Beach\n\n A large swarm of California sea lions have converged in the waters near Vancouver’s Jericho and Locarno beaches.\n\n Auburn Bay residents brave the cold to hold Parade of Lights\n\n It was pretty cold Saturday night, but the hearts of those in a southeast Calgary neighbourhood warmed right up during a big annual celebration.\n\n Three million grams of cereal collected to feed students in annual Cereal Box Challenge\n\n The food collected will help support 33 breakfast and snack programs in the Greater Essex County District School Board.\n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n Temperature records broken, tied following latest snowfall in Saskatchewan\n\n Saskatchewan received yet more snow as winter continues to ramp up on the prairies. With the increased precipitation, communities have recorded dipping temperatures – with a handful breaking or tying longstanding records.\n\n 'My dear Carmel': Lost letters returned to 103-year-old Guelph, Ont. woman\n\n A young history buff was able to reunite a Guelph, Ont. woman with letters written by her husband almost 80 years ago.\n\n Vancouver \n\n BC SPCA to rescue up to 30 stray cats from one Kamloops home\n\n The BC SPCA is warning of the consequences of feeding stray cats after a person accidentally lured over 25 felines to their home in Kamloops, B.C. \n\n Comox Valley RCMP seek suspect who tried to climb woman's deck wearing a gas mask\n\n Mounties on Vancouver Island are seeking witnesses after a woman reported that a man wearing a gas mask tried to climb onto the deck of her home near Courtenay, B.C.\n\n BREAKING | \n\n New Vancouver Art Gallery plan scrapped, board seeks new design\n\n The Vancouver Art Gallery has decided to start all over again and shelve plans for a new nine-level tower made of wood and glass, CTV News has learned.\n\n Richmond Hill jewelry store smash-and-grab caught on video, 5 suspects outstanding\n\n Video footage has surfaced on social media of a violent daytime robbery earlier this week at a jewelry store in a Richmond Hill shopping centre.\n\n Walking pneumonia cases in Ontario have nearly tripled since 2019: report\n\n The number of walking pneumonia cases seen in Ontario this year is triple the amount of what was reported in 2019, before the COVID-19 pandemic.\n\n Process around Ontario Place redevelopment was 'unfair' and didn't follow rules: AG\n\n Ontario's auditor general is slamming the Ford government for failing to follow proper process around the redevelopment of Ontario Place, including a revelation that senior staff communicated directly with Therme Canada and other applicants while proposals were still being accepted.\n\n Loved ones seek answers as Pine Creek death deemed a homicide\n\n Calgary police say the death of a man in the community of Pine Creek last month is being investigated as a homicide.\n\n Person found dead in Taradale home with high CO levels: CFD\n\n A person was found dead in a Taradale home where emergency crews discovered high levels of carbon monoxide.\n\n Calgary man who drove U-Haul over wife sentenced to 15 years\n\n A Calgary man who killed his wife in 2020 when he drove over her in a loaded U-Haul has been sentenced to 15 years behind bars.\n\n TRAVEL ADVISORY \n\n TRAVEL ADVISORY | \n\n Winter weather travel advisory in effect as Ottawa expects first notable snowfall\n\n The first winter weather travel advisory of the season is in effect for Ottawa as the city's first dump of snow expected this week.\n\n 1 teen, 4 adults injured in crash involving school bus and vehicle in south Ottawa\n\n Ottawa paramedics say five people were injured following a collision between a school bus and a van in south Ottawa.\n\n 'Adapting is huge': Skiers, snowboarders prepare for first significant snowfall\n\n Winter sports enthusiasts are looking forward to the coming snowfall in eastern Ontario, as are ski resorts, which have had a slow start to the season.\n\n Despite devastating poll, Quebec Premier Legault confident he’s here to stay\n\n Despite a devastating poll, Premier François Legault is confident that he will lead the CAQ troops into the next electoral battle in two years' time.\n\n Quebec doctors who refuse to stay in public system for 5 years face $200K fine per day\n\n Quebec's health minister has tabled a bill that would force new doctors trained in the province to spend the first five years of their careers working in Quebec's public health network.\n\n Quebec man get prison sentence after trying to smuggle fake permanent residence cards, licences\n\n A Quebec man has been sentenced to prison after attempting to smuggle more than 1,000 forged documents into the country, including Canadian permanent resident cards and driver's licences.\n\n Ex-Alberta teacher convicted of sex crime involving child for 2nd time\n\n Former Alberta teacher Brian Davison has been found guilty of one count of sexual exploitation in connection with an incident involving a child.\n\n Giving Tuesday: As the Canada Post strike and inflation affect charities, here's how Edmontonians can help\n\n Across the country, charities are getting ready for the holidays, which is often a busy time for many of them, and are relying on the generosity of Canadians to help get them.\n\n Oilers tasting more success as special-teams play improves\n\n Special teams are starting to show up for the Edmonton Oilers. Head coach Kris Knoblauch identified improved play – and results – from both the NHL team's power play and penalty kill as \"important\" factors in their last two games.\n\n Snow, rain, and wind expected for Maritimes this week with early December storm\n\n A developing low pressure skirting colder air in place across eastern parts of the country will bring snow, rain, and wind to the Maritimes on Thursday.\n\n Cape Breton investigating last year of municipal credit card transactions\n\n The Cape Breton Regional Municipality (CBRM) is investigating more than a year of transactions on a legislative credit card due to a lack of documents.\n\n N.B. woman dies after hit and run in Notre-Dame: RCMP\n\n A 40-year-old New Brunswick woman has died after she was struck by a vehicle in Notre-Dame, N.B.\n\n Manitoba government promises trade office in U.S. capital to boost economy\n\n The Manitoba government is planning to open a trade office in Washington, D.C., in the new year to deal with threatened United States tariffs and promote investment opportunities in provincial sectors such as mining and aerospace.\n\n Every Winnipeg driver pulled over during checkstop program must give breath sample: police\n\n Every driver pulled over in Winnipeg as part of the police’s annual festive season checkstop program will have to provide a breath sample.\n\n Young Manitoba woman dies after medical emergency during dental appointment\n\n The Manitoba Dental Association (MDA) said it is investigating a critical incident where a young woman from the Morden-Winkler area died following a dental appointment.\n\n Regulations around foreign ownership of Sask. farmland need better enforcement, auditor finds\n\n The Provincial Auditor of Saskatchewan is recommending that the province improve its system of monitoring sales of farmland to foreign entities.\n\n Formal expectations needed for answering 911 calls: Sask. auditor reports\n\n The Provincial Auditor assessed the Saskatchewan Public Safety Agency’s (SPSA) 911 call taking and dispatching processes for fire emergencies, focusing on the Provincial Emergency Communications Centre.\n\n Attempted murder charge laid after home invasion, series of hit and runs in Regina\n\n Two people in Regina are facing a list of charges following a series of alleged acts that include a home invasion, multiple collisions and attempted murder.\n\n Kitchener \n\n Why Wilmot is proposing a $580 tax increase in its 2025 draft budget\n\n The Township of Wilmot has released its 2025 draft budget which included a one-time capital infrastructure investment.\n\n Teddy Bear Toss happening tonight at the Aud\n\n Calling all Kitchener Rangers fans! The Teddy Bear Toss returns for tonight's game against the Brantford Bulldogs.\n\n Guelph Police looking for missing pregnant woman\n\n Guelph Police are asking for help as they search for a missing pregnant woman.\n\n Saskatoon \n\n Major power outage hits much of Saskatoon's west side\n\n A large power outage lasting several hours affected much of Saskatoon's west side and portions of the east side of the city Tuesday afternoon.\n\n 'That's way, way inappropriate': Saskatoon city councillor raises issue with democratic process, clerk apologizes\n\n Before Saskatoon city council unanimously approved the budget, a fiery discussion about the democratic process dominated chambers.\n\n Man dies at Saskatoon Correctional Centre\n\n A 62-year-old man was declared dead at the Saskatoon Correctional Centre on Dec. 2.\n\n Northern Ontario \n\n Man severely injured saving his wife from a polar bear attack in the Far North\n\n A man was severely injured Tuesday morning when he leaped onto a polar bear to protect his wife from being mauled in the Far North community of Fort Severn.\n\n As propane tanks exploded, homeless Sudbury, Ont., man pulls woman from burning tent\n\n TJ Bedggood is humble about his life-saving actions Sunday evening, when he pulled his friend from a burning tent fire as propane tanks exploded in an encampment in Sudbury.\n\n Five years after toddler's brutal death, Northern Ont. family struggles to find peace, justice\n\n A North Bay family is struggling to find peace and justice as the five-year anniversary of the brutal death of toddler Oliver McCarthy approaches.\n\n Witness sees accused with gun at bush bash shooting scene\n\n A witness for the bush party shooting trial says he saw the accused with a firearm that night.\n\n 'A real gamut': LHSC highlights number of serious seasonal injuries ahead of the holiday season\n\n As we head into the heart of the holiday season, experts at London Health Sciences Centre (LHSC) are cautioning the public in order to help prevent serious injuries.\n\n Tire shops 'spinning' with winter tire changeover demand\n\n London tire and automotive shops remain caught off guard by the sudden arrival of winter.\n\n Snow-clearing efforts stalled due to tractor-trailers stuck on many roads along Highway 11\n\n Snow-clearing efforts continue on secondary roads that remain closed along Highway 11 on Tuesday.\n\n Woman dies in two-vehicle crash on Highway 118 in Haliburton\n\n An 87-year-old woman has died following a collision on Highway 118 in Haliburton County on Monday afternoon.\n\n Crown pushes for 6-year sentence for supervisor convicted in fatal crash case\n\n Victim impact statements were read in a Barrie courtroom on Tuesday ahead of sentencing for a man convicted of criminal negligence causing the death of a dump truck driver four years ago.\n\n Windsor, mayor name-dropped for housing criticism\n\n The City of Windsor and its mayor have been picked out as egregious examples of municipal housing missteps by a prominent expert in the field and author of a recent report identifying poor building performance in Ontario.\n\n Survey raises concerns about cannabis-impaired driving in Ontario\n\n A recent survey conducted by CAA South Central Ontario (CAA SCO) highlights an increase in cannabis use among Ontario drivers, sparking some concern about impaired driving.\n\n 'Times are tough and we're feeling the stretch': Still time to give this Giving Tuesday\n\n Dec. 3 is Giving Tuesday and the Chatham-Kent Health Alliance Foundation (CKHAF) is calling on the community for support to help purchase a new fluoroscopy machine for Chatham-Kent Health Alliance (CKHA).\n\n Vancouver Island \n\n Comox Valley RCMP seek suspect who tried to climb woman's deck wearing a gas mask\n\n Mounties on Vancouver Island are seeking witnesses after a woman reported that a man wearing a gas mask tried to climb onto the deck of her home near Courtenay, B.C.\n\n Canadian military drones enter production, though Arctic modifications will be required\n\n Canada's first combat drones have now entered production, though the remotely piloted aircraft will require years of testing and significant modifications before the first units are delivered in 2028.\n\n BC SPCA to rescue up to 30 stray cats from one Kamloops home\n\n The BC SPCA is warning of the consequences of feeding stray cats after a person accidentally lured over 25 felines to their home in Kamloops, B.C. \n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Kelowna, B.C., to host the Memorial Cup in the spring of 2026\n\n The Western Hockey League's Kelowna Rockets will host the Memorial Cup in the spring of 2026, the Canadian Hockey League said Wednesday.\n\n 545 vehicles impounded in 332 days: BC Highway Patrol pleads for drivers to slow down\n\n Mounties with the BC Highway Patrol in Kelowna say they've impounded more than 545 vehicles for excessive speed and aggressive driving so far this year. That works out to more than 1.6 per day.\n\n Lethbridge \n\n Hurricanes add Yager, Unger in blockbuster deal with Warriors\n\n The Lethbridge Hurricanes received forward Brayden Yager and goalie Jackson Unger from the Moose Jaw Warriors in an 11-asset blockbuster trade on Monday.\n\n Raiders hand Hurricanes sixth loss in a row, winning 3-2 in Prince Albert\n\n The Hurricanes ended November with a loss, dropping a 3-2 decision to the Raiders Saturday night in Prince Albert.\n\n University of Lethbridge launches geospatial insitute\n\n Geomatics research is about to take a step forward at the University of Lethbridge.\n\n Sault Ste. Marie \n\n Shooting on Manitoulin Island leads to attempted murder charges\n\n Two people have been charged – one with attempted murder – following a shooting in Wikwemikong last week.\n\n Insults on social media lead to real-life assault in northern Ont.\n\n A Mississauga First Nation woman has been charged with assault after she took offence to comments about her on social media.\n\n Snow squall warning in the Sault, heaviest snowfall expected tonight\n\n Sault Ste. Marie's run of severe winter weather will continue Tuesday, with Environment Canada issuing another snow squall warning.\n\n GivingTuesday: Food banks need help, but charity won't end hunger, advocates say\n\n It's GivingTuesday, and some directors of food banks and anti-poverty groups say the day underlines a conundrum for their organizations.\n\n N.L. man not guilty of sex charges, judge cites inadequate police investigation\n\n A Newfoundland and Labrador judge has acquitted a man of six crimes, including sexual assault and sexual interference, citing inadequacies in the investigation by the Royal Newfoundland Constabulary.\n\n Newfoundland's LGBTQ2S+ bar paid drag queens $37.50. Tara Nova called them out.\n\n If the screaming crowd in the twinkling Majestic Theatre in downtown St. John's was any indication, Newfoundland drag queen Tara Nova will never have to accept $37.50 for a show again.\n\n Stay Connected","summary":"After rallying his party's caucus and staffers on Parliament Hill Tuesday, NDP Leader Jagmeet Singh signalled that he's still not ready to help the other opposition parties trigger an early election, yet.","url":"https://www.ctvnews.ca/politics/speaker-s-ruling-clears-path-for-trudeau-s-government-to-face-successive-tests-of-confidence-in-days-ahead-1.7132524","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/3/greg-fergus-1-7132555-1733268060815.jpg","video":null,"publish_date":"2024-12-03 23:20:57","author":"Rachel Aiello","authors":["Rachel Aiello"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.008},{"id":270155862,"title":"Trump’s conquest: President-elect posts bizarre AI pic of himself with Canadian flag (on a Swiss mountain)","text":"Does Donald Trump want to conquer Canada?\n\nThe president-elect posted a bewildering image of him and the Canadian flag on top of a mountain just days after suggesting Canada become the U.S.’s 51st state \n\n“Oh Canada,” Trump captioned the AI-generated image.\n\nThere was just one problem: the mountain range appeared to be the Swiss Alps, with a peak reminiscent of the Matterhorn visible in the background.\n\nIt’s unclear exactly what Trump was referencing with the image, but clearly the neighbor up north is on his mind.\n\nLast week, while dining with Canadian prime minister Justin Trudeau at his Mar-a-Lago residence, the President-elect reportedly joked that if Canada wanted to avoid a host of sweeping trade tariffs, it should consider joining the U.S.\n\nTrudeau, among others at the meeting, responded to the quip with nervous laughter, sources told Fox News. Trump is said to have continued the gag by telling the Canadian leader that prime minister is a better sounding title than governor.\n\nThe sources added that another person at the table said that the 51st state would be a very liberal one which sparked further laughter – and a suggestion from Trump that Canada be split into two: a conservative state and a liberal state.\n\nHowever, some of Trump’s most vocal supporters have continued to run with the joke.\n\nSpeaking on Fox’s The Five, host Jesse Watters said that there were “so many reasons” to make Canada a state.\n\n“I think it has the third largest oil reserves in the world so that makes us an energy behemoth… It’s a no brainer,” he said, adding: “I don’t know if Canada is going to go along with it, but there’s ways to maybe change their opinion.”\n\nThough the post may also have been in jest, prior to their Florida meeting, Trudeau had voiced his concerns that Trump’s tariff plans will not be merely empty threats.\n\n“Donald Trump, when he makes statements like that, he plans on carrying them out. There’s no question about that,” he told reporters.","summary":"The post appeared to be a somewhat confusing reference to a joke the President-elect made with Canadian Prime Minister Justin Trudeau last week","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-canada-ai-mountain-tariffs-b2658374.html","image":"https://static.independent.co.uk/2024/12/03/22/newFile-1.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/3uBGsXJC-OhrQWqOm.mp4","publish_date":"2024-12-03 23:20:21","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.192},{"id":270153280,"title":"Trump Nominees Live Updates: DEA Pick Chad Chronister Withdraws Amid Backlash","text":"Hillsborough County Sheriff Chad Chronister has withdrawn as nominee for the head of the Drug Enforcement Administration (DEA). Chronister thanked President-elect Donald Trump for his nomination which he called \"the honor of a lifetime.\" But he said that he must \"respectfully withdraw\" and would focus on serving the citizens of Hillsborough County. Chronister was a controversial nomination with both MAGA and GOP members, such as Kentucky Rep. Thomas Massie and Texas Rep. Chip Roy, raising strong opposition. Many referenced his actions during the COVID-19 pandemic when he ordered the arrest of Pastor Rodney Howard-Browne for holding in-person church services in violation of lockdown orders He is the second Trump nominee to withdraw in the face of fierce backlash. Matt Gaetz, who was named as Trump's next Attorney General, bowed out last month after lawmakers on both sides of aisle raised concerns making his Senate confirmation more difficult.\nFollow Newsweek's live blog for updates.","summary":"Hillsborough County Sheriff Chad Chronister has withdrawn as nominee for the head of the DEA.  Follow Newsweek's live blog for updates.","url":"https://www.newsweek.com/trump-nominees-live-updates-dea-pick-chad-chronister-withdraws-amid-backlash-1995189","image":"https://d.newsweek.com/en/full/2535537/chad-chronister.jpg","video":null,"publish_date":"2024-12-03 23:20:13","author":"Hannah Parry","authors":["Hannah Parry"],"language":"en","source_country":"US","sentiment":-0.082}]}