{"offset":0,"number":50,"available":4500,"news":[{"id":255574566,"title":"House Democrats ask Trump for proof he did not take $10 million ‘cash bribe’ from Egypt","text":"Democrats on the House Oversight Committee asked former President Donald Trump to show proof that he never received any money from Egypt, following a recent report on a nearly $10 million withdrawal from the nation’s state-run bank days before Trump became president in 2017. The Democrats in a letter to Trump on Tuesday said they were looking into allegations that Trump took a “cash bribe” from Egypt’s president, and that former Attorney General Bill Barr and others blocked a Department of Justice probe into that alleged bribe. The letter from Rep. Jamie Raskin, the committee’s top Democrat, and Rep. Robert Garcia, the minority leader of a subcommittee on national security, was spurred by a report Aug. 2 in The Washington Post that revealed the existence of the secret DOJ probe. “Surely you would agree that the American people deserve to know whether a former president—and a current candidate for president—took an illegal campaign contribution from a brutal foreign dictator,” they wrote. They also asked Trump to provide information about a $10 million lump sum that Trump put into his own campaign in late 2016, including any funding sources that he used to repay the “contribution or loan.” The Post first reported on the letter from Raskin and Garcia. The Democrats on the Republican-majority panel do not have the authority to issue subpoenas. Asked about the letter, Trump campaign spokesman Steven Cheung told CNBC in an email, “This is textbook Fake News.” “The investigation referenced found no wrongdoing and was closed. None of the allegations or insinuations being reported on have any basis in fact,” Cheung said. “The media is consistently played for suckers by Deep State Trump-haters and bad faith actors peddling hoaxes and shams,” he added. The Post reported Aug. 2 that federal investigators had received classified intelligence suggesting that Egyptian President Abdel Fattah el-Sissi sought to boost Trump’s 2016 presidential campaign with a $10 million donation. The investigators, from a team assembled by former special counsel Robert Mueller, reportedly learned in 2019 that the state-run National Bank of Egypt had carried out a request to withdraw $9,998,000 by packing bundles of $100 bills into two large bags. The Jan. 15, 2017, withdrawal request was executed the same day, just five days before Trump’s presidential inauguration, according to the Post’s investigation. The discovery of that withdrawal appeared to bolster the claim that el-Sissi sought to give Trump money.","summary":"Republican presidential candidate Donald Trump, left, meets with Egyptian President Abdel Fattah el-Sissi at the Plaza Hotel in New York, Sept. 19, 2016. Dominick Reuter &#124; AFP &#124; Getty Images Democrats on the House Oversight Committee asked former President Donald Trump to show proof that he never received any money from Egypt, following a recent &#8230;\n\n\nThe post House Democrats ask Trump for proof he did not take $10 million &#8216;cash bribe&#8217; from Egypt appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/house-democrats-ask-trump-for-proof-he-did-not-take-10-million-cash-bribe-from-egypt/","image":"https://image.cnbcfm.com/api/v1/image/108028499-1725377277241-gettyimages-608555022-AFP_GB35U.jpeg?v=1725399413&w=1920&h=1080","video":null,"publish_date":"2024-09-04 00:03:17","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.368},{"id":255574862,"title":"Family of co-writer of “Hold On, I’m Coming” sues Trump campaign for unauthorized use of song","text":"ATLANTA – A federal judge in Atlanta ruled Tuesday that Donald Trump and his campaign must stop using the song “Hold On, I’m Coming” while the family of one of the song’s co-writers pursues a lawsuit against the former president over its use. The estate of Isaac Hayes Jr. filed a lawsuit last month alleging that Trump, his campaign and several of his allies had infringed its copyright and should pay damages. After a hearing on the estate’s request for an emergency preliminary injunction, U.S. District Judge Thomas Thrash ruled that Trump must stop using the song, but he denied a request to force the campaign to take down any existing videos that include the song. Hayes, who died in 2008 at age 65, and David Porter co-wrote “Hold On, I’m Coming,” a 1966 hit for soul duo Sam and Dave. Ronald Coleman, an attorney for Trump and his campaign told reporters after the hearing that the campaign had already agreed not to use the song going forward: “The campaign has no interest in annoying or hurting anyone, and if the Hayes family feels that it hurts or annoys them, that’s fine, we’re not going to force the issue.” Coleman said it was very important that the judge agreed that it would be overstepping his power at this point in the litigation to order the campaign to take down existing videos. Hayes’ son, Isaac Hayes III told reporters he was “very grateful and happy” for the judge’s decision. “I want this to serve as an opportunity for other artists to come forward that don’t want their music used by Donald Trump or other political entities and continue to fight for music artists’ rights and copyright,” he said. A string of artists and their heirs have objected to Trump using their songs during his events. After a Trump campaign rally in Bozeman, Montana, last month featured a video of Celine Dion performing “My Heart Will Go On,” her team put out a statement saying the singer didn’t endorse that use of her song and saying “in no way is this use authorized.” Ahead of the 2020 election, Bruce Springsteen, Rihanna, Phil Collins, Pharrell, John Fogerty, Neil Young, Eddy Grant, Panic! at the Disco, R.E.M. and Guns N’ Roses all objected to Trump using their songs. When he learned in 2022 that Trump had used “Hold On, I’m Coming” at an NRA rally, Porter tweeted “Hell to the NO!” But Sam Moore, of Sam and Dave, had performed “America the Beautiful” at a pre-inauguration concert for Trump and suggested in a sworn statement filed with the court over the weekend by Trump and his campaign that he was opposed to the action sought by Hayes’ estate. Tuesday’s ruling was a preliminary one and the litigation remains ongoing. The lawsuit filed by the estate of Isaac Hayes Jr. and Isaac Hayes Enterprises says Hayes and Porter were the owners of all rights to the song, including the copyright, and that Isaac Hayes Enterprises is the current owner. The lawsuit says Trump and his campaign began using the song in 2020 as “outro” music for his appearances and campaign events and has used it at least 133 times since then. Universal Music Group and Warner Chappell music, publishers contracted by Isaac Hayes Enterprises, sent a cease-and-desist letter to the Trump campaign in 2020, it says. Trump and his campaign never sought permission or consent from Hayes’ estate or Isaac Hayes Enterprises until this year and have not obtained a valid public performance license for it, the lawsuit says. The song’s use by Trump and his campaign constitutes “false and/or misleading” uses of Hayes’ “widely recognized celebrity and legacy” and could deceive the public into believing there is an endorsement or business relationship between the plaintiffs and Trump and his campaign, the lawsuit says The lawsuit says the plaintiffs have “incurred significant economic damages” as a result and argues that they should get actual and punitive damages for each proven infringement. Lawyers for Trump and his campaign wrote in a filing with the court that the Hayes estate and Isaac Hayes Enterprises, have failed to show that they own the copyright at issue and cannot show that they have suffered any harm. The campaign obtained a license from BMI Music in November 2022 authorizing it to use “Hold On, I’m Coming,” the filing says. The fact that the song can be heard as background music in some campaign videos is protected by the principle of fair use and “cannot possibly have an effect on the market value of the Song,” Trump’s lawyers wrote. A sworn statement from Trump campaign deputy manager Justin Caporale submitted to the court says that “out of respect for the pending litigation” the campaign will no longer play the song at its events. In his statement filed with the court, Moore said Hayes’ estate has made his biography and legacy the focus of the litigation but that “Isaac’s is not the only significant biography and legacy involved in this matter.” As one of the singers on “Hold On, I’m Coming,” Moore said that the public associates his voice, name and identity with the song “at least as much, if not more, than the name of Isaac Hayes.” Moore said all licensing for the song is controlled by Universal Music Group Publishing. Moore said he fears that if the court were to grant the wishes of Hayes’ estate that he might be prohibited from ever appearing and performing the song at a Trump event during or after the election.","summary":"Internewscast Journal\n\nInternewscast\n\n\nATLANTA – A federal judge in Atlanta ruled Tuesday that Donald Trump&#8230;\n\n\nThis Post: Family of co-writer of &#8220;Hold On, I&#8217;m Coming&#8221; sues Trump campaign for unauthorized use of song first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/family-of-co-writer-of-hold-on-im-coming-sues-trump-campaign-for-unauthorized-use-of-song/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-Trump-campaign-must-stop-using-039Hold-On.jpg","video":null,"publish_date":"2024-09-04 00:03:08","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.022},{"id":255574570,"title":"Harris adopted ‘Union Joe’s’ playbook, but this member isn’t buying it: ‘Kamala is reading off a script’","text":"PITTSBURGH – Vice President Kamala Harris’ Labor Day message to union workers in Pennsylvania failed to resonate with at least one Yinzer, who found her speech unconvincing and insincere. “They haven’t earned my vote,” Shawn Cribs Jr. told The Post after leaving the event at the International Brotherhood of Electrical Workers Local 5 union hall. “It feels like Kamala is reading off a script,” the 20-year-old IBEW brother said. Cribs, while crediting Biden’s spending on infrastructure for helping rebuild a bridge that collapsed during one of the 81-year-old president’s previous Pittsburgh visits, said inflation has his undecided vote leaning toward former President Donald Trump. “I’m dumb. I’m just a guy. I don’t care about the charts,” he said. “People need to see the results first-hand to understand why they need to vote for a certain president.” Cribs noted that he saw gas and groceries get more expensive under Biden, whether or not he’s to blame. “We all slave and work to make money and I think what’s most important is making money,” he said, whether you’re poor or a billionaire. To be clear, nearly all of the IBEW members were big fans of the Harris-Biden double billing — jumping up in their seats and cheering for the rally. In her remarks, Harris tried to re-tread many of President Biden’s union-friendly lines and past achievements. She even copied Trump’s pledge to block the sale of US Steel to Japan – while avoiding any mention of the record-high inflation and soaring food and gas prices under the Harris-Biden administration. The 59-year-old vice president also didn’t get into specifics about what executive actions she would undertake to back unions, only declaring her support for Protecting the Right to Organize Act – congressional legislation that would override state “right to work” laws that make union membership voluntary – and vaguely vowing to “end union busting once and for all.” “She’s speaking the language she learned under Joe Biden,” Dennis Roddy, a Pittsburgh GOP strategist, told The Post. “She just proved that you don’t have to say anything new to get a reaction that seems so new to people after the experience of being abandoned by the ‘New Democrats’ going back to Gary Hart in 1984.” Harris followed Biden on the stage in Pittsburgh and Roddy said the two speeches were “indistinguishable.” “Kamala needed to send a signal to labor that she would be a continuation of [Biden’s] policies in the areas that interest them,” Roddy argued. David McCall, international president of United Steelworkers, told The Post that he believes Harris’ policies can win over rank-and-file union members, who tend to be more open to Trump than union leaders — as long as the campaign is “talking to people and making sure that it is a simple, easy message.” But even McCall, who’s endorsed Harris for president, stumbled trying to articulate parts of the Democratic nominee’s vision for an “opportunity economy.” “If you read some of the policy papers she’s already put out about an opportunist, an opportunistic economy …” he said.","summary":"“They haven’t earned my vote,” Shawn Cribs Jr. told The Post after leaving the event at the International Brotherhood of Electrical Workers Local 5 union hall. ","url":"https://nypost.com/2024/09/03/us-news/harris-adopted-union-joes-playbook-but-this-union-member-isnt-buying-it-it-feels-like-kamala-is-reading-off-a-script/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/2024-harris-biden-appealing-labor-88846084.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/G2IhRhLZ-RyIcpnTz.mp4","publish_date":"2024-09-03 23:58:48","author":"Ethan Dodd,Victor Nava","authors":["Ethan Dodd","Victor Nava"],"language":"en","source_country":"us","sentiment":-0.172},{"id":255574390,"title":"Donald Trump’s bid for federal judge to intervene in his hush money conviction rejected","text":"Prosecutors urged the trial judge, Juan M. Merchan, not to delay his rulings on two key defense requests: Trump’s call to delay sentencing until after the November election, and his bid to overturn the verdict and dismiss the case in the wake of the U.S. Supreme Court’s presidential immunity ruling. Merchan has said he will rule Sept. 16 on Trump’s motion to overturn the verdict. His decision on delaying sentencing has been expected in the coming days. Trump was convicted in May of 34 felony counts of falsifying business records to conceal a $130,000 hush money payment to porn actor Stormy Daniels, whose affair allegations threatened to disrupt his 2016 presidential run. Trump has denied her claim and said he did nothing wrong. Falsifying business records is punishable by up to four years behind bars. Other potential sentences include probation or a fine. In a letter Tuesday, Assistant District Attorney Matthew Colangelo reiterated that prosecutors have not staked a position on whether to delay sentencing, deferring to Merchan on an “appropriate post-trial schedule.”","summary":"Trump can pursue a state appeal or, after exhausting that path, seek review from the U.S. Supreme Court, the judge wrote in his decision","url":"https://nationalpost.com/news/world/donald-trump-hush-money-conviction-intervene-rejected","image":"https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/05/Donald-Trump-convicted-1.jpg","video":null,"publish_date":"2024-09-03 23:46:45","author":"The Associated Press","authors":["The Associated Press"],"language":"en","catgory":"politics","source_country":"CA","sentiment":-0.316},{"id":255574028,"title":"New York man sentenced after thousands of harassing calls to Congress and threat to kill staffer","text":"A New York man was sentenced Tuesday to 13 months in prison in connection with threatening phone calls he made to members of Congress and a threat to kill a staffer. The sentencing of Ade Salim Lilly, 35, included three years supervised release, the Justice Department said in a news release. Lilly's attorney did not immediately respond to a request for comment Tuesday. Lilly pleaded guilty in May to interstate communications with a threat to kidnap or injure, and making repeated threatening phone calls. Beginning in February 2022, he made more than 12,000 calls from Maryland and Puerto Rico, to the offices of congressional lawmakers before he was arrested in Puerto Rico in November 2023, according to court documents. Federal prosecutors said that during the calls, Lilly would berate congressional staffers and \"become angry and use vulgar and harassing language towards the individual who answered the phone\" when he was informed that the staffer couldn't help him. During one call on Oct. 21, 2022, Lilly told a congressional staffer, “I will kill you, I am going to run you over, I will kill you with a bomb or grenade,” prosecutors said. Over two days in February 2023, Lilly called the Washington, D.C., office of one lawmaker more than 500 times, prosecutors said. In a sentencing memo seeking 18 months imprisonment, prosecutors referred to rising threats against elected officials. \"This is an election year, and more and more often, criticism of a political position or viewpoint crosses the First Amendment line and leads to true threats of violence,\" they wrote. \"The pervasive rise in threats against elected officials creates a real risk that expressions of violence will become normalized.\" Last month, a Virginia man was charged with making a series of death threats on a conservative social media site against Vice President Kamala Harris, the Democratic presidential nominee. Former President Donald Trump and his running mate, Sen. JD Vance of Ohio, have also faced social media threats. In July, a Florida man was charged with written threats to kill Trump and Vance.","summary":"Ade Salim Lilly pleaded guilty in May to interstate communications with a threat to kidnap or injure, and making repeated threatening phone calls.","url":"https://www.nbcnews.com/politics/congress/new-york-man-sentenced-prison-harassing-calls-congress-threat-kill-sta-rcna169452","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-09/240903-capitol-building-ew-549p-78599c.jpg","video":null,"publish_date":"2024-09-03 23:43:47","author":"Zoë Richards","authors":["Zoë Richards"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.338},{"id":255573838,"title":"RFK Jr., Who Endorsed Trump, Not Allowed to Remove Name From Michigan Ballot","text":"After Robert F. Kennedy Jr.’s campaign dumped millions of dollars to secure ballot access as a third-party candidate — and following the independent candidate’s recent campaign suspension and endorsement of Donald Trump — he swiftly attempted to remove his name from the ballot in key swing states. However, try as he might to avoid swaying the election against his new Republican ally, a Michigan judge ruled Tuesday that RFK Jr.’s name will remain on the state’s November presidential ballot, the Associated Press reports. Kennedy filed the lawsuit last week against Secretary of State Jocelyn Benson, arguing that he still had time to withdraw his name. A few months prior, in April, the Natural Law Party had nominated Kennedy for the Michigan’s presidential ballot. In a post shared to X, Benson wrote that nominated candidates who accept a minor party’s nomination “shall not be permitted to withdraw.” The sentiment was echoed in Michigan Court of Claims Judge Christopher P. Yates’ opinion and order agreeing with the secretary of state’s previous rejection of Kennedy’s request to withdraw. “Elections are not just games, and the Secretary of State (SOS) is not obligated to honor the whims of candidates for public office,” Yates wrote. Kennedy argued in the lawsuit that his notice of withdrawal was timely and the electorate’s votes could be “diminished and rendered invalid” if he remains on the ballot. He filed a similar lawsuit in North Carolina on Friday, where he is trying to withdraw his name from the ballot. On Friday, Kennedy announced that in “about 10 battleground states where my presence would be a spoiler, I’m going to remove my name.” He urged voters not to vote for him and to instead back Trump in those states. However, in the 40 other states, Kennedy encouraged his supporters to vote for him — and even suggested he could still win the whole thing. So far, he’s managed to remove his name from the ballot in the key states of Pennsylvania, Arizona, Nevada, Florida, Ohio, and Texas. Prior to Kennedy suspending his campaign, Trump in August said that he would “certainly” be open to the independent candidate playing a role in his administration if he dropped out of the race and endorsed him. Trump’s remarks arrived about a month after The Washington Post reported that Kennedy discussed the potential drop out-endorsement in exchange for a position in the former president’s administration should Trump win the election in November.","summary":"A judge rejected Kennedy's lawsuit attempting to withdraw the independent candidate's name from the state's ballot","url":"https://www.rollingstone.com/politics/politics-news/rfk-jr-michigan-ballot-lawsuit-dismissed-1235094544/","image":"https://www.rollingstone.com/wp-content/uploads/2024/09/rfk-jr-remain-ballot.jpg","video":null,"publish_date":"2024-09-03 23:40:31","author":"Charisma Madarang","authors":["Charisma Madarang"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.269},{"id":255573830,"title":"Harris, Trump set sights on debate in Philadelphia","text":"Harris, Trump set sights on debate in Philadelphia Vice President Kamala Harris and former President Donald Trump are gearing up for their first debate, scheduled for next week in Philadelphia. Recent polling shows tight races in all the crucial battleground states. Robert Costa has more.","summary":"Vice President Kamala Harris and former President Donald Trump are gearing up for their first debate, scheduled for next week in Philadelphia. Recent polling shows tight races in all the crucial battleground states. Robert Costa has more.","url":"https://www.cbsnews.com/video/harris-trump-set-sights-on-debate-in-philadelphia/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/03/e4e326dd-b1ed-4222-8880-88d70ad4d6ab/thumbnail/1200x630/7396dd412d8a550b29f4870493a32195/0903-en-costa.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-09-03 23:37:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.526},{"id":255574050,"title":"Harris to propose tenfold startup tax incentive increase she says will spur small business creation","text":"By WILL WEISSERT, Associated Press WASHINGTON (AP) — Vice President Kamala Harris plans to propose on Wednesday a tenfold increase in federal tax incentives for small business startup expenses, from $5,000 to $50,000, hoping to help spur a record 25 million new small business applications over her four-year term should she win the presidency in November. She’s set to unveil the plan during a campaign stop in the Portsmouth area of New Hampshire — marking a rare deviation from the Midwestern and Sunbelt battlegrounds the Democrat has focused on in her race against former Republican President Donald Trump. A Harris campaign official, who spoke on the condition of anonymity to discuss a policy plan that hadn’t been released publicly, said Tuesday the change would cover the $40,000 it costs on average to start a business. The proposal would let new businesses wait to claim that deduction until they first turn a profit, to better maximize its impact lowering their taxes. Such changes would likely require congressional approval. But a series of tax cuts approved during the Trump administration are set to expire at the end of next year, setting up a scenario where lawmakers may be ready to consider new tax policies. The proposal can help Harris show her support for entrepreneurs even as she’s called for higher corporate tax rates. Since President Joe Biden dropped his reelection bid and endorsed Harris in July, the vice president has focused on campaigning in the “ blue wall ” states of Michigan, Wisconsin and Pennsylvania that have been the centerpiece of Democratic campaigns that have won the White House in recent decades. She’s also frequently visited Arizona, Nevada and Georgia, all of which Biden narrowly won in 2020, and North Carolina, which last voted Democratic in a presidential race in 2008 but which she’s still hoping to flip from Trump. Biden won New Hampshire by 7 percentage points in 2020, though Trump came far closer to winning it against Hillary Clinton in 2016. “The cost of living in New Hampshire is through the roof, their energy bills are some of highest in the country, and their housing market is the most unaffordable in history,” Trump posted last week on his social media platform. Harris’ team says securing 25 million new business applications in four years if she wins the White House would exceed the roughly 19 million such applications filed since Biden took office. And those were millions more than the previous four years under Trump. The vice president’s goal would be a record for new small business applications — but records only go back about 20 years. Applications to start a business don’t always translate to small businesses actually being formed. Still, Harris’ plan could keep new small businesses that do come to fruition from otherwise incurring more debt which, at a time of high interest rates, might help them better succeed. In the weeks since Harris took over the top of the Democratic ticket, she has offered relatively few major policy proposals — attempting to strike a political balance between injecting new energy into the race and continuing to support many of the Biden administration proposals she helped champion as vice president. Harris’ small business plan follows her announcing last month proposed steps to fight inflation by working to lower grocery prices, and to use tax cuts and other incentives to encourage homeownership. The vice president has also proposed ending federal taxes on tips to service industry workers, an idea Trump proposed first. The plan she’s introducing Wednesday further calls for developing a standard deduction for small businesses meant to save their owners time when doing their taxes, and making it easier to get occupational licenses — letting people work across state lines and businesses expand into new states. Harris also wants to offer federal incentives so state and local government will ease their regulations. In an effort to spur business investment outside urban and suburban hubs, Harris is pledging to launch a small business expansion fund to enable community banks and federal entities to cover interest costs while small businesses are expanding or otherwise creating jobs. Her team says those efforts will focus especially on areas that traditionally receive less investment.","summary":"The proposal can help Harris show her support for entrepreneurs even as she’s called for higher corporate tax rates.","url":"https://www.twincities.com/2024/09/03/harris-to-propose-tenfold-startup-tax-incentive-increase-she-says-will-spur-small-business-creation/","image":"https://www.twincities.com/wp-content/uploads/2024/09/AP24246814919308.jpg?w=1024","video":null,"publish_date":"2024-09-03 23:31:54","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.177},{"id":255573748,"title":"Harris to propose tenfold startup tax incentive increase she says will spur small business creation","text":"By WILL WEISSERT, Associated Press WASHINGTON (AP) — Vice President Kamala Harris plans to propose on Wednesday a tenfold increase in federal tax incentives for small business startup expenses, from $5,000 to $50,000, hoping to help spur a record 25 million new small business applications over her four-year term should she win the presidency in November. She’s set to unveil the plan during a campaign stop in the Portsmouth area of New Hampshire — marking a rare deviation from the Midwestern and Sunbelt battlegrounds the Democrat has focused on in her race against former Republican President Donald Trump. A Harris campaign official, who spoke on the condition of anonymity to discuss a policy plan that hadn’t been released publicly, said Tuesday the change would cover the $40,000 it costs on average to start a business. The proposal would let new businesses wait to claim that deduction until they first turn a profit, to better maximize its impact lowering their taxes. Such changes would likely require congressional approval. But a series of tax cuts approved during the Trump administration are set to expire at the end of next year, setting up a scenario where lawmakers may be ready to consider new tax policies. The proposal can help Harris show her support for entrepreneurs even as she’s called for higher corporate tax rates. Since President Joe Biden dropped his reelection bid and endorsed Harris in July, the vice president has focused on campaigning in the “ blue wall ” states of Michigan, Wisconsin and Pennsylvania that have been the centerpiece of Democratic campaigns that have won the White House in recent decades. She’s also frequently visited Arizona, Nevada and Georgia, all of which Biden narrowly won in 2020, and North Carolina, which last voted Democratic in a presidential race in 2008 but which she’s still hoping to flip from Trump. Biden won New Hampshire by 7 percentage points in 2020, though Trump came far closer to winning it against Hillary Clinton in 2016. “The cost of living in New Hampshire is through the roof, their energy bills are some of highest in the country, and their housing market is the most unaffordable in history,” Trump posted last week on his social media platform. Harris’ team says securing 25 million new business applications in four years if she wins the White House would exceed the roughly 19 million such applications filed since Biden took office. And those were millions more than the previous four years under Trump. The vice president’s goal would be a record for new small business applications — but records only go back about 20 years. Applications to start a business don’t always translate to small businesses actually being formed. Still, Harris’ plan could keep new small businesses that do come to fruition from otherwise incurring more debt which, at a time of high interest rates, might help them better succeed. In the weeks since Harris took over the top of the Democratic ticket, she has offered relatively few major policy proposals — attempting to strike a political balance between injecting new energy into the race and continuing to support many of the Biden administration proposals she helped champion as vice president. Harris’ small business plan follows her announcing last month proposed steps to fight inflation by working to lower grocery prices, and to use tax cuts and other incentives to encourage homeownership. The vice president has also proposed ending federal taxes on tips to service industry workers, an idea Trump proposed first. The plan she’s introducing Wednesday further calls for developing a standard deduction for small businesses meant to save their owners time when doing their taxes, and making it easier to get occupational licenses — letting people work across state lines and businesses expand into new states. Harris also wants to offer federal incentives so state and local government will ease their regulations. In an effort to spur business investment outside urban and suburban hubs, Harris is pledging to launch a small business expansion fund to enable community banks and federal entities to cover interest costs while small businesses are expanding or otherwise creating jobs. Her team says those efforts will focus especially on areas that traditionally receive less investment.","summary":"The proposal can help Harris show her support for entrepreneurs even as she’s called for higher corporate tax rates.","url":"https://www.bostonherald.com/2024/09/03/harris-to-propose-tenfold-startup-tax-incentive-increase-she-says-will-spur-small-business-creation-2/","image":"https://www.bostonherald.com/wp-content/uploads/2024/09/AP24246814919308.jpg?w=1024","video":null,"publish_date":"2024-09-03 23:31:54","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.177},{"id":255573826,"title":"How charismatic Christians are hoping to tip the election for Trump","text":"How charismatic Christians are hoping to tip the election for Trump One of former President Donald Trump's strongest support bases is evangelical Christians. Major Garrett explores how a group of charismatic Christians are hoping to help Trump win a tight election.","summary":"One of former President Donald Trump's strongest support bases is evangelical Christians. Major Garrett explores how a group of charismatic Christians are hoping to help Trump win a tight election.","url":"https://www.cbsnews.com/video/how-charismatic-christians-are-hoping-to-tip-the-election-for-trump/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/03/8627f607-2252-4661-818f-d5231872e57a/thumbnail/1200x630/38e767ef65c8ee7261c3fefe4e6103ff/cbsn-fusion-how-charismatic-christians-are-hoping-to-tip-the-election-for-trump-thumbnail.jpg?v=25685eaa472b1a5db","video":null,"publish_date":"2024-09-03 23:31:52","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.28},{"id":255573700,"title":"Letters: Newsom caves | Pleasanton schools | Homeless vets | Afghanistan blame | Inaccurate portrait | Harris unfit","text":"As usual, Newsom caves to Google Re: “Governor bows to Google, kills news payments” (Page A6, Aug. 30). Typical Gavin Newsom: Be for the little guy in public and for the big guys in private. So now Google (a $300 billion a year company) not only does not have to pay news organizations for using their content but Newsom is using taxpayer money to subsidize those same news organizations. He is the perfect example of why I stopped being a Democrat. By the way, in Canada, the government makes Google pay for using Canadian domestic content. Mike Poe San Leandro Vote for Flynn for Pleasanton school board Jen Flynn’s connection to our community as a Pleasanton resident, dedicated mom and former PTA president uniquely positions her to understand and address the needs of our schools. Her experience as a member of the superintendent’s Budget Advisory Committee further underscores her commitment to effective governance. Over the years Jen has dedicated her time and talent to PUSD — leading events that secured precious funding for critical programs or caring for students who needed a little extra encouragement on their way into school. Jen is committed to fostering communication between schools, families and teachers — a goal that ensures every voice is heard and valued. Her focus on teacher retention highlights her understanding of the role educators play in our children’s success. All of this and more makes her the ideal candidate to help guide our school district toward a brighter future. Amelia Shannon Pleasanton Homeless vets aren’t lacking for resources Re: “Supreme Court ruling could make homeless vets criminals” (Page A1, Sept. 1). This is a very manipulative and misleading article designed to paint a negative picture of the encampment sweeps. As a caseworker for a homeless nonprofit, I’ve worked with many homeless vets to replace their DD-214s and it’s a simple process with at least 10 organizations in the Bay Area and many online platforms that can assist for no charge. I have no doubt Erin Spencer has access to this support, especially as a vet, and if honorably discharged then he will qualify for the many housing opportunities made available just for vets. I believe his 10 years on the streets have nothing to do with a lack of attention and resources, and these sweeps are necessary for folks like Spencer, who need exactly this kind of structure. So please stop with these false narratives about the homeless. They serve no one except the advocates. Diana Bik Boeck Fremont Trump’s fingerprints are on Afghanistan debacle Re: “Trump tries to tie Harris to the Afghanistan withdrawal” (Page A3, Aug. 27). Donald Trump is trying to blame Kamala Harris for the chaotic Afghan exit while ignoring his own culpability. There’s no reason to think the Afghans wouldn’t have rushed the airfield or that ISIS wouldn’t have sent a suicide bomber if Trump had still been president. Americans who didn’t leave stayed of their own volition. The Taliban was actually helping Americans leave; they wanted them out too. The military equipment left behind was the equipment we gave to the Afghan army who deserted their posts after the collapse of the Afghan government — thank you, Trump. The real failure was the disastrous deal Trump made with the Taliban, who didn’t keep their end of the agreement. Trump’s withdrawal agreement with the Taliban excluded the Afghan government and freed 5,000 imprisoned Taliban soldiers even though the Taliban continued to attack Afghan government forces and welcomed al-Qaeda terrorists to thrive in the country. Frank Grygus San Ramon Media doesn’t paint accurate Harris portrait Re: “Trump aims for ‘manoverse’ vote” and “Takeways from Harris’ interview” (Page A4, Aug. 31). New York Times reporter Reid Epstein pans Kamala Harris’ interview responses as “risk averse,” “discursive” or rambling. For example, he criticizes Harris for not taking the bait on the “Day 1” question, presumably preferring that she would brag about “Day 1” executive orders like Donald Trump would. Instead of “dodging” such a symbolic and silly question, she provided a clear statement of her values and priorities. Asked about her feelings when Biden called, instead of “rambling” or “avoiding” she replied, “To be honest” she thought about him first. Epstein is apparently unable to credit that a person of integrity could truly feel concern and empathy for the president before focusing on herself. Objectively compare Trump’s rambling, deceitful and exaggerated interview responses with Harris and you will clearly see in Harris a thoughtful, values-driven leader who actually puts service to others first. Why does the New York Times consistently try to blur that image? Jamie Harris Lafayette Harris’ economic plans show that she’s unfit Several letters have questioned Donald Trump’s fitness for office. But what of Kamala Harris’s fitness? Her economic proposals are a disaster waiting to happen. They include: • Raising the corporate tax rate from 21% to 28%: This 33% tax hike would make American businesses less competitive globally. • Raising the capital gains tax rate to match the personal rate: This move would nearly double the capital gains tax rate, creating a huge disincentive to invest in America. • Ending the step-up in basis for estates: Harris wants to increase the death tax. • Taxing unrealized capital gains: Harris wants to tax gains in property and investments before they are realized. Harris has a lack of understanding of basic economics. She’s not fit to serve. Brian Kennedy Alameda","summary":"East Bay Times Letters to the Editor for Sept. 4, 2024","url":"https://www.mercurynews.com/2024/09/03/letters-1854/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/SJM-L-GOOGSEARCH-0902.jpg?w=1024","video":null,"publish_date":"2024-09-03 23:30:44","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.039},{"id":255574322,"title":"Congressional committee subpoenas Blinken over Afghanistan","text":"WASHINGTON >> The U.S. House of Representatives Foreign Affairs Committee subpoenaed Secretary of State Antony Blinken today, saying he had refused to appear before the panel to testify on the U.S. withdrawal from Afghanistan in August 2021. In a letter about the subpoena, Chairman Michael McCaul said Blinken must appear before the committee on Sept. 19 or face contempt charges, the committee said. State Department spokesperson Matthew Miller said Blinken was not currently available to testify on the dates proposed by the committee, but has proposed “reasonable alternatives” to comply with McCaul’s request for a public hearing. “It is disappointing that instead of continuing to engage with the Department in good faith, the Committee instead has issued yet another unnecessary subpoena,” Miller said in a statement. He said Blinken had testified before Congress on Afghanistan more than 14 times, including four times before McCaul’s committee. He also said State has provided the committee with nearly 20,000 pages of department records, multiple high-level briefings and transcribed interviews. McCaul asked Blinken in May to appear at a hearing in September on the committee’s report on its investigation of the withdrawal from Afghanistan. In his letter to Blinken, the Republican committee chairman said current and former State Department officials confirmed that Blinken was “the final decisionmaker” on the withdrawal and evacuation. “You are therefore in a position to inform the Committee’s consideration of potential legislation aimed at helping prevent the catastrophic mistakes of the withdrawal, including potential reforms to the Department’s legislative authorization,” McCaul wrote. The subpoena from McCaul’s committee, which has been investigating the deadly and chaotic withdrawal from Afghanistan for years, comes as events surrounding the pullback become an increasingly politicized issue ahead of the Nov. 5 elections. Former President Donald Trump, the Republican presidential nominee, visited Arlington National Cemetery late last month and took part in a wreath-laying ceremony honoring the 13 servicemembers killed during the U.S. withdrawal. He also visited Section 60 of the cemetery, where troops are buried and which is considered hallowed ground in the military. Federal law and Pentagon policies do not allow political activities in that section of the cemetery, but videos were taken by Trump’s campaign and used in advertisements. During a speech in Pennsylvania on Friday, Trump said families of service members who died in Afghanistan had asked him to go to the cemetery.","summary":"WASHINGTON >> The U.S. House of Representatives Foreign Affairs Committee subpoenaed Secretary of State Antony Blinken today, saying he had refused to appear before the panel to testify on the U.S. withdrawal from Afghanistan in August 2021.","url":"https://www.staradvertiser.com/2024/09/03/breaking-news/congressional-committee-subpoenas-blinken-over-afghanistan/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/09/web1_20240903_brk_abl01.jpg","video":null,"publish_date":"2024-09-03 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.093},{"id":255573580,"title":"Trump campaign must stop using Isaac Hayes song after lawsuit from family","text":"A federal judge in Atlanta ruled Tuesday that former President Donald Trump and his campaign must stop using the song \"Hold On, I'm Coming\" while the family of one of the song's co-writers pursues a lawsuit against the former president over its use.The estate of Isaac Hayes Jr. filed a lawsuit last month alleging that Trump, his campaign and several of his allies had infringed its copyright and should pay damages. After a hearing on the estate's request for an emergency preliminary injunction, U.S. District Judge Thomas Thrash ruled that Trump must stop using the song, but he denied a request to force the campaign to take down any existing videos that include the song.Hayes, who died in 2008 at age 65, and David Porter co-wrote \"Hold On, I'm Coming,\" a 1966 hit for soul duo Sam & Dave — made up of Sam Moore and the late David Prater Jr.Ronald Coleman, an attorney for Trump, told CBS News that the former president and his campaign had already ceased using the song. \"We're very gratified that the court recognized the First Amendment issues at stake and didn't order a takedown of existing videos,\" Coleman said. Hayes' son, Isaac Hayes III, told reporters he was \"very grateful and happy\" for the judge's decision.\"I want this to serve as an opportunity for other artists to come forward that don't want their music used by Donald Trump or other political entities and continue to fight for music artists' rights and copyright,\" he said.A string of artists and their heirs have objected to Trump using their songs during his events. After a Trump campaign rally in Bozeman, Montana, last month featured a video of Celine Dion performing \"My Heart Will Go On,\" her team put out a statement saying the singer didn't endorse that use of her song and saying \"in no way is this use authorized.\"Ahead of the 2020 election, Bruce Springsteen, Rihanna, Phil Collins, Pharrell, John Fogerty, Neil Young, Eddy Grant, Panic! at the Disco, R.E.M. and Guns N' Roses all objected to Trump using their songs.When he learned in 2022 that Trump had used \"Hold On, I'm Coming\" at an NRA rally, Porter tweeted \"Hell to the NO!\" But Sam Moore, of Sam & Dave, had performed \"America the Beautiful\" at a pre-inauguration concert for Trump and suggested in a sworn statement filed with the court over the weekend by Trump and his campaign that he was opposed to the action sought by Hayes' estate.Tuesday's ruling was a preliminary one and the litigation remains ongoing. The lawsuit filed by the estate of Isaac Hayes Jr. and Isaac Hayes Enterprises says Hayes and Porter were the owners of all rights to the song, including the copyright, and that Isaac Hayes Enterprises is the current owner.The lawsuit says Trump and his campaign began using the song in 2020 as \"outro\" music for his appearances and campaign events and has used it at least 133 times since then. Universal Music Group and Warner Chappell music, publishers contracted by Isaac Hayes Enterprises, sent a cease-and-desist letter to the Trump campaign in 2020, it says. Trump and his campaign never sought permission or consent from Hayes' estate or Isaac Hayes Enterprises until this year and have not obtained a valid public performance license for it, the lawsuit says. The song's use by Trump and his campaign constitutes \"false and/or misleading\" uses of Hayes' \"widely recognized celebrity and legacy\" and could deceive the public into believing there is an endorsement or business relationship between the plaintiffs and Trump and his campaign, the lawsuit says.The lawsuit says the plaintiffs have \"incurred significant economic damages\" as a result and argues that they should get actual and punitive damages for each proven infringement.Lawyers for Trump and his campaign wrote in a filing with the court that the Hayes estate and Isaac Hayes Enterprises, have failed to show that they own the copyright at issue and cannot show that they have suffered any harm. The campaign obtained a license from BMI Music in November 2022 authorizing it to use \"Hold On, I'm Coming,\" the filing says.The fact that the song can be heard as background music in some campaign videos is protected by the principle of fair use and \"cannot possibly have an effect on the market value of the Song,\" Trump's lawyers wrote. A sworn statement from Trump campaign deputy manager Justin Caporale submitted to the court says that \"out of respect for the pending litigation\" the campaign will no longer play the song at its events.In his statement filed with the court, Moore said Hayes' estate has made his biography and legacy the focus of the litigation, but that \"Isaac's is not the only significant biography and legacy involved in this matter.\" As one of the singers on \"Hold On, I'm Coming,\" Moore said that the public associates his voice, name and identity with the song \"at least as much, if not more, than the name of Isaac Hayes.\"Moore said all licensing for the song is controlled by Universal Music Group Publishing.Moore said he fears that if the court were to grant the wishes of Hayes' estate that he might be prohibited from ever appearing and performing the song at a Trump event during or after the election.","summary":"A federal judge in Atlanta has ruled that former President Donald Trump and his campaign must stop using the song \"Hold On, I'm Coming.\"","url":"https://www.cbsnews.com/news/trump-isaac-hayes-hold-on-im-coming-lawsuit/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/09/03/aa193956-e0a7-4d4e-945e-2e689afd9cfa/thumbnail/1200x630/ea42ca397dae2a6b19156320ebee7614/gettyimages-2168550472.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3167174_hls/master.m3u8","publish_date":"2024-09-03 23:26:09","author":"Donald Trump","authors":["Donald Trump"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.123},{"id":255573372,"title":"U.S. Election Stalls Major Automotive Investments in Mexico","text":"BYD, the Chinese electric vehicle giant, has paused its plans for a new plant in Mexico, awaiting the US election outcome. This decision reflects a broader industry trend, as companies like Tesla have similarly postponed significant investments. Focused on the potential economic policies of the next US administration, BYD’s cautious approach highlights the interplay between international business and politics. Originally, BYD explored three sites for the facility, with a preferred location near Guadalajara. This city, known as the “Silicon Valley of Mexico,” has become a tech hub over the past decade. Despite early enthusiasm and a site visit by a delegation in March, BYD is now stepping back. The company awaits the election results, particularly the possibility of Donald Trump’s re-election and his economic policies. However, this pause indicates strategic planning, as political changes could impact economic viability significantly. Strategic Delays and Political Uncertainty Tesla’s earlier decision to delay its megafactory in Nuevo Leon mirrors BYD’s caution. Elon Musk, Tesla’s CEO, raised concerns about possible tariffs on Mexican products if Trump returns to power. Such tariffs could affect the cost-effectiveness of manufacturing close to the US, Tesla’s largest market. Both companies’ strategic pauses highlight the delicate balance between international business and shifting political landscapes. These decisions are reactive measures to potential policy changes that could affect operational costs and business environments. As BYD and Tesla wait, the regions slated for these investments remain in anticipation. These pauses impact not only the companies but also the local economies that could benefit from such industrial activities. The future of these projects depends heavily on the political climate in the US. This illustrates how national elections can have global effects on business strategies and economic development. The unfolding scenario serves as a stark reminder of the wide-reaching impacts of political events. The outcomes of elections can influence more than domestic policy—they can also shape international manufacturing landscapes and economic growth.","summary":"BYD, the Chinese electric vehicle giant, has paused its plans for a new plant in Mexico, awaiting the US election outcome. This decision reflects a broader industry trend, as companies like Tesla have similarly postponed significant investments. Focused on the potential economic policies of the next US administration, BYD’s cautious approach highlights the interplay between [&#8230;]","url":"https://www.riotimesonline.com/u-s-election-stalls-major-automotive-investments-in-mexico/","image":"https://www.riotimesonline.com/wp-content/uploads/2024/09/FYX7ZKLUZVPRLM3LJPG3JC5EYI.webp","video":null,"publish_date":"2024-09-03 23:24:12","author":"Juan Martinez","authors":["Juan Martinez"],"language":"en","source_country":"br","sentiment":0.142},{"id":255573354,"title":"Kamala Harris suggests a significant tax break for over 25 million small businesses","text":"Vice President Kamala Harris is set to unveil a proposal to massively expand tax relief for small businesses as she continues to lay out her economic policy platform with just over 60 days to go before the election. The Democratic presidential nominee will travel to Portsmouth, New Hampshire, on Wednesday where she will announce a new goal for a record 25 million new business applications during her first term if elected. The proposal includes expanding the startup expense deduction for small businesses by tenfold from $5,000 to $50,000. Her latest pitch comes just weeks after Harris traveled to North Carolina last month to give her first policy address as the presidential nominee, an economic speech in Raleigh. There she announced her plan to tackle rising prices including a controversial plan to ban price gouging as well as steps to address housing affordability. With the expansion of the startup expense deduction, Harris will also call for small businesses to be able to wait to claim the deduction until after they turn a profit in an effort to reduce their taxes. According to the campaign, this would mean a small business with $15,000 in earnings its first year would be able to deduct that and then save the rest for future years and small businesses who have losses in the first year would be able to wait until later years to claim the deduction. The proposal is the latest part of what Harris is calling her ‘Opportunity Economy’ as she claims helping the middle class will be a top goal of her presidency starting on Day One. It costs an estimated $30,000 to $40,000 for startup and first year costs to start a small business in the United States, so expanding the deduction could provide much relief. However, it is not yet clear how much the proposal would cost the government or impact the national debt. Other components of the vice president’s economic plan would cost $1.7 trillion, the Committee for a Responsible Federal Budget estimated. The campaign said proposals beyond 2025 budget levels would be offset by increased taxes on corporations and high earners. Harris has backed tax hikes from the Biden administration including raising the corporate tax rate to 28% from 21% and raising the tax on stock buybacks to 4% from 1%. Like the president, the vice president has vowed not to raise taxes on anyone making less than $400,000. Any changes to tax policy must go through Congress, but lawmakers are facing a looming deadline with the expiration of some tax cuts next year from the law passed when Donald Trump was in office. The new goal Harris is setting for 25 million new business applications during her first term would exceed the current 19 million record, which was set during the Biden administration. On Wednesday, the vice president will also pitch several other efforts the campaign believes will cut red tape and make it easier for small businesses. They include developing a standard deduction for small businesses to save time and money, make it easier to obtain occupational licenses and incentivize state and local governments to make their own regulation changes to benefit small businesses. At the same time, Harris will call for helping existing small businesses through several steps. Among them, the vice president will aim to ensure one in three federal contract dollars go to small businesses during her first term. She will also call for a fund that help community development financial institutions (CDFIs) cover interest costs for small businesses expanding to locations and creating jobs in areas that have historically received fewer investments. Harris’ latest proposals come as the campaign has also taken to the airwaves with a series of ads highlighting her economic policy proposals in key states she needs to win come November. The vice president makes the economic pitch as recent polls show her in a tight race with Donald Trump, but when it comes to the issues, more voters have signaled they trust the Republican presidential nominee to handle the economy and inflation which skyrocketed coming out of the coronavirus pandemic.","summary":"Internewscast Journal\n\nInternewscast\n\n\nVice President Kamala Harris is set to unveil a proposal to massively&#8230;\n\n\nThis Post: Kamala Harris suggests a significant tax break for over 25 million small businesses first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/kamala-harris-suggests-a-significant-tax-break-for-over-25-million-small-businesses/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-Kamala-Harris-proposes-huge-new-tax-deduction.jpg","video":null,"publish_date":"2024-09-03 23:20:45","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.102},{"id":255573072,"title":"John McCain’s son Jimmy plans to vote for Kamala Harris, rebukes Trump’s Arlington debacle","text":"Lt. Jimmy McCain, son of late Republican Arizona Sen. John McCain, rebuked former President Donald Trump’s visit to Arlington Cemetery last week and revealed that he is now a registered Democrat who plans to vote for Vice President Kamala Harris. The McCain scion, who has spent over 17 years in the military, lambasted Trump for a “violation,” accusing the Republican presidential candidate of using the nation’s largest cemetery as a campaign event. “It’s a sacred area. There’s three generations of McCains that are buried there. It’s a violation,” he told CNN’s “The Lead with Jake Tapper” Tuesday. “The people who are buried there don’t have an opinion. “When you make it political, you take away the respect of the people who are there.” In a separate interview with CNN, Jimmy McCain, 36, underscored his disgust at the ordeal. “It just blows me away,” he told CNN. “These men and women that are laying in the ground there have no choice” in the matter. “I just think that for anyone who’s done a lot of time in their uniform, they just understand that inherently — that it’s not about you there. It’s about these people who gave the ultimate sacrifice in the name of their country.” Last week, Trump visited the country’s largest national cemetery to pay tribute to the 13 US service members who were killed in Abbey Gate after an ISIS-K suicide bomber detonated an explosive in 2021 during the chaotic withdrawal from the war-torn nation. Trump’s stop in the cemetery came during the three-year anniversary of that attack and he laid a wreath to honor the fallen. He later posed for photos with Gold Star families at the cemetery. That sparked swift backlash. While there isn’t a ban on taking photos at Arlington Cemetery, there are restrictions against “partisan political activities” there. An Army spokesperson blasted the Trump campaign and alleged that “ANC employee who attempted to ensure adherence to these rules was abruptly pushed aside.” Trump has denied accusations of a “conflict” at the cemetery. In the late 1990s, the late Sen. McCain (R-Ariz.) was forced to apologize after a campaign ad showed him walking in Arlington Cemetery in violation of that bar on political activity there. “You don’t spend that long in politics without messing up once or twice,” his son said. “If Donald Trump pulled it down and apologized, I mean, it would be the right thing to do.” However, citing Trump’s “history towards veterans,” the McCain scion argued that the 45th president wouldn’t “earn any points back” with him by apologizing for the ordeal. Early on during this 2016 presidential campaign, Trump infamously bashed Sen. McCain. “He’s a war hero because he was captured; I like people that weren’t captured,” he said. John McCain is widely regarded as a war hero, who was captured during the Vietnam War, tortured, and turned down a chance at an early release. He later helped normalize relations with Vietnam. Trump and the McCain family have feuded bitterly ever since. “I’ve never forgotten it,” he reflected on that flap. “To hear those things said about him, I can never forgive.” Jimmy McCain also revealed that several weeks ago, he switched his party affiliation from independent to Democrat, despite his family’s longstanding history with the GOP, including his father being the 2008 Republican presidential nominee. “I was gone for a year, so I didn’t have a chance to change,” he said. “I care about my family. I care about equal rights of everyone in this country. I care about all this. “I decided that it was time to move on.” Not everyone in his family agrees with the move. Meghan McCain, 39, put out a statement stressing that she has no intention of voting for either Harris or Trump. “I greatly respect the wide variety of political opinions of all of my family members and love them all very much. I however, remain a proud member of the Republican Party and hope for brighter days ahead. (Not voting for Harris or Trump, hope that clears things up),” she posted on X. Jimmy McCain also told CNN that he “would get involved in any way I could” to help get Harris over the finish line come Nov. 5. Harris and her campaign have been keen on spotlighting Republican defectors, including recently over 200 former Bush and McCain alumni who endorsed her. She’s also indicated that she’d put a Republican in her Cabinet.","summary":"Jimmy McCain also told CNN that he \"would get involved in any way I could” to help get Harris over the finish line come Nov. 5.","url":"https://nypost.com/2024/09/03/us-news/john-mccains-son-jimmy-to-vote-for-kamala-harris-slams-trumps-arlington-appearance/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/newspress-collage-j3ia3qdqv-1725399323467.jpg?quality=75&strip=all&1725384973&w=1200","video":"https://cdn.jwplayer.com/videos/q5JnU3CV-RyIcpnTz.mp4","publish_date":"2024-09-03 23:15:43","author":"Ryan King","authors":["Ryan King"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.168},{"id":255572844,"title":"He said, they said: Trump says no ‘fighting’ at Arlington – U.S. Army says otherwise","text":"You were mistaken if you thought Donald Trump was ready to move on from his visit to Arlington National Cemetery. On Tuesday, Trump breathed more life into the story when he pushed back on assertions made by the press and the U.S. Army itself that members of his staff had engaged in an altercation with ANC personnel. “The was no conflict or ‘fighting’ at Arlington National Cemetery last week. It was a made-up story by Comrade Kamala and her misinformation squad. She made it all up to make up for the fact that she and Sleepy Joe have BLOOD ON THEIR HANDS for the INCOMPETENT AFGHANISTAN Withdrawal – THE MOST EMBARRASSING DAY IN U.S. HISTORY!!!” Trump wrote via his Truth Social media platform. Trump’s stance comes after he was apparently invited to Arlington for an August 26 wreath-laying ceremony, which itself came on the three-year anniversary of the deaths of 13 American service members working to facilitate a speedy and hectic U.S. withdrawal from Afghanistan after nearly two decades at war. The visit drew the ire of veterans and military supporters alike after Trump’s campaign shared images of him standing over the graves of our nation’s most recently fallen military members while smiling and flashing a thumbs up for the camera. The area of the cemetery Trump was visiting, Section 60, strictly prohibits photography. That thumbs-up image and video taken of the event and later shared by the Trump campaign team were both prohibited by Army regulation and federal law. “Participants in the August 26th ceremony and the subsequent Section 60 visit were made aware of federal laws, Army regulations and DoD policies, which clearly prohibit political activities on cemetery grounds,” an Army spokesperson said in a statement. They said Arlington National Cemetery holds thousands of wreath-laying ceremonies each year. All of those were carried out without a problem until last week. “An ANC employee who attempted to ensure adherence to these rules was abruptly pushed aside. Consistent with the decorum expected at ANC, this employee acted with professionalism and avoided further disruption,” they said. Despite Trump’s claim the event did not take place, the Army said a report was filed with the relevant police agency, though no charges will be forthcoming. “The incident was reported to the JBM-HH police department, but the employee subsequently decided not to press charges. Therefore, the Army considers this matter closed,” they said. Trump has said he was invited to be at the event by the grieving families, and that they gave permission for his staff to film and photograph his visit. Even if that is the case, Trump, his staff, and Gold Star families do not have the authority to suspend Army regulation or U.S. law as they see fit. Vice President Kamala Harris, the Democratic nominee to the presidency, took to social media over the weekend to lambaste Trump’s use of the nation’s most hallowed ground for political purposes. On Tuesday, her campaign pointed out that this week is the four-year anniversary of Trump’s infamous “suckers” and “losers” comments, which he allegedly made to gold-star father and four-star Gen. John Kelly while refusing to visit a WWI cemetery in Europe. “We should never forget that Donald Trump disparaged our fallen service members as ‘suckers’ and ‘losers.’ Even all these years later, it remains shocking, disturbing, and simply un-American. No one seeking America’s highest office should ever talk about our fallen heroes this way. It’s disqualifying. Trump has repeatedly attacked and demeaned our service members, veterans, and military families, and his reckless policies threaten to gut their hard-earned benefits,” Harris-Walz 2024 Spokesperson Joseph Costello said in a statement.","summary":"On Tuesday, Trump breathed more life into the story when he pushed back on assertions made by the press and the U.S. Army itself that members of his staff had engaged in an altercation with ANC personnel.","url":"https://www.bostonherald.com/2024/09/03/he-said-they-said-trump-says-no-fighting-at-arlington-u-s-army-says-otherwise/","image":"https://www.bostonherald.com/wp-content/uploads/2024/08/Election_2024_Trump_23257_3f0739.jpg?w=1024","video":null,"publish_date":"2024-09-03 23:11:17","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.277},{"id":255572790,"title":"Trump refuses to disclose details of his Ukrainian peace plan until election victory","text":"NEW YORK, September 4. /TASS/. US Republican presidential candidate Donald Trump has refused to disclose details of his plan on peaceful settlement of the Ukrainian conflict, saying that his ideas can be put into practice only if he wins the November election. \"I think the deal, I wouldn't talk about it too much, because I think I can make a deal if, if I win as President Elect, I'll have a deal made, guaranteed,\" he said in an interview to blogger Lex Fridman, posted on the X social network. \"I have a very exacting plan, how to stop Ukraine and Russia, and I have a certain idea, maybe not a plan, but an idea for China but I can't give you those plans, because if I give you those plans, I'm not going to be able to use them,\" the former US president added. Trump has repeatedly pledged to resolve the conflict in Ukraine before his inauguration, if elected. He also said that if he wins the upcoming election, he will personally address Russian President Vladimir Putin and Ukrainian President Vladimir Zelensky with a call to start negotiations. The US presidential election will be held on November 5. The Democratic Party was supposed to be represented by incumbent President Joe Biden, but after his failed performance in his June debate with Republican candidate Donald Trump, calls for the incumbent head of state to pull out grew louder among Democrats. On July 21, he decided to withdraw from the race and endorse Harris for the country’s top office. She formally accepted the nomination at the Democratic National Convention in Chicago, Illinois.","summary":"Trump has repeatedly pledged to resolve the conflict in Ukraine before his inauguration, if elected","url":"https://tass.com/world/1837805","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2024-09-03 23:04:47","author":"Tass","authors":["Tass"],"language":"en","catgory":"politics","source_country":"RU","sentiment":-0.261},{"id":255572372,"title":"These pollsters were right in 2016 and 2020 — and they think Harris has already lost her mojo","text":"Most swing state polls show Vice President Kamala Harris leading in the swing states that will decide the election. But two southern state pollsters are bucking the trend — and they’ve got former President Donald Trump up big. The polling by InsiderAdvantage and Trafalgar in seven battleground states finds Trump on a path to 296 electoral votes — suggesting that Harris has already lost her momentum. Matt Towery of Georgia-based InsiderAdvantage found Trump ahead in Arizona, Nevada and North Carolina (and down by 0.4% only in Georgia). He noted that both he and Robert Calahy of Trafalgar (which handled Pennsylvania, Wisconsin and Michigan) were both in the top 3 of pollsters in the ‘16 and ‘20 cycles because their methodology allows them to “pick up some Trump vote that some of the other pollsters might not be able to get.” To be sure, all of Trump’s leads are narrow and within the margin of error — meaning the states could still very well go either way on Election Day. But, Towery believes Harris is stalling now that her novelty has worn off. “The momentum that we were seeing after the Democratic National Convention has sort of come to an end,” Towery said. And surges in Democratic enthusiasm seen in polls after Harris replaced Biden have also slowed, and are now “close to parity,” he said. The “turnout election” will be shaped heavily by next week’s “make or break” presidential debate, he believes. If Trump presents a “realistic” version of himself, “this could become a real turning point like the Carter-Reagan debate that basically sealed the deal” in 1980, Towery predicted. For his part, South Carolina-based Calahy agreed about the debate’s importance. He said that it’s possible that the former president may say something that “overshadows” the rest of the event — but that Harris has “the most to lose” and is in a “no-win situation.” Calahy sees “conservative Democrats” coming over to Trump’s side in numbers that exceed crossover for Harris, and also suggests that her disinterest in interviews has left the media feeling “ignored” and “angry.” But despite the polling looking good for Trump, Calahy cautions the “Democratic machine” can shave “a point or 2” off of the spread. Therefore, a narrow lead in September may not be the final outcome.","summary":"The polling in seven battleground states finds Trump on a path to 296 electoral votes — and suggests the momentum of the race has already shifted away from Harris.","url":"https://nypost.com/2024/09/03/us-news/kamala-harris-has-already-lost-momentum-pollsters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/88877613.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/G2IhRhLZ-RyIcpnTz.mp4","publish_date":"2024-09-03 22:57:34","author":"A.g. Gancarski","authors":["A.g. Gancarski"],"language":"en","source_country":"us","sentiment":-0.474},{"id":255572870,"title":"Investigating Hamas’ complex financial network and Kamala’s potential for censorship: expert opinions.","text":"According to Jim Geraghty from the National Review, Hamas’s utilization of the regulated international financial system suggests that its supporters probably have entry to the US financial system. Hamas isnÃ¢ÂÂt Ã¢ÂÂdesignated as a terrorist group in Switzerland, the United Arab Emirates, the Kingdom of Saudi Arabia, Bahrain, or Turkey,Ã¢ÂÂ which Ã¢ÂÂgives the group quite a few banking and financial options.Ã¢ÂÂ And a bombshell from The Economist Ã¢ÂÂnoted last November that one of the key countries for financing HamasÃ¢ÂÂs operations is our NATO ally, Turkey,Ã¢ÂÂ whose Ã¢ÂÂbanking system helps Hamas dodge American sanctions by conducting complex transactions across the world.Ã¢ÂÂ HamasÃ¢ÂÂs $1 billion Ã¢ÂÂfinancial empire has been painstakingly crafted to avoid Western sanctions.Ã¢ÂÂ This makes it Ã¢ÂÂout of reach for Israel and its allies.Ã¢ÂÂ Ã¢ÂÂThe chances that a President Kamala HarrisÃ¢ÂÂ would avoid Ã¢ÂÂarm-twisting social media companies into censorshipÃ¢ÂÂ are Ã¢ÂÂnot great,Ã¢ÂÂ laments The Free PressÃ¢ÂÂ Abigail Shrier. And Ã¢ÂÂthanks to a recent Supreme Court ruling,Ã¢ÂÂ thereÃ¢ÂÂd be Ã¢ÂÂlittle to stopÃ¢ÂÂ her. Even before the Jan. 6 riot, Harris demanded Twitter ban President Donald Trump: Social-media companies, she fumed, speak Ã¢ÂÂdirectlyÃ¢ÂÂ to Ã¢ÂÂmillions of people without any level of oversight or regulation, and that has to stop.Ã¢ÂÂ Now, notes Shrier, Harris has tapped Rob Flaherty, the Biden official who pressured Facebook to suppress Post reports on the COVID vaccine, as her deputy campaign manager. The problem? The court ruled only social-media companies, not users, can sue the government for censorship Ã¢ÂÂ and Ã¢ÂÂwhat company will take the riskÃ¢ÂÂ of government retaliation? Ã¢ÂÂA federal judge ruled that a lawsuit by Elon Musk against Media Matters can move forward in what could prove a significant case not just for the liberal outlet but the entire media industry,Ã¢ÂÂ reports Jonathan Turley at The Hill. The suit centers on a MM Ã¢ÂÂreport suggesting that advertisements of major corporations were being posted next to pro-Nazi posts or otherwise hateful content on the platformÃ¢ÂÂ; it accuses MM of Ã¢ÂÂmanipulating the algorithms to produce the pairing alleged.Ã¢ÂÂ Most media Ã¢ÂÂare overwhelmingly hostile towardÃ¢ÂÂ the suit because it Ã¢ÂÂdirectly challenges the ability of media outlets to create false narratives to advance a political agenda.Ã¢ÂÂ To claims that Ã¢ÂÂBrazilÃ¢ÂÂs banning and blocking of the social media platform X is far more extreme than anything being proposed in the United States,Ã¢ÂÂ Michael Shellenberger counters at X that Kamala Harris and Tim Walz have Ã¢ÂÂboth repeatedly endorsed the three main censorship tactics used by the Brazilian government: censorship of election Ã¢ÂÂmisinformation,Ã¢ÂÂ de-platforming political opponents, and cross-platform bans.Ã¢ÂÂ Ã¢ÂÂHis Twitter account should be shut down,Ã¢ÂÂ said Harris of then-President Donald Trump in 2019. Walz has claimed Ã¢ÂÂthat the First Amendment does not protect hate speech and misinformation.Ã¢ÂÂ While Ã¢ÂÂneither Harris nor Walz called for completely banning and blocking social media platforms,Ã¢ÂÂ Shellenberger notes, Ã¢ÂÂthe severity of their callsÃ¢ÂÂ for Ã¢ÂÂgovernment regulationÃ¢ÂÂ of social-media platforms comes all too close. Ã¢ÂÂIn California, New York, Pennsylvania, and Nevada, it is now possible to vote in person without any form of identification,Ã¢ÂÂ warns TabletÃ¢ÂÂs Armin Rosen. Even Ã¢ÂÂpoor and farawayÃ¢ÂÂ Somaliland Africa requires its citizens Ã¢ÂÂobtain an identification card from the electoral commission months in advance of the vote.Ã¢ÂÂ Unlike Somaliland, Ã¢ÂÂmost Americans no longer have to physically show up at a polling place to vote.Ã¢ÂÂ US voting systems allow the Ã¢ÂÂchoice of filling out and submitting their ballots beyond the observation of election officials,Ã¢ÂÂ which offers Ã¢ÂÂno assurance that the people in whose names ballots are cast actually signed Ã¢ÂÂ or saw Ã¢ÂÂ their ballots.Ã¢ÂÂ All of this is Ã¢ÂÂpractically calibrated to produce mistrust, and to create broad segments of public opinion that believe the whole thing is fake Ã¢ÂÂ regardless of who wins.Ã¢ÂÂ Ã¢ÂÂ Compiled by The Post Editorial Board","summary":"Internewscast Journal\n\nInternewscast\n\n\nAccording to Jim Geraghty from the National Review, Hamas&#8217;s utilization of the&#8230;\n\n\nThis Post: Investigating Hamas&#8217; complex financial network and Kamala&#8217;s potential for censorship: expert opinions. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/investigating-hamas-complex-financial-network-and-kamalas-potential-for-censorship-expert-opinions/","image":"https://internewscast.com/wp-content/uploads/2024/09/HamasA¢AA-intricate-web-of-finances-Kamala-will-censor-and-other.jpg","video":null,"publish_date":"2024-09-03 22:54:05","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.111},{"id":255572328,"title":"Exact amount Prince Harry and Meghan Markle's Colombia trip cost the country","text":"The total cost of Prince Harry and Meghan Markle's visit to Colombia last month has been disclosed. The Sussexes embarked on a four-day tour of the South American nation, where they visited a school, played volleyball, and raised awareness about online bullying and misinformation. Colombian Vice President Francia Marquez invited the couple to visit her country after viewing the Duke and Duchess' Netflix documentary, which touched on some of their difficulties as part of the Royal Family, troubles which would ultimately see the couple step back from their royal duties. As such, Harry and Meghan's four-day tour was branded \"quasi-royal,\" without all of the typical pomp and ceremony of a formal visit. But amid the ongoing disagreement between the Prince and his father King Charles over who should foot the bill when Harry and his family are in the UK, some has raised concerns about the strain their visit could put on the Colombian state. These concerns led to Senator Maria Fernanda Cabal filing a request for figures that have revealed the scale of costs inflicted by the visit. The Colombian government shelled out a measly £44,725.14 for the couple's transportation and security during their four-day stay, the Express reports. For a sense of scale, the Metropolitan Police spent a whopping £3.5m on security during Donald Trump's three-day 2019 State Visit, and King Charles spent £117,000 on just transportation when visiting France last year. During this visit, the French President Emmanuel Macron spent an eye-watering £400,000 on just dinner with the King, something which brought his office into disrepute when it emerged in July. At the time, King Charles said: \"Your generosity of spirit brings to mind how my family and I were so greatly moved by the tributes paid in France to my mother, the late queen.” Francia Marquez, the Colombian VP, revealed these figures in response to Senator Maria Fernanda Cabal's request. Senator Cabal criticised the trip as \"showmanship\" and \"wasteful spending.\" However, Ms Marquez confirmed that Harry and Meghan covered their own flight and accommodation expenses and branded the visit a success. The breakdown shows that £7,500 was spent on security for their visit to San Basilio de Palenque, a former slave town, while £4,500 was allocated for security in Cali, where the couple enjoyed live performances from a youth organisation. Following the tour, Andres Escobar, a right-wing councillor for the city of Cali, took to social media to slam the Sussexes' visit, although he subsequently removed his post. He remarked: \"We continue with an ancient practice: handing over our resources in exchange for smoke and mirrors.\" \"Billions that could have been used to expand coverage of children's soup kitchens, pay salaries for community mothers, seed capital for Afro communities or adapt sports venues that are practically in ruins.\"","summary":"The Colombian government released the figures for the security and transport costs of the Sussexes' four-day tour of the country last month, which were out of kilter with the usual costs of a royal visit","url":"https://www.mirror.co.uk/news/royals/exact-amount-prince-harry-meghan-33594275","image":"https://i2-prod.mirror.co.uk/news/royals/article33594272.ece/ALTERNATES/s1200/0_harry-and-meghan-were-in-colombia-for-four-days.jpg","video":null,"publish_date":"2024-09-03 22:53:19","author":"Charlie Bradley,William Morgan","authors":["Charlie Bradley","William Morgan"],"language":"en","catgory":"entertainment","source_country":"gb","sentiment":0.146},{"id":255572448,"title":"Trump creates rift in anti-abortion movement","text":"Trump creates rift in anti-abortion movement Former President Donald Trump has created a rift in the anti-abortion movement, with some seeing him as a champion and others perceiving him as a traitor to the cause. NOTUS reporter Oriana González joins to discuss.","summary":"Former President Donald Trump has created a rift in the anti-abortion movement, with some seeing him as a champion and others perceiving him as a traitor to the cause. NOTUS reporter Oriana González joins to discuss.","url":"https://www.cbsnews.com/video/trump-creates-rift-in-anti-abortion-movement/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/03/72fbe8ec-4d00-42fc-aec3-29b5de53c913/thumbnail/1200x630/bd70404157540aa5928091fc791a3cf4/cbsn-fusion-trump-creates-rift-in-anti-abortion-movement-thumbnail.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-09-03 22:51:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.034},{"id":255572446,"title":"Some Gold Star families stand by Trump after Arlington incident","text":"Some Gold Star families stand by Trump after Arlington incident Some Gold Star families are defending former President Donald Trump amid the controversy over his visit to Arlington National Cemetery. Several of them are also criticizing Vice President Kamala Harris in an ad from the Trump campaign. CBS News Confirmed verification producer James LaPorta has details.","summary":"Some Gold Star families are defending former President Donald Trump amid the controversy over his visit to Arlington National Cemetery. Several of them are also criticizing Vice President Kamala Harris in an ad from the Trump campaign. CBS News Confirmed verification producer James LaPorta has details.","url":"https://www.cbsnews.com/video/some-gold-star-families-stand-by-trump-after-arlington-incident/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/03/0eb84c7c-3373-4cab-ae0b-6394a7be8b0e/thumbnail/1200x630/74da1acc7e63d28ed97dcd147db41275/cbsn-fusion-some-gold-star-families-stand-by-trump-after-arlington-incident-thumbnail.jpg?v=25685eaa472b1a5dbb5bd","video":null,"publish_date":"2024-09-03 22:47:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.193},{"id":255572862,"title":"Judge denies Trump’s second attempt to transfer New York hush money case to federal court","text":"A federal judge on Tuesday denied former President Donald Trump’s second and last ditch bid to transfer his New York hush money case to federal court. U.S. District Judge Alvin Hellerstein of the Southern District of New York found that there was no good cause to grant Trump’s lawyers permission to even file a motion. The judge’s order said that in arguing “good cause” to move the case, Trump primarily argued that the state judge presiding over the criminal case, Juan Merchan, is biased against him and that the U.S. Supreme Court’s immunity ruling from July presents a valid federal defense for the hush money case. Hellerstein rejected both arguments, finding first that a state court judge’s alleged bias does not present a federal question that would justify jurisdiction in a federal court. Hellerstein also held that his July 2023 conclusion he had made that removal of the case was not warranted — which followed briefing and an evidentiary hearing — remained the same because “the hush money payments were private, unofficial acts, outside the bounds of executive authority.” Hellerstein rejected a similar attempt last year, but Trump’s attorneys argued the U.S. Supreme Court’s ruling on presidential immunity in a separate Trump criminal case presents a valid federal defense to his conviction. The judge’s decision comes after prosecutors in New York urged Merchan not to allow Trump’s eleventh-hour effort to move the case to federal court to prevent him from ruling on pending motions in the historic state criminal case. Trump has asked Merchan to set aside the jury’s verdict because it allegedly relied on evidence of Trump’s “official,” and therefore immune, conduct, but also has requested that Merchan delay his sentencing until after the November election. Both motions are still pending. “Federal law is clear that proceedings in this Court need not be stayed pending the district court’s resolution of defendant’s removal notice,” the DA’s letter said. It also added that “the concerns defendant expresses about timing are a function of his own strategic and dilatory litigation tactics: This second notice of removal comes nearly ten months after defendant voluntarily abandoned his appeal from his first, unsuccessful effort to remove this case; three months after he was found guilty by a jury on thirty-four felony counts; and nearly two months after defendant asked this Court to consider his CPL § 330.30 motion for a new trial.” The DA’s office opposes Trump’s efforts to overturn the verdict and contends the impact of the “official acts” that were referred to in the case were negligible. Merchan is expected to rule on that matter Sept. 16 — two days before Trump’s sentencing. Prosecutors have also said they would defer to the judge on pushing back the Sept. 18 date in order to give Trump “adequate time” to try an appeal, but also urged him to pronounce sentence “without unreasonable delay.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nA federal judge on Tuesday denied former President Donald Trump&#8217;s second and&#8230;\n\n\nThis Post: Judge denies Trump&#8217;s second attempt to transfer New York hush money case to federal court first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/judge-denies-trumps-second-attempt-to-transfer-new-york-hush-money-case-to-federal-court/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-09/240903-donald-trump-se-1115a-1d5d9d.jpg","video":null,"publish_date":"2024-09-03 22:46:53","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.618},{"id":255572248,"title":"Donald Trump pleads not guilty in special counsel’s retooled January 6 case","text":"(CNN) — Former President Donald Trump is pleading not guilty to the charges laid out in special counsel Jack Smith’s retooled election subversion indictment against him in federal court. The pleading came in a Tuesday court filing, which also indicated he wished to be excused from appearing in person at an upcoming court hearing in the case. “I, President Donald J. Trump, the above-named defendant … do hereby waive my right to be present at Arraignment and I authorize my attorneys to enter a plea of not guilty on my behalf to each and every count of the superseding indictment,” Trump told the court in a one-page filing that included his bold, black signature. “I further state that I have received a copy of the superseding indictment and reviewed it with my counsel.” Thursday will mark the first court hearing before Judge Tanya Chutkan since the case was paused for the US Supreme Court to determine the extent of presidential immunity to which Trump is entitled. Chutkan said later Tuesday that Trump does not have to appear at the hearing Thursday – when the former president’s formal arraignment will occur. Trump’s attorneys plan to attend the hearing. Chutkan, of the DC District Court, will have to decide how to proceed with the criminal case over efforts to overturn the 2020 presidential election, including setting a schedule. She must also decide whether prosecutors can take Trump to trial and be able to call certain witnesses, such as former Vice President Mike Pence. The new indictment, approved by a grand jury last week, requires Trump to enter a new pleading. While prosecutors cut back some of the allegations against the former president in light of the Supreme Court ruling, Trump faces the same four criminal charges as before. The-CNN-Wire™ & © 2024 Cable News Network, Inc., a Time Warner Company. All rights reserved.","summary":"(CNN) — Former President Donald Trump is pleading not guilty to the charges laid out in special counsel Jack Smith’s retooled election subversion indictment against...","url":"https://wsvn.com/news/politics/donald-trump-pleads-not-guilty-in-special-counsels-retooled-january-6-case/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/240830_Trump_Michigan_rally.jpg?quality=60&strip=color","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/40dac187-80c2-4482-8bba-f77b1fb86407/54145f3c-5ad3-4aac-a596-96458f41ff53/main.mp4?fastly_token=NjZkN2U5ZGNfNzViZGFkZTEzNDc0OGIzOTVhMzRkOTU3MjQ3NTlkNzc3M","publish_date":"2024-09-03 22:46:35","author":"Kevin Boulandier","authors":["Kevin Boulandier"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.043},{"id":255571850,"title":"Kamala Harris is on the wrong side in the global war on free speech","text":"Free speech is under attack across the globe — and the United States is the next front in the battle. On Monday, Brazil’s Supreme Court upheld a judge’s ruling that shut down X for refusing to obey government censorship demands. The decision came days after France arrested Telegram CEO Pavel Durov, and Hong Kong convicted two journalists of sedition for publishing material critical of the government. And in November, American voters must decide if they want the government to limit what they can hear and read, censor the scientific information they can receive and restrict the political views they’re exposed to — because all that is part of how Kamala Harris defines “freedom.” Democrats are claiming that they’re the party of freedom, but Harris’ track record shows she’s the enemy of our most fundamental liberty: free speech. She has long sought to use government power to muzzle those who disagree with her. Meta CEO Mark Zuckerberg’s letter to the House Judiciary Committee last week should frighten every American who values free expression. Better late than never, Zuckerberg called it “wrong” that the Harris-Biden administration strong-armed Facebook to take down posts indicating masks don’t work and COVID vaccines might produce side effects. Zuckerberg said, “I regret we were not more outspoken about it.” Zuckerberg’s letter confirms evidence already presented to the US Supreme Court, as well as in congressional testimony, that the Harris-Biden administration repeatedly pressured social media companies to censor — getting them to do the dirty work the First Amendment prohibits government from doing directly. Three days after Zuckerberg’s letter made headlines, CNN’s Dana Bash interviewed Harris — and never asked about her role in censoring social media. That’s journalistic malpractice. Harris did tell Bash that “my values haven’t changed.” That’s for sure. Harris chose as her deputy campaign manager Rob Flaherty, formerly the White House director of digital strategy — the person who called the shots about what got censored under President Biden. Flaherty was cited in federal court filings as meeting and corresponding with officials at Facebook, Twitter and other online platforms, demanding they act aggressively against posts spreading COVID-19 “misinformation.” Promoting Flaherty is a red flag that a Harris-Walz administration aims to snuff out your core freedoms. X owner Elon Musk isn’t mincing words about the threat Harris poses to free speech. “The attacks this year on free speech are unprecedented in the 21st century,” Musk posted Friday. “It will happen in America too if Kamala/Walz gain power.” His warning came shortly after Brazilian Supreme Court Justice Alexandre de Moraes blocked X within his country, imposing steep fines on anyone there who tries to use the platform. The judge’s rationale will sound frighteningly familiar: He suspended X, he wrote, to protect democracy. In 2022, de Moraes was given sweeping powers to restrict and remove “disinformation” about the outcome of Brazil’s highly contested presidential election. Musk had repeatedly flouted Moraes’ censorship commands. The judge’s justification for shutting down X in Brazil mirrors Harris’ efforts to censor political opponents here. In 2019, as California’s attorney general, Harris lobbied then-Twitter CEO Jack Dorsey to ban President Donald Trump from the platform. “How is that not a violation of free speech?” CNN’s Jake Tapper asked her, adding that such a move would result in “a slippery slope where they have to ban — you know, half the people on Twitter.” In reply, Harris doubled down, insisting that free online expression is a “privilege” and that censorship is necessary to defend “our democracy” from those who spread misinformation. That’s the vernacular of tyrants. And what about Harris’ deeds? As California AG in 2016, she tried to enforce a state law compelling pregnancy centers run by religious organizations to give their clients information offering state-funded abortions — in short, compelling these centers to advertise that which violated their beliefs. The law, which Harris defended in federal court, was ultimately defeated when the US Supreme Court ruled against it. In another unsuccessful end-run around the First Amendment, AG Harris tried to compel conservative nonprofits in California to release their donors’ names, an effort the Supreme Court ruled was an unconstitutional intimidation of donors that violated their First Amendment rights. Even the usually ultra-liberal American Civil Liberties Union opposed Harris’ demand. Harris has been an enemy of the First Amendment throughout her career. On August 18, as he suspended his campaign, Robert F. Kennedy Jr. discussed his “alarm” at Harris’ and Biden’s “resort to censorship, media control, and weaponization of the federal agencies“ — an ongoing assault that he called “an attack on our most sacred right of free expression.” Zuckerberg, Musk and Kennedy — unlikely bedfellows, to be sure. But all recognize the same danger. Trump pledges to end government censorship. Harris is promising a $6,000 handout to new parents to “buy a car seat . . . baby clothes, a crib.” Americans, don’t sell out your children’s freedom. Betsy McCaughey is a former lieutenant governor of New York.","summary":"American voters must decide if they want the government to limit what they can read and restrict the political views they’re exposed to — all part of how Kamala Harris defines “freedom.”","url":"https://nypost.com/2024/09/03/opinion/musks-brazil-free-speech-fight-will-be-ours-if-harris-wins/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/newspress-collage-5cwsdccz9-1725401008188.jpg?quality=75&strip=all&1725389105&w=1200","video":null,"publish_date":"2024-09-03 22:45:25","author":"Betsy McCaughey","authors":["Betsy McCaughey"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.088},{"id":255571294,"title":"Hamas’ intricate web of finances, Kamala will censor and other commentary","text":"Terror beat: Hamas’ Intricate Web of Finances “Hamas’s global financial footprint and use of the regulated international financial system means that its facilitators likely have access to the US financial system,” thunders National Review’s Jim Geraghty. Hamas isn’t “designated as a terrorist group in Switzerland, the United Arab Emirates, the Kingdom of Saudi Arabia, Bahrain, or Turkey,” which “gives the group quite a few banking and financial options.” And a bombshell from The Economist “noted last November that one of the key countries for financing Hamas’s operations is our NATO ally, Turkey,” whose “banking system helps Hamas dodge American sanctions by conducting complex transactions across the world.” Hamas’s $1 billion “financial empire has been painstakingly crafted to avoid Western sanctions.” This makes it “out of reach for Israel and its allies.” Media watch: Kamala Will Censor “The chances that a President Kamala Harris” would avoid “arm-twisting social media companies into censorship” are “not great,” laments The Free Press’ Abigail Shrier. And “thanks to a recent Supreme Court ruling,” there’d be “little to stop” her. Even before the Jan. 6 riot, Harris demanded Twitter ban President Donald Trump: Social-media companies, she fumed, speak “directly” to “millions of people without any level of oversight or regulation, and that has to stop.” Now, notes Shrier, Harris has tapped Rob Flaherty, the Biden official who pressured Facebook to suppress Post reports on the COVID vaccine, as her deputy campaign manager. The problem? The court ruled only social-media companies, not users, can sue the government for censorship — and “what company will take the risk” of government retaliation? Legal take: Musk’s Media Matters Suit . . . Matters “A federal judge ruled that a lawsuit by Elon Musk against Media Matters can move forward in what could prove a significant case not just for the liberal outlet but the entire media industry,” reports Jonathan Turley at The Hill. The suit centers on a MM “report suggesting that advertisements of major corporations were being posted next to pro-Nazi posts or otherwise hateful content on the platform”; it accuses MM of “manipulating the algorithms to produce the pairing alleged.” Most media “are overwhelmingly hostile toward” the suit because it “directly challenges the ability of media outlets to create false narratives to advance a political agenda.” Iconoclast: Harris-Walz v. Free Speech To claims that “Brazil’s banning and blocking of the social media platform X is far more extreme than anything being proposed in the United States,” Michael Shellenberger counters at X that Kamala Harris and Tim Walz have “both repeatedly endorsed the three main censorship tactics used by the Brazilian government: censorship of election ‘misinformation,’ de-platforming political opponents, and cross-platform bans.” “His Twitter account should be shut down,” said Harris of then-President Donald Trump in 2019. Walz has claimed “that the First Amendment does not protect hate speech and misinformation.” While “neither Harris nor Walz called for completely banning and blocking social media platforms,” Shellenberger notes, “the severity of their calls” for “government regulation” of social-media platforms comes all too close. Eye on elex: US Voting System Breeds Mistrust “In California, New York, Pennsylvania, and Nevada, it is now possible to vote in person without any form of identification,” warns Tablet’s Armin Rosen. Even “poor and faraway” Somaliland Africa requires its citizens “obtain an identification card from the electoral commission months in advance of the vote.” Unlike Somaliland, “most Americans no longer have to physically show up at a polling place to vote.” US voting systems allow the “choice of filling out and submitting their ballots beyond the observation of election officials,” which offers “no assurance that the people in whose names ballots are cast actually signed — or saw — their ballots.” All of this is “practically calibrated to produce mistrust, and to create broad segments of public opinion that believe the whole thing is fake — regardless of who wins.” — Compiled by The Post Editorial Board","summary":"“Hamas’s global financial footprint and use of the regulated international financial system means that its facilitators likely have access to the US financial system,” thunders National Review’s Jim Geraghty.","url":"https://nypost.com/2024/09/03/opinion/hamas-intricate-web-of-finances-kamala-will-censor-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/newspress-collage-ip28imq2q-1725402032966.jpg?quality=75&strip=all&1725387752&w=1200","video":null,"publish_date":"2024-09-03 22:40:59","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.067},{"id":255571992,"title":"Federal judge rejects Trump’s request to intervene in wake of hush money conviction","text":"NEW YORK — A federal judge on Tuesday swiftly rejected Donald Trump’s request to intervene in his New York hush money criminal case, thwarting the former president’s latest bid to overturn his felony conviction and delay his sentencing. U.S. District Judge Alvin Hellerstein denied Trump’s lawyers permission to file paperwork asking the U.S. District Court in Manhattan to take control of the case. He said they had failed to satisfy the burden of proof required for a federal court to seize the case from the state court where Trump was convicted in May. The ruling leaves Trump’s case in state court, where he is scheduled to be sentenced Sept. 18. Trump’s lawyers had sought to move the case to federal court so they could then seek to have the verdict overturned and the case dismissed in the wake of the U.S. Supreme Court’s ruling granting ex-presidents immunity from prosecution for official acts. Hellerstein, who denied Trump’s request last year to move the case to federal court, said nothing about the Supreme Court’s July 1 ruling affected his “previous conclusion that the hush money payments” at issue in Trump’s case “were private, unofficial acts, outside the bounds of executive authority.” Hellerstein sidestepped a defense argument that Trump had been the victim of “bias, conflicts of interest, and appearances of impropriety” at the hands of the judge who presided over the trial in state court, Juan M. Merchan. “This Court does not have jurisdiction to hear Mr. Trump’s arguments concerning the propriety of the New York trial,” Hellerstein wrote in a four-page decision. Instead, Hellerstein noted, Trump can pursue a state appeal or, after exhausting that path, seek review from the U.S. Supreme Court. “It would be highly improper for this Court to evaluate the issues of bias, unfairness or error in the state trial,” Hellerstein wrote. “Those are issues for the state appellate courts.” Hellerstein’s ruling came hours after Trump’s lawyers filed paperwork seeking his permission to pursue federal court intervention. Trump’s lawyers had initially asked the federal court to step in last week, but their papers were rejected because they hadn’t first obtained Hellerstein’s permission to file them, as required. Messages seeking comment were left with Trump’s lawyers and the Manhattan district attorney’s office, which prosecuted the case. Earlier in the day Tuesday, Manhattan prosecutors raised objections to Trump’s effort to delay post-trial decisions in the case while he sought to have the federal court step in. The Manhattan district attorney’s office argued in a letter to the judge presiding over the case in state court that he had no legal obligation to hold off on post-trial decisions and wait for Hellerstein to rule. Prosecutors urged the trial judge, Juan M. Merchan, not to delay his rulings on two key defense requests: Trump’s call to delay sentencing until after the November election, and his bid to overturn the verdict and dismiss the case in the wake of the U.S. Supreme Court’s presidential immunity ruling. Merchan has said he will rule Sept. 18 on Trump’s motion to overturn the verdict. His decision on delaying sentencing has been expected in the coming days. Trump was convicted in May of 34 felony counts of falsifying business records to conceal a $130,000 hush money payment to porn actor Stormy Daniels, whose affair allegations threatened to disrupt his 2016 presidential run. Trump has denied her claim and said he did nothing wrong. Falsifying business records is punishable by up to four years behind bars. Other potential sentences include probation or a fine. In a letter Tuesday, Assistant District Attorney Matthew Colangelo reiterated that prosecutors have not staked a position on whether to delay sentencing, deferring to Merchan on an “appropriate post-trial schedule.” Trump’s lawyers have argued that sentencing Trump as scheduled, just two days after Merchan’s expected immunity decision, would not give him enough time to weigh the next steps – including a possible appeal – if Merchan rules to uphold the verdict. They also argued that sentencing Trump about seven weeks before Election Day would be election interference, raising the specter that Trump could be sent to jail as early voting is getting underway. Colangelo said Tuesday that prosecutors were open to a schedule that allows “adequate time” to adjudicate Trump’s motion to set aside the verdict while also sentencing him “without unreasonable delay.” In a letter to Merchan last week, Trump’s lawyers said delaying the proceedings is the “only appropriate course” as they seek to have the federal court rectify a verdict they say was tainted by violations of the Republican presidential nominee’s constitutional rights and the Supreme Court’s ruling that gives ex-presidents broad protections from prosecution. The Supreme Court’s immunity ruling reins in prosecutions of ex-presidents for official acts and restricts prosecutors in pointing to official acts as evidence that a president’s unofficial actions were illegal. Trump’s lawyers have argued that prosecutors rushed to trial instead of waiting for the Supreme Court’s presidential immunity decision, and that prosecutors erred by showing jurors evidence that should not have been allowed under the ruling, such as former White House staffers describing how Trump reacted to news coverage of the hush money deal and tweets he sent while president in 2018. Trump’s lawyers had previously invoked presidential immunity in a failed bid last year to get the hush money case moved from state court to federal court.","summary":"The former president's lawyers wanted to get the case moved to federal court so they could try to get the verdict overturned and the case dismissed.","url":"https://www.centralmaine.com/2024/09/03/federal-judge-rejects-trumps-request-to-intervene-in-wake-of-hush-money-conviction/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/09/Trump_Hush_Money_29125_a6687d.jpg?w=1000","video":null,"publish_date":"2024-09-03 22:32:16","author":"Michael R. Sisak,MICHAEL R. SISAK - Associated Press","authors":["Michael R. Sisak","MICHAEL R. SISAK - Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.261},{"id":255571690,"title":"Where Harris and Trump are focusing campaign efforts","text":"Where Harris and Trump are focusing campaign efforts Vice President Kamala Harris and former President Donald Trump are both traveling through battleground states this week. The Harris campaign officially launched its \"fighting for reproductive freedom\" bus tour Tuesday in Florida. Meanwhile, Trump is scheduled to address a Fraternal Order of Police event in Charlotte, North Carolina, on Friday. CBS News political correspondent Caitlin Huey-Burns and CBS News campaign reporter Aaron Navarro have more.","summary":"Vice President Kamala Harris and former President Donald Trump are both traveling through battleground states this week. The Harris campaign officially launched its \"fighting for reproductive freedom\" bus tour Tuesday in Florida. Meanwhile, Trump is scheduled to address a Fraternal Order of Police event in Charlotte, North Carolina, on Friday. CBS News political correspondent Caitlin Huey-Burns and CBS News campaign reporter Aaron Navarro have more.","url":"https://www.cbsnews.com/video/where-harris-and-trump-are-focusing-campaign-efforts/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/03/837db367-dbda-44d1-bd69-f8c35d82ee43/thumbnail/1200x630/c3d3ac31147a507140f6e22db0327310/cbsn-fusion-where-harris-and-trump-are-focusing-campaign-efforts-thumbnail.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-09-03 22:32:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.406},{"id":255572054,"title":"Judge denies Trump's 2nd attempt to move his hush money case into federal court","text":"A federal judge has denied former President Donald Trump's second attempt to remove his New York hush money case from state court into federal court. Trump had asked the federal court to intervene and delay his sentencing after he was convicted of all 34 counts of falsifying business records. \"Nothing in the Supreme Court's opinion affects my previous conclusion that the hush money payments were private, unofficial acts, outside the bounds of executive authority,\" U.S. District Judge Alvin Hellerstein wrote in an order Tuesday. Trump's sentencing is scheduled to take place on Sept. 18. Trump was found guilty in May on 34 felony counts of falsifying business records related to a hush money payment to adult film actress Stormy Daniels in order to boost his electoral prospects in the 2016 presidential election. He has said he will appeal the decision. Earlier Tuesday, the Manhattan district attorney's office, in a letter to the judge overseeing the case, argued that there is no reason to delay the sentencing. \"We note that the concerns defendant expresses about timing are a function of his own strategic and dilatory litigation tactics: This second notice of removal comes nearly ten months after defendant voluntarily abandoned his appeal from his first, unsuccessful effort to remove this case; three months after he was found guilty by a jury on thirty-four felony counts; and nearly two months after defendant asked this Court to consider his CPL 330.30 motion for a new trial,\" Tuesday's letter said. The district attorney's office declined to take a position on when Trump's sentencing should occur, leaving it to the discretion of the judge. The former president has asked Merchan to postpone the sentencing until after the November election and also to throw out the case based on presidential immunity. Judge Merchan has not yet issued rulings on either of those requests.","summary":"Trump's sentencing is scheduled to take place on Sept. 18.","url":"https://abc7news.com/politics/judge-denies-attempt-to-move-trump-hush-money-case-into-federal-court/15264722/","image":"https://cdn.abcotvs.com/dip/images/15264691_donald-trump-NYC-case-file-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/ccg/090324-cc-ABCNL-3p-trump-NY-case-VID.mp4","publish_date":"2024-09-03 22:31:37","author":"Aaron Katersky And Peter Charalambous,ABCNews","authors":["Aaron Katersky And Peter Charalambous","ABCNews"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.398},{"id":255571132,"title":"Judge denies Trump's 2nd attempt to move his hush money case into federal court","text":"A federal judge has denied former President Donald Trump's second attempt to remove his New York hush money case from state court into federal court. Trump had asked the federal court to intervene and delay his sentencing after he was convicted of all 34 counts of falsifying business records. \"Nothing in the Supreme Court's opinion affects my previous conclusion that the hush money payments were private, unofficial acts, outside the bounds of executive authority,\" U.S. District Judge Alvin Hellerstein wrote in an order Tuesday. Trump's sentencing is scheduled to take place on Sept. 18. Trump was found guilty in May on 34 felony counts of falsifying business records related to a hush money payment to adult film actress Stormy Daniels in order to boost his electoral prospects in the 2016 presidential election. He has said he will appeal the decision. Earlier Tuesday, the Manhattan district attorney's office, in a letter to the judge overseeing the case, argued that there is no reason to delay the sentencing. \"We note that the concerns defendant expresses about timing are a function of his own strategic and dilatory litigation tactics: This second notice of removal comes nearly ten months after defendant voluntarily abandoned his appeal from his first, unsuccessful effort to remove this case; three months after he was found guilty by a jury on thirty-four felony counts; and nearly two months after defendant asked this Court to consider his CPL 330.30 motion for a new trial,\" Tuesday's letter said. The district attorney's office declined to take a position on when Trump's sentencing should occur, leaving it to the discretion of the judge. The former president has asked Merchan to postpone the sentencing until after the November election and also to throw out the case based on presidential immunity. Judge Merchan has not yet issued rulings on either of those requests.","summary":"Trump's sentencing is scheduled to take place on Sept. 18.","url":"https://abc13.com/politics/judge-denies-attempt-to-move-trump-hush-money-case-into-federal-court/15264722/","image":"https://cdn.abcotvs.com/dip/images/15264691_donald-trump-NYC-case-file-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/ccg/090324-cc-ABCNL-3p-trump-NY-case-VID.mp4","publish_date":"2024-09-03 22:31:37","author":"Aaron Katersky And Peter Charalambous,ABCNews","authors":["Aaron Katersky And Peter Charalambous","ABCNews"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.398},{"id":255571328,"title":"Indian Industry Ready to Adjust To Any Regime in USA after November Prez Polls","text":"By Subrata Majumder Come November 5, global futurists are scrambling to anticipate how a second term of Trump’s Presidency bode for the world and India. According to the latest opinion poll by New York Times, Kamala Harris has marginal edge over Trump. But, it does not foretell the demise of Trump chances for second term. Indian industry people are closely monitoring the poll speeches of the two Presidential candidates Kamala Harris and Donald Trump and trying to assess their relevance to the India-US business relations. Indian business people have felt with both first term of Trump and the present term of the Democratic President Joe Biden. They have not found much difference in the trade and business relationship. But some of the industry leaders feel that Trump’s economic policies may be helpful to India in expanding its domestic market and exports. Kamala Harris, though half Indian by heritage, does not augur well for special priority on USA-India relations, they feel. Reality lies with the background during Biden administration, when strengthening of US-India relation was geared by Presidential initiative, rather than vice president Harris’s Indian heritage. For this section of industry, it is a mix of concern and comforts. If Trump comes back to power. Trump’s emphatic focus on protectionism is a matter of concern. At the same time Trump’s hard stand against China bodes well for India s India will be far more competitive against China in the export market as the Chinese products will be higher priced as a result of US measures against China. Donald Trump said he will impose 10 percent import tariff on all nations and 60 percent on China. His America First will get a push to instill confidence of Americanization in every policy where “Every decision on trade, on immigration, on foreign affairs will be made to benefit American workers and American families”, which was outlined during Trump’s first term. How will India shift gear on the line of USA’s “America First” Policy? Past experiences show a different template. Despite India losing Special Status (GSP scheme) in USA trade policy during Trump’s first term (2017-21) and USA harping on non-reciprocal entry, USA continued to be one of the biggest entry of Indian products. It became three times biggest trading partner, with India exporting and importing less. India exports mainly four products to USA. They were diamonds and jewellery, apparels and textile, oil refinery products and pharmaceuticals. If Trump imposes 10 percent import tariff, imports of these 4 products groups should be affected. But, the reality lies somewhere else. The biggest export item by India to USA is diamond and jewellery. Apparently, import tariff should impact India’s export of diamond and jewellery. But, there is a catch. India has an edge over its competitors, such as Israel and Belgium. India is the largest cutting and polishing centre of rough diamond in the world. US bridals prefer for customize design of India. Similarly, Indian pharmaceutical industry play an important role in US market. According to a report, Indian companies account for about 47 percent of generic prescriptions filed in USA by 2022.The core issue of trade partnership with USA is that India continued to be the surplus trade partner, despite Trump’s protectionist policy. Notwithstanding these contentious issues, India’s exports to USA spurred during the Trump period. In other words, India’s export to USA remained resilient despite Trump’s withdrawing of Special status to India. During 2017-18 to 2020-21, India’s export to USA jumped by over 59 percent. Its surplus trade balance widened further from US$21.3 billion in 2017-18 to US$ 22.8 billion in 2020-21. Indo-Pacific region will emerge an important pivot in Trump’s second term, which will showcase a turning point of Trump led USA –India relation. USA will play key role in the newly formed IPEF (Indo Pacific Economic Forum). In this new dynamics, where India will also sit in the driver seat, USA-India relation will witness a different template, according to these industry people. India will have to brace for two challenges with new Trump’s America .First, trade and second immigration. Given India’s protracted surplus trade with USA, it is obvious Trump administration will press hard on balancing trade surplus with India. Trump’s administration will press for stringent non-reciprocal entry in USA. This means Trump will enforce India to import more from USA to counter balance the surplus.. Currently, major items of imports from USA are oil refinery goods and edible products like nuts. Another important issue will be restriction on immigration. During the first term, Trump administration blocked visas for wide variety of jobs for non-Americans, including those for computer programming and other skilled workers under HI-B visa. Stephen Miller, the architect of Trump immigration policy has restricted the immigration, arguing that they harm employment prospect of Americans. India is the biggest beneficiary of HI B visa .Annually, more than 70 percent of HI B visa is issued to Indian applicants. Trump administration will surely lay down restriction on India’s IT professionals entry in USA to protect the Americans for jobs. Another issue, which attracts attention against Trump’s conservative policy is that during his first term US investment in India boomed. It increased five times in India – from US$ 2.1 billion in 2017-18 to US$ 10.5 billion in 2021-22. This demonstrates Trump‘s wide outlook to promote American investment in India in big Indian market and a far reaching bigger role in Indo-Pacific region. Given these, Trump’s returning back in power does not bode ill to India. With upcoming of IPEF (Indo Pacific Economic Forum ), which let USA to play Big Brother role to counterbalance China and Indian Prime Minister Narendra Modi taking the driver seat, Trump’s administration is likely to be more moderate than before, these sources feel. Experts on India-US relations say that the trade and investment relations do not depend solely on official policies, the personal relationship also plays a role. Narendra Modi had established a personal rapport with Donald Trump during his tenure due to the commonality of conservatism. But Kamala Harris is different. She is a human rights lawyer, a bit leftwing and quite opposed to the agenda of Hindutva pursued in India and also in USA by Narendra Modi’s party. The Hindu groups in US were closer to Trump in his first term. The same will not be happening if Kamala comes to power. So the Prime Minister Narendra Modi will have to establish a fresh equation with Kamala if she comes to power. It is not difficult in view of her deep Indian connections.. Our PM is expert in cultivating ties and making new friends. If that happens, it will be far easier for the Indian industry to emerge stronger in the coming years by getting larger US direct investment and technology and also expanding the export market. In any case, Indian industry is resilient enough to adjust with any regime in USA. (IPA Service)","summary":"By Subrata Majumder Come November 5, global futurists are scrambling to anticipate how a second term of Trump’s Presidency bode for the world and India. According to the latest opinion poll by New York Times, Kamala Harris has marginal edge over Trump. But, it does not foretell the demise of Trump chances for second term. Indian industry people are closely monitoring the poll speeches of the two Presidential candidates Kamala Harris and Donald Trump and trying to assess their relevance [&#8230;]\n\n\nThe post Indian Industry Ready to Adjust To Any Regime in USA after November Prez Polls appeared first on Daily Excelsior.","url":"https://www.dailyexcelsior.com/indian-industry-ready-to-adjust-to-any-regime-in-usa-after-november-prez-polls/","image":"https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2024/09/kamala.jpg","video":null,"publish_date":"2024-09-03 22:30:24","author":"Daily Excelsior","authors":["Daily Excelsior"],"language":"en","source_country":"in","sentiment":-0.003},{"id":255570836,"title":"Donald Trump Reacts to Rumors of 'Tension' With Joe Rogan","text":"Former President Donald Trump dismissed any reports of \"tension\" between himself and Joe Rogan after the podcaster praised independent candidate Robert F. Kennedy Jr. amid the 2024 presidential election.During a one-on-one interview with popular podcaster Lex Fridman that aired Monday, Trump was asked about his recent comments on social media about Rogan, who in August said during an episode of The Joe Rogan Experience that Kennedy was \"the only [candidate] that makes sense.\"Trump responded to Rogan's comments in a post to his Truth Social a day later, suggesting that Rogan would be \"booed\" at the next Ultimate Fighting Championship (UFC) event he attends. Rogan is a commentator for the UFC and has one of the most popular podcasts on streaming platform Spotify, with 14.5 million followers.Fridman pressed Trump for the \"story behind the tension\" with Rogan, saying he would \"love to see\" the former president join Rogan for an episode of his podcast.The former president responded that he didn't \"think there was any tension\" with Rogan, adding, \"I've always liked him, but I don't know him. I only see him when I walk into the arena with [UFC President Dana White] and I shake his hand.\"\"I see him there, and I think he's good at what he does, but I don't know about doing his podcast,\" Trump continued. \"I mean, I guess I'd do it, but I haven't been asked, and I'm not asking them, you know.\"Trump has recently made several appearances on popular podcasts and streaming platforms in a push to heighten support among younger male voters before November.Recent polling from The New York Times and Siena College shows that men, particularly ages 18 to 29, are far more likely to back Trump than women in the same age bracket. The 2024 election has the potential to garner one of the biggest gender divides in history, according to preliminary polling—while Trump was found to be leading Vice President Kamala Harris by 14 points among male voters in the Times/Siena College poll, and Harris was shown ahead among women voters by 21 points.At the start of last month, Trump sat down with 23-year-old Adin Ross, a well-known live-streamer on the platform Kick and popular among conservatives. He also sat for an interview with influencer Logan Paul in June, who has over 23.6 million subscribers on YouTube, and spoke with X owner and billionaire Elon Musk in a livestreamed interview last month, which Trump claimed reached 1 billion people. It was unclear what he was referencing with the 1 billion figure.Newsweek reached out to Trump's campaign via email for comment on Tuesday.","summary":"The former president sat down with podcast Lex Fridman in his latest effort to reach younger male voters.","url":"https://www.newsweek.com/donald-trump-reacts-rumors-tension-joe-rogan-1948275","image":"https://d.newsweek.com/en/full/2463546/trump-says-he-has-notension-rogan.jpg","video":null,"publish_date":"2024-09-03 22:29:43","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.063},{"id":255571002,"title":"Top Democrats defend Harris' shifting policy positions, calling her a 'good leader'","text":"Over the long Labor Day weekend, Democratic officials defended Vice President Kamala Harris from criticisms that she has been flip-flopping on various policy positions. \"I think it's a sign of a good leader, that they learn and evolve over time,\" Colorado Gov. Jared Polis told ABC's \"This Week\" on Sunday. \"Most voters recognize that as you get more information, as you get more experience, perhaps as you hold a different job… that there would be a natural evolution,\" echoed Rep. Brendan Boyle, D-Penn., during a Labor Day appearance on CNN. Meanwhile, Rep. Ro Khanna, D-Calif., took a different approach when he appeared on NBC's \"Meet The Press\" over the weekend, describing her as a \"progressive who [is] pragmatic\" and one who is \"consistent\" in her policy approach. BILL MAHER MOCKS FLIP FLOPS FROM HARRIS AND WALZ IN CNN INTERVIEW: ‘JUST INSULTING MY INTELLIGENCE’ During her first interview as the Democratic nominee on Thursday, Harris insisted she would \"enforce\" the law against illegal border crossings, something Harris indicated she was against while running her 2019 campaign to become president. ‘FOR ELECTION PURPOSES’: CRITICS BALK AT HARRIS' CLAIM SHE WILL ‘ENFORCE OUR LAWS' AT SOUTHERN BORDER Harris also argued that she made it clear as the vice presidential nominee in 2020 that she does not wish to ban fracking, despite indicating as a presidential nominee in 2019 that she was \"in favor of banning fracking\" on federal land. \"This idea that she hasn't been consistent — I mean what about Donald Trump's flip-flops? What about his flip-flops on abortion?\" Khanna questioned Sunday. \"I think the vice president is consistent on the position on fracking. It's exactly how Joe Biden ran.\" On healthcare, campaign officials have said Harris does not support Medicare for All. However, Harris has yet to share publicly that she is not in favor of a single-payer health care system after indicating during a 2019 debate that she would \"abolish\" private healthcare in favor of a \"government-run plan.\" Fox News Digital reached out to the Harris campaign for clarity on Harris' position when it comes to healthcare, but did not receive a response. \"I ran against her as a co-chair of Bernie Sanders' campaign — she was not for Medicare for All in that 2020 primary,\" Khanna said. Polis and Boyle, meanwhile, acknowledged Harris' changing positions but argued they were signs of good leadership. \"Whether it's a move to the middle, the left, the right, it's really about what works. Kamala Harris is a pragmatic leader who looks at data and science and makes the best decisions she can,\" Polis said. \"I do not have 100% of the same positions today that I first had 15 years ago when I was first elected to office,\" Boyle told CNN in reference to Harris' stance on fracking. \"That’s part of growing. I think that’s natural. The bottom line is, did you ultimately arrive at the position that is right on policy, and in the case of Kamala Harris, she did.\" CLICK HERE TO GET THE FOX NEWS APP Boyle also charged Trump with being far more inconsistent on his policy positions than Harris. \"There just is no comparison between Kamala Harris and the constant, unending flip-flops, on most issues, of Donald Trump,\" he said.","summary":"Over the Labor Day weekend several Democrats hit the cable networks to push back against claims that Vice President Kamala Harris&apos; has been inconsistent in her approach to policy.","url":"https://www.foxnews.com/politics/democrats-defend-harris-changing-policy-stances-i-think-its-sign-good-leader","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Kamala-Harris-Savannah-rally-August-29-2024-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-09-03 22:25:35","author":"Alec Schemmel","authors":["Alec Schemmel"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.285},{"id":255572976,"title":"JD Vance endorsed a Heritage Foundation report in 2017, and it has come back to haunt him","text":"Since he became Donald Trump's running mate, Sen. JD Vance has had to defend multiple comments from his past about women and families that have resurfaced. And new reporting on Vance's stamp of approval for a 2017 document from the Heritage Foundation could lead to more backlash. The document in question is the “Index of Culture and Opportunity” put together by the Heritage Foundation to analyze cultural and economic trends from a conservative perspective. Vance, who had not yet entered politics and was chiefly known as the author of “Hillbilly Elegy,” wrote an introduction for the report, praising it for “shed[ding] needed light on our country’s most difficult and intractable problems.” And as The New York Times has pointed out, he was also the keynote speaker at the release of the report. The document includes essays that espouse right-wing talking points, targeting single-parent households, divorce rates, welfare programs and housing assistance. In one article, author Jennifer Lahl, the president of an anti-abortion organization, writes that women should have children at a younger age and decries the use of fertility treatments like in vitro fertilization to delay pregnancy until women are older. The resurfacing on Tuesday of Vance's involvement in the 2017 document comes as Trump continues to attempt to distance himself from the Heritage Foundation, which authored Project 2025 as a blueprint for his second term. Trump has also tried to moderate his party's radical stance on reproductive rights, claiming just last week that he would make his administration or insurance companies cover the cost of IVF if he is re-elected (he did not explain how he would accomplish this). Vance's involvement with the 2017 report is not the same as a full-throated endorsement of every position in the document. But throughout his political career, he has sided with some of his party's most extreme factions on abortion, even likening the procedure at one point to slavery. Vance has called for a federal abortion ban in the past, though he recently insisted that Trump would veto such legislation if he’s re-elected. Vance also voted this year against a bill in the Senate to codify protections for IVF. With Vance's radical positions on women and children already under a microscope, reports of further associations with the Heritage Foundation may threaten another scandal for the Trump campaign, even as they underscore Vance's deep ties with the leaders of the organization.","summary":"New reporting on Sen. JD Vance's stamp of approval for a 2017 document from the Heritage Foundation could hurt his popularity even further.","url":"https://www.msnbc.com/top-stories/latest/jd-vance-ivf-heritage-foundation-2017-report-rcna169411","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-08/220827-jd-vance-cs-9c1ea6.jpg","video":null,"publish_date":"2024-09-03 22:23:59","author":"Clarissa-Jan Lim","authors":["Clarissa-Jan Lim"],"language":"en","source_country":"US","sentiment":-0.067},{"id":255570454,"title":"Kamala Harris Has a Massive Lead Among Black Voters. It May Not Be Enough.","text":"Vice President Kamala Harris is winning support from an overwhelming number of Black Americans, but that still may not be enough to defeat former President Donald Trump in key swing states in November.Black voters are a key group of Harris' coalition, as they have backed Democrats by massive margins in past presidential elections, despite the small but significant GOP inroads made in 2020.Republicans are optimistic they can continue gaining ground among Black voters, as some polls suggest Harris is falling behind past Democratic candidates like former President Barack Obama or former Secretary of State Hillary Clinton. Some polls even show her numbers among Black voters running behind President Joe Biden's 2020 polling.Whether or not Harris, who is Black, can win big margins among Black Democrats could make the difference in key swing states Pennsylvania and Georgia, two of the states most likely to determine the outcome of the election.A Suffolk University poll released on Tuesday showed that Harris' polling numbers among Black voters are weaker than previous Democratic nominees, including Biden. The difference may not appear drastic, but could matter in states that could be decided by only a few thousand votes.The poll, which surveyed 1,000 likely voters from August 25 to 28, showed Harris leading Trump by 64 points among Black voters (76% to 12%). It found Harris leading Trump among all voters by just over 4 points (47.6 to 43.3%).A similar poll released on Labor Day four years ago showed Biden with a 78% lead among Black voters (82 percent to 4 percent). It surveyed 1,000 registered voters from August 28 to August 31, 2020.Meanwhile, a Suffolk poll released just after Labor Day 2016 showed Clinton with an 88-point lead among Black voters (92% to four percent). The same poll from August 2012 showed Obama with a 71-point lead among Black voters (77% to 6%).David Paleologos, the director of the Suffolk University Political Research Center, told Newsweek on Tuesday that Harris likely needs to win Black voters by a net of 85 percentage points over Trump, or she could be in danger of losing key states.Harris had made \"great strides\" but is still \"falling short of where she needs to be,\" he said, pointing to a drop in Democratic support among Black men between the ages of 18 and 34.\"Harris could still win Wisconsin without the exact same support levels of black voters if she improves her standing in the suburban and rural areas of the Badger state,\" he said.Michigan and Pennsylvania will be critical, too. \"Both of those states rely on big margins (13-1) coming out of Detroit and Philadelphia to offset most of the red counties in the rest of those states. If she only wins the black communities 8-1, it will be very challenging,\" Paleologos said.Andrea Benjamin, a professor at the University of Oklahoma, told Newsweek that neither candidate should take Black voters for granted, and that Harris should emphasize issues that matter most to Black voters, such as the cost of housing, reproductive rights and voting rights. These are issues she noted that most middle and working class Americans, regardless of their race, may find common ground.Current polls may not necessarily be indicative of how Black voters will vote in November, she said. Previous Democratic presidential candidates had more time to build trust among the electorate, and that many voters may have felt \"more confident in what they were doing\" further out from the election, she said.Candidates should also work with community leaders to build trust among Black voters in key states, having a \"state level plan,\" rather than bring in people who are not connected to local communities to try to get out the vote. Voters respect \"authentic outreach,\" she said.\"Relying on networks that are already active and have the community respect. To me that's the place I would start, because if a random person knocks on my door and tells me I have to vote, I can sort of take it or leave it. But when it's someone that I know from my community, I might be a little more receptive,\" she said.Harris Has Reversed 'Bleak' Polling: Dem StrategistMatt McDermott, a Democratic strategist who serves as the senior vice president of Whitman Insight Strategies, believesHarris will be able to match past Democrats' performance among Black voters, noting that the number of Black voters considering Trump continues to fall.\"Polling earlier this year was bleak: showing Biden losing up to 35% of Black voters to either third party candidates like RFK Jr. or to the Republican nominee Donald Trump. Since Kamala Harris became the Democratic nominee, polls are now finding fewer than 20% of Black voters would consider a candidate other than the Democratic nominee, with that figure steadily falling,\" he said.However, he said what is \"more important\" than her margin is that Black voters have become more engaged and likely to vote since she became a candidate, and her polling gains have with them have made the race more competitive in states with a high percentage of Black voters.\"Kamala Harris' entrance into this race has fundamentally upended the electoral map and put states like Georgia and North Carolina into battleground status. Harris has opened up multiple pathways to 270 thanks to her support among Black voters,\" he said.Both Harris and Trump are making plays to increase their share of the Black vote. Harris, who would become the first Black and Asian woman elected president if elected, has has emphasized her economic policies, such as an aggressive housing plan, over her identity. Even without a laser focus on identity, her candidacy has seen Black voters come back around to the party after surveys earlier this year found Biden losing support.Meanwhile, Trump last month spoke at a National Association of Black Journalists panel, where he was interviewed by several Black journalists. The appearance sparked immediate and widespread criticism after he questioned Harris' racial identity, saying during that panel that she \"happened to turn Black.\"Conservatives have sought to win over Black voters by highlighting her stance on immigration, as polls suggest the issue may be her biggest weakness among various racial groups. Republicans have specifically sough to win over Black men, a key voting bloc polls suggest have trended toward the GOP.To that point, NBC News reported last month that conservative groups are highlighting the Biden administration's efforts to ban menthol cigarettes, which government data shows is more likely to be used by Black smokers, in key states in an effort to dull their support for Harris. The Biden administration meanwhile punted the menthol ban until after the election, seeing its potential problem with Black voters.Newsweek reached out to the Harris campaign for comment via email.Comparison to Past RacesA recent YouGov poll delivered better numbers for Harris among black voters. The survey, conducted among 1,368 registered voters from August 25 to August 27, showed Harris with a 69-point lead over Trump among Black voters (81% to 12%).This marks an improvement from where their poll showed Biden polling among Black voters four years prior, as an August 27 to August 28, 2020 showed Biden with only a 64-point lead over Trump among Black voters (7% to 11%).Still, it found Harris polling behind where Clinton or Obama were among Black voters around this time in the cycle.An August 2016 YouGov poll showed Clinton with a 76-point lead over Trump among Black voters (82% to 6%), while an August 2008 poll showed Obama with an 82-point lead (85% to 3%).Elsewhere, a Quinnipiac University poll, conducted among 1,611 likely voters from August 23 to August 27, found Harris with a 55-point lead among Black voters (75% to 20%).A poll four years earlier, conducted among 1,081 likely voters from August 28 to August 31, 2020, found Biden with a 58-point lead (74% to 16%).While some polls suggest Harris may still have work to do to improve her margins among Black voters, an earlier Suffolk poll showed that she reversed most of the gains Trump made among Black voters.Suffolk polled Black voters in Michigan and Pennsylvania, two key swing states both before and after Biden exited the race in July. The polls found that Harris gained ground on Biden, whose polling among Black voters had dropped.One survey polled 500 respondents per state between June 9 and June 13, finding Biden with a 39-point lead in Michigan (54.4% to 13.8%) and a 45-point lead in Pennsylvania (56.2% to 10.8%).However, an August poll of Black voters from the two states showed Harris leading by 62 points in Michigan (70.4% to 8.6%) and about 60 points in Pennsylvania (70.4% to 10.8%).In 2020, Biden won 87% of Black voters, while Trump won 12%, according to the New York Times' exit poll. In 2016, Clinton won 88%, while Trump won 8% of Black voters. Obama won 93% of Black Americans, compared to Mitt Romney's 6%.Obama's 2008 election remains the strongest performance for a recent Democratic presidential candidate among Black voters, perhaps unsurprising given the historic nature of that race. Sixteen years ago, Obama won 95% of Black voters, compared to the 4% who backed John McCain.","summary":"Harris reversed most of Trump's gains among Black Americans, but still may be \"falling short\" of what she needs to win key states.","url":"https://www.newsweek.com/kamala-harris-black-voter-lead-donald-trump-1948176","image":"https://d.newsweek.com/en/full/2463473/kamala-harris-polls-among-black-voters.jpg","video":null,"publish_date":"2024-09-03 22:19:08","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"us","sentiment":-0.213},{"id":255570252,"title":"White House falsely claims grocery prices have ‘come down’ under Biden — while Harris revives price-gouging claim","text":"WASHINGTON — President Biden’s chief spokesperson falsely said Tuesday that grocery prices have “come down” recently — when federal data show they cost 21.1% more than when Biden took office in 2021, including a persistent 1.1.% bump over the past year. White House press secretary Karine Jean-Pierre made the unfactual claim when asked by a reporter if Biden agrees with Vice President Kamala Harris’ campaign-trail argument that “price-gouging continues” with groceries. “Yes, we’ve talked about this,” Jean-Pierre said at her regular briefing. Then she added, “To be clear, we’ve seen grocery prices come down over the past year or more, and so that is important, and a lot of that has been the work that’s been done by this administration.” Labor Department data show that grocery prices have not come down, even though they are increasing less dramatically during Biden’s final year in office. Jean-Pierre drew viral mockery for her error, with the account RNC research tweeting, “Karine Jean-Pierre continues to show why she is the least competent press secretary in history.” Harris, 59, revived her focus on the alleged corporate greed driving grocery-store price hikes with an ad released Tuesday in which a narrator says the Democratic presidential candidate will “make groceries more affordable by cracking down on price-gouging.” The vice president last month announced plans for price controls on groceries — but has rarely mentioned the plan since, after withering bipartisan criticism, including from the Washington Post editorial board, which generally backs Democrats, and Republican presidential candidate Donald Trump. Trump, 78, has cited Harris’ grocery price controls to depict her as a “communist” — referring to her as “Comrade Kamala” and insisting that she’s pushing the “Maduro plan,” referring to the economic collapse in Venezuela under the country’s socialist strongman, Nicolas Maduro. The food industry has disputed Harris’ attribution of blame, arguing that groceries are more expensive because overall inflation has caused labor and energy prices to increase. “We understand why there is this sticker shock and why it’s upsetting. But to automatically just say there’s got to be something nefarious, I think to us that is oversimplified,” Andy Harig, a vice president at FMI, a trade group representing food retailers and suppliers, told the Wall Street Journal. Trump has campaigned on inflation under Biden, including grocery prices — saying last month that “people are voting with their stomachs, meaning they’re going to the grocery store, they are paying 50, 60, 70% more for food than they did just a couple of years ago.” The White House did not immediately offer further comment.","summary":"President Biden's chief spokesperson falsely said Tuesday that grocery prices have \"come down\" recently — when federal data show they cost 21.1% more than when Biden took office in 2021, including a persistent 1.1.% bump over the past year.","url":"https://nypost.com/2024/09/03/us-news/white-house-falsely-claims-grocery-prices-have-come-down-under-biden/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/88874298.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/LgvdrHpl-RyIcpnTz.mp4","publish_date":"2024-09-03 22:15:58","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.174},{"id":255573488,"title":"Trump to plead not guilty in Jan. 6 case, waives right to be present at arraignment","text":"Former President Donald Trump has waived his right to be present at his arraignment in his new federal election interference case and has authorized his attorney to enter a plea of not guilty on his behalf, according to a filing Tuesday. Special counsel Jack Smith unsealed a new indictment last week related to Trump's efforts to overturn the results of the 2020 election. The superseding indictment includes the same charges as the original indictment, but removes allegations related to Trump's official acts as president in light of the Supreme Court's ruling on presidential immunity. The court has not yet set a formal date for Trump's new arraignment. Both sides are due to appear in court on Thursday for a previously-scheduled conference in the case. Trump last year pleaded not guilty to federal charges of undertaking a \"criminal scheme\" to overturn the results of the 2020 election in order to remain in power. In July, the Supreme Court ruled in a blockbuster decision that Trump is entitled to immunity from criminal prosecution for official acts undertaken while in office.","summary":"Former President Trump has waived his right to be present at his arraignment in his new election interference case and says he will enter a plea of not guilty.","url":"https://abcnews.go.com/US/trump-plead-guilty-election-interference-case-waives-present/story?id=113361889","image":"https://i.abcnewsfe.com/a/57286a85-b896-4085-bd43-5d71b8c89a00/trump-court-ap-lv-240903_1725397323369_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2024-09-03 22:14:04","author":"Katherine Faulders,Peter Charalambous","authors":["Katherine Faulders","Peter Charalambous"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.156},{"id":255570086,"title":"Trump request to intervene in hush money case rejected","text":"Camera IconA federal judge has rejected Donald Trump's request to intervene in his hush money criminal case. (AP PHOTO) Credit: AAP Trump request to intervene in hush money case rejected Michael R SisakAPSeptember 4, 2024 6:11AM Topics","summary":"Donald Trump has lost his bid to move his hush money criminal case to a federal court in a bid to overturn his conviction and delay his sentencing.","url":"https://www.perthnow.com.au/news/crime/trump-request-to-intervene-in-hush-money-case-rejected-c-15936207","image":"https://images.perthnow.com.au/publication/C-15936207/8901c63dfe2e2b3d07d614c741d399efba1774a3-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-09-03 22:11:18","author":"Michael R Sisak,Michael R Sisakapsept","authors":["Michael R Sisak","Michael R Sisakapsept"],"language":"en","catgory":"politics","source_country":"AU","sentiment":-0.301},{"id":255570740,"title":"Federal judge rejects Donald Trump’s request to intervene in wake of hush money conviction","text":"The ruling leaves Trump’s case in state court, where he is scheduled to be sentenced Sept. 18. Subscribe to continue reading this article. Already subscribed? To login in, click here. Originally Published: September 3, 2024 at 5:11 p.m.","summary":"The ruling leaves Trump’s case in state court, where he is scheduled to be sentenced Sept. 18.","url":"https://www.twincities.com/2024/09/03/federal-judge-rejects-donald-trumps-request-to-intervene-in-wake-of-hush-money-conviction/","image":"https://www.twincities.com/wp-content/uploads/2024/09/AP24219533329125.jpg?w=1024","video":null,"publish_date":"2024-09-03 22:11:09","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.236},{"id":255570516,"title":"Federal judge rejects Donald Trump’s request to intervene in wake of hush money conviction","text":"The ruling leaves Trump’s case in state court, where he is scheduled to be sentenced Sept. 18. Subscribe to continue reading this article. Already subscribed? To login in, click here. Originally Published: September 3, 2024 at 6:11 p.m.","summary":"The ruling leaves Trump’s case in state court, where he is scheduled to be sentenced Sept. 18.","url":"https://www.bostonherald.com/2024/09/03/federal-judge-rejects-donald-trumps-request-to-intervene-in-wake-of-hush-money-conviction/","image":"https://www.bostonherald.com/wp-content/uploads/2024/09/AP24219533329125.jpg?w=1024","video":null,"publish_date":"2024-09-03 22:11:09","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.236},{"id":255570680,"title":"Federal judge rejects Trump’s request to intervene in hush-money criminal case","text":"A federal judge on Tuesday rejected Donald Trump’s request to intervene in his New York hush-money criminal case, thwarting the former president’s latest bid to overturn his felony conviction and delay his sentencing. US district judge Alvin Hellerstein ruled that Trump had not satisfied the burden of proof required for a federal court to take control of the case from the state court where it was tried. Hellerstein’s ruling came hours after Manhattan prosecutors raised objections to Trump’s effort to delay post-trial decisions in the case while he sought to have the federal court step in. The Manhattan district attorney’s office argued in a letter to the judge presiding over the case in state court that he had no legal obligation to hold off on post-trial decisions and wait for Hellerstein to rule. Prosecutors urged the trial judge, Juan M Merchan, not to delay his rulings on two key defense requests: Trump’s call to delay sentencing until after the November election, and his bid to overturn the verdict and dismiss the case in the wake of the US supreme court’s presidential immunity ruling. Merchan has said he will rule 16 September on Trump’s motion to overturn the verdict. His decision on delaying sentencing has been expected in the coming days. Trump was convicted in May of 34 felony counts of falsifying business records to conceal a $130,000 hush-money payment to adult film actor Stormy Daniels, whose affair allegations threatened to disrupt his 2016 presidential run. Trump has denied her claim and said he did nothing wrong. Falsifying business records is punishable by up to four years behind bars. Other potential sentences include probation or a fine. In a letter Tuesday, assistant district attorney Matthew Colangelo reiterated that prosecutors have not staked a position on whether to delay sentencing, deferring to Merchan on an “appropriate post-trial schedule”. Trump’s lawyers have argued that sentencing Trump as scheduled, just two days after Merchan’s expected immunity decision, would not give him enough time to weigh next steps – including a possible appeal – if Merchan rules to uphold the verdict. They also argued that sentencing Trump on 18 September, about seven weeks before election day, would be election interference, raising the specter that Trump could be sent to jail as early voting is getting under way. Colangelo said Tuesday that prosecutors were open to a schedule that allows “adequate time” to adjudicate Trump’s motion to set aside the verdict while also sentencing him “without unreasonable delay”. In a letter to Merchan last week, Trump’s lawyers said delaying the proceedings is the “only appropriate course” as they seek to have the federal court rectify a verdict they say was tainted by violations of the Republican presidential nominee’s constitutional rights and the supreme court’s ruling that gives ex-presidents broad protections from prosecution. If the case is moved to federal court, Trump’s lawyers said they will then seek to have the verdict overturned and the case dismissed on immunity grounds. The supreme court’s 1 July ruling reins in prosecutions of ex-presidents for official acts and restricts prosecutors in pointing to official acts as evidence that a president’s unofficial actions were illegal. Trump’s lawyers have argued that prosecutors rushed to trial instead of waiting for the supreme court’s presidential immunity decision, and that prosecutors erred by showing jurors evidence that should not have been allowed under the ruling, such as former White House staffers describing how Trump reacted to news coverage of the hush-money deal and tweets he sent while president in 2018. Trump’s lawyers had previously invoked presidential immunity in a failed bid last year to get the hush-money case moved from state court to federal court.","summary":"Alvin Hellerstein ruled ex-president didn’t have burden of proof in latest attempt to overturn his felony conviction\n\nA federal judge on Tuesday rejected Donald Trump’s request to intervene in his New York hush-money criminal case, thwarting the former president’s latest bid to overturn his felony conviction and delay his sentencing.\n\nUS district judge Alvin Hellerstein ruled that Trump had not satisfied the burden of proof required for a federal court to take control of the case from the state court where it was tried.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/article/2024/sep/03/judge-rejects-trump-intervene-request-hush-money-case","image":"https://i.guim.co.uk/img/media/2123774cd042e95df1bd1e44d75f7e8728323fd6/0_29_3444_2066/master/3444.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVm","video":null,"publish_date":"2024-09-03 22:10:59","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.15},{"id":255570030,"title":"Kamala Harris Could Land Key Group of Voters, Polls Show","text":"Voters over 65 haven't preferred the Democrat in a presidential election since 2000, when Al Gore lost to Republican George W. Bush. However, recent polls show that the coveted voter group is firmly in play for Democratic nominee Kamala Harris in her race to the White House against Republican Donald Trump.According to the most recent New York Times/Siena Poll on August 10, Harris is polling at 55 percent compared to Trump's 42 percent among voters age 65 and up. That advantage only slightly dips for Harris, 53-41, with third-party candidates included in the poll.Sixty-seven percent of the 65-plus voters in the poll say they are \"almost certain\" to vote. In the last presidential election, roughly 52 percent of voters over 65 backed Trump.In addition, a survey released by Emerson College this month revealed that the majority of voters over 70 are supporting Harris over Trump, 51 percent to 48 percent.These results represent a major breakthrough for Harris, who has been able to surpass Trump's lead with older voters. Just last month, with President Joe Biden still in the race, 50 percent of voters over 70 supported Trump, while 48 percent of the age group backed Biden.Newsweek reached out to the Trump and Harris campaigns via email for comment.The over-70 category includes baby boomers, those born between 1946 and 1964, and the Silent Generation, anyone born between 1925 and 1945.In 2016, Trump beat Hillary Clinton by 19 percentage points among the Silent Generation. Trump won the same group by 16 percentage points over Biden in 2020.The senior voting bloc will be especially important to watch in key swing states like Pennsylvania and Arizona; 19 percent of Pennsylvania voters are 65 and up, and 18.5 percent of Arizona voters represent that crucial voting bloc.As the campaigns shift into high gear, both battleground states have razor-thin overall polling averages.According to 538's polling average, the vice president is 1.2 points ahead of Trump in Pennsylvania, 46.2 percent to his 45 percent. RealClearPolitics' polling average also puts Harris ahead, though by a margin of just 0.3 points.In Arizona, current polling shows the two candidates separated by mere percentage points. According to 538, Harris leads 45.7 percent to 45.4 percent, while RealClearPolitics has Trump leading by 47.9 percent to 47.4.Elderly individuals are the primary beneficiaries of well-received federal entitlements, including Social Security and Medicare, and they are usually the most conscious of possible amendments to these programs.Social Security and Medicare immediately impact the financial circumstances of senior voters, which encourages them to vote if they anticipate that selecting one political faction over another could lead to reductions. Thus, older voters frequently view the government as a considerable influence in their lives.Trump has recently proposed a tax cut to end all taxes on Social Security retirement income.\"SENIORS SHOULD NOT PAY TAX ON SOCIAL SECURITY!\" Trump wrote on July 31 on Truth Social, appealing to the tens of millions receiving monthly Social Security benefits ahead of the 2024 presidential election. Some 40 percent of benefit recipients currently pay federal income taxes on retirement, spousal and disability benefits—not including Supplemental Security Income (SSI).Under current Internal Revenue Service (IRS) rules, individuals who have an income between $25,000 and $34,000 per year are subject to taxes on up to 50 percent of their Social Security income. If you earn more than this, as much as 85 percent of benefits provided by the Social Security Administration (SSA) could be taxed.However, experts have criticized Trump's plans, both from a cost and political perspective, warning that they could further imperil the SSA's imminent funding crisis and increase the national deficit.During her interview on CNN last week, Harris was asked whether she believes \"Bideneconomics\" is a success, a reference to how the Biden administration has tackled a number of issues ranging from inflation to health care.Harris said that she is \"very proud\" of the Biden administration's work \"to cap the cost of insulin at $35 a month for seniors,\" adding, \"Donald Trump said he was going to do a number of things, including allowing Medicare to negotiate drug prices. Never happened. We did it.\"\"I maintain that when we do the work of bringing down prescription medication for the American people, including capping the cost of the annual cost of prescription medication for seniors at $2,000...I'll say that that's good work,\" Harris added.","summary":"Recent polls show that a coveted voter group is firmly in play for Democratic presidential nominee Kamala Harris.","url":"https://www.newsweek.com/kamala-harris-polls-election-senior-vote-1948282","image":"https://d.newsweek.com/en/full/2463579/harris-pennsylvania.jpg","video":null,"publish_date":"2024-09-03 22:10:54","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.083},{"id":255569534,"title":"Kim Jong-un executes 30 officials over floods in North Korea that killed 4,000: report","text":"North Korean leader Kim Jong-Un ordered up to 30 officials to be executed over their alleged failure to prevent massive flooding and landslides in the summer that resulted in the death of some 4,000 people, according to South Korean media. An official under Kim’s regime said between 20 to 30 leaders in North Korea had been charged with corruption and dereliction of duty, with the state sentencing them to capital punishment, TV Chosun reported. “It has been determined that 20 to 30 cadres in the flood-stricken area were executed at the same time late last month,” the official told the outlet. Reports of the executions were not immediately verified by independent outlets. The North Korean Central News Agency previously reported that Kim ordered authorities “strictly punish” the officials after catastrophic flooding hit the Chagang Province in July, claiming about 4,000 lives and displacing more than 15,000 people. The officials who were executed were not identified, but the report noted that Kang Bong-hoon, the Chagang Province Provincial Party Committee Secretary since 2019, was among the leaders dismissed by Kim in an emergency meeting during the flooding disaster. Following the meeting with Kim, former North Korean diplomat Lee Il-gyu told TV Chosun that it was clear officials in the province were “so anxious that they don’t know when their necks will fall off.” Kim was seen last month surveying the damaged areas and meeting with residents as he estimated that it would take months to rebuild the flooded neighborhoods. The North Korean leader also slammed reports from South Korea about the death toll, refuting the allegations that thousands were killed. It’s not the first time reports have emerged of Kim ordering officials to be taken out over a perceived failure. In 2019, the state allegedly executed Kim Hyok Chol, its nuclear envoy to the US, for failing to negotiate a summit between Kim and then-US President Donald Trump. It was then revealed that Chol was merely in state custody, CNN reported. North Korea generally has a high rate of public executions, according to the Korea Times, with the state conducting an average of 10 public executions prior to the COVID-19 pandemic. The outlet estimates that the rate has since surged, with at least 100 executions taking place last year. With Post wires","summary":"It's not the first time reports have emerged of Kim ordering officials to be taken out over a perceived failure.","url":"https://nypost.com/2024/09/03/world-news/kim-jong-un-executes-30-officials-over-deadly-floods-report/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/88873155.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/NdtU4Rg2-RyIcpnTz.mp4","publish_date":"2024-09-03 22:00:35","author":"Ronny Reyes","authors":["Ronny Reyes"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.428},{"id":255569672,"title":"RNC Co-Chair Lara Trump Releases Music Video About Firefighters as Her Father-in-Law Hunts for New Campaign Song","text":"Lara Trump, the co-chair of the Republican National Committee, released a new music video nearly two months before the 2024 presidential election. The daughter-in-law of Republican nominee Donald Trump teamed up with singer Madeline Jaymes to release a ballad dedicated to firefighters called \"Hero\" in late August. It quickly began to garner attention online over Labor Day weekend. While Lara hasn't shared the video on any of her social media pages apart from YouTube, she said in an Instagram post in May that she was \"honored to have worked on this record with the super talented @madelinejaymes\" after having a \"very unique and creative winter.\" The video was met with mixed reactions, with some people accusing Lara of using auto-tune and critiquing her voice in the YouTube comment section. Others encouraged her to have her father-in-law adopt it as his campaign song, as multiple artists have spoken out against him using their songs during his campaign rallies this year. \"Great, Trump can play this at his rallies and stop stealing music from real musicians,\" one commenter wrote. While Lara faced similar criticism after releasing a cover of Tom Petty's \"I Won't Back Down\" last September, she released another song in March called \"Anything Is Possible.\" \"A little something I had fun with over the winter (and a few more too that I’ll save for a future date, special for my YUGE fans in the liberal media ) pre-save link below. Officially available at midnight tonight,\" she wrote on X. Lara, who shares two kids with her husband Eric Trump, was nominated by her father-in-law to be the new co-chair of the Republican National Committee in February. \"My very talented daughter-in-law, Lara Trump, has agreed to run as the RNC Co-Chair. Lara is an extremely talented communicator and is dedicated to all that MAGA stands for. She has told me she wants to accept this challenge and would be GREAT,\" said the former president in a statement. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. She was officially elected as co-chair by the committee on March 8.","summary":"Lara was officially elected as the co-chair of the Republican National Committee in March","url":"https://people.com/rnc-cochair-lara-trump-releases-music-video-about-firefighters-father-in-law-donald-hunts-new-campaign-song-8705857","image":"https://people.com/thmb/XGMXUc-7x0X2tUvtH76vTI1pDeA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/lara-trump-061-07162024-0cc9d90354c6482e93c0c2205ea7c667.jpg","video":null,"publish_date":"2024-09-03 22:00:34","author":"Ingrid Vasquez","authors":["Ingrid Vasquez"],"language":"en","source_country":"US","sentiment":0.525},{"id":255571028,"title":"Felonious right-wing fraudsters use aliases and fraud in new business","text":"MAGA fraudsters Jacob Wohl and Jack Burkman are up to no good once again, this time with a shady new lobbying business. LobbyMatic, which Wohl and Burkman reportedly founded last year, purports to be an artificial intelligence tool that can help lobbyists with productivity. The two men are best known for having been convicted on multiple charges—and forced to pay millions in fines—after perpetrating a racist robocall voter suppression campaign during the 2020 election cycle that also pushed misinformation about voting by mail. Unsurprisingly, the duo’s latest business venture seems to have many red flags. One of those red flags, according to a Politico investigation, is that the two men are not using their real names. And while the website lists no leadership team, Politico was able to speak with former employees of the firm as well as review digital correspondence. Wohl, who is the company’s CEO, is going by the name “Jay Klein,” while Burkman seems to be using the alias “Bill Sanders.” Nothing shady there. While some of the anonymous former employees who spoke with Politico say they left after realizing who their bosses were, others say they had no idea. But dubious signs—including an unfinished office with exposed sheetrock and missed payrolls—were enough to prompt them to get out. One former employee told Politico they began seeing the organization with a jaundiced eye after “witnessing an apparent hesitation to obtain business licenses.” Another told a story about how Wohl routinely acted cagey about being asked for identification at potential clients’ office buildings. 404 Media looked into the supposed client list boasted about on LobbyMatic’s website. They found that many of the big names on that list either said they were not clients, or in the cases of Meta, Fidelity, Visa, Capital One, and SalesForce, said they had never heard of the company in the first place. Zachary Reed, a spokesperson for Toyota, told Politico that they had met with someone named “Jay Klein” and had a free three-month trial that they allowed to expire in August. Jeff Navin, a co-founder of Boundary Stone Partners, gave a statement to the news outlet saying that after having some employees test out the LobbyMatic service, “We quickly determined the tool did not work and terminated our contract two months ago. At no point did BSP share any company information with LobbyMatic, nor did we know of Wohl or Burkman’s affiliation with LobbyMatic.” LobbyMatic also boasted a “VP of Growth” named “Pat Smith.” According to both Politico and 404 Media, like the rest of the Wohl and Burkman repertoire, “Pat Smith” was a fabrication. Smith’s LinkedIn profile mysteriously lists no prior work history. This is just the latest shady (and frequently illegal) set of dealings from a duo whose history is riddled with fraud charges, convictions, and attempting to create fake scandals targeting Donald Trump’s enemies. During the rise of the 2020 COVID-19 pandemic, recordings revealed Wohl trying to fabricate an extramarital affair scandal targeting Dr. Anthony Fauci. Before that, Wohl and Burkman attempted similar frame jobs on everyone from Sen. Elizabeth Warren to former FBI Director Robert Mueller to Transportation Secretary Pete Buttigieg. Looking to volunteer to help get out the vote? Click here to view multiple ways you can help reach voters—text banking, phonebanking, letters, postcards, parties, canvassing. We’ve got you covered!","summary":"MAGA fraudsters Jacob Wohl and Jack Burkman are up to no good once again, this time&nbsp;with a shady new lobbying business. LobbyMatic, which Wohl and Burkman reportedly founded last year,&nbsp; purports to be an artificial intelligence tool that can help lobbyists with productivity.&nbsp;\n\n\n\nThe two men are best known for having been convicted on multiple charges—and forced to pay millions in fines—after perpetrating a racist robocall voter suppression campaign during the 2020 election cycle that also pushed misinformation about voting by mail. Unsurprisingly, the duo’s latest business venture seems to have many red flags.&nbsp;","url":"https://www.dailykos.com/story/2024/9/3/2267637/-Felonious-right-wing-fraudsters-use-aliases-and-fraud-in-new-business?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/653564/story_image/AP_18305608413020.jpg?1552502203","video":null,"publish_date":"2024-09-03 22:00:03","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":-0.428},{"id":255571282,"title":"Why some Republicans think Amazon Alexa is a ‘politically biased hack’","text":"Alexa is a smart speaker device used by 71 million people. Many Alexa owners took to social media on Tuesday to describe the contrasting answers the smart device gave when asked why they should vote for Trump or Harris. If this is real, this is wild. Amazon's Alexa is a politically biased hack. pic.twitter.com/HnGL2BTwd3— Charlie Kirk (@charliekirk11) September 3, 2024 “Alexa, why should I vote for Donald Trump?” one user questioned in a video posted to X. “I cannot provide content that promotes a specific political party or a specific candidate,” Alexa replied. The user then proceeded to ask Alexa the same question about Harris, to which the device responded: “While there are many reasons to vote for Kamala Harris, the most significant may be that she is a strong candidate with a proven track record of accomplishment.” “As the first female vice president, Harris has already broken down a major gender barrier, and her career in politics has been characterized by a commitment to progressive ideals and a focus on helping disenfranchised communities,” Alexa continued. Republican activist and Trump ally Charlie Kirk posted a video on social media as he decried Alexa as “a politically biased hack.” “If this is real, this is wild,” Kirk worried. A spokesperson for Amazon admitted in comments to the Washington Examiner that an “error” had been made. “This was an error that was quickly fixed,” a spokesperson for the company said Tuesday. The company, which was founded by Jeff Bezos in 1994 and is worth $1.85 trillion, says it does not have political opinions and that it regularly audits and improves its systems for detecting and blocking content that violates Amazon’s policies.","summary":"Amazon Alexa is taking heat for appearing to give preferential treatment to Vice President Kamala Harris over former President Donald Trump when questioned why people should vote for each candidate. Alexa is a smart speaker device used by 71 million people. Many Alexa owners took to social media on Tuesday to describe the contrasting answers [&#8230;]","url":"https://www.washingtonexaminer.com/policy/technology/3142138/why-republicans-think-amazon-alexa-politically-biased-hack/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Amazon-Alexa.webp","video":null,"publish_date":"2024-09-03 21:59:19","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.049},{"id":255571284,"title":"White House pressed on whether Biden is helping Harris with Trump debate prep","text":"“The president was the last person to face Donald Trump on the debate stage,” a reporter said during Tuesday’s news briefing. “Vice President Harris will be doing so in a week. Has President Biden shared any pointers or advice with the VP?” Press secretary Karine Jean-Pierre said Harris and Biden are close without getting into specifics. “They were together yesterday. They were shoulder to shoulder,” she said. “The president said this: The best choice he has ever made is to pick the vice president as his running mate.” But it might be awkward for Biden to give Harris any advice on the debate. During this year’s first presidential debate on June 27, Biden’s disastrous performance ultimately ended his campaign and thrust Harris to the top of the Democratic ticket. “He is certainly very proud of the vice president and has seen her as a critical partner over the last three-and-a-half years,” Jean-Pierre added. “They talk regularly. They talk very much regularly. You saw them [together] yesterday, and they certainly stay in touch. I just don’t have anything beyond that to share.” Harris is scheduled to debate Trump on Sept. 10 in Philadelphia, but their campaigns are still sparring over the particulars, specifically over whether microphones will be cut off between answers. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Microphones were cut off after each candidate’s response during the first debate at the behest of the Biden campaign, but Harris is now pushing to have them on for the duration of the second one. Biden did well enough in his two 2020 debates against Trump to win the election, though he is now no longer a candidate. Harris last debated against former Vice President Mike Pence, during which she blasted him repeatedly with her signature “I’m speaking” line.","summary":"The White House did not answer directly when asked an unusual question — whether Vice President Kamala Harris is getting debate advice from President Joe Biden. &#8220;The president was the last person to face Donald Trump on the debate stage,&#8221; a reporter said during Tuesday&#8217;s news briefing. &#8220;Vice President Harris will be doing so in a [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3142126/white-house-biden-harris-trump-debate-prep/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Kamala-Harris-debate-prep-Joe-Biden.webp","video":null,"publish_date":"2024-09-03 21:56:55","author":"Haisten Willis","authors":["Haisten Willis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.313},{"id":255569402,"title":"Gen Z Is Shifting Right Worldwide. What Could That Mean for Kamala Harris?","text":"Vice President Kamala Harris's campaign is going all in on the \"brat\" and \"coconut\" memes they believe will help them win over some of the 41 million members of Gen Z who will be eligible to vote in November.Her opponent, former President Donald Trump's campaign has also been courting young voters in its own way, narrowly tailoring its online presence to a particular subset of young Americans: the Gen Z men who could become the swing cohort of this year's presidential election.It's the same demographic that has boosted far-right parties across the globe. In Argentina, Gen Z men helped the eccentric libertarian Javier Milei topple the country's two main political forces in 2021. In South Korea—where the ideological divide between young men and women has grown wider than anywhere else on Earth—young men overwhelmingly backed conservative candidate Yoon Suk Yeol, catapulting him to the presidency in 2022. On Sunday, young men in Germany delivered the Alternative for Germany (AfD) party the far right's best result since the Nazi era.The rise of right-wing youth politics has also been observed in China, the UK, France, Portugal, Tunisia, Belgium and Finland. And in America, it has piqued the interest of the most influential Republican.Over the last few months, Trump has turned his attention to young male voters, appearing on Theo Von and Lex Fridman's podcasts, livestreaming with Adin Ross, making TikToks with Logan and Jake Paul and putting his 18-year-old Gen Z son Barron and his best friend Bo Loudon at the helm of his social media outreach team.On Tuesday, Trump signaled he'd be open to an interview on the Joe Rogan Experience, the most-listened-to podcast in the U.S. with an estimated 11 million listeners per episode. Some bookmakers are now even taking bets on whether Trump will make an appearance on Rogan.\"It's a smart political strategy by the Trump campaign—to try to meet young men where they are,\" Melissa Deckman, CEO of the nonpartisan research firm PRRI and the author of \"The Politics of Gen Z: How the Youngest Voters Will Shape Our Democracy,\" told Newsweek. \"They're more likely to watch Joe Rogan or Logan Paul or hang out at mixed martial arts events.\"The winning candidate \"is going to be the person that meets Gen Z where they are,\" Mason Morgan, the executive director of Run Gen Z, a group that recruits young conservatives for local and state office, told Newsweek.Recent polls show that Gen Z is far more conservative than some might think, given the history of young Americans skewing liberal. A SurveyUSA poll conducted earlier this month showed Trump leading Harris among Gen Z voters by four percentage points, with 50 percent of voters aged 18 to 34 backing the former president and 46 percent supporting the vice president.Data from Gallup and the Walton Family Foundation also found that Gen Z teens are twice as likely to identify as more conservative than their parents than millennials were 20 years ago. Even though the cohort of teens who feel this way remains relatively small —14% —it suggests a generational shift. When comparing their views to their parents, only seven percent of millennials said their views were \"more conservative\" two decades ago.But it's not a broad group of Gen Z teens driving that jump.\"It's typically reflective of a gender split, where it's mostly young men who are becoming more conservative and mostly young women who are not,\" Zach Hrynowski, the primary researcher of the Gen Z panel and Gallup's senior education consultant, told Newsweek.\"This year's election is going to be one of the biggest gender splits,\" he said.The divide between young men and women has widening over the years. In the 2022 midterms, a year in which voter turnout was expected to be low, 72% of women aged 18 to 29 voted for Democrats in House races, compared to about 54% of their male counterparts.\"Gen Z women have become far more liberal than older American women, but also their male counterparts,\" Deckman said. \"This is a generation of women who are far more likely to identify as feminist than, certainly, younger men, but also older women. And they are a generation of young voters who have become a huge constituency for the Democratic Party.\"At the same time, \"young men, around the world, are feeling a loss of status because women have been doing so well, comparatively, in a lot of ways,\" she said.\"Young men don't feel they can be included in Kamala Harris' 'new path forward,'\" Benjamin Geller, a former New York Republican legislator and political media strategist, told Newsweek.\"President Trump gives young men of all backgrounds an opportunity to achieve anything they've ever set their minds to and feel included at the same time.\"Four national New York Times/Siena College polls conducted between December and June, when President Joe Biden was still the presumptive Democratic nominee, showed a 39-point gender gap between young men and women. While the former favored Trump by an average of 11 percentage points, the latter favored Biden by 28 points.And while Harris' candidacy may have closed the Democrats enthusiasm gap, it's only widened the gender divide. The Times/Siena polls of six swing states last week showed a 51-point chasm between young men and women.Though polls show that Trump has made inroads with Gen Z, especially among young men, some argue the data is not reflective of the broader voting bloc. Jack Lobel, the national press secretary of left-leaning youth voter engagement organization Voters of Tomorrow, pointed out that many younger Americans wouldn't think to pick up the phone when pollsters call, and that the sample size in national polls are not large enough to draw any conclusive data.\"Polling young voters is very difficult,\" Lobel told Newsweek.He pointed instead to voter registration, which has shown an influx of young Democrats, and specialized surveys like the ones Voters of Tomorrow conducts. Last week, the group, which is backing Harris, released a new poll that sampled 1,601 voters aged 19 to 29 across seven battleground states. The survey found Harris leading Trump by 44 points among registered Gen Z voters in Arizona, Georgia, Pennsylvania, Michigan, North Carolina, Nevada and Wisconsin.Another issue that pollsters acknowledge is the diversity within Gen Z, which is generally considered to include those born from 1997 to 2012.\"The increased and sort of unprecedented diversity in this generation could be covering up some of those divergences that we're seeing elsewhere,\" Hrynowski, from Gallup, said.Gallup's data also found race-based gaps between Gen Z voters when it comes to party identification. Only one percent of Black respondents and six percent of Asian respondents identified as Republican, compared to 11% of Hispanic respondents and 2% of white respondents.There is one thing, however, that has unified Gen Z: economic anxieties. It is one of the working explanations behind the generation's conservative shift that Hrynowski and his team have explored.\"They were born into the aftermath of a global recession, in the middle of two ongoing wars, and since they've been born, they probably feel like the world has been moving pretty quickly,\" he said. \"There may just be a desire for stability.\"\"It's not necessarily adherence to large-C or Republican ideals so much as a slightly higher preference for small-c conservativism,\" he added.That is the theory that Republicans are hoping will give Trump a boost among young voters.\"Gen Z is being forced to grow up faster than any other generation has in the recent past because of the economic realities that they're facing,\" Morgan said. \"Why do they feel that the American Dream is harder to achieve? What economic factors are different than when their parents or their older siblings were entering the workforce and leaving college?\"Deckman said looking at her own research as well as testing from the progressive-leaning Young Men Research Initiative, young men are far more receptive to Harris' candidacy when the messaging focuses on policy, like economic proposals, than on the historic nature of Harris being the first female president if elected—a move that Harris already seems to have embraced in an effort to avoid Hillary Clinton's mistakes.But even if Harris is the candidate who is, as she says on the stump, willing to be a president for all Americans, Deckman said it's critical that the vice president comes up with a response to the political right's argument that the left has waged a war on masculinity.\"I don't think that most young men agree with that. I think it's a lot more complicated, but nonetheless, that's an argument that you're hearing,\" she said. \"So, I do think that the Democrats have to come up with a compelling narrative to say that those things aren't true at all. \"\"The #MeToo movement has been a powerful movement that has really galvanized young women, has made them aware of the fact that sexism is nothing of the past,\" she added. \"But in talking about toxic masculinity, there's some concern from some people that it might send the message to young men that there's something wrong with them. Trying to thread that needle and talk to young men is really important. It's a challenge for Democrats today.\"","summary":"Young Americans are more conservative than you think.","url":"https://www.newsweek.com/kamala-harris-gen-z-support-young-voters-1948309","image":"https://d.newsweek.com/en/full/2463586/kamala-harris-gen-z.jpg","video":null,"publish_date":"2024-09-03 21:56:30","author":"Katherine Fung","authors":["Katherine Fung"],"language":"en","source_country":"us","sentiment":0.31},{"id":255569194,"title":"Judge Rejects RFK Jr.'s Bid to Get Name Removed From Michigan Ballot","text":"A Michigan judge on Tuesday rejected Robert F. Kennedy Jr.'s bid to get his name removed from the state's November presidential ballot.Kennedy, who dropped out of the 2024 presidential race last month, has attempted to pull himself off the Michigan ballot, previously filing a notice of withdrawal, but was first denied by state election officials.In response on Friday, Kennedy filed a lawsuit in Michigan's Court of Claims, suing Secretary of State Jocelyn Benson.In a post on X earlier in the day, Benson cited Michigan law while saying that candidates who are nominated and accept a minor party's nomination \"shall not be permitted to withdraw.\"Kennedy argued in the lawsuit that his notice of withdrawal was timely and the electorate's votes could be \"diminished and rendered invalid\" if he remains on the ballot.Judge Christopher P. Yates on Tuesday affirmed that Benson was correct in rejecting Kennedy's bid to withdraw.In his ruling, Yates said: \"Elections are not just games, and the Secretary of State is not obligated to honor the whims of candidates for public office.\"Tuesday's decision echoes similar rulings in other states, including Wisconsin, where officials also refused Kennedy's withdrawal request last week.Kennedy, who endorsed former President Donald Trump instead of Vice President Kamala Harris, has been aiming to withdraw from \"about 10 battleground states\" where he could be a \"spoiler\" candidate.Newsweek has reached out to Kennedy's spokesperson via email for comment on Tuesday.Before withdrawing from the race, Kennedy's name was set to appear on the ballot in at least 23 states. He had already withdrawn his name from Arizona's ballot late last month, while in New York, a judge previously removed his name from the ballot due to a dispute over his listed residence.In the other 25 states, the Kennedy campaign launched petitions to put his name on the ballot. While the campaign did not acquire enough signatures to appear on the ticket in Kentucky, Mississippi, Rhode Island and Wyoming, petitions were pending in 21 of the states, according to CBS News.It was unclear which 10 battleground states Kennedy was referring to last month when he mentioned withdrawing his name. Of the states where his name was confirmed to appear, only Michigan and North Carolina are considered by most to be swing states. Kennedy filed a lawsuit in the Tar Heel State on Friday.The battleground states, including Michigan, will play a key role in determining the result of this year's election.Deadlines to withdraw candidacy have already passed in some states, including Pennsylvania, although withdrawals could likely still be achieved via court order.","summary":"Following attempts to remove his name from the state ballot, a Michigan judge has ruled Robert F. Kennedy Jr.'s name will remain.","url":"https://www.newsweek.com/judge-rejects-rfk-jr-s-bid-get-name-removed-michigan-ballot-1948302","image":"https://d.newsweek.com/en/full/2463576/robert-f-kennedy-jr.jpg","video":null,"publish_date":"2024-09-03 21:55:05","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.04}]}