{"offset":0,"number":50,"available":12735,"news":[{"id":378354086,"title":"Trump hits back at Democrats over Epstein emails, says only stupid Republican would fall into trap amid US govt shutdown","text":"US President Donald Trump on Wednesday hit back at Democrats after they released emails from convicted sex offender Jeffrey Epstein which revealed multiple references to him in private correspondence, and claimed that Dems were attempting to divert attention amid ongoing shutdown.According to the emails released, the communications suggested that Trump ‘knew about the girls’.“The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects,” said Trump in a post on Truth socialsStating that only a very bad, or stupid, Republican would fall into that trap, trump added, “The Democrats cost our Country $1.5 Trillion Dollars with their recent antics of viciously closing our Country, while at the same time putting many at risk — and they should pay a fair price.”Referring to the ongoing US government shutdown, the longest in American history, the President said that there should be no deflections to Epstein or anything else, and any Republicans involved should be focused only on opening up our Country, and fixing the massive damage caused by the Democrats.The Epstein emails sparked a new slugfest between Democrats and GOP leaders when the House of Representatives is expected to vote to end the shutdown, which has left federal workers unpaid and millions of Americans without SNAP benefits.Democrats cited exchanges between Epstein and author Michael Wolff and Ghislaine Maxwell.In a 2019 email to journalist Michael Wolff, who has written extensively about Trump, Epstein added that Trump had \"spent hours at my house\" with one of his victims, whose name is redacted.Ghislaine Maxwell was an associate of Epstein, who is serving a 20-year prison sentence for her role in helping him with the sexual abuse of underage women.Meanwhile, White House spokeswoman Karoline Leavitt accused the Democrats of having “selectively leaked emails” to “create a fake narrative to smear President Trump.”She added that the release of the mails was \"hoax\" designed to take the shine off an upcoming vote to end the longest-ever US government shutdown, which Trump has claimed as a victory for Republicans.\"These stories are nothing more than bad-faith efforts to distract from President Trump's historic accomplishments,\" Leavitt said.\"Any American with common sense sees right through this hoax and clear distraction from the government opening back up again.\"","url":"https://www.livemint.com/news/us-news/trump-hits-back-at-democrats-over-epstein-emails-says-only-stupid-republican-would-fall-into-trap-amid-us-govt-shutdown-11762974788495.html","image":"https://www.livemint.com/lm-img/img/2025/11/12/1600x900/logo/Trump-8_1762754942536_1762975547601.jpg","video":null,"publish_date":"2025-11-13 19:28:15","author":"Pratik Prashant Mukane","authors":["Pratik Prashant Mukane"],"language":"en","category":"politics","source_country":"in","sentiment":-0.433},{"id":378407708,"title":"'Thank you, thank you, thank you' – The Australian Jewish News","text":"Thank you, thank you, thank you. This is what we heard almost everywhere in Israel on the UPJ Solidarity Mission, when visiting the memorial sites in the south, at the development town of Shlomi in the north, from soldiers in training visiting the site of the destroyed Sderot police station or at Chatira base where we volunteered with Sar-El, and when we visited family members in Jersualem, Kfar Saba or Kibbutz Afek. It mattered to Israelis that we were prepared to book to visit Israel before knowing of the ceasefire now in place.\n\nFirst, the World Union for Progressive Judaism (WUPJ) Connections Conference held at Bet Shmuel overlooking the Old City of Jerusalem, brought together Jews from across every continent. In particular, inspiring leaders from our youth movement, Netzer, and young adult Zionist movement, Tamar, were there in force. However, what struck me overwhelmingly was a pattern of stories about Jews hiding their identity, not speaking up in university and public spaces, and of Jewish community leaderships some of which did not or could not take up the call to fight back and regain Jews’ rightful place in the public square. Things are tough in Australia, but by reason of our strong and proactive leadership bodes, the hard work being undertaken by the special envoy and her staff, and grassroots activism, the prospects for Australian Jewry may yet be better than it would seem in some other Diaspora communities.\n\nWe joined the weekly Havdalah organised by the Israel Movement for Progressive Judaism in Paris Square, Jerusalem, which was followed by a moving rally organised by the Hostages and Missing Families Forum called “We don’t leave hostages behind.” The thanks to President Donald Trump and Steve Witkoff for achieving the return of hostages was palpable everywhere.\n\nKaren and I joined our relative, Jeannette Koll, volunteering at Mizilot Mazon, sorting and preparing vegetables for those who can’t afford, part of Jerusalem’s food rescue project. We did similar work on the UPJ Solidarity Mission with Leket.\n\nThe sheer volume of food waste in Israel was brought home to us on both days.","url":"https://www.australianjewishnews.com/thank-you-thank-you-thank-you/","image":"https://static.timesofisrael.com/ajn/uploads/2025/11/IMG-20251022-WA0006_49174.jpg","video":null,"publish_date":"2025-11-13 11:27:00","author":null,"language":"en","source_country":"au","sentiment":0.125},{"id":378407062,"title":"A roadmap for Israel's Indo-Pacific engagement – The Australian Jewish News","text":"While global attention is focused on the potential for ending the Gaza war, there’s a refreshingly serious conversation now opening up about the possibility for Israel’s engagement in the broader Indo-Pacific. Last month Israel’s deputy foreign minister Sharren Haskel visited PNG and Fiji, sending a strong message about Israel’s commitment to strengthening ties. Both island states have recently established embassies in Jerusalem.\n\nThere are increased discussions focused on Israel deepening collaboration with the islands in water management, agricultural innovation, public health, renewable energy and technological development. Fiji just signed an MoU with Israel addressing cyber threats. “It was really incredible seeing all the love and support that we are receiving from these countries, not just from the government level but also from the people-to-people level,” Haskel said.\n\nFiji has a long tradition of sending peacekeepers across the Middle East. Fiji, PNG and Tonga with their armed forces could contribute to an Oceania contingent, along with Australia, to the International Stabilisation Force in Gaza.\n\nIsrael could have a big role in advancing ocean technology and development, the so-called blue economy in the Indo-Pacific. The Israeli government earmarked ocean technology as a priority for research and development in September 2022. Opportunity exists to work with partners such as the UAE, Japan and Singapore to support the blue economy from the Pacific Islands to the Indian Ocean. India is encouraging other countries to join the Indo-Pacific Ocean Initiative (IPOI) to enhance regional maritime security. There’s a work pillar on trade, connectivity and transport led by Japan that Israel could contribute to.\n\nAnother area where Israel could play a role is enhancing the security of the digital arteries of the Indo-Pacific, submarine cables. The Blue Cable System connects Italy, Greece and Israel. The Raman Cable System connects Jordan, Saudi Arabia, Oman and India. \nThe India-ME-Europe corridor is strategically important to the US. President Donald Trump said it was “one of the greatest trade routes in all of history. It will run from India to Israel to Italy and onward to the US, connecting our partners, roads, railways and undersea cables, many, many, undersea cables.” Israel should support efforts to reinforce submarine cable resilience, centred on actions ranging from increased cooperation to technical advancements.","url":"https://www.australianjewishnews.com/a-roadmap-for-israels-indo-pacific-engagement/","image":"https://static.timesofisrael.com/ajn/uploads/2025/11/AP25266565259500-e1_11239.jpg","video":null,"publish_date":"2025-11-13 11:20:00","author":null,"language":"en","category":"politics","source_country":"au","sentiment":0.58},{"id":378358318,"title":"Mellon Blue diamond fetches $25.6m at Geneva auction","text":"(Web Desk) - The 9.51-carat Mellon Blue fetched CHF 20.5 million ($25.6 million) at Christie’s Magnificent Jewels in Geneva on Tuesday — some 20% less than the last time the diamond went under the hammer in 2014.\n\nThe sale was evidence of “the elite appetite among collectors for extraordinary and storied gems,” said Rahul Kadakia, president of Christie’s Asia Pacific and chairman of the company’s global luxury group, in a statement the same day.\n\nThe modified pear brilliant-cut, fancy-vivid-blue, VVS1-clarity diamond — which has the potential to be internally flawless — previously belonged to American horticulturalist, philanthropist, and art collector Rachel Lambert Mellon, better known as Bunny Mellon, who died in 2014.\n\nThe final price was within the auction house’s estimate of $20 million to $30 million and translates to $2.7 million per carat. Christie’s sold it set in a swirling platinum ring with single-cut diamonds.\n\nHowever, the sale achieved a lower figure than Sotheby’s got for the diamond in New York in November 2014, when a Hong Kong buyer won the piece — then mounted as a pendant — for $32.6 million.\n\nThe regression was “shaped heavily by the broader market mood,” said Tobias Kormind, managing director of European online jeweler 77 Diamonds. “Geopolitical tensions — from the war in Ukraine to [US President Donald] Trump’s tariffs — and a weakened Chinese economy that kept many usual buyers away, left the room distinctly cautious.”\n\nStill, $25.6 million was the third-highest price for any vivid-blue diamond sold at Christie’s, the auction house noted. The 14.62-carat Oppenheimer Blue holds the record after realizing $57.5 million in Geneva in 2016, while the 17.61-carat Bleu Royal went for $39.5 million in the same Swiss city in 2023.\n\nTuesday’s Magnificent Jewels auction, part of Geneva Luxury Week at Christie’s, brought in a combined CHF 60.6 million ($75.6 million), with 95% of items by value finding buyers and 94% by number of lots.\n\nA colored diamond and sapphire ring by designer JAR sold for CHF 2.5 million ($3.1 million), while a late-19th century ruby and diamond star brooch, which can also be worn as a pendant, garnered CHF 2.3 million ($2.8 million). \nMeanwhile, the “rainbow collection” of 300 unmounted diamonds weighing 0.24 to 4.89 carats scored CHF 1.8 million ($2.2 million).","url":"https://www.dunyanews.tv/index.php/en/WeirdNews/917526-mellon-blue-diamond-fetches-256m-at-geneva-auction","image":"https://img.dunyanews.tv/news/2025/November/11-13-25/news_big_images/917526_13153262.jpg","video":null,"publish_date":"2025-11-13 07:43:00","author":"Staff Reporter","authors":["Staff Reporter"],"language":"en","category":"politics","source_country":"pk","sentiment":0.066},{"id":378414940,"title":"Will Japan and South Korea join Aukus, co-develop nuclear submarines with US?","text":"The three-member Aukus defence pact may soon expand beyond its primary aim of boosting Australia’s submarine fleet to also include Japan and South Korea, according to analysts, with both North Asian powers potentially co-developing or acquiring similar nuclear-powered vessels and taking part in hi-tech projects.\nThese developments could transform Aukus – a trilateral security partnership between Australia, the United States and Britain – into a more expansive Indo-Pacific defence network.\nWashington’s recent approval for Seoul to develop nuclear submarines – confirmed during a meeting between US President Donald Trump and South Korean President Lee Jae-myung in Gyeongju last month – was seen as a watershed moment that could pave the way for Tokyo’s involvement as well.\n“If this trend continues, Aukus could evolve from a strictly Anglosphere initiative into a broader Indo-Pacific defence innovation framework while retaining its core trilateral foundation,” Bence Nemeth, associate professor at King’s College London, told This Week in Asia.\nDeep sea deterrence\nThe decision to allow South Korea to build nuclear-powered submarines marks a significant shift in the region’s security architecture, elevating it into a small US-backed group of countries with such naval capabilities, according to analysts.\nMeanwhile, Japan appears to be laying the groundwork for a similar move. Speaking at a press briefing last Thursday, Japanese Defence Minister Shinjiro Koizumi said the country needed to re-evaluate its current submarine capabilities.\n“The environment surrounding Japan is truly becoming so severe that we must debate whether to continue with diesel as we have, or to opt for nuclear-powered submarines,” Koizumi said.\n\nWhile neither Tokyo nor Seoul is part of Aukus’ core structure currently, both have expressed interest in joining its so-called “Pillar 2” – the component under the agreement focused on advanced defence technologies such as artificial intelligence, quantum computing, cyber warfare and space systems.\nJapan is already involved in Aukus projects related to maritime autonomous systems and AI-piloted aircraft. South Korea is in discussions to participate in research around hypersonic weapons and quantum military applications.\nEconomic, political factors at play\nNemeth noted that the US decision to share nuclear propulsion technology with South Korea could help smooth the path for Japan to pursue similar capabilities. But he cautioned that such support was far from guaranteed.\n“It is not automatic,” he said, noting that Washington’s move appeared to be driven as much by industrial and economic considerations as by alliance politics.\nTrump has said that Hanwha will build submarines at a shipyard in Philadelphia run by the South Korean conglomerate.\nWhile South Korea has committed to major investments in American shipyards and cooperation with the US in shipbuilding, Japan has not done the same, despite having the world’s third-largest shipbuilding industry after China and South Korea, Nemeth noted.\n“If Japan were to seek a similar arrangement, offering tangible contributions to bolster US shipbuilding capacity would likely make its case stronger,” Nemeth said.\n\nHe added that while Japan had the industrial and technological capacity to develop nuclear-powered submarines, it must obtain Washington’s consent to enrich and reprocess nuclear material under their bilateral nuclear cooperation agreement.\n“In practice, Japan cannot move ahead independently without US consent,” Nemeth said.\nGrant Newsham, senior research fellow at the Japan Forum for Strategic Studies, said that if Japan were to declare its intention to build a nuclear submarine and ask the US for help, Washington would likely agree to help.\n“Ten years ago, or even five years ago, this would not have happened,” Newsham said, noting that the threat to Japan and the US in Northeast Asia posed by China, North Korea, and Russia had made submarine cooperation between Washington and Tokyo possible.\n“The idea of Japan having nuclear subs seems unobjectionable, if not sensible,” Newsham said. The US was so “overstretched” that Tokyo would likely have to develop nuclear submarine development regardless of Washington’s thinking, he added.\n“If Japan and South Korea build nuclear submarines, it will have a stabilising effect since they are more able to defend themselves against Chinese and North Korean aggression,” Newsham said.\nIt would also strengthen the capabilities of “free nations in the Indo-Pacific region”, he said, pointing to the defence cooperation between the US, Australia and other countries.\n“Aukus was more a joining of like-minded nations rather than ‘Anglo nations’ joining.”\n\nYoichiro Sato, a professor at Japan’s Ritsumeikan Asia-Pacific University, said that any nuclear-powered submarines of Japan and South Korea operating in Southeast Asian waters might run into “political opposition” in the region.\nIndonesia had expressed concerns about Aukus submarines in its exclusive economic zone (EEZ), and other Southeast Asian countries might do likewise, said Sato, noting that China had deployed nuclear-powered and nuclear-armed submarines in the South China Sea previously.\nJakarta’s concerns stemmed from the potential for a regional arms race, the weakening of nuclear non-proliferation norms, and the environmental impact of nuclear-powered vessels in its EEZ and archipelagic waters.\nUnlike their conventional diesel-electric counterparts, nuclear-powered submarines have longer ranges and can operate further away from their home ports.\nWhile Japan and South Korea have been well served by conventional submarines, they now face pressure to be “a useful ally” of Washington by integrating their plan into the US strategy to anchor the US commitment to their defence, according to Sato.","summary":"The three-member Aukus defence pact may soon expand beyond its primary aim of boosting Australia’s submarine fleet to also include Japan and South Korea, according to analysts, with both North Asian powers potentially co-developing or acquiring similar nuclear-powered vessels and taking part in hi-tech projects.\nThese developments could transform Aukus – a trilateral security partnership between Australia, the United States and Britain – into a more expansive Indo-Pacific defence...","url":"https://www.scmp.com/week-asia/politics/article/3332562/will-japan-and-south-korea-join-aukus-co-develop-nuclear-submarines-us","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/13/e546d1bd-3d04-4d3b-8b4e-39d4c123400a_47e37668.jpg","video":null,"publish_date":"2025-11-13 01:14:47","author":"Maria Siow","authors":["Maria Siow"],"language":"en","source_country":"cn","sentiment":0.148},{"id":378414316,"title":"Will US flights resume, layoffs reverse? Relief in sight for Americans as govt shutdown nears end","text":"The House of Representatives advanced a procedural measure aimed at ending the longest government shutdown in US history. The Republican-led House voted 213–209 to move the measure toward a final vote, with President Donald Trump’s backing helping to maintain party unity despite strong opposition from House Democrats, according to Reuters. The stopgap funding bill would restore food assistance programs, pay hundreds of thousands of federal employees and get the nation’s air-traffic control system back on track.Democrats expressed frustration that the prolonged standoff initiated by their Senate counterparts did not result in an agreement to continue federal health insurance subsidies.(This is a developing story. More to come)","url":"https://www.livemint.com/news/us-news/us-flights-to-resume-furloughed-staff-to-return-layoffs-reversed-food-aid-to-begin-as-govt-shutdown-nears-end-11762995236624.html","image":"https://www.livemint.com/lm-img/img/2025/11/13/1600x900/logo/USA-SHUTDOWN--0_1762604598202_1762604605732_1762995700425.JPG","video":null,"publish_date":"2025-11-13 01:10:57","author":"Garvit Bhirani","authors":["Garvit Bhirani"],"language":"en","category":"politics","source_country":"in","sentiment":-0.514},{"id":378414340,"title":"See how Donald Trump is creating his own police force","text":"DHS says its agents use force only after protesters assault them. Bystanders’ videos of the violence perpetrated by Border Patrol agents contradict that notion. Gregory Bovino, the Border Patrol official leading the operation, has himself been filmed tackling and tear-gassing protesters. During a deposition he described Border Patrol’s use of force in Chicago as “more than exemplary\". It seems designed to set an example. One video shown in court features Mr Bovino telling his agents in Los Angeles earlier this year: “Everybody fucking gets it if they touch you.\"\n\n When Donald Trump began his mass deportation campaign, Immigration and Customs Enforcement (ICE), the agency that carries out deportations, had limited resources and its agents were used to focusing on finding criminals—not on racking up as many arrests as possible. The administration’s short-term solution has been to divert nearly 15,000 other federal officers—including Border Patrol and FBI agents—from their day jobs to help arrest immigrants in cities. Jason Houser, a former ICE chief of staff, calls this new behemoth “a Frankenstein task-force\". But what began as a way to increase the pace of deportations has come to look like a national police force, answerable to the president, that is at least as focused on bullying the residents of Democrat-run cities as it is on deporting undocumented migrants.\n\n “You’re not going to arrest illegal immigrants by marching down the street in full battle regalia,\" notes a former DHS official. “It’s intended to be an intimidation tactic.\" The theatrics may reflect frustration at the difficulty of carrying out the mass deportations Mr Trump promised.\n\n Phalanxes of federal agents solve another problem for the Trump administration. Law enforcement in America is decentralised. In France, for example, the government can send its national riot police to break up protests. America’s federal cops, such as the FBI, don’t do crowd control and courts have so far blocked Mr Trump’s deployments of National Guard troops to Oregon and Illinois. Anyway, National Guard troops do not have the power to arrest or detain people, thanks to the Posse Comitatus Act, a law from 1878 that prevents soldiers from acting like cops. Federal agents, in contrast, have arrest powers and access to military equipment, and can be sent around the country at the president’s whim.\n\n That force is about to get a lot bigger. The One Big Beautiful Bill included $170bn to beef up immigration enforcement. Much of that money will go to ICE and Customs and Border Protection (CBP), Border Patrol’s parent agency. Mr Bovino has hinted that New York City is next on his list of targets. But, as it grows, Mr Trump’s mega-police force may reach rural America, too. At a recent protest outside an ICE facility in Durango, Colorado an immigration agent grabbed a protester by her hair, choked her and threw her to the ground. In a video posted to X in September Mr Bovino chirps: “We’re taking this show on the road to a city near you.\"\n\nForce, multiplied\n\nBorder Patrol agents, in particular, are not well-suited to their new job. They are used to chasing smugglers through the deserts and mountains of the American south-west, not prioritising the constitutional rights of American citizens protesting on city streets. Border Patrol “has long been considered a paramilitary organisation\", explains the former DHS official. Its tactical units resemble military Special Forces. The result of sending quasi-soldiers to neighbourhoods is chaos and violence. At least three immigrants have died while attempting to flee federal agents. Several other people have been shot.\n\n In October DHS announced that the heads of several ICE field offices would be replaced with Border Patrol officials. The move seems to confirm that Mr Trump enjoys Mr Bovino’s theatrics and machismo. Career ICE officials, on the other hand, are used to planning targeted raids and prioritising criminals. “I don’t think anyone has ever accused ICE of being overly cautious,\" says John Sandweg, who led the agency briefly under Barack Obama. “But the appeal of the Border Patrol to the administration is that they are even more aggressive than ICE in terms of: stop people first, and sort it out later.\"\n\n The larger role of Border Patrol is also partly due to the agency’s size. Congress showered CBP with money in the years after the terrorist attacks of September 11th 2001. Border Patrol boasts nearly 20,000 agents, while ICE’s enforcement division employs roughly 6,000 officers.\n\n ICE will not be Border Patrol’s little brother for long. DHS wants to hire 10,000 deportation officers by the end of the year, and is offering signing bonuses of up to $50,000 and help with student loans to those who make the cut. Tricia McLaughlin, a DHS spokesperson, says the department has received more than 175,000 applications and has offered jobs to 18,000. Adding the ICE newbies to the existing hotch-potch of agents means that more than 30,000 federal officers could be involved in immigration enforcement in American cities, nearly as many as the number of cops in New York City’s police department, the largest in the country.\n\n Such hiring surges in law enforcement can increase the risk of violence. There is a long list of police departments and agencies that were given a lot of money to staff up, says Gil Kerlikowske, a former CBP commissioner. “They all have horror stories.\" CBP is one of them. The number of Border Patrol agents roughly doubled between 2003 and 2013 as immigration became more intertwined with national security. The Government Accountability Office, a congressional watchdog, found that there were more than 2,000 arrests for officer misconduct between 2005 and 2012. DHS officials at the time warned that drug gangs were trying to infiltrate the agency. They succeeded. During that era 125 agents were convicted of corrupt acts, including drug- and people-smuggling.\n\n The administration’s message to federal agents is that their aggression is justified and their actions beyond reproach. “To all ICE officers,\" said Stephen Miller, an adviser to Mr Trump, “you have federal immunity in the conduct of your duties.\" Steve Vladeck, a law professor at Georgetown University, warns that rhetoric is dangerous “both because he’s wrong and because they’re not going to know that he’s wrong\".\n\n The Supremacy Clause of the constitution, which lays out America’s federal system, makes it tricky—but not impossible—for local prosecutors to charge federal agents for crimes they commit while doing their jobs. The case law is sparse, and more recently federal judges have tended to decide for themselves whether an agent acted reasonably, rather than allowing a jury to weigh in. But local officials seem ready to try. The police chief in Durango, where the protester was put in a chokehold, has asked state investigators to explore whether criminal charges may be warranted.\n\n In Chicago, Judge Ellis is trying to rein in federal agents. On November 6th the Obama appointee ordered officers to restrict their use of force against protesters and journalists unless it is “objectively necessary to stop an immediate threat\". She said Mr Bovino had lied under oath when he claimed he had been hit in the head with a rock, in order to justify tear-gassing protesters. He now has to wear a body camera. Yet two days after her ruling a convoy of heavily armed agents rode through Little Village, the heart of Mexican Chicago. Their weapons were drawn.","url":"https://www.livemint.com/global/see-how-donald-trump-is-creating-his-own-police-force-11762995666535.html","image":"https://www.livemint.com/lm-img/img/2025/11/13/1600x900/logo/US-DHS-SECRETARY-NOEM-HOLDS-PRESS-CONFERENCE-IN-BR_1762995842430_1762995842584.jpg","video":null,"publish_date":"2025-11-13 01:06:25","author":"The Economist","authors":["The Economist"],"language":"en","category":"politics","source_country":"in","sentiment":-0.224},{"id":378414066,"title":"U.S. House takes step toward ending longest government shutdown in its history","text":"WASHINGTON - The House of Representatives took a procedural step toward ending the longest government shutdown in U.S. history on Wednesday, advancing a stopgap funding package to restart disrupted food assistance, pay hundreds of thousands of federal workers and revive a hobbled air-traffic control system.The Republican-controlled chamber voted 213-209 to move toward a final vote on the measure, with President Donald Trump’s support largely keeping his party together in the face of vehement opposition from House Democrats, who are angry that a long standoff launched by their Senate colleagues failed to secure a deal to extend federal health insurance subsidies.Eight Senate Democrats on Monday broke with party leadership to pass the funding package, which would extend funding through January 30, leaving the federal government on a path to keep adding about $1.8 trillion a year to its $38 trillion in debt.","url":"https://www.japantimes.co.jp/news/2025/11/13/world/politics/us-house-government-shutdown/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/11/13/505541.JPG?v=3.1","video":null,"publish_date":"2025-11-13 01:04:18","author":"Bo Erickson,David Morgan","authors":["Bo Erickson","David Morgan"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.135},{"id":378415056,"title":"Albanese government targets tech giants with news content levy","text":"The Albanese government is pushing ahead with its plan to force social media companies to pay for Australian news content carried on their platforms. Treasury has published a long-awaited discussion paper on the news media bargaining incentive, first promised almost a year ago. Under the plan, Tech giants Google, Meta (which owns Facebook and Instagram) and TikTok would be hit with a levy if they do not voluntarily enter into deals with publishers to pay for their content. \"If they don&apos;t enter into agreements, that is where the incentive payments will be levied,\" assistant treasurer Dan Mulino told reporters in Sydney on Thursday. The government moved slowly on the plan amid concerns United States President Donald Trump may retaliate against any new tariffs. The scheme is intended to ensure that large digital platforms contribute to the sustainability of news and journalism in Australia by encouraging commercial deals, and is being characterised as an incentive rather than a tax. Once legislated, the incentive would apply to all large digital platforms operating significant social media or search services in Australia. The government came up with the plan to address concerns that the Coalition-era news media bargaining code was no longer working, after Meta ended deals with Australian publishers worth about $200 million a year. Dr Mulino said Treasury had estimated that these had been worth about 1.5 per cent of the tech giants&apos; gross revenue. The new penalties would be 2.25 per cent of revenue, meaning those that comply would achieve tax savings. Meta, if it does not comply, would face a tax hit of $112 million a year, and this revenue would be handed to media companies. The government is still considering how any revenue raised would be divided between smaller and larger media companies. Prime Minister Anthony Albanese, who met with Mr Trump in October, said in June that his government respected the \"vital role\" of the news media, \"particularly local papers\". \"It is of critical importance that those media organisations are able to survive,\" Mr Albanese said at the time. The incentive can not be avoided by dropping Australian news content, like Meta did in Canada. Meta has previously stated that its users are no longer interested in news content. Google has renewed or entered new partnerships with some Australian outlets, including Australian Community Media (publisher of this masthead), Junkee, Yahoo, Private Media, The Conversation, Schwartz Media and Southern Cross Austereo. Consultation on the news media bargaining incentive will close on December 19.","url":"https://www.canberratimes.com.au/story/9110867/albanese-government-targets-tech-giants-with-news-content-levy/","image":"/images/transform/v1/crop/frm/234480217/88ca486d-69ce-4ab3-a610-30beb4617837.jpg/r0_0_1200_675_w1200_h675_fmax.jpg","video":null,"publish_date":"2025-11-13 01:01:50","author":"Dana Daniel","authors":["Dana Daniel"],"language":"en","category":"politics","source_country":"au","sentiment":-0.29},{"id":378413132,"title":"Texas Woman Faces Sentencing After Threatening Judge in Trump 2020 Case","text":"A Texas woman who admitted to leaving a racist, threatening voicemail for the judge overseeing Donald Trump’s 2020 election case will learn her fate in federal court in Houston on Wednesday.\n\nAbigail Jo Shry, 45, pleaded guilty last year to making an interstate threat after investigators traced a menacing message to her phone. The call came just hours after U.S. District Judge Tanya Chutkan was assigned to Trump’s case in August 2023, according to court documents.\n\nPer CBS, prosecutors said Shry vowed to kill “anyone who went after President Trump,” hurled a racial slur at Judge Chutkan, and expanded her threats to target a Texas Democratic congresswoman, “all Democrats,” and the LGBTQ community. In the same voicemail, she warned, “If Trump doesn’t get elected in 2024, we are coming to kill you, so tread lightly,” according to the Justice Department. Investigators confirmed that Shry’s cell phone was used to make the call.\n\nIn November 2024, Shry told the court she understood that even a threat she didn’t intend to carry out could still be a crime. Prosecutors said she fully admitted to making the call. The charge carries a maximum sentence of five years in prison, though federal defendants often receive less than the maximum. The U.S. Attorney’s Office for the Southern District of Texas announced her guilty plea, but sentencing recommendations have not been made public.\n\nU.S. District Judge Keith P. Ellison is presiding over Wednesday’s sentencing hearing. The case has been delayed several times since last year, with Judge Ellison now expected to decide how much prison time, if any, Shry will serve.\n\n🇺🇸 TEXAS WOMAN ADMITS TO THREATENING JUDGE IN TRUMP CASE\nAbigail Jo Shry of Texas pleaded guilty to threatening U.S. District Judge Tanya Chutkan, overseeing Trump’s election subversion case.\nIn an August voicemail, Shry used racist slurs and threatened to kill Chutkan, Rep.… pic.twitter.com/iJiHUQE52O\n— Mario Nawfal (@MarioNawfal) November 13, 2024\n\nCourt filings also shed light on what Shry told investigators after her arrest. She reportedly admitted making the threats but said she had no intention of acting on them. However, she added that if the congresswoman she mentioned “ever traveled to her city,” people should “worry.” Prosecutors included that statement in their filings, pointing to it as evidence that the threat was not entirely idle.\n\nHer case is part of a disturbing trend. Threats against federal judges have skyrocketed in recent years. The U.S. Marshals Service says it has investigated more than 560 threats so far in 2025, already outpacing last year’s total. Officials warn that hostility toward judges has grown as political tensions rise and high-profile cases, including Trump’s, dominate the headlines.\n\nShry was initially held in pretrial detention but later released under strict conditions. She was barred from owning firearms or consuming alcohol after prosecutors expressed concern that her behavior could escalate. During a May 2024 hearing, one prosecutor warned, “My greatest concern in this case is that she starts watching FOX News again, gets herself spun up, and drinks. There’s no way to predict what happens after that except to look at her past.”\n\nThe hearing in Houston is expected to focus on how serious her threats were and whether she poses a future danger. For judges handling politically charged cases, the Shry case serves as another reminder of the increasingly hostile climate they face.\n\nJudge Chutkan, who has presided over multiple Trump-related cases, has become a target of online anger and conspiracy theories. Shry’s voicemail, both vulgar and racially charged, underscores that the threats facing public officials are not just digital noise, they have real-world consequences.\n\nThe question for the court now isn’t whether Shry crossed a line, she already admitted that, but how sharply Judge Ellison decides to draw it.","summary":"A Texas woman who phoned in a racist death threat to Judge Tanya Chutkan after she took on Trump’s 2020 election case faces sentencing.","url":"https://www.inquisitr.com/texas-woman-faces-sentencing-after-threatening-judge-in-trump-2020-case","image":"https://www.inquisitr.com/wp-content/uploads/2025/11/Abigail-Shry-and-Donald-Trump.jpg","video":null,"publish_date":"2025-11-13 01:00:53","author":"Frank Yemi","authors":["Frank Yemi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.133},{"id":378411818,"title":"Seven out of 10’: Rogan warns US sliding towards ‘civil war’ after celebration of Charlie Kirk’s assassination","text":"Speaking to comedian Brian Redban on Wednesday’s episode of The Joe Rogan Experience, the host said he had been shocked to see the reaction to the September 10 shooting of the Turning Point USA founder while speaking at a Utah university.\n\nTyler Robinson, 22, has been charged over the shooting. Police allegedly discovered “anti-fascist” messages engraved on bullet casings left by Robinson, who had embraced “leftist ideology”, according to authorities. \n\n“Charlie Kirk gets shot and people are celebrating,” Rogan, 58, said.\n\n“Like, whoa, whoa, whoa, you want people to die that you disagree with? Like, where are we right now on the scale of one to civil war? Are we at seven? Because I thought we were at five. But after the Charlie Kirk thing, I’m like, oh, we might be like seven. This might be step seven on the way to a bona fide civil war. \n\n“As soon as you start seeing regular people celebrating somebody getting murdered in front of their wife and kid on television in front of the whole world, as soon as you celebrate that, like, man, you’re in dark territory.\n\n“And if the worst thing you could say about that guy is that he said some things I disagree with, and you’re celebrating that he got shot in the neck in front of the world, whoa. And you work at an insurance company? This is nuts. And you thought that it was OK to say that on Instagram? This is nuts. Like what are you guys on? What is happening here?”\n\nRedban, 51, joked, “Oestrogen pills.”\n\nAfter the 31-year-old Trump-aligned political activist’s death, many liberals took to social media to justify or outright celebrate the shooting.\n\nConservatives in turn sought to identify and contact employers of those who had shared offensive posts about Kirk in an attempt to get people fired.\n\nLast month the US State Department announced it had cancelled the visas of at least six foreigners who had made similar comments.\n\nPresident Donald Trump and Secretary of State Marco Rubio “will defend our borders, our culture, and our citizens by enforcing our immigration laws”, the State Department said at the time.\n\n“Aliens who take advantage of America’s hospitality while celebrating the assassination of our citizens will be removed.”\n\nDeputy Secretary of State Christopher Landau urged social media users to continue alerting him to relevant posts, saying he was “disgusted to see some on social media praising, rationalising, or making light of the event” and had “directed our consular officials to undertake appropriate action”.\n\nThe killing of Kirk, while the most high-profile political assassination in decades, was just the latest incident in a disturbing rise in politically motivated violence in the US.\n\nMr Trump, 79, faced two assassination attempts on the campaign trail last year, narrowly surviving being shot in the ear at a rally in Butler, Pennsylvania on July 13 in an attack that claimed the life of retired firefighter Corey Comperatore, 50.\n\nGunman Thomas Matthew Crooks, 20, was shot and killed by US Secret Service snipers at the scene. To this day little has been revealed publicly about his potential motivation or political ideology.\n\nIn June this year, a would-be assassin targeted two Democratic state legislators in Minnesota in their homes, killing one of them — Melissa Hortman, 55, along with her husband Mark Hortman, 58.\n\nVance Boelter, 57, faces charges of murder, stalking and firearms offences over what the Department of Justice described as “heinous political assassinations”.\n\nIn April, the home of Pennsylvania Governor Josh Shapiro was firebombed in another act of political violence.\n\nCody Balmer, 38, was sentenced last month to between 25 and 50 years in prison after pleading guilty to charges including terrorism, arson, burglary and aggravated assault.\n\nBalmer targeted the Democrat, who is Jewish, over his views on the war in Gaza, the suspect said in a call to a 911 operator after the fire, according to search warrants.\n\nGovernor Shapiro, 52, said after the plea deal that it was important the US not grow “numb” to acts of political violence or accept them as “the normal course of doing business”.\n\nIn December, UnitedHealthcare chief executive Brian Thompson, 50, was shot in the back and killed while leaving a hotel in Manhattan.\n\nLuigi Mangione, 27, currently facing state and federal charges of murder, has also attracted a controversial army of mostly left-wing supporters.\n\nSpeaking on Wednesday’s podcast, Rogan argued there had been a “rejection” of much of the “woke” ideology that was “rotting people’s brains”.\n\n“But the scary part is what we usually do is we do something like that and then we overcorrect,” he said.\n\n“And then we go like white nationalists and ‘we’re all Christians, get rid of the Muslims’. Like, it gets scary when there’s hardcore ideological conflict because people push back. That’s what people are doing on the left and the right.”\n\nOnly around four in 10 US adults are concerned about political violence directed at conservatives or liberals, according to an Associated Press survey last month.\n\nThe AP poll found younger adults were less concerned about political violence, and that there was a substantial partisan divide, with Republicans and Democrats expressing high concern about violence against their own side but not the other.","summary":"Podcaster Joe Rogan has issued a dire warning for the US following widespread celebration on the left of the assassination of Charlie Kirk.","url":"https://www.news.com.au/entertainment/tv/radio/seven-out-of-10-rogan-warns-us-sliding-towards-civil-war-after-celebration-of-charlie-kirks-assassination/news-story/a3a8c16ff2371d5042be7cd9cab76734?from=rss-basic","image":"https://content.api.news/v3/images/bin/840fee009bdd965d2c467299242a451e","video":null,"publish_date":"2025-11-13 00:56:30","author":"Frank Chung","authors":["Frank Chung"],"language":"en","source_country":"au","sentiment":-0.371},{"id":378414768,"title":"Supreme Court Considers Whether the First Step Act Allows Reduction in Criminal Sentences","text":"The Supreme Court heard arguments Wednesday on whether convicted felons can petition for reduced sentencing under the First Step Act, a criminal justice reform law that President Donald Trump signed during his first term. \n\nThe cases focus on what criteria a federal judge can consider in reducing a prisoner’s sentence, and whether this can include the sentencing law from 2018. \n\nThe U.S. Sentencing Commission has said judges can use the 2018 reform law as a factor to consider in deciding whether to reduce a sentence. However, judges have differed on whether sentences issued before the First Step Act are bound to existing law. \n\nThe Justice Department has argued for maintaining the existing sentences.\n\nThe Supreme Court heard three separate criminal sentences on Wednesday: Fernandez v. United States and then the consolidated case of Rutherford v. United States and Carter v. United States. \n\nThe First Step Act, enacted in 2018, permits district courts to reduce some lengthy sentences if there is an “extraordinary and compelling reason.” \n\nA jury convicted Joe Fernandez of participating in a 2000 murder-for-hire conspiracy, even though the government’s key witness had admitted to lying to authorities in previous cases. He received a mandatory life sentence in 2014. Seven years after sentencing, a district court judge found “extraordinary and compelling reasons” to reduce Fernandez’s sentence, including the possibility that Fernandez had been innocent. \n\nThe U.S. Court of Appeals for the 2nd Circuit reversed the ruling, finding that the First Step Act’s compassionate release was not the proper venue for litigating his potential innocence or challenging the conviction’s validity.\n\nBenjamin Gruenstein, arguing for Fernandez, said the government was taking an unreasonable position. \n\n“Under the plain meaning of the statute, if a court finds an error that’s significantly increased the length of the defendant’s sentence, that fact can contribute to a finding of extraordinary and compelling reasons to reduce the sentence,” Gruenstein told the justices. “Even when a court finds no error, it may nonetheless decide that the circumstances surrounding the defendant’s sentence were so unusual and unfair as to be extraordinary and compelling. That’s what happened here. The government’s position is extreme. It contends that no argument related to a defendant’s judgment may even be considered in the extraordinary and compelling calculus.”\n\nHowever, Deputy Solicitor General Eric Feigin argued the reform law creates “narrow exceptions” for reducing sentences that are not otherwise specifically addressed. \n\n“What you’ve just heard and what’s in their briefs is a proposal to make it instead an open-ended loophole to challenge the validity of sentences, continuously through a potentially endless series of collateral attacks on the criminal judgment,” Feigin told the justices. \n\nThe other consolidated case involves two separate individuals convicted in robbery cases, Daniel Rutherford and Johnnie Carter, who each claimed similar “extraordinary and compelling” reasons for a reduction in their sentences under the First Step Act.\n\nRight on Crime, a conservative group that advocates for sentencing reforms, filed an amicus brief in the Rutherford v. United States case. \n\nRachel Wright, the national policy director for Right on Crime, said in a video post that early release for inmates with medical issues or who are otherwise low risk strengthens law enforcement and is fiscally responsible. \n\n“It’s still holding accountable those offenders who have committed the crimes, they’re incarcerated, but it’s allowing for equal justice under the law,” Wright said. “You should not have a totally different sentence, sometimes ranging from 15 to 20 years longer, just based on the time that you committed the crime.” \n\nRutherford received a mandatory minimum sentence of 32 years and Carter received 57 years. Under the First Step Act, which reversed some mandatory minimum sentences, their sentences would have been 18 years and 36 years, respectively. District courts denied their petitions for a reduced sentence. The U.S. Court of Appeals for the 3rd Circuit affirmed both sentences.","summary":"The Supreme Court heard arguments Wednesday on whether convicted felons can petition for reduced sentencing under the First Step Act, a criminal justice reform law... Read More\n\n\nThe post Supreme Court Considers Whether the First Step Act Allows Reduction in Criminal Sentences appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/12/supreme-court-considers-whether-first-step-act-allows-reduction-criminal-sentences/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/2-FirstStepActSCOTUS.gif","video":null,"publish_date":"2025-11-13 00:55:00","author":"Fred Lucas","authors":["Fred Lucas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.007},{"id":378412028,"title":"The Democrats timed this bombshell perfectly – now there are signs the White House is panicking","text":"In addition to summoning Boebert (and calling her, according to The New York Times), US President Donald Trump made a last-ditch plea, or threat, by posting to his Truth Social page that “only a very bad, or stupid” Republican would help the Democrats by joining the “Epstein hoax” bandwagon.\n\nAs it stands, the petition has enough signatures, having been signed by the House’s newest member, Democrat Adelita Grijalva, as her first item of business. But if any Republicans were to withdraw their name, it would fail.\n\nPractically, the petition carries no weight unless it is also supported by the Senate and agreed to by Trump, which won’t happen. But it is evident the White House does not want a House vote to proceed, regardless.\n\nThe latest emails released by the committee show us exactly why Trump doesn’t want these files released. Even on a kind reading, they raise awkward questions. What does Epstein mean when he says Trump is the “dog that hasn’t barked”? When he says Trump “knew about the girls”, what is he getting at?","url":"https://www.theage.com.au/world/north-america/the-democrats-timed-this-bombshell-perfectly-now-there-are-signs-the-white-house-is-panicking-20251113-p5nf1j.html","image":"https://static.ffx.io/images/$zoom_1.4537%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/d053d23aa61419ea7723e8c91b5e0b6aa72ff1dd","video":null,"publish_date":"2025-11-13 00:54:30","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","category":"politics","source_country":"au","sentiment":-0.577},{"id":378413292,"title":"The Democrats timed this bombshell perfectly – now there are signs the White House is panicking","text":"In addition to summoning Boebert (and calling her, according to The New York Times), US President Donald Trump made a last-ditch plea, or threat, by posting to his Truth Social page that “only a very bad, or stupid” Republican would help the Democrats by joining the “Epstein hoax” bandwagon.\n\nAs it stands, the petition has enough signatures, having been signed by the House’s newest member, Democrat Adelita Grijalva, as her first item of business. But if any Republicans were to withdraw their name, it would fail.\n\nPractically, the petition carries no weight unless it is also supported by the Senate and agreed to by Trump, which won’t happen. But it is evident the White House does not want a House vote to proceed, regardless.\n\nThe latest emails released by the committee show us exactly why Trump doesn’t want these files released. Even on a kind reading, they raise awkward questions. What does Epstein mean when he says Trump is the “dog that hasn’t barked”? When he says Trump “knew about the girls”, what is he getting at?","summary":"Republicans have flooded the zone with new Epstein materials in a bid to dilute the impact of the Trump-related emails hand-picked by the Dems.","url":"https://www.smh.com.au/world/north-america/the-democrats-timed-this-bombshell-perfectly-now-there-are-signs-the-white-house-is-panicking-20251113-p5nf1j.html","image":"https://static.ffx.io/images/$zoom_1.4537%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/d053d23aa61419ea7723e8c91b5e0b6aa72ff1dd","video":null,"publish_date":"2025-11-13 00:54:30","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","category":"politics","source_country":"au","sentiment":-0.577},{"id":378413534,"title":"How Trump-era funding cuts endanger efforts to empower Haiti’s farmers  - St. Vincent Tribune – Daily St","text":"Oanaminthe, Haiti – It’s a Monday afternoon at the Foi et Joie school in rural northeast Haiti, and the grounds are a swirl of khaki and blue uniforms, as hundreds of children run around after lunch.\n\nIn front of the headmaster’s office, a tall man in a baseball cap stands in the shade of a mango tree.\n\nAntoine Nelson, 43, is the father of five children in the school. He's also one of the small-scale farmers growing the beans, plantains, okra, papaya and other produce served for lunch here, and he has arrived to help deliver food.\n\n\"I sell what the school serves,\" Nelson explained. \"It’s an advantage for me as a parent.”\n\nNelson is among the more than 32,000 farmers across Haiti whose produce goes to the World Food Programme, a United Nations agency, for distribution to local schools.\n\nTogether, the farmers feed an estimated 600,000 students each day.\n\nTheir work is part of a shift in how the World Food Programme operates in Haiti, the most impoverished country in the Western Hemisphere.\n\nRather than solely importing food to crisis-ravaged regions, the UN organisation has also worked to increase its collaborations with local farmers around the world.\n\nBut in Haiti, this change has been particularly swift. Over the last decade, the World Food Programme went from sourcing no school meals from within Haiti to procuring approximately 72 percent locally. It aims to reach 100 percent by 2030.\n\nThe organisation's local procurement of emergency food aid also increased significantly during the same period.\n\nThis year, however, has brought new hurdles. In the first months of President Donald Trump’s second term, the United States has slashed funding for the World Food Programme.\n\nThe agency announced in October it faces a financial shortfall of $44m in Haiti alone over the next six months.\n\nAnd the need for assistance continues to grow. Gang violence has shuttered public services, choked off roadways, and displaced more than a million people.\n\nA record 5.7 million Haitians are facing \"acute levels of hunger\" as of October — more than the World Food Programme is able to reach.\n\n\"Needs continue to outpace resources,\" Wanja Kaaria, the programme's director in Haiti, said in a recent statement. \"We simply don’t have the resources to meet all the growing needs.\"\n\nBut for Nelson, outreach efforts like the school lunch programme have been a lifeline.\n\nBefore his involvement, he remembers days when he could not afford to feed his children breakfast or give them lunch money for school.\n\n“They wouldn’t take in what the teacher was saying because they were hungry,” he said. “But now, when the school gives food, they retain whatever the teacher says. It helps the children advance in school.\"\n\nNow, experts warn some food assistance programmes could disappear if funding continues to dwindle — potentially turning back the clock on efforts to empower Haitian farmers.","url":"https://stvincenttribune.com/how-trump-era-funding-cuts-endanger-efforts-to-empower-haitis-farmers/","image":"https://stvincenttribune.com/app/uploads/2025/11/IMG_20250320_152636307-1762915451-plGy19.jpg","video":null,"publish_date":"2025-11-13 00:53:03","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"vc","sentiment":0.097},{"id":378414250,"title":"US sanctions Indian company over director’s alleged links to Iran’s missile, drone programmes ","text":"New York, Nov 13 (SocialNews.XYZ) The US sanctioned an Indian company, alleging it has links through one of its directors to Iran’s missile programme.\n\nThe Treasury Department listed the Chandigarh-based Farmlane Private Limited among 32 businesses and individuals sanctioned because of their alleged connections to a supply chain for Iran’s missile and drone programmes.\n\nThe Treasury Department did not directly accuse Farmlane of supplying material used for rocket propellants for missiles, but said that one of its directors was involved in the scheme that relied on Chinese suppliers.\n\nIt identified Marco Klinge, who is based in the United Arab Emirates, as the director of Farmlane.\n\nAccording to the US Office of Foreign Assets Control, he is a German citizen.\n\nUnder the sanctions, they will not be able to access US financial systems, and any assets in the US will be frozen.\n\nThe US invoked the reimposition of United Nations sanctions on Iran for the measures, Tommy Pigott, the State Department's Principal Deputy Spokesperson, said.\n\nThe UN brought back the sanctions on September 27 because Iran violated the 2015 agreement against developing nuclear weapons.\n\nTreasury Department’s Under Secretary for Terrorism and Financial Intelligence John Hurley said, “At the direction of President (Donald) Trump, we are putting maximum pressure on Iran to end its nuclear threat”.\n\n“The United States also expects the international community to fully implement UN snapback sanctions on Iran to cut off its access to the global financial system”, he added.\n\nThe Treasury Department said that those sanctioned were also from Germany, Ukraine, Turkiye, China, Hong Kong, and Iran, and they operated multiple procurement networks for Iran.\n\nSource: IANS","summary":"New York, Nov 13 (SocialNews.XYZ) The US sanctioned an Indian company, alleging it has links through one of its directors to Iran’s missile programme. The Treasury Department listed the Chandigarh-based Farmlane Private Limited among 32...\n\n\nThe post US sanctions Indian company over director’s alleged links to Iran’s missile, drone programmes  appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/11/12/us-sanctions-indian-company-over-directors-alleged-links-to-irans-missile-drone-programmes/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/11/13/202511133573632.jpg?fit=1080%2C360&quality=80&zoom=1&ssl=1?v=1762996210","video":null,"publish_date":"2025-11-13 00:52:18","author":"Gopi","authors":["Gopi"],"language":"en","source_country":"in","sentiment":-0.055},{"id":378414470,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","url":"https://burnslakelakesdistrictnews.com/news/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-bc-lumber-8348327","image":"https://www.bpmcdn.com/f/files/shared/feeds/gps/2025/11/web1_251112-bpd-parmarinasia-parmar_1.jpg","video":null,"publish_date":"2025-11-13 00:52:00","author":"First Nations","authors":["First Nations"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378412084,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","summary":"Parmar blames Trump tariffs for industry decline, critic says he should point finger at himself","url":"https://abbynews.com/2025/11/12/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-b-c-lumber/","image":"https://abbynews.com/wp-content/uploads/sites/6/2025/11/40850770_web1_251112-BPD-Parmarinasia-Parmar_1.jpg?w=1024","video":null,"publish_date":"2025-11-13 00:52:00","author":"none","authors":["none"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378412750,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","url":"https://kimberleybulletin.com/2025/11/12/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-b-c-lumber/","image":"https://kimberleybulletin.com/wp-content/uploads/sites/21/2025/11/40850770_web1_251112-BPD-Parmarinasia-Parmar_1.jpg?w=1024","video":null,"publish_date":"2025-11-13 00:52:00","author":"Mark Page","authors":["Mark Page"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378414820,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","url":"https://langleyadvancetimes.com/2025/11/12/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-b-c-lumber/","image":"https://langleyadvancetimes.com/wp-content/uploads/sites/10/2025/11/40850770_web1_251112-BPD-Parmarinasia-Parmar_1.jpg?w=1024","video":null,"publish_date":"2025-11-13 00:52:00","author":"None","authors":["None"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378413632,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","summary":"Parmar blames Trump tariffs for industry decline, critic says he should point finger at himself","url":"https://peacearchnews.com/2025/11/12/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-b-c-lumber/","image":"https://peacearchnews.com/wp-content/uploads/sites/7/2025/11/40850770_web1_251112-BPD-Parmarinasia-Parmar_1.jpg?w=1024","video":null,"publish_date":"2025-11-13 00:52:00","author":"none","authors":["none"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378415002,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","url":"https://agassizharrisonobserver.com/2025/11/12/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-b-c-lumber/","image":"https://agassizharrisonobserver.com/wp-content/uploads/sites/24/2025/11/40850770_web1_251112-BPD-Parmarinasia-Parmar_1.jpg?w=1024","video":null,"publish_date":"2025-11-13 00:52:00","author":"None","authors":["None"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378411882,"title":"Forests Minister Parmar in Asia trying to find new customers for B.C. lumber","text":"Forests Minister Ravi Parmar is in the midst of an eight-day trade mission to Asia to forge some new ties for B.C.’s forestry industry, blaming U.S. tariffs for recent mill closures and trying to find new places to sell B.C. wood products.\n\n“The reason these mills are curtailing and closing is not because of government policy, rather because of the actions of Donald Trump and his assertive tactics on forestry workers in our forest sector in British Columbia,” he told reporters in a call from Tokyo on Wednesday.\n\nBut B.C. Conservative Forests critic Ward Stamer doesn’t see it that way, arguing that the B.C. government has hampered the province’s forestry sector through excessive rules and regulations.\n\n“For whatever reason, this government doesn’t seem to want to make any changes to policy or regulations and recognize that it’s not just Donald Trump’s fault, it’s not just the federal government’s fault,” Stamer told Black Press Media.\n\nBoth acknowledge that the recent announcement of the closure of the West Fraser timber mill in 100 Mile House is a result of the company being unable to access economically viable timber.\n\nParmar said the company applied for seven permits this year — and was granted every one within 25 days — but that was all the profitable timber the company could find to log.\n\n“When you have 45-per-cent duties and tariffs, full fibre no longer becomes viable for them to move, especially when you’re reliant on the United States as a sole trading partner,” he said. “It’s why we have to diversify.”\n\nParmar’s mission to Asia includes stops in South Korea and Japan, and he is joined on the trip by First Nations leaders and industry representatives.\n\nJapan is the second-largest market for B.C. lumber by value, buying $887 million worth of product in 2024.\n\nThis is still dwarfed by the U.S., which in 2024 took in 74.8 per cent of B.C.’s softwood lumber, worth roughly $4.5 billion.\n\nParmar said he has already struck a couple of deals that have resulted in the signing of memorandums of understanding for companies to buy Canadian wood products.\n\nWhile he promotes the forestry industry, Parmar defended the province’s record on environmental protection, despite a new Sierra Club report that the province “continues to prioritize timber supply over ecological resilience.\n\nParmar said old-growth logging is down more than 50 per cent since 2021, when old-growth deferrals were introduced.\n\n“It shows a clear downward trend,” he said.\n\nThe Sierra Club counters that much of the land set aside was already in the process of protection before the deferrals were introduced, and that logging is still four times more likely in at-risk forests recommended for deferral than on other stands of old growth.\n\nThe Sierra Club’s study found that nearly five per cent of the 11 million hectares of old-growth forest that existed in B.C. in 2021 has been logged in the four years since.\n\nCritic wants companies to earn more per tree\n\nStamer, a former logger himself, wants the government to ease restrictive regulations to ensure forestry companies can get more money per log, while making it cheaper to do business.\n\nHe gave the example of the added costs of the requirement to build a bridge instead of a fish culvert on certain logging roads.\n\n“That’s 10 times more than a fish culvert,” he said of the cost.\n\nStamer doesn’t deny that the tariffs have some impact — saying it’s good that Parmar is over in Asia trying to strike some new deals — but he doesn’t think that will get the fibre moving in the short term.\n\nA couple of quick actions that Stamer suggested are making it easier for companies to access burnt timber after fires, and for the province to encourage the use of scraps that end up in burn piles for biomass power generation systems.\n\n“If I were the forests minister, I wouldn’t be having junk piles that we would burn,” he said. “I’d be making sure that we could be grinding it up and creating electricity, just like our pulp mills are doing.”\n\nOn the whole, Stamer wants trade diversification, but said there is more the provincial government could do to make things easier for industry.\n\n“The minister is pointing the fingers in the wrong direction because he should also be pointing at himself,” he said. “This government is partly responsible for the mess that we’re in.”","summary":"Parmar blames Trump tariffs for industry decline, critic says he should point finger at himself","url":"https://campbellrivermirror.com/2025/11/12/forests-minister-parmar-in-asia-trying-to-find-new-customers-for-b-c-lumber/","image":"https://campbellrivermirror.com/wp-content/uploads/sites/9/2025/11/40850770_web1_251112-BPD-Parmarinasia-Parmar_1.jpg?w=1024","video":null,"publish_date":"2025-11-13 00:52:00","author":"none","authors":["none"],"language":"en","source_country":"ca","sentiment":-0.173},{"id":378411002,"title":"How Trump-era funding cuts endanger efforts to empower Haiti’s farmers  - St. Kitts Gazette – Daily News","text":"Oanaminthe, Haiti – It’s a Monday afternoon at the Foi et Joie school in rural northeast Haiti, and the grounds are a swirl of khaki and blue uniforms, as hundreds of children run around after lunch.\n\nIn front of the headmaster’s office, a tall man in a baseball cap stands in the shade of a mango tree.\n\nAntoine Nelson, 43, is the father of five children in the school. He's also one of the small-scale farmers growing the beans, plantains, okra, papaya and other produce served for lunch here, and he has arrived to help deliver food.\n\n\"I sell what the school serves,\" Nelson explained. \"It’s an advantage for me as a parent.”\n\nNelson is among the more than 32,000 farmers across Haiti whose produce goes to the World Food Programme, a United Nations agency, for distribution to local schools.\n\nTogether, the farmers feed an estimated 600,000 students each day.\n\nTheir work is part of a shift in how the World Food Programme operates in Haiti, the most impoverished country in the Western Hemisphere.\n\nRather than solely importing food to crisis-ravaged regions, the UN organisation has also worked to increase its collaborations with local farmers around the world.\n\nBut in Haiti, this change has been particularly swift. Over the last decade, the World Food Programme went from sourcing no school meals from within Haiti to procuring approximately 72 percent locally. It aims to reach 100 percent by 2030.\n\nThe organisation's local procurement of emergency food aid also increased significantly during the same period.\n\nThis year, however, has brought new hurdles. In the first months of President Donald Trump’s second term, the United States has slashed funding for the World Food Programme.\n\nThe agency announced in October it faces a financial shortfall of $44m in Haiti alone over the next six months.\n\nAnd the need for assistance continues to grow. Gang violence has shuttered public services, choked off roadways, and displaced more than a million people.\n\nA record 5.7 million Haitians are facing \"acute levels of hunger\" as of October — more than the World Food Programme is able to reach.\n\n\"Needs continue to outpace resources,\" Wanja Kaaria, the programme's director in Haiti, said in a recent statement. \"We simply don’t have the resources to meet all the growing needs.\"\n\nBut for Nelson, outreach efforts like the school lunch programme have been a lifeline.\n\nBefore his involvement, he remembers days when he could not afford to feed his children breakfast or give them lunch money for school.\n\n“They wouldn’t take in what the teacher was saying because they were hungry,” he said. “But now, when the school gives food, they retain whatever the teacher says. It helps the children advance in school.\"\n\nNow, experts warn some food assistance programmes could disappear if funding continues to dwindle — potentially turning back the clock on efforts to empower Haitian farmers.","url":"https://stkittsgazette.com/how-trump-era-funding-cuts-endanger-efforts-to-empower-haitis-farmers/","image":"https://stkittsgazette.com/app/uploads/2025/11/IMG_20250320_152636307-1762915451-HY7yqC.jpg","video":null,"publish_date":"2025-11-13 00:51:31","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":0.097},{"id":378413236,"title":"James Carville argues that Dems didn’t have ‘a real endgame’ for government shutdown","text":"Democratic strategist James Carville said Tuesday the Democrats didn’t have “a real endgame” with their government shutdown strategy but argued no one in the party should be mad with each other.\n\nCarville appeared on former CNN host Jim Acosta’s Substack to discuss lessons learned from the government shutdown, which is expected to end on Wednesday with the House of Representatives set to vote on a federal funding bill.\n\nAcosta noted President Donald Trump said during a Fox News interview this week that Republicans “broke” Senate Minority Leader Chuck Schumer, D-N.Y.\n\n“First of all, the lesson is, everything that everybody says is true,” Carville said. \n\n“There was not a real endgame plan here. It was a simple legislative maneuvering that we didn’t do that well on. There were a couple of points, and also the eight senators who decided to reopen the government — everything they say is true,” he added.\n\nThe eight senators in the Democratic caucus who voted with the GOP on a deal to end the shutdown have taken heat from members of their own party over their vote. \n\nSchumer has also faced backlash and calls to be replaced as the top Democrat in the Senate, though he did not vote to end the shutdown.\n\n“And this is just one of those things, that I’m not mad at anybody on the Democratic side. And no one on the Democratic side should be mad at anybody else on the Democratic side,” Carville added.\n\nHe urged Democrats and others to vent all they want about the Democrats’ decision to cave on the shutdown until Wednesday. \n\nAfter that, he said, people should “shut up” and move on.\n\n“So, when you’re in a coalition, you have different tensions within the coalition. And when you negotiate with a cult, and understand that is what the Republican Party is today. It’s a cult,” Carville said. “You’re at a severe disadvantage.”\n\nCarville said Democrats have a “you’re not the boss of me” attitude that differentiates the party from the GOP. He argued that if he were a Republican, he would have sided with the Democrats on extending the Obamacare subsidies, because “it’s going to really hurt” key voters.\n\n“I can just say the Democrats held me hostage,” he said. “The Democrats, you know, I think they had an exit ramp here. And now they’ve just shut the exit ramp down. And there’s no interstate that goes into infinity.\n\n“I actually thought, politically, the best decision they [Republicans] could have made was claim that the Democrats are political terrorists, but we’ve got to vote for this and it would have been out of the trap. But they hate it [Obamacare] so much, it’s irrational,” Carville added.\n\nCarville speculated someone on the Democratic side thought that this was “too good a deal for them to pass up.” Schumer and House Minority Leader Hakeem Jeffries have criticized the deal.","summary":"James Carville tells Democrats to stop fighting each other over failed strategy.","url":"https://nypost.com/2025/11/12/media/james-carville-argues-that-dems-didnt-have-a-real-endgame-for-government-shutdown/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/115290908.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/C9YuCwDV-RyIcpnTz.mp4","publish_date":"2025-11-13 00:50:52","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.525},{"id":378412498,"title":"The Alien Enemies Act and the Major Questions Doctrine","text":"Since Donald Trump invoked the Alien Enemies Act of 1798 (AEA) as a tool for peacetime detention and deportation in March of this year, there has been extensive litigation over the legality of that action. The AEA allows detention and deportation of non-citizens from relevant countries (including legal immigrants) \"[w]henever there is a declared war between the United States and any foreign nation or government, or any invasion or predatory incursion is perpetrated, attempted, or threatened against the territory of the United States by any foreign nation or government.\" Trump has tried to use the AEA to deport Venezuelans the administration claims are members of the Tren de Aragua (TdA) drug gang.\n\nMultiple federal district courts and the US Court of Appeals for the Fifth Circuit, have ruled that Trump's actions are illegal because illegal migration and drug smuggling of the kind TdA engages in do not qualify as a war, invasion, or predatory incursion. I think overwhelming evidence supports these conclusions, evidence I document in detail in my new article \"Immigration is Not Invasion.\" But litigation continues. The Fifth Circuit is going to rehear its decision en banc (before all 17 active judges of that court), and one district court has (incorrectly) ruled that TdA's actions qualify as a \"predatory incursion.\"\n\nIn all the litigation and commentary on this issue up to now, one important issue seems to have been overlooked (including by me!): whether Trump's interpretation of the AEA is barred by the \"major questions doctrine\" (MQD). I only became aware of it when one of my fall semester Constitutional Law I students - David Koster - raised the possibility. What follows is my own take on the issue, and is solely my responsibility. But David deserves the credit for coming up with the idea in the first place.\n\nThe major questions doctrine requires Congress to \"speak clearly\" when authorizing the executive to make \"decisions of vast economic and political significance.\" If the statute isn't clear, courts must reject the executive's assertion of power.\n\nThe sweeping authority Trump claims under the AEA seems major enough to qualify as a matter of \"vast economic and political significance.\" If the AEA can be used to deport migrants from any country that is a source of illegal migrants or cross-border drug smuggling, many millions of immigrants (including many legal ones) could potentially be subject to detention and deportation at any time the executive chooses. For example, the single largest immigrant population in the US is that from Mexico, a total of about 11.4 million people. Mexico is obviously a source of both drug smuggling and illegal migrants. The same is true of most other countries with large immigrant populations in the US, such as Cuba and the nations of Central America. If illegal migration and drug smuggling qualify as \"invasions\" or \"predatory incursions,\" we are under constant invasion (or predatory incursion) from dozens of countries around the world!\n\nTo be sure, the AEA also requires that the invasion or predatory incursion be perpetrated by a \"foreign nation or government.\" But if the tenuous ties (assessed as very weak by the Trump Administration's own intelligence agencies) between the Venezuelan government and TdA are enough to qualify, similar claims can be made about the government of virtually any other nation with a large immigrant population in this country. Mexican officials, for example, likely have at least some ties to drug smugglers. The same is likely true of government officials in various Central American nations, and elsewhere.\n\nThe power to detain and deport millions of migrants (including legal ones) at any time, and with little due process is one with obviously vast economic and political effects. Not just on migrants themselves, but on American citizens who have family, business, and other connections with these immigrants. If the authority is used on any significant scale, it would also seriously damage the US economy.\n\nA key factor the Supreme Court uses in assessing major questions cases is whether the executive's claim to authority under the relevant statute is \"unprecedented.\" Here, it very obviously is. The AEA has been around for 227 years. And in all that time, it has previously invoked on only three occasions: the War of 1812, World War I, and World War II - all major wars against foreign governments. There is zero precedent for its use to counter anything like illegal migration or drug smuggling. As discussed more fully in my article, there is also no evidence that the framers of the law ever contemplated its use for such purposes.\n\nIf MQD does apply here, it provides a strong additional justification for rejecting the administration's position. As explained in detail in my article, and the Fifth Circuit amicus brief I coauthored on behalf of the Brennan Center, the Cato Institute, and others, textual and historical evidence overwhelmingly demonstrates that \"invasion\" and \"predatory incursion\" refer to military attacks. At the very least, it is far from clear that they encompass illegal migration or drug smuggling. And if things are unclear, MQD requires courts to rule against the executive's assertion that it has been delegated a vast power.\n\nThe Trump Administration could argue that the major questions doctrine doesn't apply to delegations of power to the president, as opposed to delegations to agencies. But that's an extremely weak argument that has been rejected by multiple courts of appeals.\n\nThe Administration could also argue that major questions doctrine doesn't apply to \"foreign affairs\" delegations. The Supreme Court has never adopted any such exception. And several previous uses of the major questions doctrine have applied to policies with significant foreign policy effects. For example, in West Virginia v. EPA, the Court used major questions doctrine to strike down a Biden policy addressing climate change; climate change is obviously an issue with vast foreign policy significance. In Biden v. Nebraska, the student loan case, the Court applied the doctrine to strike down Biden's massive student loan forgiveness program. They did so despite the fact that Biden claimed the authority in question comes from the HEROES Act, legislation whose original purpose was in large part to provide loan forgiveness to members of the military serving abroad during wars and other conflicts (they are the \"heroes\" from whom the act gets its name).\n\nMoreover, mass detention and deportation of migrants is far from a pure foreign affairs issue. Its most immediate effect is on migrants living in the United States, many of whom have been here for years and are integrated into our economy or society. It also has vast effects on American citizens. Invocations of the AEA obviously do have some impact on foreign affairs. But the same is true of many, perhaps most, major domestic policies. That doesn't mean such policies are exempt from MQD scrutiny.\n\nAnother issue that might arise here is the claim that the AEA is not a true delegation because the president has inherent authority over immigration. The Constitution doesn't specify which branch of government has the power to restrict migration (probably because the federal government was not originally understood to have that power at all). But the Supreme Court has repeatedly held that this power is a legislative authority, going all the way back to the Chinese Exclusion Case of 1889, the first decision holding that the federal government has a general power to restrict migration, and in the process also ruled that the authority belongs to \"the legislative department.\" Holding that the president has his own authority to restrict migration would also upend the extensive system of immigration laws enacted by Congress over the last century and more, potentially empowering the president to just sweep it aside, at will.\n\nIn sum, the major questions doctrine clearly applies to the Trump Administration's assertion of power under the Alien Enemies Act. And if there is any ambiguity about whether the AEA gives the executive the sweeping power it claims, MQD requires a ruling against the government.\n\nAs noted above, I think courts can and should rule against the administration based on the text and history of the law alone, and several already have. But if judges conclude the AEA is unclear, the major questions doctrine requires resolving that ambiguity against the administration.\n\nFor those keeping score, I said much the same thing about the use of the MQD in various Biden-era cases, including loan forgiveness, the eviction moratorium case, and the vaccine mandate case. I have argued that MQD is an important tool for curbing excessive claims of executive power under both Democratic and Republican administrations. If necessary, it should be used here, too.","summary":"The Trump administration's claims that illegal migration and drug smuggling qualify as an \"invasion\" or a \"predatory incursion\" under the Alien Enemies Act go against the major questions doctrine.","url":"https://reason.com/volokh/2025/11/12/the-alien-enemies-act-and-the-major-questions-doctrine/","image":"https://reason.com/wp-content/uploads/2025/03/El-Salvador-Prison-2.jpg","video":null,"publish_date":"2025-11-13 00:43:58","author":"Autumn Billings,Ilya Somin","authors":["Autumn Billings","Ilya Somin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.003},{"id":378412868,"title":"Trump to sign bill to end shutdown on Wednesday night, White House says","text":"Trump to sign bill to end shutdown on Wednesday night, White House saysPresident Donald Trump will sign a bill on Wednesday night to end the U.S. government's shutdown, the White House said, adding the signing will take place at 2145 ET .","url":"https://www.marketscreener.com/news/trump-to-sign-bill-to-end-shutdown-on-wednesday-night-white-house-says-ce7d5fdfd18fff2d","image":"https://cdn.zonebourse.com/static/resize/1200/675//images/reuters/2019-12-11T174309Z_1_LYNXMPEFBA1L8_RTROPTP_3_BRITAIN-EU-MARKETS.JPG","video":null,"publish_date":"2025-11-13 00:42:16","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.444},{"id":378414506,"title":"Deadline passed, Arizona governor says Colorado River headwater states uncommitted to conservation","text":"PHOENIX (AP) — Colorado and other upstream states aren’t doing enough to commit to sharing and conserving water in the Colorado River system, Arizona Gov. Katie Hobbs said Wednesday as seven-state talks on managing the critical supply blew past a Trump administration deadline with no deal.\n\n“Not only do they refuse to commit to any water use reductions, they tell our negotiators that it is too complicated and impossible for them to reduce water use. And I have a really hard time believing that,” Hobbs said at a news conference in Yuma.\n\nThe remarks suggested that the upstream states — Colorado, Wyoming, Utah and New Mexico — and the downstream states — Arizona, California and Nevada — have a ways to go before agreeing on how to manage the river. The dwindling supply of water now serves the needs of 40 million people, for everything from washing dishes to irrigating crops and running factories.\n\nColorado officials responded to Hobbs’ remarks, which resembled others she’s made about the negotiations recently, by saying they remained committed to the talks that have been ongoing for more than two years. A joint statement from the seven states, the U.S. Bureau of Reclamation and the U.S. Department of the Interior on Tuesday said they’ve made collective progress.\n\nEarlier this year, the acting head of the U.S. Bureau of Reclamation, Scott Cameron, told the seven states to agree to a framework for a river plan by Nov. 11. That deadline passed Tuesday with no announcement of a deal or even details about sticking points, heightening the chance the Interior Department will step in with its own plan before current rules and guidelines expire next year. \n\nA key issue is that Upper Basin states don’t use their full share of water, yet are legally obligated to send a certain amount of water on average downstream to the Lower Basin. Meanwhile, the low levels of Lake Mead on the Arizona-Nevada border have triggered mandatory reductions in the supply to those two states.\n\nIn a letter Tuesday to Interior Secretary Doug Burgum, Hobbs and Arizona legislative leaders criticized what they said was an “extreme” negotiating position by Upper Basin states regarding water conservation. Arizona has been a leader in conservation, the letter asserts.\n\nColorado Water Commissioner Becky Mitchell responded by saying the letter’s “heightened rhetoric is not helpful at this time.”\n\nA statement by Colorado Gov. Jared Polis, who, like Hobbs, is a Democrat, said: “We remain committed to collaborating with our fellow basin states and moving forward to do what is best for Colorado River users, including protecting Colorado’s water resources.”\n\nHobbs plans to meet with Burgum next week. It’s unclear when negotiators plan to meet again. Arizona Department of Water Resources spokesman Doug MacEachern said recent talks were happening about every other week.\n\nAt Wednesday’s news conference in Yuma, Hobbs took particular aim at Colorado for leading the Upper Basin states in refusing to “put any water on the table to share in future water shortages.” \n\nMore involvement by President Donald Trump’s administration seemed likely to John Berggren, regional policy manager with Western Resource Advocates, a Boulder, Colorado-based environmental group.\n\n“The feds will move forward and we’ll continue to advocate for what we want to see in the new guidelines,” Berggren said. “Environmental values and environmental considerations.”\n\nMuch of the water originates as winter mountain snowfall in the Upper Basin, which collects far more that way than it consumes. Lower Basin states, including agriculture-rich regions like California’s Imperial Valley, are bigger consumers.\n\nAlong the way, major cities, including Denver, Salt Lake City, Albuquerque, Las Vegas, Phoenix and Los Angeles, are also significant users of Colorado River water.\n\nWho gets to use water — especially in dry spells — and who must conserve and let it flow downstream has been the focus of agreements among the states for decades. But the original 1922 Colorado River Compact was calculated based on an amount of water that doesn’t exist in today’s climate of long-term drought.\n\nCalifornia’s biggest Colorado River water-rights holder, the Imperial Irrigation District, said in a statement that it supported California’s “collaborative approach” to a river plan and “voluntary, equitable, and durable solutions that uphold its senior water rights” while sustaining food production and the environment.\n\nThe Associated Press’ women in the workforce and state government coverage receives financial support from Pivotal Ventures. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.\n\nGruver reported from Fort Collins, Colorado. Amy Taxin in Santa Ana, California, contributed.","url":"https://apnews.com/article/colorado-river-hobbs-polis-water-drought-climate-2603efdc8838667d2310ffb306434214","image":"https://dims.apnews.com/dims4/default/013eb3f/2147483647/strip/false/crop/6635x4423+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Ff2%2F585a1e239a0a6f4ce1f3e2d02454%2F40862958a8724c2eb659a2724105a1ae","video":null,"publish_date":"2025-11-13 00:40:53","author":"Mead Gruver,Sejal Govindarao","authors":["Mead Gruver","Sejal Govindarao"],"language":"en","category":"politics","source_country":"us","sentiment":-0.404},{"id":378410842,"title":"How Trump-era funding cuts endanger efforts to empower Haiti’s farmers  - Grenada Chronicle – Daily Grenada","text":"Oanaminthe, Haiti – It’s a Monday afternoon at the Foi et Joie school in rural northeast Haiti, and the grounds are a swirl of khaki and blue uniforms, as hundreds of children run around after lunch.\n\nIn front of the headmaster’s office, a tall man in a baseball cap stands in the shade of a mango tree.\n\nAntoine Nelson, 43, is the father of five children in the school. He's also one of the small-scale farmers growing the beans, plantains, okra, papaya and other produce served for lunch here, and he has arrived to help deliver food.\n\n\"I sell what the school serves,\" Nelson explained. \"It’s an advantage for me as a parent.”\n\nNelson is among the more than 32,000 farmers across Haiti whose produce goes to the World Food Programme, a United Nations agency, for distribution to local schools.\n\nTogether, the farmers feed an estimated 600,000 students each day.\n\nTheir work is part of a shift in how the World Food Programme operates in Haiti, the most impoverished country in the Western Hemisphere.\n\nRather than solely importing food to crisis-ravaged regions, the UN organisation has also worked to increase its collaborations with local farmers around the world.\n\nBut in Haiti, this change has been particularly swift. Over the last decade, the World Food Programme went from sourcing no school meals from within Haiti to procuring approximately 72 percent locally. It aims to reach 100 percent by 2030.\n\nThe organisation's local procurement of emergency food aid also increased significantly during the same period.\n\nThis year, however, has brought new hurdles. In the first months of President Donald Trump’s second term, the United States has slashed funding for the World Food Programme.\n\nThe agency announced in October it faces a financial shortfall of $44m in Haiti alone over the next six months.\n\nAnd the need for assistance continues to grow. Gang violence has shuttered public services, choked off roadways, and displaced more than a million people.\n\nA record 5.7 million Haitians are facing \"acute levels of hunger\" as of October — more than the World Food Programme is able to reach.\n\n\"Needs continue to outpace resources,\" Wanja Kaaria, the programme's director in Haiti, said in a recent statement. \"We simply don’t have the resources to meet all the growing needs.\"\n\nBut for Nelson, outreach efforts like the school lunch programme have been a lifeline.\n\nBefore his involvement, he remembers days when he could not afford to feed his children breakfast or give them lunch money for school.\n\n“They wouldn’t take in what the teacher was saying because they were hungry,” he said. “But now, when the school gives food, they retain whatever the teacher says. It helps the children advance in school.\"\n\nNow, experts warn some food assistance programmes could disappear if funding continues to dwindle — potentially turning back the clock on efforts to empower Haitian farmers.","url":"https://grenadachronicle.com/how-trump-era-funding-cuts-endanger-efforts-to-empower-haitis-farmers/","image":"https://grenadachronicle.com/app/uploads/2025/11/IMG_20250320_152636307-1762915451-2IhnhY.jpg","video":null,"publish_date":"2025-11-13 00:36:30","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gd","sentiment":0.097},{"id":378412578,"title":"Trump Blasts Epstein Email Dump as Democrats’ Effort to Deflect After ‘Viciously Closing Our Country’","text":"Donald Trump responded Wednesday to the latest Epstein Files release, which included emails where the late financier and sex offender wrote that the president knew about his sex ring. \n\nWriting on his personal Truth Social account, Trump blasted the email dump as an effort from the Democrats to deflect attention after “viciously closing our country” and costing the nation $1.5 trillion. \n\n“The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects,” Trump wrote. “Only a very bad, or stupid, Republican would fall into that trap. The Democrats cost our Country $1.5 Trillion Dollars with their recent antics of viciously closing our Country, while at the same time putting many at risk — and they should pay a fair price. \n\n“There should be no deflections to Epstein or anything else,” he continued, “And any Republicans involved should be focused only on opening up our Country, and fixing the massive damage caused by the Democrats!”\n\n“In other words, the Democrats are using the Jeffrey Epstein Hoax to try and deflect from their massive failures, in particular, their most recent one — THE SHUTDOWN!” the president concluded in a follow-up Truth Social post. \n\nThe release of the emails came Wednesday as a bipartisan effort between House Democrats and Republicans on the House Oversight Committee. They stemmed from a dump of nearly 20,000 emails from files within Epstein’s records.\n\nThe late sex offender repeatedly alleged in emails to associate Ghislaine Maxwell and author Michael Wolff that Trump knew about his conduct — including “about the girls” — according to the emails, which further suggested that the two had a closer relationship than the president has let on. Trump has said the two were friendly but had a falling out after Epstein “stole” women who worked at his Mar-a-Lago estate in Florida, and he has not been accused of any criminal wrongdoing. Epstein died by suicide in federal prison in 2019.\n\nThe emails released Wednesday also place a new spotlight on a months-long news cycle the Trump administration has repeatedly tried to move past, one that has rankled the president since July. Democrats have demanded the administration release the “Epstein files,” government documents they say will expose more of Epstein’s transgressions and high-profile people to whom he trafficked girls, all while Trump has launched a $10 billion lawsuit against Rupert Murdoch and the Wall Street Journal for reporting on his ties to the late sex offender.\n\n“The Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump. The ‘unnamed victim’ referenced in these emails is the late Virginia Giuffre, who repeatedly said President Trump was not involved in any wrongdoing whatsoever and ‘couldn’t have been friendlier’ to her in their limited interactions,” White House Press Secretary Karoline Leavitt said in a Wednesday statement to TheWrap.","summary":"The latest Epstein Files release, a bipartisan effort of Democrats and Republicans, shows the late financier named the president in relation to his sex crimes\n\n\nThe post Trump Blasts Epstein Email Dump as Democrats&#8217; Effort to Deflect After &#8216;Viciously Closing Our Country&#8217; appeared first on TheWrap.","url":"https://www.thewrap.com/trump-epstein-files-emails-reaction-truth-social/","image":"https://www.thewrap.com/wp-content/uploads/2025/11/donald-trump-seth-meyers.jpg","video":null,"publish_date":"2025-11-13 00:36:16","author":"Benjamin Lindsay","authors":["Benjamin Lindsay"],"language":"en","category":"politics","source_country":"US","sentiment":-0.557},{"id":378412580,"title":"Jeffrey Epstein’s Brother Says Trump Is ‘Full of S–t’ After Email Release: ‘At What Point Is There Going to Be a Reckoning?’ | Video","text":"Jeffrey Epstein’s brother is waiting for Donald Trump’s “reckoning” after the latest release of emails appeared to shed light on the friendship between the president and the late controversial financier.\n\nWhile talking to Nicole Wallace on MSNBC, Senior White House Reporter Vaughn Hillyard recounted the conversation he just had with Mark Epstein about his brother’s relationship to Trump and when people might realize he is “full of s–t.”\n\n“The way that he put it to me was, ‘When are people going to admit to themselves that this guy, President Trump, is so full of s–t? Every time he opens his mouth, he says something that isn’t true,’” Hillyard said of his Wednesday conversation with Epstein’s brother. “He wanted to deny that he had a relationship or a friendship with Donald Trump, as Mark tells me. Back in 1999, he was on the plane when they were having intimate conversations about women on a flight from Palm Beach, Florida, back up here to New York. He said he talked to his brother – somebody he still cares deeply about even after his passing – and he says, ‘At what point is there going to be a reckoning that Donald Trump just makes up stuff?’”\n\nOn Wednesday, the House Oversight Committee released new emails from Epstein to associate Ghislaine Maxwell and author Michael Wolff, which claimed Trump knew about Epstein’s conduct — including “about the girls.” In one email, dated April 2, 2011, Epstein claimed Trump spent “hours” with an unidentified victim at Epstein’s home. The victim’s name was redacted.\n\n“I want you to realize that the dog that hasn’t barked is Trump,” Epstein wrote. “He has never once been mentioned. police chief. etc. im 75% there.”\n\n“I have been thinking about that…” Maxwell responded.\n\nThe White House pointed to the redacted victim name being Virginia Giuffre – someone who reportedly denied Trump of any wrongdoing – and claimed this is nothing more than a smear campaign from Democrats.\n\n“The Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump,” White House Press Secretary Karoline Leavitt said in a Wednesday statement to TheWrap. “The ‘unnamed victim’ referenced in these emails is the late Virginia Giuffre, who repeatedly said President Trump was not involved in any wrongdoing whatsoever and ‘couldn’t have been friendlier’ to her in their limited interactions.”","summary":"\"Every time he opens his mouth, he says something that isn’t true,\" Mark Epstein says of the president\n\n\nThe post Jeffrey Epstein&#8217;s Brother Says Trump Is &#8216;Full of S&#8211;t&#8217; After Email Release: &#8216;At What Point Is There Going to Be a Reckoning?&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/jeffrey-epstein-brother-donald-trump-reckoning/","image":"https://www.thewrap.com/wp-content/uploads/2025/07/Jeffrey-Epstein-Donald-Trump.jpeg","video":null,"publish_date":"2025-11-13 00:35:10","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","source_country":"US","sentiment":-0.385},{"id":378408482,"title":"Tiger Woods comes to the aid of Donald Trump's enviornmental advisor by agreeing to help with a major project","text":"Tiger Woods is helping Ed Russo, Donald Trump’s environmental advisor, with a big restoration project at Langston Golf Course in Washington, D.C. The 49-year-old legend will offer his personal input on redesigning the course while keeping its history intact.Langston has a rich history. It opened in 1939 as D.C.’s first golf course for African American players. In the late 1970s and early 1980s, Lee Elder, the first Black golfer to play at The Masters in 1975, managed the course. Woods has often credited Elder for opening doors for Black golfers which makes his involvement here especially significant.Tiger Woods’ firm, TGR Design, is not officially involved, but Russo is a senior consultant for TGR. That means Woods’ role will be personal, helping shape the course layout while Russo handles the environmental side, including restoring habitats along the Anacostia River.\"I'm responsible for redesigning it and making it better than it ever was, and I’m proud to say that Tiger Woods has agreed to help me do that. I can’t wait to work with Tiger. He’s a great guy,” Russo told Front Office Sports.Syndication: Palm Beach Post - Source: ImagnTiger Woods is still recovering from his seventh back surgery, a lumbar disc replacement he underwent in October. He hasn’t played since missing the cut at The Open in July 2024 and isn’t expected to return until The Masters in April 2026. Still, this project gives fans a glimpse of him making an impact off the course.Tiger Woods continues to stay active with course design work in UtahEven while recovering from surgery, Tiger Woods has stayed involved in golf through his design projects. Back in July, he visited Park City, Utah, to check on the progress of the new mountain course at the Marcella Club, his first TGR Design project in the state.Woods shared a short video on Instagram showing him walking the site with his design team. The clip ended with a \"to be continued\" message, teasing more updates to come. In the caption, he wrote:\"Designing is a mindset — then the magic shows up. And there’s no shortage of it out here at Bluejack Ranch.\" View this post on Instagram Instagram PostAnnounced in early 2023, the course will serve as the main feature of the private Marcella Club and is Woods’s first mountain-style layout. It sits at Jordanelle Ridge and offers wide views of the Uinta Mountains, Heber Valley, and Mount Timpanogos.Tiger Woods was also recently seen in Florida filming a commercial for Bridgestone with Matt Kuchar, Jason Day, and other pros. The appearance marked his first time back on the course since his back surgery in October.","summary":"Tiger Woods is helping Ed Russo, Donald Trump’s environmental advisor, with a big restoration project at Langston Golf Course in Washington, D.C.","url":"https://www.sportskeeda.com/golf/news-tiger-woods-comes-aid-donald-trump-s-enviornmental-advisor-agreeing-help-major-project","image":"https://staticg.sportskeeda.com/editor/2025/11/d1731-17629924986814-1920.jpg","video":null,"publish_date":"2025-11-13 00:34:07","author":"Sonali Verma","authors":["Sonali Verma"],"language":"en","category":"politics","source_country":"in","sentiment":-0.109},{"id":378408880,"title":"Trump eyes more domestic travel to tout economic agenda, affordability","text":"WASHINGTON - US President Donald Trump plans more domestic travel to sell his administration’s efforts to drive down the cost of living, two people with knowledge of the matter said, as a top aide promised big moves to lower the price of coffee, bananas and other goods.\n\nMr Trump has focused intensely on the issue of affordability after \n\nDemocratic wins in New Jersey, New York and Virginia, driven in part by cost-of-living concerns, revealed concerns among voters over ongoing inflation, which economists say has been fuelled in part by high import tariffs imposed by Mr Trump. \n\nMore than half of the line items reported in the monthly Consumer Price Index from the Labour Department were rising at more than a 3 per cent annualised rate as of the latest report for September, according to analysis by Apollo Global Management chief economist Torsten Slok.\n\n“Cleaning up Joe Biden’s inflation and economic disaster has been a top focus for President Trump since Day One, when he signed an array of executive orders to unleash American energy and slash costly regulations,” said White House spokesman Kush Desai, citing ongoing efforts to reduce prices for gasoline, eggs, medicines and other goods.\n\n“The Trump administration will continue to implement and emphasise these and other economic policies that are cutting costs, raising real wages, and securing trillions in investments to make and hire in America,” he said.\n\nIt was not immediately clear where or when Mr Trump planned to travel to discuss his economic agenda.\n\nTreasury Secretary Scott Bessent told Fox News’ “Fox and Friends” programme earlier on Nov 12 that “substantial announcements” were planned in coming days to \n\nHe gave no details, but said the measures would bring down prices “very quickly,” adding that people would start feeling better about the economy in the first half of 2026.\n\nCoffee prices fell sharply on Nov 12 amid signs that the US will cut selected import tariffs, potentially easing supply tightness in the world’s top consuming country.\n\nAfter last week’s election defeats, Mr Trump once again floated the prospect of giving households rebate cheques funded by tariffs, and raised the prospect of a 50-year mortgage to encourage more people to buy homes.\n\nMr Bessent, asked about those ideas, said a US$2,000 (S$2,604) rebate cheque proposed by Mr Trump would benefit those earning less than US$100,000 per year, but no decisions had been made. \n\nHe did not address the 50-year mortgage idea, which has sparked criticism from conservative allies, business leaders and lawmakers.\n\nLowering tariffs\n\nMr Trump, in an interview aired on Fox News’ “The Ingraham Angle” show on Nov 11, said the US would lower some tariffs on coffee imports, repeating comments he first made in late October during his trip to Asia.\n\nCoffee roasters in the US have been plowing through their stockpiles as they await the outcome of ongoing US-Brazil trade negotiations. \n\nBrazilian coffee, which accounts for a third of the beans consumed in the US, has been priced out of that market by the 50 per cent import tariffs that Mr Trump imposed in August.\n\nAsked about Mr Trump’s comments about lowering tariffs on coffee producers Vietnam and Brazil, Mr Bessent said, “It’s tough to do a lot of specific things, but I can tell you... you’re going to see some specific announcements in coming days in terms of things we don’t grow here in the United States, coffee, coffee being one of them, bananas, other fruits, things like that.”\n\nIn September, US consumers paid nearly 19 per cent more than a year earlier for roasted coffee and nearly 22 per cent more for instant coffee, according to that month’s CPI report. \n\nBanana prices were up nearly 7 per cent year over year, compared with essentially no change for fresh fruit more widely.\n\nThe US grows bananas in Hawaii and Florida, but commercial production is limited, and most bananas are imported from countries where labour is cheaper and land costs are lower.\n\nMr Bessent said other measures already taken by the Trump administration, including reducing taxes on overtime and tips, would kick in early 2026, as well as moves to boost domestic manufacturing through foreign investment.\n\n“Real wages are going to increase,” Mr Bessent said. “I would expect in the first quarter, second quarter of next year.... Americans are going to start feeling better.”\n\nMany households will see large tax refunds in 2026 given changes in tax law, allowing deductions for car loans and ending taxes on Social Security benefits for some seniors. \n\nParents of children born after Dec 31, 2024 and before Jan 1, 2029 could also receive a US$1,000 initial deposit if they opened a Trump account, Mr Bessent said. REUTERS","url":"https://www.straitstimes.com/world/united-states/trump-eyes-more-domestic-travel-to-tout-economic-agenda-affordability","image":"https://cassette.sphdigital.com.sg/image/straitstimes/026cb9aef343f9c7f2895260f753f760b7f162a75075dd18c287fd41d32b5227","video":null,"publish_date":"2025-11-13 00:32:00","author":"Mr Trump","authors":["Mr Trump"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.484},{"id":378412770,"title":"U.S. Mint Discontinues Penny Production, Concluding a 232-Year Tradition","text":"In 1984, the legendary band Talking Heads released their iconic live album, “Stop Making Sense.” In a coincidental twist of fate, the U.S. Treasury, following President Donald Trump’s directive, has halted the production of pennies.\n\nAfter a remarkable 232-year history, the final U.S. penny was minted on Wednesday in Philadelphia.\n\nDespite this significant change, it doesn’t mean pennies will vanish from circulation immediately:\n\nPennies have been a part of American currency since 1793, so why halt production now? The primary reason, as Trump highlighted in February, is the cost inefficiency of producing them.\nREAD MORE: DOGE: A Nickel Ain’t Worth a Dime Anymore, but Every Penny Costs the Taxpayers Three Cents\n\nA Penny for Your Thoughts? Trump Orders US Treasury to Suspend Production of the Cent\n\nFor far too long the United States has minted pennies which literally cost us more than 2 cents. This is so wasteful! I have instructed my Secretary of the US Treasury to stop producing new pennies. Let’s rip the waste out of our great nations budget, even if it’s a penny at a…\n— Commentary Donald J. Trump Posts From Truth Social (@TrumpDailyPosts) February 10, 2025\n\nLet’s rip the waste out of our great nations budget, even if it’s a penny at a time.\n\nREAD MORE: DOGE: A Nickel Ain’t Worth a Dime Anymore, but Every Penny Costs the Taxpayers Three Cents\n\nA Penny for Your Thoughts? Trump Orders US Treasury to Suspend Production of the Cent\n\nSome stores are already rounding up transactions to the nearest nickel in anticipation of penny shortages. The copper coins (actually, mostly zinc these days) are almost as old as the republic itself:\n\nPennies were among the first coins introduced by the U.S. Mint, a bureau of the Treasury Department, more than 230 years ago. \nThe cost of making both coins has increased over the past two decades. Some of that is attributed to the rise in raw material prices of copper, nickel and zinc.\nHigher metal prices result in higher production costs. If production costs get too high, the seigniorage – the difference between a coin’s face value and the cost of putting it into circulation – make the coin worth less than what it costs to make it.\n\nBack in the day, however, a mere penny might get you a biscuit, some sweets, or even a candle (which would have been an important item indeed in 1793).\n\nU.S. Treasurer tells me there are more than 300 billion pennies in circulation. He says we use about 9 billion pennies each year. At that rate we would run out of pennies in about 33 years. This video shows the last pennies ever minted . #Penny #USMint225 pic.twitter.com/LUdvgGOp6p\n— Edward Lawrence (@EdwardLawrence) November 12, 2025\n\nThey just plain cost a chunk of change to produce, though:\n\nPennies cost about $56 million per year to make, according to the Treasury Department.\nBut the penny isn’t even the least cost-effective currency out there – nickels cost around a whopping 14 cents to produce.\nDimes, meanwhile, are a steal at 6 cents, and quarters around 15 cents.\n\nAlthough some will doubtless be saddened by the end of an American institution, I confess I will not be. I find pennies to be frankly annoying, and the only time you need them is when you don’t happen to have any. They clutter up the coin holder in your car, they pile up somewhere in a corner of your desk drawer, or – if you do carry them around with you – they create an unsightly and heavy look to your pocket. \n\nTheir one main use over the last many years, for me at least, is to bring the pile into the change machine in the grocery store to exchange them for a dollar or two.\n\nThat being said, I still have affection for them out of nostalgia, and even if production has now stopped, pennies will remain in our lives for the foreseeable future. Perhaps you will still be able to get a penny for your thoughts, but my guess is that after years of Bidenflation, you should charge a nickel or a dime at least.\n\nGood luck, penny, and thanks for the memories.\n\nGoodbye, penny. 👋 The U.S. Mint says it is stopping the production of pennies, a historic move more than two centuries after the one-cent coin entered circulation.\nThe last penny was stamped at the Philadelphia U.S. Mint during an event on Nov. 12. pic.twitter.com/7liF0Mc9D4\n— Yahoo News (@YahooNews) November 12, 2025\n\nEditor’s Note: After more than 40 days of screwing Americans, a few Dems have finally caved. The Schumer Shutdown was never about principle—just inflicting pain for political points.\n\nHelp us report the truth about the Schumer Shutdown. Use promo code POTUS47 to get 74% off your VIP membership.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn 1984, the legendary band Talking Heads released their iconic live album,&#8230;\n\n\nThis Post: U.S. Mint Discontinues Penny Production, Concluding a 232-Year Tradition first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/u-s-mint-discontinues-penny-production-concluding-a-232-year-tradition/","image":"https://internewscast.com/wp-content/uploads/2025/11/Stop-Making-Cents-US-Mint-Puts-an-End-to-a.jpg","video":null,"publish_date":"2025-11-13 00:30:40","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.191},{"id":378410356,"title":"Watch: Donald Trump plays his own janitor in resurfaced 2004 ‘SNL’ sketch","text":"There’s a video that’s gone missing, one that, in hindsight, feels almost prophetic. In 2004, Donald Trump appeared on Saturday Night Live playing a janitor who mocked his own wealth, taste, and famously fragile ego. The clip, titled “Donald Trump’s House of Wings” on an official SNL DVD package, has since vanished. For reasons no one quite explains, it’s absent from the release, scrubbed from reruns, and curiously hard to find online.Now, as Trump returns to the White House for a second term, the irony of that lost sketch cuts deeper than ever.Trump vs. TrumpThe bit begins with a simple gag: Trump, the real one, is sent to fix a solid gold faucet. Dressed as a janitor, he surveys the glittering set and quips, “This place looks like the Liberace Museum.”Inside, a second Trump, an actor playing the mogul, struts around barking, “Hey, I’m the prince of this city. When you’re in my office, you treat me with respect.”The janitor’s reply is cutting: “Who did your decorating? Saddam Hussein?”What unfolds next is a duel of egos — Trump mocking a caricature of himself. The janitor ridicules the fake Trump’s excess, his “gay décor,” his spray-tan bravado, and most of all, his hair. When the fake Trump threatens him, boasting about his lethal reputation, the janitor shoots back, “Looks like you killed a squirrel to me and put it right on top of your head.”The fake Trump fires back, “Your hair looks exactly like mine.”And Trump, with perfect self-awareness, or something like it, deadpans, “Except my hair is supposed to look like this. I’m a janitor.”It’s rare to see Trump this self-effacing. Rarer still to imagine him approving a script where he plays a blue-collar worker mocking “the billionaire.”The Prince and the Pauper—Trump editionThe sketch takes an absurd turn when the fake Trump realizes the janitor looks exactly like him, save for a mustache. Struck by the resemblance, he proposes they trade places, like The Prince and the Pauper or a Flintstones episode.“So the pauper and the prince exchanged identities,” the narrator declares.When they swap clothes, the final test comes: they summon Trump’s assistant, Carl, to see if he can tell who’s who. He can’t.And in classic Trumpian fashion, the fake Trump orders, “Throw the real Trump in the swamp and shoot him.”The sketch ends there, dark, absurd, and a little too on the nose for today’s political reality.Watching it in 2025, the lost sketch reads like satire that outpaced itself. Trump was mocking vanity, opulence, and delusion, all the traits that would come to define his public life. He played both the egomaniac and the man who sees through it. In 2004, that was comedy. In 2025, it’s self-parody turned prophecy.","url":"https://timesofindia.indiatimes.com/etimes/trending/watch-donald-trump-plays-his-own-janitor-in-resurfaced-2004-snl-sketch/articleshow/125283698.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-125283701/125283701.jpg","video":null,"publish_date":"2025-11-13 00:30:00","author":"Trending Desk","authors":["Trending Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.156},{"id":378410458,"title":"Epstein Once Asked Trump’s Now-Ambassador To Turkey To Send Photo Of Child: ‘Make Me Smile’","text":"A disturbing email released as part of the House Oversight Committee’s 20,000-page document dump on Wednesday revealed a chummy relationship between Jeffrey Epstein and Tom Barrack, a private equity investor who currently serves as the U.S. ambassador to Turkey.\n\nRepublicans on the House committee made the Epstein-related files public after Democrats on the committee released a handful of damning emails between the late sex offender and journalist Michael Wolff earlier in the day.\n\nIn the emails, Epstein asserts that President Donald Trump not only knew about the parade of young and underage girls he sexually exploited but had once spent “hours” with one of them.\n\nThe newly released trove of documents contains many emails between Epstein and various contacts, such as the economist Larry Summers. \n\nIn March 2016, Epstein emailed Barrack: “send photos of you and child. — make me smile.”\n\nIt is not clear from the document which child Epstein was referring to. \n\nThe message came after Epstein told Barrack he was receiving “many calls” about his friendship with Trump — to which Epstein said he was not responding — and after Barrack suggested that he and Epstein should “catch up.”\n\nThe State Department did not immediately reply to HuffPost’s request for comment.\n\nBarrack was confirmed as the U.S. ambassador to Turkey in April.\n\nBy 2016, Epstein’s sexual misconduct was already well-known. He served around one year’s worth of jail time in Florida after he was accused of sexually assaulting a 14-year-old girl he’d hired as a “masseuse” and paid in cash. It is not clear how Epstein continued to abuse young women and underage girls for as long as he did, although Wednesday’s document dump helps illustrate the vast network of wealthy or influential acquaintances he could call on. \n\nTrump reacted to the files’ release by raging against the Republicans on the House panel. \n\n“The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects,” Trump wrote on Truth Social. “Only a very bad, or stupid, Republican would fall into that trap.”","url":"https://www.huffpost.com/entry/epstein-once-asked-trumps-ambassador-to-turkey-to-send-child-photo-make-me-smile_n_691507bce4b0c2898bed9f5c?origin=home-zone-b-unit","image":"https://img.huffingtonpost.com/asset/6914db67150000b2a89c2ff5.jpeg?cache=SH3SHlZU4b&ops=1778_1000","video":null,"publish_date":"2025-11-13 00:28:54","author":"Sara Boboltz","authors":["Sara Boboltz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.609},{"id":378410456,"title":"Epstein Once Asked Trump’s Now-Ambassador To Turkey To Send Photo Of Child: ‘Make Me Smile’","text":"A disturbing email released as part of the House Oversight Committee’s 20,000-page document dump on Wednesday revealed a chummy relationship between Jeffrey Epstein and Tom Barrack, a private equity investor who currently serves as the U.S. ambassador to Turkey.\n\nRepublicans on the House committee made the Epstein-related files public after Democrats on the committee released a handful of damning emails between the late sex offender and journalist Michael Wolff earlier in the day.\n\nIn the emails, Epstein asserts that President Donald Trump not only knew about the parade of young and underage girls he sexually exploited but had once spent “hours” with one of them.\n\nThe newly released trove of documents contains many emails between Epstein and various contacts, such as the economist Larry Summers. \n\nIn March 2016, Epstein emailed Barrack: “send photos of you and child. — make me smile.”\n\nIt is not clear from the document which child Epstein was referring to. \n\nThe message came after Epstein told Barrack he was receiving “many calls” about his friendship with Trump — to which Epstein said he was not responding — and after Barrack suggested that he and Epstein should “catch up.”\n\nThe State Department did not immediately reply to HuffPost’s request for comment.\n\nBarrack was confirmed as the U.S. ambassador to Turkey in April.\n\nBy 2016, Epstein’s sexual misconduct was already well-known. He served around one year’s worth of jail time in Florida after he was accused of sexually assaulting a 14-year-old girl he’d hired as a “masseuse” and paid in cash. It is not clear how Epstein continued to abuse young women and underage girls for as long as he did, although Wednesday’s document dump helps illustrate the vast network of wealthy or influential acquaintances he could call on. \n\nTrump reacted to the files’ release by raging against the Republicans on the House panel. \n\n“The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects,” Trump wrote on Truth Social. “Only a very bad, or stupid, Republican would fall into that trap.”","url":"https://www.huffpost.com/entry/epstein-once-asked-trumps-ambassador-to-turkey-to-send-child-photo-make-me-smile_n_691507bce4b0c2898bed9f5c?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6914db67150000b2a89c2ff5.jpeg?cache=SH3SHlZU4b&ops=1778_1000","video":null,"publish_date":"2025-11-13 00:28:54","author":"Sara Boboltz","authors":["Sara Boboltz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.609},{"id":378415052,"title":"New Epstein emails say Trump &apos;knew about the girls&apos;","text":"US House Democrats have released emails they say raise new questions about President Donald Trump&apos;s ties to Jeffrey Epstein and how much he knew about his abuse of underage girls, while the swearing-in of a new Democrat kicked off a new fight in Congress over further disclosures. The Democrats on Wednesday released messages between Epstein and author Michael Wolff and Ghislaine Maxwell, a British socialite who is serving a 20-year prison sentence on charges related to her role in facilitating Epstein&apos;s sex trafficking. In one 2019 email to Wolff, the sex offender wrote that Trump \"knew about the girls,\" though it was not clear what that phrase meant. Trump has vehemently and consistently denied knowing about Epstein&apos;s sex trafficking. He has said that he and Epstein, who took his own life in a Manhattan jail cell in 2019, were once friends before having a falling out. The disclosure came on the day Democratic Representative Adelita Grijalva was sworn in by House Speaker Mike Johnson, seven weeks after she won a special election in Arizona. Her long-delayed induction should pave the way to compel a House vote to release all unclassified records related to Epstein, something Johnson and Trump have resisted up to now. \"It&apos;s past time for Congress to restore its role as a check and balance on this administration,\" Grijalva said, adding she would sign a petition to release the files. The measure&apos;s sponsor, Republican Representative Thomas Massie, told reporters that would give him the majority needed to force a vote. The batch of emails released earlier on Wednesday includes a 2011 message to Maxwell in which Epstein described Trump as \"that dog that hasn&apos;t barked,\" adding that Trump had \"spent hours at my house\" with one of his victims, whose name is redacted. Later in the day, Republicans released a cache of 20,000 Epstein-related documents in which Trump&apos;s name surfaces frequently, though typically in the context of his political career or allegations of sexual behaviour. In one exchange, Epstein refers to a 20-year-old girlfriend that he \"gave to Donald\" in 1993, and talks about photos of \"donald and girls in bikinis in my kitchen,\" though it is not clear whether he is joking. Trump on Wednesday accused Democrats of releasing the emails to distract from the record 43-day shutdown of the government, even though neither side appears to have won a clear victory, with a Reuters/Ipsos poll released on Wednesday showing 50 per cent of Americans blaming Republicans and 47 per cent blaming Democrats. \"The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they&apos;ll do anything at all to deflect on how badly they&apos;ve done on the Shutdown, and so many other subjects,\" Trump wrote on his Truth Social platform on Wednesday afternoon. At an earlier briefing, White House press secretary Karoline Leavitt accused Democrats of redacting the victim&apos;s name in the released emails because the victim was Virginia Giuffre, who took hr own life in April and had called Trump friendly without accusing him of any wrongdoing in her posthumous memoir. \"These emails prove absolutely nothing other than the fact that President Trump did nothing wrong,\" Leavitt said. The Epstein case has dogged Trump for months, upsetting even his own political supporters, who believe the government has been covering up Epstein&apos;s ties to the rich and powerful, and have been unusually critical of his Justice Department for not releasing more information about the Epstein case. Only four in 10 Republicans told an October Reuters/Ipsos poll that they approved of Trump&apos;s handling of the Epstein files -- well below the nine in 10 who approve of his overall performance in the White House. Trump and other administration officials have reached out to Republican lawmakers Lauren Boebert and Nancy Mace to try to get them to remove their names from the petition that would force a vote on releasing all of the files, according to reporting by Axios and other media outlets. In a post on X, Boebert confirmed that she met with White House officials on Wednesday and said, \"Together, we remain committed to ensuring transparency for the American people.\" Mace&apos;s office did not respond to a request for comment. Australian Associated Press","url":"https://www.canberratimes.com.au/story/9110704/new-epstein-emails-say-trump-knew-about-the-girls/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/f2b889d4-2d82-47ba-b0c2-657f32fc0b6a.jpg/r0_0_798_600_w798_h600_fmax.jpg","video":null,"publish_date":"2025-11-13 00:28:19","author":"Nathan Layne And Doina Chiacu","authors":["Nathan Layne And Doina Chiacu"],"language":"en","category":"politics","source_country":"au","sentiment":-0.338},{"id":378410308,"title":"How Trump-era funding cuts endanger efforts to empower Haiti’s farmers  - Puerto Rico Tribune – Daily Puerto","text":"Oanaminthe, Haiti – It’s a Monday afternoon at the Foi et Joie school in rural northeast Haiti, and the grounds are a swirl of khaki and blue uniforms, as hundreds of children run around after lunch.\n\nIn front of the headmaster’s office, a tall man in a baseball cap stands in the shade of a mango tree.\n\nAntoine Nelson, 43, is the father of five children in the school. He's also one of the small-scale farmers growing the beans, plantains, okra, papaya and other produce served for lunch here, and he has arrived to help deliver food.\n\n\"I sell what the school serves,\" Nelson explained. \"It’s an advantage for me as a parent.”\n\nNelson is among the more than 32,000 farmers across Haiti whose produce goes to the World Food Programme, a United Nations agency, for distribution to local schools.\n\nTogether, the farmers feed an estimated 600,000 students each day.\n\nTheir work is part of a shift in how the World Food Programme operates in Haiti, the most impoverished country in the Western Hemisphere.\n\nRather than solely importing food to crisis-ravaged regions, the UN organisation has also worked to increase its collaborations with local farmers around the world.\n\nBut in Haiti, this change has been particularly swift. Over the last decade, the World Food Programme went from sourcing no school meals from within Haiti to procuring approximately 72 percent locally. It aims to reach 100 percent by 2030.\n\nThe organisation's local procurement of emergency food aid also increased significantly during the same period.\n\nThis year, however, has brought new hurdles. In the first months of President Donald Trump’s second term, the United States has slashed funding for the World Food Programme.\n\nThe agency announced in October it faces a financial shortfall of $44m in Haiti alone over the next six months.\n\nAnd the need for assistance continues to grow. Gang violence has shuttered public services, choked off roadways, and displaced more than a million people.\n\nA record 5.7 million Haitians are facing \"acute levels of hunger\" as of October — more than the World Food Programme is able to reach.\n\n\"Needs continue to outpace resources,\" Wanja Kaaria, the programme's director in Haiti, said in a recent statement. \"We simply don’t have the resources to meet all the growing needs.\"\n\nBut for Nelson, outreach efforts like the school lunch programme have been a lifeline.\n\nBefore his involvement, he remembers days when he could not afford to feed his children breakfast or give them lunch money for school.\n\n“They wouldn’t take in what the teacher was saying because they were hungry,” he said. “But now, when the school gives food, they retain whatever the teacher says. It helps the children advance in school.\"\n\nNow, experts warn some food assistance programmes could disappear if funding continues to dwindle — potentially turning back the clock on efforts to empower Haitian farmers.","url":"https://puertoricotribune.com/how-trump-era-funding-cuts-endanger-efforts-to-empower-haitis-farmers/","image":"https://puertoricotribune.com/app/uploads/2025/11/IMG_20250320_152636307-1762915451-O3qBzg.jpg","video":null,"publish_date":"2025-11-13 00:26:47","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"pr","sentiment":0.097},{"id":378408874,"title":"Russia's Lavrov: We hope Washington will take no steps to escalate Ukraine conflict","text":"Russian Foreign Minister Sergei Lavrov said in an interview published late on Wednesday that he hoped Washington would take no actions liable to escalate the Ukraine conflict.\n\nLavrov said U.S. President Donald Trump had long advocated dialogue with Russia, had sought to fully understand the Russian position on Ukraine and \"demonstrated a commitment to finding a sustainable peaceful solution\".\n\n\"We are counting on common sense and that the maintaining of that position will prevail in Washington and that they will refrain from actions that could escalate the conflict to a new level,\" Lavrov was quoted as saying by Russian state news agency TASS.\n\nLavrov's comments were originally part of an interview with Italian daily Corriere della Sera. Tass said the Italian daily had declined to publish the interview.\n\nLavrov said Trump had acknowledged that one of the reasons behind Russia's actions was enlargement of the NATO alliance and the deployment of its infrastructure close to its border.\n\n\"In essence, that is what Russian President Vladimir Putin and Russia have been warning about for the last 20 years,\" Lavrov was quoted as saying.\n\nTrump and Putin held talks in Alaska in August and Lavrov spoke by phone to U.S. Secretary of State Marco Rubio on October 20 to discuss a possible ​new summit, days after it was announced by Trump following a phone call with Putin.\n\nTrump subsequently said he had cancelled a prospective summit. The U.S. president has backed calls for an immediate ceasefire in Ukraine with forces at their present positions, while Moscow has said it wants Kyiv to yield more territory.\n\nIn his comments published by TASS, Lavrov said Europe was intent on undermining U.S. moves to find a peaceful solution.\n\nEurope, he said, was \"sabotaging all peacemaking efforts and are rejecting direct contacts with Moscow. They introduce new sanctions which boomerang on their economies even further. They're openly preparing for a new major European war against Russia.\"\n\nRussia would be ready to resume contacts with Europe \"when this Russiaphobic frenzy passes. There is no other way to describe it.\"\n\nEuropean leaders have accused Russia of waging \"hybrid warfare\" against European democracies and vowed to respond.\n\nEuropean Union countries backing Ukraine last month agreed a 19th sanctions package against Russia and have been discussing ways to raise financial support for Kyiv - borrowing the money, or using frozen Russian assets. REUTERS","url":"https://www.straitstimes.com/world/europe/russias-lavrov-we-hope-washington-will-take-no-steps-to-escalate-ukraine-conflict","image":"https://cassette.sphdigital.com.sg/image/straitstimes/2259c9cffa64c978e661d614a0cab7c4cb7e32d5fc5633c5407f4d9a0cf5c9de","video":null,"publish_date":"2025-11-13 00:26:34","author":"Sph Media Limited","authors":["Sph Media Limited"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.094},{"id":378412204,"title":"White House says new Epstein emails mentioning Trump 'prove nothing'","text":"White House has rejected US President Donald Trump’s connection with Jeffrey Epstein after House Democrats released emails by the sex offender, which mention the Republican leader as being in close contact with him.\n“These emails prove absolutely nothing, other than the fact that President Trump did nothing wrong,” White House press secretary Karoline Leavitt said, despite the presence of an email where Epstein said Trump “spent hours at my house” with one of his victims.\nSTORY CONTINUES BELOW THIS AD Leavitt further said that Trump “kicked out” Epstein from his Florida club for being a “pedophile” as well as a “creep.” She said, “What President Trump has always said is that he was from Palm Beach, and so was Jeffrey Epstein. Jeffrey Epstein was a member at Mar-a-Lago until President Trump kicked him out because Jeffrey Epstein was a pedophile and he was a creep.”\nMore from World Donald Trump's awkward reaction after being booed at NFL game goes viral – WATCH Trump-Democrat deal to end shutdown? Senate likely to vote on advancing a bill What do the emails say? In an April 2011 message to longtime associate Ghislaine Maxwell, Epstein asserts Trump spent significant time with a woman whom the White House later identified as Epstein’s main accuser, Virgina Giuffre.\n“I want you to realize that that dog that hasn’t barked is Trump,” wrote Epstein. He added that the victim “spent hours at my house with him ,, he has never once been mentioned.”\nMaxwell, who was convicted of sex trafficking after Epstein’s death, replied: “I have been thinking about that…”\nIn another email to the author Michael Wolff, dated January 31, 2019, Epstein allegedly wrote: “of course he knew about the girls as he asked Ghislaine to stop.”\n‘They’re deflecting’ Meanwhile, Trump came down heavily on Democrats, asserting that they released the Epstein emails at a time when the US House is set to vote on a shutdown bill and are trying to “deflect” from the issue.\nHe said on Truth Social, “The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects. Only a very bad, or stupid, Republican would fall into that trap. The Democrats cost our Country $1.5 Trillion Dollars with their recent antics of viciously closing our Country, while at the same time putting many at risk — and they should pay a fair price.”\nQuick Reads View All Sun erupts with strongest solar flares since Oct 2024, blacks out radio signals in Africa, Europe US govt shutdown to end today? House panel clears first hurdle, advances funding measure With inputs from agencies","url":"https://www.firstpost.com/world/white-house-says-new-epstein-emails-mentioning-trump-prove-nothing-13950171.html","image":"https://images.firstpost.com/uploads/2025/09/trump4-2025-09-adde92b734313922cc0f5daf9d0c6253.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2025-11-13 00:25:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.614},{"id":378413130,"title":"JFK’s Grandson Jack Schlossberg Steps Up Because Of ‘Crisis At Every Level’","text":"Jack Schlossberg, the only grandson of President John F. Kennedy, announced on Tuesday that he’s running for Congress in New York. His decision marks the first time in nearly a decade that a member of the Kennedy family has sought public office.\n\nIn a campaign video shared on social media, Schlossberg looked relaxed while talking about starting this new chapter in his life. He said he’s running to “carry the torch forward” and continue his family’s legacy of public service.\n\nView this post on Instagram\n\n“My grandfather inspired a generation to serve,” he said. “Now it’s my turn to stand up for what’s right, for New York, and for our future.” Reuters confirmed his candidacy shortly after the video went live.\n\nAccording to The Guardian, Schlossberg, 32, filed papers to run in New York’s 10th Congressional District, which includes parts of Manhattan and Brooklyn. The seat is currently held by Democratic Representative Dan Goldman.\n\nSchlossberg, who earned his law degree from Harvard in 2022, has occasionally appeared at political and family events but has largely stayed out of the public eye until now. Although he has on occasion called out Trump and even blasted him about destroying Jackie Kennedy’s Rose Garden.\n\nIn his launch video, he framed his campaign around economic fairness, climate change, and restoring faith in American leadership.\n\nView this post on Instagram\n\nThe Kennedy family, one of the most famous in American politics, has not held elected office since his mother, former U.S. Ambassador Caroline Kennedy, left her diplomatic post in 2021. She has three children: two daughters and Schlossberg who is her only son.\n\nWhile he avoided direct criticism of former President Donald Trump, Schlossberg appeared to draw a contrast with Trump-era politics. He also felt an urgency about the state of politics in the country. “It’s a crisis at every level”, Schlossberg said in the video.\n\nHe continued “It’s a constitutional crisis with one dangerous man in control of all three branches of government.” Adding, “He’s stripping citizens of their civil rights and silencing his critics.”\n\nEarly reactions were mixed. Some Democrats on social media welcomed what they called a “fresh Kennedy voice” in Congress, while others questioned whether Schlossberg’s famous name alone would be enough to win votes in one of New York’s most competitive districts.\n\nPolitical analyst Jessica Taylor told AP News that Schlossberg “represents a continuation of a storied American family brand, but also faces the challenge of proving himself in a new era.”\n\nThe Kennedy legacy still looms large in American politics. President John F. Kennedy, assassinated in 1963, remains one of the most iconic figures of the 20th century. He is especially remembered for his speeches on hope and civic duty.\n\nView this post on Instagram\n\nSchlossberg’s father, Edwin Schlossberg, is a writer and designer, while his mother, Caroline Kennedy, served as U.S. ambassador to Japan and later Australia.\n\nThe campaign is expected to draw significant national attention as it unfolds. Schlossberg has not yet announced when he will officially kick off his first rally but said more details would come “in the days ahead.”\n\n“I know what the Kennedy name means to people,” he said in closing. “It’s not about nostalgia. It’s about responsibility, and I’m ready to earn it.”\n\nIn the words of JFK himself, “Ask not what your country can do for you—ask what you can do for your country”","summary":"Jack Schlossberg wants to \"stand up for what's right.\"","url":"https://www.inquisitr.com/jfks-grandson-jack-schlossberg-steps-up-because-of-crisis-at-every-level","image":"https://www.inquisitr.com/wp-content/uploads/2025/11/Jack-Schlossberg.jpg","video":null,"publish_date":"2025-11-13 00:23:55","author":"Tracey Ashlee","authors":["Tracey Ashlee"],"language":"en","source_country":"us","sentiment":0.417},{"id":378407036,"title":"What we know about new Epstein emails that mention Trump","text":"US lawmakers have released more than 20,000 pages of documents from the estate of the disgraced financier and convicted sex offender Jeffrey Epstein, including some that mention President Donald Trump.\n\nEarly on Wednesday, Democrats on the House Oversight Committee published three email exchanges, including correspondence between Epstein, who died in 2019 in prison, and his long-time associate Ghislaine Maxwell, who is currently serving a 20-year prison sentence for sex trafficking.\n\nThey also released emails between Epstein and the author Michael Wolff, who has written numerous books about Trump.\n\nWithin hours, House Republicans then released a massive tranche of documents to counter what they said was a Democratic effort to “cherry-pick” documents. They also said it was an attempt to “create a fake narrative to slander President Trump”.\n\nTrump was a friend of Epstein’s for years, but the president has said they fell out in the early 2000s, two years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein.\n\nThe BBC is still reading through the cache of documents and will provide updates as we get them. Here is what we know so far and how the White House has responded.\n\n‘Dog that hasn’t barked is Trump’\n\nThe first email released by Democrats is from 2011 and is between Epstein and Maxwell.\n\nIn it, Epstein writes to Maxwell: “I want you to realize that that dog that hasn’t barked is Trump.. [VICTIM] spent hours at my house with him”.\n\nEpstein goes on to write that Trump “has never once been mentioned”, including by a “police chief”.\n\nMaxwell responded: “I have been thinking about that…”\n\nThe victim’s name was redacted in the email the Democrats released, although the unredacted version is in the tranche released by the committee. That shows the name “virignia”.\n\nThe White House said it refers to the late Virginia Giuffre, a prominent Epstein accuser who died by suicide earlier this year. In a statement, the White House said Giuffre “repeatedly said President Trump was not involved in any wrongdoing whatsoever and ‘couldn’t have been friendlier’ to her in their limited interactions”.\n\nAsked why the name was originally redacted, Representative Robert Garcia – the leading Democrat on the US House Oversight Committee – said the party will never release names of victims in line with the wishes of the families.\n\nEpstein seeks guidance from Wolff\n\nIn exchanges with Wolff, Epstein discusses his connection to Trump, who was campaigning for the presidency ahead of his first term in office.\n\nIn a second email exchange released by Democrats, Wolff writes to Epstein in 2015 to notify him that CNN is planning to ask Trump about their relationship, “either on air or in scrum afterwards”.\n\nEpstein responds: “If we were able to craft an answer for him, what do you think it should be?”\n\nWolff writes: “I think you should let him hang himself. If he says he hasn’t been on the plane or to the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt.”\n\nHe adds, “of course, it is possible that, when asked, he’ll say Jeffrey is a great guy and has gotten a raw deal and is a victim of political correctness, which is to be outlawed in a Trump regime.”\n\nIn a separate email from October 2016, days before the US presidential election, Wolff offers Epstein a chance to sit for an interview that could “finish” Trump.\n\n“There’s an opportunity to come forward this week and talk about Trump in such a way that could garner you great sympathy and help finish him. Interested?”, Wolff writes to Epstein.\n\nA third email released by Democrats is dated January 2019, during Trump’s first term in office.\n\nIn it, Epstein tells Wolff: “Trump said he asked me to resign” apparently referring to his membership at the president’s Mar-a-Lago club, adding, he was “never a member ever”.\n\nEpstein adds that “of course he knew about the girls as he asked Ghislaine to stop”.\n\nResponding to the release in a video he posted to Instagram, Wolff said: in a video posted on his Instagram: “Some of those emails are between Epstein and me, with Epstein discussing his relationship with Donald Trump.”\n\n“I have been trying to talk about this story for a very long time now,” he added.\n\nEmails an effort to ‘smear’ Trump, White House says\n\nWhite House Press Secretary Karoline Leavitt said the emails were “selectively leaked” by House Democrats to “liberal media to create a fake narrative to smear President Trump”.\n\n“The fact remains that President Trump kicked Jeffrey Epstein out of his club decades ago for being a creep to his female employees, including Giuffre,” she said.\n\n“These stories are nothing more than bad-faith efforts to distract from President Trump’s historic accomplishments, and any American with common sense sees right through this hoax and clear distraction from the government opening back up again.”\n\nWhen asked at the press briefing about the wider release of documents by the House Oversight Committee, Leavitt said they proved “absolutely nothing other than the fact that President Trump did nothing wrong”.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"Jeffrey Epstein and Donald Trump (pictured here in 1997) were friends for years, though the US president says he had a falling out with him in the early 2000s US lawmakers have released more than 20,000 pages of documents from the estate of the disgraced financier and convicted sex offender Jeffrey Epstein, including some that [&#8230;]\n\n\nThe post What we know about new Epstein emails that mention Trump appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/11/13/what-we-know-about-new-epstein-emails-that-mention-trump/","image":"https://ichef.bbci.co.uk/news/480/cpsprodpb/cf24/live/bae649c0-c001-11f0-8456-eff94716b162.jpg.webp","video":null,"publish_date":"2025-11-13 00:22:31","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.301},{"id":378413136,"title":"Transgender members of the Air Force sue over losing retirement pay","text":"By KONSTANTIN TOROPIN\n\nWASHINGTON (AP) — A group of 17 transgender members of the Air Force are suing the U.S. government over what they say is the military’s unlawful revocation of their early retirement pensions and benefits.\n\nThe lawsuit, filed in federal court Monday, comes several months after the Air Force confirmed that it would deny all transgender service members who have served between 15 and 18 years the option to retire early and would instead separate them without retirement benefits.\n\nIt is just the latest in a series of legal challenges to the Trump administration’s policies that have sought to push transgender troops out of the military since the early days of his second term. The U.S. Supreme Court in May, however, allowed the ban on trans troops to be enforced while legal challenges proceed.\n\nAccording to GLAD Law, one of the advocacy groups that helped bring the lawsuit, service members affected by the policy will now face a loss of up to $2 million owed for their service over the course of their lifetimes in addition to the loss of health insurance benefits.\n\nMichael Haley, a staff attorney with the group, said the revocation of the early retirement benefits was part of “the general cruelty in attacking transgender people.” He noted that many of the plaintiffs had received orders allowing their retirements and that some had even begun the process of getting out of the military.\n\nLogan Ireland, a master sergeant in the Air Force with 15 years of service that includes a deployment to Afghanistan, joined the lawsuit after having his early retirement denied. He told The Associated Press that “the military taught me to lead and fight, not retreat.”\n\n“Stripping away my retirement sends the message that those values only apply on the battlefield, not when a service member needs them most,” he added.\n\n“These are folks who are going to move on with their lives, have received the OK to do so, and then have that taken away from them once again,” Haley said.\n\nThe Pentagon did not immediately respond to comment but has a longstanding policy of not commenting on ongoing litigation.\n\nPresident Donald Trump and Defense Secretary Pete Hegseth have targeted diversity, equity and inclusion efforts in what they say is an effort to make the military more lethal. Pentagon officials say 4,240 troops have been diagnosed with gender dysphoria, which the military is using as an identifier of being transgender.\n\nThe Air Force has been unique in implementing policies that have gone beyond just separating troops from military service.\n\nIn addition to revoking retirement benefits, the service moved in August to deny transgender members of the Air Force the chance to argue before a board of their peers for the right to continue serving.\n\nThe Pentagon rolled out a similar, military-wide version of that policy less than two weeks ago.","summary":"Affected service members face a loss of up to $2 million and health insurance benefits.","url":"https://www.ocregister.com/2025/11/12/trump-transgender-military-ban-retirement-pay/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/Hegseth_Defense_Summit_58653.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-13 00:21:46","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"US","sentiment":-0.348},{"id":378412014,"title":"Transgender members of the Air Force sue over losing retirement pay","text":"By KONSTANTIN TOROPIN\n\nWASHINGTON (AP) — A group of 17 transgender members of the Air Force are suing the U.S. government over what they say is the military’s unlawful revocation of their early retirement pensions and benefits.\n\nThe lawsuit, filed in federal court Monday, comes several months after the Air Force confirmed that it would deny all transgender service members who have served between 15 and 18 years the option to retire early and would instead separate them without retirement benefits.\n\nIt is just the latest in a series of legal challenges to the Trump administration’s policies that have sought to push transgender troops out of the military since the early days of his second term. The U.S. Supreme Court in May, however, allowed the ban on trans troops to be enforced while legal challenges proceed.\n\nAccording to GLAD Law, one of the advocacy groups that helped bring the lawsuit, service members affected by the policy will now face a loss of up to $2 million owed for their service over the course of their lifetimes in addition to the loss of health insurance benefits.\n\nMichael Haley, a staff attorney with the group, said the revocation of the early retirement benefits was part of “the general cruelty in attacking transgender people.” He noted that many of the plaintiffs had received orders allowing their retirements and that some had even begun the process of getting out of the military.\n\nLogan Ireland, a master sergeant in the Air Force with 15 years of service that includes a deployment to Afghanistan, joined the lawsuit after having his early retirement denied. He told The Associated Press that “the military taught me to lead and fight, not retreat.”\n\n“Stripping away my retirement sends the message that those values only apply on the battlefield, not when a service member needs them most,” he added.\n\n“These are folks who are going to move on with their lives, have received the OK to do so, and then have that taken away from them once again,” Haley said.\n\nThe Pentagon did not immediately respond to comment but has a longstanding policy of not commenting on ongoing litigation.\n\nPresident Donald Trump and Defense Secretary Pete Hegseth have targeted diversity, equity and inclusion efforts in what they say is an effort to make the military more lethal. Pentagon officials say 4,240 troops have been diagnosed with gender dysphoria, which the military is using as an identifier of being transgender.\n\nThe Air Force has been unique in implementing policies that have gone beyond just separating troops from military service.\n\nIn addition to revoking retirement benefits, the service moved in August to deny transgender members of the Air Force the chance to argue before a board of their peers for the right to continue serving.\n\nThe Pentagon rolled out a similar, military-wide version of that policy less than two weeks ago.","url":"https://www.sun-sentinel.com/2025/11/12/trump-transgender-military-ban-retirement-pay/","image":"https://www.sun-sentinel.com/wp-content/uploads/2025/11/Hegseth_Defense_Summit_58653.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-13 00:21:46","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.348},{"id":378410434,"title":"Xi’s military purges rattle the nuclear order","text":"p class=\"bodytext\">China’s nuclear forces are expanding quickly. Yet behind that rise, the top leader Xi Jinping’s sweeping purge of generals and military leaders has exposed deep-seated corruption and raised questions about the country’s ability to manage its growing arsenal. The uncertainty adds to concerns about a new era of volatility in global nuclear politics, as President Donald Trump has called for renewed US testing and as Washington is also pushing through major changes in its military..Trump’s defence secretary, Pete Hegseth, has fired or sidelined at least two dozen generals and admirals over the past nine months, actions that are without precedent in recent decades, and have come with little explanation. The shake-up has raised fears of growing political interference in a military that has long prided itself on being apolitical..In Beijing, Xi’s purges in the People’s Liberation Army cut far deeper. He has carried out a cleanup that has shaken the Rocket Force, the branch that oversees China’s nuclear forces and is a crucial part of Xi’s ambition to build a “world-class military” by 2049. Top commanders have disappeared. Others have been jailed. And defence contractors have been stripped of their party titles and detained for investigation..While Trump and Hegseth’s motivations in reshaping the US military are not entirely clear, Xi’s purges stem from a lesson he has drawn from history: that the Communist Party survives only when the army obeys one leader without question..Early in his rule, Xi warned that the Soviet Union collapsed because the party lost control of its military and no “real man” had stepped forward, noted Joseph Torigian, an associate professor at American University who has studied Chinese leaders’ relations with the military..His military purges likely reflect his obsession with preparing for worst-case scenarios at home and abroad, whether it is protests over economic problems or political suppression, or needing to fight the United States in a war over Taiwan, the democratically governed island Beijing claims as its territory..“So what’s the biggest threat to building a military that can defeat competitors within the elite, people in the streets, and the Americans in a war?” Torigian wrote in an email. “Corruption is the ‘key link.’”.Xi thinks materialism and corruption are a direct threat to the military’s ability to defeat enemies, Torigian said. “In Xi’s mind, it makes members of the military vulnerable to Western infiltration, whether literally in terms of becoming an agent, or because Western values lead to a desire to ‘nationalise’ the military and split it from party control.”.In a commentary Tuesday, the official newspaper of the People’s Liberation Army wrote: “For our military, the fight against corruption is a major political struggle that it cannot afford to lose, and must not lose. It concerns the long-term stability of the party and the country, and it concerns ensuring the socialist red state never changes colour.”.That also highlights a major difference between the functions of the militaries in both countries: In China, the military is built to defend the ruling party, primarily; in the United States, it is meant to defend the entire nation and to stand apart from politics..The ousters in China reveal serious dysfunction in the military and muddy confidence in its war readiness. It also suggests that the People’s Liberation Army, or PLA, may be one of the few organizations that Xi, arguably China’s most powerful leader since Mao Zedong, has failed to bring under his control..“Corruption has been a very real problem for the PLA, and it is, in fact, corrosive for the military, which is why Xi is serious about uprooting it,” said Jonathan Czin, a researcher at the Brookings Institution who previously worked at the CIA analysing Chinese politics..When Xi came to power in 2012, the Chinese military was plagued with an image problem as a hotbed of corruption. Senior commanders funded lavish lifestyles through bribery and embezzlement. Promotions were commonly up for sale. And military license plates were sold to civilians as they gave their owners near impunity on China’s roads..Xi vowed to professionalise the PLA and ensure that it answered to him as head of the party; he quickly removed rival factions led by commanders that were loyal to past leaders. A decade later, the house cleaning has only intensified, even ensnaring senior leaders who were handpicked by Xi. That includes Gen He Weidong, who was third in China’s military hierarchy when he was expelled from the party on October 17, accused of corruption and abuse of power..Other expelled generals included Adm Miao Hua, who oversaw political discipline in the military and was placed under investigation last year. Another was Gen Lin Xiangyang, who was in charge of the Eastern Theater Command, which is central to any war over Taiwan..Perhaps most troubling for Xi are the signs of corruption in the Rocket Force, which controls nearly all of China’s nuclear missiles and had been considered one of the crown jewels of the Chinese military. Since 2023, the branch has been rocked by a series of purges of senior commanders over corruption that have raised questions about its effectiveness. A Pentagon report last year said fraud in the Rocket Force led to problems involving the construction of underground missile silos..Analysts say the branch is ripe for corruption because it maintains one of the largest budgets in the Chinese military. Unlike warplanes and tanks, missiles are also rarely tested, increasing the difficulty in detecting malfeasance..Some analysts say corruption in the Rocket Force may also be fuelled by scepticism that China will ever go to war. Were there a greater sense of urgency, they argue, there would probably be less chance that defence contractors would cut corners and military leaders would line their pockets..At the same time, China’s military modernization has been advancing apace. A military parade in Beijing this year showed off some of the country’s latest drones, unmanned submarines and hypersonic missiles. Also displayed were the latest ICBMs, a reminder of China’s nuclear weapons buildup that could see the country nearly double its arsenal by 2030..Even though both the US and Chinese militaries are undergoing high-level leadership changes, they each still have deep benches of senior officers to draw from, said Czin of Brookings..The question, though, is whether their leaders’ preoccupations are eroding focus on core missions: China’s drive to take Taiwan, and America’s effort to deter it..Xi regards the United States as the chief obstacle in realizing his goal of unifying Taiwan with China. US intelligence officials have said that Xi has ordered that the Chinese military be capable of seizing the self-governed island by 2027, which will be the 100th anniversary of the founding of the PLA..The Rocket Force plays prominently in those plans. China has developed anti-ship missiles, known as “carrier killers,” aimed at blocking US aircraft carrier groups from the battle zone in a conflict over Taiwan. It has also built hypersonic missiles designed to strike US bases across the Pacific, including in Guam, the Philippines, South Korea and Japan..A bipartisan, congressionally appointed commission warned last year that China was surpassing the United States in military advantage in the Western Pacific because of two decades of focused investment. “Without significant change by the United States, the balance of power will continue to shift in China’s favour,” the Commission on the National Defence Strategy said..For China, however, countering the US military is the “first, second and third priority,” Czin said.</p","url":"https://www.deccanherald.com/opinion/xi-s-military-purges-rattle-the-nuclear-order-3796069","image":"https://media.assettype.com/deccanherald/2025-11-13/jtjwtijn/file838ecvizvomlsmn4efm.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-11-13 00:20:53","author":"International New York Times","authors":["International New York Times"],"language":"en","category":"politics","source_country":"in","sentiment":0.065},{"id":378410706,"title":"Epstein files vote happening next week, Johnson says - Live Updates - POLITICO","text":"Speaker Mike Johnson said Wednesday he plans to hold a House vote next week on a measure mandating the full disclosure of Justice Department files related to the late sex trafficker Jeffrey Epstein. Johnson announced those plans just hours after newly sworn Rep. Adelita Grijalva (D-Ariz.) completed a discharge petition mandating a floor vote on the Epstein measure. His is a quicker timeline than is mandated under the rules governing discharge petitions, which would require a vote in early December. House Republicans are eager to put the Epstein controversy in the rear-view mirror to the greatest extent possible as they seek to catch up after losing weeks of work due to Johnson’s decision to keep the chamber out of session during the government shutdown. They are expecting a mass defection of Republican lawmakers on the vote — perhaps 100 or more — despite President Donald Trump calling the Epstein allegations a Democratic hoax.","url":"https://www.politico.com/live-updates/2025/11/12/congress/epstein-files-house-vote-next-week-00649999","image":"https://www.politico.com/dims4/default/9f25caa/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd8%2F01%2Fd0fe13874b388cf736de98b7f3dd%2Fu-s-congress-80033.jpg","video":null,"publish_date":"2025-11-13 00:20:25","author":"Meredith Lee Hill","authors":["Meredith Lee Hill"],"language":"en","source_country":"us","sentiment":-0.838},{"id":378409856,"title":"World News | China Agrees to Control Chemical Subsidiaries, Lists 13 Precursors Utilised to Make Fentanyl: FBI Director","text":"Washington, DC [US], November 13 (ANI): Director of the Federal Bureau of Investigation Kash Patel on Wednesday (US local time) made a historic announcement that China has agreed to effectively cut off thirteen precursors and control seven chemical subsidiaries that used to create fentanyl coming out of the country. He made the announcement during the briefing at the White House. Also Read | Pakistan-Afghanistan Tension: Kabul Tells Businesses to Stop Import of 'Inferior' Medicine From Pak, Urges Alternate Routes for Trade.\nPatel said, \"The People's Republic of China has fully designated and listed all 13 precursors utilised to make Fentanyl. Furthermore, they have agreed to control seven chemical subsidiaries that are also utilised to produce this lethal drug. Effective immediately, essentially, President Trump has shut off the pipeline that creates Fentanyl, which kills tens of thousands of Americans. These substances are now banned, and they will no longer be utilised by the Mexican drug trafficking organisations or any other DTOs around the world to make this drug. This historic achievement has saved tens of thousands of lives.\"\nHe lauded the leadership of Trump and praised the team behind this significant outcome. Also Read | Delhi Blast: Israel's PM Benjamin Netanyahu Offers Condolences to PM Modi and People of India, Says 'Terror May Strike Our Cities, but Will Never Shake Our Souls'.\n\"This historic achievement could not have been possible without the tremendous team of President Trump, the Attorney General, the Department of Justice, Federal Bureau of Investigation and Ambassador Purdue in China, whose ground-level engagements were imperative to achieving this result.\"\n\"This is yet another example of how President Trump defends the American people, provides security for the American people and puts the American people first. This is a historic, first of its kind achievement by any President to stop the scurge of fentanyl and it should be championed by every single American. This achievement will save lives. We are thankful to President Trump's steadfast leadership and this FBI will fearlessly follow in his footsteps to ensure that this mission of safeguarding the American public is achieved every single day\", Patel added.\nThe announcement comes on the heels of the meeting between US President Donald Trump and Chinese President Xi Jinping.\nPreviously, praising his meet with Jinping in a post on Truth Social, Trump had said that \"China has strongly stated that they will work diligently with us to stop the flow of Fentanyl into our (US) country. They will help us end the Fentanyl Crisis.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Director of the Federal Bureau of Investigation Kash Patel on Wednesday (US local time) made a historic announcement that the Trump administration has struck an agreement with China to effectively cut off the precursors used to create fentanyl coming out of the country.","url":"https://www.latestly.com/agency-news/world-news-china-agrees-to-control-chemical-subsidiaries-lists-13-precursors-utilised-to-make-fentanyl-fbi-director-7202460.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251112201540.jpg","video":null,"publish_date":"2025-11-13 00:20:25","author":null,"language":"en","source_country":"in","sentiment":-0.052},{"id":378408930,"title":"U.S. mints final pennies after 232 years of production","text":"PHILADELPHIA >> U.S. Treasurer Brandon Beach visited the Philadelphia Mint today to strike the final five circulating one-cent coins or pennies, ending 232 years of penny production in the United States.\n\nPresident Donald Trump in February ordered Treasury to halt what he called the “wasteful” minting of pennies, prompting gas stations, fast-food chains and big-box stores to adjust prices and round cash transactions.\n\nTreasury said rising production costs and rapidly changing consumer habits and technology had made production of pennies “financially untenable” and unnecessary, noting that it costs 3.69 cents to make each penny, up from 1.42 cents a decade ago.\n\nProduction of circulating pennies was suspended months ago, Mint officials said, but an unspecified number of additional one-cent coins – marked with an Omega symbol to signify the last of their kind – were made to be auctioned off in December.\n\nThe five pennies pressed on Wednesday will be part of that batch, said Robert Kurzyna, superintendent of the Philadelphia Mint. Details of the auction will be released shortly, he said. Those pennies could technically be used for circulation, unlike collector coins, which are shinier and made differently.\n\nThe Philadelphia Mint produced 232 of Omega-stamped coins for the auction, one for each year the penny was produced, plus three for display at Treasury and other institutions, a source familiar with the matter said. It also produced 235 gold pennies, the source said.\n\nIt was unclear whether additional pennies were pressed for the auction at the Denver Mint, where pennies were also made.\n\nU.S. Mint Acting Director Kristie McNally said the first and last of the coins to be auctioned could fetch around $100,000. All proceeds will be used to fund Mint operations, with any excess to be transferred to the U.S. Treasury, she said.\n\nSuspending production of the penny is expected to save the U.S. Mint about $56 million a year, Treasury said. Pennies will remain legal tender, with an estimated 300 billion of them in circulation, “far exceeding the amount needed for commerce,” Treasury said.\n\n“Sad to see the penny go, but it was inevitable given rising costs,” said American University professor Gabriel Mathy, adding the iconic American coin would “stick around for a while, though people may start hoarding pennies.”\n\nU.S. Treasury Secretary Scott Bessent was slated to attend the event, but canceled his appearance due to travel delays after a speech in New York.\n\nThe U.S. is joining other countries, including Canada, Australia, Ireland and New Zealand, in phasing out their lowest-value coins, rounding cash transactions up or down to the nearest five cents while keeping electronic payments exact.\n\nThe penny was first issued by the government in 1793. Since 1909, the profile of President Abraham Lincoln has adorned the obverse side of the coin made of zinc and copper.\n\nIn fiscal 2024, pennies accounted for 57% — or 3.2 billion — of the Mint’s total production of 5.61 billion circulating coins. The Mint will continue to produce collector versions of the penny in limited quantities, Treasury said.\n\nA Mint official said some gold pennies were also planned.\n\nSupporters of the penny have argued that it helps keep consumer prices lower and is a source of income to charities.\n\nFor many Americans, however, the coin has become a nuisance that ends up being discarded in drawers, jars and piggy banks.\n\nThe American Bankers Association said last month a slowdown in penny circulation this year had created localized supply issues, especially in areas where terminals used by banks to deposit excess coins have been shut down.\n\nIt said the banking industry was encouraging consumers to check their home, car and coin jars for pennies and bring them to banks, retailers or coin kiosks to help ease the slowdown.\n\nA decision on whether to eliminate the penny would be up to Congress and the president, the banking group said, noting the U.S. Constitution gave Congress the authority to coin money.\n\nRepublican Representative Frank Lucas said he has been working with House Conference Chair Lisa McLain on bipartisan legislation to address the high cost of producing coins.\n\n“This is the 19th consecutive year the United States government has lost money producing the one-cent piece and the nickel,” Lucas said in a statement to Reuters. “Our bipartisan bill is working its way through the House to answer President Trump’s call and bring costs down for the taxpayer.”","summary":"PHILADELPHIA >> U.S. Treasurer Brandon Beach visited the Philadelphia Mint today to strike the final five circulating one-cent coins or pennies, ending 232 years of penny production in the United States.","url":"https://www.staradvertiser.com/2025/11/12/breaking-news/u-s-mints-final-pennies-after-232-years-of-production/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/11/web1_2025-11-12T223027Z_454272535_RC26VHA8B6C9_RTRMADP_3_USA-TREASURY-BESSENT-PENNY.JPG","video":null,"publish_date":"2025-11-13 00:20:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":0.014},{"id":378408692,"title":"The Epstein email receipts show sex offender’s deep reach in Washington went far beyond Trump","text":"The former prince, Andrew Mountbatten Windsor, fell into disgrace after it was revealed that he kept in contact with Jeffrey Epstein after the financier was convicted of sex crimes in 2008 in a “sweetheart deal” that largely allowed him to escape judgment for his crimes.\n\nBut were Washington’s elite held to those same standards, there would be plenty of disgrace to go around.\n\nOn Wednesday, another trove of email chains involving Jeffrey Epstein and his former girlfriend, Ghislaine Maxwell, was released by the House Oversight Committee’s members, which include both Republicans and Democrats. The emails revealed startling insinuations about Donald Trump himself, including one where he wrote to a biographer that Trump “knew about the girls”. The White House and Trump have strongly denied that the president knew about any illegal activity.\n\nThe emails released on Wednesday also centered a second spotlight on Epstein’s other associates, however, and some illustrate clearly the wide range of the alleged sex trafficker and convicted pedophile’s connections to America’s political establishment, in several cases after his public reputation was already sullied by a conviction for soliciting an underage girl for prostitution.\n\nThey included messages to two men who have been key figures in both the pre-Trump and post-Trump D.C. political world: Larry Summers, former secretary of the Treasury under Bill Clinton and director of the National Economic Council under Barack Obama, and Steve Bannon. Once a White House official in Trump’s first term and formerly head of Breitbart News, Bannon remains a spiritual leader of the populist MAGA right through his War Room podcast and retains a grip on a large portion of the Trump-aligned voter base.\n\nEpstein’s reach didn’t stop there, of course.\n\nIt extended to friendly emails with Michael Wolff, the well-connected D.C. journalist and biographer whose books about Donald Trump have invoked the president’s fury. It extended to Reid Hoffman, a Democratic megadonor and tech CEO who co-founded LinkedIn and most recently supported both Joe Biden and, later, Kamala Harris’s 2024 campaigns for the presidency. In 2016, he was chatting with Noam Chomsky, often considered a luminary of American left-leaning anti-corporatist political thought. He also had conversations with Doug Band, a key member of Bill and Hillary Clinton’s inner circle, though Band’s conversations seem to have stopped before Epstein’s conviction.\n\nThere’s the foreign angle, too: In 2013, Epstein was emailing with Israel’s then-defence minister, Ehud Barak, according to emails obtained by Drop Site News. The two met in Manhattan, at Epstein’s home, one month after Barak left the government, and the news outlet reported that an extensive backchannel existed between Epstein and Barak’s personal email account during the latter’s time in government. Drop Site has reported those emails continued all the way through the mid-2010s, as Epstein attempted to use his influence to broker a meeting between Barak and Vladimir Putin aimed at halting the conflict in Syria.\n\nInconsistent as the political leanings of his friends were, there was one thread that remained true throughout: Epstein’s attraction to political power. His energetic networking with mid-to-high-profile political figures suggests that the billionaire sex criminal cared most about maintaining a connection to whichever factions were dominant or at least carried importance in Washington.\n\nHe emailed with a former Obama White House counsel during the last year of the 44th president’s term. His conversations with Bannon took place in 2018, one year after Bannon was unceremoniously ousted from the White House by John Kelly. Summers, who emailed Epstein his detailed thoughts about Trump’s political strength in 2017, was still a leading voice heading into Joe Biden’s presidency, which began in 2021.\n\nApart from Band, who cut contact with Epstein earlier, there’s little sign of any enmity towards a man who was credibly accused of running a sex trafficking ring involving girls as young as 12. Bannon, who corresponded with Epstein in 2018, appeared to be aligned with the billionaire as he wrote that together they could build a populist, nationalist conservative coalition that would “staves [sic] off Time’s Up for a decade” — a revealing look at their thoughts on a movement aimed at exposing men who used positions of power to cover up sexual crimes and misconduct. Summers’s emails to Epstein read as private opinions and off-color thoughts shared only among close friends.\n\n“I observed that half of the IQ in the world was possessed by women,” wrote Summers in October of 2017, “without mentioning that they are more than 51 percent of the population...”\n\n“DO NOT REPEAT THIS INSIGHT,” that email concluded.\n\nIn reality, the emails confirm a long-held suspicion for many Americans: In D.C., like Hollywood and the media industry, “disgrace” often lasts only as long as the public’s attention span. Why else would so many powerful men be corresponding with a man accused of heinous crimes that have now enveloped much of the American right and left in a fervor to expose?\n\nThe answer may be simply that they never expected that attention to amount to anything serious, and likely thought that the American justice system’s penchant for protecting the powerful would rise to the occasion again.","url":"https://uk.news.yahoo.com/epstein-email-receipts-show-sex-001941261.html","image":"https://s.yimg.com/ny/api/res/1.2/WdJa5Tdf_jEFRp3SOXtxAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/2a0e2856227b5d70dbf268e2f9af1fe0","video":"","publish_date":"2025-11-13 00:19:41","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.075}]}