{"offset":0,"number":50,"available":14519,"news":[{"id":384390290,"title":"National Guard shooting: Afghan man accused of murder, assault pleads not guilty; to remain in custody","text":"Rahmanullah Lakanwal, the 29-year-old Afghan national accused of shooting two National Guard troops near the White House, was formally charged with first-degree murder and two counts of assault with intent to kill on Tuesday.However, the Afghan national, who appeared for the court hearing remotely from a hospital bed, pled not guilty to the charges, reported AP.Lakanwal's lawyer entered a not guilty plea on his behalf on the charges related to the shooting near the White House that killed Specialist Sarah Beckstrom, 20, and wounded Staff Sgt. Andrew Wolfe, 24. Despite the not guilty plea, a Washington DC judge ordered Lakanwal to be held in custody without bond, citing the \"sheer terror\" of the shooting on 26 November, which took place mere blocks away from the White House, the seat of power in the US.Authorities in the US are still investigating a potential motive for the attack, which they described as resembling an ambush.Trump tightens the screws on immigrationThe development comes days after US President Donald Trump, in his address to the nation following the attack, labelled the shooting a \"terrorist attack\", before announcing that all immigration requests pertaining to Afghan nationals including visas, green cards, citizenship, and work permits would be suspended immediately.In the aftermath of the attack, the Trump administration also announced \"full scale, rigorous reexamination\" of green card applications and other immigration benefits for people from 19 countries previously designated as “high-risk”, with full restrictions on Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan, and Yemen, and partial restrictions on Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan, and Venezuela.What we know about Rahmanullah LakanwalLakanwal entered the US in 2021 through Operation Allies Welcome, a Biden administration program that resettled Afghans after the withdrawal of US forces from the country.While the 29-year-old had applied for asylum under the Biden administration, his asylum status was approved under the Trump administration, #AfghanEvac said in a statement.","url":"https://www.livemint.com/news/us-news/national-guard-shooting-afghan-man-rahmanullah-lakanwal-accused-of-murder-assault-pleads-not-guilty-to-remain-in-jail-11764703143851.html","image":"https://www.livemint.com/lm-img/img/2025/12/02/1600x900/logo/USA-TRUMP-IMMIGRATION-JUDGE-0_1764703400209_1764703414539.JPG","video":null,"publish_date":"2025-12-03 19:25:23","author":"Livemint","authors":["Livemint"],"language":"en","category":"politics","source_country":"in","sentiment":-0.233},{"id":384390288,"title":"Trump-backed Hegseth defiant as Pentagon faces heat over alleged strike on drug boat survivors: ‘We’ve only just begun’","text":"US President Donald Trump during Tuesday’s (December 2) Cabinet meeting, expressed support for Defense Secretary Pete Hegseth, saying he is “doing a great job,” amid ongoing scrutiny over Pentagon operations targeting alleged drug boats in the Caribbean, including one vessel that was struck twice, as acknowledged by the White House.As the first Cabinet member to speak, Hegseth reaffirmed the Pentagon’s commitment to striking alleged narco-boats.\"As I've said and will say again, we've only just begun striking narco-boats and putting narco-terrorists at the bottom of the ocean,\" Hegseth said. \"Because they have been poisoning the American people. And Joe Biden tried to approach it with kid gloves.\"Emphasis on stopping drug traffickingThe Defense secretary highlighted the broader goals of the strikes: stopping the flow of drugs and eliminating threats.\"We're stopping the drugs, we're striking the boats, we're defeating narco-terrorists,\" Hegseth added.Hegseth cites ‘fog of war’Hegseth defended the second strike by citing the “fog of war”, emphasizing the uncertainty and confusion inherent in combat operations.Hegseth stated:-He did not see survivors in the water at the time of the second strike.-The vessel was already on fire, which influenced the decision.-He did not remain for the remainder of the mission after the first strike.-The admiral in charge had “complete authority” to order the follow-up strike and, in his view, “made the right call.”The comments come amid scrutiny over Pentagon operations in the Caribbean. A report said a follow-up strike in September that killed survivors of an earlier attack. Hegseth’s remarks signal continued aggressive action against alleged narco-terrorist activities at sea.Follow-up strike sparks scrutinyThe meeting comes after The Washington Post reported that a follow-up strike on September 2 targeted survivors of an earlier attack. White House Press Secretary Karoline Leavitt confirmed the second strike but clarified that a Navy admiral, not Hegseth, gave the order.\"With respect to the strikes in question on September 2, Secretary Hegseth authorized Admiral Bradley to conduct these kinetic strikes. Admiral Bradley worked well within his authority and the law, directing the engagement to ensure the boat was destroyed and the threat to the United States of America was eliminated,\" Leavitt said.Defense Secretary stands by commandersHegseth reiterated the administration’s support for military commanders making tough decisions.\"As President Trump always has our back, we always have the backs of our commanders who are making decisions in difficult situations. And we do in this case, and all these strikes. They've done the right things, we'll keep doing that, and we have their backs, Mr. President,\" Hegseth said.The Pentagon press secretary added that both Trump and Hegseth ultimately direct the strikes.\"At the end of the day, the secretary and the president are the ones directing these strikes,\" the official said.Adm. Bradley set for classified briefingNavy Vice Adm. Frank “Mitch” Bradley, who oversaw the follow-up strike, is expected to provide a classified briefing to lawmakers on Thursday.","url":"https://www.livemint.com/news/us-news/trumpbacked-hegseth-defiant-as-pentagon-faces-heat-over-alleged-strike-on-drug-boat-survivors-we-ve-only-just-begun-11764701037541.html","image":"https://www.livemint.com/lm-img/img/2025/12/02/1600x900/logo/TRUMP-CABINET-19_1764702336239_1764702350090.jpg","video":null,"publish_date":"2025-12-03 19:07:25","author":"Ravi Hari","authors":["Ravi Hari"],"language":"en","source_country":"in","sentiment":0.031},{"id":384438916,"title":"Trending World","text":"Russia's Vladimir Putin hosted US negotiators at the Kremlin on Tuesday for five hours of talks aimed at ending the war in Ukraine.\n\nPutin's aide Yuri Ushakov said the discussions - held behind closed doors with US envoy Steve Witkoff and President Donald Trump's son-in-law Jared Kushner - were \"constructive\" but \"a lot of work lies ahead\".\n\nHours earlier, Putin had said European demands over a US-Russia draft peace place were unacceptable, adding that \"if Europe wants to fight with us, we are ready to do so\".\n\nThe US envoys went to Moscow after similar talks with delegates from Kyiv in the last fortnight. Ukraine's President Zelensky said he expected a briefing by the US team after the meeting.\n\nHe said there was an opportunity to end the war \"now more than ever\" but that elements of the proposals still needed to be worked out.\n\n\"Everything depends on today's discussions,\" Zelensky told a press conference in Dublin during an official visit to Ireland.\n\nKyiv representatives have twice met US negotiators, including Witkoff, Kushner and Secretary of State Marco Rubio, since the 28-point peace plan was circulated in November.\n\nIt sparked shock in Ukraine and around Europe for appearing to favour the demands of Moscow, which invaded Ukraine nearly four years ago.\n\nAfter talks with Ukraine over the weekend, the White House said the proposals had been \"very much refined\", although details of the updated plans have not been confirmed. \n\nSome key disagreements between Moscow and Kyiv remain - namely regarding Ukrainian sovereignty over the territories Russia partly controls and security guarantees.\n\nZelensky said on Tuesday there were \"no simple solutions\", repeating his country's insistence that Kyiv take part in peace discussions, and that clear security guarantees be agreed, such as Nato membership - a move long opposed by Russia and ruled out by Trump.\n\n\"We have to stop the war in such a manner that in one year, Russia would not come back\", Zelensky added.\n\nPutin appeared immovable on its demands as recently as last week, while Zelensky has repeatedly said he would never relinquish control of eastern Ukrainian regions.\n\nWhile Tuesday's talks were under way, Trump told his cabinet in Washington that the conflict had not been easy to resolve.\n\n\"Our people are over in Russia right now to see if we can get it settled,\" he said. \"What a mess.\"\n\nKyiv's European allies had countered the 28-point plan with their own document - removing many of the most contentious elements, such as Washington's recognition of Donetsk and Luhansk as de facto Russian.\n\nSpeaking ahead of Tuesday's meeting, Putin told reporters Europe's demands were \"not acceptable\" and that they were trying to hinder efforts towards peace.\n\nZelensky had met French President Emmanuel Macron on Monday, with several European leaders joining the meeting virtually. \n\nMacron said there was \"no finalised plan to speak of\" and that it could only be achieved with input from Ukraine and Europe.\n\nMeanwhile, fighting continued on the front lines on Tuesday. Ukraine's military said it was still engaging Russian troops in the key eastern city of Pokrovsk - contradicting Moscow's claim to have captured it.\n\nRussia's Ministry of Defence shared a video on Telegram claiming to show its troops holding up flags in the strategically important city, which they have been trying to seize for over a year.\n\nUkraine's eastern military command claimed Russia had tried to \"flag-plant\" in the city so that \"propagandists\" could say it had been captured. \"They fled in a hurry, and the mopping up of enemy groups continues,\" it said in a statement on social media.\n\nUkraine's military said its forces still controlled the northern part of the city, with Russian units suffering heavy losses, while international observers also disputed Russia's claim to the area.\n\nThe military in Kyiv also dismissed Russia's claims to have captured the north-eastern Ukrainian border town of Vovchansk and said it had \"significantly improved\" its position in the northeastern city of Kupyans, which Russia claimed to have conquered a fortnight ago.\n\nSince Russia invaded Ukraine on 24 February 2022, tens of thousands of soldiers have been killed or injured - alongside more than 14,000 civilians, according to the UN.\n\nCivilian targets including kindergartens, hospitals and residential buildings have been destroyed or heavily damaged by nightly drone or missile attacks.\n\nThe conflict between the two ex-Soviet states stretches back to 2014 when Ukraine's pro-Russian president was overthrown and Russia responded by annexing Crimea and supporting armed uprisings in eastern Ukraine.","url":"https://www.classfmonline.com/world/Putin-hosts-Trump-negotiators-at-Kremlin-for-constructive-Ukraine-talks-68341","image":"https://cdn.classfmonline.com/imagelib/thumbs/86081970.jpg","video":null,"publish_date":"2025-12-03 01:20:25","author":"Bbc.com","authors":["Bbc.com"],"language":"en","source_country":"gh","sentiment":-0.404},{"id":384443688,"title":"No Ukraine Compromise Reached After 5-hour Putin Talks With Trump Envoys","text":"Moscow: Russia and the U.S. did not reach a compromise on a possible peace deal to end the war in Ukraine after a five-hour Kremlin meeting between President Vladimir Putin and Donald Trump's top envoys, the Kremlin said on Wednesday.Trump has repeatedly complained that ending Europe's deadliest conflict since World War Two has been one of the elusive foreign policy aims of his presidency. The U.S. president has at times scolded both Putin and Ukrainian President Volodymyr Zelenskiy.Talks in Moscow between Putin and Trump's special envoy, Steve Witkoff, and son-in-law Jared Kushner went past midnight. Afterward, Putin's top foreign policy aide, Yuri Ushakov, said \"Compromises have not yet been found.\"There is still a lot of work to be done,\" Ushakov told reporters at a briefing in the Kremlin.Putin reacted negatively to some U.S. proposals, Ushakov said. Witkoff went to the U.S. embassy in Moscow after the talks to brief the White House, Ushakov said.Ushakov added that a meeting between Putin and Trump was not currently planned, though he said the talks were constructive and that there were huge opportunities for U.S.-Russian economic cooperation.No further away from peaceUshakov said Putin had sent a series of important signals and his greetings to Trump, but that the sides had agreed not to disclose details to the media.He added that they had discussed the \"territorial problem\", Kremlin shorthand for Russian claims to the whole of Donbas, though Ukraine controls at least 5,000 square km (1,900 square miles) of the area which Russia claims as its own. Almost all countries recognise Donbas as part of Ukraine.\"Some American draft proposals look more or less acceptable, but they need to be discussed,\" Ushakov said. \"Some of the formulations that have been proposed to us are not suitable for us, that is - the work will continue.\"Witkoff, a billionaire U.S. real estate developer who has known Trump since the 1980s, and Kushner, the husband of Trump's daughter Ivanka, began talks in the Kremlin after a stroll across Red Square past the mausoleum of Soviet founder Vladimir Lenin to the towers of the Kremlin.They talked with Putin, Ushakov and Putin's envoy Kirill Dmitriev, via interpreters.\"Our people are over in Russia right now to see if we can get it settled. Not an easy situation, let me tell you. What a mess,\" Trump said on Tuesday in Washington, adding that there were casualties of 25,000 to 30,000 per month in the war.Russia invaded Ukraine in February 2022, triggering the biggest confrontation between Moscow and the West since the depths of the Cold War.European powers worried by US effortsA leaked set of 28 U.S. draft peace proposals emerged in November, alarming Ukrainian and European officials who said it bowed to Moscow's main demands.European powers then came up with a counter-proposal, and at talks in Geneva, the U.S. and Ukraine said they had created an \"updated and refined peace framework\" to end the war.Zelenskiy, speaking in Dublin, said everything would depend on the talks in Moscow but that he was afraid the U.S. could lose interest in the peace process.\"There will be no easy solutions ... It is important that everything is fair and open, so that there are no games behind Ukraine's back,\" he said.Just before the Kremlin meeting with Witkoff, Putin said Russia did not want war with Europe, but that if Europe started one, it would end so swiftly that there would be no one left for Russia to negotiate with.Putin threatened to sever Ukraine's access to the sea in response to drone attacks on tankers of Russia's \"shadow fleet\" in the Black Sea. Ukraine's Foreign Minister, Andrii Sybiha, said Putin's remarks showed he was not ready to end the war.","summary":"Trump has repeatedly complained that ending Europe's deadliest conflict since World War Two has been one of the elusive foreign policy aims of his presidency","url":"https://www.deccanchronicle.com/world/no-ukraine-compromise-reached-after-5-hour-putin-talks-with-trump-envoys-1921256","image":"https://www.deccanchronicle.com/h-upload/2025/12/03/1985429-aa-6043598.webp","video":null,"publish_date":"2025-12-03 01:18:01","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.316},{"id":384442766,"title":"Suburban Chicago cop arrested by ICE returns to duty","text":"CHICAGO Dec 2 - A suburban Chicago police officer who was detained during a high-profile federal immigration enforcement surge in the area has returned to duty, his police department said in a statement on Tuesday.\n\nRadule Bojovic, an officer with the Hanover Park Police Department, was arrested by U.S. Immigration and Customs Enforcement agents during \"Operation Midway Blitz,\" a months-long deportation campaign launched by the administration of U.S. President Donald Trump in the Chicago area in September.\n\nThe Department of Homeland Security, which oversees ICE, announced Bojovic's arrest with much fanfare in a press release on October 16, saying he had overstayed a tourist visa after arriving in the U.S. from Montenegro. \n\nBut the Hanover Park Police Department quickly responded with a statement saying Bojovic was working in the country legally, having presented a work authorization card and passed FBI and Illinois State Police background checks.\n\nThere was no immediate response to a request seeking comment from ICE.\n\nBojovic, who was held at a detention center in Brazil, Indiana, according to ICE's online detainee locator, was released on bond on October 31, the Hanover Park Police Department said.\n\n\"Given that his bond was not contested and he remains authorized to work by the federal government, the Hanover Park Police Department determined that he may return to work,\" Deputy Chief Victor DiVito said in the statement.\n\nDiVito said Bojovic would receive back pay for the time he was on leave during his detention.\n\nDHS Assistant Secretary for Public Affairs Tricia McLaughlin told Reuters as of November 19, ICE and U.S. Customs and Border Protection officers had arrested more than 4,200 people in the Chicago area during Operation Midway Blitz. REUTERS","url":"https://www.straitstimes.com/world/europe/suburban-chicago-cop-arrested-by-ice-returns-to-duty","image":"https://cassette.sphdigital.com.sg/image/straitstimes/3f74023c12313c1bd1f4139f854e292a6e66084b5f16f9c60555835d5b3bc629","video":null,"publish_date":"2025-12-03 01:10:32","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.277},{"id":384443116,"title":"Stephen King says he’s never read anything like this western epic","text":"With Tom’s Crossing, Danielewski has changed gears dramatically. Gone are the experimental antics, replaced by an essentially traditional western epic of ponderous length. In essence the story of two teens and a ghost on a quest to save two horses from the slaughterhouse, Danielewski drags it, at first stubbornly, and as the characters develop (very much including the horses) it rapidly moves into a trot and finally a gallop.\n\nIts length, in part, is due to Danielewski’s determination to mythologise his myth in situ. It’s at heart an adventure story, and we encounter interpretations of dramatic moments via the speculations and gossip ranging from idle chatter from the townsfolk through to songs written and performed and paintings and installations executed that are inspired by the mythos. Yes, Aristotle is slyly referred to throughout. Danielewski doesn’t hide either his inspiration or his ambition. The Iliad and The Odyssey arise several times, as though they are the peaks Danielewski is attempting to surmount on horseback. And, of course, Xanthos, a horse of Achilles in The Iliad, indeed finds speech, which is a subtext of Tom’s Crossing, the riders’ uncanny ability to seemingly communicate with their equine partners.\n\nAside from sublime descriptions of the mountainous landscape the book is set in, Danielewski’s characterisations are phenomenal. His key villain, Old Porch, who owns the slaughterhouse the horses were fated to, is as vivid as Brian Dennehy’s evil Sherriff in Silverado with mood swings to rival Donald Trump. Tom, the book’s titular hero, dies early of a hideous cancer, but returns along with all the frustrations of being a ghost, tagging along to help his friend Kalin, who has been joined by Tom’s adopted sister Landry in this sprawling misadventure. Their quest revolves entirely around a shared love for the equestrian, and if you don’t know much about horses, you are about to be taken for quite a knowledgeable ride.\n\nRegardless of how outlandish the scenario may be, he has done his research. In House of Leaves he knew how to make films (his father was a filmmaker) and at least rudimentary architectural realities. In Tom’s Crossing he knows how to secure a halter and how to stop a saddle slipping in icy conditions. But there is not a spur in sight – they are not required.","summary":"Best known for the experimental cult classic House of Leaves, Mark Z. Danielewski has dramatically changed gears in his ambitious new novel.","url":"https://www.smh.com.au/culture/books/stephen-king-says-he-s-never-read-anything-like-this-western-epic-20251126-p5nim6.html","image":"https://static.ffx.io/images/$zoom_0.5008%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_413%2C$y_77/t_crop_custom/q_86%2Cf_auto/66aa2e5aacb5d2f15275421173a887b08f9ea499","video":null,"publish_date":"2025-12-03 01:00:00","author":"Ashley Crawford","authors":["Ashley Crawford"],"language":"en","source_country":"au","sentiment":0.512},{"id":384441030,"title":"Stephen King says he’s never read anything like this western epic","text":"With Tom’s Crossing, Danielewski has changed gears dramatically. Gone are the experimental antics, replaced by an essentially traditional western epic of ponderous length. In essence the story of two teens and a ghost on a quest to save two horses from the slaughterhouse, Danielewski drags it, at first stubbornly, and as the characters develop (very much including the horses) it rapidly moves into a trot and finally a gallop.\n\nIts length, in part, is due to Danielewski’s determination to mythologise his myth in situ. It’s at heart an adventure story, and we encounter interpretations of dramatic moments via the speculations and gossip ranging from idle chatter from the townsfolk through to songs written and performed and paintings and installations executed that are inspired by the mythos. Yes, Aristotle is slyly referred to throughout. Danielewski doesn’t hide either his inspiration or his ambition. The Iliad and The Odyssey arise several times, as though they are the peaks Danielewski is attempting to surmount on horseback. And, of course, Xanthos, a horse of Achilles in The Iliad, indeed finds speech, which is a subtext of Tom’s Crossing, the riders’ uncanny ability to seemingly communicate with their equine partners.\n\nAside from sublime descriptions of the mountainous landscape the book is set in, Danielewski’s characterisations are phenomenal. His key villain, Old Porch, who owns the slaughterhouse the horses were fated to, is as vivid as Brian Dennehy’s evil Sherriff in Silverado with mood swings to rival Donald Trump. Tom, the book’s titular hero, dies early of a hideous cancer, but returns along with all the frustrations of being a ghost, tagging along to help his friend Kalin, who has been joined by Tom’s adopted sister Landry in this sprawling misadventure. Their quest revolves entirely around a shared love for the equestrian, and if you don’t know much about horses, you are about to be taken for quite a knowledgeable ride.\n\nRegardless of how outlandish the scenario may be, he has done his research. In House of Leaves he knew how to make films (his father was a filmmaker) and at least rudimentary architectural realities. In Tom’s Crossing he knows how to secure a halter and how to stop a saddle slipping in icy conditions. But there is not a spur in sight – they are not required.","summary":"Best known for the experimental cult classic House of Leaves, Mark Z. Danielewski has dramatically changed gears in his ambitious new novel.","url":"https://www.brisbanetimes.com.au/culture/books/stephen-king-says-he-s-never-read-anything-like-this-western-epic-20251126-p5nim6.html","image":"https://static.ffx.io/images/$zoom_0.5008%2C$multiply_0.7025%2C$ratio_1.777778%2C$width_1059%2C$x_413%2C$y_77/t_crop_custom/q_86%2Cf_auto/66aa2e5aacb5d2f15275421173a887b08f9ea499","video":null,"publish_date":"2025-12-03 01:00:00","author":"Ashley Crawford","authors":["Ashley Crawford"],"language":"en","source_country":"au","sentiment":0.512},{"id":384441938,"title":"Lula, Trump sepakat tingkatkan kerjasama banteras jenayah terancang","text":"BRASILIA: Presiden Brazil, Luiz Inacio Lula da Silva, dan rakan sejawatnya dari Amerika Syarikat (AS), Donald Trump, semalam bersetuju untuk memperhebatkan kerjasama dalam memerangi jenayah terancang, kata pejabat presiden Brazil.\n\nLula menghubungi Trump selepas kedua-dua pemimpin itu mengadakan pertemuan rasmi pertama mereka pada Oktober, sekali gus menandakan peningkatan hubungan yang lebih baik selepas ketegangan selama berbulan-bulan antara Brasília dan Washington.\n\nDalam perbualan telefon selama 40 minit itu, Lula menekankan perlunya kerjasama yang lebih erat antara kedua-dua negara untuk memerangi jenayah terancang, kata pejabat presiden dalam satu kenyataan.\n\nPerbualan itu berlaku di tengah-tengah ketegangan berhubung serangan AS ke atas sindiket dadah yang disyaki berhampiran pantai Venezuela, yang telah membunuh sekurang-kurangnya 83 orang sejak awal September.\n\nLula berkata, operasi terbaharu polis di Brazil yang bertujuan untuk melemahkan kewangan jenayah terancang, di mana cawangan kumpulan jenayah yang beroperasi dari luar negara telah dikenal pasti.\n\nTrump pula menyatakan kesediaan penuh untuk bekerjasama dengan Brazil dalam memerangi organisasi-organisasi itu, kata kenyataan Brazil.\n\nSementara itu, Presiden AS menyatakan bahawa beliau dan Lula mempunyai perbualan yang hebat melalui telefon.\n\n\"Kami bercakap mengenai perdagangan. Kami bercakap mengenai sekatan, kerana, seperti yang anda tahu, saya mengenakan sekatan ke atas mereka berkaitan dengan beberapa... perkara yang berlaku,\" kata Trump kepada wartawan semasa acara amal di Rumah Putih semalam. \n\nPihak berkuasa Brazil baru-baru ini telah melancarkan beberapa operasi besar terhadap salah satu kumpulan jenayah terbesar di negara itu, First Capital Command (PCC).\n\nPenyiasat mendedahkan bahawa kumpulan jenayah itu mencuci wang dalam jumlah besar melalui stesen minyak yang kemudiannya dipindahkan ke bank digital dan aplikasi pembayaran.\n\nDi Rio de Janeiro, polis telah meningkatkan operasi terhadap satu lagi kumpulan jenayah utama, Comando Vermelho (Perintah Merah), yang mana salah satu operasi pada Oktober lalu telah mengorbankan 122 orang.\n\nKedua-dua kumpulan jenayah itu mengawal pemerdagangan kokain di Brazil, dengan jangkauan merentasi Amerika Latin dan, dalam kes PCC, sehingga ke Eropah.\n\nLula dan Trump turut membincangkan isu tarif perdagangan.\n\nSelepas siri rundingan, Washington bulan lalu telah menarik balik tarif punitif 40 peratus yang dikenakan ke atas beberapa barangan Brazil, termasuk daging, kopi, dan buah-buahan.\n\nTrump mengenakan tarif tambahan itu sebagai tindak balas kepada perbicaraan sekutunya, bekas Presiden berhaluan kanan, Jair Bolsonaro, yang kini menjalani hukuman penjara 27 tahun kerana merancang rampasan kuasa.\n\nLula menyifatkan penarikan balik tarif itu sebagai sangat positif tetapi menekankan bahawa produk lain masih terkesan oleh tarif dan perlu dibincangkan.\n\n\"Brazil mahu bergerak pantas dalam rundingan ini,\" tegas Lula kepada Trump, menurut kenyataan itu.\n\nKedua-dua Presiden bersetuju untuk berbincang lagi dalam masa terdekat.","summary":"BRASILIA: Presiden Brazil, Luiz Inacio Lula da Silva, dan rakan sejawatnya dari Amerika Syarikat (AS), Donald Trump, semalam bersetuju untuk memperhebatkan kerjasama dalam memerangi jenayah terancang, kata pejabat presiden Brazil.","url":"https://www.bharian.com.my/dunia/amerika/2025/12/1479978/lula-trump-sepakat-tingkatkan-kerjasama-banteras-jenayah-terancang","image":"https://assets.bharian.com.my/images/articles/BH3lula-o_BHfield_image_listing_featured.var_1764723382.jpg","video":null,"publish_date":"2025-12-03 00:56:27","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.478},{"id":384442034,"title":"Trump declares all Biden autopen-signed documents, including pardons \"null and void\"","text":"Washington DC [US], December 3 (ANI): US President Donald Trump declared all official documents signed by his predecessor Joe Biden, using an autopen, \"null, void, and of no further force or effect.\"Autopen is a device used to replicate a person's signature with precision. The Autopen has been used by both Republican and Democratic presidents in the past. \"Any and all Documents, Proclamations, Executive Orders, Memorandums, or Contracts, signed by Order of the now infamous and unauthorized \"AUTOPEN,\" within the Administration of Joseph R. Biden Jr., are hereby null, void, and of no further force or effect.\" Trump said in a post on his social media platform, Truth Social.\"Anyone receiving 'Pardons,' 'Commutations,\" or any other Legal Document so signed, please be advised that said Document has been fully and completely terminated, and is of no Legal effect. Thank you for your attention to this matter!\" he further added.Trump has time and again claimed that Biden was unable to control the executive office, given his age and mental state. He has repeatedly criticised Biden for using an autopen during his presidency.While the practice has been routine in the White House, Trump has claimed that Biden's reliance on the device shows he was not in control of his presidency. He had earlier claimed that Biden aides made several decisions without his knowledge.Before leaving the Oval Office, former President Joe Biden issued a series of preemptive pardons for several of his family members and political figures. The pardons served to protect individuals who have been vocal opponents of President-elect Donald Trump and guarantee that Biden's closest family members will not face prosecution by the incoming administration. This act was made in the final hours of Biden's presidency and is considered a significant use of presidential power.Biden announced clemency for high-profile figures such as General Mark Milley, Anthony Fauci, and members of Congress who served on the committee investigating the January 6th Capitol attack. These pre-emptive pardons were seen as a defensive measure against any retribution Trump might seek after his inauguration. Furthermore, Biden pardoned his family members, including his brothers James and Frank, his sister Valerie, and their spouses. (ANI)","url":"https://www.aninews.in/news/world/us/trump-declares-all-biden-autopen-signed-documents-including-pardons-null-and-void20251203062545","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251203004825.jpg","video":null,"publish_date":"2025-12-03 00:55:45","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.093},{"id":384439468,"title":"Trump declares all Biden autopen-signed documents, including pardons \"null and void\"","text":"Washington DC [US], December 3 (ANI): US President Donald Trump declared all official documents signed by his predecessor Joe Biden, using an autopen, \"null, void, and of no further force or effect.\"Autopen is a device used to replicate a person's signature with precision. The Autopen has been used by both Republican and Democratic presidents in the past. \"Any and all Documents, Proclamations, Executive Orders, Memorandums, or Contracts, signed by Order of the now infamous and unauthorized \"AUTOPEN,\" within the Administration of Joseph R. Biden Jr., are hereby null, void, and of no further force or effect.\" Trump said in a post on his social media platform, Truth Social.\"Anyone receiving 'Pardons,' 'Commutations,\" or any other Legal Document so signed, please be advised that said Document has been fully and completely terminated, and is of no Legal effect. Thank you for your attention to this matter!\" he further added.\n\nTrump has time and again claimed that Biden was unable to control the executive office, given his age and mental state. He has repeatedly criticised Biden for using an autopen during his presidency.While the practice has been routine in the White House, Trump has claimed that Biden's reliance on the device shows he was not in control of his presidency. He had earlier claimed that Biden aides made several decisions without his knowledge.Before leaving the Oval Office, former President Joe Biden issued a series of preemptive pardons for several of his family members and political figures. The pardons served to protect individuals who have been vocal opponents of President-elect Donald Trump and guarantee that Biden's closest family members will not face prosecution by the incoming administration. This act was made in the final hours of Biden's presidency and is considered a significant use of presidential power.Biden announced clemency for high-profile figures such as General Mark Milley, Anthony Fauci, and members of Congress who served on the committee investigating the January 6th Capitol attack. These pre-emptive pardons were seen as a defensive measure against any retribution Trump might seek after his inauguration. Furthermore, Biden pardoned his family members, including his brothers James and Frank, his sister Valerie, and their spouses. (ANI)","url":"https://aninews.in/news/world/us/trump-declares-all-biden-autopen-signed-documents-including-pardons-null-and-void20251203062545","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251203004825.jpg","video":null,"publish_date":"2025-12-03 00:55:45","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.08},{"id":384441846,"title":"U.S. pauses all applications for immigrants from 19 countries: report","text":"U.S. President Donald Trump’s administration has paused all immigration applications, including green card and U.S. citizenship processing, filed by immigrants from 19 countries, the New York Times reported on Tuesday (December 2, 2025), citing agency officials.\n\nThe pause applies to people from countries that the administration banned in June from seeking status from U.S. Citizenship and Immigration Services, the newspaper reported.","url":"https://www.thehindu.com/news/international/us-pauses-all-applications-for-immigrants-from-19-countries-report/article70351891.ece","image":"https://th-i.thgim.com/public/incoming/bhv8aj/article70351894.ece/alternates/LANDSCAPE_1200/2025-12-02T160044Z_527289312_RC2B8IACLQUC_RTRMADP_3_MIGRATION-USA-NEW-YORK.JPG","video":null,"publish_date":"2025-12-03 00:53:14","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.304},{"id":384442762,"title":"South Korea's Lee says martial law clean-up not yet complete on first anniversary","text":"SEOUL, Dec 3 - South Korean President Lee Jae Myung said on Wednesday there was still work left to deal with the fallout of the failed martial law bid one year ago and ensure the perpetrators are brought to justice.\n\nThe attempt to impose martial law by former President Yoon Suk Yeol threatened to deal an irreparable setback to the country, but the people rose up and stopped the military with their bare hands, Lee said in an address marking the first anniversary of the shock announcement by his predecessor.\n\n\"The recklessness of those who tried to destroy the constitutional order and even plan a war all for their personal ambition must be brought to justice,\" he said.\n\nYoon's martial law declaration plunged a country that had been celebrated as one of the success stories of democratic resilience into months of political turmoil just as U.S. President Donald Trump's moves to slap tariffs on global trading partners rattled South Korea, an export-heavy economy.\n\nYoon was later ousted and Lee, a political rival who lost to Yoon in 2022, won a snap election in June with a mandate to steer the country out of the shock of martial law, as those who were accused of being involved were arrested and tried for subversion. \n\nLee said he will propose designating December 3 a national holiday to celebrate the role of the people in quelling the martial law bid and that they deserved to be considered for the Nobel Peace Prize. REUTERS","url":"https://www.straitstimes.com/asia/south-koreas-lee-says-martial-law-clean-up-not-yet-complete-on-first-anniversary","image":"https://cassette.sphdigital.com.sg/image/straitstimes/8a7c3a4750963c0967ed97614380a4a8ad83a53f85cd420cb6b44befe3d00527","video":null,"publish_date":"2025-12-03 00:50:21","author":null,"language":"en","source_country":"sg","sentiment":-0.553},{"id":384443744,"title":"Trump says he’s rebuilding Dulles airport while his administration is fixing the ‘people movers’","text":"By SEUNG MIN KIM\n\nWASHINGTON (AP) — President Donald Trump said Tuesday that his administration will embark on a reconstruction of Dulles International Airport in northern Virginia.\n\n“We’re also going to rebuild Dulles airport because it’s not a good airport,” Trump said during a meeting of his Cabinet members at the White House. “It should be a great airport, and it’s not a good airport at all. It’s a terrible airport.”\n\nDulles is one of the three Washington-area airports and its quality is a hotly-debated topic among Washingtonians.\n\nTrump, a former real estate mogul, said the Dulles building was “incorrectly designed.” He nonetheless praised Eero Saarinen, the Finnish-American architect who designed the main terminal at Dulles.\n\n“We’re going to turn that around and we’re going to make Dulles airport — serving Washington and Virginia, Maryland, etc. — we’re gonna make that into something really spectacular. We have an amazing plan for it.”\n\nHis motorcade took an unannounced drive through Dulles in early November. At the time, the White House said Trump wanted to take the detour to the airport to assess potential future projects.\n\nDuring Tuesday’s Cabinet meeting, Transportation Secretary Sean Duffy singled out the controversial “people movers” that ferry travelers in between concourses. One of the vehicles, which are also called “mobile lounges,” crashed in November.\n\nStill, some experts questioned the substance of Trump’s Dulles remarks.\n\nSheldon H. Jacobson, an airport security and aviation infrastructure expert whose research contributed to the design of TSA PreCheck, called the president’s announcement a “head-scratcher,” noting it comes amid substantial modernization work already underway at Dulles, including a new 14-gate concourse set to open next year that will give passengers direct access to its AeroTrain system.\n\n“I can think of a lot higher priorities right now,” he said, pointing to the long-needed updates to the nation’s aging air traffic control equipment. Trump said Tuesday that his administration was also working on modernizing the air traffic control system.\n\nJacobson said the airport’s continued reliance on people movers remains a “glaring weakness,” but added that “there are a lot of things actually in very good shape at Dulles right now,” including the AeroTrain.\n\n“I’m not sure what he’s thinking,” Jacobson said of Trump. “His comments are non sequitur to the reality of this airport.”\n\nThe Transportation Department announced later Tuesday that it is inviting bids for a Dulles project that would build “completely new terminals and concourses” at the airport. The Metropolitan Washington Airports Authority said in a statement that it will work with the Transportation Department to build upon the existing $7 billion plan to improve Dulles.\n\nAssociated Press writers Rio Yamat in Las Vegas and Josh Funk in Omaha contributed to this report.","summary":"He praised the building's architect but said it was \"incorrectly designed.\"","url":"https://www.sandiegouniontribune.com/2025/12/02/trump-dulles/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/12/Trump_Dulles_76639-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-12-03 00:47:31","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"US","sentiment":0.028},{"id":384441774,"title":"Trump says he’s rebuilding Dulles airport while his administration is fixing the ‘people movers’","text":"By SEUNG MIN KIM\n\nWASHINGTON (AP) — President Donald Trump said Tuesday that his administration will embark on a reconstruction of Dulles International Airport in northern Virginia.\n\n“We’re also going to rebuild Dulles airport because it’s not a good airport,” Trump said during a meeting of his Cabinet members at the White House. “It should be a great airport, and it’s not a good airport at all. It’s a terrible airport.”\n\nDulles is one of the three Washington-area airports and its quality is a hotly-debated topic among Washingtonians.\n\nTrump, a former real estate mogul, said the Dulles building was “incorrectly designed.” He nonetheless praised Eero Saarinen, the Finnish-American architect who designed the main terminal at Dulles.\n\n“We’re going to turn that around and we’re going to make Dulles airport — serving Washington and Virginia, Maryland, etc. — we’re gonna make that into something really spectacular. We have an amazing plan for it.”\n\nHis motorcade took an unannounced drive through Dulles in early November. At the time, the White House said Trump wanted to take the detour to the airport to assess potential future projects.\n\nDuring Tuesday’s Cabinet meeting, Transportation Secretary Sean Duffy singled out the controversial “people movers” that ferry travelers in between concourses. One of the vehicles, which are also called “mobile lounges,” crashed in November.\n\nStill, some experts questioned the substance of Trump’s Dulles remarks.\n\nSheldon H. Jacobson, an airport security and aviation infrastructure expert whose research contributed to the design of TSA PreCheck, called the president’s announcement a “head-scratcher,” noting it comes amid substantial modernization work already underway at Dulles, including a new 14-gate concourse set to open next year that will give passengers direct access to its AeroTrain system.\n\n“I can think of a lot higher priorities right now,” he said, pointing to the long-needed updates to the nation’s aging air traffic control equipment. Trump said Tuesday that his administration was also working on modernizing the air traffic control system.\n\nJacobson said the airport’s continued reliance on people movers remains a “glaring weakness,” but added that “there are a lot of things actually in very good shape at Dulles right now,” including the AeroTrain.\n\n“I’m not sure what he’s thinking,” Jacobson said of Trump. “His comments are non sequitur to the reality of this airport.”\n\nThe Transportation Department announced later Tuesday that it is inviting bids for a Dulles project that would build “completely new terminals and concourses” at the airport. The Metropolitan Washington Airports Authority said in a statement that it will work with the Transportation Department to build upon the existing $7 billion plan to improve Dulles.\n\nAssociated Press writers Rio Yamat in Las Vegas and Josh Funk in Omaha contributed to this report.","summary":"He praised the building's architect but said it was \"incorrectly designed.\"","url":"https://www.bostonherald.com/2025/12/02/trump-dulles/","image":"https://www.bostonherald.com/wp-content/uploads/2025/12/Trump_Dulles_76639-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-03 00:47:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.028},{"id":384442838,"title":"Michael and Susan Dell donate $6.25B to encourage families to claim ‘Trump Accounts’ (Video)","text":"Billionaires Michael and Susan Dell pledged $6.25 billion on Tuesday to provide an incentive to families to adopt new investment accounts for children. The accounts were created as part of President Donald Trumps tax and spending legislation but have not yet launched.\n\nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\n\nThis video may be available for archive licensing via https://newsroom.ap.org/home","summary":"Billionaires Michael and Susan Dell pledged $6.25 billion on Tuesday to provide an incentive to families to adopt new investment accounts for children. The accounts were created as part of President Donald Trumps tax and...\n\n\nThe post Michael and Susan Dell donate $6.25B to encourage families to claim &#8216;Trump Accounts&#8217; (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/12/02/michael-and-susan-dell-donate-6-25b-to-encourage-families-to-claim-trump-accounts-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/12/03/maxresdefault-6.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1764724622","video":null,"publish_date":"2025-12-03 00:47:02","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","source_country":"in","sentiment":0.504},{"id":384442046,"title":"Republicans Demand Answers Over Trump's Venezuela Boat Strikes","text":"WASHINGTON ― Congressional Republicans expressed concern about U.S. military actions in the Caribbean, pledging to investigate multiple strikes on one suspected Venezuelan drug boat off the coast of Trinidad that killed defenseless survivors.\n\n“The accusations are really serious, so we need to make sure we have proper oversight. We need full accountability and transparency,” Sen. Joni Ernst (R-Iowa), a veteran, said in an interview with HuffPost. \n\n“It’s defenseless people,” noted Sen. Jim Justice (R-W.Va.). “You get in combat, somebody surrenders, and as they’re surrendering, you just don’t put a firing squad up there and just shoot them. I mean, don’t do that.”\n\nThe Washington Post reported over the weekend that U.S. Defense Secretary Pete Hegseth issued a verbal order to “kill everybody” in a pair of Sept. 2 airstrikes on an alleged drug trafficking boat that had 11 people on board, the first vessel hit in the Trump administration’s growing military campaign in the Caribbean and eastern Pacific Ocean. The second strike killed two survivors clinging to the burning wreckage of the boat, which Democrats and military experts have called a possible war crime. \n\nHegseth said on Tuesday that he watched the boat strike on a live video feed but didn’t stay for the entire event. He said U.S. Navy Admiral Frank Bradley made the call to “sink the boat and eliminate the threat.”\n\n“I did not personally see survivors. The thing was on fire…This is called the fog of war,” Hegseth said at a meeting between President Donald Trump and his Cabinet at the White House about the use of military force, which Congress has not authorized. \n\nHegseth and the White House have offered shifting answers about the details involving the strikes. After the Post initially reported on his order, Hegseth denied the story, saying, “This entire narrative is completely false.” He later acknowledged the strikes but shifted responsibility for them to Bradley. The White House also confirmed the second military strike on the vessel on Monday. \n\n“I think Hegseth can come in and testify under oath what the orders are,” Sen. Rand Paul (R-Ky.) told reporters on Tuesday, adding that there are “real questions” about what the secretary knew about the incident. “He’s saying it didn’t happen, and now on Monday, [the White House is] saying it happened.”\n\nThe Senate Armed Services Committee ― led by Sen. Roger Wicker (R-Miss.) and Sen. Jack Reed (D-R.I.) – is leading a probe into the boat strikes. Republican members on the committee said they would interview those involved, likely in a classified setting and not before the public. \n\n“If he didn’t authorize this... we need to know that. We need to know what’s what,” Justice added in an interview with HuffPost, calling the second strike on defenseless targets “unacceptable.”\n\nAsked if he had confidence in Hegseth, Sen. Thom Tillis (R-N.C.), a member of the Senate Armed Services Committee, said, “right now” he did. \n\n“But we’re looking at more data,” he added.","url":"https://www.huffpost.com/entry/venezuela-boat-strike-hegseth_n_692f6443e4b0b66e5652adff?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/692f64bc19000062a86a0c1f.jpeg?ops=1778_1000","video":null,"publish_date":"2025-12-03 00:46:20","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"au","sentiment":-0.487},{"id":384438470,"title":"What to know about Trump Accounts: $1,000 newborn bonus and new $250 offer","text":"When the children of wealthy households leave the nest, they often benefit from their parents’ largesse in the form of a trust fund. Less affluent peers may receive nothing at all, or even be expected to support their families when they become adults.But what if all children, regardless of their family’s circumstances, could get a financial boost when they turn 18?That’s the idea behind “Trump Accounts,” a lesser-known provision of President Donald Trump’s tax legislation. The bill, signed into law earlier this year, gives USD 1,000 to every newborn, so long as their parents open an account. That money is invested in the stock market by private firms, and the child can access the funds when they turn 18. The parents of older children can also open accounts, but they won’t get the USD 1,000 bonus.Backers say it’s a way to bolster capitalism and help children from low-income households build wealth at a time when openly socialist candidates are growing more popular..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}The new programme gives the USD 1,000 bonus only to babies born during the calendar years of the Trump administration. Thanks to a historic donation announced Tuesday by billionaires Michael and Susan Dell, some children 10 and under could receive USD 250 in seed money if their parents open an account. That money is reserved for kids who live in ZIP codes with a median family income of USD 150,000 or less and who won’t get the USD 1,000 seed money from the Treasury.Here’s what you need to know about Trump Accounts and how to claim them.WHAT IS A TRUMP ACCOUNT?It’s new savings tool where money is invested in the stock market on behalf of a child. The child can’t access the money until they turn 18 and can only use it for specific purposes, such as paying tuition, starting a business or making a down payment on a home.After a parent opens an account, the US Treasury will contribute USD 1,000 for newborns. Private banks and brokerages will manage the money, which must be invested in US equity index funds that track the stock market and charge the accounts no more than 0.10 per cent in annual fees.Parents can contribute up to USD 2,500 annually in pretax income, much like they do for retirement accounts. Parents’ employers, relatives, friends, local governments and philanthropic groups can also pitch in. Yearly contributions are capped at USD 5,000, but contributions from governments and charities don’t count toward that total.WHO GETS USD 1,000?To qualify for the USD 1,000 seed money, a baby must be a US citizen, have a Social Security number and be born between Jan. 1, 2025, and Dec. 31, 2028. Any parent can open an account for a qualifying child, regardless of the parent’s immigration status.It’s important to note that the child won’t be able to access the money until they turn 18, except in rare circumstances, so it can’t help with immediate expenses. And disbursements from the accounts will be subject to taxes.WHAT ABOUT OLDER CHILDREN?Children born before 2025 won’t qualify for the $1,000 incentive, but parents can still open accounts for them as long as they’re under 18. Parents can still invest up to USD 2,500 pretax for those kids, and they may benefit from the Dells’ donation, giving USD 250 to children 10 and under in certain ZIP codes.HOW DO I OPEN A TRUMP ACCOUNT FOR MY KIDS?The accounts won’t be open for contributions until July 2026. But parents of eligible kids can sign up now by filling out Form 4547 from the Internal Revenue Service. As of Tuesday afternoon, that form was not yet available on the Trump Accounts website.In May, parents who sign up will get information about how to finish opening the accounts. Beginning in July, the White House says it will have a website where parents can register for the accounts.WHAT'S THE IDEA BEHIND THE ACCOUNTS?Backers of the accounts say they want to introduce more people to the stock market and give even children born into poverty a chance to benefit from it. They believe that giving every newborn USD 1,000 will help combat the rising popularity of socialism and offer more people the opportunity to build wealth. About 58% of US households held stocks or bonds in 2022, according to the US Securities and Exchange Commission, though the wealthiest 1 per cent owned almost half the value of stocks in that same year.Before Trump created the accounts, California, Connecticut and the District of Columbia were piloting “baby bonds” programs that are similar to Trump Accounts in some ways. Several other states, including Maryland, are weighing programs.But those programs are targeted for youth growing up in poverty or foster care, plus children who lost a parent to COVID-19. Wealthier children don’t benefit.They’re also managed by the state, not private investment firms.WHAT DO CRITICS SAY?Critics point out the accounts do little to help children in their early years, when they’re most vulnerable and most likely to be in poverty. They also say the accounts do little to offset the cuts the Trump administration and congressional Republicans have made to other programs that benefit young people and their families, including food assistance and Medicaid. Republicans created the accounts in the same Trump tax bill that reduced spending for some of those programs.And even with the contribution from the government, critics say the Trump Accounts will widen the wealth gap. Affluent families that can afford to make the maximum pretax contribution to the accounts will realize the greatest benefits. Poor families who can’t afford to set aside money for the accounts will benefit the least. Assuming a 7 per cent return, the USD 1,000 in seed money would grow to roughly USD 3,570 over 18 years.- EndsPublished By: Aashish VashisthaPublished On: Dec 3, 2025Must Watch","url":"https://www.indiatoday.in/world/us-news/story/what-to-know-about-trump-accounts-1000-newborn-bonus-and-new-usd-250-offer-glbs-2829716-2025-12-03","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202512/donald-trump-274356488-16x9_0.jpg?VersionId=RwMr_.xJCswXWd_Zo9JrhJspovn.nvOT?size=1280:720","video":null,"publish_date":"2025-12-03 00:45:40","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.204},{"id":384442748,"title":"Justice Department expands legal action against states that have refused its demands for voter data - AP News","text":"BOSTON (AP) — The Justice Department on Tuesday sued six more states in its ongoing campaign to obtain detailed voter data and other election information. \n\nThe department announced it was suing Delaware, Maryland, New Mexico, Rhode Island, Vermont and Washington over their “failure” to produce statewide voter registration lists. It has portrayed the litigation as part of an effort to ensure the security of elections, but Democratic officials have raised concerns over how the data will be used and whether the department will follow privacy laws in protecting it.\n\nTuesday’s actions bring to at least 14 the number of states the Justice Department has sued in its quest for the voter information.\n\n“Our federal elections laws ensure every American citizen may vote freely and fairly,” said Assistant Attorney General Harmeet Dhillon of the department’s Civil Rights Division. “States that continue to defy federal voting laws interfere with our mission of ensuring that Americans have accurate voter lists as they go to the polls, that every vote counts equally, and that all voters have confidence in election results.”\n\nThe department has requested the voter data from at least 26 states, according to an Associated Press tally. It’s prompted concerns among some election officials because states have the constitutional authority to run elections and federal law protects the sharing of individual data with the government.\n\nIt also signals the transformation of the Justice Department’s involvement in elections under President Donald Trump.\n\nMany requests included basic questions about the procedures states use to comply with federal voting laws, such as how they identify and remove duplicate voter registrations or deceased or otherwise ineligible voters. Certain questions were more state-specific and referenced data points or perceived inconsistencies from a recent survey from the U.S. Election Assistance Commission.\n\nSome states have sent the department redacted versions of their voter lists, which in many cases are also available to the public. But the Justice Department also has requested copies that contain personally identifiable information, including voters’ names, birth dates, addresses and driver’s license numbers or partial Social Security numbers.\n\nRhode Island Attorney General Attorney Peter Neronha said his office was aware of the lawsuit and called it the “latest example of the weaponization of the Department of Justice to further the Trump administration’s unlawful whims.”\n\n“We stand with and will defend the secretary, and win, because lawsuits concerning lawful conduct are largely unsuccessful,” Neronha said. “But I’m not surprised that this administration is confused about what it means to behave lawfully.”\n\nThe Justice Department’s actions come alongside Trump’s push to investigate the 2020 election, which he lost to Democrat Joe Biden, and influence the 2026 midterms.\n\nAt the same time, voting rights groups have sued the administration, arguing that recent updates to a federal tool for verifying citizenship could result in voters being unlawfully purged from voter lists.\n\nLast month, 10 Democratic secretaries of state asked the Trump administration to provide more information about its wide-ranging efforts to seek the statewide voter registration lists. They cited concerns that federal agencies have apparently misled them and might be entering the data in a program used to verify U.S. citizenship.","summary":"Justice Department expands legal action against states that have refused its demands for voter data  AP News","url":"https://apnews.com/article/justice-department-voter-data-lawsuit-states-6ab981efaccf7bdca3eb96d08bd48edd","image":"https://dims.apnews.com/dims4/default/e0a12eb/2147483647/strip/false/crop/7777x5185+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F8c%2F4b98a55d57a4f75229610f503a31%2Fd2db79c5bb2e4a7597e3c1f2dd5bf410","video":null,"publish_date":"2025-12-03 00:45:00","author":"Michael Casey","authors":["Michael Casey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.364},{"id":384438468,"title":"Watch: Trump appears to fight sleep during marathon Cabinet meeting","text":"In a three-hour Cabinet meeting on Tuesday, US President Donald Trump appeared to nearly fall asleep multiple times. Cameras captured the 79-year-old president narrowing his eyes repeatedly, and at one point closing them fully, even as Cabinet members praised their performance and his leadership.During US Secretary of State Marco Rubio's remarks, Trump closed his eyes for several seconds before leaning forward and responding to the presentation.His tired appearance came after a busy day in the office. Hours before the meeting, Trump posted more than 160 items on Truth Social between 7 pm (local time) and midnight on Monday. He resumed posting shortly before 6 am on Tuesday..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}Asked about the president's visible exhaustion, the White House sent a statement from press secretary Karoline Leavitt, who defended Trump's performance.\"President Trump was listening attentively and ran the entire three-hour marathon Cabinet meeting,\" Leavitt said in a statement to the Daily Mail.\"In all of these historic meetings, the President and his incredible team highlight the exhaustive list of accomplishments they have delivered on behalf of the American people to Make America Great Again,\" Leavitt added.TIRED MOMENTS REIGNITE OLD QUESTIONSTrump has previously faced scrutiny for his health. Last year he denied multiple media reports that he had dozed off during his criminal trial in New York. The New York Times wrote then that \"Mr Trump appeared to nod off a few times, his mouth going slack and his head drooping onto his chest.\" Trump dismissed the reports.\"Contrary to the FAKE NEWS MEDIA, I don't fall asleep during the Crooked DA's Witch Hunt,\" he wrote in May 2024. \"I simply close my beautiful blue eyes, sometimes, listen intensely, and take it ALL in!!!\"Trump, the oldest person ever elected president, has rejected recent reporting on his adjusted schedule during his second term. A New York Times story claimed the president had cut back public events and that \"his battery shows signs of wear\". Trump called the piece a \"hit job\".\"There will be a day when I run low on Energy but with a PERFECT PHYSICAL EXAM AND A COMPREHENSIVE COGNITIVE TEST it certainly is not now!\" he wrote.The focus on Trump's age and endurance has sharpened due to his frequent attacks on former President Joe Biden, whom he calls \"Sleepy Joe\". Last month, after photos circulated of Trump closing his eyes during an Oval Office announcement, he again targeted Biden.\"He sleeps all the time -- during the day, during the night, on the beach,\" Trump said, adding: \"I'm not a sleeper.\"On Monday, the White House also released an update on Trump's health, providing a detailed assessment of his recent medical scan. Press secretary Karoline Leavitt said a recent MRI was preventive in nature and showed the 79-year-old president in excellent cardiovascular condition.- EndsPublished By: Satyam SinghPublished On: Dec 3, 2025Tune InMust Watch","url":"https://www.indiatoday.in/world/us-news/story/donald-trump-nods-off-cabinet-meeting-glbs-2829714-2025-12-03","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202512/trump-033048230-16x9_0.jpg?VersionId=IeYZ0.tJs5B6JSIBqATcWFnW8djHjCkf?size=1280:720","video":null,"publish_date":"2025-12-03 00:41:27","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","source_country":"in","sentiment":-0.127},{"id":384439574,"title":"The North must own its problem, by Rotimi Fasan","text":"The Northern Governors Forum, together with traditional rulers from the North, rose from a meeting convened in Kaduna on Monday this week with a major resolution: that a centralised police system is no longer workable for Nigeria in view of the mounting security challenges facing the country. The meeting followed a similar one held by their Southern counterparts in Ogun State last week. These meetings are the responses from Nigeria’s political elites to the designation of Nigeria as a Country of Particular Concern by the American Government, the threat of military invasion by President Donald Trump and the series of apparently orchestrated attacks on churches and girls’ schools in the Northern part of the country. \n\nFrom the Bola Tinubu administration to the Southern Governors Forum and the Northern Governors Forum, it has taken nothing less than the intervention of the Americans and their threat of violence to awaken our typically phlegmatic, unresponsive and tone-deaf leaders, both political and religious. \n\nThe insult-laced tweet that did the magic was well-timed. It has had an effect that 25 years of post-military governance, that’s a quarter of a century of politicking, horse trading and appeasement, has failed to have. The latest gathering of the Northern political elite was not the first time it would reach the resolution that a decentralised police system is the option Nigeria must embrace if she is not to be left behind by modernity in matters of crime management, prevention and detection. But such resolutions were not meant to be seen as anything beyond lip service, at best a policy statement, to perpetually keep in abeyance any serious action on the restructuring of our freak federation. It was about this time last year that all but one of the 36 state governors agreed to the idea of a decentralised police. \n\nOne of the leaders at the Kaduna meeting admitted that in May this year leaders from the region decided it was time for what has been frequently described as state police. We all knew that was another attempt at doublespeak, something most Northern politicians are adept at, once conversation turns to the question of devolution of powers to the sub-national units of this country. Such discussions are bad news for most of them even as they speak in the name of the North and come to 21st century reflections on Nigeria’s problems with the mindset of the 20th century. They suffer from a hangover that has its roots in the regimented reflexes of the military era. All for their self-interest. There are, of course, political journeymen from other regions, like the current Inspector General of Police, Kayode Egbetokun, who takes the few years he is to spend in office as IG for eternity and thus opposes the establishment of state police. \n\nYet, it is remarkable that the lone voice opposed to the idea of state police from among the Northern power elite is the very one any reasonable person would expect to be the first to support it: Babagana Zulum, the Governor of Borno State. It is a measure of the kind of strange politics that Northern politicians play that it’s this same man that has been frequently applauded for his proactive responses to the disaster brought upon his state by insecurity, an epicentre of Boko Haram insurgency- it is worse than outrageous that Zulum is that lone voice in the wilderness raging against the re-emergence of a decentralised police system, similar to what was in place before the military found its way into politics. \n\nBabagana Zulum is not simply speaking for himself. His is a regional position that is disguised as personal. All he needs to do is to repeatedly parrot his opposition like a talismanic mantra while diluting discussions around the issue of state police. Others from the North only need such contrary claims to create doubt about the establishment of state police or say there is no consensus about it. It’s the same way that many of them said they had no idea of what their Southern counterparts meant when they talked about the restructuring of the country. \n\nAt one point, Babagana Zulum’s rejection of state police seemed like an expression of his displeasure at the perceived marginalisation of his political leader, Vice President Kashim Shettima, in the present administration. Some who appear sympathetic to his cause said he has been reduced to attending low grade events on behalf of President Bola Tinubu. An objective assessment will show that he has been comparatively more visible than Yemi Osinbajo was under President Muhammadu Buhari. My point is that Zulum was being a lackey of the North when he stood against state police. As Sani Yerima was when he came up with the idea of shari’a in the early years of our latest return to elective governance. \n\nThe Northern establishment, an alignment of its political and religious leaders, continues to act as one and speak as one in its stand against any meaningful transformation of the political structure of this country in a manner that can and will, indeed, be beneficial to every section. The voice of those seeking genuine change from that part of the country is that of a minority that is, hopefully, getting more influential. Otherwise, what we see and which has been obvious for decades is the continued misuse of religion and the weaponisation of poverty among a huge population of vastly young people who have been deliberately left untrained and uneducated (except in the Islamic religion), but available to be deployed for political purposes by players within and outside the Nigerian national space. This huge but untrained population that was cultured across decades of post-independence politics has now transformed into the murderous machinery of insurgency and banditry that is troubling all of us today.\n\nAnd in all of this, the Northern political establishment is still in denial and unwilling to take responsibility for the monster it mostly created. \n\nIt has outsourced its responsibility in that regard as it points its fingers elsewhere. They are nationalising a problem their lack of foresight created. It’s been decades since Chief Obafemi Awolowo warned that the North was creating a problem for the future by its failure to democratise Western-style education. He made it clear that the children of the talakawa they were refusing to train would make peace impossible for the children of the rich. That was neither a curse nor a prophecy. Just plain common sense that some refused to heed. We are at that point that Awo warned about and those responsible for this or their children are still not ready to own up to their errors. This is why Shehu Sani is the latest one hitting the hammer where the nail is by urging them to face up to their mess","url":"https://www.vanguardngr.com/2025/12/the-north-must-own-its-problem-by-rotimi-fasan/","image":"https://cdn.vanguardngr.com/wp-content/uploads/2022/03/Rotimifa-e1699421741446.jpg","video":null,"publish_date":"2025-12-03 00:41:00","author":"Emmanuel Okogba","authors":["Emmanuel Okogba"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.148},{"id":384437150,"title":"US lawmakers, Nigerian Reps hold fresh sessions over rising insecurity","text":"Committees of the United States Congress on Tuesday in Washington DC held a joint briefing over the ongoing kidnappings and the alleged persecution of Christians in Nigeria.\n\nThe session was held at the instance of President Donald Trump, who earlier on October 31 instructed the House Appropriations Committee to investigate what he described as the slaughter of Christians in Nigeria and report their findings to the White House.\n\nSeparately, the Nigerian House of Representatives will also debate the state of security in the country on Wednesday (today).\n\nThe Congress session, led by House Appropriations Vice Chair and National Security Subcommittee Chairman Mario Díaz-Balart, brought together members of the House Appropriations and House Foreign Affairs Committees alongside religious freedom experts.\n\nParticipants included Reps Robert Aderholt, Riley Moore, Brian Mast, Chris Smith, US Commission on International Religious Freedom Chair Vicky Hartzler, Alliance Defending Freedom International’s Sean Nelson, and Dr Ebenezer Obadare of the Council on Foreign Relations.\n\nDíaz-Balart began the briefing by describing global religious freedom as “both a moral obligation and an essential American interest.” He emphasised that “no one should have to fear for their safety because of how they choose to worship.”\n\nHe said he is “committed to advancing policies that protect the freedom to live according to one’s faith without fear of violence and retribution.”\n\nDíaz-Balart noted that his FY26 funding bill addresses this commitment and added that he plans to reinforce these efforts by passing a full-year funding measure, which he noted is critical to advancing the America First agenda.\n\nAderholt echoed the same concerns, calling the situation in Nigeria “a crisis that can’t be ignored.”\n\nHe said, “We must stand firmly with Nigeria’s Christian communities and all persecuted believers worldwide, and I commend our collaborative efforts to provide the President with the information needed to confront this growing tragedy.”\n\nMoore connected the briefing to the administration’s recent re-designation of Nigeria as a Country of Particular Concern.\n\nThe Congressman explained, “Our brothers and sisters in Christ are being persecuted and slaughtered in Nigeria simply for professing their faith in our Lord and Saviour Jesus Christ. ‘’The world will no longer turn a blind eye to the persecution of Christians in Nigeria.”\n\nForeign Affairs Committee Chairman Mast framed the violence as part of a broader campaign.\n\n“This is a targeted campaign of religious cleansing,” he said, arguing that extremist groups aim to “drive Christians out of their ancestral lands in the Middle Belt.”\n\nHe urged the Nigerian government to “disarm these militias, return displaced families to their homes, and bring the perpetrators to justice.”\n\nIn his remarks, House Foreign Affairs Africa Subcommittee Chairman Smith described Nigeria as “the ground zero of religious violence,” saying Christians and moderate Muslims face “the constant threat of murder, rape, and torture.”\n\nHe criticised the Nigerian government for allowing perpetrators to act “with complete impunity,” adding, “We must act quickly and decisively to save more lives.”\n\nExpert witnesses described an atmosphere of insecurity affecting multiple religious communities.\n\nHartzler cited recent attacks, including the November abduction of more than 300 children and 12 teachers from a Catholic school. “Religious freedom in Nigeria has been under siege in 2025 and, unfortunately, it seems to be getting worse,” she said.\n\nThe USCIRF chair called for improved accountability from the Nigerian authorities and better use of US security assistance and early warning systems. “Too many times, local villagers learn of an impending attack and reach out for protection, only to have their cries for help ignored,” she said.\n\nNelson detailed accounts from Christian communities, who described kidnappings, forced conversions, and deadly attacks.\n\n“Our cases have involved Christians unjustly imprisoned by Sharia courts, false allegations of crimes merely for evangelism or protecting Christian converts; Christians kidnapped and tortured. I have visited villages directly attacked by Fulani militants and witnessed the aftermath of pastors beheaded, mass graves, widows and orphans,” he said.\n\nHe argued that authorities downplayed the role of religion in the attacks and highlighted Nigeria’s blasphemy laws, which in some states permit the death penalty.\n\nAlso, Obadare identified Boko Haram as the central driver of the violence. “The deadliest and most serious threat confronting the Nigerian state today is jihadist terror,” he insisted.\n\nHe noted recent Nigerian military actions following renewed US pressure, but urged Washington to maintain leverage.\n\n“The policy goal should be two-fold: first, work with the Nigerian military to neutralise Boko Haram. Second, the United States should put pressure on President Tinubu to make Sharia law unconstitutional in the 12 Northern states where it has been adopted since 2000 and disband the various Hisbah groups.”\n\nCommittee officials said they are preparing a comprehensive report for President Trump with recommendations on how Congress can support the administration’s efforts to curb religious persecution in Nigeria and elsewhere.\n\nThe briefing comes amid strengthened US–Nigeria security cooperation. President Bola Tinubu recently approved Nigeria’s delegation to the new US–Nigeria Joint Working Group, established to implement security agreements from high-level talks in Washington led by National Security Adviser Nuhu Ribadu.\n\nThe group, which includes senior ministers and security officials, aims to enhance counterterrorism efforts, intelligence sharing, border security, and coordination on humanitarian and civilian security issues.\n\nThe initiative followed rising concerns over terrorism, banditry, and targeted attacks on Christians in Nigeria, prompting increased US scrutiny and warnings about the protection of vulnerable faith communities.\n\nOn November 20, the US House Subcommittee on Africa opened a public hearing to review Trump’s recent redesignation of Nigeria as a Country of Particular Concern, a move that places the country under increased scrutiny for alleged religious-freedom violations.\n\nLawmakers gathered to assess the potential consequences of the designation, which, if affirmed by the Senate, could clear the way for sanctions against Nigerian officials found complicit in religious persecution.\n\nMeanwhile, the House of Representatives is expected to begin debate on the state of security in the country on Wednesday (today).\n\nThe Deputy Speaker, Benjamin Kalu, disclosed this on Tuesday while presiding over the day’s plenary.\n\nAlso, the member representing Darazo/Ganjuwa Federal Constituency, Bauchi State, Mansur Soro, told The PUNCH that the report on the state police bill will be laid at a plenary session this month.\n\nSoro, a member of the committee, stated this in an interview with our correspondent in Abuja.\n\nThe committee recently had its last meeting and tasked the 36 State Assemblies to make their input on the various items slated for constitutional amendments, including power devolution, state police, reserved seats for women, and fiscal federalism, among others.\n\nSpeaking with our correspondent, Soro said, “The reports are expected to be laid this month for voting at both the Senate and House of Representatives.\n\n“Already, the state police bill has been adopted by the Joint Committees on Constitution Review of both chambers. After the voting, the bill will be transmitted to state Assemblies for ratification.”\n\nHe added that “If it’s passed by two-thirds of state assemblies, it will be transmitted to the President for his assent.”\n\nIn a separate interview with The PUNCH, the member representing Esan West/Esan Central/Igueben Federal Constituency, Edo State, Marcus Onobun, pledged his support for state police, citing the worsening insecurity across the country.\n\nHe said, “The call for state police has become not just a political conversation but a national necessity. The reality is that insecurity has evolved far beyond what a centrally controlled police structure can effectively manage. Criminality today is highly localised, and the response must equally be localised.”\n\nAccording to Onobun, “State police will allow governors who are constitutionally the chief security officers of their states to take direct responsibility for security. They understand the unique security dynamics, terrain, culture, and challenges of their communities far better than a distant federal command can.\n\n“With proper legal safeguards, clear accountability frameworks, and federal oversight to prevent abuse, state police can become a powerful instrument for rapid response, intelligence gathering, and community-driven policing.”\n\nHe added that “Countries with successful security models rely on decentralised policing. Nigeria cannot continue using a one-size-fits-all approach for a population of over 200 million people. Empowering states will strengthen, not weaken, the federation.”\n\nWhile urging quick action on a legislative framework to birth a decentralised policing model, the Edo lawmaker said, “The question is no longer whether we should establish state police, but how quickly we can put the right structures in place to make it work.\n\n“Nigerians deserve a policing system that is close to the people, responsive, adequately funded, and effective. State police is a critical step toward achieving that.”\n\nAlso supportive of state policing is the Chairman, Public Accounts Committee of the House of Representatives, Bamidele Salam.\n\nSalam, who represents Ede North/Ede South/Ejigbo/Egbedore Federal Constituency, Osun State, said, “I have always been in support of having states and even local government police.”\n\nTinubu meets service chiefs\n\nPresident Bola Tinubu on Tuesday held a closed-door meeting with Service Chiefs and heads of security agencies at the Aso Rock Presidential Villa, Abuja.\n\nThe security chiefs were spotted arriving at the forecourt of the Villa at about 04:30 pm.\n\nTuesday’s meeting was held barely three hours after Tinubu nominated the former Chief of Defence Staff, Gen. Christopher Musa (retd.), as Minister of Defence.\n\nThe Minister of Defence, Abubakar Badaru, had resigned his appointment on Monday night, hours after Musa was spotted at the Villa.\n\nThe security heads were led to the meeting by the Chief of Defence Staff, General Olufemi Oluyede.\n\nAlso present are the Chief of Army Staff, Lt. General W. Shaibu, Chief of Air Staff, Air Vice Marshal Sunday Aneke, and Chief of Naval Staff, Vice Admiral I. Abbas.\n\nThe Chief of Defence Intelligence, Lt. General Akomaye Undiandeye, the Director-General, Department of State Services, Oluwatosin Ajayi, and the Inspector-General of Police, Kayode Egbetokun, were also in attendance.\n\nLast Wednesday, Tinubu declared a nationwide security emergency in the wake of a spate of abductions, announcing measures including the recruitment of 20,000 additional police officers, the deployment of forest guards, and tighter protection of schools, churches and mosques in vulnerable areas.\n\nOur correspondent also sighted the Abia State governor, Dr Alex Otti, arriving at the President’s office complex.\n\nOtti, dressed in a grey knee-length native attire, was carrying a file of documents.\n\nThe PUNCH could not confirm whether the governor was part of the security meeting or on a different visit.","summary":"US and Nigerian lawmakers hold sessions to address Nigeria&#8217;s rising insecurity, focusing on kidnappings and the alleged persecution of Christians.\n\nRead More: https://punchng.com/us-lawmakers-nigerian-reps-hold-fresh-sessions-over-rising-insecurity/","url":"https://punchng.com/us-lawmakers-nigerian-reps-hold-fresh-sessions-over-rising-insecurity/","image":"https://cdn.punchng.com/wp-content/uploads/2024/06/05144529/House-of-Reps-new-1200x630.webp","video":null,"publish_date":"2025-12-03 00:40:09","author":"House Appropriati,Punch Newspapers","authors":["House Appropriati","Punch Newspapers"],"language":"en","source_country":"ng","sentiment":0.121},{"id":384439300,"title":"What are the conditions Maduro offered Trump? The keys behind US president’s ultimatum","text":"What are the conditions Maduro offered Trump? The keys behind US president’s ultimatum\n\nAmid an unprecedented military buildup and the formal designation of Venezuela’s so-called Cartel of the Suns as a terrorist organization, US President Donald Trump said on Wednesday that Nicolás Maduro “will do it,” when asked whether the Venezuelan leader had offered to step down. At the same press conference, Trump announced that US ground operations against “narcoterrorists” in Venezuela would begin “very soon,” adding: “We know where they live. We know where the bad guys live.” His comments come as more details emerge of a phone call in which, according to Reuters and France 24, Maduro reportedly laid out specific conditions for leaving office.\n\nWhat Maduro reportedly put on the table\n\nAccording to four sources familiar with the Nov. 21 call, cited by Reuters and echoed by other international outlets, Maduro signaled that he was prepared to relinquish power, but only in exchange for a package of political and legal guarantees that Washington ultimately rejected.\n\nThose sources say Maduro made at least four key demands:\n\n- Full legal amnesty for himself and his family, shielding them from prosecution.\n\n- Closure of the International Criminal Court investigation into alleged crimes against humanity.\n\n- Lifting of US sanctions on roughly 100 Venezuelan officials accused of human rights abuses, drug trafficking or corruption.\n\n- An interim government led by Vice President Delcy Rodríguez before organizing new elections.\n\nThree of the sources described the proposal as an attempt to secure layered protection for Maduro and his inner circle, both inside Venezuela and abroad.\n\nRead also: Venezuela approves migrant repatriation flight from US despite Trump’s airspace closure claim\n\nTrump’s response: rejection and a deadline\n\nMost of those conditions were rejected by Trump during a roughly 15-minute conversation, according to Reuters and France 24. The US president instead offered Maduro safe passage out of Venezuela with his family, to Russia or another country of his choosing.\n\nRepublican Senator Markwayne Mullin, who sits on the Armed Services Committee, later told CNN that “we gave Maduro an opportunity to leave.” According to those accounts, Trump coupled the offer with a specific deadline: until Friday, Nov. 28, to step down.\n\nMaduro did not accept. After the deadline expired, Trump publicly declared Venezuelan airspace “closed in its entirety” and maintained the largest US military deployment in the Caribbean in decades, a move Caracas denounced as a violation of its sovereignty and a prelude to possible intervention.\n\nTerrorist designation and mounting military pressure\n\nThe exchange between the two leaders has unfolded alongside Washington’s political and military pressure campaign against the Venezuelan government. The United States has designated the Cartel of the Suns as a foreign terrorist organization and claims that Maduro and senior Venezuelan officers sit at the top of that network, which it accuses of moving drugs toward US territory.\n\nSince early September, the US military has been striking small boats in the Caribbean and eastern Pacific, describing them as drug-running “narco-boats” linked to Venezuelan criminal structures. At least 80 people have been killed in more than 20 strikes, according to US figures and media reports.\n\nLawmakers from both parties have called for investigations into one incident in particular, following a Washington Post report alleging that Defense Secretary Pete Hegseth verbally ordered a second strike on a vessel after surveillance showed two survivors following an initial missile attack. Democratic Senator Tim Kaine warned that, if confirmed, the incident “rises to the level of a war crime.”\n\nFew clear exits on a crowded chessboard\n\nAs the US deployment remains at peak levels and the White House weighs possible ground operations against “narcoterrorists,” the political pathways appear increasingly narrow. Analysts quoted by international outlets see at least four main scenarios: limited targeted strikes on Venezuelan soil, a negotiated transition, an internal split within the ruling elite, or a continuation of the current stalemate.\n\nIn Caracas, Maduro has publicly vowed “absolute loyalty” to the Venezuelan people and pledged to resist, while his government files complaints at international forums accusing Washington of seeking to “seize” the country’s oil reserves through military pressure. At the same time, Reuters reports that the Venezuelan government has requested another phone call with Trump, though it remains unclear whether the White House will agree to reopen that direct channel.\n\nFor Washington, a central question remains whether the primary goal is to weaken criminal networks it associates with the Cartel of the Suns or to force Maduro’s removal from power. For Caracas, the dilemma is whether to double down on total resistance or to explore a negotiated exit that does not amount to the unconditional surrender that, so far, the United States shows little sign of accepting.","summary":"Amid an unprecedented military buildup and the formal designation of Venezuela’s so-called Cartel of the Suns as a terrorist organization, US President Donald Trump said on Wednesday that Nicolás Maduro “will do it,” when asked whether the Venezuelan leader had offered to step down. At the same press conference, Trump announced that US ground operations against “narcoterrorists” in Venezuela would begin “very soon,” adding: “We know where they live. We know where the bad guys live.” His comments come as more details emerge of a phone call in which, according to Reuters and France 24, Maduro reportedly laid out specific conditions for leaving office.","url":"https://en.mercopress.com/2025/12/03/what-are-the-conditions-maduro-offered-trump-the-keys-behind-us-president-s-ultimatum","image":"https://en.mercopress.com/data/cache/noticias/108072/600x315/mad.jpg","video":null,"publish_date":"2025-12-03 00:39:00","author":"Vice President Delcy","authors":["Vice President Delcy"],"language":"en","category":"politics","source_country":"uy","sentiment":-0.153},{"id":384442050,"title":"Suspect in National Guard shootings pleads not guilty to murder and assault","text":"He kept shooting as they fell and then advanced toward a third Guardsman, who returned fire and brought him down. A supervising soldier reported hearing the gunman shout “Allahu Akbar!” during the burst of gunfire, prosecutors said.\n\nThe Guard members, a woman and a man assigned to a high-visibility deployment ordered by President Donald Trump, had little time to react before colleagues intervened.\n\nLakanwal’s background has drawn renewed scrutiny to the more than 190,000 Afghans admitted after the fall of Kabul, most of them evacuees who supported the U.S. war effort and were brought out with their families.\n\nTrump has seized on the case to argue that Afghan evacuees were allowed into the country without proper vetting, at one point holding up a photo of a crowded departure flight as he spoke to reporters on Thursday. He also described Lakanwal as having gone “cuckoo,” even as investigators continue to examine what may have motivated the attack.","url":"https://theprovince.com/news/world/suspect-in-national-guard-shootings-pleads-not-guilty-to-murder-and-assault/wcm/d4c0cec4-1040-48c5-8bd1-9ef0aae705c4","image":"https://smartcdn.gprod.postmedia.digital/theprovince/wp-content/uploads/2025/12/Rahmanullah-Lakanwal.jpg","video":null,"publish_date":"2025-12-03 00:37:04","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.505},{"id":384441848,"title":"‘We don’t want them’: Trump rages against Somali immigrants","text":"U.S. President Donald Trump raged on Tuesday (December 2, 2025) against Somali immigrants, saying they should be unwelcome in the United States as he highlighted the long woes of the African country.\n\nMr. Trump’s heated remarks come as a scandal unfolds in the state of Minnesota, where prosecutors say more than $1 billion went to non-existent social services, largely through false billing by Somali Americans.\n\nIn Somalia “they have no anything, they just run around killing each other,” Mr. Trump told a cabinet meeting.\n\n“Their country’s no good for a reason. Their country stinks, and we don’t want them in our country,” he said.\n\nMr. Trump has a long history of deriding minorities and rose to political prominence spreading false conspiracy theories that former president Barack Obama was born in Kenya rather than the United States.\n\nMr. Trump has often played up fears of the white majority of losing political and cultural power.\n\n“We’re at a tipping point,” Mr. Trump told the cabinet meeting.\n\n“We could go one way or the other, and we’re going to go the wrong way if we keep taking in garbage into our country.”\n\nMr. Trump said that Somali Americans “contribute nothing” and he berated Ilhan Omar, an outspoken Democratic congresswoman from Minnesota who is originally from Somalia.\n\n“Ilhan Omar is garbage. Her friends are garbage,” Mr. Trump said.\n\n“Let them go back to where they came from and fix it.”\n\nMr. Omar later wrote of Mr. Trump on X: “His obsession with me is creepy. I hope he gets the help he desperately needs.”\n\nMr. Trump last week ended protections against deportations of Somalis in place in the United States since 1991, when Somalia descended into anarchy.\n\nProsecutors are investigating several plots to steal taxpayer money in Minnesota, including by groups that falsely claimed to be feeding children during the Covid-19 pandemic.\n\nMinnesota, a historically Democratic-leaning state with a history of welcoming refugees, is home to a major Somali American community.\n\nThe scandal takes an added political dimension as Minnesota’s governor is Tim Walz, a Democrat who was the party’s unsuccessful candidate for vice president in last year’s election.\n\nLast week, Mr. Trump separately ordered a halt to all visa issuance to Afghans after a deadly shooting in Washington by an Afghan who worked for U.S. intelligence during the war and was granted asylum after the Taliban returned to power.","url":"https://www.thehindu.com/news/international/we-dont-want-them-trump-rages-against-somali-immigrants/article70351885.ece","image":"https://th-i.thgim.com/public/incoming/lu6hrd/article70351884.ece/alternates/LANDSCAPE_1200/Experts-work-onGBSF8FIG6.3.jpg.jpg","video":null,"publish_date":"2025-12-03 00:33:11","author":"Somali Americans","authors":["Somali Americans"],"language":"en","category":"politics","source_country":"in","sentiment":-0.431},{"id":384442488,"title":"Congressman Hits Out at ‘Sleepy Don’ After Snoozy Cabinet Meeting","text":"California Rep. Ted Lieu dug into his bag of Trumpisms to mock the president’s struggle to stay awake during Tuesday’s marathon Cabinet meeting. \n\n“Donald Trump is not fit to be President,” wrote Lieu, 56. “Sleepy Don can’t even stay awake at his own televised Cabinet meeting.”\n\nTrump, 79, appeared to have difficulty staying awake during the proceedings. He was photographed resting his head on his hand, rubbing his eyes and leaning back with his eyes closed as members of his Cabinet lavished him with praise. \n\nThe president’s struggle to listen to his Cabinet members orate comes on the heels of questions about his ability to meet the intense schedule the presidency demands. \n\nLast week, The New York Times published a report revealing how Trump has made significantly fewer public appearances in his second term, while starting the day at a cushy 10:30 a.m. This was after Trump barely stayed awake during a Nov. 7 Oval Office press conference in which one of the speakers collapsed to the floor.\n\nThe White House has insisted that Trump is full of energy, despite multiple videos showing him barely powering through public appearances. On Monday, one day before Trump nodded off during his Cabinet meeting, White House Press Secretary Karoline Leavitt called The New York Times report “fake news” while deflecting to criticism of Joe Biden, whom Trump had labeled “Sleepy Joe” on the campaign trail. \n\nDuring the same press briefing, Leavitt said Trump’s MRI, which occurred in October, was a “preventative” measure to check on his heart and abdominal health. Doctors have expressed doubt about the White House’s explanation, noting that it would be highly unusual for a person to undergo an MRI without presenting with signs of illness.\n\nLieu, a member of the Judiciary Committee and Foreign Affairs Committee, has been one of the Trump administration’s most prominent critics. In addition to his “Sleepy Don” dig, he slammed the president’s rant against affordability, which came as Trump delivered an irate, 30-minute rambling of his grievances during the meeting.","summary":"Andrew Harnik / Getty Images, Chip Somodevilla / Getty ImagesCalifornia Rep. Ted Lieu dug into his bag of Trumpisms to mock the president’s struggle to stay awake during Tuesday’s marathon Cabinet meeting. \n\n“Donald Trump is not fit to be President,” wrote Lieu, 56. “Sleepy Don can’t even stay awake at his own televised Cabinet meeting.”\n\nLieu reposted a trending clip of Trump struggling to keep his eyes open as Secretary of State Marco Rubio spoke next to him Tuesday afternoon. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/congressman-ted-lieu-hits-out-at-sleepy-don-after-snoozy-cabinet-meeting/","image":"https://www.thedailybeast.com/resizer/v2/J4V5QX3HZ5BKZHNUT2RM34NEHU.png?smart=true&auth=c2a1a5598a0faf63c73db744aa13f1955fae485c861b204053a7427117b30f82&width=1440&height=1080","video":null,"publish_date":"2025-12-03 00:32:38","author":"Adam Downer","authors":["Adam Downer"],"language":"en","source_country":"us","sentiment":0.021},{"id":384441670,"title":"Donald's sleepy Joe moment? Gavin Newsom shares video of Trump ‘sleeping’ in his cabinet meeting - watch","text":"Gavin Newsom on Wednesday shared a video from US President Donald Trump’s December 2 cabinet meeting, claiming the 79-year-old leader appeared to nod off as senior officials briefed him on key issues, including the Russia-Ukraine conflict.In the clip circulated by the California governor, Trump can be seen sitting with his eyes narrowed and at times fully shut while his secretary of state speaks beside him about how “he is the only leader who can help end” Russia-Ukraine war.News portal People also reported that during the three-hour meeting, the president appeared to close his eyes for several seconds, including during commerce secretary Howard Lutnick’s remarks, before leaning forward again.The visuals drew attention as Trump had posted more than 160 times on Truth Social the previous night between 7pm (local time) and midnight and was active again before 6am People reported this alongside past observations highlighted by The New York Times about Trump’s reduced public schedule and moments when “his battery shows signs of wear,” as noted in a recent NYT report.The White House rejected suggestions that the president had dozed off. Press secretary Karoline Leavitt said in a statement to People: “President Trump was listening attentively and running the entire three-hour marathon cabinet meeting,” before reiterating a new administration line regarding Somali immigrants in Minnesota. She added: “Just go back and watch his amazing final answer in the press conference… This epic moment put an exclamation point on President Trump’s ninth Cabinet meeting of his second term.”Last year, Trump similarly pushed back on reports that he had fallen asleep during his New York criminal trial, after multiple courtroom accounts - including one from The New York Times - described him with “his mouth going slack and his head drooping onto his chest.” He dismissed those descriptions, writing: “Contrary to the FAKE NEWS MEDIA, I don’t fall asleep during the Crooked DA’s Witch Hunt… I simply close my beautiful blue eyes, sometimes, listen intensely, and take it ALL in!!!”Trump has often mocked former president Joe Biden as “Sleepy Joe,” and last month criticised Biden again while images of Trump with closed eyes during an Oval Office announcement went viral. “He sleeps all the time… I’m not a sleeper,” Trump said at the time, while meeting Saudi crown prince Mohammed bin Salman.Amid questions about age and stamina, Trump recently pointed to a “PERFECT PHYSICAL EXAM AND A COMPREHENSIVE COGNITIVE TEST ('That was aced')” which he said he had taken recently, responding to NYT reporting on his routine.","url":"https://timesofindia.indiatimes.com/world/us/donalds-sleepy-joe-moment-gavin-newsom-shares-video-of-trump-sleeping-in-his-cabinet-meeting-watch/articleshow/125730929.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-125730933/125730933.jpg","video":null,"publish_date":"2025-12-03 00:31:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.172},{"id":384440972,"title":"South Korea's Lee says martial law clean-up not yet complete on first anniversary","text":"SEOUL, Dec 3 (Reuters) - South Korean President Lee Jae Myung said on Wednesday there was still work left to deal with the fallout of the failed martial law bid one year ago and ensure the perpetrators are brought to justice.\n\nThe attempt to impose martial law by former President Yoon Suk Yeol threatened to deal an irreparable setback to the country, but the people rose up and stopped the military with their bare hands, Lee said in an address marking the first anniversary of the shock announcement by his predecessor.\n\n\"The recklessness of those who tried to destroy the constitutional order and even plan a war all for their personal ambition must be brought to justice,\" he said.\n\nYoon's martial law declaration plunged a country that had been celebrated as one of the success stories of democratic resilience into months of political turmoil just as U.S. President Donald Trump's moves to slap tariffs on global trading partners rattled South Korea, an export-heavy economy.\n\nYoon was later ousted and Lee, a political rival who lost to Yoon in 2022, won a snap election in June with a mandate to steer the country out of the shock of martial law, as those who were accused of being involved were arrested and tried for subversion. \n\nLee said he will propose designating December 3 a national holiday to celebrate the role of the people in quelling the martial law bid and that they deserved to be considered for the Nobel Peace Prize. \n\n (Reporting by Jack Kim, Ju-min ParkEditing by Ed Davies)","url":"https://www.thestar.com.my/news/world/2025/12/03/south-korea039s-lee-says-clean-up-after-martial-law-not-yet-complete-in-one-year-address","image":"https://apicms.thestar.com.my/uploads/images/2025/12/03/3652432.jpg","video":null,"publish_date":"2025-12-03 00:31:00","author":"The Star Online","authors":["The Star Online"],"language":"en","source_country":"my","sentiment":-0.505},{"id":384439592,"title":"Putin Asserts Russia’s Readiness for Conflict Amidst Europe Tensions Ahead of Crucial Ukraine Negotiations","text":"US negotiators Jared Kushner and Steve Witkoff met with Russian President Vladimir Putin at peace talks in Moscow.\nThe initial US plan drew strong criticism from Ukraine and European allies for appearing too favourable to Russia.\nUkrainian President Volodymyr Zelenskyy insists any agreement must end the war completely and not merely pause hostilities.\n\nTop US negotiators aiming to end the war in Ukraine have met with Russian President Vladimir Putin in a high-stakes meeting in Moscow.\n\nPutin, who received Donald Trump’s son-in-law Jared Kushner and US special envoy Steve Witkoff in the Kremlin, signalled earlier that his forces were ready to fight on to achieve Russia’s initial war goals.\n\nJust before the meeting, Putin warned Europe that it would face swift defeat if it went to war with Russia, and he dismissed European counter-proposals on Ukraine as being absolutely unacceptable to Russia.\n\n“They are on the side of war,” Putin said of the European powers. \n\nPutin said Russia did not want war with Europe, but that if Europe started one, it would end so swiftly that there would be no one left for Russia to negotiate with.\n\nThe meeting is a crucial moment for Ukraine in what could be a fraught week following days of frantic diplomacy kicked off by a unilateral US plan to bring peace, which has since been revised under pressure from Ukraine and its European backers.\n\nUkrainian President Volodymyr Zelenskyy said on Monday that any plan must end the war for good, and not just lead to a pause in the fighting that began with Russia’s invasion in February 2022.\n\nThe Trump administration has said it is “optimistic” it can help end Europe’s bloodiest conflict since World War Two.\n\nKushner and Witkoff were to present Putin with the new version of the US plan, which has been hammered out after the initial version raised fears in Ukraine that it made too many concessions to Russia.\n\nAfter their Moscow visit, Kushner and Witkoff could go on to meet a Ukrainian delegation as soon as Wednesday, potentially in Brussels, a senior Ukraine official told AFP.\n\n“Our common task is to end the war, not just to achieve a pause in hostilities,” Zelenskyy said, adding: “A dignified peace is needed.”\n\nPutin, however, appeared to send a hawkish message shortly before the US talks started.\n\nEuropean powers are worried that the US and Russia could strike a deal over their heads or force Ukraine into making unfair concessions.\n\nBloomberg last month reported on an audio recording showing that Witkoff helped coach Russian officials on how Putin should speak to Trump.\n\nZelenskyy has said he expects to discuss key issues with Trump, including on territory, and suggested Russia’s real motivation for the US talks was to ease Western sanctions.","summary":"Internewscast Journal\n\nInternewscast\n\n\nKey Points US negotiators Jared Kushner and Steve Witkoff met with Russian&#8230;\n\n\nThis Post: Putin Asserts Russia&#8217;s Readiness for Conflict Amidst Europe Tensions Ahead of Crucial Ukraine Negotiations first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/putin-asserts-russias-readiness-for-conflict-amidst-europe-tensions-ahead-of-crucial-ukraine-negotiations/","image":"https://images.sbs.com.au/dims4/default/44146a0/2147483647/strip/false/crop/4716x2167+0+438/resize/1234x567!/format/jpeg/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fa8%2Fa5%2Ff4c227bc470a835579d76a151a65%2F20251203155970393416-origin","video":null,"publish_date":"2025-12-03 00:30:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.322},{"id":384443102,"title":"Beijing woos foreign firms as China seeks bigger role in global shipbuilding supply chain","text":"Beijing is extending an olive branch to overseas companies as it seeks to build a more integrated global supply chain for the shipbuilding industry, in its latest push to project goodwill and support free trade.\nGao Dongsheng, chief economist at the Ministry of Industry and Information Technology (MIIT), said on Tuesday that China was committed to further opening up its shipbuilding sector.\nMainland shipyards, which currently have a capacity to build about 65 million deadweight tonnes of large vessels a year, were expected to command around 65 per cent of the global shipbuilding market this year, according to industry officials.\nThe MIIT would “support a globalised layout of the [shipbuilding] industry and a reasonable distribution of the industrial chain,” Gao told a forum at Marintec China, the world’s largest maritime conference and exhibition. “Foreign companies and research institutions are encouraged to invest and form partnerships in China.”\n\nHe added that Chinese firms would seek deeper collaboration with foreign partners to accelerate the use of artificial intelligence and new-energy technologies in next-generation vessels.\nChina’s overwhelming lead in shipbuilding has put the sector squarely on the radar of US President Donald Trump, who has vowed to spend tens of billions of US dollars rebuilding US maritime capacity.\nMa Yunxiang, assistant president of China State Shipbuilding Corp (CSSC) – the world’s largest shipbuilding conglomerate, with about one-third of the global market – told a media briefing that global shipping companies were increasingly willing to place orders in China as they recognised the sector’s manufacturing strength.\n“Chinese shipyards enjoy production and cost advantages over international rivals,” said Xiong Hao, assistant general manager at Shanghai Jump International Shipping. “But an efficient and evenly distributed international supply chain will benefit the entire shipbuilding industry, because China still needs key components from abroad to assemble large vessels.”\nChina’s reliance on imported parts, however, remains significant.\nIn 2023, Zhou Xi, deputy general manager of Shanghai Waigaoqiao Shipbuilding, a CSSC unit, told the Post that only about 40 per cent of the parts used in the Adora Magic City, China’s first domestically built cruise ship, were sourced from mainland suppliers.\nHe said the 323-metre-long vessel required around 20 times more worker hours to build than a capesize bulk carrier, one of the largest classes of cargo ships.\nCSSC plans to broaden its portfolio by building more cruise liners, deep-ocean drilling vessels and nuclear-powered ships, Ma said.\nAdora Flora City, China’s second domestically built cruise ship, was scheduled for delivery next year and was expected to showcase further improvements in local shipbuilding capabilities, he added.\nCSSC also delivered the country’s first deep-ocean drilling ship, Mengxiang – meaning “Dream” in Chinese – late last year. The vessel can operate in extreme wind conditions and drill to depths of up to 11,000 metres.\nShipbuilding is one of 10 core sectors identified in Beijing’s Made in China 2025 industrial strategy, which aims to help the country close the gap with global leaders in areas including robotics, semiconductors and new-energy vehicles.\nMarintec China, which runs until Friday in Shanghai, has attracted an unprecedented 2,200 exhibitors from around the world this year.","url":"https://www.scmp.com/business/china-business/article/3334950/beijing-woos-foreign-firms-china-seeks-bigger-role-global-shipbuilding-supply-chain?module=top_story&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/02/c2997c50-d396-4d9a-81b9-048609c0164d_a06d0c72.jpg","video":null,"publish_date":"2025-12-03 00:30:09","author":"Daniel Ren","authors":["Daniel Ren"],"language":"en","category":"politics","source_country":"hk","sentiment":0.154},{"id":384443104,"title":"Beijing woos foreign firms as China seeks bigger role in global shipbuilding supply chain","text":"Beijing is extending an olive branch to overseas companies as it seeks to build a more integrated global supply chain for the shipbuilding industry, in its latest push to project goodwill and support free trade.\nGao Dongsheng, chief economist at the Ministry of Industry and Information Technology (MIIT), said on Tuesday that China was committed to further opening up its shipbuilding sector.\nMainland shipyards, which currently have a capacity to build about 65 million deadweight tonnes of large vessels a year, were expected to command around 65 per cent of the global shipbuilding market this year, according to industry officials.\nThe MIIT would “support a globalised layout of the [shipbuilding] industry and a reasonable distribution of the industrial chain,” Gao told a forum at Marintec China, the world’s largest maritime conference and exhibition. “Foreign companies and research institutions are encouraged to invest and form partnerships in China.”\n\nHe added that Chinese firms would seek deeper collaboration with foreign partners to accelerate the use of artificial intelligence and new-energy technologies in next-generation vessels.\nChina’s overwhelming lead in shipbuilding has put the sector squarely on the radar of US President Donald Trump, who has vowed to spend tens of billions of US dollars rebuilding US maritime capacity.\nMa Yunxiang, assistant president of China State Shipbuilding Corp (CSSC) – the world’s largest shipbuilding conglomerate, with about one-third of the global market – told a media briefing that global shipping companies were increasingly willing to place orders in China as they recognised the sector’s manufacturing strength.\n“Chinese shipyards enjoy production and cost advantages over international rivals,” said Xiong Hao, assistant general manager at Shanghai Jump International Shipping. “But an efficient and evenly distributed international supply chain will benefit the entire shipbuilding industry, because China still needs key components from abroad to assemble large vessels.”\nChina’s reliance on imported parts, however, remains significant.\nIn 2023, Zhou Xi, deputy general manager of Shanghai Waigaoqiao Shipbuilding, a CSSC unit, told the Post that only about 40 per cent of the parts used in the Adora Magic City, China’s first domestically built cruise ship, were sourced from mainland suppliers.\nHe said the 323-metre-long vessel required around 20 times more worker hours to build than a capesize bulk carrier, one of the largest classes of cargo ships.\nCSSC plans to broaden its portfolio by building more cruise liners, deep-ocean drilling vessels and nuclear-powered ships, Ma said.\nAdora Flora City, China’s second domestically built cruise ship, was scheduled for delivery next year and was expected to showcase further improvements in local shipbuilding capabilities, he added.\nCSSC also delivered the country’s first deep-ocean drilling ship, Mengxiang – meaning “Dream” in Chinese – late last year. The vessel can operate in extreme wind conditions and drill to depths of up to 11,000 metres.\nShipbuilding is one of 10 core sectors identified in Beijing’s Made in China 2025 industrial strategy, which aims to help the country close the gap with global leaders in areas including robotics, semiconductors and new-energy vehicles.\nMarintec China, which runs until Friday in Shanghai, has attracted an unprecedented 2,200 exhibitors from around the world this year.","url":"https://www.scmp.com/business/china-business/article/3334950/beijing-woos-foreign-firms-china-seeks-bigger-role-global-shipbuilding-supply-chain?module=latest&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/02/c2997c50-d396-4d9a-81b9-048609c0164d_a06d0c72.jpg","video":null,"publish_date":"2025-12-03 00:30:09","author":"Daniel Ren","authors":["Daniel Ren"],"language":"en","category":"politics","source_country":"hk","sentiment":0.154},{"id":384438270,"title":"Beijing woos foreign firms as China seeks bigger role in global shipbuilding supply chain","text":"Beijing is extending an olive branch to overseas companies as it seeks to build a more integrated global supply chain for the shipbuilding industry, in its latest push to project goodwill and support free trade.\nGao Dongsheng, chief economist at the Ministry of Industry and Information Technology (MIIT), said on Tuesday that China was committed to further opening up its shipbuilding sector.\nMainland shipyards, which currently have a capacity to build about 65 million deadweight tonnes of large vessels a year, were expected to command around 65 per cent of the global shipbuilding market this year, according to industry officials.\nThe MIIT would “support a globalised layout of the [shipbuilding] industry and a reasonable distribution of the industrial chain,” Gao told a forum at Marintec China, the world’s largest maritime conference and exhibition. “Foreign companies and research institutions are encouraged to invest and form partnerships in China.”\n\nHe added that Chinese firms would seek deeper collaboration with foreign partners to accelerate the use of artificial intelligence and new-energy technologies in next-generation vessels.\nChina’s overwhelming lead in shipbuilding has put the sector squarely on the radar of US President Donald Trump, who has vowed to spend tens of billions of US dollars rebuilding US maritime capacity.\nMa Yunxiang, assistant president of China State Shipbuilding Corp (CSSC) – the world’s largest shipbuilding conglomerate, with about one-third of the global market – told a media briefing that global shipping companies were increasingly willing to place orders in China as they recognised the sector’s manufacturing strength.\n“Chinese shipyards enjoy production and cost advantages over international rivals,” said Xiong Hao, assistant general manager at Shanghai Jump International Shipping. “But an efficient and evenly distributed international supply chain will benefit the entire shipbuilding industry, because China still needs key components from abroad to assemble large vessels.”\nChina’s reliance on imported parts, however, remains significant.\nIn 2023, Zhou Xi, deputy general manager of Shanghai Waigaoqiao Shipbuilding, a CSSC unit, told the Post that only about 40 per cent of the parts used in the Adora Magic City, China’s first domestically built cruise ship, were sourced from mainland suppliers.\nHe said the 323-metre-long vessel required around 20 times more worker hours to build than a capesize bulk carrier, one of the largest classes of cargo ships.\nCSSC plans to broaden its portfolio by building more cruise liners, deep-ocean drilling vessels and nuclear-powered ships, Ma said.\nAdora Flora City, China’s second domestically built cruise ship, was scheduled for delivery next year and was expected to showcase further improvements in local shipbuilding capabilities, he added.\nCSSC also delivered the country’s first deep-ocean drilling ship, Mengxiang – meaning “Dream” in Chinese – late last year. The vessel can operate in extreme wind conditions and drill to depths of up to 11,000 metres.\nShipbuilding is one of 10 core sectors identified in Beijing’s Made in China 2025 industrial strategy, which aims to help the country close the gap with global leaders in areas including robotics, semiconductors and new-energy vehicles.\nMarintec China, which runs until Friday in Shanghai, has attracted an unprecedented 2,200 exhibitors from around the world this year.","summary":"Beijing is extending an olive branch to overseas companies as it seeks to build a more integrated global supply chain for the shipbuilding industry, in its latest push to project goodwill and support free trade.\nGao Dongsheng, chief economist at the Ministry of Industry and Information Technology (MIIT), said on Tuesday that China was committed to further opening up its shipbuilding sector.\nMainland shipyards, which currently have a capacity to build about 65 million deadweight tonnes of large...","url":"https://www.scmp.com/business/china-business/article/3334950/beijing-woos-foreign-firms-china-seeks-bigger-role-global-shipbuilding-supply-chain","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/02/c2997c50-d396-4d9a-81b9-048609c0164d_a06d0c72.jpg","video":null,"publish_date":"2025-12-03 00:30:09","author":"Daniel Ren","authors":["Daniel Ren"],"language":"en","category":"politics","source_country":"cn","sentiment":0.154},{"id":384438836,"title":"‘No compromise’ on territory after Ukraine talks with US: Russian official  - St. Vincent Tribune – Daily St","text":"A Russian official has said that “no compromise” has been reached on the crucial issue of territory in Ukraine, following talks between senior United States officials and President Vladimir Putin in Moscow.\n\nTrump’s special envoy Steve Witkoff and son-in-law Jared Kushner met Putin in the Russian capital on Tuesday, as the United States seeks to broker an end to the deadliest war in Europe since the Second World War.\n\nThe discussions lasted almost five hours and ended after midnight. “So far we haven’t found a compromise, but some American solutions can be discussed,” said top Kremlin aide Yuri Ushakov, who attended the meeting.\n\nAlthough Ushakov described the conversation as “very useful and constructive”, he stressed that “a lot of work lies ahead both in Washington and in Moscow”.\n\nThe US delegation had travelled to the Russian capital to discuss a peace plan which Washington has updated since its earlier leaked 28-point draft was strongly criticised by Ukraine and its allies for favouring Russia.\n\nThe Kremlin has condemned Kyiv and Europe’s subsequent counter-proposal, with Putin repeatedly saying that it is “unacceptable” to his country.\n\nAhead of his meeting with the senior US officials, the Russian leader delivered bellicose remarks at an investment forum, where he claimed his nation was ready to fight against Europe.\n\n“They are on the side of war,” Putin claimed, referring to Ukraine’s allies in Europe. “We can clearly see that all these changes are aimed at only one thing: to block the entire peace process altogether, to make such demands which are absolutely unacceptable to Russia.”\n\nThe 73-year-old also said Russia would increase attacks on Ukrainian ports and vessels, and tankers that support Kyiv, following the targeting of ships carrying Russian oil off the coast of Turkiye.\n\nResponding to his comments, Ukrainian Foreign Minister Andrii Sybiha said it was clear that Putin did not want the war to end.\n\n“Yesterday he said he was prepared to fight through the winter. Today, he threatens sea ports and freedom of navigation,” Sybiha wrote on social media.\n\nMeanwhile, on a visit to Ireland, Ukrainian President Volodymyr Zelenskyy said a “dignified peace” was needed.\n\nWhen asked at an event in Dublin about whether he feared the US could lose interest in the peace process, he said he feared one of Kyiv’s getting “tired”.\n\n“It’s the goal of Russia to withdraw the interest of America from this situation,” he explained.\n\nFor his part, US President Donald Trump admitted that the negotiations were difficult.\n\n“Our people are over in Russia right now to see if we can get it settled,” Trump said at a cabinet meeting in Washington. “Not an easy situation. What a mess,” he added, noting that the war was causing tens of thousands of casualties each month.\n\nTrump’s close allies Witkoff and Kushner could meet a Ukrainian delegation as early as Wednesday, potentially in Brussels, a senior figure in Kyiv told the AFP news agency.\n\nThe flurry of diplomatic activity came as Russia claimed that it had seized Pokrovsk, a city of “special significance” in Ukraine’s Donbas.\n\nKyiv has denied the development, saying that Moscow wants to project the impression that Russia’s advance is inevitable.\n\nPutin suggested on Tuesday that “from this base, from this sector, the Russian army can easily advance in any direction that the General Staff deems most promising”.\n\nMoscow’s forces currently control more than 19 percent of Ukraine, up one percentage point from last year. However, its troops have advanced more quickly in 2025 than at any time since 2022, according to pro-Ukrainian maps cited by Reuters.\n\nIn the earlier leaked US peace proposal, Russian demands included a cap on the size of the Ukrainian army, control over the whole of the Donbas and recognition of its presence in Ukrainian regions such as Zaporizhzhia and Kherson.\n\nKyiv has said such concessions would amount to a “capitulation”, with Zelenskyy saying that protecting Ukraine’s territorial integrity remains the “biggest challenge” in the ongoing negotiations.","url":"https://stvincenttribune.com/no-compromise-on-territory-after-ukraine-talks-with-us-russian-official/","image":"https://stvincenttribune.com/app/uploads/2025/12/afp_692f72a4042e-1764717220-p2YTNR.jpg","video":null,"publish_date":"2025-12-03 00:27:05","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"vc","sentiment":-0.095},{"id":384438838,"title":"Ilhan Omar denounces Donald Trump for calling Somali immigrants ‘garbage’  - St. Vincent Tribune – Daily St","text":"Progressive United States Congresswoman Ilhan Omar has hit back against Donald Trump after the president criticised her and renewed his attacks on the Somali community in Minnesota.\n\nDuring a cabinet meeting on Tuesday, Trump embarked on a racist tirade, describing Omar and other Somali immigrants as “garbage” and calling for them to leave the US.\n\n“His obsession with me is creepy,” Omar wrote on social media in response. “I hope he gets the help he desperately needs.”\n\nTrump has been ramping up his anti-immigration rhetoric in recent weeks, particularly after the deadly shooting of two National Guard troops in Washington, DC, last month.\n\nThe suspect in the shooting is an Afghan man who was evacuated from the country in 2021, after the withdrawal of US and allied forces. Trump has used the shooting as the basis for tightening immigration from what he described as “third-world countries”, including Somalia.\n\n“We’re going to go the wrong way if we keep taking in garbage into our country. Ilhan Omar is garbage. She’s garbage. Her friends are garbage,” the US president said.\n\n“These aren’t people that work. These aren’t people that say, ‘Let’s go, come on. Let’s make this place great.’ These are people that do nothing but complain. They complain, and from where they came from, they got nothing.”\n\nTrump said he does not know Omar “at all” but has watched her complain about the US for years. “I think she’s an incompetent person. She’s a real terrible person,” he said.\n\nA former child refugee who fled Somalia’s long-running civil war, Omar is considered the first Somali American to serve in the US Congress. She represents a congressional district in Minnesota that contains one of the largest Somali diaspora communities in the country.\n\nWhile Somalis in the US suffer from higher unemployment and poverty rates, akin to other refugee groups, a 2021 Minnesota Chamber of Commerce Report highlighted the community’s contributions and a trend towards upward mobility.\n\n“While many Somali refugees arrived with limited education, low workforce participation rates and high poverty levels, their situation two decades later has shifted significantly,” it said.\n\n“Poverty levels have dropped, workforce participation has increased, median household income has ticked up and educational attainment has made marginal gains.”\n\nTrump has nevertheless taken a series of hardline steps in response to the National Guard shooting, including suspending all migration from the “third world” and ordering a review of the status of permanent residents from 19 countries.\n\nThe US president — whose first and current wives are immigrants from Eastern Europe — has also been decrying immigration in general as a drain on US resources.\n\nMinnesota’s sizeable Somali community has long been in Trump’s crosshairs.\n\nDuring his first term in office, for instance, Trump implemented sweeping migration restrictions against five predominantly Muslim countries, plus North Korea and Venezuela. One of the countries swept up in the so-called “Muslim ban” was Somalia.\n\nRecently, Trump has also criticised the Somali community for a COVID-era welfare embezzlement scandal in which dozens of people, including some Somali immigrants, have been charged.\n\nOmar herself has been a years-long target of Trump’s criticisms. He repeatedly berated her and other immigrant politicians for “telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run”.\n\n“Why don’t they go back and help fix the totally broken and crime infested places from which they came,” Trump wrote on social media in 2019.\n\nThe Trump administration recently launched an Immigration and Customs Enforcement (ICE) operation in Minnesota that appears to be targeting the Somali community.\n\nDuring the Thanksgiving holiday last week, Trump sparked outcry when he called Minnesota Governor Tim Walz “seriously retarded” and accused him of doing nothing to confront Somali gangs allegedly “roving the streets”.\n\nThe US president also taunted Omar by appearing to mock her Islamic headscarf, saying that she is always “always wrapped in her swaddling hijab”.\n\nOn Tuesday, the progressive group Justice Democrats decried Trump’s attacks on Omar and the Somali community as “disgustingly racist”.\n\n“This is all Trump knows how to do when he has to distract from his own administration’s failures,” Justice Democrats said in a social media post.\n\n“Stoke hate, divide our communities, & send ICE in to terrorize our neighbors. Pathetic.”","url":"https://stvincenttribune.com/ilhan-omar-denounces-donald-trump-for-calling-somali-immigrants-garbage/","image":"https://stvincenttribune.com/app/uploads/2025/12/2024-08-14T021020Z_1005379647_RC2CF9AYHK3B_RTRMADP_3_USA-ELECTION-OMAR-1764711791-o294qA.jpg","video":null,"publish_date":"2025-12-03 00:27:02","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"vc","sentiment":-0.01},{"id":384437456,"title":"Honduras election council member accuses colleague of ‘intimidation’  - Dominican Republic Post – Caribbean","text":"A member of Honduras’s election council has accused one of her colleagues of seeking to derail proceedings as the Central American country awaits the outcome of Sunday’s presidential election.\n\nIn a social media post on Tuesday, Cossette Lopez-Osorio of the National Electoral Council (CNE) alleged that her fellow panel member, Marlon Ochoa, sought to delay a news conference through “intimidation”.\n\n“The press conference to mark the resumption of the results release was disrupted,” Lopez-Osorio wrote.\n\n“Councillor Marlon Ochoa opposed restarting the process and sent members of the LIBRE party, as well as members of his staff, to storm the Hotel Plaza Juan Carlos, engaging in acts of intimidation to prevent the public appearance.”\n\nThe accusations escalate the already heated atmosphere surrounding Sunday’s race.\n\nCurrently, two candidates are in a dead heat as votes continue to be counted: Salvador Nasralla of the centre-right Liberal Party and Nasry “Tito” Asfura of the right-wing National Party.\n\nAs of Tuesday afternoon, Nasralla had inched ahead with more than 39.93 percent of the vote, with Asfura close behind at 39.86 percent.\n\nA former frontrunner in the race, Rixi Moncada of the left-leaning LIBRE party, had fallen behind in early vote counts. According to the CNE, approximately 20 percent of the votes have yet to be tallied.\n\nInfighting on the council\n\nBut even before the first ballots were cast in Sunday’s election, controversies had gripped the council, resulting in accusations of malpractice from all three leading parties.\n\nThe CNE is led by a three-person panel. Each CNE councillor is selected by Honduras’s legislature to represent the three main political parties: the Liberal Party, the National Party and LIBRE, the party of outgoing President Xiomara Castro.\n\nLopez-Osorio represents the National Party. She has had a tumultuous relationship with her LIBRE counterpart, Ochoa.\n\nIn October, Ochoa filed a complaint with federal prosecutors, alleging that Lopez-Osorio had been caught in audio recordings conspiring with the Honduran military to influence the results.\n\nLopez-Osorio has denied the allegations. “These are fabricated recordings,” she told the Honduran newspaper La Prensa, calling Ochoa’s complaint “outrageous”.\n\nAttorney General Johel Zelaya nevertheless opened an investigation into the audio recordings on October 29.\n\nOchoa, meanwhile, continued to raise doubts about the election proceedings as the November 30 vote drew near.\n\nOn November 9, for instance, he posted on social media that a test of the voting system had “failed”, citing connectivity issues.\n\nThat result, he said, “constitutes further proof that the leaked audios are true and that there is a conspiracy against the electoral process, orchestrated from within the electoral body itself”.\n\nThe CNE has faced other high-profile conflicts as well. Also in October, the head of Honduras’s joint chiefs of staff, Roosevelt Hernandez, said the armed forces would seek to hold its own vote count.\n\nBut the president of the CNE, Liberal Party member Ana Paola Hall, rejected his demand, and legal experts have said there is no constitutional basis for the Honduran military to review the results.\n\nTrouble at the ballot box\n\nFears of irregularities and electoral interference have long loomed over Honduras’s presidential race.\n\nIn March, for example, advocates argued that long lines and delays in the distribution of election material impeded voters from participating in the election. Some polling stations stayed open late into the night as a result of the delays.\n\nThis week’s vote count also stuttered amid government website crashes. In an interview with CNN on Tuesday, Lopez-Osorio addressed some of the “technical failures” and “transmission issues” that have marred the proceedings.\n\nShe denied that the hiccups were part of any kind of conspiracy. “It is literally a technical failure in the disclosure platform,” she told CNN host Fernando del Rincon.\n\nLopez-Osorio explained that the CNE was “searching for explanations” and had been in contact with the company in charge of the technology, ASD SAS. The vote count, she added, would continue.\n\n“We have very narrow margins, and we also have a large proportion of ballots to process in these remaining days,” she said.\n\nA statement published on the CNE website echoed her comments. “The CNE has demanded that ASD SAS provide the fastest possible technical solution, so that all citizens have full and permanent access to the statistical data,” it read in part.\n\nStill, those comments are unlikely to dampen efforts to contest the election results in the coming days.\n\nAlready, United States President Donald Trump — supporter of the right-wing Asfura — has amplified election fraud claims with posts on his online platform Truth Social.\n\n“Looks like Honduras is trying to change the results of their Presidential Election. If they do, there will be hell to pay!” Trump wrote on Monday.\n\nMoncada, the left-wing candidate, also appears poised to challenge the results. In a statement this week, she denounced Trump for his “imperial foreign interference” in the election process. She also called the initial election results proof that October’s audio leak was authentic.\n\n“The elections are not lost,” she wrote. “The two-party system imposed its electoral plot on us, following the trap revealed by the 26 audio recordings.”\n\nShe added, “I declare that I will maintain my positions and that I will not surrender.”\n\nFor her part, Lopez-Osorio also called on the electorate to be vigilant, ending her post about her colleague Ochoa with the message: Stay “alert, Honduran people”.","url":"https://dominicanrepublicpost.com/honduras-election-council-member-accuses-colleague-of-intimidation/","image":"https://dominicanrepublicpost.com/app/uploads/2025/12/2025-12-02T204342Z_908373573_RC2D8IAO5CKR_RTRMADP_3_HONDURAS-ELECTION-1764713406-U3zScK.jpg","video":null,"publish_date":"2025-12-03 00:26:13","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":-0.001},{"id":384437458,"title":"‘No compromise’ on territory after Ukraine talks with US: Russian official  - Dominican Republic Post –","text":"A Russian official has said that “no compromise” has been reached on the crucial issue of territory in Ukraine, following talks between senior United States officials and President Vladimir Putin in Moscow.\n\nTrump’s special envoy Steve Witkoff and son-in-law Jared Kushner met Putin in the Russian capital on Tuesday, as the United States seeks to broker an end to the deadliest war in Europe since the Second World War.\n\nThe discussions lasted almost five hours and ended after midnight. “So far we haven’t found a compromise, but some American solutions can be discussed,” said top Kremlin aide Yuri Ushakov, who attended the meeting.\n\nAlthough Ushakov described the conversation as “very useful and constructive”, he stressed that “a lot of work lies ahead both in Washington and in Moscow”.\n\nThe US delegation had travelled to the Russian capital to discuss a peace plan which Washington has updated since its earlier leaked 28-point draft was strongly criticised by Ukraine and its allies for favouring Russia.\n\nThe Kremlin has condemned Kyiv and Europe’s subsequent counter-proposal, with Putin repeatedly saying that it is “unacceptable” to his country.\n\nAhead of his meeting with the senior US officials, the Russian leader delivered bellicose remarks at an investment forum, where he claimed his nation was ready to fight against Europe.\n\n“They are on the side of war,” Putin claimed, referring to Ukraine’s allies in Europe. “We can clearly see that all these changes are aimed at only one thing: to block the entire peace process altogether, to make such demands which are absolutely unacceptable to Russia.”\n\nThe 73-year-old also said Russia would increase attacks on Ukrainian ports and vessels, and tankers that support Kyiv, following the targeting of ships carrying Russian oil off the coast of Turkiye.\n\nResponding to his comments, Ukrainian Foreign Minister Andrii Sybiha said it was clear that Putin did not want the war to end.\n\n“Yesterday he said he was prepared to fight through the winter. Today, he threatens sea ports and freedom of navigation,” Sybiha wrote on social media.\n\nMeanwhile, on a visit to Ireland, Ukrainian President Volodymyr Zelenskyy said a “dignified peace” was needed.\n\nWhen asked at an event in Dublin about whether he feared the US could lose interest in the peace process, he said he feared one of Kyiv’s getting “tired”.\n\n“It’s the goal of Russia to withdraw the interest of America from this situation,” he explained.\n\nFor his part, US President Donald Trump admitted that the negotiations were difficult.\n\n“Our people are over in Russia right now to see if we can get it settled,” Trump said at a cabinet meeting in Washington. “Not an easy situation. What a mess,” he added, noting that the war was causing tens of thousands of casualties each month.\n\nTrump’s close allies Witkoff and Kushner could meet a Ukrainian delegation as early as Wednesday, potentially in Brussels, a senior figure in Kyiv told the AFP news agency.\n\nThe flurry of diplomatic activity came as Russia claimed that it had seized Pokrovsk, a city of “special significance” in Ukraine’s Donbas.\n\nKyiv has denied the development, saying that Moscow wants to project the impression that Russia’s advance is inevitable.\n\nPutin suggested on Tuesday that “from this base, from this sector, the Russian army can easily advance in any direction that the General Staff deems most promising”.\n\nMoscow’s forces currently control more than 19 percent of Ukraine, up one percentage point from last year. However, its troops have advanced more quickly in 2025 than at any time since 2022, according to pro-Ukrainian maps cited by Reuters.\n\nIn the earlier leaked US peace proposal, Russian demands included a cap on the size of the Ukrainian army, control over the whole of the Donbas and recognition of its presence in Ukrainian regions such as Zaporizhzhia and Kherson.\n\nKyiv has said such concessions would amount to a “capitulation”, with Zelenskyy saying that protecting Ukraine’s territorial integrity remains the “biggest challenge” in the ongoing negotiations.","url":"https://dominicanrepublicpost.com/no-compromise-on-territory-after-ukraine-talks-with-us-russian-official/","image":"https://dominicanrepublicpost.com/app/uploads/2025/12/afp_692f72a4042e-1764717220-HEXPd2.jpg","video":null,"publish_date":"2025-12-03 00:26:11","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":-0.095},{"id":384437454,"title":"Ilhan Omar denounces Donald Trump for calling Somali immigrants ‘garbage’  - Dominican Republic Post –","text":"Progressive United States Congresswoman Ilhan Omar has hit back against Donald Trump after the president criticised her and renewed his attacks on the Somali community in Minnesota.\n\nDuring a cabinet meeting on Tuesday, Trump embarked on a racist tirade, describing Omar and other Somali immigrants as “garbage” and calling for them to leave the US.\n\n“His obsession with me is creepy,” Omar wrote on social media in response. “I hope he gets the help he desperately needs.”\n\nTrump has been ramping up his anti-immigration rhetoric in recent weeks, particularly after the deadly shooting of two National Guard troops in Washington, DC, last month.\n\nThe suspect in the shooting is an Afghan man who was evacuated from the country in 2021, after the withdrawal of US and allied forces. Trump has used the shooting as the basis for tightening immigration from what he described as “third-world countries”, including Somalia.\n\n“We’re going to go the wrong way if we keep taking in garbage into our country. Ilhan Omar is garbage. She’s garbage. Her friends are garbage,” the US president said.\n\n“These aren’t people that work. These aren’t people that say, ‘Let’s go, come on. Let’s make this place great.’ These are people that do nothing but complain. They complain, and from where they came from, they got nothing.”\n\nTrump said he does not know Omar “at all” but has watched her complain about the US for years. “I think she’s an incompetent person. She’s a real terrible person,” he said.\n\nA former child refugee who fled Somalia’s long-running civil war, Omar is considered the first Somali American to serve in the US Congress. She represents a congressional district in Minnesota that contains one of the largest Somali diaspora communities in the country.\n\nWhile Somalis in the US suffer from higher unemployment and poverty rates, akin to other refugee groups, a 2021 Minnesota Chamber of Commerce Report highlighted the community’s contributions and a trend towards upward mobility.\n\n“While many Somali refugees arrived with limited education, low workforce participation rates and high poverty levels, their situation two decades later has shifted significantly,” it said.\n\n“Poverty levels have dropped, workforce participation has increased, median household income has ticked up and educational attainment has made marginal gains.”\n\nTrump has nevertheless taken a series of hardline steps in response to the National Guard shooting, including suspending all migration from the “third world” and ordering a review of the status of permanent residents from 19 countries.\n\nThe US president — whose first and current wives are immigrants from Eastern Europe — has also been decrying immigration in general as a drain on US resources.\n\nMinnesota’s sizeable Somali community has long been in Trump’s crosshairs.\n\nDuring his first term in office, for instance, Trump implemented sweeping migration restrictions against five predominantly Muslim countries, plus North Korea and Venezuela. One of the countries swept up in the so-called “Muslim ban” was Somalia.\n\nRecently, Trump has also criticised the Somali community for a COVID-era welfare embezzlement scandal in which dozens of people, including some Somali immigrants, have been charged.\n\nOmar herself has been a years-long target of Trump’s criticisms. He repeatedly berated her and other immigrant politicians for “telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run”.\n\n“Why don’t they go back and help fix the totally broken and crime infested places from which they came,” Trump wrote on social media in 2019.\n\nThe Trump administration recently launched an Immigration and Customs Enforcement (ICE) operation in Minnesota that appears to be targeting the Somali community.\n\nDuring the Thanksgiving holiday last week, Trump sparked outcry when he called Minnesota Governor Tim Walz “seriously retarded” and accused him of doing nothing to confront Somali gangs allegedly “roving the streets”.\n\nThe US president also taunted Omar by appearing to mock her Islamic headscarf, saying that she is always “always wrapped in her swaddling hijab”.\n\nOn Tuesday, the progressive group Justice Democrats decried Trump’s attacks on Omar and the Somali community as “disgustingly racist”.\n\n“This is all Trump knows how to do when he has to distract from his own administration’s failures,” Justice Democrats said in a social media post.\n\n“Stoke hate, divide our communities, & send ICE in to terrorize our neighbors. Pathetic.”","url":"https://dominicanrepublicpost.com/ilhan-omar-denounces-donald-trump-for-calling-somali-immigrants-garbage/","image":"https://dominicanrepublicpost.com/app/uploads/2025/12/2024-08-14T021020Z_1005379647_RC2CF9AYHK3B_RTRMADP_3_USA-ELECTION-OMAR-1764711791-rjxC0d.jpg","video":null,"publish_date":"2025-12-03 00:26:09","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":-0.01},{"id":384441762,"title":"Conservador Salvador Nasralla lidera la contienda presidencial en Honduras tras pausa en el conteo","text":"Por CHRISTOPHER SHERMAN\n\nTEGUCIGALPA (AP) — Un día después de que las autoridades electorales de Honduras dejaron de dar actualizaciones sobre el conteo de votos en la elección presidencial debido a “problemas técnicos”, el candidato Salvador Nasralla del conservador partido Liberal tenía una ligera ventaja el martes sobre Nasry Asfura, el candidato del Partido Nacional que cuenta con el respaldado del presidente estadounidense Donald Trump.\n\nTras contabilizar las papeletas del 62% de los centros de votación, Nasralla tenía el 39,94% de las preferencias frente al 39,83% de Asfura. Alrededor de unos 2.000 votos separan a los dos candidatos conservadores. Rixi Moncada del gobernante Partido Libertad y Refundación (LIBRE), se ubicaba en el tercer puesto con el 19,17% de los votos.\n\nEl sitio web que las autoridades electorales hondureñas establecieron para compartir los resultados de la votación experimentó “problemas técnicos” que causaron su caída, dejando al público sin información sobre los resultados de la contienda, informó el Consejo Nacional Electoral el martes por la mañana.\n\nEl sitio web empezó a actualizar el conteo de votos poco después del cierre de urnas en las elecciones del domingo, pero se cayó alrededor del mediodía del lunes y no hubo actualizaciones oficiales hasta la tarde del martes.\n\nAl momento de la caída del sitio, sólo 515 votos separaban al puntero Asfura de Nasralla. Ninguno de los dos pertenece al partido LIBRE de la presidenta Xiomara Castro, aunque Nasralla ha sido tanto rival como aliado, sirviendo durante un par de años como su vicepresidente.\n\nEl consejo dijo que le ha pedido al contratista que maneja el sitio web que encuentre una solución lo antes posible. Mientras tanto, el órgano electoral busca abrir un espacio para que los medios de comunicación observen el conteo de votos desde el lugar en donde se realiza, con el objetivo de que la población pueda ver lo que está sucediendo.\n\nMientras el sitio web estaba fuera de operaciones, Trump escribió el lunes en la plataforma de redes sociales Truth Social: “Parece que Honduras está tratando de alterar los resultados de su elección presidencial. ¡Si lo hacen, habrá consecuencias graves!”.\n\nEl mandatario estadounidense había otorgado su respaldo a Asfura, diciendo que era el único candidato con el que podía trabajar.\n\nAsfura y Nasralla llenaron el vacío de información oficial con los números de sus propias campañas, cada uno diciendo que era el favorito para ganar.\n\nHoras antes el martes, funcionarios de Estados Unidos confirmaron que el expresidente Juan Orlando Hernández, quien cumplía una sentencia de 45 años en prisión por tráfico de drogas, había sido liberado luego de recibir un indulto por parte de Trump.\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa.","summary":"Por CHRISTOPHER SHERMAN TEGUCIGALPA (AP) &#8212; Un d&#237;a despu&#233;s de que las autoridades electorales de Honduras dejaron de dar actualizaciones sobre el conteo de votos en la elecci&#243;n presidencial debido a &#8220;problemas t&#233;cnicos&#8221;, el candidato Salvador Nasralla del conservador partido Liberal ten&#237;a una ligera ventaja el martes sobre Nasry Asfura, el candidato del Partido Nacional [&#8230;]","url":"https://www.bostonherald.com/2025/12/02/conservador-salvador-nasralla-lidera-la-contienda-presidencial-en-honduras-tras-pausa-en-el-conteo/","image":"https://www.bostonherald.com/wp-content/uploads/2025/12/HONDURAS-ELECCIONES_27252.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-03 00:25:50","author":"Associated Press Spanish","authors":["Associated Press Spanish"],"language":"en","category":"politics","source_country":"us","sentiment":1},{"id":384440928,"title":"Honduras election council member accuses colleague of ‘intimidation’  - Guyana Inquirer – Daily Guyana News","text":"A member of Honduras’s election council has accused one of her colleagues of seeking to derail proceedings as the Central American country awaits the outcome of Sunday’s presidential election.\n\nIn a social media post on Tuesday, Cossette Lopez-Osorio of the National Electoral Council (CNE) alleged that her fellow panel member, Marlon Ochoa, sought to delay a news conference through “intimidation”.\n\n“The press conference to mark the resumption of the results release was disrupted,” Lopez-Osorio wrote.\n\n“Councillor Marlon Ochoa opposed restarting the process and sent members of the LIBRE party, as well as members of his staff, to storm the Hotel Plaza Juan Carlos, engaging in acts of intimidation to prevent the public appearance.”\n\nThe accusations escalate the already heated atmosphere surrounding Sunday’s race.\n\nCurrently, two candidates are in a dead heat as votes continue to be counted: Salvador Nasralla of the centre-right Liberal Party and Nasry “Tito” Asfura of the right-wing National Party.\n\nAs of Tuesday afternoon, Nasralla had inched ahead with more than 39.93 percent of the vote, with Asfura close behind at 39.86 percent.\n\nA former frontrunner in the race, Rixi Moncada of the left-leaning LIBRE party, had fallen behind in early vote counts. According to the CNE, approximately 20 percent of the votes have yet to be tallied.\n\nInfighting on the council\n\nBut even before the first ballots were cast in Sunday’s election, controversies had gripped the council, resulting in accusations of malpractice from all three leading parties.\n\nThe CNE is led by a three-person panel. Each CNE councillor is selected by Honduras’s legislature to represent the three main political parties: the Liberal Party, the National Party and LIBRE, the party of outgoing President Xiomara Castro.\n\nLopez-Osorio represents the National Party. She has had a tumultuous relationship with her LIBRE counterpart, Ochoa.\n\nIn October, Ochoa filed a complaint with federal prosecutors, alleging that Lopez-Osorio had been caught in audio recordings conspiring with the Honduran military to influence the results.\n\nLopez-Osorio has denied the allegations. “These are fabricated recordings,” she told the Honduran newspaper La Prensa, calling Ochoa’s complaint “outrageous”.\n\nAttorney General Johel Zelaya nevertheless opened an investigation into the audio recordings on October 29.\n\nOchoa, meanwhile, continued to raise doubts about the election proceedings as the November 30 vote drew near.\n\nOn November 9, for instance, he posted on social media that a test of the voting system had “failed”, citing connectivity issues.\n\nThat result, he said, “constitutes further proof that the leaked audios are true and that there is a conspiracy against the electoral process, orchestrated from within the electoral body itself”.\n\nThe CNE has faced other high-profile conflicts as well. Also in October, the head of Honduras’s joint chiefs of staff, Roosevelt Hernandez, said the armed forces would seek to hold its own vote count.\n\nBut the president of the CNE, Liberal Party member Ana Paola Hall, rejected his demand, and legal experts have said there is no constitutional basis for the Honduran military to review the results.\n\nTrouble at the ballot box\n\nFears of irregularities and electoral interference have long loomed over Honduras’s presidential race.\n\nIn March, for example, advocates argued that long lines and delays in the distribution of election material impeded voters from participating in the election. Some polling stations stayed open late into the night as a result of the delays.\n\nThis week’s vote count also stuttered amid government website crashes. In an interview with CNN on Tuesday, Lopez-Osorio addressed some of the “technical failures” and “transmission issues” that have marred the proceedings.\n\nShe denied that the hiccups were part of any kind of conspiracy. “It is literally a technical failure in the disclosure platform,” she told CNN host Fernando del Rincon.\n\nLopez-Osorio explained that the CNE was “searching for explanations” and had been in contact with the company in charge of the technology, ASD SAS. The vote count, she added, would continue.\n\n“We have very narrow margins, and we also have a large proportion of ballots to process in these remaining days,” she said.\n\nA statement published on the CNE website echoed her comments. “The CNE has demanded that ASD SAS provide the fastest possible technical solution, so that all citizens have full and permanent access to the statistical data,” it read in part.\n\nStill, those comments are unlikely to dampen efforts to contest the election results in the coming days.\n\nAlready, United States President Donald Trump — supporter of the right-wing Asfura — has amplified election fraud claims with posts on his online platform Truth Social.\n\n“Looks like Honduras is trying to change the results of their Presidential Election. If they do, there will be hell to pay!” Trump wrote on Monday.\n\nMoncada, the left-wing candidate, also appears poised to challenge the results. In a statement this week, she denounced Trump for his “imperial foreign interference” in the election process. She also called the initial election results proof that October’s audio leak was authentic.\n\n“The elections are not lost,” she wrote. “The two-party system imposed its electoral plot on us, following the trap revealed by the 26 audio recordings.”\n\nShe added, “I declare that I will maintain my positions and that I will not surrender.”\n\nFor her part, Lopez-Osorio also called on the electorate to be vigilant, ending her post about her colleague Ochoa with the message: Stay “alert, Honduran people”.","url":"https://guyanainquirer.com/honduras-election-council-member-accuses-colleague-of-intimidation/","image":"https://guyanainquirer.com/app/uploads/2025/12/2025-12-02T204342Z_908373573_RC2D8IAO5CKR_RTRMADP_3_HONDURAS-ELECTION-1764713406-koJdop.jpg","video":null,"publish_date":"2025-12-03 00:25:06","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.001},{"id":384440930,"title":"‘No compromise’ on territory after Ukraine talks with US: Russian official  - Guyana Inquirer – Daily Guyana","text":"A Russian official has said that “no compromise” has been reached on the crucial issue of territory in Ukraine, following talks between senior United States officials and President Vladimir Putin in Moscow.\n\nTrump’s special envoy Steve Witkoff and son-in-law Jared Kushner met Putin in the Russian capital on Tuesday, as the United States seeks to broker an end to the deadliest war in Europe since the Second World War.\n\nThe discussions lasted almost five hours and ended after midnight. “So far we haven’t found a compromise, but some American solutions can be discussed,” said top Kremlin aide Yuri Ushakov, who attended the meeting.\n\nAlthough Ushakov described the conversation as “very useful and constructive”, he stressed that “a lot of work lies ahead both in Washington and in Moscow”.\n\nThe US delegation had travelled to the Russian capital to discuss a peace plan which Washington has updated since its earlier leaked 28-point draft was strongly criticised by Ukraine and its allies for favouring Russia.\n\nThe Kremlin has condemned Kyiv and Europe’s subsequent counter-proposal, with Putin repeatedly saying that it is “unacceptable” to his country.\n\nAhead of his meeting with the senior US officials, the Russian leader delivered bellicose remarks at an investment forum, where he claimed his nation was ready to fight against Europe.\n\n“They are on the side of war,” Putin claimed, referring to Ukraine’s allies in Europe. “We can clearly see that all these changes are aimed at only one thing: to block the entire peace process altogether, to make such demands which are absolutely unacceptable to Russia.”\n\nThe 73-year-old also said Russia would increase attacks on Ukrainian ports and vessels, and tankers that support Kyiv, following the targeting of ships carrying Russian oil off the coast of Turkiye.\n\nResponding to his comments, Ukrainian Foreign Minister Andrii Sybiha said it was clear that Putin did not want the war to end.\n\n“Yesterday he said he was prepared to fight through the winter. Today, he threatens sea ports and freedom of navigation,” Sybiha wrote on social media.\n\nMeanwhile, on a visit to Ireland, Ukrainian President Volodymyr Zelenskyy said a “dignified peace” was needed.\n\nWhen asked at an event in Dublin about whether he feared the US could lose interest in the peace process, he said he feared one of Kyiv’s getting “tired”.\n\n“It’s the goal of Russia to withdraw the interest of America from this situation,” he explained.\n\nFor his part, US President Donald Trump admitted that the negotiations were difficult.\n\n“Our people are over in Russia right now to see if we can get it settled,” Trump said at a cabinet meeting in Washington. “Not an easy situation. What a mess,” he added, noting that the war was causing tens of thousands of casualties each month.\n\nTrump’s close allies Witkoff and Kushner could meet a Ukrainian delegation as early as Wednesday, potentially in Brussels, a senior figure in Kyiv told the AFP news agency.\n\nThe flurry of diplomatic activity came as Russia claimed that it had seized Pokrovsk, a city of “special significance” in Ukraine’s Donbas.\n\nKyiv has denied the development, saying that Moscow wants to project the impression that Russia’s advance is inevitable.\n\nPutin suggested on Tuesday that “from this base, from this sector, the Russian army can easily advance in any direction that the General Staff deems most promising”.\n\nMoscow’s forces currently control more than 19 percent of Ukraine, up one percentage point from last year. However, its troops have advanced more quickly in 2025 than at any time since 2022, according to pro-Ukrainian maps cited by Reuters.\n\nIn the earlier leaked US peace proposal, Russian demands included a cap on the size of the Ukrainian army, control over the whole of the Donbas and recognition of its presence in Ukrainian regions such as Zaporizhzhia and Kherson.\n\nKyiv has said such concessions would amount to a “capitulation”, with Zelenskyy saying that protecting Ukraine’s territorial integrity remains the “biggest challenge” in the ongoing negotiations.","url":"https://guyanainquirer.com/no-compromise-on-territory-after-ukraine-talks-with-us-russian-official/","image":"https://guyanainquirer.com/app/uploads/2025/12/afp_692f72a4042e-1764717220-BBY87v.jpg","video":null,"publish_date":"2025-12-03 00:25:04","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.095},{"id":384440926,"title":"Ilhan Omar denounces Donald Trump for calling Somali immigrants ‘garbage’  - Guyana Inquirer – Daily Guyana","text":"Progressive United States Congresswoman Ilhan Omar has hit back against Donald Trump after the president criticised her and renewed his attacks on the Somali community in Minnesota.\n\nDuring a cabinet meeting on Tuesday, Trump embarked on a racist tirade, describing Omar and other Somali immigrants as “garbage” and calling for them to leave the US.\n\n“His obsession with me is creepy,” Omar wrote on social media in response. “I hope he gets the help he desperately needs.”\n\nTrump has been ramping up his anti-immigration rhetoric in recent weeks, particularly after the deadly shooting of two National Guard troops in Washington, DC, last month.\n\nThe suspect in the shooting is an Afghan man who was evacuated from the country in 2021, after the withdrawal of US and allied forces. Trump has used the shooting as the basis for tightening immigration from what he described as “third-world countries”, including Somalia.\n\n“We’re going to go the wrong way if we keep taking in garbage into our country. Ilhan Omar is garbage. She’s garbage. Her friends are garbage,” the US president said.\n\n“These aren’t people that work. These aren’t people that say, ‘Let’s go, come on. Let’s make this place great.’ These are people that do nothing but complain. They complain, and from where they came from, they got nothing.”\n\nTrump said he does not know Omar “at all” but has watched her complain about the US for years. “I think she’s an incompetent person. She’s a real terrible person,” he said.\n\nA former child refugee who fled Somalia’s long-running civil war, Omar is considered the first Somali American to serve in the US Congress. She represents a congressional district in Minnesota that contains one of the largest Somali diaspora communities in the country.\n\nWhile Somalis in the US suffer from higher unemployment and poverty rates, akin to other refugee groups, a 2021 Minnesota Chamber of Commerce Report highlighted the community’s contributions and a trend towards upward mobility.\n\n“While many Somali refugees arrived with limited education, low workforce participation rates and high poverty levels, their situation two decades later has shifted significantly,” it said.\n\n“Poverty levels have dropped, workforce participation has increased, median household income has ticked up and educational attainment has made marginal gains.”\n\nTrump has nevertheless taken a series of hardline steps in response to the National Guard shooting, including suspending all migration from the “third world” and ordering a review of the status of permanent residents from 19 countries.\n\nThe US president — whose first and current wives are immigrants from Eastern Europe — has also been decrying immigration in general as a drain on US resources.\n\nMinnesota’s sizeable Somali community has long been in Trump’s crosshairs.\n\nDuring his first term in office, for instance, Trump implemented sweeping migration restrictions against five predominantly Muslim countries, plus North Korea and Venezuela. One of the countries swept up in the so-called “Muslim ban” was Somalia.\n\nRecently, Trump has also criticised the Somali community for a COVID-era welfare embezzlement scandal in which dozens of people, including some Somali immigrants, have been charged.\n\nOmar herself has been a years-long target of Trump’s criticisms. He repeatedly berated her and other immigrant politicians for “telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run”.\n\n“Why don’t they go back and help fix the totally broken and crime infested places from which they came,” Trump wrote on social media in 2019.\n\nThe Trump administration recently launched an Immigration and Customs Enforcement (ICE) operation in Minnesota that appears to be targeting the Somali community.\n\nDuring the Thanksgiving holiday last week, Trump sparked outcry when he called Minnesota Governor Tim Walz “seriously retarded” and accused him of doing nothing to confront Somali gangs allegedly “roving the streets”.\n\nThe US president also taunted Omar by appearing to mock her Islamic headscarf, saying that she is always “always wrapped in her swaddling hijab”.\n\nOn Tuesday, the progressive group Justice Democrats decried Trump’s attacks on Omar and the Somali community as “disgustingly racist”.\n\n“This is all Trump knows how to do when he has to distract from his own administration’s failures,” Justice Democrats said in a social media post.\n\n“Stoke hate, divide our communities, & send ICE in to terrorize our neighbors. Pathetic.”","url":"https://guyanainquirer.com/ilhan-omar-denounces-donald-trump-for-calling-somali-immigrants-garbage/","image":"https://guyanainquirer.com/app/uploads/2025/12/2024-08-14T021020Z_1005379647_RC2CF9AYHK3B_RTRMADP_3_USA-ELECTION-OMAR-1764711791-YXhYUU.jpg","video":null,"publish_date":"2025-12-03 00:25:02","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.01},{"id":384442024,"title":"\"No compromise on plan for Ukraine\": Kremlin aide on Putin's meeting with US Special Envoy Witkoff","text":"Moscow [Russia], December 3 (ANI): No compromise on the plan for Ukraine was reached during the meeting between Russian President Vladimir Putin and US delegation, the Russian President's aide Yuri Ushakov said as reported by RT. The Russian President meeting with US Special Envoy Steve Witkoff and US President Donald Trump's son-in-law Jared Kushner went on for nearly five hours. Ushakov did acknowledge that some US proposals look \"acceptable,\" while clearly stating that some proposals were not of the Kremlin's liking. \"No compromises have been found as of yet. Some American proposals are acceptable to Russia, while others are not,\" Ushakov said. \"We discussed the substance, not specific wording and solutions. The parties see enormous potential for cooperation,\" he added. Ushakov further informed that the \"territorial issue\" was also discussed in the meeting, RT reported. \"Responding to the question of whether peace had become closer or further following these talks, Ushakov said, \"Definitely not further.\"Kremlin envoy Kirill Dmitriev tweeted that the session was \"productive.\" Washington has circulated a 28-point peace proposal that was revised after pushback from Kyiv and European capitals, which criticised the initial draft for appearing too accommodating to Moscow's conditions.The meetings came hours after Vladimir Putin stated Moscow is ready for a military confrontation if European nations choose escalation, accusing European governments of blocking diplomatic efforts on Ukraine.Speaking at an investment forum in Moscow, Putin stated, \"We are not planning to go to war with Europe, but if Europe wants to and starts, we are ready right now.\" He claimed European leaders are no longer prioritising negotiations and are instead backing continued hostilities in Ukraine.According to Putin, \"They are on the side of war,\" referring to European positions on the conflict.Earlier, US Secretary of State Marco Rubio met with a Ukrainian delegation led by the head of Kyiv's National Security and Defence Council, Rustem Umerov over the peace proposal. Rubio said that the discussions were \"productive\" but that there is \"more work to be done\". (ANI)","url":"https://www.aninews.in/news/world/europe/no-compromise-on-plan-for-ukraine-kremlin-aide-on-putins-meeting-with-us-special-envoy-witkoff20251203055501","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251202232159.jpeg","video":null,"publish_date":"2025-12-03 00:25:01","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.447},{"id":384439464,"title":"\"No compromise on plan for Ukraine\": Kremlin aide on Putin's meeting with US Special Envoy Witkoff","text":"Moscow [Russia], December 3 (ANI): No compromise on the plan for Ukraine was reached during the meeting between Russian President Vladimir Putin and US delegation, the Russian President's aide Yuri Ushakov said as reported by RT. The Russian President meeting with US Special Envoy Steve Witkoff and US President Donald Trump's son-in-law Jared Kushner went on for nearly five hours. Ushakov did acknowledge that some US proposals look \"acceptable,\" while clearly stating that some proposals were not of the Kremlin's liking. \"No compromises have been found as of yet. Some American proposals are acceptable to Russia, while others are not,\" Ushakov said. \"We discussed the substance, not specific wording and solutions. The parties see enormous potential for cooperation,\" he added. Ushakov further informed that the \"territorial issue\" was also discussed in the meeting, RT reported. \"Responding to the question of whether peace had become closer or further following these talks, Ushakov said, \"Definitely not further.\"Kremlin envoy Kirill Dmitriev tweeted that the session was \"productive.\" Washington has circulated a 28-point peace proposal that was revised after pushback from Kyiv and European capitals, which criticised the initial draft for appearing too accommodating to Moscow's conditions.The meetings came hours after Vladimir Putin stated Moscow is ready for a military confrontation if European nations choose escalation, accusing European governments of blocking diplomatic efforts on Ukraine.Speaking at an investment forum in Moscow, Putin stated, \"We are not planning to go to war with Europe, but if Europe wants to and starts, we are ready right now.\" He claimed European leaders are no longer prioritising negotiations and are instead backing continued hostilities in Ukraine.According to Putin, \"They are on the side of war,\" referring to European positions on the conflict.Earlier, US Secretary of State Marco Rubio met with a Ukrainian delegation led by the head of Kyiv's National Security and Defence Council, Rustem Umerov over the peace proposal. Rubio said that the discussions were \"productive\" but that there is \"more work to be done\". (ANI)","url":"https://aninews.in/news/world/europe/no-compromise-on-plan-for-ukraine-kremlin-aide-on-putins-meeting-with-us-special-envoy-witkoff20251203055501","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251202232159.jpeg","video":null,"publish_date":"2025-12-03 00:25:01","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.447},{"id":384435588,"title":"Honduras election council member accuses colleague of ‘intimidation’  - St. Kitts Gazette – Daily News from","text":"A member of Honduras’s election council has accused one of her colleagues of seeking to derail proceedings as the Central American country awaits the outcome of Sunday’s presidential election.\n\nIn a social media post on Tuesday, Cossette Lopez-Osorio of the National Electoral Council (CNE) alleged that her fellow panel member, Marlon Ochoa, sought to delay a news conference through “intimidation”.\n\n“The press conference to mark the resumption of the results release was disrupted,” Lopez-Osorio wrote.\n\n“Councillor Marlon Ochoa opposed restarting the process and sent members of the LIBRE party, as well as members of his staff, to storm the Hotel Plaza Juan Carlos, engaging in acts of intimidation to prevent the public appearance.”\n\nThe accusations escalate the already heated atmosphere surrounding Sunday’s race.\n\nCurrently, two candidates are in a dead heat as votes continue to be counted: Salvador Nasralla of the centre-right Liberal Party and Nasry “Tito” Asfura of the right-wing National Party.\n\nAs of Tuesday afternoon, Nasralla had inched ahead with more than 39.93 percent of the vote, with Asfura close behind at 39.86 percent.\n\nA former frontrunner in the race, Rixi Moncada of the left-leaning LIBRE party, had fallen behind in early vote counts. According to the CNE, approximately 20 percent of the votes have yet to be tallied.\n\nInfighting on the council\n\nBut even before the first ballots were cast in Sunday’s election, controversies had gripped the council, resulting in accusations of malpractice from all three leading parties.\n\nThe CNE is led by a three-person panel. Each CNE councillor is selected by Honduras’s legislature to represent the three main political parties: the Liberal Party, the National Party and LIBRE, the party of outgoing President Xiomara Castro.\n\nLopez-Osorio represents the National Party. She has had a tumultuous relationship with her LIBRE counterpart, Ochoa.\n\nIn October, Ochoa filed a complaint with federal prosecutors, alleging that Lopez-Osorio had been caught in audio recordings conspiring with the Honduran military to influence the results.\n\nLopez-Osorio has denied the allegations. “These are fabricated recordings,” she told the Honduran newspaper La Prensa, calling Ochoa’s complaint “outrageous”.\n\nAttorney General Johel Zelaya nevertheless opened an investigation into the audio recordings on October 29.\n\nOchoa, meanwhile, continued to raise doubts about the election proceedings as the November 30 vote drew near.\n\nOn November 9, for instance, he posted on social media that a test of the voting system had “failed”, citing connectivity issues.\n\nThat result, he said, “constitutes further proof that the leaked audios are true and that there is a conspiracy against the electoral process, orchestrated from within the electoral body itself”.\n\nThe CNE has faced other high-profile conflicts as well. Also in October, the head of Honduras’s joint chiefs of staff, Roosevelt Hernandez, said the armed forces would seek to hold its own vote count.\n\nBut the president of the CNE, Liberal Party member Ana Paola Hall, rejected his demand, and legal experts have said there is no constitutional basis for the Honduran military to review the results.\n\nTrouble at the ballot box\n\nFears of irregularities and electoral interference have long loomed over Honduras’s presidential race.\n\nIn March, for example, advocates argued that long lines and delays in the distribution of election material impeded voters from participating in the election. Some polling stations stayed open late into the night as a result of the delays.\n\nThis week’s vote count also stuttered amid government website crashes. In an interview with CNN on Tuesday, Lopez-Osorio addressed some of the “technical failures” and “transmission issues” that have marred the proceedings.\n\nShe denied that the hiccups were part of any kind of conspiracy. “It is literally a technical failure in the disclosure platform,” she told CNN host Fernando del Rincon.\n\nLopez-Osorio explained that the CNE was “searching for explanations” and had been in contact with the company in charge of the technology, ASD SAS. The vote count, she added, would continue.\n\n“We have very narrow margins, and we also have a large proportion of ballots to process in these remaining days,” she said.\n\nA statement published on the CNE website echoed her comments. “The CNE has demanded that ASD SAS provide the fastest possible technical solution, so that all citizens have full and permanent access to the statistical data,” it read in part.\n\nStill, those comments are unlikely to dampen efforts to contest the election results in the coming days.\n\nAlready, United States President Donald Trump — supporter of the right-wing Asfura — has amplified election fraud claims with posts on his online platform Truth Social.\n\n“Looks like Honduras is trying to change the results of their Presidential Election. If they do, there will be hell to pay!” Trump wrote on Monday.\n\nMoncada, the left-wing candidate, also appears poised to challenge the results. In a statement this week, she denounced Trump for his “imperial foreign interference” in the election process. She also called the initial election results proof that October’s audio leak was authentic.\n\n“The elections are not lost,” she wrote. “The two-party system imposed its electoral plot on us, following the trap revealed by the 26 audio recordings.”\n\nShe added, “I declare that I will maintain my positions and that I will not surrender.”\n\nFor her part, Lopez-Osorio also called on the electorate to be vigilant, ending her post about her colleague Ochoa with the message: Stay “alert, Honduran people”.","url":"https://stkittsgazette.com/honduras-election-council-member-accuses-colleague-of-intimidation/","image":"https://stkittsgazette.com/app/uploads/2025/12/2025-12-02T204342Z_908373573_RC2D8IAO5CKR_RTRMADP_3_HONDURAS-ELECTION-1764713406-pn8ZoY.jpg","video":null,"publish_date":"2025-12-03 00:24:12","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":-0.001},{"id":384435586,"title":"‘No compromise’ on territory after Ukraine talks with US: Russian official  - St. Kitts Gazette – Daily News","text":"A Russian official has said that “no compromise” has been reached on the crucial issue of territory in Ukraine, following talks between senior United States officials and President Vladimir Putin in Moscow.\n\nTrump’s special envoy Steve Witkoff and son-in-law Jared Kushner met Putin in the Russian capital on Tuesday, as the United States seeks to broker an end to the deadliest war in Europe since the Second World War.\n\nThe discussions lasted almost five hours and ended after midnight. “So far we haven’t found a compromise, but some American solutions can be discussed,” said top Kremlin aide Yuri Ushakov, who attended the meeting.\n\nAlthough Ushakov described the conversation as “very useful and constructive”, he stressed that “a lot of work lies ahead both in Washington and in Moscow”.\n\nThe US delegation had travelled to the Russian capital to discuss a peace plan which Washington has updated since its earlier leaked 28-point draft was strongly criticised by Ukraine and its allies for favouring Russia.\n\nThe Kremlin has condemned Kyiv and Europe’s subsequent counter-proposal, with Putin repeatedly saying that it is “unacceptable” to his country.\n\nAhead of his meeting with the senior US officials, the Russian leader delivered bellicose remarks at an investment forum, where he claimed his nation was ready to fight against Europe.\n\n“They are on the side of war,” Putin claimed, referring to Ukraine’s allies in Europe. “We can clearly see that all these changes are aimed at only one thing: to block the entire peace process altogether, to make such demands which are absolutely unacceptable to Russia.”\n\nThe 73-year-old also said Russia would increase attacks on Ukrainian ports and vessels, and tankers that support Kyiv, following the targeting of ships carrying Russian oil off the coast of Turkiye.\n\nResponding to his comments, Ukrainian Foreign Minister Andrii Sybiha said it was clear that Putin did not want the war to end.\n\n“Yesterday he said he was prepared to fight through the winter. Today, he threatens sea ports and freedom of navigation,” Sybiha wrote on social media.\n\nMeanwhile, on a visit to Ireland, Ukrainian President Volodymyr Zelenskyy said a “dignified peace” was needed.\n\nWhen asked at an event in Dublin about whether he feared the US could lose interest in the peace process, he said he feared one of Kyiv’s getting “tired”.\n\n“It’s the goal of Russia to withdraw the interest of America from this situation,” he explained.\n\nFor his part, US President Donald Trump admitted that the negotiations were difficult.\n\n“Our people are over in Russia right now to see if we can get it settled,” Trump said at a cabinet meeting in Washington. “Not an easy situation. What a mess,” he added, noting that the war was causing tens of thousands of casualties each month.\n\nTrump’s close allies Witkoff and Kushner could meet a Ukrainian delegation as early as Wednesday, potentially in Brussels, a senior figure in Kyiv told the AFP news agency.\n\nThe flurry of diplomatic activity came as Russia claimed that it had seized Pokrovsk, a city of “special significance” in Ukraine’s Donbas.\n\nKyiv has denied the development, saying that Moscow wants to project the impression that Russia’s advance is inevitable.\n\nPutin suggested on Tuesday that “from this base, from this sector, the Russian army can easily advance in any direction that the General Staff deems most promising”.\n\nMoscow’s forces currently control more than 19 percent of Ukraine, up one percentage point from last year. However, its troops have advanced more quickly in 2025 than at any time since 2022, according to pro-Ukrainian maps cited by Reuters.\n\nIn the earlier leaked US peace proposal, Russian demands included a cap on the size of the Ukrainian army, control over the whole of the Donbas and recognition of its presence in Ukrainian regions such as Zaporizhzhia and Kherson.\n\nKyiv has said such concessions would amount to a “capitulation”, with Zelenskyy saying that protecting Ukraine’s territorial integrity remains the “biggest challenge” in the ongoing negotiations.","url":"https://stkittsgazette.com/no-compromise-on-territory-after-ukraine-talks-with-us-russian-official/","image":"https://stkittsgazette.com/app/uploads/2025/12/afp_692f72a4042e-1764717220-SsdWAk.jpg","video":null,"publish_date":"2025-12-03 00:24:10","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":-0.095},{"id":384435590,"title":"Ilhan Omar denounces Donald Trump for calling Somali immigrants ‘garbage’  - St. Kitts Gazette – Daily News","text":"Progressive United States Congresswoman Ilhan Omar has hit back against Donald Trump after the president criticised her and renewed his attacks on the Somali community in Minnesota.\n\nDuring a cabinet meeting on Tuesday, Trump embarked on a racist tirade, describing Omar and other Somali immigrants as “garbage” and calling for them to leave the US.\n\n“His obsession with me is creepy,” Omar wrote on social media in response. “I hope he gets the help he desperately needs.”\n\nTrump has been ramping up his anti-immigration rhetoric in recent weeks, particularly after the deadly shooting of two National Guard troops in Washington, DC, last month.\n\nThe suspect in the shooting is an Afghan man who was evacuated from the country in 2021, after the withdrawal of US and allied forces. Trump has used the shooting as the basis for tightening immigration from what he described as “third-world countries”, including Somalia.\n\n“We’re going to go the wrong way if we keep taking in garbage into our country. Ilhan Omar is garbage. She’s garbage. Her friends are garbage,” the US president said.\n\n“These aren’t people that work. These aren’t people that say, ‘Let’s go, come on. Let’s make this place great.’ These are people that do nothing but complain. They complain, and from where they came from, they got nothing.”\n\nTrump said he does not know Omar “at all” but has watched her complain about the US for years. “I think she’s an incompetent person. She’s a real terrible person,” he said.\n\nA former child refugee who fled Somalia’s long-running civil war, Omar is considered the first Somali American to serve in the US Congress. She represents a congressional district in Minnesota that contains one of the largest Somali diaspora communities in the country.\n\nWhile Somalis in the US suffer from higher unemployment and poverty rates, akin to other refugee groups, a 2021 Minnesota Chamber of Commerce Report highlighted the community’s contributions and a trend towards upward mobility.\n\n“While many Somali refugees arrived with limited education, low workforce participation rates and high poverty levels, their situation two decades later has shifted significantly,” it said.\n\n“Poverty levels have dropped, workforce participation has increased, median household income has ticked up and educational attainment has made marginal gains.”\n\nTrump has nevertheless taken a series of hardline steps in response to the National Guard shooting, including suspending all migration from the “third world” and ordering a review of the status of permanent residents from 19 countries.\n\nThe US president — whose first and current wives are immigrants from Eastern Europe — has also been decrying immigration in general as a drain on US resources.\n\nMinnesota’s sizeable Somali community has long been in Trump’s crosshairs.\n\nDuring his first term in office, for instance, Trump implemented sweeping migration restrictions against five predominantly Muslim countries, plus North Korea and Venezuela. One of the countries swept up in the so-called “Muslim ban” was Somalia.\n\nRecently, Trump has also criticised the Somali community for a COVID-era welfare embezzlement scandal in which dozens of people, including some Somali immigrants, have been charged.\n\nOmar herself has been a years-long target of Trump’s criticisms. He repeatedly berated her and other immigrant politicians for “telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run”.\n\n“Why don’t they go back and help fix the totally broken and crime infested places from which they came,” Trump wrote on social media in 2019.\n\nThe Trump administration recently launched an Immigration and Customs Enforcement (ICE) operation in Minnesota that appears to be targeting the Somali community.\n\nDuring the Thanksgiving holiday last week, Trump sparked outcry when he called Minnesota Governor Tim Walz “seriously retarded” and accused him of doing nothing to confront Somali gangs allegedly “roving the streets”.\n\nThe US president also taunted Omar by appearing to mock her Islamic headscarf, saying that she is always “always wrapped in her swaddling hijab”.\n\nOn Tuesday, the progressive group Justice Democrats decried Trump’s attacks on Omar and the Somali community as “disgustingly racist”.\n\n“This is all Trump knows how to do when he has to distract from his own administration’s failures,” Justice Democrats said in a social media post.\n\n“Stoke hate, divide our communities, & send ICE in to terrorize our neighbors. Pathetic.”","url":"https://stkittsgazette.com/ilhan-omar-denounces-donald-trump-for-calling-somali-immigrants-garbage/","image":"https://stkittsgazette.com/app/uploads/2025/12/2024-08-14T021020Z_1005379647_RC2CF9AYHK3B_RTRMADP_3_USA-ELECTION-OMAR-1764711791-KNDmXs.jpg","video":null,"publish_date":"2025-12-03 00:24:08","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":-0.01},{"id":384434980,"title":"‘No compromise’ on territory after Ukraine talks with US: Russian official  - Trinidad Tribune – Latest","text":"A Russian official has said that “no compromise” has been reached on the crucial issue of territory in Ukraine, following talks between senior United States officials and President Vladimir Putin in Moscow.\n\nTrump’s special envoy Steve Witkoff and son-in-law Jared Kushner met Putin in the Russian capital on Tuesday, as the United States seeks to broker an end to the deadliest war in Europe since the Second World War.\n\nThe discussions lasted almost five hours and ended after midnight. “So far we haven’t found a compromise, but some American solutions can be discussed,” said top Kremlin aide Yuri Ushakov, who attended the meeting.\n\nAlthough Ushakov described the conversation as “very useful and constructive”, he stressed that “a lot of work lies ahead both in Washington and in Moscow”.\n\nThe US delegation had travelled to the Russian capital to discuss a peace plan which Washington has updated since its earlier leaked 28-point draft was strongly criticised by Ukraine and its allies for favouring Russia.\n\nThe Kremlin has condemned Kyiv and Europe’s subsequent counter-proposal, with Putin repeatedly saying that it is “unacceptable” to his country.\n\nAhead of his meeting with the senior US officials, the Russian leader delivered bellicose remarks at an investment forum, where he claimed his nation was ready to fight against Europe.\n\n“They are on the side of war,” Putin claimed, referring to Ukraine’s allies in Europe. “We can clearly see that all these changes are aimed at only one thing: to block the entire peace process altogether, to make such demands which are absolutely unacceptable to Russia.”\n\nThe 73-year-old also said Russia would increase attacks on Ukrainian ports and vessels, and tankers that support Kyiv, following the targeting of ships carrying Russian oil off the coast of Turkiye.\n\nResponding to his comments, Ukrainian Foreign Minister Andrii Sybiha said it was clear that Putin did not want the war to end.\n\n“Yesterday he said he was prepared to fight through the winter. Today, he threatens sea ports and freedom of navigation,” Sybiha wrote on social media.\n\nMeanwhile, on a visit to Ireland, Ukrainian President Volodymyr Zelenskyy said a “dignified peace” was needed.\n\nWhen asked at an event in Dublin about whether he feared the US could lose interest in the peace process, he said he feared one of Kyiv’s getting “tired”.\n\n“It’s the goal of Russia to withdraw the interest of America from this situation,” he explained.\n\nFor his part, US President Donald Trump admitted that the negotiations were difficult.\n\n“Our people are over in Russia right now to see if we can get it settled,” Trump said at a cabinet meeting in Washington. “Not an easy situation. What a mess,” he added, noting that the war was causing tens of thousands of casualties each month.\n\nTrump’s close allies Witkoff and Kushner could meet a Ukrainian delegation as early as Wednesday, potentially in Brussels, a senior figure in Kyiv told the AFP news agency.\n\nThe flurry of diplomatic activity came as Russia claimed that it had seized Pokrovsk, a city of “special significance” in Ukraine’s Donbas.\n\nKyiv has denied the development, saying that Moscow wants to project the impression that Russia’s advance is inevitable.\n\nPutin suggested on Tuesday that “from this base, from this sector, the Russian army can easily advance in any direction that the General Staff deems most promising”.\n\nMoscow’s forces currently control more than 19 percent of Ukraine, up one percentage point from last year. However, its troops have advanced more quickly in 2025 than at any time since 2022, according to pro-Ukrainian maps cited by Reuters.\n\nIn the earlier leaked US peace proposal, Russian demands included a cap on the size of the Ukrainian army, control over the whole of the Donbas and recognition of its presence in Ukrainian regions such as Zaporizhzhia and Kherson.\n\nKyiv has said such concessions would amount to a “capitulation”, with Zelenskyy saying that protecting Ukraine’s territorial integrity remains the “biggest challenge” in the ongoing negotiations.","url":"https://trinidadtribune.com/no-compromise-on-territory-after-ukraine-talks-with-us-russian-official/","image":"https://trinidadtribune.com/app/uploads/2025/12/afp_692f72a4042e-1764717220-PwuFmd.jpg","video":null,"publish_date":"2025-12-03 00:22:28","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"tt","sentiment":-0.095},{"id":384434982,"title":"Ilhan Omar denounces Donald Trump for calling Somali immigrants ‘garbage’  - Trinidad Tribune – Latest","text":"Progressive United States Congresswoman Ilhan Omar has hit back against Donald Trump after the president criticised her and renewed his attacks on the Somali community in Minnesota.\n\nDuring a cabinet meeting on Tuesday, Trump embarked on a racist tirade, describing Omar and other Somali immigrants as “garbage” and calling for them to leave the US.\n\n“His obsession with me is creepy,” Omar wrote on social media in response. “I hope he gets the help he desperately needs.”\n\nTrump has been ramping up his anti-immigration rhetoric in recent weeks, particularly after the deadly shooting of two National Guard troops in Washington, DC, last month.\n\nThe suspect in the shooting is an Afghan man who was evacuated from the country in 2021, after the withdrawal of US and allied forces. Trump has used the shooting as the basis for tightening immigration from what he described as “third-world countries”, including Somalia.\n\n“We’re going to go the wrong way if we keep taking in garbage into our country. Ilhan Omar is garbage. She’s garbage. Her friends are garbage,” the US president said.\n\n“These aren’t people that work. These aren’t people that say, ‘Let’s go, come on. Let’s make this place great.’ These are people that do nothing but complain. They complain, and from where they came from, they got nothing.”\n\nTrump said he does not know Omar “at all” but has watched her complain about the US for years. “I think she’s an incompetent person. She’s a real terrible person,” he said.\n\nA former child refugee who fled Somalia’s long-running civil war, Omar is considered the first Somali American to serve in the US Congress. She represents a congressional district in Minnesota that contains one of the largest Somali diaspora communities in the country.\n\nWhile Somalis in the US suffer from higher unemployment and poverty rates, akin to other refugee groups, a 2021 Minnesota Chamber of Commerce Report highlighted the community’s contributions and a trend towards upward mobility.\n\n“While many Somali refugees arrived with limited education, low workforce participation rates and high poverty levels, their situation two decades later has shifted significantly,” it said.\n\n“Poverty levels have dropped, workforce participation has increased, median household income has ticked up and educational attainment has made marginal gains.”\n\nTrump has nevertheless taken a series of hardline steps in response to the National Guard shooting, including suspending all migration from the “third world” and ordering a review of the status of permanent residents from 19 countries.\n\nThe US president — whose first and current wives are immigrants from Eastern Europe — has also been decrying immigration in general as a drain on US resources.\n\nMinnesota’s sizeable Somali community has long been in Trump’s crosshairs.\n\nDuring his first term in office, for instance, Trump implemented sweeping migration restrictions against five predominantly Muslim countries, plus North Korea and Venezuela. One of the countries swept up in the so-called “Muslim ban” was Somalia.\n\nRecently, Trump has also criticised the Somali community for a COVID-era welfare embezzlement scandal in which dozens of people, including some Somali immigrants, have been charged.\n\nOmar herself has been a years-long target of Trump’s criticisms. He repeatedly berated her and other immigrant politicians for “telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run”.\n\n“Why don’t they go back and help fix the totally broken and crime infested places from which they came,” Trump wrote on social media in 2019.\n\nThe Trump administration recently launched an Immigration and Customs Enforcement (ICE) operation in Minnesota that appears to be targeting the Somali community.\n\nDuring the Thanksgiving holiday last week, Trump sparked outcry when he called Minnesota Governor Tim Walz “seriously retarded” and accused him of doing nothing to confront Somali gangs allegedly “roving the streets”.\n\nThe US president also taunted Omar by appearing to mock her Islamic headscarf, saying that she is always “always wrapped in her swaddling hijab”.\n\nOn Tuesday, the progressive group Justice Democrats decried Trump’s attacks on Omar and the Somali community as “disgustingly racist”.\n\n“This is all Trump knows how to do when he has to distract from his own administration’s failures,” Justice Democrats said in a social media post.\n\n“Stoke hate, divide our communities, & send ICE in to terrorize our neighbors. Pathetic.”","url":"https://trinidadtribune.com/ilhan-omar-denounces-donald-trump-for-calling-somali-immigrants-garbage/","image":"https://trinidadtribune.com/app/uploads/2025/12/2024-08-14T021020Z_1005379647_RC2CF9AYHK3B_RTRMADP_3_USA-ELECTION-OMAR-1764711791-ndfsKk.jpg","video":null,"publish_date":"2025-12-03 00:22:25","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"tt","sentiment":-0.01},{"id":384442190,"title":"Humanitarian migrants in US fear being deported into danger following shooting","text":"The Trump administration's escalating restrictions on humanitarian migration are leaving some of the United States's most vulnerable diaspora communities terrified for their futures.\n\nThe United States government last week announced the cancellation for Myanmar nationals of the \"temporary protected status\" that allowed them to live and work in the US, saying conflict-ridden Myanmar was \"safe\" to return to.\n\nThen, in the wake of the shooting of two National Guard soldiers in Washington, the US Citizenship and Immigration Services (USCIS) froze the processing of all asylum applications, halted visas for Afghans and said even already approved residency applications from countries of \"concern\" would be reviewed.\n\nOne of the members of the West Virginia National Guard has died while the other remains in a critical condition. The suspect is an Afghan national who worked with the CIA during the Afghanistan war and received asylum after coming to the US.\n\n\"USCIS has halted all asylum decisions until we can ensure that every alien is vetted and screened to the maximum degree possible,\" USCIS director Joseph Edlow said on X, formerly Twitter.\n\n\"The safety of the American people always comes first.\"\n\nUS President Donald Trump said on social media his administration would work to permanently pause migration from all \"Third World Countries\" to allow the American system to fully recover.\n\nFears of being arrested at airport\n\nMyanmar national Su Htet was studying at a US university in 2021 when Myanmar's democratically elected government was overthrown in a military coup.\n\nThe Washington DC resident, who asked to use a pseudonym, was given temporary protected status (TPS) after she graduated and her student visa ran out.\n\n\"Once I graduated, I couldn't go home, so I applied to be on TPS to give me a little more time to figure out what I could do next,\" she said. \n\n\"It allowed me to fight back against the junta without the fear of being conscripted or retaliation. \n\nLast week, Secretary of Homeland Security Kristi Noem said the TPS designation for Myanmar was no longer needed.\n\n\"The situation in Burma has improved enough that it is safe for Burmese citizens to return home, so we are terminating the Temporary Protected Status,\" Ms Noem said in a statement, using another name for Myanmar.\n\nAnalysts say there have been no \"meaningful improvements\" in the situation in Myanmar that would make it safer than before for people to return.\n\nJunta spokesperson Zaw Min Tun welcomed the \"positive statement\".\n\nThe revocation of Myanmar's protected status, which takes effect in January, puts holders like Su Htet into a legal limbo without work or residency rights.\n\nAs a Muslim and outspoken critic of the regime, she said she expected to be arrested on arrival back home if she were to be deported.\n\n\"Just by appearance alone, I would get profiled at the airport for further security check and just by merely googling my name, they would see that I have been actively speaking out against the junta and the coup.\n\n\"I am of age to be conscripted, so if they don't throw me into prison immediately, they'll probably conscript me and I know they put activists up on the front lines.\n\nShe said that many of her colleagues, peers, and friends from Myanmar on TPS feared they would be forced to go back to Myanmar, and the community had been lobbying the administration to rescind the decision.\n\n\"Now with the shooting, people are really terrified,\" she said.\n\n\"A lot of people who are on asylum pending status, who have green cards, are terrified.\"\n\nEvery Afghan family living with 'constant stress'\n\nThe United States had already ended Afghanistan's TPS and blocked most of the avenues Afghans could seek to move there — apart from those who had worked with the US during the war.\n\nBut following the Washington shooting, even that avenue is now frozen.\n\nRights organisations have been scathing of the US government's \"collective punishment\".\n\n\"Responding to the horrific actions of one individual by cancelling all Afghan visa and asylum processing is not justice, but scapegoating,\" said Bill Frelick, director of Human Rights Watch's Refugee and Migrant Rights Division.\n\n\"Stripping refugees of protection, blocking consideration of all asylum claims, and threatening deportation to Afghanistan is not accountability for a criminal act, but rather spurning those who sought safety in the United States.\n\n\"It's their association with US forces in Afghanistan, that exposed them to real risks of torture and persecution.\"\n\nCalifornia-based Afghan asylum seeker Wessal Mukhtar, who worked with the US in Afghanistan before the fall of Kabul in 2021, said the new measures had thrown his family and thousands of others into a painful and indefinite limbo.\n\n\"But even worse is the psychological pressure they've put on entire families.\"\n\nHe said his community was gripped by uncertainty: \"What will happen next? What kind of future will we have?\"\n\n\"Every Afghan family I know is living with this constant stress — from the youngest child to the oldest parent,\" he said.\n\n\"Kids worry about their siblings, their schooling, everything. There's this general sense of anxiety hanging over us.\"\n\nMr Mukhtar's asylum application has been pending since he arrived in the US in 2021.\n\n\"I worked with the Americans in Afghanistan for nearly four years,\" he said.\n\n\"Back home, no-one sees me as an Afghan anymore — only as an American spy. I cannot live safely there.\"\n\nDespite submitting multiple applications and completing several interviews, his case remains stuck in the system.\n\nHe said he felt the pressure most acutely at home.\n\n\"My eldest son is a brilliant student in last year of college, but he's deeply worried whether he'll be allowed to continue his higher education.\n\n\"Every evening our family conversations end up in the same tense place — what will happen to us?\"\n\nMr Mukhtar said thousands of other Afghans were facing the same paralysis.\n\nMany have watched their work authorisation expire while they wait.\n\n\"I've only been issued a parole visa, which keeps getting renewed, but then it goes back into pending status. And now people are even afraid of deportation because the backlog is enormous.\"\n\nSafety has become another source of fear.\n\n\"We feel security threats too. I worry that my children or I could face racist or extremist attacks from someone, somewhere.\n\nMr Mukhtar said it felt like an entire community was being punished for circumstances beyond their control.\n\n\"An entire nation, a whole displaced people, should not be punished for an isolated incident,\" he said.\n\n\"We've already lost so much.\"","summary":"The Trump administration's escalating restrictions on humanitarian migration are leaving some of the United States's most vulnerable diaspora communities terrified for their futures.","url":"https://www.abc.net.au/news/2025-12-03/humanitarian-migrants-fear-deportation-following-shooting/106079920","image":"https://live-production.wcms.abc-cdn.net.au/a9c2066ec8434bf82c364e5488477e85?impolicy=wcms_crop_resize&cropH=1152&cropW=2048&xPos=0&yPos=812&width=862&height=485","video":null,"publish_date":"2025-12-03 00:21:44","author":"Will Jackson","authors":["Will Jackson"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.237},{"id":384439480,"title":"Donald Trump considers implementing superannuation plan for US","text":"WorldNorth AmericaTrump's America\n\nWashington | US President Donald Trump has praised Australia’s superannuation system as a good scheme for working people and one that his administration is seriously considering as a policy proposal.Trump made the remarks at an event on Tuesday (Wednesday AEDT) to unveil a $US6.25 billion ($9.5 billion) donation from wealthy computing pioneer Michael Dell and his wife Susan that will flow into investment accounts for American children.Loading...Jessica Gardner is The Australian Financial Review’s United States correspondent. She was previously deputy editor - news. Connect with Jessica on Twitter. Email Jessica at jgardner@afr.com or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? License articleFollow the topics, people and companies that matter to you.Find out moreRead MoreTrump's AmericaDonald TrumpTrump diplomacyTrump's White HouseKevin RuddHeather RidoutAnthony AlbaneseSuperannuation\n\nFetching latest articles10 fashion lessons to take into the new year (hint: ditch the Crocs)Lauren SamsThe consultancy bringing public art to the streetsSome cities are built for holidays – but these are made for livingThe speaking tricks these execs use to own the room, and get aheadPatrick DurkinHow this CEO gets the most out of his workdayChristine Holgate on how to survive losing your job10 chic business owners share their Christmas shopping listsLauren SamsA Ralph Lauren duffel and a jazzy P Johnson tie for the style consciousI never really got Christmas – until I took my kids to EuropeGetting richer usually makes you happier – until you hit 2 risk pointsLucy DeanThe pharmacist from Fitzroy who amassed a $7b fortune with Chemist WarehouseYoung property entrepreneur gets set in green concrete start-up","url":"https://www.afr.com/world/north-america/trump-seriously-considering-australian-super-style-scheme-20251203-p5nkfi","image":"https://static.ffx.io/images/$zoom_0.3524%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_55%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/fbb2627c077c0aab757c64e76085ed454110c46c","video":null,"publish_date":"2025-12-03 00:21:21","author":"Jessica Gardner","authors":["Jessica Gardner"],"language":"en","category":"politics","source_country":"au","sentiment":0.007},{"id":384442836,"title":"AP photographer describes scene inside Trump’s two-hour Cabinet meeting (Video)","text":"International\n\nSouth Cinema\n\nSocial News XYZ Reviews\n\nMovie Schedules\n\nMovies News\n\nLive Events\n\nMotorsports\n\nOther Sports\n\nScience/Tech\n\nBusiness Wire India\n\nEnvironment\n\nHome » Videos » AP photographer describes scene inside Trump’s two-hour Cabinet meeting (Video) \n\nAP photographer describes scene inside Trump’s two-hour Cabinet meeting (Video)\n\nPosted By: Social News XYZ\nDecember 2, 2025\n\nPresident Donald Trump held a lengthy Cabinet meeting on Tuesday. AP photojournalist Julia Nikhinson was inside the room documenting the mood. (AP Video: Dan Huff and River Zhang).\n\nSubscribe: http://smarturl.it/AssociatedPress\n\nRead more: https://apnews.com\n\nThis video may be available for archive licensing via https://newsroom.ap.org/home\n\nFacebook Comments\n\nAbout SocialNewsXYZ\nAn Indo-American News website.It covers Gossips, Politics, Movies, Technolgy, and Sports News and Photo Galleries and Live Coverage of Events via Youtube.\nThe website is established in 2015 and is owned by AGK FIRE INC.\n\nLike Loading...\n\nAP photographer describes scene inside Trump's two-hour Cabinet meeting (Video)\nDescription\n\nPresident Donald Trump held a lengthy Cabinet meeting on Tuesday. AP photojournalist Julia Nikhinson was inside the room documenting the mood. (AP Video: Dan Huff and River Zhang).\nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\nThis video may be available for archive licensing via https://newsroom.ap.org/home\n\nPrevious post\n\nActress Divya Bharati Glam Stills From Goat Movie Teaser Launch\n\nActress Nabha Natesh Beautiful HD Stills\n\nAndhra King Taluka Movie Thanks Meet – Gallery\n\nBhopal: March Held on 41st Anniversary of Gas Tragedy #Gallery\n\nKunal Khemu, Neha Dhupia, Prajakta Koli, Manoj Pahwa, And Other Celebs At The Trailer Launch Of Upcoming Series Single Papa – Gallery\n\nGoat Movie Teaser Launch – Gallery\n\nPsych Siddharth Movie Trailer Launch – Gallery\n\nMumbai: Trailer Launch of ‘Single Papa’ #Gallery\n\nColombo: IAF C 17 Lands With Field Hospital for Flood Relief #Gallery\n\nNew Delhi: Jharkhand Governor Santosh Gangwar Meets Amit Shah #Gallery\n\nTop Stories\n\nTurmoil erupts in BHU: Campus gripped by violence after student-proctorial clash\n\nDRDO conducts high-speed rocket-sled test of fighter aircraft escape system\n\n‘India is first responder, always stood by us in crisis’: Lankan Diplomat (IANS Exclusive)\n\nJMM shifting political alliance will be a direct blow to Tejashwi over Bihar decision\n\n‘India is first responder, always stood by us in crisis’: Lankan diplomat (IANS Exclusive)\n\n‘This is only the beginning’: Devavrat and his father reflect on rare Vedic feat praised by PM Modi\n\nIndia to remain world’s fastest growing economy in FY26: OECD\n\nRBI retains SBI, HDFC Bank & ICICI Bank in ‘Systemically Important’ category\n\nIndia ramps up humanitarian assistance to Sri Lanka under Operation Sagar Bandhu\n\nManipur crackdown: 11 Insurgents arrested, massive arms and explosives seized\n\nArchives Archives\n\nCopyright 2025 | AGK FIRE INC|\nTerms of Service / Privacy Policy | Contact Us","summary":"President Donald Trump held a lengthy Cabinet meeting on Tuesday. AP photojournalist Julia Nikhinson was inside the room documenting the mood. (AP Video: Dan Huff and River Zhang). Subscribe: http://smarturl.it/AssociatedPress Read more: https://apnews.com This video...\n\n\nThe post AP photographer describes scene inside Trump&#8217;s two-hour Cabinet meeting (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/12/02/ap-photographer-describes-scene-inside-trumps-two-hour-cabinet-meeting-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/12/03/maxresdefault-4.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1764723063","video":null,"publish_date":"2025-12-03 00:21:03","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","category":"politics","source_country":"in","sentiment":0.438}]}