{"offset":0,"number":50,"available":7221,"news":[{"id":276768838,"title":"Top German newspaper editor quits over Musk op-ed","text":"Biden signs bill naming bald eagle the national bird of USBiden vetoes once-bipartisan effort to add 66 federal judgeshipsHong Kong police issue arrest warrants and bounties for six activistsCenturies-old angels uncovered at Boston church under restoration\n\n Top German newspaper editor quits over Musk op-ed The Tesla and SpaceX owner penned an article praising the anti-immigration AfD party The opinion editor at Germany's leading newspaper Die Welt has resigned over the decision to publish an op-ed by Elon Musk, in which he defended the anti-immigration Alternative for Germany (AfD) party.\"I have always enjoyed running the opinion pages of Welt and Welt am Sonntag. Today, an article written by Elon Musk appeared in Welt am Sonntag. I handed in my resignation yesterday, after it went to print,\" Eva Marie Kogel wrote on X.The billionaire owner of SpeceX, Tesla and X (formerly Twitter) wrote the article after praising AfD on social media. In his op-ed, the major ally of US President-elect Donald Trump hailed AfD as \"the last spark of hope\" for Germany. The billionaire insisted that its \"pragmatic\" approach will usher in a revival of the country, while arguing that other parties are out of touch with regular people. \"The traditional parties have failed Germany. Their policies have led to economic stagnation, social unrest and an erosion of national identity,\" Musk wrote. \"Despite being far-right, AfD represents political realism that resonates with many Germans who feel that their concerns are being ignored by the establishment.\" Musk further defended the AfD, stating that \"their portrayal as far-right is clearly false.\" According to German media, the publication of the op-ed sparked intense debates among the staff at Die Welt, with some viewing it as meddling in the snap parliamentary election, which is scheduled for February 2025. Jan Philipp Burgard, Die Welt's senior reporter, penned a rebuttal to Musk, calling his praise of AfD \"fatally flawed\" and arguing that it was \"a big mistake\" not to label the party as far-right. Another Die Welt journalist, Franziska Zimmerer, insisted in her own op-ed that the text written by Musk \"should not have appeared\" in the paper. \"Election appeals, no matter the party, have no place in independent media,\" she wrote.Founded in 2013, AfD has been pushing for the tightening of asylum laws and fighting organized crime and Islamic extremism. The party has become more popular in recent years, winning its first regional election in Thuringia in September. The 2025 election was called after the ruling three-party coalition collapsed due to the conflict over budget. \n\n Top German newspaper editor quits over Musk op-edTop German newspaper editor quits over Musk op-edRT.com 29th December 2024, 10:48 GMT+11 The Tesla and SpaceX owner penned an article praising the anti-immigration AfD party The opinion editor at Germany's leading newspaper Die Welt has resigned over the decision to publish an op-ed by Elon Musk, in which he defended the anti-immigration Alternative for Germany (AfD) party.\"I have always enjoyed running the opinion pages of Welt and Welt am Sonntag. Today, an article written by Elon Musk appeared in Welt am Sonntag. I handed in my resignation yesterday, after it went to print,\" Eva Marie Kogel wrote on X.The billionaire owner of SpeceX, Tesla and X (formerly Twitter) wrote the article after praising AfD on social media. In his op-ed, the major ally of US President-elect Donald Trump hailed AfD as \"the last spark of hope\" for Germany. The billionaire insisted that its \"pragmatic\" approach will usher in a revival of the country, while arguing that other parties are out of touch with regular people. \"The traditional parties have failed Germany. Their policies have led to economic stagnation, social unrest and an erosion of national identity,\" Musk wrote. \"Despite being far-right, AfD represents political realism that resonates with many Germans who feel that their concerns are being ignored by the establishment.\" Musk further defended the AfD, stating that \"their portrayal as far-right is clearly false.\" According to German media, the publication of the op-ed sparked intense debates among the staff at Die Welt, with some viewing it as meddling in the snap parliamentary election, which is scheduled for February 2025. Jan Philipp Burgard, Die Welt's senior reporter, penned a rebuttal to Musk, calling his praise of AfD \"fatally flawed\" and arguing that it was \"a big mistake\" not to label the party as far-right. Another Die Welt journalist, Franziska Zimmerer, insisted in her own op-ed that the text written by Musk \"should not have appeared\" in the paper. \"Election appeals, no matter the party, have no place in independent media,\" she wrote.Founded in 2013, AfD has been pushing for the tightening of asylum laws and fighting organized crime and Islamic extremism. The party has become more popular in recent years, winning its first regional election in Thuringia in September. The 2025 election was called after the ruling three-party coalition collapsed due to the conflict over budget. \n\n Read This Next Colombia's minimum wage to increase to $323 per month in 2025Nordstrom family will take retailer private in $4 billion dealEl Salvador's Congress approves ending ban on metals miningSurvey: Small businesses more optimistic about economy after electionBig travel day opens with brief grounding of American Airlines flights \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2024 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274893727/top-german-paper-editor-quits-over-musk-op-ed","image":"https://cdn.bignewsnetwork.com/YjIzOTVjYmEtOTR.jpg","video":null,"publish_date":"2024-12-29 01:10:50","author":"Elon Musk","authors":["Elon Musk"],"language":"en","source_country":"us","sentiment":0.111},{"id":276768752,"title":"Biden still regrets dropping out of 2024 race and believes he could have beaten Trump, says report","text":"Joe Biden still regrets pulling out of the 2024 presidential race and believes he could have beaten Donald Trump for the White House, according to a report.\n\nThe outgoing president backed out of the race over the summer following a disastrous first debate against his Republican rival, low approval numbers, and dwindling donations.\n\nBut Biden recently told people that despite the issues his campaign faced he is confident he could have defeated Trump in November, sources familiar with the conversations told The Washington Post.\n\nCalls for Biden to leave the race grew increasingly loud among Democrats after his poor debate performance on June 27, and he finally called it quits on July 21.\n\nHis belated decision to endorse Kamala Harris saw the vice-president given only three months to mount a campaign against Trump, eventually being swept in all the battleground states and losing the popular vote by 2.2 million.\n\nBiden has refused to blame Harris for his departure from the race but has told aides he would have won, reported the newspaper.\n\nHarris supporters have criticized Biden for waiting too long before withdrawing and for seeking a second term in the first place.\n\n“Biden ran on the promise that he was going to be a transitional president, and in effect, have one term before handing it off to another generation,” Richard Blumenthal, a Democratic senator for Connecticut told the Post.\n\n“I think his running again broke that concept – the conceptual underpinning of the theory that he would end the Trump appeal, he would defeat Trumpism and enable a new era.”\n\nBiden also admitted to aides that he had made other mistakes, including the selection of Merrick Garland as attorney general, according to the Post.\n\nThe president has said privately that Garland was too slow to prosecute Trump over January 6, while his Justice Department aggressively prosecuted and convicted his son Hunter. Biden earlier this month pardoned Hunter, despite saying he would not use his executive authority to do so.","summary":"Biden also admitted to aides that he had made other mistakes, including the selection of Merrick Garland as attorney general","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-regrets-dropping-out-2024-b2671055.html","image":"https://static.independent.co.uk/2024/12/29/00/GettyImages-2190852177.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/AazcZDGx-4VHSaSK0.mp4","publish_date":"2024-12-29 01:07:30","author":"Graeme Massie","authors":["Graeme Massie"],"language":"en","source_country":"gb","sentiment":-0.283},{"id":276767074,"title":"Marc Andreessen: 'Every Signal Is Being Sent' Trump DOJ Official Harmeet Dhillon Will Drop Hammer On Woke Corporations","text":"Billionaire investor and Donald Trump adviser Marc Andreessen thinks corporate culture is about to undergo a radical change. Speaking with Erik Torenberg on the Moment of Zen podcast, Andreessen said that the reign of extreme wokeness, particularly in corporate America and the media, is rapidly coming to an end.\n\nThe catalyst? A combination of rising legal risks, the deflation of wokeness as a cultural force, and a change in leadership at the Department of Justice. Andreessen highlighted that with the appointment of Harmeet Dhillon to head the DOJ's Civil Rights Division,\n the federal government may soon begin to challenge and reverse many of \nthe DEI-driven policies that have dominated corporations, universities, \nand other large institutions over the past decade. ---More...","url":"https://www.canadafreepress.com/article/marc-andreessen-every-signal-is-being-sent-trump-doj-official-harmeet-dhillon-will-drop-hammer-on-woke-corporations","image":"https://canadafreepress.com/images/uploads/justice281224.jpg","video":null,"publish_date":"2024-12-29 00:45:50","author":"Bio And Archives","authors":["Bio And Archives"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.237},{"id":276766546,"title":"Trump appears to side with Musk, tech allies in debate over foreign workers roiling his supporters","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n Here Are All The Best Amazon Boxing Day Deals You Can Find On Beauty Products In Canada\n\n These Walking Pads Will Help You Get 10,000 Steps Every Day (And They're On Sale In The Name Of Boxing Day)\n\n 10 Family Calendars And Planners That'll Help You Keep Track Of Everything In The New Year\n\n If You're Headed Somewhere Warm On Vacation, Don't Forget To Pack These 16 Things\n\n Our Guide To The Best Snow Shovels In Canada In 2024 (And Where To Get Them)\n\n 14 Of The Best Home Security Devices You Can Find Online Right Now (And They've Got The Reviews To Prove It)\n\n The Clock Is Ticking — Shop These 25 Last-Minute Amazon Prime Gifts Now\n\n If You Have An Amazon Prime Account, These 70+ Crowd-Pleasing Gifts Will Still Arrive Before Christmas\n\n If You Have An Amazon Prime Account, These 50 Brilliant Stocking Stuffers Will Still Arrive Before Christmas\n\n 20 Products Your Dry, Dehydrated Skin Will Thank You For Ordering\n\n 14 Hydrating Face Masks That’ll Save Your Skin This December\n\n 12 Budget-Friendly Products To Add To Your Winter Skincare Routine\n\n 11 Bestselling Coffee Makers And Espresso Machines You Can Get On Sale Right Now\n\n Don’t Walk, Run! These LEGO Kits Are On Sale For Boxing Day 2024\n\n The Waterpik Advanced Water Flosser Will Make Cleaning Your Teeth So Much Easier — And It's 41% Off For Boxing Day\n\n CTVNews.ca Top Stories\n\n Canadian model Dayle Haddon dies from suspected carbon monoxide poisoning\n\n Dayle Haddon, an actor, activist and trailblazing former 'Sports Illustrated' model who pushed back against age discrimination by reentering the industry as a widow, has died in a Pennsylvania home from what authorities believe was carbon monoxide poisoning.\n\n Mississauga tow truck driver charged for impersonating a cop in northern Ont.\n\n A southern Ontario resident has been charged for allegedly impersonating a peace officer during a towing incident in northwestern Ontario.\n\n If you're mentally struggling during the holidays, here’s how to cope\n\n For many people, celebrating New Year’s Day can include reflecting on a life well lived or a chance to start anew. But for some, the holiday may have dark undertones, according to a recent large study.\n\n G2 driver stopped going more than 100 km/h over the speed limit on Hwy. 401 in eastern Ontario\n\n A 17-year-old driver is facing charges after being caught speeding and driving dangerously on Highway 401 in eastern Ontario Friday evening, according to the Ontario Provincial Police (OPP).\n\n 15 hurt when passenger train strikes fire truck that drove into crossing after freight train passed\n\n Three firefighters and a dozen passengers were injured in Florida on Saturday when a fire truck drove around rail crossing arms and into the path of a high-speed passenger train after waiting for another train to pass, according to a person briefed on what happened.\n\n Magnus Carlsen quits World Rapid and Blitz Championships after refusing to change out of jeans\n\n World No. 1 Magnus Carlsen quit the World Rapid Chess Championship on Friday after he refused to change out of the jeans he was wearing, according to the International Chess Federation (FIDE).\n\n Physical therapy is 'the best-kept secret in health care'\n\n If you think physical therapy is only about rehabilitation after surgery or recovering from an accident, think again. For the vast majority, seeing a physical therapist should be about prevention, routine assessment and staying well.\n\n Trudeau, Carney push back over Trump's ongoing 51st state comments\n\n Two senior members of the federal cabinet were in Florida Friday pushing Canada's new $1.3 billion border plan with members of Donald Trump's transition team, a day after Prime Minister Justin Trudeau himself appeared to finally push back at the president-elect over his social media posts about turning Canada into the 51st state.\n\n Friend of Quebec man killed in Florida boat explosion says his sister also injured\n\n A childhood friend of the Quebec man killed in a Florida boat explosion earlier this week says one of the victim's sisters was among the other six passengers injured in the blast.\n\n TC Energy says early morning gas leak near Cornwall, Ont. resolved\n\n A gas leak that happened at a compressor station near Cornwall, Ont. Saturday morning has been controlled, according to TC Energy.\n\n G2 driver stopped going more than 100 km/h over the speed limit on Hwy. 401 in eastern Ontario\n\n A 17-year-old driver is facing charges after being caught speeding and driving dangerously on Highway 401 in eastern Ontario Friday evening, according to the Ontario Provincial Police (OPP).\n\n Mississauga tow truck driver charged for impersonating a cop in northern Ont.\n\n A southern Ontario resident has been charged for allegedly impersonating a peace officer during a towing incident in northwestern Ontario.\n\n Delta, B.C., port terminals closed after 'machinery fire' Saturday morning\n\n A large fire at the port in Delta, B.C., sent a plume of smoke into the sky Saturday morning.\n\n Tugboats, crews try to refloat ship stuck in St. Lawrence River near Montreal\n\n A team of tugboats is being deployed to refloat a ship that has been stuck in the St. Lawrence River northeast of Montreal since Christmas Eve.\n\n Montreal SPCA at full capacity amid spike in pet surrenders\n\n The holiday season is typically a slow period for the Montreal SPCA, but this year is different. The animal shelter says the tough economic climate has taken a toll on its operation, leaving it at full capacity.\n\n What is known about a plane crash in Kazakhstan after Putin apologized for a 'tragic incident'?\n\n Russian President Vladimir Putin on Saturday apologized to his Azerbaijani counterpart for what he called a 'tragic incident' following the crash of an Azerbaijani airliner in Kazakhstan that killed 38 people, but stopped short of acknowledging that Moscow was responsible.\n\n Friend of Quebec man killed in Florida boat explosion says his sister also injured\n\n A childhood friend of the Quebec man killed in a Florida boat explosion earlier this week says one of the victim's sisters was among the other six passengers injured in the blast.\n\n Russia's Putin apologizes to Azerbaijan over 'tragic' airliner crash\n\n Russia's President Vladimir Putin on Saturday apologized to Azerbaijan's leader for what the Kremlin called a 'tragic incident' over Russia in which an Azerbaijan Airlines plane crashed after Russian air defenses were fired against Ukrainian drones.\n\n MAGA opponents of Elon Musk claim he stripped them of their X badges\n\n The debate roiling the MAGA world in recent days over visas for highly skilled workers shows no signs of abating. Some prominent online personalities are now accusing Elon Musk of using his social media platform, X, to retaliate against those who disagree with his support of the H-1B visa program.\n\n The husband-wife legal team working on two of today’s biggest criminal cases\n\n The rapper Sean 'Diddy' Combs and the suspected health care CEO assassin Luigi Mangione have decided on a similar defense strategy: Hire an Agnifilo. Or two.\n\n Italian journalist Cecilia Sala detained by police while reporting in Iran\n\n An Italian journalist who was reporting in Tehran has been detained by the Iranian police, Italy's foreign ministry said in a statement Friday.\n\n Calgary Skyview MP George Chahal joins growing chorus of Liberals calling for Trudeau to step down\n\n Calgary Liberal MP George Chahal has publicly released letters he sent to the Liberal caucus and president of the Liberal Party of Canada, calling on them to begin the process of moving on from Prime Minister Justin Trudeau.\n\n Criminologist says Canada should better track foreign student departures\n\n A Canadian criminologist who once worked on inland immigration enforcement for the Canada Border Services Agency says Canada needs to better track foreign nationals who arrive in the country on student visas.\n\n Gerry Butts says Trudeau less likely to remain leader since Freeland quit\n\n A former chief adviser and close friend to Prime Minister Justin Trudeau said Friday he doesn't think Trudeau will stay on to lead the Liberals in the next election.\n\n If you're mentally struggling during the holidays, here’s how to cope\n\n For many people, celebrating New Year’s Day can include reflecting on a life well lived or a chance to start anew. But for some, the holiday may have dark undertones, according to a recent large study.\n\n Whooping cough in Canada: Outbreaks or case increases reported in these provinces\n\n Canadian health officials say they're seeing spikes in whooping cough cases in parts of the country as the U.S. deals with case numbers not seen in more than a decade.\n\n Physical therapy is 'the best-kept secret in health care'\n\n If you think physical therapy is only about rehabilitation after surgery or recovering from an accident, think again. For the vast majority, seeing a physical therapist should be about prevention, routine assessment and staying well.\n\n Beware the slithering scales: Monkeys fear snakeskin even when it's not on a snake, study suggests\n\n A new study suggests monkeys can identify snakes by their scales, and know to fear them, even when those scales aren't on a snake.\n\n Why Nefertiti still inspires, 3,300 years after she reigned\n\n In the modern day, Nefertiti’s significance as a cultural icon remains strong.\n\n NASA spacecraft 'safe' after closest-ever approach to sun\n\n NASA said on Friday that its Parker Solar Probe was 'safe' and operating normally after successfully completing the closest-ever approach to the sun by any human-made object.\n\n Entertainment \n\n Canadian model Dayle Haddon dies from suspected carbon monoxide poisoning\n\n Dayle Haddon, an actor, activist and trailblazing former 'Sports Illustrated' model who pushed back against age discrimination by reentering the industry as a widow, has died in a Pennsylvania home from what authorities believe was carbon monoxide poisoning.\n\n 'Home Alone' director Chris Columbus explains how the McCallisters were able to afford that house\n\n Audiences have wondered for years how the family in 'Home Alone' was able to afford their beautiful Chicago-area home and now we know.\n\n Judge says woman accusing Jay-Z, Sean 'Diddy' Combs of raping her at age 13 can proceed anonymously\n\n An Alabama woman who says she was raped by Jay-Z and Sean 'Diddy' Combs when she was 13 can proceed anonymously, for now, in her lawsuit against the rap moguls, a judge ruled Thursday.\n\n Markets stumble as Wall Street sells off Big Tech\n\n U.S. stocks ended Friday in the red, closing out a lackluster week despite a year of historic highs.\n\n Trump asks U.S. Supreme Court to pause law that could ban TikTok\n\n President-elect Donald Trump has urged the U.S. Supreme Court to pause implementation of a law that would ban popular social media app TikTok or force its sale, arguing he should have time after taking office to pursue a 'political resolution' to the issue.\n\n Montenegro approves the extradition of cryptocurrency mogul Do Kwon to the United States\n\n Montenegro has approved the extradition of a South Korean mogul known as \"the cryptocurrency king\" to the United States, the Balkan country's Justice Ministry said on Friday.\n\n Lifestyle \n\n Proposal gone wrong: Man opens ring box to find ring missing\n\n Dave Van Veen wanted to make his proposal to his girlfriend, Kailyn Kenney, memorable. It was, but not for the reason he had hoped.\n\n Missing dog returns to Florida family, rings doorbell\n\n After a nearly weeklong search, Athena, a four-year-old German Shepherd and Husky mix, found her way home to her Florida family in time for Christmas Eve and even rang the doorbell.\n\n Winning ticket for US$1.22 billion lottery jackpot sold in California, Mega Millions says\n\n At least one Mega Millions player has plenty of dough to ring in the New Year after drawing the winning number. After three months without anyone winning the top prize in the lottery, a ticket worth an estimated US$1.22 billion was sold in California for the drawing Friday night.\n\n New Canadians, non-traditional demographics boost minor hockey uptake in B.C.\n\n Participation in hockey in British Columbia was struggling in 2021 — the pandemic had dealt a heavy blow to player registrations, and numbers had already been flagging before COVID-19 arrived.\n\n Magnus Carlsen quits World Rapid and Blitz Championships after refusing to change out of jeans\n\n World No. 1 Magnus Carlsen quit the World Rapid Chess Championship on Friday after he refused to change out of the jeans he was wearing, according to the International Chess Federation (FIDE).\n\n Sportscaster Greg Gumbel dies from cancer at age 78\n\n Greg Gumbel, a longtime CBS sportscaster who broke barriers during his career calling some of the biggest sporting events, has died from cancer, according to a statement from his family released by the network on Friday. He was 78.\n\n Suzuki Motor former boss who turned the minicar maker into a global player dies at 94\n\n Osamu Suzuki, the charismatic former boss of Suzuki Motor Corp. who helped turn the Japanese mini-vehicle maker into a globally competitive company, has died, the company said Friday. He was 94.\n\n More drivers opt for personalized plates in Sask. — and behind every one there's a story\n\n You may have noticed a few more vanity plates on Saskatchewan roads in recent years, and every one of them comes with a personal story.\n\n Nissan and Honda to attempt a merger that would create the world's No. 3 automaker\n\n Japanese automakers Honda and Nissan have announced plans to work toward a merger that would form the world's third-largest automaker by sales, as the industry undergoes dramatic changes in its transition away from fossil fuels.\n\n Local Spotlight \n\n Community partners in Windsor propose education campaign to veer people away from payday loans\n\n In a move aimed at combatting the financial strain caused by payday loans, the City of Windsor is considering the launch of a comprehensive education campaign to promote alternative financial options.\n\n Port Elgin, Ont. woman named Canada's Favourite Crossing Guard\n\n A Port Elgin woman has been named one of three of Canada’s Favourite Crossing Guards in a recent contest.\n\n 'Something that connected us all': For 53 years, Sask. family celebrates holidays with street hockey game\n\n For over 50 years, Stephen Lentzos and his family have celebrated Christmas Day with a street hockey game.\n\n 43-quintillion combinations: Speedcubers solve Rubik's Cubes in record breaking times\n\n On Saturday, Barrie is testing the abilities of some of the fastest cube solvers from across the province and around the world.\n\n B.C woman awarded nearly $750K in court case against contractor\n\n A B.C. woman has been awarded nearly $750,000 in damages in a dispute with a contractor who strung her along for a year and a half and failed to complete a renovation, according to a recent court decision.\n\n Ho! Ho! HOLY that's cold! Montreal boogie boarder in Santa suit hits St. Lawrence waters\n\n Montreal body surfer Carlos Hebert-Plante boogie boards all year round, and donned a Santa Claus suit to hit the water on Christmas Day in -14 degree Celsius weather.\n\n Teen cancer patient pays forward Make-A-Wish donation to local fire department\n\n A 16-year-old cancer patient from Hemmingford, Que. decided to donate his Make-A-Wish Foundation gift to the local fire department rather than use it himself.\n\n B.C. friends nab 'unbelievable' $1M lotto win just before Christmas \n\n Two friends from B.C's lower mainland are feeling particularly merry this December, after a single lottery ticket purchased from a small kiosk landed them instant millionaire status.\n\n 'Can I taste it?': Rare $55,000 bottle of spirits for sale in Moncton, N.B.\n\n A rare bottle of Scotch whisky is for sale in downtown Moncton, N.B., with a price tag reading $55,000.\n\n Vancouver \n\n Vancouver man defrauded Chinese developers of US$500K, court rules\n\n A Vancouver man has been ordered to pay more than US$500,000 after a B.C. Supreme Court judge found he had defrauded the would-be developers of a real estate project in China of that amount.\n\n Victoria police seek witnesses, additional victims after hit-and-run spree\n\n A woman is facing seven charges after allegedly committing multiple hit-and-run crashes in a stolen vehicle while impaired, according to police in B.C.'s capital.\n\n Delta, B.C., port terminals closed after 'machinery fire' Saturday morning\n\n A large fire at the port in Delta, B.C., sent a plume of smoke into the sky Saturday morning.\n\n Toronto, GTA to see ‘significant rainfall’ on Sunday\n\n Toronto and neighbouring areas are expected to see “significant rainfall” on Sunday. Environment Canada has issued a rainfall warning for most of the Greater Toronto Area.\n\n 1 person in hospital, suspect in police custody following stabbing in Fairbank\n\n One person is in hospital, and a suspect is in custody following a stabbing in Toronto’s Fairbank neighbourhood on Saturday.\n\n One person injured, suspect charged with arson following Etobicoke apartment fire\n\n A suspect has been charged with arson after a two-alarm fire at an Etobicoke apartment complex early Saturday morning left one person with injuries.\n\n Danielle Smith meet-and-greet with Calgary Chinese community wins some hearts but not all\n\n Danielle Smith dropped by the Edgemont Community Association for a meet-and-greet Saturday with some member's of Calgary's Chinese community to answer questions and press the flesh, but a format change left Helen Yu feeling a little shortchanged.\n\n Calgary Skyview MP George Chahal joins growing chorus of Liberals calling for Trudeau to step down\n\n Calgary Liberal MP George Chahal has publicly released letters he sent to the Liberal caucus and president of the Liberal Party of Canada, calling on them to begin the process of moving on from Prime Minister Justin Trudeau.\n\n Lethbridge Police investigating suspicious death inside motel room\n\n Lethbridge Police are investigating after a body was found inside a southside motel room on Saturday.\n\n FREEZING DRIZZLE ADVISORY \n\n FREEZING DRIZZLE ADVISORY | \n\n Slippery road conditions expected in Ottawa with freezing drizzle tonight\n\n Environment Canada has issued a freezing drizzle advisory, warning of slippery road conditions tonight.\n\n G2 driver stopped going more than 100 km/h over the speed limit on Hwy. 401 in eastern Ontario\n\n A 17-year-old driver is facing charges after being caught speeding and driving dangerously on Highway 401 in eastern Ontario Friday evening, according to the Ontario Provincial Police (OPP).\n\n TC Energy says early morning gas leak near Cornwall, Ont. resolved\n\n A gas leak that happened at a compressor station near Cornwall, Ont. Saturday morning has been controlled, according to TC Energy.\n\n Friend of Quebec man killed in Florida boat explosion says his sister also injured\n\n A childhood friend of the Quebec man killed in a Florida boat explosion earlier this week says one of the victim's sisters was among the other six passengers injured in the blast.\n\n Women’s hockey looks to expand coverage and support as spotlight grows\n\n More girls and women than ever are lacing up their skates and hitting the ice. The rising popularity of women's hockey is driven by inspiration believes hockey coach Hanna Bunton\n\n Here's how you can watch CTV News Montreal at Six on Saturday during the NFL season\n\n With CTV broadcasting NFL football games on Saturday this season, CTV News Montreal at Six will be broadcasting live on our website and the CTV News App.\n\n Edmonton street photographer captures moments and people one frame at a time\n\n A local photographer who is passionate about capturing moments in one-hundredth of a second embraced many styles of his trade before landing on one which truly represents his mantra: street photography.\n\n 2 vehicles fall through ice at Sylvan Lake, promoting police warning\n\n RCMP issued a warning Saturday after two vehicles fell through the ice on Sylvan Lake.\n\n Late OT goal helps lift Kings past Oilers 4-3\n\n Quinton Byfield scored his second goal of the game with 1:41 remaining in overtime as the Los Angeles Kings beat the Edmonton Oilers 4-3 on Saturday.\n\n No one injured after vehicle crashes into Shoppers Drug Mart: N.S. RCMP\n\n RCMP is investigating after a vehicle crashed into a Shoppers Drug Mart in Lower Sackville, N.S. on Saturday.\n\n Nova Scotia Muslim Society making hot meals and winter care packages for those in need\n\n For the fourth consecutive year, the Nova Scotia Islamic Society got together on Saturday to prepare warm meals and winter care packages to hand out for their community.\n\n Environment Canada forecasts mix of freezing rain and rain for parts of Maritimes\n\n Some nasty weather is headed toward parts of the Maritimes over the next few days, bringing with it a mix of freezing rain, rain and snow.\n\n The most-read stories on CTV Winnipeg in 2024\n\n Historic events, community pride and significant losses dominated headlines in Manitoba in 2024. Here’s a list of the most-read stories of each month of 2024 on CTV News Winnipeg.\n\n Cross-country ski race returns to Windsor Park\n\n The Prairie Holiday Loppet made its long-awaited return to Winnipeg’s Windsor Park Saturday, with dozens of racers hitting the trails.\n\n Have you seen Genevieve? RCMP search for woman last seen on Christmas Eve\n\n Thompson RCMP are searching for a woman who went missing from Split Lake earlier this week.\n\n 'A great holiday memory': Echo Valley Provincial Park gets plenty of visitors at Skate the Park launch\n\n Families and groups of friends made use of the good weather as the new season of Skate the Park got underway at Echo Valley Provincial Park.\n\n Missing 89-year-old Moose Jaw man found dead, no foul play suspected: Police\n\n Regina police chief says new initiatives to enhance community safety will come in 2025\n\n Looking back after one year in his new role as the chief of the Regina Police Service, Farooq Hassan Sheikh is highlighting challenges the city faces, what has worked during his tenure and what can be done to improve policing in 2025.\n\n Kitchener \n\n Cambridge industrial plant dealing with major damages after fire\n\n A fire Saturday morning has a Cambridge industrial plant dealing with major damage.\n\n Minor flooding possible with snow melt, rain on way: GRCA\n\n The Waterloo Region and the city of Guelph will be wrapping up 2024 with unusually warm weather over the weekend.\n\n Stretch of Kitchener road closed after gas leak at abandoned building\n\n Kitchener Fire is investigating after a \"strange odor\" was reported on Courtland Avenue East Saturday.\n\n Saskatoon \n\n U18 provincials curling tournament underway in PA\n\n Teams from across Saskatchewan are in Prince Albert for the U18 curling provincials.\n\n Police made two arrests following a shooting in Saskatoon\n\n A swift response from Saskatoon police led to the arrest of a man and woman following a reported shooting Friday afternoon.\n\n Saskatoon fire crews battle house fire\n\n Saskatoon firefighters responded to a house fire on the 100 block of Klassen Crescent Friday afternoon.\n\n Northern Ontario \n\n Pair of 911 calls leads to two impaired driving arrests in three hours\n\n A pair of 911 calls from concerned citizens led to two separate impaired driving charges in a single northern Ontario town within three hours.\n\n Calgary Skyview MP George Chahal joins growing chorus of Liberals calling for Trudeau to step down\n\n Calgary Liberal MP George Chahal has publicly released letters he sent to the Liberal caucus and president of the Liberal Party of Canada, calling on them to begin the process of moving on from Prime Minister Justin Trudeau.\n\n Five southern Ont. hunters fined $37K for moose hunt offences in northern Ont.\n\n A multi-year moose hunting investigation resulted in five people being convicted of moose hunting offences and fined a total of $37,000, plus $9,250 in victim surcharges.\n\n St. Thomas fraud victim loses nearly $100K to job scam\n\n According to police, the victim was investing money into a company that they believed they were employed by for over a month.\n\n Ending the year with above seasonal temperatures\n\n Warmer conditions are expected in the London, Ont. region this weekend, with the high forecast in the double digits.\n\n Trudeau, Carney push back over Trump's ongoing 51st state comments\n\n Two senior members of the federal cabinet were in Florida Friday pushing Canada's new $1.3 billion border plan with members of Donald Trump's transition team, a day after Prime Minister Justin Trudeau himself appeared to finally push back at the president-elect over his social media posts about turning Canada into the 51st state.\n\n Deluxe taxi goes up in flames in Barrie parking lot\n\n Some locals were quick to pull out their cellphones and capture a minivan as it went up in hot flames in a Barrie parking lot.\n\n Boxing Day bust: Police allege shopper stole from LCBO amid holiday rush\n\n While Boxing Day is known for securing the best deals, one local shopper took things too far and allegedly tried to score a deal at a free cost.\n\n County Road 56 reopens following afternoon collision\n\n County Road 56 in Essa Township was closed for an afternoon collision.\n\n Community partners in Windsor propose education campaign to veer people away from payday loans\n\n In a move aimed at combatting the financial strain caused by payday loans, the City of Windsor is considering the launch of a comprehensive education campaign to promote alternative financial options.\n\n Ex-boyfriend arrested for violating bail conditions\n\n Chatham-Kent police have made an arrest after a man allegedly violated his bail conditions.\n\n Trudeau, Carney push back over Trump's ongoing 51st state comments\n\n Two senior members of the federal cabinet were in Florida Friday pushing Canada's new $1.3 billion border plan with members of Donald Trump's transition team, a day after Prime Minister Justin Trudeau himself appeared to finally push back at the president-elect over his social media posts about turning Canada into the 51st state.\n\n Vancouver Island \n\n Victoria police seek witnesses, additional victims after hit-and-run spree\n\n A woman is facing seven charges after allegedly committing multiple hit-and-run crashes in a stolen vehicle while impaired, according to police in B.C.'s capital.\n\n Vancouver man defrauded Chinese developers of US$500K, court rules\n\n A Vancouver man has been ordered to pay more than US$500,000 after a B.C. Supreme Court judge found he had defrauded the would-be developers of a real estate project in China of that amount.\n\n New Canadians, non-traditional demographics boost minor hockey uptake in B.C.\n\n Participation in hockey in British Columbia was struggling in 2021 — the pandemic had dealt a heavy blow to player registrations, and numbers had already been flagging before COVID-19 arrived.\n\n B.C. team building 100 beaver 'starter homes' in the name of wetland preservation\n\n More than 70 manmade beaver dams have been installed in Interior waterways since the B.C. Wildlife Federation project launched last year with the goal of building 100 dams by the end of 2025.\n\n B.C. man charged with drug trafficking and weapons offences after CBSA investigation\n\n A resident of B.C.'s Interior has been charged with weapon and drug trafficking offences after an investigation launched by border agents at Vancouver International Airport earlier this year.\n\n B.C woman awarded nearly $750K in court case against contractor\n\n A B.C. woman has been awarded nearly $750,000 in damages in a dispute with a contractor who strung her along for a year and a half and failed to complete a renovation, according to a recent court decision.\n\n Lethbridge \n\n Lethbridge Police investigating suspicious death inside motel room\n\n Lethbridge Police are investigating after a body was found inside a southside motel room on Saturday.\n\n Family and friends grieve death of 36-year-old Lethbridge man in motorcycle crash\n\n Family members and friends are mourning the loss of a 36-year-old Lethbridge man killed in motorcycle crash just two days before Christmas.\n\n Hurricanes launch second half of WHL season with 4-1 win over Hitmen\n\n The Lethbridge Hurricanes kicked off the second half of the season with a win Friday night, topping the Calgary Hitmen 4-1.\n\n Sault Ste. Marie \n\n Mississauga tow truck driver charged for impersonating a cop in northern Ont.\n\n A southern Ontario resident has been charged for allegedly impersonating a peace officer during a towing incident in northwestern Ontario.\n\n Man shot by officer after firing at police car near Thunder Bay: SIU\n\n Ontario's Special Investigations Unit is probing a shooting near Thunder Bay in which a man was shot and wounded by a police officer on Boxing Day.\n\n Alleged impaired driver crashes into police cruiser on Boxing Day\n\n While on general patrol in northwestern Ontario on Boxing Day, an Ontario Provincial Police officer’s vehicle was struck.\n\n Icebreaker on hand in Labrador to guide season's last freight arrivals by ferry\n\n A Canadian Coast Guard icebreaker is in central Labrador until Saturday to guide the Kamutik W ferry on its last freight deliveries of the season.\n\n Whooping cough in Canada: Outbreaks or case increases reported in these provinces\n\n Canadian health officials say they're seeing spikes in whooping cough cases in parts of the country as the U.S. deals with case numbers not seen in more than a decade.\n\n Her son needed help with addiction. Instead, he's spending Christmas in N.L. jail.\n\n As Gwen Perry prepares for a Christmas without contact from her son, who is locked inside a notorious St. John's, N.L., jail, she wants people to understand that many inmates need help, not incarceration.\n\n Stay Connected","summary":"U.S. president-elect Donald Trump appears to be siding with Elon Musk and his other backers in the tech industry as a dispute over immigration visas has divided his supporters.","url":"https://www.ctvnews.ca/world/trump-appears-to-side-with-musk-tech-allies-in-debate-over-foreign-workers-roiling-his-supporters-1.7159494","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/28/donald-trump--elon-musk-1-7159495-1735432308946.jpg","video":null,"publish_date":"2024-12-29 00:32:03","author":"Michelle L. Price,The Associated Press","authors":["Michelle L. Price","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.112},{"id":276765444,"title":"'The first thing the media made sure to focus on was that they’re Israeli'","text":"The American media is used to covering scandals involving high-profile multimillionaires accused of severe sexual crimes. Names like Harvey Weinstein, R. Kelly, Jeffrey Epstein and Sean \"Diddy\" Combs are among those who have dominated headlines. Recently, three Israeli brothers from Miami — Tal Alexander and twins Oren and Alon Alexander — have joined this infamous list, as their case grips the Jewish community and remains a hot topic across the U.S. The brothers, who made their fortune in real estate and security, stand accused of a series of rapes allegedly committed between 2010 and 2021. So far, 40 women have come forward with testimonies alleging sexual assaults by the brothers. FBI agent Justine Atwood, testifying in court, said that the women’s accounts are credible, noting that the victims come from diverse backgrounds, do not know each other and reported being attacked by the brothers at different times. Tal Alexander, 38, married last year and is the father of an infant less than a month old. Alon Alexander, 37, is married to Israeli model Shani Zigron, with whom he has two young daughters. Oren Alexander, also 37, is married to a Brazilian model who is expecting to give birth soon. Tal and Oren Alexander rose to prominence as owners of a successful real estate company specializing in luxury apartment sales, primarily in Manhattan. Their careers skyrocketed five years ago after they brokered a $240 million sale of a luxury penthouse near Central Park to billionaire Ken Griffin, one of the largest real estate deals in U.S. history. The transaction cemented the Alexander brothers’ status as key players in the luxury market, earning them features in leading U.S. financial publications. Over the years, their real estate transactions are estimated to have been worth billions of dollars. The third brother, Alon, managed the family’s security business, valued at tens of millions of dollars, alongside their parents, with their mother serving as the company’s chief financial officer. Seven years ago, twins Alon and Oren celebrated their 30th birthday at the upscale Claro restaurant in Tel Aviv’s Sarona district, with a guest list that included Israeli billionaire Shari Arison, Donald Trump’s former advisor Aaron Jordan and other prominent figures. The evening featured a video produced by Hollywood filmmaker Alan Fiana, documenting their lives from birth. Guests from the U.S., London and Russia were accommodated in Tel Aviv’s luxury hotels, and the multi-day celebrations included a performance by Israeli singer Einat Sarouf, a Hercules plane ride with millionaire Benny Shabtai, meetings with top executives and private jet trips to Mykonos for additional festivities. These opulent lifestyles have come to a grinding halt. The brothers appeared in court recently, handcuffed, unshaven and dressed in prison uniforms. According to the indictment, they are accused of being serial sexual predators who allegedly coerced dozens of women into sexual acts through the use of alcohol and drugs. The alleged assaults date back to their high school years, when, according to the lawsuit, they boasted about committing group sexual assaults. The accusations span several locations, including Manhattan, the Hamptons in Long Island, Miami Beach and Tulum, Mexico. Generous donors to Israel Since the case made headlines, the Israeli community in Miami has been abuzz. The parents, Orly and Shlomi Alexander, are well-known and respected figures in the city, not only for their financial success but also for their generous contributions to causes supporting Israel and Israeli organizations. Their donations have benefited groups such as Friends of the IDF in the U.S., United Hatzalah and the Jewish Federation. “They are a very positive family, big Zionists who came to the U.S. from Rishon Lezion as a young, struggling couple,” says a family acquaintance. “They built their wealth from scratch, founded Kent Security, entered the real estate sector and made their fortune through hard work.” Get the Ynetnews app on your smartphone: Google Play: https://bit.ly/4eJ37pE | Apple App Store: https://bit.ly/3ZL7iNv The acquaintance adds that the four brothers (the eldest, Niv, is not named in the lawsuit) attended Jewish schools before transferring to public schools. “They were generous donors. Three years ago, they raised $2 million for the IDF. The parents are active synagogue members and close to the rabbi.” Regarding the serious allegations against the brothers, he says, “I don’t know what happened, but I think it’s far from how the media is portraying it—we need to wait for the trial.” Not everyone agrees. Some community members expressed less surprise at the scandal. Liat (a pseudonym), a Miami resident of 15 years, claims to have heard rumors about the brothers’ behavior years ago. “They used to throw lavish parties in the city, were boastful and acted as if they could do whatever they wanted because they were rich. Our entire community is talking about this, and people feel they’re tarnishing our reputation as Israelis because the first thing the media made sure to focus on was that they’re Israeli.” A friend of the family expressed shock upon hearing the allegations. “I always thought to myself, ‘What a happy family.’ They were the envy of others. I’d see pictures of their vacations and parties—they exuded happiness and wealth, the perfect family. I’m trying not to judge, but it’s hard. Maybe some of the women tried to extort money from them, and when they refused, they decided to sue. But it’s impossible that all of them are lying.” Nicki Salfer, founder of Learning Tree, a service for students with special needs, spoke highly of Orly Alexander, the brothers’ mother. “I feel terrible for her. She’s a very kind, spiritual and generous woman involved in many organizations and projects. When my daughter’s mother-in-law was battling cancer, Orly would often visit her and be wonderful to her—that’s how I first met her. Later, I saw her at various community gatherings and was always impressed by her generosity.” One of the alleged assaults involves a close associate of the brothers, Ohad Fisherman. According to the accusations, Fisherman and Alon invited a woman to Alon’s Miami Beach apartment, where Fisherman allegedly pinned her to the bed with his knees while the twins discussed who would rape her first. The woman reportedly cried and begged them to stop, but the twins refused. Fisherman, a successful real estate businessman, was on his honeymoon in Japan when the case broke. He returned to the U.S. promptly, was arrested and released on $25,000 bail with an additional $260,000 personal guarantee from his mother-in-law. He is currently under house arrest. The court rejected the Alexander brothers’ request for bail, even after their legal team offered a $115 million guarantee backed by family-owned real estate holdings, including the parents’ home in Bal Harbour and three properties belonging to the brothers. The judge cited concerns that the brothers might flee the country, noting their financial means to charter a plane or boat, potentially to Israel. The brothers’ attorneys have filed an appeal against the decision, with a new hearing scheduled for December 30. Currently detained in Miami, the brothers are expected to be transferred to the same New York prison housing producer and rapper Sean \"Diddy\" Combs and where Jeffrey Epstein was held before his death by suicide. Follow Ynetnews on Facebook | Twitter | Instagram | Telegram","url":"https://www.ynetnews.com/business/article/r1dgvf6hyl","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2024/12/26/SJhoUT9ryl/SJhoUT9ryl_0_0_3000_2066_0_large.jpg","video":null,"publish_date":"2024-12-29 00:27:51","author":"Ayala Or-El","authors":["Ayala Or-El"],"language":"en","source_country":"il","sentiment":0.266},{"id":276765440,"title":"The 'diplomatic Iron Dome' Israel didn't know it needed","text":"A sea change is expected on January 20, when President-elect Donald Trump takes office, and Israel is poised to feel its impact, according to Joshua Reinstein, President of the Israel Allies Foundation. “When Trump comes in, he is going to sign a variety of executive orders. I don’t think you’re going to see any more lawfare like the International Criminal Court. I think you’re going to see the end of UNRWA [The United Nations Relief and Works Agency for Palestine Refugees in the Near East]. You’re going to see Jerusalem embassies opening up one after another,” Reinstein told ILTV News on this week’s podcast. “It’s a new dawn. And this is thanks to our Christian allies. This is what we’ve been working for over the last 21 years—to mobilize Christians around the world to stand with Israel and create real political action. “I think the best is yet to come for faith-based diplomacy,” he added. Reinstein spoke with ILTV shortly after MK Moshe Tur Paz was appointed co-chair of the Knesset Christian Allies Caucus. This caucus, one of 54 worldwide, is designed to mobilize political support from lawmakers who stand with Israel out of faith. While the caucus is open to all, it primarily includes Christians who view Israel as the fulfillment of biblical prophecy. Tur Paz, a member of the centrist Yesh Atid party, has been involved with the caucus for four years. Reflecting on the challenges Israel has faced, he said, “In the past year, we have confronted Iran in ways we never have since the country’s founding.” He emphasized the importance of U.S. support, saying, “Now, we need the Americans there with us. We have faced antisemitic voices around the world. When we have Donald Trump and his administration on our side, it’s a completely different battle—a stronger way to fight.” Tur Paz also expressed optimism about the future. “We know we may have new challenges ahead, but we have a strong friend in the United States—in Congress and the White House. That’s a big, big thing for Israel.” Reinstein believes the Trump administration will be “the most pro-Israel administration in the history of American-Israel relations, even more so than the last Trump administration, which was probably Israel’s greatest supporter to date.” He attributes this to the Republican Party’s strong base of Bible-believing Christians and Trump’s selection of like-minded individuals for key positions. “For example, Peter Hegseth, nominated to be Secretary of Defense, is an evangelical Christian. The U.S. Ambassador to Israel nominee, Mike Huckabee, is also an evangelical Christian,” Reinstein said. “These individuals, and many others, support Israel not just for political or economic reasons, but because of their faith. That’s a kind of support that doesn’t waver,” he stressed. Reinstein anticipates a wave of embassies opening in Jerusalem soon after Trump takes office, with countries from Africa, Latin America, and even Europe expressing interest. While he did not confirm specifics, he suggested Argentina might be next, followed by nations like Fiji, Malawi, Hungary, the Czech Republic, and Romania. “As the Trump administration works with Israel, there could be a package of benefits for countries that recognize Jerusalem as Israel’s capital. This aligns with official U.S. policy and, of course, Israel’s policy,” Reinstein explained. A Diplomatic Iron Dome The role of the Israeli allies caucuses has grown significantly since the October 7 Hamas massacre. Reinstein described them as “the diplomatic Iron Dome of the State of Israel,” with around 1,500 legislators advocating for Israel in their own parliaments since the war began. “We’re seeing faith-based diplomacy in action worldwide,” Reinstein said. “For example, Australia’s parliamentary Israel caucus passed legislation banning antisemitic symbols in public. This is crucial in a country that has seen an unprecedented spike in antisemitism.” In another case, the Dutch parliament decided to phase out funding for UNRWA, following advocacy by former caucus co-chair and Deputy Foreign Minister Sharren Haskel. She visited the Netherlands twice to highlight how UNRWA had been infiltrated by terrorists. Even at the International Criminal Court, when a case against Israel was publicly presented, 500 Christians stood outside waving Israeli flags. Some Jews have historically been hesitant to work with Christians due to a history of antisemitism and persecution. However, both Reinstein and Tur Paz said these attitudes are shifting. “Eighty percent of our diplomatic successes now come from faith-based diplomacy,” Reinstein said. “People are realizing there’s nothing more powerful than Christian support for Israel. There are 15 million Jews in the world and a billion Christians.” Tur Paz agreed. “Faith-based diplomacy is great for Israel and the world. I’d like to see similar partnerships with Muslims,” he said. “It’s about people-to-people and faith-to-faith. If we can work together in this way, it’s a great path for the world.”","url":"https://www.ynetnews.com/article/s1aixhohye","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2023/11/09/By2KU9q7T/By2KU9q7T_0_164_1577_888_0_large.jpg","video":null,"publish_date":"2024-12-29 00:27:51","author":"Maayan Hoffman","authors":["Maayan Hoffman"],"language":"en","category":"politics","source_country":"il","sentiment":0.206},{"id":276765430,"title":"Iran says 2025 'important year' for nuclear issue","text":"Iran, bracing for a possible re-imposition of incoming U.S. president Donald Trump's \"maximum pressure\" policy, said on Saturday that 2025 would be an important year for its nuclear issue. Trump in 2018 reneged on a deal struck by his predecessor Barack Obama in 2015 in which Iran agreed to curb uranium enrichment, which can yield material for nuclear weapons, in return for the relaxation of U.S. and UN economic sanctions. \"2025 will be an important year regarding Iran's nuclear issue,\" Foreign Minister Abbas Araqchi told reporters in Beijing, adding in remarks aired by Iran's state TV that he had discussed the issue in talks with his Chinese counterpart. He did not mention Trump by name, however, or spell out how the year might be significant. Iranian leaders' main concern may be that Trump could empower Prime Minister Benjamin Netanyahu to attack Iran's nuclear sites, while further tightening U.S. sanctions on its crucial oil industry. The Iranian rial on Saturday hit a new all-time low against the U.S. dollar amid uncertainty about Trump's arrival in the White House on Jan. 20. Get the Ynetnews app on your smartphone: Google Play: https://bit.ly/4eJ37pE | Apple App Store: https://bit.ly/3ZL7iNv The rial plunged to 820,500 to the dollar on the unofficial market, compared to 808,500 rials on Friday, according to Bonbast.com, which reports exchange rates. The bazar360.com website also said the dollar was being sold for about 820,500 rials. Also facing an inflation rate officially put at about 35%, Iranians seeking to shelter their savings have been buying dollars, other hard currencies, gold or cryptocurrencies, and the rial has dropped about 18% in all since Trump was elected in November. Follow Ynetnews on Facebook | Twitter | Instagram | Telegram","url":"https://www.ynetnews.com/article/r1dp5opbyx","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2024/10/27/rJh9l112g1e/rJh9l112g1e_0_0_1200_799_0_large.jpg","video":null,"publish_date":"2024-12-29 00:27:51","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"il","sentiment":-0.404},{"id":276768646,"title":"15 hurt when passenger train strikes fire truck that drove into crossing after freight train passed","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n Here Are All The Best Amazon Boxing Day Deals You Can Find On Beauty Products In Canada\n\n These Walking Pads Will Help You Get 10,000 Steps Every Day (And They're On Sale In The Name Of Boxing Day)\n\n 10 Family Calendars And Planners That'll Help You Keep Track Of Everything In The New Year\n\n If You're Headed Somewhere Warm On Vacation, Don't Forget To Pack These 16 Things\n\n Our Guide To The Best Snow Shovels In Canada In 2024 (And Where To Get Them)\n\n 14 Of The Best Home Security Devices You Can Find Online Right Now (And They've Got The Reviews To Prove It)\n\n The Clock Is Ticking — Shop These 25 Last-Minute Amazon Prime Gifts Now\n\n If You Have An Amazon Prime Account, These 70+ Crowd-Pleasing Gifts Will Still Arrive Before Christmas\n\n If You Have An Amazon Prime Account, These 50 Brilliant Stocking Stuffers Will Still Arrive Before Christmas\n\n 20 Products Your Dry, Dehydrated Skin Will Thank You For Ordering\n\n 14 Hydrating Face Masks That’ll Save Your Skin This December\n\n 12 Budget-Friendly Products To Add To Your Winter Skincare Routine\n\n 11 Bestselling Coffee Makers And Espresso Machines You Can Get On Sale Right Now\n\n Don’t Walk, Run! These LEGO Kits Are On Sale For Boxing Day 2024\n\n The Waterpik Advanced Water Flosser Will Make Cleaning Your Teeth So Much Easier — And It's 41% Off For Boxing Day\n\n CTVNews.ca Top Stories\n\n Canadian model Dayle Haddon dies from suspected carbon monoxide poisoning\n\n Dayle Haddon, an actor, activist and trailblazing former 'Sports Illustrated' model who pushed back against age discrimination by reentering the industry as a widow, has died in a Pennsylvania home from what authorities believe was carbon monoxide poisoning.\n\n Mississauga tow truck driver charged for impersonating a cop in northern Ont.\n\n A southern Ontario resident has been charged for allegedly impersonating a peace officer during a towing incident in northwestern Ontario.\n\n If you're mentally struggling during the holidays, here’s how to cope\n\n For many people, celebrating New Year’s Day can include reflecting on a life well lived or a chance to start anew. But for some, the holiday may have dark undertones, according to a recent large study.\n\n G2 driver stopped going more than 100 km/h over the speed limit on Hwy. 401 in eastern Ontario\n\n A 17-year-old driver is facing charges after being caught speeding and driving dangerously on Highway 401 in eastern Ontario Friday evening, according to the Ontario Provincial Police (OPP).\n\n 15 hurt when passenger train strikes fire truck that drove into crossing after freight train passed\n\n Three firefighters and a dozen passengers were injured in Florida on Saturday when a fire truck drove around rail crossing arms and into the path of a high-speed passenger train after waiting for another train to pass, according to a person briefed on what happened.\n\n Magnus Carlsen quits World Rapid and Blitz Championships after refusing to change out of jeans\n\n World No. 1 Magnus Carlsen quit the World Rapid Chess Championship on Friday after he refused to change out of the jeans he was wearing, according to the International Chess Federation (FIDE).\n\n Physical therapy is 'the best-kept secret in health care'\n\n If you think physical therapy is only about rehabilitation after surgery or recovering from an accident, think again. For the vast majority, seeing a physical therapist should be about prevention, routine assessment and staying well.\n\n Trudeau, Carney push back over Trump's ongoing 51st state comments\n\n Two senior members of the federal cabinet were in Florida Friday pushing Canada's new $1.3 billion border plan with members of Donald Trump's transition team, a day after Prime Minister Justin Trudeau himself appeared to finally push back at the president-elect over his social media posts about turning Canada into the 51st state.\n\n Friend of Quebec man killed in Florida boat explosion says his sister also injured\n\n A childhood friend of the Quebec man killed in a Florida boat explosion earlier this week says one of the victim's sisters was among the other six passengers injured in the blast.\n\n TC Energy says early morning gas leak near Cornwall, Ont. resolved\n\n A gas leak that happened at a compressor station near Cornwall, Ont. Saturday morning has been controlled, according to TC Energy.\n\n G2 driver stopped going more than 100 km/h over the speed limit on Hwy. 401 in eastern Ontario\n\n A 17-year-old driver is facing charges after being caught speeding and driving dangerously on Highway 401 in eastern Ontario Friday evening, according to the Ontario Provincial Police (OPP).\n\n Mississauga tow truck driver charged for impersonating a cop in northern Ont.\n\n A southern Ontario resident has been charged for allegedly impersonating a peace officer during a towing incident in northwestern Ontario.\n\n Delta, B.C., port terminals closed after 'machinery fire' Saturday morning\n\n A large fire at the port in Delta, B.C., sent a plume of smoke into the sky Saturday morning.\n\n Tugboats, crews try to refloat ship stuck in St. Lawrence River near Montreal\n\n A team of tugboats is being deployed to refloat a ship that has been stuck in the St. Lawrence River northeast of Montreal since Christmas Eve.\n\n Montreal SPCA at full capacity amid spike in pet surrenders\n\n The holiday season is typically a slow period for the Montreal SPCA, but this year is different. The animal shelter says the tough economic climate has taken a toll on its operation, leaving it at full capacity.\n\n What is known about a plane crash in Kazakhstan after Putin apologized for a 'tragic incident'?\n\n Russian President Vladimir Putin on Saturday apologized to his Azerbaijani counterpart for what he called a 'tragic incident' following the crash of an Azerbaijani airliner in Kazakhstan that killed 38 people, but stopped short of acknowledging that Moscow was responsible.\n\n Friend of Quebec man killed in Florida boat explosion says his sister also injured\n\n A childhood friend of the Quebec man killed in a Florida boat explosion earlier this week says one of the victim's sisters was among the other six passengers injured in the blast.\n\n Russia's Putin apologizes to Azerbaijan over 'tragic' airliner crash\n\n Russia's President Vladimir Putin on Saturday apologized to Azerbaijan's leader for what the Kremlin called a 'tragic incident' over Russia in which an Azerbaijan Airlines plane crashed after Russian air defenses were fired against Ukrainian drones.\n\n MAGA opponents of Elon Musk claim he stripped them of their X badges\n\n The debate roiling the MAGA world in recent days over visas for highly skilled workers shows no signs of abating. Some prominent online personalities are now accusing Elon Musk of using his social media platform, X, to retaliate against those who disagree with his support of the H-1B visa program.\n\n The husband-wife legal team working on two of today’s biggest criminal cases\n\n The rapper Sean 'Diddy' Combs and the suspected health care CEO assassin Luigi Mangione have decided on a similar defense strategy: Hire an Agnifilo. Or two.\n\n Italian journalist Cecilia Sala detained by police while reporting in Iran\n\n An Italian journalist who was reporting in Tehran has been detained by the Iranian police, Italy's foreign ministry said in a statement Friday.\n\n Calgary Skyview MP George Chahal joins growing chorus of Liberals calling for Trudeau to step down\n\n Calgary Liberal MP George Chahal has publicly released letters he sent to the Liberal caucus and president of the Liberal Party of Canada, calling on them to begin the process of moving on from Prime Minister Justin Trudeau.\n\n Criminologist says Canada should better track foreign student departures\n\n A Canadian criminologist who once worked on inland immigration enforcement for the Canada Border Services Agency says Canada needs to better track foreign nationals who arrive in the country on student visas.\n\n Gerry Butts says Trudeau less likely to remain leader since Freeland quit\n\n A former chief adviser and close friend to Prime Minister Justin Trudeau said Friday he doesn't think Trudeau will stay on to lead the Liberals in the next election.\n\n If you're mentally struggling during the holidays, here’s how to cope\n\n For many people, celebrating New Year’s Day can include reflecting on a life well lived or a chance to start anew. But for some, the holiday may have dark undertones, according to a recent large study.\n\n Whooping cough in Canada: Outbreaks or case increases reported in these provinces\n\n Canadian health officials say they're seeing spikes in whooping cough cases in parts of the country as the U.S. deals with case numbers not seen in more than a decade.\n\n Physical therapy is 'the best-kept secret in health care'\n\n If you think physical therapy is only about rehabilitation after surgery or recovering from an accident, think again. For the vast majority, seeing a physical therapist should be about prevention, routine assessment and staying well.\n\n Beware the slithering scales: Monkeys fear snakeskin even when it's not on a snake, study suggests\n\n A new study suggests monkeys can identify snakes by their scales, and know to fear them, even when those scales aren't on a snake.\n\n Why Nefertiti still inspires, 3,300 years after she reigned\n\n In the modern day, Nefertiti’s significance as a cultural icon remains strong.\n\n NASA spacecraft 'safe' after closest-ever approach to sun\n\n NASA said on Friday that its Parker Solar Probe was 'safe' and operating normally after successfully completing the closest-ever approach to the sun by any human-made object.\n\n Entertainment \n\n Canadian model Dayle Haddon dies from suspected carbon monoxide poisoning\n\n Dayle Haddon, an actor, activist and trailblazing former 'Sports Illustrated' model who pushed back against age discrimination by reentering the industry as a widow, has died in a Pennsylvania home from what authorities believe was carbon monoxide poisoning.\n\n 'Home Alone' director Chris Columbus explains how the McCallisters were able to afford that house\n\n Audiences have wondered for years how the family in 'Home Alone' was able to afford their beautiful Chicago-area home and now we know.\n\n Judge says woman accusing Jay-Z, Sean 'Diddy' Combs of raping her at age 13 can proceed anonymously\n\n An Alabama woman who says she was raped by Jay-Z and Sean 'Diddy' Combs when she was 13 can proceed anonymously, for now, in her lawsuit against the rap moguls, a judge ruled Thursday.\n\n Markets stumble as Wall Street sells off Big Tech\n\n U.S. stocks ended Friday in the red, closing out a lackluster week despite a year of historic highs.\n\n Trump asks U.S. Supreme Court to pause law that could ban TikTok\n\n President-elect Donald Trump has urged the U.S. Supreme Court to pause implementation of a law that would ban popular social media app TikTok or force its sale, arguing he should have time after taking office to pursue a 'political resolution' to the issue.\n\n Montenegro approves the extradition of cryptocurrency mogul Do Kwon to the United States\n\n Montenegro has approved the extradition of a South Korean mogul known as \"the cryptocurrency king\" to the United States, the Balkan country's Justice Ministry said on Friday.\n\n Lifestyle \n\n Proposal gone wrong: Man opens ring box to find ring missing\n\n Dave Van Veen wanted to make his proposal to his girlfriend, Kailyn Kenney, memorable. It was, but not for the reason he had hoped.\n\n Missing dog returns to Florida family, rings doorbell\n\n After a nearly weeklong search, Athena, a four-year-old German Shepherd and Husky mix, found her way home to her Florida family in time for Christmas Eve and even rang the doorbell.\n\n Winning ticket for US$1.22 billion lottery jackpot sold in California, Mega Millions says\n\n At least one Mega Millions player has plenty of dough to ring in the New Year after drawing the winning number. After three months without anyone winning the top prize in the lottery, a ticket worth an estimated US$1.22 billion was sold in California for the drawing Friday night.\n\n New Canadians, non-traditional demographics boost minor hockey uptake in B.C.\n\n Participation in hockey in British Columbia was struggling in 2021 — the pandemic had dealt a heavy blow to player registrations, and numbers had already been flagging before COVID-19 arrived.\n\n Magnus Carlsen quits World Rapid and Blitz Championships after refusing to change out of jeans\n\n World No. 1 Magnus Carlsen quit the World Rapid Chess Championship on Friday after he refused to change out of the jeans he was wearing, according to the International Chess Federation (FIDE).\n\n Sportscaster Greg Gumbel dies from cancer at age 78\n\n Greg Gumbel, a longtime CBS sportscaster who broke barriers during his career calling some of the biggest sporting events, has died from cancer, according to a statement from his family released by the network on Friday. He was 78.\n\n Suzuki Motor former boss who turned the minicar maker into a global player dies at 94\n\n Osamu Suzuki, the charismatic former boss of Suzuki Motor Corp. who helped turn the Japanese mini-vehicle maker into a globally competitive company, has died, the company said Friday. He was 94.\n\n More drivers opt for personalized plates in Sask. — and behind every one there's a story\n\n You may have noticed a few more vanity plates on Saskatchewan roads in recent years, and every one of them comes with a personal story.\n\n Nissan and Honda to attempt a merger that would create the world's No. 3 automaker\n\n Japanese automakers Honda and Nissan have announced plans to work toward a merger that would form the world's third-largest automaker by sales, as the industry undergoes dramatic changes in its transition away from fossil fuels.\n\n Local Spotlight \n\n Community partners in Windsor propose education campaign to veer people away from payday loans\n\n In a move aimed at combatting the financial strain caused by payday loans, the City of Windsor is considering the launch of a comprehensive education campaign to promote alternative financial options.\n\n Port Elgin, Ont. woman named Canada's Favourite Crossing Guard\n\n A Port Elgin woman has been named one of three of Canada’s Favourite Crossing Guards in a recent contest.\n\n 'Something that connected us all': For 53 years, Sask. family celebrates holidays with street hockey game\n\n For over 50 years, Stephen Lentzos and his family have celebrated Christmas Day with a street hockey game.\n\n 43-quintillion combinations: Speedcubers solve Rubik's Cubes in record breaking times\n\n On Saturday, Barrie is testing the abilities of some of the fastest cube solvers from across the province and around the world.\n\n B.C woman awarded nearly $750K in court case against contractor\n\n A B.C. woman has been awarded nearly $750,000 in damages in a dispute with a contractor who strung her along for a year and a half and failed to complete a renovation, according to a recent court decision.\n\n Ho! Ho! HOLY that's cold! Montreal boogie boarder in Santa suit hits St. Lawrence waters\n\n Montreal body surfer Carlos Hebert-Plante boogie boards all year round, and donned a Santa Claus suit to hit the water on Christmas Day in -14 degree Celsius weather.\n\n Teen cancer patient pays forward Make-A-Wish donation to local fire department\n\n A 16-year-old cancer patient from Hemmingford, Que. decided to donate his Make-A-Wish Foundation gift to the local fire department rather than use it himself.\n\n B.C. friends nab 'unbelievable' $1M lotto win just before Christmas \n\n Two friends from B.C's lower mainland are feeling particularly merry this December, after a single lottery ticket purchased from a small kiosk landed them instant millionaire status.\n\n 'Can I taste it?': Rare $55,000 bottle of spirits for sale in Moncton, N.B.\n\n A rare bottle of Scotch whisky is for sale in downtown Moncton, N.B., with a price tag reading $55,000.\n\n Vancouver \n\n Vancouver man defrauded Chinese developers of US$500K, court rules\n\n A Vancouver man has been ordered to pay more than US$500,000 after a B.C. Supreme Court judge found he had defrauded the would-be developers of a real estate project in China of that amount.\n\n Victoria police seek witnesses, additional victims after hit-and-run spree\n\n A woman is facing seven charges after allegedly committing multiple hit-and-run crashes in a stolen vehicle while impaired, according to police in B.C.'s capital.\n\n Delta, B.C., port terminals closed after 'machinery fire' Saturday morning\n\n A large fire at the port in Delta, B.C., sent a plume of smoke into the sky Saturday morning.\n\n Toronto, GTA to see ‘significant rainfall’ on Sunday\n\n Toronto and neighbouring areas are expected to see “significant rainfall” on Sunday. Environment Canada has issued a rainfall warning for most of the Greater Toronto Area.\n\n 1 person in hospital, suspect in police custody following stabbing in Fairbank\n\n One person is in hospital, and a suspect is in custody following a stabbing in Toronto’s Fairbank neighbourhood on Saturday.\n\n One person injured, suspect charged with arson following Etobicoke apartment fire\n\n A suspect has been charged with arson after a two-alarm fire at an Etobicoke apartment complex early Saturday morning left one person with injuries.\n\n Danielle Smith meet-and-greet with Calgary Chinese community wins some hearts but not all\n\n Danielle Smith dropped by the Edgemont Community Association for a meet-and-greet Saturday with some member's of Calgary's Chinese community to answer questions and press the flesh, but a format change left Helen Yu feeling a little shortchanged.\n\n Calgary Skyview MP George Chahal joins growing chorus of Liberals calling for Trudeau to step down\n\n Calgary Liberal MP George Chahal has publicly released letters he sent to the Liberal caucus and president of the Liberal Party of Canada, calling on them to begin the process of moving on from Prime Minister Justin Trudeau.\n\n Lethbridge Police investigating suspicious death inside motel room\n\n Lethbridge Police are investigating after a body was found inside a southside motel room on Saturday.\n\n FREEZING DRIZZLE ADVISORY \n\n FREEZING DRIZZLE ADVISORY | \n\n Slippery road conditions expected in Ottawa with freezing drizzle tonight\n\n Environment Canada has issued a freezing drizzle advisory, warning of slippery road conditions tonight.\n\n G2 driver stopped going more than 100 km/h over the speed limit on Hwy. 401 in eastern Ontario\n\n A 17-year-old driver is facing charges after being caught speeding and driving dangerously on Highway 401 in eastern Ontario Friday evening, according to the Ontario Provincial Police (OPP).\n\n TC Energy says early morning gas leak near Cornwall, Ont. resolved\n\n A gas leak that happened at a compressor station near Cornwall, Ont. Saturday morning has been controlled, according to TC Energy.\n\n Friend of Quebec man killed in Florida boat explosion says his sister also injured\n\n A childhood friend of the Quebec man killed in a Florida boat explosion earlier this week says one of the victim's sisters was among the other six passengers injured in the blast.\n\n Women’s hockey looks to expand coverage and support as spotlight grows\n\n More girls and women than ever are lacing up their skates and hitting the ice. The rising popularity of women's hockey is driven by inspiration believes hockey coach Hanna Bunton\n\n Here's how you can watch CTV News Montreal at Six on Saturday during the NFL season\n\n With CTV broadcasting NFL football games on Saturday this season, CTV News Montreal at Six will be broadcasting live on our website and the CTV News App.\n\n Edmonton street photographer captures moments and people one frame at a time\n\n A local photographer who is passionate about capturing moments in one-hundredth of a second embraced many styles of his trade before landing on one which truly represents his mantra: street photography.\n\n 2 vehicles fall through ice at Sylvan Lake, promoting police warning\n\n RCMP issued a warning Saturday after two vehicles fell through the ice on Sylvan Lake.\n\n Late OT goal helps lift Kings past Oilers 4-3\n\n Quinton Byfield scored his second goal of the game with 1:41 remaining in overtime as the Los Angeles Kings beat the Edmonton Oilers 4-3 on Saturday.\n\n No one injured after vehicle crashes into Shoppers Drug Mart: N.S. RCMP\n\n RCMP is investigating after a vehicle crashed into a Shoppers Drug Mart in Lower Sackville, N.S. on Saturday.\n\n Nova Scotia Muslim Society making hot meals and winter care packages for those in need\n\n For the fourth consecutive year, the Nova Scotia Islamic Society got together on Saturday to prepare warm meals and winter care packages to hand out for their community.\n\n Environment Canada forecasts mix of freezing rain and rain for parts of Maritimes\n\n Some nasty weather is headed toward parts of the Maritimes over the next few days, bringing with it a mix of freezing rain, rain and snow.\n\n The most-read stories on CTV Winnipeg in 2024\n\n Historic events, community pride and significant losses dominated headlines in Manitoba in 2024. Here’s a list of the most-read stories of each month of 2024 on CTV News Winnipeg.\n\n Cross-country ski race returns to Windsor Park\n\n The Prairie Holiday Loppet made its long-awaited return to Winnipeg’s Windsor Park Saturday, with dozens of racers hitting the trails.\n\n Have you seen Genevieve? RCMP search for woman last seen on Christmas Eve\n\n Thompson RCMP are searching for a woman who went missing from Split Lake earlier this week.\n\n 'A great holiday memory': Echo Valley Provincial Park gets plenty of visitors at Skate the Park launch\n\n Families and groups of friends made use of the good weather as the new season of Skate the Park got underway at Echo Valley Provincial Park.\n\n Missing 89-year-old Moose Jaw man found dead, no foul play suspected: Police\n\n Regina police chief says new initiatives to enhance community safety will come in 2025\n\n Looking back after one year in his new role as the chief of the Regina Police Service, Farooq Hassan Sheikh is highlighting challenges the city faces, what has worked during his tenure and what can be done to improve policing in 2025.\n\n Kitchener \n\n Cambridge industrial plant dealing with major damages after fire\n\n A fire Saturday morning has a Cambridge industrial plant dealing with major damage.\n\n Minor flooding possible with snow melt, rain on way: GRCA\n\n The Waterloo Region and the city of Guelph will be wrapping up 2024 with unusually warm weather over the weekend.\n\n Stretch of Kitchener road closed after gas leak at abandoned building\n\n Kitchener Fire is investigating after a \"strange odor\" was reported on Courtland Avenue East Saturday.\n\n Saskatoon \n\n U18 provincials curling tournament underway in PA\n\n Teams from across Saskatchewan are in Prince Albert for the U18 curling provincials.\n\n Police made two arrests following a shooting in Saskatoon\n\n A swift response from Saskatoon police led to the arrest of a man and woman following a reported shooting Friday afternoon.\n\n Saskatoon fire crews battle house fire\n\n Saskatoon firefighters responded to a house fire on the 100 block of Klassen Crescent Friday afternoon.\n\n Northern Ontario \n\n Pair of 911 calls leads to two impaired driving arrests in three hours\n\n A pair of 911 calls from concerned citizens led to two separate impaired driving charges in a single northern Ontario town within three hours.\n\n Calgary Skyview MP George Chahal joins growing chorus of Liberals calling for Trudeau to step down\n\n Calgary Liberal MP George Chahal has publicly released letters he sent to the Liberal caucus and president of the Liberal Party of Canada, calling on them to begin the process of moving on from Prime Minister Justin Trudeau.\n\n Five southern Ont. hunters fined $37K for moose hunt offences in northern Ont.\n\n A multi-year moose hunting investigation resulted in five people being convicted of moose hunting offences and fined a total of $37,000, plus $9,250 in victim surcharges.\n\n St. Thomas fraud victim loses nearly $100K to job scam\n\n According to police, the victim was investing money into a company that they believed they were employed by for over a month.\n\n Ending the year with above seasonal temperatures\n\n Warmer conditions are expected in the London, Ont. region this weekend, with the high forecast in the double digits.\n\n Trudeau, Carney push back over Trump's ongoing 51st state comments\n\n Two senior members of the federal cabinet were in Florida Friday pushing Canada's new $1.3 billion border plan with members of Donald Trump's transition team, a day after Prime Minister Justin Trudeau himself appeared to finally push back at the president-elect over his social media posts about turning Canada into the 51st state.\n\n Deluxe taxi goes up in flames in Barrie parking lot\n\n Some locals were quick to pull out their cellphones and capture a minivan as it went up in hot flames in a Barrie parking lot.\n\n Boxing Day bust: Police allege shopper stole from LCBO amid holiday rush\n\n While Boxing Day is known for securing the best deals, one local shopper took things too far and allegedly tried to score a deal at a free cost.\n\n County Road 56 reopens following afternoon collision\n\n County Road 56 in Essa Township was closed for an afternoon collision.\n\n Community partners in Windsor propose education campaign to veer people away from payday loans\n\n In a move aimed at combatting the financial strain caused by payday loans, the City of Windsor is considering the launch of a comprehensive education campaign to promote alternative financial options.\n\n Ex-boyfriend arrested for violating bail conditions\n\n Chatham-Kent police have made an arrest after a man allegedly violated his bail conditions.\n\n Trudeau, Carney push back over Trump's ongoing 51st state comments\n\n Two senior members of the federal cabinet were in Florida Friday pushing Canada's new $1.3 billion border plan with members of Donald Trump's transition team, a day after Prime Minister Justin Trudeau himself appeared to finally push back at the president-elect over his social media posts about turning Canada into the 51st state.\n\n Vancouver Island \n\n Victoria police seek witnesses, additional victims after hit-and-run spree\n\n A woman is facing seven charges after allegedly committing multiple hit-and-run crashes in a stolen vehicle while impaired, according to police in B.C.'s capital.\n\n Vancouver man defrauded Chinese developers of US$500K, court rules\n\n A Vancouver man has been ordered to pay more than US$500,000 after a B.C. Supreme Court judge found he had defrauded the would-be developers of a real estate project in China of that amount.\n\n New Canadians, non-traditional demographics boost minor hockey uptake in B.C.\n\n Participation in hockey in British Columbia was struggling in 2021 — the pandemic had dealt a heavy blow to player registrations, and numbers had already been flagging before COVID-19 arrived.\n\n B.C. team building 100 beaver 'starter homes' in the name of wetland preservation\n\n More than 70 manmade beaver dams have been installed in Interior waterways since the B.C. Wildlife Federation project launched last year with the goal of building 100 dams by the end of 2025.\n\n B.C. man charged with drug trafficking and weapons offences after CBSA investigation\n\n A resident of B.C.'s Interior has been charged with weapon and drug trafficking offences after an investigation launched by border agents at Vancouver International Airport earlier this year.\n\n B.C woman awarded nearly $750K in court case against contractor\n\n A B.C. woman has been awarded nearly $750,000 in damages in a dispute with a contractor who strung her along for a year and a half and failed to complete a renovation, according to a recent court decision.\n\n Lethbridge \n\n Lethbridge Police investigating suspicious death inside motel room\n\n Lethbridge Police are investigating after a body was found inside a southside motel room on Saturday.\n\n Family and friends grieve death of 36-year-old Lethbridge man in motorcycle crash\n\n Family members and friends are mourning the loss of a 36-year-old Lethbridge man killed in motorcycle crash just two days before Christmas.\n\n Hurricanes launch second half of WHL season with 4-1 win over Hitmen\n\n The Lethbridge Hurricanes kicked off the second half of the season with a win Friday night, topping the Calgary Hitmen 4-1.\n\n Sault Ste. Marie \n\n Mississauga tow truck driver charged for impersonating a cop in northern Ont.\n\n A southern Ontario resident has been charged for allegedly impersonating a peace officer during a towing incident in northwestern Ontario.\n\n Man shot by officer after firing at police car near Thunder Bay: SIU\n\n Ontario's Special Investigations Unit is probing a shooting near Thunder Bay in which a man was shot and wounded by a police officer on Boxing Day.\n\n Alleged impaired driver crashes into police cruiser on Boxing Day\n\n While on general patrol in northwestern Ontario on Boxing Day, an Ontario Provincial Police officer’s vehicle was struck.\n\n Icebreaker on hand in Labrador to guide season's last freight arrivals by ferry\n\n A Canadian Coast Guard icebreaker is in central Labrador until Saturday to guide the Kamutik W ferry on its last freight deliveries of the season.\n\n Whooping cough in Canada: Outbreaks or case increases reported in these provinces\n\n Canadian health officials say they're seeing spikes in whooping cough cases in parts of the country as the U.S. deals with case numbers not seen in more than a decade.\n\n Her son needed help with addiction. Instead, he's spending Christmas in N.L. jail.\n\n As Gwen Perry prepares for a Christmas without contact from her son, who is locked inside a notorious St. John's, N.L., jail, she wants people to understand that many inmates need help, not incarceration.\n\n Stay Connected","summary":"Three firefighters and a dozen passengers were injured in Florida on Saturday when a fire truck drove around rail crossing arms and into the path of a high-speed passenger train after waiting for another train to pass, according to a person briefed on what happened.","url":"https://www.ctvnews.ca/world/15-hurt-when-passenger-train-strikes-fire-truck-that-drove-into-crossing-after-freight-train-passed-1.7159487","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/28/florida-fire-truck-train-accident-1-7159489-1735431515024.jpg","video":null,"publish_date":"2024-12-29 00:22:02","author":"Josh Funk And Julie Walker,The Associated Press","authors":["Josh Funk And Julie Walker","The Associated Press"],"language":"en","source_country":"ca","sentiment":0.112},{"id":276764382,"title":"Yellen Says US Will Hit Debt Ceiling Mid-January, Forcing Treasury to Employ ‘Extraordinary Measures’","text":"Treasury Secretary Janet Yellen has warned that the United States will hit its statutory debt ceiling around the middle of January, a development she said will prompt the Treasury to resort to “extraordinary measures” to prevent the government from defaulting on its obligations.\n\nShe noted that the Fiscal Responsibility Act of 2023 temporarily suspended the debt ceiling through Jan. 1, 2025, enabling lawmakers to avert default during contentious budget negotiations. A day after that deadline—on Jan. 2—a new debt limit will be set based on the total amount of outstanding debt subject to the statutory limit as of the end of Jan. 1. Yellen noted that the debt is projected to temporarily decrease by $54 billion on that date due to scheduled Medicare trust fund redemptions, providing a brief reprieve before extraordinary measures become necessary.\n\n“Treasury currently expects to reach the new limit between January 14 and January 23, at which time it will be necessary for Treasury to start taking extraordinary measures.” Yellen wrote.\n\nExtraordinary measures, often described as accounting maneuvers, allow the Treasury to free up cash and delay default. These measures, however, are a short-term solution. Once exhausted, they leave the government unable to meet its financial obligations without congressional intervention. Yellen emphasized the urgency of action, warning that a failure to address the debt ceiling would severely damage the nation’s economic credibility.\n\n“I respectfully urge Congress to act to protect the full faith and credit of the United States,” she wrote.\n\n“The alarm bells are clearly ringing when it comes to our unsustainable national debt,” CRFB analysts wrote in the note. “Policymakers should put in place reforms that reduce the growth of debt and stabilize it as a share of the economy before interest and debt spiral further out of control.”\n\nPresident-elect Donald Trump has proposed eliminating the debt ceiling altogether, or at least extending it through 2029, a move that would give his incoming administration more breathing room by avoiding repeated debt cap standoffs on Capitol Hill.","url":"https://www.theepochtimes.com/us/yellen-says-us-will-hit-debt-ceiling-mid-january-forcing-treasury-to-employ-extraordinary-measures-5783047?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/03/id5770046-GettyImages-2185973980-300x180.jpg","video":null,"publish_date":"2024-12-29 00:19:51","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","category":"politics","source_country":"us","sentiment":-0.523},{"id":276764304,"title":"Will rename Alaska's Denali as Mount McKinley, vows Trump","text":"WASHINGTON, D.C.: U.S. President-elect Donald Trump said on December 22 that he would rename Denali, Alaska natives' name for North America's tallest mountain, after William McKinley, the 25th U.S. president who was assassinated in 1901.\n\nIn 2015, former President Barack Obama officially renamed the mountain Denali, siding with Alaska and ending a long debate over its name. The mountain had been called Mount McKinley since 1917.\n\nSpeaking to supporters in Phoenix, former President Donald Trump criticized the change. \"They took his name off Mount McKinley,\" he said. \"He was a great president,\" Trump added, promising to restore the name if re-elected.\n\nThe mountain, over 20,000 feet high, was named Mount McKinley in 1896 by a gold prospector who had heard that William McKinley, a supporter of the gold standard, had won the Republican presidential nomination. However, according to the 2015 order by the U.S. Department of the Interior that restored the name Denali, McKinley never visited the mountain or Alaska and had no historical ties to the area.\n\nDenali, meaning \"The High One\" in the Athabascan language, was recognized as the mountain's official name by the state of Alaska in 1975. Alaska pushed for decades to have the federal government adopt the name, but the effort was blocked until 2015.\n\nAlaska Senator Lisa Murkowski, a Republican, opposed Trump's idea to revert the name. \"There is only one name worthy of North America's tallest mountain: Denali - the Great One,\" she wrote online.\n\nPresident William McKinley, who served from 1897 until his assassination in 1901, was known for leading the U.S. to victory in the Spanish-American War and supporting protective tariffs to boost American industry.","url":"https://www.canadastandard.com/news/274889081/will-rename-alaska-denali-as-mount-mckinley-vows-trump","image":"https://cdn.bignewsnetwork.com/cus1735101391357.jpg","video":null,"publish_date":"2024-12-29 00:19:01","author":"President Biden","authors":["President Biden"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.109},{"id":276764306,"title":"Move to add 66 federal judgeships vetoed by President Biden","text":"WASHINGTON, D.C.: President Joe Biden this week vetoed a once-bipartisan effort to add 66 federal district judgeships, claiming that the House's \"hurried action\" left critical queries unanswered about the positions.\n\nA proposed law aimed to create new federal trial court judgeships over more than a decade, giving three presidential administrations and six Congresses the opportunity to appoint judges. This bipartisan plan was carefully crafted to avoid giving either political party an advantage in shaping the judiciary.\n\nThe Democratic-controlled Senate passed the bill unanimously in August. However, the Republican-led House delayed voting until after Donald Trump's reelection in November, making the process appear politically motivated.\n\nThe White House announced that President Biden would veto the bill.\n\n\"The House of Representative's hurried action fails to resolve key questions in the legislation, especially regarding how the new judgeships are allocated, and neither the House of Representatives nor the Senate explored fully how the work of senior status judges and magistrate judges affects the need for new judgeships,\" the president said in a statement.\n\n\"The efficient and effective administration of justice requires that these questions about need and allocation be further studied and answered before we create permanent judgeships for life-tenured judges,\" Biden said.\n\n\"I am vetoing this bill,\" Biden said, effectively ending its chances in the current Congress. Overriding the veto would require a two-thirds majority in both the House and Senate, but the House vote fell far short.\n\nJudges and legal organizations had urged Congress to pass the bill, arguing that the lack of new judges was causing significant delays in resolving cases and limiting access to justice.\n\nSenator Todd Young, a Republican from Indiana, criticized Biden's veto, calling it a \"misguided decision.\" He accused Biden of prioritizing his family over regular Americans, referencing a recent pardon Biden granted to his son Hunter for federal charges.\n\n\"Biden's legacy will be 'pardons for me, no justice for thee,'\" Young said.","url":"https://www.canadastandard.com/news/274892279/move-to-add-66-federal-judgeships-vetoed-by-president-biden","image":"https://cdn.bignewsnetwork.com/cus1735187269517.jpg","video":null,"publish_date":"2024-12-29 00:19:01","author":"President Biden","authors":["President Biden"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.367},{"id":276764578,"title":"Trump asks US Supreme Court to halt ban on TikTok","text":"Washington, DC [US], December 28 (ANI): US President-elect Donald Trump has filed a brief with the US Supreme Court urging the justices to block a law that mandates the popular social media platform TikTok to either sell its US operations or shut down by January 19, the New York Times reported.\n\nThe timing of the deadline--days before Trump's inauguration--has led to calls for a delay so that the incoming president can address the issue himself.\n\nIn his brief, President Trump refrains from taking a stance on the constitutional issue regarding the First Amendment, which will be argued by the court next month. The First Amendment challenge centres around whether Congress violated free speech rights by effectively banning TikTok. Instead, Trump's brief focuses on his ability to resolve the matter through political means once he assumes office.\n\n\"President Trump opposes banning TikTok in the United States at this juncture,\" the brief stated. \"He seeks the ability to resolve the issues at hand through political means once he takes office.\" The brief further emphasised Trump's \"deal-making expertise,\" which it claims makes him uniquely qualified to negotiate a solution that would protect both national security and the interests of TikTok's 170 million US users.\n\nAdditionally, the brief highlights Trump's prominent role in social media, specifically his 14.7 million followers on TikTok, which underscores his recognition of the platform's importance for free expression, including political speech. \"President Trump is one of the most powerful, prolific and influential users of social media in history,\" it said. \"Consistent with his commanding presence in this area, President Trump currently has 14.7 million followers on TikTok with whom he actively communicates, allowing him to evaluate TikTok's importance as a unique medium for freedom of expression, including core political speech.\"TikTok's own brief takes issue with the law's application, arguing that the government's approach infringes upon the First Amendment by restricting speech without sufficient evidence.\n\nIn response, the Biden administration argues that the law is a necessary step to protect US national security. The administration contends that the Chinese government's control of TikTok poses significant risks, particularly in terms of data privacy and potential influence operations. \"The law addresses the serious threats to national security posed by the Chinese government's control of TikTok, a platform that harvests sensitive data about tens of millions of Americans and would be a potent tool for covert influence operations by a foreign adversary,\" the brief stated.\n\nThe administration's defence of the law has sparked a strong response from content creators and users of TikTok, who argue that it violates their First Amendment rights, as per the report by The New York Times.\n\nIn a brief filed on behalf of users, it was pointed out that while the US and China are engaged in a geopolitical rivalry, the law's sweeping actions against TikTok unjustly curtail Americans' rights to free expression.\n\n\"Nothing like the act here has ever been countenanced,\" the user brief stated. \"Its suppression of Americans' speech flies in the face of our history, tradition and precedent.\"These competing briefs set the stage for the Supreme Court's consideration of TikTok's challenge to the law. The Court has scheduled a special session on January 10, in which it will hear arguments on both TikTok's case and a separate case filed by creators and users of the platform. The outcome of these hearings will have significant implications for both national security and free speech.\n\nThe law at issue mandates that ByteDance, TikTok's parent company, sell the app's US operations or face a ban due to concerns over Chinese influence. The government contends that TikTok's ownership structure, which includes ByteDance's control from China, exposes the platform to undue influence from the Chinese government. ByteDance is incorporated in the Cayman Islands, with its headquarters in Beijing, making it subject to Chinese regulations.\n\nThe Supreme Court's decision, which will come before the January 19 deadline, will determine the future of TikTok in the United States and shape the broader discourse on the intersection of technology, national security, and First Amendment rights. (ANI)","url":"https://www.beijingnews.net/news/274891736/trump-asks-us-supreme-court-to-halt-ban-on-tiktok","image":"https://cdn.bignewsnetwork.com/ani1735364770.jpg","video":null,"publish_date":"2024-12-29 00:18:50","author":"The New York","authors":["The New York"],"language":"en","category":"politics","source_country":"cn","sentiment":0.008},{"id":276764630,"title":"Indian markets outperformed with positive returns for 9th consecutive year in 2024","text":"New Delhi [India], December 24 (ANI): Despite the recent fall, Indian equity markets are on track to close 2024 with positive returns for the ninth consecutive year, marking the longest streak of annual gains on record, according to a report by Standard Chartered bank.\n\nThis achievement reflects the resilience of the Indian economy and the performance of its financial markets.\n\nThe report highlighted that 2024 was a year of two distinct halves for Indian equities and bonds. The first half (H1) saw strong growth, supported by robust economic activity and corporate earnings.\n\nHowever, the second half (H2) was marked by heightened volatility due to slowing economic growth and earnings. This slowdown came against backdrop of higher-than-usual interest rates as the Reserve Bank of India (RBI) prioritised curbing inflation and managing credit risks.\n\nIt said \"2024 was a year of two halves with H1 seeing strong performance of Indian equities and bonds on strong economic growth and corporate earnings delivery. However, H2 witnessed a surge in volatility\"The report also noted that these factors led to record foreign investor outflows from Indian equities, dampening market sentiments.\n\nDespite these challenges, the Nifty 50 index has gained 9.21 per cent so far this year, while the Sensex index has risen by 8.62 per cent, showcasing the resilience of Indian markets.\n\nLooking ahead, the report expressed optimism about 2025, expecting economic growth to improve. This recovery is likely to be driven by higher domestic demand, boosted by increased government spending and better private consumption. Rural incomes are expected to see an uptick, further supporting this recovery.\n\nHowever, the report flagged uncertainties surrounding US President-elect Donald Trump's proposed policies, particularly increased tariffs, as a significant risk for emerging markets like India. An intensified trade war could adversely affect India's growth outlook.\n\nNevertheless, the report suggested that India's large, domestically focused economy and its relatively small contribution to US imports (around 3 per cent) might shield it from the worst impacts of global trade tensions. This resilience, combined with improving domestic conditions, is expected to support India's economic and market performance in the coming year. (ANI)","url":"https://www.beijingnews.net/news/274880169/indian-markets-outperformed-with-positive-returns-for-9th-consecutive-year-in-2024","image":"https://cdn.bignewsnetwork.com/ani1735035748.jpg","video":null,"publish_date":"2024-12-29 00:18:50","author":"Standard Chartered","authors":["Standard Chartered"],"language":"en","source_country":"cn","sentiment":-0.032},{"id":276763510,"title":"European politics shifts rightward in 2024 with rising influence of far-right parties","text":"London [UK], December 24 (ANI): The political landscape in Europe has shifted to the right in 2024, with the rise of right-wing and far-right parties observed in European elections as well as national elections in countries like Portugal and Austria, as reported by Euronews on Tuesday.\n\nAccording to Euronews, this trend, which has been developing over nearly two decades, is largely attributed to growing support for radical right-wing parties, with many voters feeling marginalised and expressing concerns about immigration, which they believe drives down wages.\n\nPascal Delwit, a political science professor at the Universite libre de Bruxelles, stated that this shift is not a temporary phenomenon but a long-term political movement, as radical right-wing parties gain ground; some have even entered government or provided support to certain administrations.\n\n\"These voters also express concerns about immigration, with some feeling that 'migratory flows are now too great' and contribute to keeping wages too low,\" Delwit said as quoted by Euronews.\n\n\"This is a movement that has been evolving for almost twenty years, and it's showing a steady upward trend. More radical right-wing parties are either in government or supporting certain administrations,\" he added.\n\nAccording to Euronews, in the June 2024 European elections, the centre-right European People's Party (EPP) secured 188 out of 720 seats in the European Parliament, followed by the Social Democrats (SD) with 136 seats and the far-right Patriots for Europe with 84 seats. This shift has moved the European Parliament towards the right, with parties like the EPP, European Conservatives and Reformists Group (ECR), and the far-right Patriots for Europe increasing their influence.\n\nThe long-standing \"cordon sanitaire\" aimed at preventing far-right influence in European politics has largely collapsed, as per Euronews. As a result, the EPP is now in a position to form alliances with the Social Democrats, Liberals, and even far-right groups. The new European executive, which took office in December, also has a right-leaning majority, with 12 out of 27 European Commissioners, including President Ursula von der Leyen, being affiliated with the EPP, Euronews reported.\n\nAlongside the European elections, right-wing and far-right parties made notable gains in national elections. In Austria, the far-right FPO, led by Herbert Kickl, achieved the best result for the far-right since World War II. In Belgium, the conservative N-VA party topped parliamentary elections, followed by the far-right Vlaams Belang. Portugal also saw a shift rightward with the centre-right opposition's victory in March, while in France, the far-right National Rally (RN) emerged as the leading party in both European and parliamentary elections, as reported by Euronews.\n\nAlthough the left has lost ground in many European countries, it remains in power in Denmark, Spain, Lithuania, Malta, Romania, Slovenia, and Slovakia. Romania's left-wing government secured a parliamentary victory, despite a strong far-right showing, though the presidential election was annulled amid allegations of foreign interference.\n\nThe political developments in Europe mirror the rightward shift seen in the US, particularly with Donald Trump's victory, though each region's dynamics are shaped by different factors. All eyes are now on Germany, where the collapse of Chancellor Olaf Scholz's coalition may lead to early elections, marking a potential turning point for European politics in 2025. (ANI)","url":"https://www.unitedkingdomnews.net/news/274881249/european-politics-shifts-rightward-in-2024-with-rising-influence-of-far-right-parties","image":"https://cdn.bignewsnetwork.com/ani1735068083.jpg","video":null,"publish_date":"2024-12-29 00:08:04","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.347},{"id":276762564,"title":"Trump States Where He Stands on H-1B Visas","text":"President-elect Donald Trump has announced his position on the H-1B visa, which imports hundreds of thousands of foreign workers, mainly from India, to work specialty occupations. His statements starkly contrast his first term, where he emphasized the need to prioritize American workers and \"America First\" policies. His first administration implemented several measures, including stricter eligibility criteria, increased scrutiny of applications, and reduced visa approvals, to ensure that American workers were not displaced or underpaid.\n\nTrump said he has many H-1B visas employed on his properties and believes in the “great” program.\n\n“I’ve always liked the visas, I have always been in favor of the visas,” Trump told the New York Post. “That’s why we have them.”\n\nTrump, who was previously critical of foreign worker visas during his first administration, agreed with Elon Musk and Vivek Ramaswamy, who argued that the program is crucial for enabling American companies to access highly skilled labor that may be scarce within the U.S. workforce and should be expanded to meet growing demands.\n\nHowever, critics say the program prioritizes H-1B holders over U.S. citizens for American jobs. According to reports, there are about 650,000 H-1B visa foreign workers in America at any time. U.S. citizens are often laid off and forced to train their foreign replacements. \n\nMusk, however, has doubled down on his support for the program, slamming a social media user who criticized the billionaire's stance on the H-1B visa. \n\n“The reason I’m in America along with so many critical people who built SpaceX, Tesla, and hundreds of other companies that made America strong is because of H1B,\" Musk wrote on X. \n\nRamaswamy echoed Musk’s sentiments: \"American culture has venerated mediocrity over excellence.” \n\nBreitbart News reported that in 2015, Trump laid out key visa program reforms, such as increasing the wage for issuing visas to attract Americans to corporate positions rather than foreigners.","url":"https://townhall.com/tipsheet/saraharnold/2024/12/28/trump-states-where-he-stand-on-h-1b-visas-n2649707","image":"https://media.townhall.com/cdn/hodl/2024/306/f4740b6e-9538-4f49-9d0c-b4776eff4534.jpg","video":null,"publish_date":"2024-12-29 00:05:54","author":"Sarah Arnold","authors":["Sarah Arnold"],"language":"en","source_country":"us","sentiment":-0.102},{"id":276763140,"title":"Jon Husted in the U.S. Senate? It could happen: Letter to the Editor","text":"Let us look at the latest activity regarding replacing Sen. JD Vance. Gov. Mike DeWine and Lt. Gov Jon Husted just went to Mar-a-Lago to meet with Donald Trump (”Lt. Gov. Jon Husted visits Mar-a-Lago,” cleveland.com, Dec. 23). Hint: Husted as replacement for JD Vance? \n\nMaybe getting rid of Husted would be a good thing for DeWine. He could then pick a nice “Republican In Name Only” who matches DeWine’s moderate policies to replace Husted. \n\nI think Husted would be a really good senator. He is young and vibrant. And I think he will be remembered in Ohio for what he’s done here. That said, the next election cycle in 2026 would likely pit Sherrod Brown against, let’s say, Husted (Dennis Kucinich will be primaried out). An epic contest. \n\nDeWine will leave office celebrated by both Democrats and Republicans. He was a true centrist helping all as the grandfather of Ohio. He will be another celebrated former governor. But don’t let that distract you from the next battle - for U.S. senator in 2026.\n\nKarl H. Bernhardt,\n\nIndependence","summary":"DeWine will leave office celebrated by both Democrats and Republicans. He was a true centrist helping all as the grandfather of Ohio. He will be another celebrated former governor. But don’t let that distract you from the next battle - for U.S. senator in 2026, writes Karl H. Bernhardt of Independence in a letter to the editor.","url":"https://www.cleveland.com/letters/2024/12/jon-husted-in-the-us-senate-it-could-happen.html","image":"https://www.cleveland.com/resizer/v2/MOJ66I3QSRD5HGVUYRAIOCV7KE.jpg?auth=25b46eb9823af0c350d924111a92bfe1b91822e034f9db870511830661ad0604&width=1280&quality=90","video":null,"publish_date":"2024-12-29 00:02:10","author":"Other Voices","authors":["Other Voices"],"language":"en","source_country":"US","sentiment":-0.018},{"id":276765412,"title":"Putin's setbacks are cold comfort for Europe","text":"By Joschka Fischer\n\nBERLIN – Donald Trump’s election as the 47th president of the United States has undoubtedly filled Russian President Vladimir Putin with hope. Trump has long expressed his admiration for Putin, and he has given every indication that he will discontinue President Joe Biden’s policy of providing substantial material support to Ukraine (weapons, intelligence, and financing) in its defense against Russian aggression.\n\nMoreover, Trump’s choice of vice president, J.D. Vance, shares his view, stating that “The American people will not tolerate another endless war, and neither will I.” With Republicans gaining control of both houses of Congress and pursuing draconian cuts to any spending that is associated with Democratic priorities, U.S. support for Ukraine will soon be withdrawn.\n\nRegardless of what we tell ourselves, we Europeans will not be able to compensate for the loss of American financial and military aid for Ukraine. We have neither the will nor the capacity to do so. And while many have described recent developments in Syria as a loss for Putin, that doesn’t make them a win for the Ukrainians and Europe.\n\nTo be sure, Putin has lost a key ally with the downfall of Bashar al-Assad, and another important partner, Iran, has been significantly weakened in recent months. The victory of Syrian opposition forces means that Iran will be deprived of its direct land bridge to Lebanon and the Mediterranean. Moreover, the Israelis have severely eroded Iran’s “axis of resistance,” eliminating the top leaders of Hezbollah and Hamas, and even taking out Iran’s primary domestic air defenses.\n\nIn the wake of the Assad regime’s collapse, Russia is withdrawing its forces from its air and naval bases on Syria’s Mediterranean coast, which means that it is losing essential conduits for supplying the forces it has deployed in various African countries. For a leader who harbors global power ambitions, this marks a severe setback.\n\nPutin’s strategic loss in the eastern Mediterranean might be only partly mitigated by a “deal” with Trump. For example, the incoming US administration could pursue a grand bargain in which Russia supports U.S.-Israeli efforts to shut down Iran’s nuclear program in exchange for a face-saving partial victory in Ukraine.\n\nAlternatively, Trump’s arrival in the White House could amount to a green light for Israel to launch strikes on Iranian nuclear facilities. Could the Iranian regime even survive such an attack politically, given its apparent weaknesses?\n\nThis scenario would be catastrophic for Putin’s dreams of global influence, because it would fundamentally alter Russia’s role in the Middle East and on the world stage. Former US President Barack Obama’s dismissive description of Russia as a “regional power,” rather than a great one, would be confirmed. Russia would still have a powerful partner in China, but China’s own estimation of its northern neighbor’s importance would be significantly downgraded.\n\nBut another possibility is that Trump will simply roll over for Putin by forcing the Ukrainians into ceasefire negotiations and territorial concessions without any effective Western security guarantees. Such a grotesque outcome would further alter Europe’s own security architecture. NATO would still exist, but its relevance would be much in doubt as long as Trump is in office. European security would henceforth depend on Ukrainian security. Its future prosperity and stability would be tied to a fragile ceasefire that would do nothing to counter the constant threat of Russian hybrid warfare.\n\nIn other words, from Europe’s perspective, Trump and Vance’s idea of peace will be nothing of the kind. Europe will continue to face profound risks to its security and internal cohesion, only now it will be confronting them alone. What will Putin do with the reprieve offered by a suspension of hostilities? What will it mean for Europe if the situation in Syria deteriorates and produces another 2015-style refugee crisis?\n\nFaced with so much uncertainty, Europeans have no choice but to pursue considerable investments in rearmament and security, even if such outlays become more difficult under conditions of flagging growth and a new trade war.\n\nIt is easy to campaign on a message of “America first” when you have oceans and thousands of miles between you and the fraught conflict zones of Eastern Europe and the Middle East. But Europeans enjoy no such luxury, and we no longer have any excuse for complacency.\n\nJoschka Fischer, Germany’s foreign minister and vice chancellor from 1998 to 2005, was a leader of the German Green Party for almost 20 years. This article was distributed by Project Syndicate.","summary":"BERLIN - Donald Trump’s election as the 47th president of the United States has undoubtedly filled Russian President Vladimir Putin with hope. Trump has long expressed his admiration for Putin, and he has given every indication that he will...","url":"https://nation.lk/online/putin-s-setbacks-are-cold-comfort-for-europe-289639.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/b96b6503e11f41fe9f915bc01adfffe9.png","video":null,"publish_date":"2024-12-29 00:00:22","author":"Joschka Fischer","authors":["Joschka Fischer"],"language":"en","source_country":"lk","sentiment":-0.174},{"id":276761796,"title":"\"Will serve America very well...\": Indian diaspora group denounces 'racist' attacks on Trump's appointee Sriram Krishnan","text":"Washington DC, [US], December 28 (ANI): Indiaspora on Saturday issued a media advisory strongly condemning the racist attacks on Sriram Krishnan, who was recently appointed as Senior AI Advisor by President-elect Donald Trump.\n\n\"Sriram Krishnan, who was recently appointed by President-elect Trump as his Senior AI Advisor, has become a target of reprehensible racist attacks. There is absolutely no place in our public discourse for spiteful, vengeful, racially motivated, ad hominem epithets,\" the advisory reads.\n\n\"At Indiaspora, we categorically and unequivocally denounce racism of any and all kinds. As enunciated in our media statement issued a few days ago, we strongly support Sriram's appointment to this important position because we are confident that he will serve America very well in public office,\" it added.\n\nRecently, the Indian-American Congressman Ro Khanna criticised those targeting Indian-born Krishnan, over his Indian origin. Khanna emphasised that the ability of the United States to attract talent from around the world shows America's \"exceptionalism\" which puts it ahead of other countries like China.\n\nFollowing a post by an X user, who wrote, \"Did any of yall vote for this Indian to run America,\" Khanna on X wrote, \"You fools criticizing @sriramk as Indian born criticize Musk as South African born or Jensen as Taiwanese born.\"\"It is great that talent around the world wants to come here, not to China, and that Sriram can rise to the highest levels. It's called American exceptionalism,\" the post added.\n\nUS President-elect Donald Trump nominated Sriram Krishnan as senior policy advisor for Artificial Intelligence at the White House Office of Science and Technology Policy.\n\nSharing a post on the Truth Social platform, Trump wrote, \"Sriram Krishnan will serve as Senior Policy Advisor for Artificial Intelligence at the White House Office of Science and Technology Policy.\"\"Working closely with David Sacks, Sriram will focus on ensuring continued American leadership in AI, and help shape and coordinate Al policy across Government, including working with the President's Council of Advisors on Science and Technology. Sriram started his career at Microsoft as a founding member of Windows Azure,\" he said.\n\nKrishnan, 41, acknowledged the offer and expressed his gratitude for the opportunity by saying, \"I'm honoured to be able to serve our country and ensure continued American leadership in AI working closely with @DavidSacks. Thank you @realDonaldTrump for this opportunity.\"Krishnan till recently was a General Partner at Andreessen Horowitz and a personal investor in over two dozen companies including SpaceX, Figma and Scale.ai.\n\nHe previously led organisations at Meta, X and Microsoft. He holds a Bachelor of Technology in Information Technology from SRM Engineering College, Anna University. (ANI)","url":"https://www.nigeriasun.com/news/274892459/will-serve-america-very-well-indian-diaspora-group-denounces-racist-attacks-on-trump-appointee-sriram-krishnan","image":"https://cdn.bignewsnetwork.com/ani1735393567.jpg","video":null,"publish_date":"2024-12-28 23:56:55","author":"President Biden","authors":["President Biden"],"language":"en","category":"politics","source_country":"ng","sentiment":0.329},{"id":276761712,"title":"FOCUS: Japan economy likely to grow in 2025 but Trump tariffs cast shadow","text":"The Japanese economy is expected to continue to grow at a moderate pace in 2025 supported by solid consumer spending on the back of wage hikes and the government's policies aimed at easing inflation pain.\n\nStimulus efforts overseen by the administration of Prime Minister Shigeru Ishiba will be in focus ahead of an upper house election in summer, which follows his ruling coalition's poor showing in October's general election. Analysts also warn of downside risks from U.S. President-elect Donald Trump's protectionist approach to international trade.\n\n\"It is feared that higher tariffs promised by President Trump on China and other countries could put a damper on the global economy, eventually inflicting a blow on Japan,\" Takafumi Fujita, an economist at Meiji Yasuda Research Institute, said.\n\nThe ruling coalition led by Ishiba's Liberal Democratic Party lost control of the House of Representatives in the general election, a result that leaves the bloc needing cooperation from opposition parties to pass bills and budgets in the lower chamber.\n\nWith households struggling due to rising prices, attention will be on whether significant wage increases seen in 2024 will continue into next year and help improve consumer sentiment.\n\nAdjusted for inflation, wages failed to grow consistently this year and are expected to remain unstable in early 2025. Ishiba apparently felt the need to focus on underpinning private consumption, which accounts for more than half of the nation's gross domestic product.\n\nTo do that, Ishiba's government has crafted a 39 trillion yen ($249 billion) stimulus package for fiscal 2024 through March, featuring subsidies to curb higher energy costs between January and March and one-off cash handouts to low-income households.\n\n\"Real wages will likely grow in the April-June quarter or later as energy prices are projected to stabilize, with the help of envisioned higher salaries following next spring's annual wage negotiations,\" Fujita said.\n\nIn 2024, Japanese companies agreed to increase salaries by an average 5.10 percent in the \"shunto\" spring wage talks between management and labor unions, offering a more than 5 percent increase for the first time in 33 years, according to the Japanese Trade Union Confederation.\n\nFor 2025, the confederation, known as Rengo, has decided to demand pay hikes of 5 percent or more, aiming to maintain the wage growth momentum.\n\nRengo also seeks to realize wage increases of 6 percent or more for small- and medium-sized companies which employ an estimated 70 percent of the country's workforce, as their employees tend to receive more modest gains than workers at larger firms.\n\nKenta Domoto, an economist at Mitsubishi Research Institute, anticipated that salary increases would persist into 2025.\n\n\"As more individuals aim to switch jobs, companies often offer elevated salaries to attract talent,\" Domoto said, adding that businesses are also compelled to pay more to current employees to retain them.\n\nAmong public and private institutions, the Organization for Economic Cooperation and Development projected the Japanese economy to expand 1.5 percent in 2025, buoyed by wage increases and corporate investment.\n\nAnalysts forecast capital spending will remain solid in 2025 as companies will be more focused on investing in areas ranging from decarbonization to digitalization as well as efforts to improve productivity.\n\nBut they cast doubt on the strength of exports amid uncertainty over the outlook for the Chinese and European economies, especially after the return of Trump to the White House on Jan. 20 with his unpredictable leadership style and \"America First\" policies.\n\nShunsuke Kobayashi, chief economist at Mizuho Securities Co., expected Trump's proposed tax reductions will support the U.S. economy and be positive for Japanese firms operating there.\n\nBut Kobayashi also warned of higher tariffs Trump has pledged to impose on U.S. imports, estimating that an additional 10 percent levy would push down Japan's real GDP by 0.13 percentage point.\n\nIn addition, Trump's trade policy is almost certain to cause tensions between the United States and China, and any retaliatory move by Beijing is likely to worsen relations between the world's two largest economies and hit global growth.\n\nSuch a development could lower Japan's real GDP by an additional 0.12 point, according to Kobayashi.\n\n\"If that happens, capital investment would decline due to expectations that exports will drop, eventually negatively affecting the broader economy,\" Kobayashi said. Such an outcome may cause companies to be reluctant to raise salaries, he added.\n\nRelated coverage","summary":"TOKYO - The Japanese economy is expected to continue to grow at a moderate pace in 2025 supported by solid c...","url":"https://english.kyodonews.net/news/2024/12/0937630f2fc5-focus-japan-economy-likely-to-grow-in-2025-but-trump-tariffs-cast-shadow.html","image":"https://img.kyodonews.net/english/public/images/posts/e0c83abb518798a3e81a169752c02c47/photo_l.jpg","video":null,"publish_date":"2024-12-28 23:56:53","author":null,"language":"en","source_country":"jp","sentiment":-0.122},{"id":276761528,"title":"‘Trump does not understand what a “collective defense alliance” is’","text":"A pragmatist and tough in his assessments, Ambassador John Bolton knows Donald Trump well from his time working alongside him in the White House as national security adviser. He is one of the few people in Washington who dares to make predictions about Trump’s second term and predict the twists and turns of his foreign policy.\r\nKathimerini spoke with him about Syria, NATO, Turkey and the war in Ukraine.\r\nA month before assuming his presidential duties, Donald Trump threatened again that he would consider taking the US out of the NATO alliance and added, “If they [US allies] are paying their bills, and if I think they are treating us fairly, the answer is: Absolutely, I will stay with NATO.” Do you think he is using this threat as a bargaining chip and the real goal is to increase military spending to 3% of GDP?\r\nI think he would be very happy if all NATO members first made it to 2%, which is the Wales Summit Declaration (2014), and then the right approach from the US point of view is for our military spending to go from a little bit over 3%, probably back to Reagan era levels of 4% or 5%, maybe even 6% of GDP, hopefully bringing domestic spending down so our deficits come down. But if the US did go to 4% or 5%, I think it would be almost inevitable that we would ask the European allies to go to 3%. And honestly, given the threat environment around the world, that is what government should do in any event. \r\nNow Greece is already over 3%, so there would not be any significant increase there. But as you can see the world is not calming down and the threats remain very substantial. So, it is a good thing to be better prepared on the defense side. \r\nThe bigger problem with Trump is not the levels of spending, but it is that he does not understand what a “collective defense alliance” is. And the way he understands NATO is basically “we defend Europe, we do not get anything out of it and the Europeans do not pay for it.”\r\nIf Trump pushes the US into strategic isolationism, is there a risk of the US losing its global hegemony?\r\nWell, I wish we had global hegemony to lose it. I mean, I think the world is in a very disorderly place. And if we step back, the theory of “isolationism,” meaning that we will not have all these problems and that they will leave us alone, will not come true, because somebody else moves into the vacuum, and they are not going to have our best interest at heart or the best interest of our allies, whether it is Russia or China or somebody else. And that is one reason I am very concerned about Trump’s remarks about tariffs and what he will do in terms of across-the-board tariffs worldwide or tariffs with Mexico and Canada or others. \r\n\r\n\r\nThe leader of the Islamist group Hayat Tahrir al-Sham in Syria is on the US Department of Justice’s wanted list. With US security doctrine stipulating no negotiation with terrorists, how do you see relations with the new Syrian administration evolving?\r\nI think while it is unquestionably a good thing that the Assad regime has fallen, it is another blow to Iran’s influence in the region. The last thing anybody wants is a new Islamic terrorist state on the Mediterranean. The leaders of Syria are saying things that are trying to mollify people’s concerns because they need a lot of outside assistance. Right now, the economy in Syria is a wreck and the basic services are in trouble. So, they are not going to try and do something so foolish as to convince others that they remain jihadists. \r\nBut that does not mean that the White House will automatically renounce everything that it stood for the past 15 years. We need real evidence of that. And until we see it, I do not see any reason to stop what Biden did over the weekend when he bombed 75 ice storage facilities, to make sure that whatever was there – weapons, ammunition – did not fall into the hands of the new government. \r\nIn addition, Israel has been taking out the Syrian Navy, and the Syrian Air Force, going after chemical and biological weapons targets to make sure they do not fall into the hands of the terrorists.\r\nNow, I know some people will say, “Well, you talked about weapons of mass destruction in Iraq too.” I would rather be safe than sorry. We know that Assad did use chemical weapons on his own people. So stockpiles, if they still exist, need to be found as quickly as possible.\r\nWith Turkey supporting the Syrian opposition and the fall of Assad, do you expect them to stop the Kurds on the one hand and to proceed with the resettlement of the northern territories of Syria on the other?\r\nI am very worried about the Kurds. You know, this goes back to the Ottoman Empire days and the contemporary modern Turkey thought that the carving up of the Ottoman Empire gave territory to the mandate of the French in Syria that should have remained under Turkish control. And today we are seeing a face-off between Turkish troops and Kurdish-led militia in northeast Syria, the Syrian Democratic Forces (SDF). The Kurdish forces pulled back, apparently in an agreement brokered by the Biden administration, and I do not know what the wisdom of that was, but I am very worried about Turkey’s role here. I think Erdogan does have neo-Ottoman aspirations in the region, but particularly that geography in northern Syria has been a “heartburn” for Turkey for 100 years now.\r\nTrump recently announced former news host Kimberly Guilfoyle as the new ambassador in Athens. Do you think the choice of an inexperienced diplomat but close associate indicates his intention to strengthen relations with Greece or the opposite?\r\nThere is a lot of speculation that she is no longer Donald Trump Junior’s girlfriend. So, the embassy in Athens is kind of a consolation prize. I do not know the answer to that. I hope, and if she is confirmed, and that is open to question at this point, but I hope she would take the duties seriously. And Greece is a critical component of NATO, critical in the EU, and very important for strategic stability in the Mediterranean. And we need an ambassador that the Greek government can trust and communicate with and make sure the communications get back to Washington. So, I think the good news is everybody will be watching her performance, and, you know, hopefully, she will be up to the job.\r\nIn the domestic political scene, loyalty to Trumpism seems to be the main requirement for staffing the new government. Do you think he is trying to transform the Republican Party into a more radical one and to establish the next generation of the Republican Party?\r\nI do not think Trump has a philosophy. I do not think he has a national security grand strategy and I do not think he does policy the way we normally understand that term. I think his impulses are isolationist. And some of his picks are isolationist and there is no doubt about it. Also, he wants to be surrounded by “yes men” and “yes women.” He does not want people telling him, “You need to think about this,” or “You should consider this option” or that sort of thing. And he may get that, but he will not be well served by it. And, certainly, the United States will not be well served by it. But that is how Trump sees things and he acts in a very ad hoc and transactional way, seen through the prism of “Does this benefit Donald Trump?”\r\nWhat are the most immediate geostrategic and geopolitical threats the West will face in the coming year? \r\nI am very worried about the “trade war” now. It is easier to get into a trade war than people remember. We have not had one in a long time, and once you are in it, it could be a lot harder to get out of. And that could come in the next year. \r\nBut I think the action-forcing events now are Ukraine and the Middle East, no doubt about it. History is moving very fast in the Middle East. There are a lot of opportunities for Israel or the US or both of us to take out Iran’s nuclear weapons program, and there is not going to be a better opportunity. \r\nAlso, I am very concerned about the outcome in Ukraine and I am afraid of what J.D. Vance, the vice-presidential candidate, said about the ceasefire along the existing military lines of control. The Kremlin would love the scenario of drawing up a demilitarized zone and then Ukraine agreeing not to join NATO. And I am worried that Putin is more experienced at making Trump do what he wants him to do than Zelensky is. So, I think Ukraine is certainly going to be an issue in the first year, maybe the first six months of the new administration, and I am quite concerned about the outcome.","url":"https://www.ekathimerini.com/in-depth/interviews-in-depth/1257346/trump-does-not-understand-what-a-collective-defense-alliance-is/","image":"https://www.ekathimerini.com/wp-content/uploads/2024/12/NYT_TRUMP_BOLTON1-960x600.jpg?v=1735322693","video":null,"publish_date":"2024-12-28 23:55:55","author":"Athanasios Katsikidis","authors":["Athanasios Katsikidis"],"language":"en","category":"politics","source_country":"gr","sentiment":-0.273},{"id":276762334,"title":"Chinese 'Salt Typhoon' hackers infiltrate 9th U.S. telco; better defenses urged","text":"Dec. 28 (UPI) -- Chinese hackers called Salt Typhoon have infiltrated a ninth telecommunications firm, gaining access to information about millions of people, U.S. cybersecurity officials say.\n\nThe FBI is investigating the Salt Typhoon attacks, which are spurring new defensive measures, deputy U.S. national security adviser Anne Neuberger told reporters on Friday.\n\n\"As we look at China's compromise of now nine telecom companies, the first step is creating a defensible infrastructure,\" she said.\n\nThe hackers primarily are targeting individuals and organizations involved in political or governmental activities and a significant number of hacking victims are located in the Washington D.C.-Virginia area.\n\nThe hackers can geolocate millions of people in the United States, listen to their phone conversations and record them whenever they like, Politico reported.\n\nAmong recent victims are President-elect Donald Trump, Vice President-elect JD Vance and several Biden administration officials.\n\nNeuberger did not name the nine telecommunications firms that have been hacked, but said telecommunications firms and others must do more to improve cybersecurity and protect individual customers.\n\n\"We wouldn't leave our homes, our offices unlocked,\" she said. \"Yet, the private companies owning and operating our critical infrastructure often do not have the basic cybersecurity practices in place that would make our infrastructure riskier, costlier and harder for countries and criminals to attack.\"\n\nShe said companies need better management of configuration, better vulnerability management of networks and better work across the telecom sector to share information when incidents occur.\n\n\"However, we know that voluntary cybersecurity practices are inadequate to protect against China, Russia and Iran hacking our critical infrastructure,\" Neuberger said.\n\nAustralian and British officials already have enacted telecom regulations \"because they recognize that the nation's secrets, the nation's economy relies on their telecommunications sector.\"\n\nNeuberger said her British counterparts told her they would have detected and contained Salt Typhoon attacks faster and minimized their spread and impact.\n\n\"One of the most concerning and really troubling things we deal with is hacking of hospitals [and] hacking of healthcare data,\" Neuberger said. \"We see Americans' sensitive healthcare data, sensitive mental health procedures [and] sensitive procedures being leaked on the dark web with the opportunity to blackmail individuals with that.\"\n\nShe said federal regulators are updating existing rules and implementing new ones to counteract the cyberattacks and threats from Salt Typhoon and others.\n\nThe Department of Justice on Friday issued a rule prohibiting or restricting certain types of data transactions with certain nations or individuals who might have an interest in that data.\n\nThe protected information includes those involving government-related data and bulk sensitive personal data of individuals that could pose an unacceptable risk to the nation's national security.\n\nThe Department of Health and Human Services likewise issued a proposed rule to improve cybersecurity and protect the nation's healthcare system against an increasing number of cyberattacks.\n\nThe proposed HHS rule would require health insurers, most healthcare providers and their business partners to improve cybersecurity protections for individuals' information that is protected by the Health Insurance Portability and Accountability Act of 1996.\n\n\"The increasing frequency and sophistication of cyberattacks in the healthcare sector pose a direct and significant threat to patient safety,\" HHS Deputy Secretary Andrea Palm said Friday.\n\n\"These attacks endanger patients by exposing vulnerabilities in our healthcare system, degrading patient trust, disrupting patient care, diverting patients and delaying medical procedures.\"\n\nThe proposed rule \"is a vital step to ensuring that healthcare providers, patients and communities are not only better prepared to face a cyberattack but are also more secure and resilient,\" Palm added.\n\nNeuberger estimated the cost to implement improved cybersecurity to thwart attacks by Salt Typhoon and others at $9 billion during the first year and $6 billion for years 2 through 5.\n\n\"The cost of not acting is not only high, it also endangers critical infrastructure and patient safety,\" she said, \"and it carries other harmful consequences.\"\n\nThe average cost of a breach in healthcare was $10.1 million in 2023, but the cost is nearing $800 million from a breach of Change Healthcare last year.\n\nThose costs include the costs of recovery and operations and, \"frankly, in the cost to Americans' healthcare data and the operations of hospitals affected by it,\" Neuberger said.\n\nThe Federal Communications Commission also has scheduled a Jan. 15 vote on additional proposed rules to combat Salt Typhoon and other hackers.","summary":"Chinese hackers called Salt Typhoon have infiltrated a ninth telecommunications firm, gaining access to information about millions of people, U.S. cybersecurity officials say.","url":"https://www.upi.com/Top_News/US/2024/12/28/salt-typhoon-cybersecurity/5301735424564/","image":"https://cdnph.upi.com/ph/st/th/5301735424564/2024/upi/8161764ae918935673bd35caf292daf7/v1.2/Chinese-Salt-Typhoon-hackers-infiltrate-9th-US-telco-better-defenses-urged.jpg","video":null,"publish_date":"2024-12-28 23:52:13","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":0.051},{"id":276760922,"title":"2027: Political movements spread as bigwigs plot Tinubu’s ouster","text":"In the wake of the American and Ghanaian presidential elections, several political movements have emerged in Nigeria, each aiming to challenge President Bola Tinubu’s re-election in 2027. In both the United States and Ghana, the opposition defeated the ruling parties in landslide victories.\n\nIn the US, former President Donald Trump of the Republican Party defeated Kamala Harris, the incumbent Vice President and candidate of the Democratic Party, in the November 5 election. Similarly, Ghanaian Vice President Mahamudu Bawumia, the presidential candidate of the New Patriotic Party, lost to the National Democratic Congress’s candidate, John Mahama, in the December 7, 2024 elections.\n\nFollowing Trump’s election, opposition parties expressed hope that they could replicate the US and Ghanaian political trajectories in Nigeria. The outcome of the Ghanaian election has injected a renewed sense of optimism among opposition parties, as they step up their political games towards significant political realignment.\n\nOn November 26, it was reported that the 2023 presidential candidate of the Peoples Democratic Party, Atiku Abubakar, and his Labour Party counterpart, Peter Obi, and former Kaduna State governor, Nasir El-Rufai, had concluded plans to form a new political party or adopting an existing one to form a coalition ahead of 2027.\n\nAfter the report, Obi and Atiku met again in Adamawa, Yola State, on November 30, but the two camps of the political leaders denied having discussions for a joint ticket ahead of the 2027 election.\n\nHowever, Atiku’s spokesperson, Paul Ibe, later revealed that the two political leaders had been engaging in discussions to form a united front against the APC.\n\nIbe, who appeared on Channels Television’s Politics Today programme on December 10, said, “The truth of the matter is that Atiku Abubakar has promoted opposition parties to work together, to come together; that is the only way they can kick out this incompetent and clueless government. And I believe that discussions have been going on.”\n\nThis was as the Peoples Redemption Party and African Democratic Congress confirmed that they had initiated discussions with each other on a potential merger ahead of the elections.\n\nSimilarly, some parties under the aegis of the Coalition of United Political Parties and the Social Democratic Party had also expressed readiness for talks of a possible alliance, saying the country needed more than just a coalition of only Atiku and Obi.\n\nAlso, former President Olusegun Obasanjo, last Saturday, hosted former Kano State Governor, Rabiu Kwankwaso, and former Cross River State Governor, Donald Duke, in Abeokuta, Ogun State. According to Kwankwaso, the discussions centred on “significant national issues, including the future of politics and governance in Nigeria.”\n\nA former Director General of the Progressives Governors Forum, Salihu Lukman, in an open letter titled, ‘Satanic Leadership and Nigeria’s Boiling Point,’ on Monday, called on Obasanjo to lead efforts to unify opposition parties to challenge Tinubu in 2027.\n\nLukman warned that disunity within opposition parties would make it easier for President Tinubu to secure a second term. He called on Obasanjo, Gen. Yakubu Gowon (retd), Gen. Ibrahim Babangida(retd), Gen. Abdulsalami Abubakar(retd), Goodluck Jonathan, and Muhammadu Buhari to lead efforts to rally opposition parties.\n\nWhile the rise of these political movements brings hope, it also presents significant challenges. The political landscape in Nigeria is complex. In Nigeria’s recent political history, only once has an opposition party defeated a ruling party. In 2015, Buhari of the APC defeated Jonathan of the PDP.\n\nBuhari had contested and lost three presidential elections before his party, Congress of Progressives Change, the Action Congress of Nigeria, and a faction of the PDP (new PDP) merged in 2013 to form the APC. The merger provided a bigger platform to achieve his presidential ambition in 2015 and for his re-election in 2019.\n\nIf the coalition of major opposition leaders works out (like that of the APC in 2013), it will pose a serious challenge to President Tinubu, who won his first election with a 1.8 million vote margin.\n\nIn the 2023 presidential election, Tinubu polled 8,794,726 (36.61%) to defeat the runner-up, Atiku Abubakar, who secured 6,984,520 (29.07%). Obi, the LP candidate, had 6,101,533 votes (25.40%) while Kwankwaso, the candidate of the New Nigeria Peoples Party, polled 1,496,687 (6.40%). Atiku, Obi, and Kwankwaso’s votes totalled 14,582,740.\n\nBeyond the coalition of these individuals, many analysts believe that President Tinubu would face the challenge of convincing people for his re-election because of his economic crisis, which the opposition has already capitalised on to discredit his government. Analysts argue that a similar scenario won the election for Ghana’s opposition leader, John Mahama, as the country’s economy plummeted, went through a debt crisis, default, and currency devaluation.\n\nAnalysing why the opposition won the Ghanaian election, the Guardian Weekly, an international news magazine based in London, said, “Economic hardship was a major factor: at one point, inflation was as high as 50% and the cedi plummeted to historic lows while the number of taxes increased. A banking sector purge that was hailed by economists but led to thousands of job losses also angered voters, as did a bloated government in which several relatives of the president and ruling party members served.”\n\nCurrently, Nigeria’s inflation is at 34.6 per cent while the country’s debt stands at N134.3tn. The rise in inflation is largely driven by food price increases, which continue to place a strain on Nigerian households.\n\nCommenting, the National Publicity Secretary of the PDP, Debo Ologunagba, expressed optimism that there would be a replica of the US and Ghanaian elections in Nigeria, considering the similarities in the two countries’ economies.\n\nBut Ologunagba said the replica could only be achieved if the Independent National Electoral Commission allowed elections to be free and fair and respected the people’s will.\n\nHe said, “You will see the replica if INEC allows the election to be free and fair. The American and Ghanaian elections reflect the will of the people, and you have independent electoral bodies that are willing to respect that will.\n\n“The challenge of elections in Nigeria is not just the people. Yes, the APC has promoted poverty as an act of governance that has impaired the capacity to make rational decisions. But beyond that, even when the people make a decision and vote, INEC does not allow the people’s will to prevail as expressed in the ballot.\n\n“INEC has been the major challenge for the electoral process, and so the issue of the opposition party winning will be a mirage, except INEC is informed, and INEC leadership is certain that it allows the will of the people to prevail. But there is a snag here, and that is a caution for the country.”\n\nHe warned of grievous consequences if the will of the people was not allowed to prevail.\n\n“When you don’t allow the will of the people to prevail, the consequences for democracy can be grave,” Ologunagba stated. \n\nThe PDP spokesperson said the Ghanaian election gave hope to the Nigerian opposition for the 2027 presidential election.\n\n“The Ghanaians were angry because of the ill-advised policies of the government in that country, and the people expressed it.\n\n“In Nigeria, you can feel the economic hardship. You know that the twin policy of irresponsible floating of the naira, and withdrawal of subsidy on petroleum products without any cushioning effect, is what brought us to this level.\n\n“So, when you have a government that does not respect the will of the people, and how the welfare of the people matters under the constitution, what happened in Ghana is the consequence of such behaviour.”\n\nSimilarly, the NNPP also stated that the Ghanaian election had increased the opposition’s hope of winning the 2027 presidential election.\n\n“The Ghanaian election has given us confidence as opposition parties that we just have to keep working,” said the spokesman for the NNPP, Ladipo Johnson.\n\nHowever, Johnson maintained that for Nigeria to have a replica of the Ghanaian election, the institutions must allow the will of the people to prevail.\n\nHe said, “The Ghanaian election has increased our hope. We hope that Nigerians, especially those in authority, like INEC, the police, and others see that the will of the people must be allowed to prevail. That is the key to it.\n\n“We need stronger institutions in Nigeria. Our institutions are weak. A lot of the people in our institutions wrongly feel that they owe a sense of duty to either the president or the governor or local government chairman or whoever appointed them. Meanwhile, their duty is to the constitution and to the commonwealth and the well-being of the people of Nigeria.\n\n“The moment public servants start to feel that they owe a duty to an individual, then democracy is gradually being eroded. Once we get to that stage, once there is reasonably a level playing ground, then the will of the people will come through.”\n\nJohnson said the opposition parties were hopeful that the wind of change in Ghana would extend to Nigeria.\n\n“When you see the system of one of your neighbouring countries improving, you always hope that the wind of improvement and positive change will blow your way. Things tend to influence each other, and that was why when there was a coup in Niger, a lot of people were panicking in Nigeria, because we all know that at times, the wind blows from area to area, country to country.\n\n“The Ghanaian election has given us confidence as opposition parties that we just have to keep working. We just have to keep talking to Nigerians and make them understand that when someone is giving you palliatives, it means that the government is not working properly,” he added.\n\nJohnson said the NNPP was open to coalition because the party believed in good governance and it wanted the best for Nigeria.\n\n“If we need to enter into a partnership, into a coalition, into a merger, to bring about a government that will help move this country forward, salvage this country, and move it forward, then so be it,” he stated.\n\nBut the APC said it was not frightened by the political movements of the opposition figures, describing the participants as enemies of the country.\n\nSpeaking with Sunday PUNCH, the Publicity Secretary of the APC in Oyo State, Olawale Sadare, said there was no serious opposition currently in Nigeria that could threaten President Tinubu’s re-election.\n\n“They have every right to be optimistic, but the fact is that winning an election goes beyond mere wishes. They need to work for it. As it stands now, we do not even have any opposition at the federal level. My fear is that we may not even have anything called PDP or Labour Party in 2027,” said Sadare.\n\nAccording to him, discerning minds would support Tinubu in 2027 because of his performance and pedigree.\n\n“President Bola Tinubu is not resting on his oars; he is performing, and the 2027 election will be determined on account of pedigree and performance. When we move closer to 2027, every discerning mind in Nigeria will queue behind the president. So, in APC, we don’t have any cause to panic.\n\n“Why should we be frightened by the opposition’s political movements or realignments? They are a bunch of clowns. They just want to remain in the heart of the media. These are known enemies of the country. You talk about a former president or his co-travellers. So, we are not bothered. They can afford to meet on an hourly basis. It is none of our business.”\n\nAlso, the Publicity Secretary of the APC in Lagos State, Seye Oladejo, described the political movements and optimism of the opposition parties as wishful thinking that would not materialise.\n\nOladejo said those involved in political realignment were those who had failed the country at one time or the other.\n\nHe stated the political and economic situations of the US and Ghana were not the same as Nigeria’s, promising that whatever seemed to be hardship now in Nigeria would no longer be in place in 2027.\n\nThe Lagos APC spokesperson said, “The opposition has been busy daydreaming in recent times, and for reasons that are known to them, they are drooling over the results of the election in Ghana and the US. One could wonder if they have been able to situate those results properly. But the truth of the matter is the situations in Ghana and the US are not exactly the same as Nigeria’s.\n\n“The only thing that would be comparable would be that Nigerians will vote for good governance, being put across by APC at different levels in 2027. There is nothing in the camp of the so-called opposition parties to elicit the confidence of Nigerians to entrust them with the mantle of leadership. They are daydreaming.\n\n“I can assure you that before 2027, a lot of things that have been put in place in terms of the reforms would have started yielding fruits. The ruling APC government means well for all.”","summary":"The rise of political movements inspired by the recently concluded American and Ghanaian elections offers a glimmer of hope for the opposition, ISMAEEL UTHMAN writes In the wake of the American and Ghanaian presidential elections, several political movements have emerged in Nigeria, each aiming to challenge President Bola Tinubu’s re-election in 2027. In both the \n\n\n \n Read More","url":"https://punchng.com/2027-political-movements-spread-as-bigwigs-plot-tinubus-ouster/","image":"https://cdn.punchng.com/wp-content/uploads/2024/12/28203848/TINUBU-AND-OTHERS.jpg","video":null,"publish_date":"2024-12-28 23:51:52","author":"Our Reporters","authors":["Our Reporters"],"language":"en","category":"politics","source_country":"ng","sentiment":0.116},{"id":276762070,"title":"Trump’s Greenland comments could be part of policy of countering Russia and China — media","text":"WASHINGTON, December 29. /TASS/. US President-elect Donald Trump’s remarks about making Greenland, Canada and the Panama Canal part of the US could be part of a policy of countering Russia and China, The Washington Post writes, citing sources.\n\n\"An overarching mission of countering Russia and China is the common thread tying together Trump’s comments about Canada, Mexico, Greenland and Panama,\" the paper notes, citing a Trump transition official. \"This isn’t just slapdash, there’s a coherent connective tissue to all of this,\" the official pointed out, adding: \"Trump knows what levers to pull and what guardrails there are and he’s in a position of power to utilize those levers.\"\n\nTrump’s transition team did not respond to a TASS request for comment.\n\nEarlier, Trump referred to Canadian Prime Minister Justin Trudeau as the \"governor\" of the \"Great State of Canada\". He also claimed that the US could retake control of the Panama Canal unless the conditions for its use were revised. In addition, the US president-elect said that Washington needed to have control of Greenland.","summary":"Trump’s transition team did not respond to a TASS request for comment","url":"https://tass.com/world/1895081","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2024-12-28 23:51:13","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.25},{"id":276763604,"title":"Top German newspaper editor quits over Musk op-ed","text":"The opinion editor at Germany’s leading newspaper Die Welt has resigned over the decision to publish an op-ed by Elon Musk, in which he defended the anti-immigration Alternative for Germany (AfD) party.\n\n“I have always enjoyed running the opinion pages of Welt and Welt am Sonntag. Today, an article written by Elon Musk appeared in Welt am Sonntag. I handed in my resignation yesterday, after it went to print,” Eva Marie Kogel wrote on X.\n\nThe billionaire owner of SpeceX, Tesla and X (formerly Twitter) wrote the article after praising AfD on social media. In his op-ed, the major ally of US President-elect Donald Trump hailed AfD as “the last spark of hope” for Germany. The billionaire insisted that its “pragmatic” approach will usher in a revival of the country, while arguing that other parties are out of touch with regular people. \n\n“The traditional parties have failed Germany. Their policies have led to economic stagnation, social unrest and an erosion of national identity,” Musk wrote. “Despite being far-right, AfD represents political realism that resonates with many Germans who feel that their concerns are being ignored by the establishment.” \n\nMusk further defended the AfD, stating that “their portrayal as far-right is clearly false.” \n\nAccording to German media, the publication of the op-ed sparked intense debates among the staff at Die Welt, with some viewing it as meddling in the snap parliamentary election, which is scheduled for February 2025. \n\nJan Philipp Burgard, Die Welt’s senior reporter, penned a rebuttal to Musk, calling his praise of AfD “fatally flawed” and arguing that it was “a big mistake” not to label the party as far-right. \n\nAnother Die Welt journalist, Franziska Zimmerer, insisted in her own op-ed that the text written by Musk “should not have appeared” in the paper. “Election appeals, no matter the party, have no place in independent media,” she wrote.\n\nFounded in 2013, AfD has been pushing for the tightening of asylum laws and fighting organized crime and Islamic extremism. The party has become more popular in recent years, winning its first regional election in Thuringia in September. \n\nThe 2025 election was called after the ruling three-party coalition collapsed due to the conflict over budget.","summary":"A senior editor of Germany’s daily Die Welt has resigned over Elon Musk’s op-ed \nRead Full Article at RT.com","url":"https://www.rt.com/news/610147-musk-op-ed-sparks-controversy/","image":"https://mf.b37mrtl.ru/files/2024.12/article/67708e2620302758c27726a4.jpg","video":null,"publish_date":"2024-12-28 23:48:33","author":null,"language":"en","source_country":"ru","sentiment":-0.032},{"id":276759172,"title":"77 Facts That Blew Our Minds in 2024","text":"Onions were used to treat wounds during the French and Indian War.\n\nThe energy required to show a new Instagram post from Cristiano Ronaldo to each of his followers could power a house for several years.\n\nA group of butterflies flew across the Atlantic Ocean without stopping. It took them only about eight days.\n\nChildren with cystic fibrosis are no longer automatically eligible for the Make-A-Wish Foundation because a new drug works so well that these kids are now expected to have an essentially normal lifespan.\n\nYour body carries literal pieces of your mom—and maybe your grandmother, siblings, aunts, and uncles.\n\nThe generative-AI boom is on pace to cost more than the Apollo space missions.\n\nEarly space capsules lacked handholds and footholds on the outside, and some spacewalking astronauts really struggled to make it back on board.\n\nAround the world, more than 10,000 barcodes are scanned every second.\n\nMcDonald’s cooked its french fries in beef tallow until 1990.\n\nThe fast-food giant also grills its beef patties for exactly 42 seconds.\n\nCalifornia grizzly bears are mostly vegan, but over time, humans have made them more carnivorous.\n\nA tick bite can make you allergic to mammalian meat—so much so that some ranchers are becoming allergic to their own cattle.\n\nWhen some people took a drug originally approved to treat asthma, their food allergies also started disappearing.\n\nBrains have a consistency not unlike tapioca pudding.\n\nThe weight of giant pumpkins increased 20-fold in half a century.\n\nKids don’t really need to eat vegetables.\n\nYou can give rice a nutty flavor by growing cow cells inside the grains.\n\nMushroom genes can make petunias glow.\n\nIn the Middle Ages, people took their pet squirrels for walks and decked them out in flashy accessories.\n\nYou can buy a fitness tracker for your pet.\n\nHumankind has basically reached the limit of airplane-overhead-bin space.\n\nStudy-abroad accents might be real.\n\nEach clan of sperm whales uses its own set of clicking sounds to communicate. Some of these sounds may be older than Sanskrit.\n\nSubtitles from more than 53,000 movies and 85,000 TV-show episodes have been used to train generative AI.\n\nIn 1998, Aaron Sorkin insisted to ABC executives that if he were forced to add a laugh track to his first-ever TV show, Sports Night, he’d “feel as if I’d put on an Armani tuxedo, tied my tie, snapped on my cufflinks, and the last thing I do before I leave the house is spray Cheez Whiz all over myself.” Sports Night still debuted with a laugh track.\n\nComic Sans was originally designed for a program in which an animated dog taught people how to use their first personal computer.\n\nAI image generators have a penchant for rendering hot people.\n\nThe total employees of the government’s free tax-preparation software, Direct File, are outnumbered by the lobbyists working for Intuit.\n\nElectric cars, with powerful acceleration and no fuel costs, might make the best police vehicles.\n\nMinivan sales in America have fallen about 80 percent from their all-time high in 2000.\n\nOne breadfruit tree can feed a family of four for at least 50 years.\n\nProteins can make pretty good sugar substitutes.\n\nSylvester Graham, the inventor of the graham cracker, thought his crackers would curtail masturbation.\n\nIn July, a cybersecurity company accidentally introduced a single software bug that canceled or delayed tens of thousands of flights and trains, halted surgeries, and blacked out television broadcasts around the world.\n\nAmericans threw out four times as many small appliances in 2018 as they did in 1990.\n\nLuddites actually didn’t hate technology.\n\nWhen our writer ran his own dissertation through the plagiarism-detection software that was likely used to help bring down Harvard President Claudine Gay, it initially claimed that his work was 74 percent copied. The correct number was zero.\n\nClassical composers used dice to randomly compose songs.\n\nMale birth control could soon be as simple as rubbing a gel on the shoulders and upper arms daily.\n\nHumans could find alien life by detecting fluorescent corals on other planets.\n\nIn April, a red Tesla Model S became the first electric car to travel 2 million kilometers. The car could have traveled from the Earth to the moon and back, twice, then circled the equator 11 times.\n\nBlocking the sun can lower how hot a person feels by 36 to 72 degrees Fahrenheit.\n\nTermites bury fellow colony members that have been dead for a while. Fresh corpses, they devour.\n\nIn the 20th century, each day on Earth got longer by between 0.3 and 1.0 millisecond. That rate has been increasing since 2000, and could nearly double by 2100.\n\nThe winds of a Category 5 hurricane are faster than the world’s fastest rollercoaster.\n\nIn 1993, scientists dumped nearly 1,000 pounds of iron crystals into the Pacific Ocean to draw carbon dioxide out of the air.\n\nAnd in 2008, China used cloud seeding to clear the skies over Beijing ahead of the Olympics.\n\nIn Goodyear, Arizona, a data center used for generative AI may guzzle as many as 56 million gallons of drinking water each year.\n\nForty-two percent of MIT students now major in computer science.\n\nAir conditioners’ money-saver mode is a lie.\n\nBy 2040, as few as 10 countries will have enough snow to host the Winter Olympics.\n\nDogs may be entering a new wave of domestication.\n\nAnd the domestication they’ve already undergone may have led them to bark more.\n\nElephants and parrots use namelike calls that identify them as individuals. Whales and bats might too.\n\nSigmund Freud said he put his patients on the couch because he could not deal “with being stared at by other people for eight hours a day.”\n\nOur brains release dopamine in response to even the most rudimentary animations.\n\nA model of a human embryo made from stem cells secreted hormones that turned a pregnancy test positive.\n\nAmerican men married to women are five times more likely to fully adopt their wife’s surname than to append it to their own with a hyphen.\n\nBedbugs’ mating rituals may have supercharged their immune system.\n\nLions on the East African savannas struggled to hunt zebras because of a single ant species.\n\nWanting is different from liking.\n\nA “Christian conservative” mobile-phone-service provider has been operating in the U.S. for more than a decade. It pays T-Mobile for access to its cellular network.\n\nBefore Joe Biden dropped out of the presidential race, his campaign team maintained an account on Donald Trump’s Truth Social site. They used it to try to goad the Trump campaign into selecting a more extreme vice-presidential candidate.\n\nA slim majority of Republican voters now favor legalizing recreational marijuana.\n\nThe hottest new psychedelic drugs might not cause any trip at all.\n\nSome scientists believe that multicellular life may have arisen thanks to enormous mountain ranges.\n\nBRCA mutations, famously linked to breast cancer, can also lead to cancer in the pancreas and prostate.\n\nA dentist found a hominin jawbone in a floor tile of his parents’ newly renovated house.\n\nChewing gum became a baseball standby in part because Philip Wrigley, the heir to the Wrigley Company, gave it to players in the Chicago Cubs clubhouse after he took over ownership of the team in 1932.\n\nSociologists have conducted several ethnographies on long-running pickup-basketball games.\n\nThe 10,000-steps-a-day goal doesn’t originate from clinical science. Instead, it comes from a 1965 marketing campaign by a Japanese company that was selling pedometers.\n\nAs the world warms, some dog mushers are running their teams at night so the animals don’t overheat.\n\nExtreme heat led schools to move recess indoors for millions of students in August and September.\n\nHigher amounts of naturally occurring lithium in tap water are associated with lower suicide rates in some countries.\n\nYou can buy a $99 quantum water bottle “charged” with special healing frequencies.\n\nHumans have 10 times as many sweat glands as chimpanzees do.\n\nIf you want to tame all that sweat, you should put your antiperspirant on at night.","url":"https://www.theatlantic.com/science/archive/2024/12/facts-blew-our-minds-2024/681175/","image":"https://cdn.theatlantic.com/thumbor/HCNXa4c5JGO038-y0MmUt8qEpaE=/0x68:2000x1110/1200x625/media/img/mt/2024/12/20241224_funfacts_matija_medved_h/original.jpg","video":null,"publish_date":"2024-12-28 23:38:50","author":"The Atlantic Science Desk","authors":["The Atlantic Science Desk"],"language":"en","source_country":"us","sentiment":0.221},{"id":276759168,"title":"The Future of the Democratic Party","text":"Democrats have veered into identity politics and away from the interests of the working class. On Washington Week With The Atlantic, George Packer joins Jeffrey Goldberg to discuss his recent reporting on the Democratic Party’s illusions and the future of American politics.\n\nDonald Trump’s reelection should put an end to two progressive illusions, Packer explained last night: The first of these illusions is the notion that identity is political destiny; the second is the theory that the Democratic Party has been kept out of power by a white Republican minority thwarting the popular will through means such as voter suppression or gerrymandering.\n\n“The Democratic Party has become the party of establishment, of status quo, of the institutions,” Packer said. The party has come to organize itself under a framework that the “most basic identity of a citizen is group identity based on race, gender, sexuality.” But in doing so, they’ve “lost a large number of ordinary Americans who don’t see themselves primarily in those terms, who are mostly working-class … and who used to be the backbone of the Democratic Party.”\n\nMeanwhile, as with the drift of the working class away from Democrats and towards Republicans, the country’s increasingly isolationist global stance has also been building. “We are not the unipolar power that we were after the end of the Cold War,” Packer said. “We stood for a certain order, a certain set of values, a certain liberal view of the world, and I think that could collapse very quickly under Trump because he doesn’t believe in it—in fact, he wants to destroy it, and so do the people he’s putting into key positions.”\n\nPacker discusses this, as well as his reporting on conspiracism and hyper-partisanship in Phoenix, Arizona, the nation’s fastest-growing city, with the editor in chief of The Atlantic, Jeffrey Goldberg.\n\nWatch the full episode here.","url":"https://www.theatlantic.com/national/archive/2024/12/future-democratic-party-washington-week/681144/","image":"https://cdn.theatlantic.com/thumbor/n52gOGv42SPyd_ttikt4Q7F8iaU=/0x58:2876x1556/1200x625/media/img/mt/2024/12/Screenshot_2024_12_21_at_8.07.05AM/original.png","video":null,"publish_date":"2024-12-28 23:38:50","author":"The Editors","authors":["The Editors"],"language":"en","category":"politics","source_country":"us","sentiment":-0.034},{"id":276758342,"title":"Who is Laura Loomer? Know why one of Donald Trump's biggest supporters is fed up with Elon Musk","text":"Right-wing influencer and staunch Donald Trump supporter Laura Loomer has launched a fierce attack on billionaire and Tesla CEO Elon Musk, accusing him of pushing immigration policies that harm American workers. Loomer, known for her controversial views, criticised Musk’s influence on Trump and dismissed his “Department of Government Efficiency” project with entrepreneur Vivek Ramaswamy as a “vanity project.” Taking to social media platform X, Loomer predicted a falling-out between Musk and Trump while using harsh language and slurs to intensify her criticism. She accused Musk of being a “pawn of China” and alleged he had “bought his way into MAGA” to influence US immigration policy for personal gain. Loomer’s posts also targeted Musk’s ties to immigrants from India and China. “Tech billionaires don’t get to rewrite our immigration policies so they can have unlimited slave laborers from India and China,” she wrote. Loomer further accused Musk of overstaying his welcome at Mar-a-Lago, Trump’s residence, to gain favour with the former president. Vivek Ramaswamy, Musk’s partner in the government efficiency project, also faced backlash from Trump loyalists. His criticisms of American culture sparked racist attacks from far-right groups, adding to the tensions within the MAGA movement. Musk responded to Loomer by dismissing her as a troll, but her attacks highlight the growing divides within Trump’s support base. As Musk and Ramaswamy continue their collaboration, they may face increasing challenges from hardline Trump allies, raising questions about their future within the MAGA world.","url":"https://www.dnaindia.com/world/report-who-is-laura-loomer-know-why-one-of-donald-trump-biggest-supporters-is-fed-up-with-elon-musk-3124609","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2024/12/28/2669103-befunky-collage-2024-12-28t092228.919-1.jpg","video":null,"publish_date":"2024-12-28 23:33:50","author":"Shivam Verma","authors":["Shivam Verma"],"language":"en","category":"politics","source_country":"in","sentiment":0.373},{"id":276757786,"title":"Why will India’s foreign policy be a tightrope walk?: Explained - Premium","text":"The story so far:\n\nAfter Prime Minister Narendra Modi was sworn in for a third time in June, the year was jam-packed with incoming and outgoing visits. Above all, 2024 was full of global insecurity and shocks in the neighbourhood, particularly Bangladesh. As 2025 looks to be even more uncertain, Indian foreign policy’s biggest challenge is to remain poised for change.\n\nWhat were the high points in India’s external relations?\n\nThe most difficult negotiation completed this year was for disengagement at the Line of Actual Control with China. While restoring ties and rebuilding the trust shattered by the Chinese PLA’s transgressions since 2020 is a more prolonged task, the first formal Modi-Xi Jinping meeting in five years at Kazan, on the sidelines of the BRICS summit in Russia, was a turning point.\n\nThe year began with a visit from French President Emmanuel Macron as a guest on Republic Day and a reaffirmation of the dependability of bilateral ties. Mr. Macron was not the government’s original invitee, as Mr. Modi had hoped to host U.S. President Joseph Biden and also hold the Quad in Delhi that time. But when Mr. Macron stepped in, Mr. Modi set the seal on a number of India-France future forays in defence, energy and maritime cooperation. Early in 2024, the conclusion of the India-European Free Trade Association agreement, India’s first with Europe, was heralded as a template for India to complete other such negotiations, although the year ended without similar progress on FTAs with Australia, the U.K., and the European Union.\n\nThe neighbourhood was also the subject of some bright spots, including the attendance of leaders of most of the neighbouring countries for Mr. Modi’s swearing-in. Pakistan wasn’t invited, but External Affairs Minister S. Jaishankar made the first such visit in nearly a decade to Islamabad for the SCO summit. Several visits by the Bhutan King Jigme Khesar Namgyel Wangchuck and Prime Minister Tshering Tobgay as well as Mr. Modi’s visit to Thimphu to receive an award, and successful visits by the new Sri Lankan President Anura Kumara Dissanayake and Maldives President Mohamed Muizzu, setting aside the tensions earlier, were other high points of the year.\n\nWhat kept South Block awake at night in 2024?\n\nThe transformation of Bangladesh, from a friendly neighbour and most important connectivity partner under Prime Minister Sheikh Hasina, to becoming estranged over her ouster from power in August was the year’s biggest shock for New Delhi. The MEA repeatedly raised concerns over the sharp rise in attacks on Hindu minorities that followed, and Ms. Hasina’s stay in India has become the biggest thorn in the once close partnership.\n\nTies with Canada took a turn for the worse as Canadian authorities doubled down on allegations that Indian officials had ordered the Nijjar killing, even naming Home Minister Amit Shah in the alleged conspiracy. New Delhi dealt with Canada by slamming its doors shut on PM Justin Trudeau, with the hope a new government will be elected there in 2025. But it wasn’t easy to do the same with the U.S., where the Department of Justice filed indictments against the Adani group and a new indictment against an Indian official for the alleged Pannun assassination plot. The U.S.’s role in the South Asian neighbourhood, especially with the changes in Bangladesh, and China’s forays into Nepal and other neighbours are a continuing challenge. However, the election of U.S. President Donald Trump and the largely pro-India team he has picked could be a breather.\n\nHow did Indian foreign policy navigate global conflict?\n\nWith both the Russia-Ukraine conflict and Israel’s war in Gaza, India consistently put itself on the “side of peace”. Mr. Modi’s visits to Russia and Ukraine within weeks of each other raised speculation that he would play mediator in future negotiations. There were no high-level visits from or to Israel, and Mr. Modi made a point of meeting Palestinian PM Mahmoud Abbas at the UN. While New Delhi repeatedly called for an end to the civilian casualties, it continued to hedge its position at the UN on resolutions seeking to bring Israel to account for the killing of more than 45,000 in Gaza. With multilateral initiatives like IMEC (India-Middle East Europe-Economic Corridor) and I2U2 (India, Israel, UAE and U.S.) in trouble, India sought to engage West Asian countries bilaterally. In 2025, a more difficult tightrope walk for South Block is expected between Iran and the Israel-U.S. combine.\n\nWhat’s on the diplomatic calendar in 2025?\n\nMr. Jaishankar’s year-end visit to Washington and meetings with the Trump transition team indicate that ties with the U.S. will be a priority in 2025. Mr. Trump is expected to visit India for the Quad Summit next year and Mr. Modi is likely to call on him in Washington before that. 2025 is expected to begin with a ministerial visit from Iran, followed by U.S. NSA Jake Sullivan for a last-moment iCET (Initiative on Critical and Emerging Technology) meet.\n\nIndonesian President Prabowo Subianto will be the Republic Day guest. All eyes will be on Russian President Vladimir Putin’s visit to Delhi, his first since the war began, expected to be finalised early in 2025.","url":"https://www.thehindu.com/news/national/why-will-indias-foreign-policy-be-a-tightrope-walk-explained/article69036807.ece","image":"https://th-i.thgim.com/public/incoming/4935zl/article69038039.ece/alternates/LANDSCAPE_1200/2024-12-28T140932Z_403258091_RC25XBAIZG72_RTRMADP_3_KAZAKHSTAN-CRASH-RUSSIA.JPG","video":null,"publish_date":"2024-12-28 23:33:50","author":"Suhasini Haidar","authors":["Suhasini Haidar"],"language":"en","source_country":"in","sentiment":0.055},{"id":276757784,"title":"What will a second Trump presidency bring?: Explained - Premium","text":"The story so far:\n\nWhen U.S. President-elect Donald Trump is administered the oath of office on January 20, 2025, and officially kicks off his second term at the White House, it will be the onset of four years that herald the deepening of domestic and foreign policy priorities enacted in his first term as President. On the cards are a reimposition of punitive tariffs against nations exporting to the U.S., and India is likely to feature on that list; a tough stance on immigration; and changes in foreign policy, with America likely to see the continuing withdrawal from global, multilateral and regional engagement like in his first term.\n\nWhat tariffs policies and tax cuts are likely to be tabled by the Trump administration?\n\nThe first Trump administration started a trade war with China when it hit Beijing in 2018 with a punitive net tariff coverage of nearly 15% of all U.S. imports. In that case, his administration had already imposed several tariffs prior to 2018 as well, with the result that there were overlapping tariffs on a number of products; for example, the 25% tariff that was imposed that year was over and above an antidumping tariff of approximately 66% that was already in place. Despite this somewhat chaotic approach to tariff imposition, one fact was clear — China was the main target on the global stage: at 11.1% import coverage by U.S. special tariffs in 2018, the rate slapped on Beijing dwarfed the rate for other exporters to the U.S., including India, at 0.2%. In terms of products, the U.S. special tariffs preponderantly targeted imports of intermediate goods, and to a much lesser extent capital goods and final products. This is likely to have impacted the final price of finished goods based on intermediate goods sourced within the U.S.\n\nDuring his 2024 campaign, Mr. Trump had affirmed that he would impose an across-the-board tariff of somewhere between 10%-20% on the entire $3 trillion worth of U.S. goods imports and a China-specific additional tariff of 60%. Assuming that the focus on intermediate goods continues in this context, this would imply a significant jump from his first term in terms of the value of goods impacted, most likely additional tens of billions of dollars’ worth on commodities such as steel and aluminium and at least $300 billion worth of Chinese goods. Retaliation from China, the E.U., India, and other trading partners of the U.S. is sure to follow swiftly.\n\nRegarding the high likelihood of a corporate tax cut, it could come in the form of renewing the lapsing cuts that Mr. Trump had introduced in 2017, through the Tax Cuts and Jobs Act. This despite — or perhaps precisely because of — the fact that the policy did reduce taxes for most people, though it disproportionately benefitted the wealthy, according to the non-partisan Center on Budget and Policy Priorities. Their analysis at the time noted this policy resulted in households with incomes in the top 1% receiving an average tax cut of more than $60,000 if the cuts were maintained, compared to an average tax cut of less than $500 for households in the bottom 60%. Additionally, the Trump tax cut “was expensive and eroded the U.S. revenue base… and failed to deliver promised economic benefits,” the CBPP noted.\n\nOther economic policy actions that the Trump White House might advocate for include a carbon-border adjustment tax and quantitative restrictions on investments into U.S. assets such as infrastructure and essential medicine production capabilities, by China.\n\nHis administration would also likely seek the inputs of the Department of Government Efficiency — led by the “tech bros” Elon Musk and Vivek Ramaswamy — to reduce wastage and inefficiencies within the purview of the federal government, including by rationalising the actions of bureaucrats and cutting down on regulations across sectors. While the duo have hinted at potentially finding $2 trillion in savings through this initiative, including via mass layoffs and the shutting down of some agencies entirely, critics have challenged the size of the potential gains that could be made here.\n\nWhat action is expected on immigration?\n\nGoing by the Trump campaign’s policy promises in the lead-up to the 2024 election, there is a distinct possibility of a large-scale deportation of undocumented workers. However, there may be several obstacles that the White House might encounter as it carries out this possibly unprecedented action. Firstly, across several states, key urban hubs have vowed to be “sanctuary cities” and pass laws to limit local law enforcement cooperation with the federal government’s Immigration and Customs Enforcement. This is likely to make it politically complicated to carry out detention and deportation actions on a sizeable scale and in a short time frame. Secondly, the Trump campaign is yet to share details on the cost of such operations to the exchequer, but non-partisan analysts such as the American Immigration Council estimate that such an immigration proposal could potentially cost taxpayers considerably more than $300 billion. These estimates notwithstanding, there is little doubt that Mr. Trump will attempt to accelerate deportations to fulfil his campaign promises, especially as the first Trump administration deported close to 1.5 million people – almost the same number as outgoing President Joe Biden and far less than former President Barack Obama, who turned away nearly 3 million people over eight years in office.\n\nWhat impact could be expected regarding U.S. foreign policy?\n\nMr. Trump has proclaimed publicly without explanation or details that he can and will end the Russia-Ukraine war and the Israel-Hamas conflict. On the former, he has said he would end the war even prior to Inauguration Day, even if he views the conflict through the lens of halting the “endless flow of American treasure to Ukraine” and demanding that NATO allies in Europe reimburse Washington for its war-related expenses if they expect military support from the U.S. against future Russian aggression.\n\nRegarding Israel, the incoming President has followed in Mr. Biden’s footsteps and criticised the Israeli government’s aggression in Gaza, although Mr. Trump had tacitly expressed support for Israel by moving the U.S. embassy from Tel Aviv to Jerusalem in his first term.\n\nWhat bolsters Mr. Trump’s intentions?\n\nWhile the Trump 2.0 administration is yet to spell out critical details regarding its policy plans on the domestic and international fronts, one thing is certain: Mr. Trump enjoys an overwhelming mandate expressed through the result of the 2024 election. Further, he will be fundamentally operating from a position of institutional strength given the federal government trifecta, which implies that the White House will enjoy the luxury of greater cooperation in getting policies sanctioned by Congress, and possibly important cases ruled in his administration’s favour by a sympathetic U.S. Supreme Court.","url":"https://www.thehindu.com/news/international/what-will-a-second-trump-presidency-bring-explained/article69036811.ece","image":"https://th-i.thgim.com/public/news/national/ygsurp/article69038006.ece/alternates/LANDSCAPE_1200/FAQ1.jpg","video":null,"publish_date":"2024-12-28 23:33:50","author":"Narayan Lakshman","authors":["Narayan Lakshman"],"language":"en","category":"politics","source_country":"in","sentiment":-0.358},{"id":276757768,"title":"Jaishankar meets Trump's NSA-pick Waltz; discusses bilateral ties, global issues","text":"External Affairs Minister S. Jaishankar has met Congressman Michael Waltz, who is President-elect Donald Trump's nominee for National Security Adviser, during which they had a wide-ranging conversation on the bilateral partnership between India and the U.S. as well as current global issues.\n\nMr. Jaishankar is on an official visit to the U.S. from December 24 to 29. This was the first highest-level in-person meeting between the Indian government and the incoming Trump administration.\n\n “Delighted to meet” Waltz “this evening”, Mr. Jaishankar posted on X on Friday.\n\n “Enjoyed a wide-ranging conversation on our bilateral partnership as well as current global issues. Look forward to working with him,” he said.\n\nMr. Waltz, 50, would replace Jake Sullivan as the National Security Adviser on January 20, when Mr. Trump would be sworn in as the 47th President of the U.S.\n\n Mr. Waltz is no stranger to the India-U.S. relationship. A three-term Congressman from the sixth Congressional District of Florida, Waltz is Republican Co-Chair of Congressional India Caucus, which is the largest country-specific Caucus in the U.S. House of Representatives.\n\nMr. Waltz also co-led a Congressional delegation to India in August last year and attended the Independence Day celebrations at Red Fort. He has been the sponsor of several India-friendly legislations in the House of Representatives. On November 12, Mr. Trump announced that Waltz would be his National Security Adviser.\n\nEarlier in the day, Mr. Jaishankar said he \"concluded a very useful two-day conference of team @IndianEmbassyUS and our Consuls General in Washington DC\".\n\n \"Confident from the deliberations that the continuous growth of the India-US partnership will be accelerated,\" he posted on X.","url":"https://www.thehindu.com/news/national/jaishankar-meets-trumps-nsa-pick-waltz-discusses-bilateral-ties-global-issues/article69037958.ece","image":"https://th-i.thgim.com/public/incoming/ucjfao/article69038078.ece/alternates/LANDSCAPE_1200/PTI12_28_2024_000006B.jpg","video":null,"publish_date":"2024-12-28 23:33:50","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.274},{"id":276758298,"title":"Elon Musk again comes in support of Sriram Krishnan after racist pic shows him as butter chicken","text":"Ever since Indian-origin Sriram Krishnan's name came out as the Senior White House Policy Advisor for US President-elect Donald Trump, the entrepreneur has been a subject of debate. His views on immigration and green card caps have been criticised by many, however, the world’s richest man and one of the greatest tech entrepreneurs of all time, Elon Musk, has backed Krishnan. In of those criticism posts, one X user posted a picture of an Indian dish, butter chicken, and along with the picture of Sriram Krishnan. The post read, “Here is what Sriram Krishnan would look like if he was butter chicken.” The butter chicken picture seems to be an AI-generated picture that covers Krishnan’s face and neck with the Indian dish. These racist attacks are disgusting. [ @sriramk is awesome, for the record ] https://t.co/mZPLrMuLz3 — @jason (@Jason) December 27, 2024 Elon Musk’s reactions: A user on X, Jason supported Sriram and criticised the racist post saying, “These racist attacks are disgusting. [ @sriramk is awesome, for the record ].” Musk in reply to Jason’s comments wrote, “100” by using an emoji, which is a sign of saying “100 percent” and is written in support of anything. In an earlier post Krishnan expressed his views on green card and immigration and said, “Anything to remove country caps/unlock skilled immigration would be huge”. He was criticised on his views by a far-right commentator Laura Loomer. Donald Trump’s new head of artificial intelligence (AI) and crypto David Sacks clarified Krishnan’s views and in reply said, “Point of clarification: Sriram didn’t say he wants to remove all caps on green cards. He said he wants to remove *country* caps on green cards...”. Elon Musk supported Sack’s views and wrote, “Makes sense”. Deeply disturbing to see the appointment of Sriram Krishnan @sriramk as Senior Policy Advisor for AI at the Office of Science and Technology Policy. It’s alarming to see the number of career leftists who are now being appointed to serve in Trump’s admin when they share views… https://t.co/pf0WiViy32 pic.twitter.com/nR0TkZpNK7 — Laura Loomer (@LauraLoomer) December 23, 2024 Makes sense — Elon Musk (@elonmusk) December 24, 2024 Sriram Krishnan’s appointment and his views on immigration and green card policies sparked a debate which led to clash between the top tech entrepreneurs including Elon Musk and Trump’s loyal supporters. This debate was made even more complex after Donald Trump who staunchly put restrictions on H1B visa in his last term became more soft supporting extending green cards to graduates.","url":"https://www.dnaindia.com/technology/report-elon-musk-again-comes-in-support-of-sriram-krishnan-after-racist-pic-shows-him-as-butter-chicken-3124664","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2024/12/28/2669157-elon-musk-supported-sriram-krishnan-over-a-racist-social-media-post.jpg","video":null,"publish_date":"2024-12-28 23:33:50","author":"Vaishali Shastri","authors":["Vaishali Shastri"],"language":"en","source_country":"in","sentiment":0.003},{"id":276763058,"title":"Trump sides with Elon Musk in right-wing row over worker visas","text":"US president-elect Donald Trump weighed in on Saturday in a bitter debate dividing his traditional supporters and tech barrons such as Elon Musk, saying that he backs a special visa programme that helps highly skilled workers enter the country.\n“I’ve always liked the [H1-B] visas, I have always been in favour of the visas, that’s why we have them” at Trump-owned facilities, Trump told the New York Post in his first public comments on the matter since it flared up this week.\nAn angry back-and-forth, largely between Silicon Valley’s Musk and traditional anti-immigration Trump backers, has erupted in fiery fashion, with Musk even vowing to “go to war” over the issue.\nTrump’s insistent calls for sharp curbs on immigration were central to his election victory in November over US President Joe Biden. He has vowed to deport all undocumented immigrants and limit legal immigration.\nBut tech entrepreneurs such as Tesla’s Musk – as well as Vivek Ramaswamy, who with Musk is to co-chair a government cost-cutting panel under Trump – say the United States produces too few highly skilled graduates, and they fervently champion the H1-B programme.\n\nMusk, who himself migrated from South Africa on an H1-B, posted on Thursday on his X platform that luring elite engineering talent from abroad was “essential for America to keep winning”.\nAdding acrimony to the debate was a post from Ramaswamy, the son of immigrants from India, who deplored an “American culture” that he said venerates mediocrity, adding that the United States risks having “our asses handed to us by China”.\nThat angered several prominent conservatives who were backing Trump long before Musk noisily joined their cause this year, going on to pump more than US$250 million into the Republican’s campaign.\n“Looking forward to the inevitable divorce between President Trump and Big Tech,” said Laura Loomer, a far-right MAGA figure known for her conspiracy theories, who often flew with Trump on his campaign plane.\n“We have to protect President Trump from the technocrats.”\nShe and others said Trump should be promoting American workers and further limiting immigration.\n\nMusk, who had already infuriated some Republicans after leading an online campaign that helped tank a bipartisan budget deal last week, fired back at his critics.\nPosting on X, the social media site he owns, he warned of a “MAGA civil war”.\nMusk bluntly swore at one critic, adding: “I will go to war on this issue.”\nThat, in turn, drew a volley from Trump strategist Steve Bannon, who wrote on the Gettr platform that the H1-B programme brings in migrants who are essentially “indentured servants” working for less than American citizens would.\nIn a striking jab at Trump’s close friend Musk, Bannon called the Tesla CEO a “toddler”.\nSome of Trump’s original backers say they fear he is falling under the sway of big donors from the tech world such as Musk and drifting away from his campaign promises.\nIt was not immediately clear whether Trump’s remarks might soothe the intraparty strife, which has exposed just how contentious changing the immigration system might be once he takes office in January.","summary":"‘I’ve always liked the [H1-B] visas,’ Trump said of the special visa programme that helps highly skilled workers enter the country.","url":"https://www.scmp.com/news/world/united-states-canada/article/3292624/trump-sides-elon-musk-right-wing-row-over-worker-visas","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/12/29/4d75d105-d916-4498-9c7f-6db07091c266_e60e53ff.jpg","video":null,"publish_date":"2024-12-28 23:32:48","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":0.081},{"id":276756936,"title":"International News: Mexico detains almost 475,000 migrants heading to U.S. over last quarter","text":"Posted: Saturday, December 28, 2024. 9:59 am CST.\n\nMexico has detained nearly 475,000 migrants heading to the U.S. between October 1 and December 26, authorities reported on Friday.\n\nThe surge in detentions follows U.S. President-elect Donald Trump’s threats to impose tariffs on Mexico unless it halts illegal migration, Reuters report.\n\nWith around 900,000 migrants detained this year, Mexican authorities have ramped up enforcement, especially toward the end of 2023.\n\nForeign Minister Juan Ramón de la Fuente highlighted that Mexico’s efforts have led to an 81% drop in migrant detentions at the U.S. border compared to last year.\n\nThe increased detentions align with commitments made by Mexico’s President Claudia Sheinbaum, who discussed immigration control measures with Trump in November following the tariff threat.\n\nAdvertise with the mоѕt vіѕіtеd nеwѕ ѕіtе іn Belize ~ We offer fully customizable and flexible digital marketing packages. Your content is delivered instantly to thousands of users in Belize and abroad! Contact us at mаrkеtіng@brеаkіngbеlіzеnеwѕ.соm or call us at 501-612-0315.\n\n© 2024, BreakingBelizeNews.com. Content is copyrighted and requires written permission for reprinting in online or print media. Theft of content without permission/payment is punishable by law.","url":"https://www.breakingbelizenews.com/2024/12/28/international-news-mexico-detains-almost-480000-migrants-heading-to-u-s-over-last-quarter/","image":"https://www.breakingbelizenews.com/wp-content/uploads/2024/12/Screenshot-2024-12-28-at-09-58-06-Peddler-Migrant-Beach-Free-photo-on-Pixabay.jpg","video":null,"publish_date":"2024-12-28 23:28:50","author":null,"language":"en","source_country":"bz","sentiment":-0.151},{"id":276756912,"title":"International News: Mexico tests app for migrants to alert relatives of detention in U.S.","text":"Posted: Saturday, December 28, 2024. 9:22 am CST.\n\nMexico is testing a new cellphone app that allows migrants to alert their relatives and local consulates if they are about to be detained by U.S. immigration authorities.\n\nThe app, described as a “panic button,” sends notifications to chosen contacts and the nearest Mexican consulate when activated, AP reports.\n\nThis initiative comes in response to President-elect Donald Trump’s promises of mass deportations.\n\nMexico’s Foreign Secretary Juan Ramón de la Fuente said the app is performing well in early trials and is expected to be fully launched in January.\n\nThe government has also increased consular support and established a 24/7 call center to assist migrants.\n\nMexico estimates there are 11.5 million Mexican migrants in the U.S., with 4.8 million lacking legal status.\n\nAdvertise with the mоѕt vіѕіtеd nеwѕ ѕіtе іn Belize ~ We offer fully customizable and flexible digital marketing packages. Your content is delivered instantly to thousands of users in Belize and abroad! Contact us at mаrkеtіng@brеаkіngbеlіzеnеwѕ.соm or call us at 501-612-0315.\n\n© 2024, BreakingBelizeNews.com. Content is copyrighted and requires written permission for reprinting in online or print media. Theft of content without permission/payment is punishable by law.","url":"https://www.breakingbelizenews.com/2024/12/28/international-news-mexico-tests-app-for-migrants-to-alert-relatives-of-detention-in-u-s/","image":"https://www.breakingbelizenews.com/wp-content/uploads/2024/11/Screenshot-2024-11-28-at-09-24-05-Hands-Phone-Smartphone-Free-photo-on-Pixabay.jpg","video":null,"publish_date":"2024-12-28 23:28:50","author":"This Simple Trick","authors":["This Simple Trick"],"language":"en","category":"politics","source_country":"bz","sentiment":-0.464},{"id":276764146,"title":"Rep. CNN Panelist Says the Country ‘Needs’ Elon Musk as Trump Supporters Call for His Political End","text":"Skip to Main Content\n\nNewsletters\n\nCSCHEAT SHEET\nNEWSLETTERS\n\nCheat Sheet\n\nManage Newsletters\nSubscription Offers\n\nRep. CNN Panelist Says the Country ‘Needs’ Elon Musk as Trump Supporters Call for His Political End\n\n'UNEQUIVOCALLY GOOD'\n\nMega-MAGA devotee Laura Loomer has voiced fears that Elon Musk is a threat to Donald Trump’s GOP, but Scott Jennings said the tech mogul is a boon for the United States.\n\nKatie Francis \n\nPublished Dec. 28 2024 6:23PM EST \n\nKatie Francis\n\nGot a tip? Send it to The Daily Beast here.\nTrending Now\n\nMediaElon Musk Turns MAGA Civil War Nuclear: F**k Yourself in the Face\n\nKatie Francis\n\nPoliticsMAGA Crisis Could Mean No Trump Inauguration on Jan. 20\n\nJanna Brancolini\n\nPoliticsBattle-Scarred Johnson Issued Ultimatum: ‘Start Taking Extraordinary Measures’\n\nWilliam Vaillancourt\n\nMediaBill Maher Confronts Jay Leno With Gambling Debt Rumors\n\nMatt Wilstein\n\nMediaSex, Lies and Jesus: Inside Fox News’ Latest Love Story\n\nLeigh Kimmins\n\nTrending Now\n\nMediaElon Musk Turns MAGA Civil War Nuclear: F**k Yourself in the Face\n\nKatie Francis\n\nPoliticsMAGA Crisis Could Mean No Trump Inauguration on Jan. 20\n\nJanna Brancolini\n\nPoliticsBattle-Scarred Johnson Issued Ultimatum: ‘Start Taking Extraordinary Measures’\n\nWilliam Vaillancourt\n\nMediaBill Maher Confronts Jay Leno With Gambling Debt Rumors\n\nMatt Wilstein\n\nMediaSex, Lies and Jesus: Inside Fox News’ Latest Love Story\n\nLeigh Kimmins\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nBACK TO TOP ↑\n\nCheat Sheet\n\nSUBSCRIPTIONCROSSWORDNEWSLETTERSPODCASTS\n\nGET THE APP\n\nCode of Ethics & Standards\n\nTerms & conditions\nCopyright & Trademark\n\nCookie Settings\n© 2024 The Daily Beast Company LLC","summary":"CNNGOP strategist Scott Jennings voiced his support for Elon Musk amid growing concerns from MAGA devotees that his power is growing unchecked.\n\nWhile just days ago Musk was the Republican darling, recent comments from him and his DOGE co-head Vivek Ramaswamy about the suitability of immigrants over Americans for top jobs have left many seething.\n\nConsidering Musk is the richest man in the world, he has the wealth to potentially back up his own philosophies over those of President-elect Donald Trump. Some Republicans have insisted it’s time to get the Tesla honcho out of politics—but Jennings spoke passionately in his defence on Friday’s NewsNight With Abby Phillip.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/rep-cnn-panelist-says-the-country-needs-elon-musk-as-trump-supporters-call-for-his-political-end/","image":"https://www.thedailybeast.com/resizer/v2/JD2F3XLKNVE5VBIFHGAPT4GLOM.png?smart=true&auth=84cac695b74564c2c5c33c616b0cf610dcaa58dda4769be3c86ee483aa4089ae&width=1440&height=1080","video":null,"publish_date":"2024-12-28 23:23:04","author":"Katie Francis","authors":["Katie Francis"],"language":"en","category":"politics","source_country":"us","sentiment":0.231},{"id":276755266,"title":"Donald Trump caught in another Musk fight – this time over immigration","text":"To glance at Donald Trump’s feed on his Truth Social platform this weekend, you would be forgiven for thinking all was well in MAGA world.\n\nThe incoming president has been serving up his normal diet of provocation and self-promotion: railing against the Democrats’ alleged financing of celebrity endorsements, for example; reposting a dig at Joe Biden’s fitness for office; plugging a Newsmax interview with his wife Melania. All fairly standard Trumpian fare.\n\nThe Telegraph London","url":"https://www.afr.com/world/north-america/trump-caught-in-another-musk-fight-this-time-on-immigration-20241229-p5l11g","image":"https://static.ffx.io/images/$zoom_0.4169%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_369%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_analysis_no_age_social_wm/cb5350fa711f172700c96187caf33741b3d5410c","video":null,"publish_date":"2024-12-28 23:18:50","author":"Henry Bodkin","authors":["Henry Bodkin"],"language":"en","category":"politics","source_country":"au","sentiment":-0.146},{"id":276753342,"title":"Be Warned: The Dems Aren’t Finished Hatching Schemes to Keep Trump from Taking Office","text":"Throughout the 2024 campaign, Democrats insisted that we simply had to vote for Kamala Harris, or else the nation would descend into the fascist rule of Bad Orange Man, the most dangerous enemy of “our democracy” since the reigns of terror of his good friends and role models Adolf Hitler and Genghis Khan. It was all bunkum, of course, and an extended use of the old tactic of accusing the enemy of what they were guilty of doing, as it was the Biden-Harris regime that took actual steps to criminalize opposition to its policies. And now, even after their disastrous electoral defeat, the defenders of democracy are still hatching plans to subvert the will of the people and prevent Donald Trump from returning to the Oval Office. \n\nThe Daily Caller reported Friday that political analyst Mark Halperin Political analyst Mark Halperin has warned that “as President-elect Donald Trump’s inauguration approaches, efforts to block him from assuming office will intensify.” As prophecies go, this is an easy one, more on the order of “The sun will rise tomorrow morning” than, say, “The Chicago White Sox will win the 2025 World Series.” As the great leftist-turned-patriot David Horowitz correctly noted, “Inside every progressive is a totalitarian screaming to get out.” And so the most suitable response to Halperin’s prediction can only be “Well, duh.” \n\nThe Caller pointed out that “in a Thursday column for The Hill, liberal attorneys Evan Davis and David Schulte argued that Congress can still prevent Trump from taking office on Jan. 20 by rejecting electoral votes on Jan. 6, claiming Trump is disqualified under the 14th Amendment.” As our friend Matt Margolis noted, also on Thursday, Davis and Schulte don’t “cover much new ground.” Their column “references Section 3 of the 14th Amendment, which disqualifies individuals who have engaged in insurrection from holding office, despite the fact that Trump did no such thing. Heck, he hasn’t even been charged with such an offense, and when you consider the fact that rogue left-wing prosecutors have charged him with all sorts of made-up crimes, that says something.” \n\nStill, the fact that leftists are still floating this 14th Amendment nonsense indicates that they’re still trying to figure out some way to prevent Trump from walking back into the Oval Office on Jan. 20, 2025. Halperin observed: “It seems ill-timed, not just not in the spirit of the holiday season, but also given where we are in the transition cycle … we’re gonna see more of this. I think the left has been a little bit shocked by the election results. And I think as the reality of January 20th gets closer, I think you’ll see more opinionizing just like this.” \n\nHalperin maintained that in scheming to thwart the will of the people, leftists were simply acting in accord with the will of the people. Asked why The Hill ran such an article, he answered: “I try not to speculate on people’s motives if I don’t have reporting, so I don’t really know. But again, The Hill likes to get attention, so that could be part of it. But it also reflects a point of view that’s held by tens of millions of Americans … I think that you’re gonna see more manifestations like this as we get closer to inauguration day.” \n\nThe problem is that leftists have floated this insurrection business before, and gotten nowhere. As Matt pointed out, Trump hasn’t been convicted of leading or supporting an insurrection. In fact, he hasn’t even been charged with doing so, and the Democrats certainly would have done so if they had thought they could get away with it. Many people don’t believe that what happened on Jan. 6, 2021 was an insurrection at all. Thus if Trump were really barred from taking office on those grounds, it would be a case of leftists going way out on a limb on the basis of a tangle of unsupported and highly partisan assertions.\n\n Related: Only Man Ever to Head Both FBI and CIA is Against Trump’s Appointees, and That’s Good\n\nWould they dare to do that? Sure. After all, where would any possible pushback come from? The military, the Justice Department and the intelligence community have all been thoroughly corrupted and politicized. The establishment media would go into overdrive to hail the ringleaders of this scheme as heroes who saved democracy from the evil fascist.\n\nCould it happen? Sure. Is it likely? Absolutely not. It is heartening that America doesn’t appear so far gone that the left thinks it could get away with pulling off such a caper. Nevertheless, it would be wise to be wary, and watch events closely leading up to Jan. 20. These people have thrown everything they could at Trump for eight years, and he is, to their dismay, still standing. They’re not likely to give up now and sing the praises of a functional republic with a loyal opposition.","url":"https://pjmedia.com/robert-spencer/2024/12/28/be-warned-the-dems-arent-finished-hatching-schemes-to-keep-trump-from-taking-office-n4935494","image":"https://media.townhall.com/cdn/hodl/2024/291/b5ae3080-6bed-472a-8218-a02aaaf86a06.jpg","video":null,"publish_date":"2024-12-28 23:03:51","author":"Robert Spencer","authors":["Robert Spencer"],"language":"en","source_country":"us","sentiment":-0.364},{"id":276752408,"title":"Democrat Flipping Party to Republican After Election Sparks Liberal Fury","text":"Florida State Representative Hillary Cassel of Dania Beach announced her switch from the Democratic to the Republican Party on Friday.This marks the second Democratic state lawmaker to switch political parties this month, following Tampa Representative Susan Valdés' change on December 9.Newsweek contacted Cassel via email on Saturday for comment.Why It MattersThe unexpected shift has resulted in House Democrats losing four seats ahead of the 2025 session, with two losses from recent elections and two from party changes.The move particularly highlights divisions over Israel policy and questions about the Democratic Party's connection with Florida voters. The changes also expand Republican control in the Florida House, potentially affecting future legislative priorities and voting dynamics.After Valdés' political switch, which created the largest Republican advantage in chamber history, she received an influential appointment as vice chair of the budget committee on December 17 from House Speaker-designate Daniel Perez.What To KnowIn her formal statement, Cassel framed her decision around several key themes. She emphasized her roles as both a mother and a Jewish woman, expressing desire to \"build a world where our children are judged on their character and their actions not their labels.\"Cassel specifically cited growing concerns about the Democratic Party's stance on Israel, pointing to what she described as its \"failure to unequivocally support Israel and its willingness to tolerate extreme progressive voices that justify or condone acts of terrorism.\" She also highlighted frustration with the party's ability to \"relate to everyday Floridians.\"Looking ahead, she acknowledged potential disagreements with her new party while expressing optimism about collaboration: \"I know I won't always agree on every detail with every Republican, but I do know that I will always have input, collaboration, and respect.\"The lawmaker praised the House Republican Conference for empowering members to \"find common sense solutions to real issues facing all Floridians.\"Florida Democrats RespondIn a statement on their official website, the Florida Democratic party responded to Cassel's exit: \"Floridians put their trust and faith in Representative Hillary Cassel to fight for them but unfortunately today, they lost representation in the Florida House. Rep. Cassel's decision to change parties is deeply disappointing but we cannot afford to turn our backs on Floridians.\"Florida Democrats face an uphill battle but that doesn't mean we give up. There are nearly 4.5 million Democrats in our state and millions more who believe in our values. They are counting on us to continue fighting for them to create a state that is truly free and affordable for all — and that's exactly what we're going to do.\"What People Are SayingFlorida Democratic Party Chair Nikki Fried on X: \"Now is not the time to back down and walk away, it's time for leadership and self-reflection. Floridians put their trust and faith in Representative Hillary Cassel to fight for them but unfortunately today, they lost representation in the Florida House.\"More from Fried on X: \"This is not how we impact change & work towards improving the lives of our constituents. For those who choose to join a totalitarian party run by billionaires, who would rather make lives harder for seniors, vets, medically vulnerable & working class than pay their share of taxes.\"Political commentator Shea Jordan Smith on X: \"Hillary Cassel was just reelected as a Democrat to the Florida State House on November 5, 2024. If she's citing the Administration's handling of the conflict between Israel and Palestine as the cause of her switch, why didn't she run as a Republican during this election cycle?\"Democratic Florida Rep. Angie Nixon on X: \"Rep. Hillary Cassel's decision to switch parties is a betrayal of the voters who entrusted her to represent their values as a Democrat.\"President-elect Donald Trump on Truth Social: \"Congratulations to Hillary Cassel for becoming the second State Representative from the Great State of Florida to switch her Party affiliation from Democrat to Republican, once more expanding the GOP Supermajority in the State House! I would further like to invite other Disillusioned Democrats to switch Parties, and join us on this noble quest to Save our Country and, Make America Great Again - GREATER THAN EVER BEFORE. THANK YOU HILLARY!\"What's NextThe party switches will likely impact upcoming legislative sessions and could influence future party dynamics in Florida. With an enhanced Republican supermajority, the legislature may see shifts in voting patterns and policy priorities.","summary":"Florida Rep. Hillary Cassel switches to the GOP, becoming second Democratic state lawmaker to change parties this month.","url":"https://www.newsweek.com/florida-democratic-hillary-cassel-switches-gop-democrats-2007038","image":"https://d.newsweek.com/en/full/2552741/hillary-cassel.jpg","video":null,"publish_date":"2024-12-28 22:58:18","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"politics","source_country":"us","sentiment":0.166},{"id":276752284,"title":"Take That! Court Tells Biden Admin to Quit Selling Border Wall Materials","text":"Joe Biden is thankfully on his way out, but as he prepares to evacuate the Oval Office and head back to the Delaware beach, he keeps throwing out obstacles for incoming President-elect Donald Trump.\n\nIn one of the Biden administration's more craven moves, they’ve been busy selling off equipment and supplies for the border wall that Trump promised during his first term, which Joe ended when he took office.\n\nWell, take this Christmas president, Joe and Co:\n\nThe Biden administration on Friday said it would stop selling off materials slated to be used to build a border wall ahead of the incoming Trump administration, which has promised to bring back tougher efforts to combat illegal immigration.The Biden administration confirmed to a court that it will agree to a court order preventing it from disposing of any further border wall materials over the next 30 days, allowing President-elect Trump to use those materials, Texas Attorney General Ken Paxton said. \n\nTrump hailed the victory on Saturday:\n\nMeanwhile, Texas Attorney General Ken Paxton let his feelings be known on Friday:\n\nThis follows our major victory forcing Biden to build the wall, and we will hold his Administration accountable for illegally subverting our Nation’s border security until their very last day in power, especially where their actions are clearly motivated by a desire to thwart President-elect Trump’s immigration agenda.\n\n Despicable:\n\nJust Weeks Before Trump Takes Office, Biden Further Embarrasses Himself by Hawking Pieces of Border Wall\n\nDemocrats have long opposed a border wall and have done everything in their power to thwart it:\n\nThe Biden administration has been auctioning off border wall parts since at least 2023, with parts listed for sale on auction marketplaces, after it abruptly shut down most border wall construction in 2021....The Biden administration abruptly ended border wall construction in January 2021 after 450 miles had been built in the first Trump administration. While border hawks say a wall is a critical tool to stopping illegal immigration, some Democrats have said a wall project is xenophobic and ineffective.\n\nThat last sentence in the above quote—“some Democrats have said a wall project is xenophobic and ineffective”—perfectly illustrates how clueless and out-of-touch with the American people so many progressives have become. How can they talk about “ineffective” when the Biden administration has let tens of millions of illegal aliens into the country under their watch?\n\nThe corrupt Biden regime already has so many stains on its tattered legacy, and selling off legally purchased materials intended to secure our border and protect the American people is just another in a long line of destructive decisions that prove they seemingly want to tear down the United States instead of making it even better. This figurative slap in the face, along with the November election when the people let it be known loud and clear that they are tired of this nonsense, should be further humiliation to the doddering lame-duck commander-in-chief. Unfortunately, he seems incapable of such self-introspection.\n\nIn any case, sayonara—and the new team will go right back to building the wall, thank you very much. Don't let the door hit you on the way out.","url":"https://redstate.com/bobhoge/2024/12/28/take-that-court-tells-biden-admin-to-quit-selling-border-wall-materials-n2183699","image":"https://media.townhall.com/cdn/hodl/2023/131/a566ade6-0dc6-414a-a8f9-674e59c96d7a.jpg","video":null,"publish_date":"2024-12-28 22:57:50","author":"Bob Hoge","authors":["Bob Hoge"],"language":"en","category":"politics","source_country":"us","sentiment":-0.284},{"id":276752406,"title":"Ex-CDC Director Says 'Possible' US Created Viruses in China","text":"Robert Redfield, former director of the U.S. Centers for Disease Control and Prevention (CDC), said during a Saturday appearance on Fox & Friends Weekend that \"it's possible\" the United States' intelligence apparatus was involved in creating viruses in China in reference to a recent report on the government's investigation into the origins of COVID-19.Newsweek has reached out to the CDC's press team and the White House for comment via email on Saturday.Why It Matters A recent Wall Street Journal investigation reported that three scientists affiliated with the Pentagon conducted a scientific study finding that \"Covid-19 was manipulated in a laboratory in a risky research effort,\" but that information was not incorporated in a report to President Joe Biden, as it was \"at odds with the assessment of their parent agency, the Defense Intelligence Agency.\"The Wednesday report also said that early on the Federal Bureau of Investigation (FBI) was the \"only agency that concluded a lab leak was likely,\" but the agency was not present at the presidential briefing.The report has resurrected theories that the coronavirus was leaked from a lab in Wuhan, China, and that the U.S. may have been involved or had prior knowledge of it, potentially covering it up. The origins of the deadly virus are still contested and politically divisive.What To KnowFive years ago, the first cases of the virus were identified in Wuhan. Since then, more than 1.2 million Americans died from COVID-19, according to the CDC, with millions more globally. It is estimated that thousands of people are experiencing \"long-COVID,\" with symptoms affecting the neurological, respiratory, cardiovascular, and psychological systems, among others, persisting for months after the initial infection.The government's handling of the virus, including vaccinations, mask mandates, and its origin, has sparked controversy among many Americans, and forged deep political divides.On Saturday, Fox & Friends Weekend co-host Will Cain spoke with Redfield about the origins of the virus in light of the Journal's report. Redfield served as CDC director during President-elect Donald Trump's first term, from 2018 to 2021, overseeing the agency during the initial phase of the pandemic.Referring to the Journal's report, Cain asked Redfield why he believes intelligence that the virus likely started in a lab was prevented from reaching the president.Redfield replied, \"There clearly was a proactive decision by individuals to really only present one scenario for the origin of COVID—which is the natural spillover. I will say, there really is no evidence of spillover whatsoever.\"He added: \"Clearly the intelligence agency has been duplicitous in this cover up of the true origins of COVID.\"Later in the segment, Redfield said, \"It's most likely that our intelligence agency had assets that were deployed inside that [Wuhan] laboratory and in fact as a consequence didn't want too much scrutiny into the laboratory.\"Cain then asked Redfield: \"Is it possible—should we consider the fact that the intelligence apparatus was also helping to create these types of viruses, where it's illegal in the United States, but actually helping to facilitate it for their own use, but using it on some foreign land in China to do it?\"Redfield replied \"Yeah, I think it's possible, Will. I think it really is.\"The former CDC director has previously been skeptical of the virus' origin. In November, he said on the Third Opinion podcast that there's a \"real possibility\" it was developed as a \"biodefense program\" in a lab at the University of North Carolina at Chapel Hill. He noted that he does not have any definitive proof to support this claim.What People Are Saying Representative Brad Wenstrup, an Ohio Republican who chairs the Select Subcommittee on the Coronavirus Pandemic, wrote opening page of the report: \"The possibility that COVID-19 emerged because of a laboratory or research related accident is not a conspiracy theory.\"Mario Nawfal, internet personality with over 1.8 million followers, wrote in an X post on Friday, \"Defense and FBI scientists uncovered damning evidence pointing to a Wuhan lab leak—but spy chiefs allegedly blocked them from briefing Biden. Instead, the 2021 report claimed a natural origin. Key findings were ignored, including Chinese military ties to early vaccine patents and lab techniques that leave no trace... Who's still covering for what?\"What Happens NextTrump will take office in less than three weeks with a new administration. The Central Intelligence Agency (CIA), which Redfield implied on Saturday may have knowledge about viruses in the lab and sought to \"protect its assets\" in the field, is likely to be led by John Ratcliffe.\"I think the truth will come out, I'm very excited about John Ratcliffe being the new CIA director,\" Redfield said, adding that \"he will get all of these agencies back in the room and to look at the data.\"","summary":"Robert Redfield, who led the CDC during Trump's first term, said \"it's possible\" that U.S. intelligence agencies were helping create viruses in a Wuhan lab.","url":"https://www.newsweek.com/robert-redfield-possible-us-created-viruses-china-covid-2007051","image":"https://d.newsweek.com/en/full/2552744/robert-redfield.jpg","video":null,"publish_date":"2024-12-28 22:57:02","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"us","sentiment":-0.335},{"id":276751382,"title":"Team Trump in ‘civil war’ as Musk falls out with hardline Republican base","text":"Lawyers for US President-elect Donald Trump have asked the Supreme Court to delay an upcoming ban of TikTok in the United States until he takes office.\n\nAnd that’s not the only tech battle in town. A civil war is underway within Team Trump … with billionaire Elon Musk falling out spectacularly with the hardline Republican MAGA base.","summary":"Lawyers for US President-elect Donald Trump have asked the Supreme Court to delay an upcoming ban of TikTok in the United States until he takes office.","url":"https://www.channel4.com/news/team-trump-in-civil-war-as-musk-falls-out-with-hardline-republican-base","image":"https://fournews-assets-prod-s3-ew1-nmprod.s3.amazonaws.com/media/2024/12/TECH-JENKINS--1920x1080.png","video":null,"publish_date":"2024-12-28 22:52:50","author":"Ciaran Jenkins","authors":["Ciaran Jenkins"],"language":"en","category":"politics","source_country":"GB","sentiment":0.063},{"id":276755378,"title":"Chess Champion Quits Tournament Over Outfit Dispute","text":"‘MIND-BOGGLING’\n\nTina Knowles took to her Instagram to shut down her daughter’s critics. \n\nFAMOUS LINE\n\nMusk’s response to one social media user appeared to be heavily borrowed from “Tropic Thunder.”\n\nSALE ON SALE\n\nScore even more savings this week at J.Crew’s online outlet during its massive post-holiday sale.\n\nThe Oscar nominee’s cause of death was not given.\n\nFASHION FAUX PAS\n\nMagnus Carlsen, a five-time champion, was fined and asked to change before quitting.\n\nThe Carol Bike uses AI personalization technology to give you maximum results in the shortest time possible. \n\nNEED SOME SPACE\n\nThe 36-year-old submitted the request in Los Angeles, alleging her mom and cousin have harassed her.\n\nREST IN POWER\n\n“It is with profound sorrow that we announce the passing of beloved son, brother, friend and boxing champion Paul Bamba,” the boxer’s family posted in a statement.\n\nHussey won a Golden Globe for Most Promising Newcomer after starring in the Shakespeare film adaptation.\n\nSWITCHING TEAMS\n\nHillary Cassel is the second Florida state representative to jump ship this month.\n\nESPRESSO YOURSELF\n\nThis bold Cold Brew Coffee Liqueur is a bar cart essential.\n\nTHE GREAT ‘GUMBY’\n\nGumbel’s family confirmed the news of his death in a statement.\n\nMONEY TALKS\n\nDonald Trump claimed on Truth Social that the former Microsoft boss asked if he could visit the Florida pad.","summary":"Dean Mouhtaropoulos / Dean Mouhtaropoulos/GettyA Norwegian chess champion left mid-tournament after refusing to change his outfit for judges. Magnus Carlsen, a five-time World Chess Champion, was competing in New York’s Fide World Rapid and Blitz Chess Championships on Friday when he was asked to change. According to The Telegraph, Carlsen was first fined $200 for the wardrobe rule break before being told he would have to leave if he didn’t change. “I said, ‘I’ll change tomorrow if that’s OK.’ I didn’t even realize it today, but they said, ‘Well you have to change now.’ At that point it became a bit of a matter of principle for me,” Carlsen told chess outlet Take Take Take in an interview. “Honestly, I am too old at this point to care too much. If this is what they want to do,” he added. As for why he wore the jeans in the first place, Carlsen said he had little time to change before the tournament as he was coming from a meeting. The grandmaster made light of the debacle on X where he tweeted a photo of the ","url":"https://www.thedailybeast.com/chess-champion-quits-tournament-over-outfit-dispute/","image":"https://www.thedailybeast.com/resizer/v2/DJH37HBELNDMZPPMTZKI3ZJP7I.jpg?smart=true&auth=0df873a355a26106ad205771c2fe0d8340fa27a04aaaa50512c6ce8fdd3d6d4b&width=1440&height=1080","video":null,"publish_date":"2024-12-28 22:52:22","author":"Clay Walker","authors":["Clay Walker"],"language":"en","source_country":"us","sentiment":-0.179},{"id":276751700,"title":"Without the US, NATO allies in Europe largely lack a key capability needed to fight Russia","text":"If President-elect Donald Trump cuts US military cooperation with Europe, its NATO allies there would lose a key capability needed to resist Russian aggression.Europe relies heavily on the US for the use of aircraft and weaponry to target air defense systems, known as suppression of enemy air defenses, or SEAD.If a military can't execute this critical mission, its aircraft are hindered and vulnerable, unable to strike or protect, leaving its ground forces much more exposed and less effective.\"One of the most crucial things that Europe is lacking is SEAD,\" Tim Robinson, a military aviation specialist at the UK's Royal Aeronautical Society, told BI. He described SEAD as \"a crucial role,\" but one Europe has let \"wither the vine.\"There are few dedicated SEAD platforms on the continent. Germany and Italy's Tornado aircraft carry the AGM-88 HARM munition for targeting radars and are equipped with the needed Emitter Location System, but those are set to be retired next year.Other NATO partners operate F-16s, which can have a SEAD role, but only US Air Force Fighting Falcons are equipped with the HARM Targeting System for better SEAD.US allies in Europe are increasingly looking to replace older aircraft with F-35s, but only a few are also acquiring AGM-88 missiles.(These missiles are highly capable for SEAD missions and were delivered to the Ukrainian air force for this purpose, but less so for the destruction of enemy air defenses, or DEAD, missions.)\"The F-35 was designed specifically to be able to operate against modern SAM systems in both the penetrating strike and SEAD/DEAD roles,\" Justin Bronk, an air power expert at the Royal United Services Institute, wrote early last year.He highlighted the fifth-generation jet's advanced stealth, electronic warfare, and active and passive sensor suite for detecting enemy surface-to-air missile systems.\"Despite these very impressive capabilities, simply fielding the F-35 is not sufficient as an answer to European NATO's SEAD/ DEAD problem in itself,\" he said.This situation has left Europe heavily dependent on the US, less than ideal amid questions about US reliability and as Russia's war in Ukraine has shown how important defeating enemy air-defense batteries is in modern conflict.In Ukraine, neither side has been able to conduct successful SEAD operations, leaving both air forces hugely hampered and forcing ground units into grinding battles with heavy casualties.Mattias Eken, a missile defense expert at the RAND Corporation, said an important lesson from the Ukraine war has been that \"air forces must be able to find, suppress, and destroy\" mobile surface-to-air missiles to achieve air superiority \"against even moderately equipped state opponents.\"Eken added that no other Western air force except the US has significant SEAD capabilities. All other NATO forces \"have limited penetrating assets, munitions stocks, and experience in operating large, mixed strike packages.\"Retired US Army Maj. Gen. Gordon \"Skip\" Davis, who served as NATO's deputy assistant secretary-general for its defense-investment division, said \"the vast majority of the SEAD aircraft, in the event of aggression, would be provided by the US.\"Davis told BI that the US has the stealth aircraft, including penetrating bombers, needed to locate and destroy Russian air defenses, and US aircraft have intelligence capabilities \"that NATO would have great difficulty in replacing.\"He warned that without better SEAD capabilities or US support, NATO \"would be hard-pressed to be effective in a large Russian aggression.\"Warfare experts at the US Center for Strategic and International Studies wrote in April 2023 that \"NATO is now wholly dependent on the United States for SEAD capabilities.\"A key example was the large-scale NATO air campaign over Libya in 2011, where the US provided almost all of the alliance's SEAD capabilities despite having planned to only play a supporting role in that situation.Looking ahead, Europe may not be able to count on the US. Trump has been a strong critic of NATO and, in his first term, threatened to withdraw from the military alliance if other nations didn't spend more on their defense.European countries have dramatically increased their defense spending since Russia's invasion of Ukraine began, and some now spend more on defense than the US as a percentage of GDP. (Warfare experts say that's a response to Russian aggression, not Trump's pressure.)But Europe is acutely aware of Trump's threats, and military experts warn that the continent's increased expenditure is not enough to support Ukraine and prepare for Russia's threats alone. It still needs the US.Russia has repeatedly threatened to attack elsewhere in Europe, and many countries have warned that it could happen in the next few years, especially if Moscow emerges victorious in Ukraine.It's unclear if the US would or even could withdraw its support, especially for allies who already spend a lot on defense. US forces are now so integrated in Europe that, if something happens soon, \"they're automatically involved\" unless the US makes a major policy shift to return forces to the US, Gordon said.Europe is nevertheless taking actions to address its deficiencies, like a pan-European defense company now developing a new SPEAR-EW missile.\"I think the penny has dropped,\" said Robinson, but he added that not enough was happening. \"It's taking time, I think, for European capitals and maybe multinational organizations to get the momentum going.\"Michael Bohnert, a warfare expert at the RAND Corporation, said that it could take years to reconstitute a supply chain for necessary missiles. That means \"there really aren't any good options\" to cover a deficit in the short term if the US pulls back, he told BI.Robinson said Europe has an advanced industrial base, but \"the difficulty is it's all fragmented.\"Some cooperation has taken place, including four European nations agreeing to operate their jets as a single fleet.Jan Kallberg, a senior fellow at the Center for European Policy Analysis and a fellow at the Army Cyber Institute at West Point, said \"acquisition, cooperation, and collaboration are essential.\"He said countries should buy assets together and \"operate jointly as a multinational force,\" especially given how large Europe is and how much land may need to be defended.Fixing Europe's SEAD deficits will take time, during which it will be more vulnerable to attacks. But Russia has demonstrated an inability to effectively use its own assets — a flaw that could ultimately aid Europe.\"Europe will lack enough SEAD capabilities for the next 10 to 15 years,\" said Kallberg, but \"the Russian air force and air defenses can't get their intelligence, command, and control to act together, and lack resources for broad modernization.\"\"If there is a war,\" he said, \"it is not Europe's abilities that save the day. It is the Russian inability.\"","summary":"Europe and NATO rely on the US for SEAD capabilities, something that Russia's invasion of Ukraine has shown is critical in a modern conflict.","url":"https://www.businessinsider.com/europe-missing-key-capability-needs-fight-russia-without-us-trump-2024-12","image":"https://i.insider.com/6762fbf60a6d56a4f9c1dab7?width=1200&format=jpeg","video":null,"publish_date":"2024-12-28 22:48:02","author":"Sinéad Baker","authors":["Sinéad Baker"],"language":"en","category":"politics","source_country":"us","sentiment":0.369},{"id":276761856,"title":"Newly released pictures show Joe Biden meeting Hunter Biden's Chinese business partners","text":"Newly released pictures show then-Vice President Joe Biden meeting some of his son Hunter Biden's Chinese business partners during an official visit to the country, as well as Hunter meeting Chinese President Xi Jinping and other senior officials.\n\nThis is the first time these images have been made public, even though the photo ops and meetings they depict have been known about for years.\n\nThe National Archives and Records Administration released the images after a public records request from a pro-Trump right-wing legal group.\n\nREAD MORE: Man charged with murder after body found in driveway in Sydney's west\n\nThe photographs are from Joe Biden's visit to China in 2013.\n\nIn one set of images, Hunter Biden is seen, along with his father, meeting and chatting with Xi. In another set of images, Joe Biden introduces his son to Li Yuanchao, who was China's vice president at the time.\n\nAnother group of pictures shows Hunter Biden introducing his father to his Chinese business partners, some of whom were executives at the private equity firm BHR Partners.\n\nREAD MORE: Police seek to identify two men after shooting murder of Queensland woman\n\nAfter handshakes and hugs, the Bidens posed for a group picture with a few of the Chinese businessmen.\n\nThese images are notable because they further undercut Joe Biden's already-diminished unequivocal assertions that he never had any business-related contact with his son. \n\nIn fact, the House Republicans' impeachment inquiry into Joe Biden uncovered at least two dozen interactions between him and his son's business partners from China and other countries.\n\nHowever, Hunter Biden and others involved have testified that — despite occasional phone calls, meet-and-greets and dinners with Joe Biden — business was never substantively discussed. \n\nHunter Biden's former main US business partner later testified that Hunter was selling the \"illusion\" of access to his father, but \"nothing of material was discussed\" during these interactions.\n\nREAD MORE: WA Police officer hospitalised after alleged assault by teens\n\nHunter Biden's attorney Abbe Lowell criticised the Trump-aligned groups that fought to obtain and release the images, saying in a statement, \"There is simply nothing new here.\"\n\n\"The photos match perfectly to Hunter's congressional testimony description of who he saw at this public event during a 2013 trip to China,\" Lowell said, referring to Hunter Biden's closed-door deposition in February, during which he was grilled by Republicans for six hours.\n\n\"These attacks trying to twist these images into something they are not is just more of the same old tired, misinformation spin from some Republicans who can't let go of their ridiculous conspiracy theories and baseless accusations,\" Lowell said in the statement.\n\nAmerica First Legal, a pro-Trump group, filed the records request in 2022 and later sued the National Archives to obtain the records. \n\nThe group is led by Stephen Miller, who served in President-elect Donald Trump's first White House and is set to return next year as deputy chief of staff for policy.\n\n\"These photos corroborate the House Oversight Committee's investigative findings that Hunter Biden arranged for his father to meet with Jonathan Li and other BHR executives during the 2013 China trip, where 'Mr Li sought — and received — access to Vice President Biden's political power,'\" America First Legal said in a news release last week.\n\nCNN has reached out to the White House for comment about the newly released pictures.\n\nHunter Biden's foreign business deals drew intense scrutiny from Hill Republicans and Justice Department investigators. \n\nFederal prosecutors charged him with tax crimes partly stemming from unpaid taxes from his overseas deals. \n\nHe was never accused of corruption or illegal lobbying, despite GOP claims that he engaged in criminal influence-peddling.\n\nIn a controversial post-election move, Joe Biden pardoned his son for the 12 tax and gun crimes he was convicted of earlier this year. \n\nThe sweeping pardon also shielded Hunter Biden from future prosecution for any potential federal crimes he may have committed between January 1, 2014, and December 1, 2024.\n\nDOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.","summary":"This is the first time these images have been made public.","url":"https://www.9news.com.au/world/newly-released-pictures-show-joe-biden-meeting-hunter-bidens-chinese-business-partners/e808ca1f-c802-4322-9094-f46eb0e3adf7","image":"https://imageresizer.static9.net.au/SLoOayVvPYSym6ZGDKF9DY3ZmBo=/0x83:1600x983/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F1e75743b-d47b-47a6-9dfc-a51b9ad693d7","video":null,"publish_date":"2024-12-28 22:46:53","author":"9News","authors":["9News"],"language":"en","source_country":"AU","sentiment":-0.003},{"id":276755374,"title":"Trump Hints at His Next Legal Target in Truth Social Post","text":"Skip to Main Content\n\nNewsletters\n\nCSCHEAT SHEET\nNEWSLETTERS\n\nCheat Sheet\n\nManage Newsletters\nSubscription Offers\n\nTrump Hints at His Next Legal Target in Truth Social Post\n\nOn the heels of his big win over ABC, the president-elect has signaled that more legal challenges could be on the way.\n\nAmethyst Martinez \nBreaking News Intern\nPublished Dec. 28 2024 5:44PM EST \n\nPhoto Illustration by Victoria Sunday/The Daily Beast/Getty Images \n\nAmethyst Martinez\nBreaking News Intern\n\nGot a tip? Send it to The Daily Beast here.\nTrending Now\n\nMediaElon Musk Turns MAGA Civil War Nuclear: F**k Yourself in the Face\n\nKatie Francis\n\nPoliticsMAGA Crisis Could Mean No Trump Inauguration on Jan. 20\n\nJanna Brancolini\n\nPoliticsBattle-Scarred Johnson Issued Ultimatum: ‘Start Taking Extraordinary Measures’\n\nWilliam Vaillancourt\n\nMediaBill Maher Confronts Jay Leno With Gambling Debt Rumors\n\nMatt Wilstein\n\nMediaSex, Lies and Jesus: Inside Fox News’ Latest Love Story\n\nLeigh Kimmins\n\nTrending Now\n\nMediaElon Musk Turns MAGA Civil War Nuclear: F**k Yourself in the Face\n\nKatie Francis\n\nPoliticsMAGA Crisis Could Mean No Trump Inauguration on Jan. 20\n\nJanna Brancolini\n\nPoliticsBattle-Scarred Johnson Issued Ultimatum: ‘Start Taking Extraordinary Measures’\n\nWilliam Vaillancourt\n\nMediaBill Maher Confronts Jay Leno With Gambling Debt Rumors\n\nMatt Wilstein\n\nMediaSex, Lies and Jesus: Inside Fox News’ Latest Love Story\n\nLeigh Kimmins\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nBACK TO TOP ↑\n\nCheat Sheet\n\nSUBSCRIPTIONCROSSWORDNEWSLETTERSPODCASTS\n\nGET THE APP\n\nCode of Ethics & Standards\n\nTerms & conditions\nCopyright & Trademark\n\nCookie Settings\n© 2024 The Daily Beast Company LLC","summary":"Photo Illustration by Victoria Sunday/The Daily Beast/Getty ImagesPresident-elect Donald Trump has again hinted that he is far from being done waging legal battles after his big win over ABC and star anchor George Stephanopoulos.\n\nOn his Truth Social platform, Trump reposted a photo of E. Jean Carroll with large letters that read: “Should a woman go to jail for falsely accusing a man of rape? Retruth if you want justice for Trump.”\n\nThe comments come amid a slew of posts and reposts from the incoming president in which he has suggested that he will undertake efforts to jail and/or take legal action against presumed enemies, including former Wyoming representative Liz Cheney, President Joe Biden and even poll workers.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/president-elect-donald-trump-hints-e-jean-carroll-could-be-next-legal-target-in-truth-social-post/","image":"https://www.thedailybeast.com/resizer/v2/ORYT73O6OFHHBKZPVSSQB4WI5U.jpg?smart=true&auth=ed36c81b5208da7d5582cd3aceb6f1b8c6f4070b4b1ff937891d793bf659ff3f&width=1440&height=1080","video":null,"publish_date":"2024-12-28 22:44:03","author":"Amethyst Martinez","authors":["Amethyst Martinez"],"language":"en","category":"politics","source_country":"us","sentiment":0.273},{"id":276750366,"title":"Trump Steps Into Skilled-Work Visa Clash, Saying They’re ‘Great’","text":"President-elect Donald Trump entered the fray in a debate over immigration policy that’s dividing his supporters, telling the New York Post he favors a visa program for highly skilled workers that Elon Musk has strongly defended. Musk is among tech leaders stoking a social-media storm this week over how to bring top talent to the US — revealing friction between Trump’s Silicon Valley supporters and anti-immigration sentiment that helps fuel his base. “I’ve always been in favor of the visas,” Trump told the Post in a phone interview. “I’ve been a believer in H-1B. I have used it many times.” Many employees at Trump properties have H-1B visas, which allow companies to hire foreign workers in specialty occupations. “It’s a great program,” Trump told the outlet. Trump’s stance may indicate an emerging alignment with Musk, whose backing for the former and future president made him the largest single donor in the US election. “There is a permanent shortage of excellent engineering talent. It is the fundamental limiting factor in Silicon Valley,” Musk, who used an H-1B visa to work in the US, wrote previously on X. Vivek Ramaswamy, whom Trump has tapped along with Musk to run a government efficiency initiative, also weighed in. He drew particular attention for a post arguing that “American culture has venerated mediocrity over excellence.” Trump during his first term restricted several visa types including H-1B, citing the need to protect American workers as the Covid-19 pandemic led to job losses in the US. President Joe Biden let the measures expire. Trump’s comments on Saturday hint at his malleability on policy specifics and penchant for letting supporters battle over issues before stepping in. The dispute began after Laura Loomer, a far-right activist with longstanding ties to the president-elect, criticized his decision to name Indian-born investor Sriram Krishnan as a senior policy adviser on artificial intelligence. Loomer assailed previous comments by Krishnan advocating for increased access to green cards and skilled worker visas, calling it antithetical to Trump’s “America First” stance. That prompted pushback from Musk and Vivek Ramaswamy, who argued that US companies needed to recruit top talent from across the world to remain competitive. The clash may frame how the incoming administration approaches immigration, which has long bedeviled US policymakers, including Trump’s first administration. Trump himself offered a more open approach to visas when prompted during a podcast interview with venture capitalists David Sacks, Chamath Palihapitiya and Jason Calacanis and entrepreneur David Friedberg. “You graduate from a college, I think you should get automatically as part of your diploma a green card to be able to stay in this country and that includes junior colleges too,” Trump said. This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/politics/trump-steps-into-skilled-work-visa-clash-saying-they-re-great-11735424647764.html","image":"https://images.livemint.com/img/2018/12/28/1600x900/Politics_1545994646567.jpg","video":null,"publish_date":"2024-12-28 22:42:50","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":0.354},{"id":276755376,"title":"Beyoncé‘s Mom Hits Back at Halftime Show Haters","text":"‘MIND-BOGGLING’\n\nTina Knowles took to her Instagram to shut down her daughter’s critics. \n\nFAMOUS LINE\n\nMusk’s response to one social media user appeared to be heavily borrowed from “Tropic Thunder.”\n\nSALE ON SALE\n\nScore even more savings this week at J.Crew’s online outlet during its massive post-holiday sale.\n\nThe Oscar nominee’s cause of death was not given.\n\nFASHION FAUX PAS\n\nMagnus Carlsen, a five-time champion, was fined and asked to change before quitting.\n\nThe Carol Bike uses AI personalization technology to give you maximum results in the shortest time possible. \n\nNEED SOME SPACE\n\nThe 36-year-old submitted the request in Los Angeles, alleging her mom and cousin have harassed her.\n\nREST IN POWER\n\n“It is with profound sorrow that we announce the passing of beloved son, brother, friend and boxing champion Paul Bamba,” the boxer’s family posted in a statement.\n\nHussey won a Golden Globe for Most Promising Newcomer after starring in the Shakespeare film adaptation.\n\nSWITCHING TEAMS\n\nHillary Cassel is the second Florida state representative to jump ship this month.\n\nESPRESSO YOURSELF\n\nThis bold Cold Brew Coffee Liqueur is a bar cart essential.\n\nTHE GREAT ‘GUMBY’\n\nGumbel’s family confirmed the news of his death in a statement.\n\nMONEY TALKS\n\nDonald Trump claimed on Truth Social that the former Microsoft boss asked if he could visit the Florida pad.","summary":"Gilbert Flores / Gilbert Flores/GettyTina Knowles is coming to her daughter Beyoncé’s defense after online trolls criticized her NFL halftime show performance on Christmas Day. Knowles clapped back at critics by reposting a message about her famous daughter on her Instagram Friday. In the screenshot, user @iamkrisiman praised Beyoncé and wrote that “no matter how undeniably talented you are, people will always, ALWAYS, always have some negative ish to say.” Knowles cosigned the post in a lengthy caption. “It is mind-boggling to me that you would take your precious Christmas day and watch a performance of someone you hate and you don’t think has talent so that you can go talk ish about it later,” she wrote. “Obviously you are so obsessed with them, addicted to them, and secretly admire them,” she added. According to the New York Post, Knowles’ post came after some social media users called Beyoncé “overrated.” Fans and celebrities in the comments of Knowles’ response seemed to love her mama bear energy. “Perio","url":"https://www.thedailybeast.com/beyonces-mom-claps-back-at-halftime-show-haters/","image":"https://www.thedailybeast.com/resizer/v2/2QASRRD6FFDXNCLE4RIMWGCQVU.jpg?smart=true&auth=09f937518602160be0982ec7faa053db13604a9183a5a5a67be544267da91940&width=1440&height=1080","video":null,"publish_date":"2024-12-28 22:38:38","author":"Clay Walker","authors":["Clay Walker"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.179},{"id":276749742,"title":"Must Watch","text":"Dunya News Video\n\nLifestyle-&-Entertainment\n\nDunya-Headlines\n\nDunya News - English\n\nDunya News - Urdu\n\nDunya News Live\n\nDunya Meher Bokhari Kay Sath\n\nHasb-e-Haal\n\nOn The Front\n\nTonight With Samar Abbas\n\nNuqta E Nazar\n\nBaat Niklay Gi\n\nPeyam-E-Subh\n\nIlm-O-Hikmat\n\nDunya TV Special\n\nPersonality\n\nSheikh Rasheed\n\nSiraj ul Haq\n\nJaved Hashmi\n\nNawaz Sharif\n\nTahir-ul-Qadri\n\nIjaz Chaudhry\n\nShahbaz Sharif\n\nHamza Shahbaz\n\nChief Justice\n\nShah Mehmood Qureshi\n\nZaka Ashraf\n\nHafiz Saeed\n\nDr. Abdul Hafeez Shaikh\n\nHina Rabbani Khar\n\nPervaiz Elahi\n\nPervez Khattak\n\nHaji Muhammad Adeel\n\nMushahid Hussain Syed\n\nRaza Rabbani\n\nAhsan Iqbal\n\nAitzaz Ahsan\n\nKhursheed Shah\n\nAltaf Hussain\n\nFazal-ur-Rehman\n\nChaudhry Mohammad Sarwar\n\nAyesha Ghaus\n\nMuzaffar Said\n\nKhawaja Asif\n\nAyyaz Sadiq\n\nRaheel Shareef\n\nPervez Rashid\n\nManzoor Wattoo\n\nJehangir Khan Tareen\n\nMamnoon Hussain\n\nAnwar Zaheer Jamali\n\nAshraf Ghani\n\nSushma Swaraj\n\nHassan Rouhani\n\nChaudhry Nisar\n\nMustafa Kamal\n\nBilawal Zardari\n\nSaad Rafique\n\nDaniyal Aziz\n\nPML-N workers\n\nSyed Murad Ali Shah\n\nQaim Ali Shah\n\nMurad Ali Shah\n\nSardar Sanaullah Khan Zehri\n\nRana Sanaullah Khan\n\nWaseem Akhtar\n\nFarooq Sattar\n\nTallal Chaudry\n\nPPP Workers\n\nMQM London Workers\n\nDonald Trump\n\nTayyip Erdogan\n\nSartaj Aziz\n\nACM Sohail Aman\n\nTariq Jameel\n\nGen Qamar Bajwa\n\nAsif Ali Zardari\n\nMaryam Nawaz\n\nPCB Chairman\n\nCombine press conference\n\nImam of Kaaba\n\nYounis Khan\n\nMarriyum Aurangzeb\n\nDG ISPR Asif Ghafoor\n\nAbid Sher Ali\n\nHussain Nawaz\n\nAsif Kirmani\n\nSohail Aman\n\nMaula Bakhsh Chandio\n\nFawad Chaudhry\n\nFarooq Haider\n\nShahid Khaqan Abbasi\n\nShireen Mazari\n\nSarfraz Ahmed\n\nFaisal Subzwari\n\nCJP Saqib Nisar\n\nAbdul Quddus Bizenjo\n\nMiftah Ismail\n\nZaeem Qadri\n\nNaeem ul Haq\n\nSherry Rehman\n\nQamar Zaman Kaira\n\nFayaz-ul-Hasan Chohan\n\nQamar Javed Bajwa\n\nKhusro Bakhtiar\n\nShafqat Mahmood\n\nShehryar Khan Afridi\n\nMushahid Ullah Khan\n\nHashim Jawan Bakht\n\nFarogh Naseem\n\nUsman Buzdar\n\nNavjot Singh Sidhu\n\nHarsimrat Kaur Badal\n\nTariq Jameel\n\nRaja Basharat\n\nMurad Saeed\n\nMahathir Mohamad\n\nKhurram Sher Zaman\n\nInzamam-ul-Haq\n\nFirdous Ashiq Awan\n\nJaved Iqbal\n\nFaisal Vawda\n\nHafeez Sheikh\n\nMufti Muneeb ur Rehman\n\nSania Nishtar\n\nShaukat Ali Yousafzai\n\nShahzad Akbar\n\nAsif Saeed Khan Khosa\n\nFahmida Mirza\n\nFayyaz ul Hassan Chohan\n\nHammad Azhar\n\nOmar Ayub Khan\n\nShahbaz Gill\n\nFarogh Naseem\n\nMuhammad Zubair\n\nCJP Asif Saeed Khan Khosa\n\nMian Aslam Iqbal\n\nFaisal Javed Khan\n\nRaja Zafar ul Haq\n\nAsad Mehmood\n\nMohammad Faisal\n\nAli Muhammad Khan\n\nSherry Rehman\n\nMisbah ul Haq\n\nMasood Khan\n\nRaja Farooq Haider\n\nShahid Afridi\n\nSaeed Ghani\n\nZulfi Bukhari\n\nAbdul Ghafoor Haideri\n\nZubair Mahmood Hayat\n\nJam Kamal Khan\n\nMahmood Khan\n\nMurtaza Wahab\n\nDr Yasmin Rashid\n\nNoor-ul-Haq Qadri\n\nYasmin Rashid\n\nAnwar Mansoor Khan\n\nFarrukh Habib\n\nZulfiqar Hameed\n\nImran Ismail\n\nMohammad Hafeez\n\nShoaib Malik\n\nAisha Farooqui\n\nMustafa Nawaz Khokhar\n\nAbdul Razak Dawood\n\nAntonio Guterres\n\nMuhammad Basharat Raja\n\nMujahid Anwar Khan\n\nDG ISPR Major General Babar Iftikhar\n\nMike Pompeo\n\nZafar Mirza\n\nMusadik Malik\n\nShehzad Roy\n\nKhalid Maqbool Siddiqui\n\nAjmal Wazir Khan\n\nJam Kamal Khan\n\nMoeed Yousaf\n\nChairman NDMA Lieutenant General Muhammad Afzal\n\nLiaquat Shahwani\n\nShibli Faraz\n\nTaimoor Jhagra\n\nFirdous Shamim Naqvi\n\nGhulam Sarwar Khan\n\nNaveed Qamar\n\nAli Amin Gandapur\n\nRamesh Kumar\n\nCJP Gulzar Ahmed\n\nAzma Bukhari\n\nKamran Bangash\n\nAbdul Qadir Baloch\n\nSanaullah Zehri\n\nAsifa Bhutto\n\nSaleem Mandviwalla\n\nYousaf Raza Gellani\n\nRaja Pervaiz Ashraf\n\nAkbar S Babar\n\nAsad Qaiser\n\nShaukat Tarin\n\nAzam Khan Swati\n\nMohsin Khan Leghari\n\nHaleem Adil Sheikh\n\nFarah Azeem\n\nNoor Alam Khan\n\nMr. Salahuddin\n\nShazia Marri\n\nRaja Riaz Ahmad Khan\n\nDr Shahzad Waseem\n\nAbdul Qadir Patel\n\nAhsan Iqbal\n\nAzhar Sadiq Advocate\n\nSardar Tanveer\n\nMuhammad Moeen Wattoo\n\nJaved Latif\n\nHaji Ghulam Ali\n\nIG Punjab Usman Anwar\n\nSharjeel Memon\n\nHafiz Naeem ur Rehman\n\nFaisal Karim Kundi\n\nAttaullah Tarar\n\nAyesha Gulalai\n\nIrfan Qadir\n\nAhmed Sharif Chaudhary\n\nAnwar ul Haq Kakar\n\nMohsin Naqvi\n\nGohar Ali Khan\n\nBilawal urges PML N to develop consensus before taking key decisions\n\nADVERTISEMENT\n\nMore to Watch\n\nADVERTISEMENT\n\nLatest Shows\n\nTonight With Samar Abbas\n\nHasb-e-Haal\n\nPeyam-E-Subh\n\nBaat Niklay Gi\n\nADVERTISEMENT","url":"https://video.dunyanews.tv/index.php/en/mustwatch/153313/Bilawal-urges-PML-N-to-develop-consensus-before-taking-key-decisions","image":"https://img.dunyanews.tv/images/28Dec24-bilawal.jpg","video":null,"publish_date":"2024-12-28 22:33:50","author":null,"language":"en","source_country":"pk","sentiment":-0.349},{"id":276749738,"title":"Iran says 2025 'important year' for nuclear issue","text":"Iran says 2025 'important year' for nuclear issue\n\n(Reuters) - Iran, bracing for a possible re-imposition of incoming US president Donald Trump's \"maximum pressure\" policy, said on Saturday that 2025 would be an important year for its nuclear issue.\n\nTrump in 2018 reneged on a deal struck by his predecessor Barack Obama in 2015 in which Iran agreed to curb uranium enrichment, which can yield material for nuclear weapons, in return for the relaxation of US and UN economic sanctions.\n\n\"2025 will be an important year regarding Iran's nuclear issue,\" Foreign Minister Abbas Araqchi told reporters in Beijing, adding in remarks aired by Iran's state TV that he had discussed the issue in talks with his Chinese counterpart.\n\nHe did not mention Trump by name, however, or spell out how the year might be significant.\n\nIranian leaders' main concern may be that Trump could empower Israeli Prime Minister Benjamin Netanyahu to attack Iran's nuclear sites, while further tightening US sanctions on its crucial oil industry.\n\nThe Iranian rial on Saturday hit a new all-time low against the US dollar amid uncertainty about Trump's arrival in the White House on Jan 20.\n\nThe rial plunged to 820,500 to the dollar on the unofficial market, compared to 808,500 rials on Friday, according to Bonbast.com, which reports exchange rates. The bazar360.com website also said the dollar was being sold for about 820,500 rials.\n\nAlso facing an inflation rate officially put at about 35%, Iranians seeking to shelter their savings have been buying dollars, other hard currencies, gold or cryptocurrencies, and the rial has dropped about 18% in all since Trump was elected in November.","url":"https://www.dunyanews.tv/index.php/en/World/859289-iran-says-2025-important-year-for-nuclear-issue","image":"https://img.dunyanews.tv/news/2024/December/12-28-24/news_big_images/859289_85258909.jpg","video":null,"publish_date":"2024-12-28 22:33:50","author":null,"language":"en","source_country":"pk","sentiment":-0.381},{"id":276749732,"title":"Must Watch","text":"Dunya News Video\n\nLifestyle-&-Entertainment\n\nDunya-Headlines\n\nDunya News - English\n\nDunya News - Urdu\n\nDunya News Live\n\nDunya Meher Bokhari Kay Sath\n\nHasb-e-Haal\n\nOn The Front\n\nTonight With Samar Abbas\n\nNuqta E Nazar\n\nBaat Niklay Gi\n\nPeyam-E-Subh\n\nIlm-O-Hikmat\n\nDunya TV Special\n\nPersonality\n\nSheikh Rasheed\n\nSiraj ul Haq\n\nJaved Hashmi\n\nNawaz Sharif\n\nTahir-ul-Qadri\n\nIjaz Chaudhry\n\nShahbaz Sharif\n\nHamza Shahbaz\n\nChief Justice\n\nShah Mehmood Qureshi\n\nZaka Ashraf\n\nHafiz Saeed\n\nDr. Abdul Hafeez Shaikh\n\nHina Rabbani Khar\n\nPervaiz Elahi\n\nPervez Khattak\n\nHaji Muhammad Adeel\n\nMushahid Hussain Syed\n\nRaza Rabbani\n\nAhsan Iqbal\n\nAitzaz Ahsan\n\nKhursheed Shah\n\nAltaf Hussain\n\nFazal-ur-Rehman\n\nChaudhry Mohammad Sarwar\n\nAyesha Ghaus\n\nMuzaffar Said\n\nKhawaja Asif\n\nAyyaz Sadiq\n\nRaheel Shareef\n\nPervez Rashid\n\nManzoor Wattoo\n\nJehangir Khan Tareen\n\nMamnoon Hussain\n\nAnwar Zaheer Jamali\n\nAshraf Ghani\n\nSushma Swaraj\n\nHassan Rouhani\n\nChaudhry Nisar\n\nMustafa Kamal\n\nBilawal Zardari\n\nSaad Rafique\n\nDaniyal Aziz\n\nPML-N workers\n\nSyed Murad Ali Shah\n\nQaim Ali Shah\n\nMurad Ali Shah\n\nSardar Sanaullah Khan Zehri\n\nRana Sanaullah Khan\n\nWaseem Akhtar\n\nFarooq Sattar\n\nTallal Chaudry\n\nPPP Workers\n\nMQM London Workers\n\nDonald Trump\n\nTayyip Erdogan\n\nSartaj Aziz\n\nACM Sohail Aman\n\nTariq Jameel\n\nGen Qamar Bajwa\n\nAsif Ali Zardari\n\nMaryam Nawaz\n\nPCB Chairman\n\nCombine press conference\n\nImam of Kaaba\n\nYounis Khan\n\nMarriyum Aurangzeb\n\nDG ISPR Asif Ghafoor\n\nAbid Sher Ali\n\nHussain Nawaz\n\nAsif Kirmani\n\nSohail Aman\n\nMaula Bakhsh Chandio\n\nFawad Chaudhry\n\nFarooq Haider\n\nShahid Khaqan Abbasi\n\nShireen Mazari\n\nSarfraz Ahmed\n\nFaisal Subzwari\n\nCJP Saqib Nisar\n\nAbdul Quddus Bizenjo\n\nMiftah Ismail\n\nZaeem Qadri\n\nNaeem ul Haq\n\nSherry Rehman\n\nQamar Zaman Kaira\n\nFayaz-ul-Hasan Chohan\n\nQamar Javed Bajwa\n\nKhusro Bakhtiar\n\nShafqat Mahmood\n\nShehryar Khan Afridi\n\nMushahid Ullah Khan\n\nHashim Jawan Bakht\n\nFarogh Naseem\n\nUsman Buzdar\n\nNavjot Singh Sidhu\n\nHarsimrat Kaur Badal\n\nTariq Jameel\n\nRaja Basharat\n\nMurad Saeed\n\nMahathir Mohamad\n\nKhurram Sher Zaman\n\nInzamam-ul-Haq\n\nFirdous Ashiq Awan\n\nJaved Iqbal\n\nFaisal Vawda\n\nHafeez Sheikh\n\nMufti Muneeb ur Rehman\n\nSania Nishtar\n\nShaukat Ali Yousafzai\n\nShahzad Akbar\n\nAsif Saeed Khan Khosa\n\nFahmida Mirza\n\nFayyaz ul Hassan Chohan\n\nHammad Azhar\n\nOmar Ayub Khan\n\nShahbaz Gill\n\nFarogh Naseem\n\nMuhammad Zubair\n\nCJP Asif Saeed Khan Khosa\n\nMian Aslam Iqbal\n\nFaisal Javed Khan\n\nRaja Zafar ul Haq\n\nAsad Mehmood\n\nMohammad Faisal\n\nAli Muhammad Khan\n\nSherry Rehman\n\nMisbah ul Haq\n\nMasood Khan\n\nRaja Farooq Haider\n\nShahid Afridi\n\nSaeed Ghani\n\nZulfi Bukhari\n\nAbdul Ghafoor Haideri\n\nZubair Mahmood Hayat\n\nJam Kamal Khan\n\nMahmood Khan\n\nMurtaza Wahab\n\nDr Yasmin Rashid\n\nNoor-ul-Haq Qadri\n\nYasmin Rashid\n\nAnwar Mansoor Khan\n\nFarrukh Habib\n\nZulfiqar Hameed\n\nImran Ismail\n\nMohammad Hafeez\n\nShoaib Malik\n\nAisha Farooqui\n\nMustafa Nawaz Khokhar\n\nAbdul Razak Dawood\n\nAntonio Guterres\n\nMuhammad Basharat Raja\n\nMujahid Anwar Khan\n\nDG ISPR Major General Babar Iftikhar\n\nMike Pompeo\n\nZafar Mirza\n\nMusadik Malik\n\nShehzad Roy\n\nKhalid Maqbool Siddiqui\n\nAjmal Wazir Khan\n\nJam Kamal Khan\n\nMoeed Yousaf\n\nChairman NDMA Lieutenant General Muhammad Afzal\n\nLiaquat Shahwani\n\nShibli Faraz\n\nTaimoor Jhagra\n\nFirdous Shamim Naqvi\n\nGhulam Sarwar Khan\n\nNaveed Qamar\n\nAli Amin Gandapur\n\nRamesh Kumar\n\nCJP Gulzar Ahmed\n\nAzma Bukhari\n\nKamran Bangash\n\nAbdul Qadir Baloch\n\nSanaullah Zehri\n\nAsifa Bhutto\n\nSaleem Mandviwalla\n\nYousaf Raza Gellani\n\nRaja Pervaiz Ashraf\n\nAkbar S Babar\n\nAsad Qaiser\n\nShaukat Tarin\n\nAzam Khan Swati\n\nMohsin Khan Leghari\n\nHaleem Adil Sheikh\n\nFarah Azeem\n\nNoor Alam Khan\n\nMr. Salahuddin\n\nShazia Marri\n\nRaja Riaz Ahmad Khan\n\nDr Shahzad Waseem\n\nAbdul Qadir Patel\n\nAhsan Iqbal\n\nAzhar Sadiq Advocate\n\nSardar Tanveer\n\nMuhammad Moeen Wattoo\n\nJaved Latif\n\nHaji Ghulam Ali\n\nIG Punjab Usman Anwar\n\nSharjeel Memon\n\nHafiz Naeem ur Rehman\n\nFaisal Karim Kundi\n\nAttaullah Tarar\n\nAyesha Gulalai\n\nIrfan Qadir\n\nAhmed Sharif Chaudhary\n\nAnwar ul Haq Kakar\n\nMohsin Naqvi\n\nGohar Ali Khan\n\nwants to hold talks with PTI for political stability in the country, Atta Tarar\n\nADVERTISEMENT\n\nMore to Watch\n\nADVERTISEMENT\n\nLatest Shows\n\nTonight With Samar Abbas\n\nHasb-e-Haal\n\nPeyam-E-Subh\n\nBaat Niklay Gi\n\nADVERTISEMENT","url":"https://video.dunyanews.tv/index.php/en/mustwatch/153314/wants-to-hold-talks-with-PTI-for-political-stability-in-the-country,-Atta-Tarar","image":"https://img.dunyanews.tv/images/28Dec24-aata.jpg","video":null,"publish_date":"2024-12-28 22:33:50","author":null,"language":"en","source_country":"pk","sentiment":-0.349}]}