{"offset":0,"number":50,"available":5275,"news":[{"id":254394506,"title":"Chicago ready for DNC spotlight as nation's Democrats take over city","text":"After 16 months of preparation and fundraising, Chicago is ready for its closeup. And Gov. JB Pritzker — who helped land the city its 26th political convention — says Chicago is prepared, both inside and outside the United Center. Tens of thousands of journalists and delegates flocked to the city over the weekend for the Democratic National Convention, which will formally begin Monday afternoon. So have thousands of protesters, who started day one of a massive march down Michigan Avenue — just as delegates, donors and guests checked into their swanky downtown hotels. The world inside the United Center and its hefty security perimeter will be a very different and insulated one than the one the rest of Chicago experiences. Inside the arena, Democrats will amplify their campaign messaging of positivity over “weird” and help highlight Vice President Kamala Harris as a trailblazing candidate who could become the first Black Asian-American woman to take the White House. Outside, protesters will do their best to have their voices heard — the focal point of a more than 10-months-long effort to force President Joe Biden and Harris to push for an immediate and permanent cease-fire to the war and an end to U.S. military aid to Israel. Pritzker told the Sun-Times he anticipates that there will be some protesters inside the arena, especially from uncommitted delegates who are protesting the war in Gaza. But he said Democrats will show to the world that they respect “peaceful protests.” “I hope that what people cover is at least about the protests, is that there were peaceful protests and that we protected the protesters and their rights, and at the same time, that we tolerate that as Democrats,” Pritzker said. “Republicans and Donald Trump, in particular, does not tolerate protests.” “Obviously you want to allow them to exercise their free speech, but also not disrupt the proceedings,” Pritzker said. “So it’s a balance. Handling a heckler is an art. And I think actually that Kamala Harris has shown she’s got kind of a flair of that,” Pritzker said. Earlier this month, Harris told a group of hecklers, “I’m speaking,” as they interrupted a rally in her first visit to Michigan since becoming the Democratic nominee for president. As for combative protesters, Pritzker said the city will “not protect people who are a danger to the people of Chicago, to the visitors of Chicago, to anybody.” “If you want to cause mayhem, you’re going to get arrested. You’re going to get charged, and you’re going to get convicted,” Pritzker said. The Democratic governor said the National Guard has been part of contingency plans, should outside protests get out of hand. And guardsmen were spotted at Chicago Police Department headquarters on Sunday. “Every level of law enforcement and protection that we can provide, we’ve made contingencies and so on. This has all been in the works for a year and a half now. By the way there’s 60 years of experience ….So I think there’s a lot of learning that’s been done and it’ll be handled properly.” Pritzker, Sen. Tammy Duckworth and former Mayor Lori Lightfoot were key in winning President Joe Biden’s nod to host the convention over New York City, Atlanta and Houston. And Mayor Brandon Johnson inherited the convention after taking office last year. Both Pritzker and Johnson will speak at the convention — Johnson on Monday afternoon and Pritzker on Tuesday evening. The four-day pep rally will go down as the most expensive convention in history. The Chicago host committee announced last week it had raised more than $95 million to pay for the convention, covering everything from lights and sound to food spreads, balloons and other party supplies. That’s $10 million more than Republicans raised for their convention last month in Milwaukee. Untethered by contribution limits related to political campaign committees, massive gifts to Chicago’s host committee have come from corporations including United Airlines, Peoples Gas, McDonald’s, Microsoft, Pfizer and Lyft. Organized labor has also chipped in mightily, with large donations reported by the Laborers’ International Union of North America, Service Employees International Union, and the American Federation of Teachers, among others. A full accounting of contributors won’t be known till well after the balloons drop. Federal election law doesn’t require host committees — which are registered as nonprofits — to disclose their contributors until about two months after the convention ends. Meanwhile on the other side of the aisle, Illinois Republicans have derided Chicago’s grand spectacle. “You’ll see marching bands. You’ll hear John Legend at his concert. They’re pulling out the stops for the convention,” said State Sen. Sue Rezin, R-Morris. “But what really matters is after the convention, when the taxpayers of the state and of this country really get back into their routine of going to the grocery store and being reminded that they can’t afford to feed a family of four… They’re going to be reminded about what the Democrat agenda looks like and how it affects them.”","url":"https://chicago.suntimes.com/2024-democratic-national-convention/2024/08/18/democratic-national-convention-chicago-kickoff-spotlight-jb-pritzker-kamala-harris","image":"https://cst.brightspotcdn.com/dims4/default/25137f4/2147483647/strip/true/crop/7570x4321+0+363/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Feb%2F4f%2Fcfe27c034eb2afa5b7efb5051cdf%2Fdncp","video":null,"publish_date":"2024-08-19 00:02:06","author":"Mitchell Armentrout,Tina Sfondeles","authors":["Mitchell Armentrout","Tina Sfondeles"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.107},{"id":254394508,"title":"Kerry Washington, Mindy Kaling Among Stars Tapped to Serve as DNC Hosts","text":"Kerry Washington, Mindy Kaling, Tony Goldwyn and Ana Navarro will serve as hosts at the 2024 Democratic National Convention, which kicks off Monday in Chicago. The Hollywood Reporter has confirmed the news, which was first reported by CNN on Sunday, that each of the stars will host one night of the four-day event. The plan is that, on their respective nights, one of the four will kick off the broadcast with opening remarks and make appearances throughout the evening. The schedule is as follows: Goldwyn (Monday), Navarro (Tuesday), Kaling (Wednesday) and Washington (Thursday, which is also the day that Vice President Kamala Harris will formally accept the Democratic nomination for president). Goldwyn previously played a president on Scandal, which also starred Washington. Navarro is a co-host of The View, while Kaling is known for her role on The Office. Washington has experience speaking at the DNC: She previously took the stage in both 2012 (when Obama accepted the nomination and ultimately won the election against Mitt Romney) and 2020 (when Biden accepted the nomination and went on to defeat incumbent President Donald Trump). As previously reported, former President Barack Obama and Michelle Obama, along with former President Bill Clinton and former Secretary of State Hillary Clinton, also are expected to speak at the 2024 DNC. President Joe Biden and Dr. Jill Biden will take the stage Monday. Second Gentleman Doug Emhoff also is among the list of scheduled speakers. Minnesota Gov. Tim Walz will accept his nomination for vice president on Wednesday night. Others who are said to be taking the stage are Speaker Emerita Nancy Pelosi, Transportation Secretary Pete Buttigieg, Senate Majority Leader Chuck Schumer, House Minority Leader Hakeem Jeffries, Chicago Mayor Brandon Johnson, Illinois Gov. JB Pritzker and former President Carter’s grandson Jason Carter.","summary":"Kerry Washington, Mindy Kaling, Tony Goldwyn and Ana Navarro will serve as hosts at the 2024 Democratic National Convention, which kicks off Monday in Chicago. The Hollywood Reporter has confirmed the news, which was first reported by CNN on Sunday, that each of the stars will host one night of the four-day event. The plan [&#8230;]","url":"https://www.hollywoodreporter.com/business/business-news/stars-dnc-kerry-washington-mindy-kaling-tony-goldwyn-1235977899/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/07/Kerry-Washington-Getty-H-2024.jpg","video":null,"publish_date":"2024-08-18 23:54:11","author":"Chris Gardner,Kimberly Nordyke","authors":["Chris Gardner","Kimberly Nordyke"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.176},{"id":254393888,"title":"“Understanding the Chaos: Fox News Anchors Discuss Reporting on the 2024 Election and Kamala Harris’s Emergence”","text":"Fox News was the most watched network for the Republican National Convention last month, drawing an overwhelming share of the viewers throughout the week, including an average of 9.43 million on the final night. The question is whether the Democratic National Convention will be a far different story — a big if given that leaders in the party have at times chided or shunned the network. That said, figures such as Transportation Secretary Pete Buttigieg and Sen. Chris Coons (D-DE) have made recent appearances, while Kamala Harris’ campaign announced over the weekend that part of a mega ad buy would be on the network’s daytime programming, “particularly during day-time programming which reaches a more moderate audience.” In separate interviews, Deadline spoke to Special Report‘s Bret Baier and The Story‘s Martha MacCallum, who are lead anchors of Fox News’ coverage, about what they expect this week, whether it’s a challenge to book Democrats on their shows, and the prospects for Fox News hosting a presidential debate. DEADLINE: The race is totally different from where things left off in Milwaukee. Would you have expected the race to be where it is now? BAIER: I would have put money that Biden was going to probably stay in, and up until that Saturday [after the Republican convention], he was, and saying he was going to be the nominee. Fourteen and a half million Democrats had voted for him, and I thought he was going to stay on. So I thought the race was starting to gel, that it was the former president’s to lose. Now I think we’re going to have a really tight race that, again, will come down to probably six states and probably 300,000 votes or fewer in a country of 330 million. So we could be in for a squeaker. MACCALLUM: You see this huge kind of relief rally on the Democrat side, that they have a new candidate, they have someone they’re excited about. And I think that that has reset this whole race, which is fascinating to watch. We’ll see how things go in Chicago for Democrats, and we’ll see what comes after that. A lot of people feel the race really resets after Labor Day as well. DEADLINE: What storylines will you be watching for, or is this going to be primarily a celebration? MACCALLUM: One of the things I remember thinking during the Republican convention was that it felt pretty organic, the enthusiasm. I haven’t seen people that excited in quite a while. I remember Van Jones over at CNN saying, ‘There’s something happening here this week. There’s a movement.’ There’s an excitement that feels very real among the people who were there, and beyond. So now you have the shoe on the other foot. It is the Democrats’ opportunity, and they certainly have a big shot in the arm with Kamala Harris taking over. And I think the way she consolidated power so quickly, when not long ago people were asking whether Joe Biden should remove her from the ticket, whether she was a drag on the ticket. So this is upside down world, and it’s fascinating, from a reporter perspective, to watch all this happen. I think there’s probably another shoe to drop somewhere. I don’t know what it is, but I think we’ve all become very aware that this is quite a volatile cycle. BAIER: I think it’ll be chock full of different storylines. Israel Gaza, and whether protesters show up, that may be one. I think when it comes to how this race is going to be lining up is really the biggest storyline. She’s clearly closed the gap, and in some cases, is ahead, and some of the betting odds have her more of a chance to win the presidency. Just that alone kind of ups the ante for the convention, and I think it’ll be fascinating. We’re going to have a lot of Democratic surrogates on my show. I know we have Governor [Josh] Shapiro and Governor [Gavin] Newsom, Secretary Buttigieg, others. DEADLINE: How did the Democrats’ change at the top of the ticket alter the way that that Fox News is covering next week? MACCALLUM: We’ve watched a remarkable deposing of the top of the ticket. It’s like nothing I’ve ever seen before. There have been times in history when it looked like a candidate was in pretty tough shape, but the party didn’t push him off the ticket and replace him with somebody. So that’s what we saw here, and so it creates a very different environment going into this and of course, we cover it like we cover everything, just watching all of the steps along the way here. I think she’s going to have to start to define herself in a clear way after this convention. DEADLINE: How difficult is it to get Democrats as guests on your show? BAIER: I have Democrats on all the time, and we have a segment called Common Ground where we bring a Democrat and Republican on together, talking about what they’re working on. That has been a real success story for about a year, and now ranking members and chairmen are trying to get on the show a lot. So already the DNC had reached out to us and our show … There’s Democrats, independents and and Republicans who watch our show. I think they want to reach them. MACCALLUM: I talk to John Kirby a lot from the White House. I talk to a number of lawmakers that join us frequently. I guess it is a little bit harder than getting Republicans to come on, but this is their week, so they should want to come on. DEADLINE: Bret, Nikki Haley was on your show last week, essentially trying to tell Donald Trump to focus on the issues and not the personalities. Do you think she was trying to talk to reach him and send a message? BAIER: I do. I think she was clearly saying that the issues are what need to be focused on, and not the crowd sizes and race or the various things that the former president has mentioned along the way. I think she clearly wanted to come on and get that message out, and it got picked up a lot of places. And I’m sure the former president or his campaign got to view it one way or another. DEADLINE: Do you think it is a challenge for Trump to run against a woman, and a woman of color? BAIER: I don’t know if it’s a challenge for him. I think the early days of this transition to a new nominee on the Democratic side has maybe flummoxed the Trump campaign as they’re trying to figure out the best attack line. And I think there’s plenty of time that this race will kind of gel … But I do think the switch over threw some folks for a loop. DEADLINE: What will you be looking for to determine that this is a successful convention for the Democrats? BAIER: The least amount of disunity and the sense of coming together as a party. Unity being the message of the different wings of the party. MACCALLUM: There was a Monmouth poll yesterday that I thought was stunning, and it showed that prior to Biden leaving the race, the enthusiasm rate among Democrats was in the upper 40s, and now it’s in the upper 80s, which is a stunning move. I don’t know how much higher it can go after the convention, but that’s a measure that we’ll be looking at. But I just think that in and of itself is an extraordinary story., the leap in enthusiasm, especially for someone who people thought was a drag on the ticket… And the other thing I’m watching closely is the issue of suburban women voters, and independent suburban women voters in particular, and how they move. Where are the people that are sort of the margins of what is a tight race? How anybody who will be persuaded by this convention and moved over into Harris’ column or Trump’s, I think is that’s the whole story right there. DEADLINE: Fox News has proposed a debate for September and Donald Trump has accepted. What do you think are the chances Fox News will host a debate that both candidates will agree to? (Kamala Harris has not accepted, but says there will be another debate in October, with no network announced). BAIER: We’re doing everything we can to talk to folks and see if we could be the one in October. It’s obviously a different ball game. It’s like the Wild West trying to lock all of it down without the Presidential Debate Commission running the show. So we’re trying hard. If not a debate, maybe consecutive town halls or something like that.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFox News was the most watched network for the Republican National Convention&#8230;\n\n\nThis Post: &#8220;Understanding the Chaos: Fox News Anchors Discuss Reporting on the 2024 Election and Kamala Harris&#8217;s Emergence&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/understanding-the-chaos-fox-news-anchors-discuss-reporting-on-the-2024-election-and-kamala-harriss-emergence/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-‘This-Is-Upside-Down-World-Fox-News.jpg","video":null,"publish_date":"2024-08-18 23:40:11","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.093},{"id":254394644,"title":"Harris and Walz make small town stops and campaign phone calls on Pennsylvania bus tour before DNC","text":"ROCHESTER, Pa. (AP) — Democratic presidential nominee Kamala Harris and running mate Tim Walz gave pep talks to campaign volunteers and a high school football team Sunday, with their bus tour in a corner of Pennsylvania serving as a modest, small-town version of the grand rally she’s expected to have at the Democratic nominating convention in Chicago this week. Vice President Harris and Walz, the governor of Minnesota, were joined by their spouses, Doug Emhoff and Gwen Walz, as they toured in a blue bus. They stopped off to visit volunteers at a campaign office not far from Pittsburgh before continuing on to a firehouse and a high school in another town, along with a pilgrimage to a Sheetz convenience store, part of a storied Pennsylvania chain. Throughout their stops, Harris and her running mate shied away from policy or much politics, instead sticking to broad-strokes messages focused on character, perseverance and the future of the country. Harris, while speaking to a group of supporters and volunteers outside the campaign office in the borough of Rochester, spoke about strength and leadership. She appeared to make a veiled reference to Donald Trump, the Republican presidential nominee, who is known for his pugilistic style and projection of a strongman image, when she said the “real and true measure of a strength of a leader is based on who you lift up,” rather than who they beat down. “Anybody who is about beating down other people is a coward,” she yelled, drawing cheers and applause. “This is what strength looks like.” Walz in his remarks seemed to assume the role of his former job coaching high school football and told the volunteers: “Let’s leave it all on the field. Let’s get this thing done.” Rochester is in in Beaver County, which Trump won in 2020. But the Democrats are riding on renewed enthusiasm after President Joe Biden dropped his reelection bid exactly four weeks ago and endorsed Harris to replace him on the ticket. As Harris’ motorcade left the town, it rolled by a group of about 50 Trump supporters waiting near the road with signs of support for the former president. A handful of Harris supporters were standing nearby with their own signs. The vice president next stopped at a firehouse in Aliquippa, where she met firefighters, petted the station’s dog and gave the crew almond pastries, before heading to a nearby high school, where they met with the local football coach and addressed the team, who kneeled on the field to listen. Walz again slipped into coach mode, reminiscing a bit about his days leading a team and the sport’s character before introducing Harris. She praised the young athletes for their leadership: “Our nation is counting on you and your excellence. We applaud your ambition. She also told them, “Welcome to the role model club.” Southwestern Pennsylvania is a critical part of a key battleground state that has long commanded the attention of presidential candidates. The state voted for Trump in 2016 and for Biden in 2020. Both Harris and Trump are vying to see who can put Pennsylvania in their column on Nov. 5. Most polls, including from the New York Times/Siena College and Fox News, find Harris and Trump locked in a tight race statewide. Trump held a rally Saturday in Wilkes-Barre in the northeastern part of the state, following his earlier rallies in July in Harrisburg and Butler, where he survived an assassination attempt. The bus tour marks Harris’ eighth trip to Pennsylvania this year, and her second this month. The vice president chose to make her first joint appearance with Walz on the ticket in Philadelphia on Aug. 6. On Sunday, they arrived with their spouses earlier at Pittsburgh International Airport and greeted supporters. The foursome held hands and raised their arms together in front of cheering supporters and then boarded a bright blue bus that says “Harris Walz” in big white letters as they set off to make stops in the Pittsburgh area to glad-hand with voters. At a stop in the township of Moon, Harris popped into a Sheetz to seek out Doritos, her go-to snack. In Rochester, Harris, Walz and their spouses spent a few minutes sitting at tables with volunteers and making phone calls to line up support. Harris took a cellphone from a volunteer and spoke to the person on the other end. “I love Erie. At some point we’ll get to Erie,” Harris said. She continued the conversation at at one point said, “79 days to go.” Walz, sitting across the table from Harris, hung up from a call and said of the caller, “He’s all in,” and gave a thumbs up. Kristin Kanthak, associate professor of political science at the University of Pittsburgh, said Pennsylvania “is a state that traditionally has been super important, but southwestern Pennsylvania has been really kind of the battleground part of the battleground state.” After Trump’s surprise win in the state in 2016, Biden flipped Pennsylvania in 2020 — and, in so doing, won the White House — in part by running up his vote totals in heavily Democratic Pittsburgh, the state’s second-largest city and the county seat of Allegheny County. Biden assiduously courted the area’s blue-collar labor unions, kicking off his 2020 presidential campaign at a Teamsters hall in Pittsburgh by declaring, “I am a union man.” Trump, who is counting on strong turnout from his base of white, working-class voters, is not conceding the area. The counties around Pittsburgh have shifted from Democrat to Republican in recent presidential contests, delivering for Trump in both of his earlier runs. Trump has also embraced protectionist trade policies and insists he is pro-worker. His vow to increase U.S. energy production and “drill, baby, drill” has resonated in southwestern Pennsylvania blue-collar counties like Washington, where a natural gas drilling boom has helped make Pennsylvania the nation’s No. 2 producer after Texas. Harris once wanted to ban fracking, an oil and gas extraction process, before recently disavowing her earlier position — a reversal Trump has hammered her for. Dana Brown, director of Chatham University’s Pennsylvania Center for Women & Politics, said in an interview that Harris will use the bus trip to spin up local media coverage as well as reach out to voters in the state’s southwestern region “while she still has a great deal of momentum at her back.” Bus tours have become a staple of political campaigns partly because of the free media coverage they generate. Such trips get the candidates out of their power suits and out of Washington so they can travel the country and score face time with voters in small venues like diners and mom-and-pop shops. The low-key venues of Harris’ campaign on Sunday will be replaced with their polar opposite Monday when the Democratic National Convention opens, offering a prime-time showcase of the Democratic ticket that director Steven Spielberg is helping to choreograph. ___ Price reported from New York. Associated Press writers Michael Rubinkam in northeastern Pennsylvania and Linley Sanders in Washington contributed to this report. (Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"ROCHESTER, Pa. (AP) — Democratic presidential nominee&#160;Kamala Harris&#160;and running mate&#160;Tim Walz&#160;gave pep talks to campaign volunteers and a high school football team Sunday, with their...","url":"https://whdh.com/news/harris-and-walz-make-small-town-stops-and-campaign-phone-calls-on-pennsylvania-bus-tour-before-dnc/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/08/harris-walz.jpg?quality=60&strip=color","video":null,"publish_date":"2024-08-18 23:16:56","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","source_country":"us","sentiment":0.115},{"id":254393826,"title":"","text":"A POPULAR Fox News political analyst revealed one of the major factors that could prevent Donald Trump from winning the 2024 Presidential election. Fox News’ chief political analyst, Brit Hume, mentioned a key factor behind Trump’s potentially tough re-election battle against Kamala Harris could be his level of likability. On August 18, Hume spoke on the cable network, elaborating on her thoughts about the former president’s campaign. The analyst said that although many Americans are fed up with the current Biden administration, some voters still seemed more inclined to vote for Biden, and now Harris, over Trump. With less than three months left until Election Day, Hume argued that Trump is disliked by half of voters despite his cult-like fan base. “The fact that Biden was doing even as well as he did until the very end, is a testament to the fact that Donald Trump has a very hard, solid base of support, but it never gets above about 40 to 45 percent, maybe a little more at best,” Hume said on Fox News Sunday to host Shannon Bream. “So, his weakness is the predicate for our politics going back now three elections. “He was able to surmount Hillary Clinton, a uniquely unpopular opponent, but he couldn’t beat Biden, and you know you look at the losses in the midterms – or the disappointing results in the midterms. “It’s all about one thing, it’s about that. Donald Trump, no matter how enthusiastic supporters are, nonetheless, is not a majority candidate. “He might win, but he’s not a majority candidate.” In response to Hume’s argument, former White House deputy chief of staff Karl Rove said Trump’s “undisciplined form of communication” also contributes to his poor likeability rating. “Well, first of all, he does listen to a lot of people, but the first he listens to is the inner voice, and we see it in these rallies, which are a particularly undisciplined form of communications,” Rove said. “Look, think about it, two-thirds of Americans think we’re going in the wrong direction. “He leads on the issue of who’s better on the economy, who’s better on inflation, who’s better on migration. That’s all all good numbers for him. and yet this race today he’s behind and why is he behind? “Because he is making this race about things other than the three big issues in this campaign – the economy, inflation, and immigration.” In an August 18 poll, The Hill reported that Trump had a 44.1% favorable rating, with an overwhelming 54.3% viewing the former president as unfavorable. Vance, Trump’s running mate, has an even lower favorability rating of 38.5%. Harris, on the other hand, has an almost even split of favorable and unfavorable. 49.3% of respondents viewed the vice president favorably, with 49.2% viewing her as unfavorable. “Kamala Harris’ favorability rating remains a pivotal aspect of her political viability,” The Hill wrote. “This measure of voter sentiment reveals the depth of Harris’ base and the challenges she may face in rallying a broad coalition. “The favorability rating is instrumental in assessing Harris’ impact on the political landscape and her potential to mobilize support in her current presidential bid.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nA POPULAR Fox News political analyst revealed one of the major factors&#8230;\n\n\nThis Post:  first appeared on Internewscast Journal","url":"https://internewscast.com/news/3151768/","image":"https://internewscast.com/wp-content/uploads/2024/08/Veteran-Fox-anchor-warns-Donald-Trump-was-able-to-beat.jpg","video":null,"publish_date":"2024-08-18 23:15:17","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.274},{"id":254393578,"title":"Black men emerge as key constituency in 2024 race, bringing dynamic views to the top of politics","text":"ATLANTA — Every Monday evening, the Andrew and Walter Young Family YMCA basement becomes a sanctuary for men who, local leaders say, have too often been denied one. The Black Man Lab, which for nearly a decade has sought weekly to create a “safe, sacred and healing space” for Black men in metropolitan Atlanta, regularly gathers more than 100 men to pray, meditate and talk through challenges and triumphs they are facing and learn from peers and elders. “It’s almost a communion,” said Carttrell Coleman, a visual artist from South Fulton, Georgia, who has attended the weekly meetings for seven years. “It’s an opportunity for us to share our voices and get resources. The networking is always a good thing. It’s a fellowship, of sorts.” One recent meeting in the immediate aftermath of President Biden’s suspension of his reelection campaign took on special weight as attendees considered the prospect of a Black woman winning the presidency. The candidacy of Vice President Kamala Harris has refocused attention on Black men, a demographic that Democrats and Republicans view as persuadable but whose multifaceted experiences and political preferences often go unaddressed in public debate. Harris’ campaign has also reignited discussions amongst Black men about their influence in this election. “Black men are the target, and we hold the keys to the kingdom. This is our moment,” said Lance Robertson, executive director of the Black City Councilmen of Georgia, during the meeting. “The Black man has built America. Now it’s time for the Black man to save America.” Black male voters are traditionally one of the most consistently Democratic leaning demographics in the nation. This year, however, both major parties view Black men, especially those under the age of 40, as attainable voters. Whether Black men turn out in high numbers and to what degree they maintain traditional support for Democratic candidates may prove decisive in November. “To be frank, I think early on in this process a lot of Black men viewed this election with much skepticism and dread,” said Bishop Reginald Jackson, who presides over all 534 African Methodist Episcopal churches in Georgia. “But since the change in the Democratic ticket, there has been a turnaround. I think they feel they have something that they can support. I think a lot of issues which made a lot of them skeptical are being addressed.” At the Black Man Lab event, the men present came from all walks of life. Attendees’ ages ranged from 8 to 86, with multiple pairings of fathers, grandfathers and grandsons telling the group about the unique circumstances each generation faces as Black men in America. Black voters have historically prioritized policies on civil rights and economic mobility, leading to overwhelming support for Democrats. But how those concerns translate into political preferences has shifted as traditional ties to institutions like the Black church have frayed for some younger Black Americans. “The Black church, in a lot of respects, has been a turnoff for the Black man, and we’re only now working to address the need and correct it,” Jackson said. For many younger Black men, advocates stressed, issues like wealth creation, entrepreneurship, police reform and anti-discrimination policies in the workplace are top of mind. “We want to see jobs and opportunity for Black men, especially,” said Andre Greenwood, chair of the YMCA that hosts the Black Man Lab event. Greenwood, who supports Harris, said economic messages will be most important to Black male voters. Harris’ entrance into the presidential race has unleashed a flurry of organizing among her Black male allies. A day after Biden dropped out of the race and endorsed Harris, a virtual conference tailored for Black men garnered more than 53,000 attendees and raised more than $1.3 million. The event, organized by Win With Black Men, a collective of Black male-led groups, has hosted regular meetings every week since then to engage organizers targeting Black men. “Up until this point, these folks were not really engaged with this campaign season, let alone volunteering for outside organizations. I think what we’re seeing now is a massive level of organic energy that you can’t deny,” said Quentin James, founder of the Collective PAC, a Democratic political action committee that supports Black candidates. Win With Black Men said it would direct the raised funds to organizations nationwide for Black male engagement. More than 150 groups have applied for support. James stressed that while the recent fundraising windfall is notable, the Harris campaign’s own engagement effort with Black men may not be enough unless it is paired with robustly funded outside groups that have longstanding trust in local communities. Harris has also revamped her outreach to Black men. The campaign believes it has a winning message for Black men’s priorities. “It’s wealth and it’s health,” Democratic strategist Antjuan Seawright said of the message. Seawright leads the Democratic National Committee’s “Chop It Up” town halls for Black men at barbershops and other venues in battleground states this year. He noted that Black men “aren’t monolithic” and added that it is a mistake for campaigns to assume “we only care about criminal justice reform.” The culminating effort also aims to address longstanding skepticism among many Black men about the political system, which is seen as discriminatory and unresponsive to their interests. Others have tackled potential hesitancy among men about electing a woman to the nation’s highest office. Republicans, too, see an opportunity to make inroads with Black men precisely because of those longstanding frustrations. Donald Trump often speaks of his interest in garnering greater Black voter support. Black Republicans, including Reps. Byron Donalds of Florida and Wesley Hunt of Texas, have hosted a “Congress, Cognac, and Cigars” event series in cities including Atlanta, Philadelphia and Milwaukee. “Black men have been taken for granted by the Democratic Party for years, but President Trump’s message is resonating at historic levels because he is doing the work,” said Janiyah Thomas, Black media director for the Trump campaign. Marcus Robinson, a senior spokesperson for the Democratic National Committee, called Republican outreach strategy “hot air, racially charged rhetoric and offensive stereotypes, from questioning Vice President Harris’s identity to claiming Black voters should relate to Trump because he is a convicted felon.” For many attendees at the Black Man Lab event, the reinvigorated presidential race is an opportunity to make sure their interests are addressed at the highest levels of government. “I was in the street doing wild stuff and this saved my life,” said Damon Bod, an exterior house technician from Atlanta, of his experience with the Black Man Lab event. Bod said he lost his entire immediate family to violence and that the event provided him counsel and a community. He said he would support Harris in the election because the men who supported him felt she would advance Black men’s interests. “I’ve been looking at it and hopefully she’ll do a bit of good. My brothers have said she will, people who know me. But only God knows,” Bod said.","summary":"Whether Black men turn out in high numbers and to what degree they maintain traditional support for Democratic candidates may prove decisive in November.","url":"https://www.centralmaine.com/2024/08/18/black-men-emerge-as-key-constituency-in-2024-race-bringing-dynamic-views-to-the-top-of-politics/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2024/08/Election_2024_Black_Male_Voters_64093-1724023247.jpg?w=1000","video":null,"publish_date":"2024-08-18 23:08:33","author":"Matt Brown,matt brown - Associated Press","authors":["Matt Brown","matt brown - Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.2},{"id":254393288,"title":"GOPer seeks to flip key volatile Nevada Congressional seat","text":"MESQUITE, Nevada — A veteran pol who could be relaxing at the massive Sun City retirement community here to view sunsets over the mesas is instead out stumping for votes to try to flip a volatile key district red again. John Lee, 69 — a former state legislator and ex-North Las Vegas mayor — was once a Democrat. But three years ago, disappointed with his party’s policies, Lee jumped ship, garnering national attention as he became the first elected official to leave the Democrats during the Biden administration. He is now trying unseat Dem US Rep. Steven Horsford, 51, in the 4th district, which by area, “is probably the second-largest district in the country,” Lee said. “I was the mayor of [North Las Vegas] when there was nowhere to go eat,” he told The Post in a recent interview at the lone Starbucks outlet in Mesquite, a retiree-laden town of 23,000. “I brought in 31 restaurants. “I was the mayor of the town when we had no choice in schools. Now, we have 31 charter schools. “I’ve done everything I can to make sure that the quality of life of people in North Las Vegas is as good as anywhere else in the valley,” he said. Lee said top Nevada Republicans Gov. Joe Lombardo and Rep. Mark Amodei urged him to run for Congress, as did House Speaker Rep. Mike Johnson (R-La.). The candidate said Donald Trump also telephoned and urged him to run. Lee, a former plumbing-company owner, said his record of accomplishment in North Las Vegas, a city of more than 280,000 whose World War II-era aerial gunnery school would evolve into Nellis Air Force Base, speaks for itself. Beyond North Las Vegas, where the bulk of 4th District residents live, is a vast swath of rural areas that are heavily Republican: Lincoln County, Overton, Logan, the Moapa Valley, Nye County, Esmeralda County, Monroe County, and Lyon County, near the state capitol in Carson City. The Fourth District has sent Horsford to Congress four times. Before that, Republican Crescent Hardy won the seat in 2014, and Democrat Ruben Kihuen then took it back two years later. The back-and-forth maneuvering between parties suggests its an area that could once again flip red, a veteran political consultant said. Economic issues combined with Lee’s popularity as a former local mayor and his dogged campaigning might make the difference, the source said. Lee claimed Horsford has been absent as a congressman. “Nobody knows him. He’s not ever anywhere,” the pol said. During the global pandemic, Horsford “never called up and said during COVID, ‘What can I do to help small businesses? What can I do to help my people?’ Nothing. Crickets,” Lee claimed. Horsford’s office promised The Post an interview, but one has yet to come through. As to the Democrat’s proposal to eliminate service workers’ tips from federal income tax, Lee said, “That’s President Trump’s thing, which I think is great. “This was never [Horsford’s] idea.’’","summary":"John Lee is trying unseat Dem US Rep. Steven Horsford, 51, in the 4th district, which by area, “is probably the second-largest district in the country,” Lee said.","url":"https://nypost.com/2024/08/18/us-news/goper-john-lee-seeks-to-flip-key-volatile-nevada-congressional-seat/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/john-lee-republican-candidate-nevadas-87770950_75ac31.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-18 23:03:26","author":"Mark A. Kellner","authors":["Mark A. Kellner"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.119},{"id":254393962,"title":"Why Kamala Harris Is Succeeding as a Presidential Candidate in a Way Hillary Clinton Never Could","text":"Is Kamala Harris’ surge in popularity just a honeymoon phase—a bump in the polls that will fade as soon as real campaigning begins? The Democrats are praying that it’s not, while Republicans are hoping for the opposite. But from a psychological perspective, Harris’ presence in the race might well be a turning point toward something broader than a political win for Dems—it could be a return to reality for the American people, who have had to endure a presidential campaign in which both parties traded in fantasy and outright lies. In fact, 2024 threatened to be the year that the nation’s culture departed from reality once and for all—a dangerous turn when it happens to an individual, but a world-threatening turn when it influences an entire society. So maybe the even bigger question than whether Kamala Harris will win the presidency is: Will Kamala Harris bring us back to reality? Sigmund Freud, who basically created the field of psychotherapy as we know it, asked, in his book Civilization and Its Discontents, whether it is possible for society itself to become neurotic. “May we not be justified in reaching the diagnosis that under the influence of certain cultural urges, some epochs of culture—perhaps the whole of mankind—have become neurotic?” he asked. The problem in such cases, Freud explained, is that when an entire society develops a neurosis, it becomes impossible to gauge what is “normal.” And if we cannot find a referent for the normal and the good, how can we possibly come back from our national neurosis? This neurosis has been stirred not only by the lies told by the leaders of both parties (not necessarily equivalent in their severity, but still—lies) but also by the demand that Americans deny what they see with their own eyes. Republicans are told that Donald Trump actually won the election of 2020 and that the government for the past four years is based on a fraud. Democrats insisted that Joe Biden had not aged on the job and suffered no cognitive decline; this in spite of the fact that millions of Americans witnessed that decline make itself obvious on national television. Psychologists understand that people under severe stress are susceptible to emotional and psychological regression. They become more impulsive, less rational, and often more dependent on leaders who take on the psychological role of parental figures. This phenomenon has been well documented in times of fascism, but it plays a role in all politics: when Germany experienced its worst economic crisis since the war, Angela Merkel emerged as the nation’s “Mutti.” In therapeutic terms, this is called transference, the projection of parental feelings onto the therapist. Unconscious transferences are independent from conscious values or even realistic attributes—when Merkel was nicknamed Mutti, she was not actually a mother, nor was she even traditionally “maternal.” But for people under extreme duress, they play an outsize role in influencing emotional responses and even voting patterns. The 21st century has brought enormous duress to the world, and those in the U.S. seem particularly ill-equipped psychologically to respond to it. A majority of Americans have already been personally affected by extreme upheavals, in terms of climate change, health, and economics. Nearly half of the country’s residents live in communities that have been hit directly by unusually severe weather: drought, floods, fire, intense storms. In the wealthiest nation in the world, nearly two-thirds of Americans could not cover a $500 emergency without going into debt. Parents increasingly see behavioral and academic struggles in their children, delayed effects of the U.S. response to the pandemic that are now impossible to ignore. Americans appear less prepared than ever to deal with such turmoil. They are trained from early childhood to believe that the right consumer goods, the right pharmaceuticals, or simply a positive personal attitude will provide immunity from suffering. And so, at a time when anxiety arises from every direction, voters’ response to candidates is based primarily on policy ideas rather than on their ability to be reassuring, to soothe the feeling of agitation that arises from so much real worry, and to increasingly help them deny the reality of their suffering. The two main candidates who had been running for president—Biden and Trump—both proved to be severely compromised transference figures. Each drew on an unconscious paternal archetype sadly recognizable in American society. Let’s start with Biden’s. For the past year, the president ran a campaign touting economic success that was often interpreted as denying the struggles of most in the nation. On top of that, he denied the obvious effects of his advancing age. While he tried to project a youthful and sporty image, with his aviator glasses and sports cars, his actual performance presented a rather different, more tragic archetype: the aging, deteriorating father who refuses to pass the torch. Americans have a strong cultural resistance to accepting the inevitability of death, and when their elderly parent is in denial, they are liable to join that parent in minimizing the warning signs. Rather than admit the truth that their father is getting old, they tend to regress into what psychoanalyst Melanie Klein calls the paranoid position: They look for someone to blame (or sue) for anything bad that happens. Trump, on the other hand, personifies a very different paternal archetype: the aggressive, impulsive, narcissistic father figure who promises protection in exchange for absolute fealty. For the children of such parents, safety depends on accepting whatever reality the father believes, and so Republicans are required to deny reality, even if they experience that reality directly. In this worldview, there is no climate change, Trump will make everyone rich, and there is no problem that cannot be solved by belligerence and vengeance. In therapeutic terms, this is called counterphobia, the aggressive denial of a frightening reality. The trouble for the Democrats was that in times of great stress, when presented with a choice between two lying father figures, the liar who appears strong will be preferred over the one who appears weak. Trump’s nasty combativeness only made Biden look weaker and sadder. But then Biden withdrew, and, in a flash, the unconscious transference dynamic of the presidential election was radically reversed. The race is no longer between two flawed father figures. It is now a contest between an impulsive and aggressive father archetype and a very different archetype: the strong, no-nonsense, but compassionate working mother figure. The one who will step up if the father is weak and who will be protective if the father is abusive. This archetype has always existed in the nation’s unconscious (see “Rosie the Riveter”), but it hadn’t yet been activated in a presidential campaign. What about the previous woman to run for president on a major-party ticket? Well, Hillary Clinton never managed to embody this archetype. In fact, she seemed to resist transference as a maternal figure altogether (“I suppose I could have stayed home and baked cookies”), drawing instead on a different archetype: the woman who could engage equally in the world of men. Trump’s campaign easily attacked Hillary’s position, presenting her as crooked, someone who wasn’t what she presented herself to be. In the American unconscious, Harris’ archetypal shift has spurred what may be a stunning turnabout. The very characteristics that gave Trump the implicit advantage over a weak Biden and an angry Hillary Clinton now make him look irrational, threatening, and petulant next to a calm, controlled Harris. Without Biden in the race, Trump has become the more vulnerable, aging parent; Harris is stronger, younger, and more energetic, tough without being irrational. And in addition, her actual history and policies, a mix of conservative and progressive values, reinforce the strong-but-compassionate archetype, making it that much harder for Trump to parody or ridicule her. She was a tough prosecutor who rejected the death penalty, a child of immigrants who worked to stem immigration by improving conditions in immigrants’ home countries, a supporter of Israel who would still hold Israel accountable for abuses and shows compassion for the Palestinians. In the American unconscious, it is exactly such a mother figure that can restore sanity and safety to a family/country so recently threatened by an abusive father or frightened by a weakened one. If she is willing to speak the truth, the transference may in fact help her bring the nation back to reality. Human beings, after all, do have a capacity to respond in healthy ways to life stresses; there are natural processes that enable us to come to terms with great challenges. When we’re faced with a deteriorating aging parent, the healthy response is not denial but mourning. Mourning is also a necessary response to our changing climate. The healthy response to an impulsive, abusive parent, or a threatening world, is to acknowledge fear, so that protective measures can be put in place. Sometimes, under great stress, therapy is required. A good therapist facilitates these processes, helping patients—and perhaps countries—face their fears and take the critical steps toward changing reality. As Trump continues to present a campaign based on aggressive denial, Harris can offer the profound relief that comes when the stresses that Americans feel in their bones are validated: that the climate is in fact changing, that their children are suffering, and that their ability to protect their families financially is fraying. Harris’ task will be to use the political transference to begin a kind of national therapy, an alternative to the polarization and paranoia that have been dominant in U.S. culture and politics in this century, a road back to the truth. If Kamala Harris succeeds, she has the opportunity to become not only commander in chief but therapist in chief for a nation in denial. This is not a unique role for presidents. As Franklin Roosevelt, another great therapist in chief, once put it, “In every dark hour of our national life, a leadership of frankness and of vigor has met with that understanding and support of the people themselves which is essential to victory.”","summary":"She’s a refreshing alternative to the two men who were performing very sad archetypes.","url":"https://slate.com/news-and-politics/2024/08/kamala-harris-succeeding-as-woman.html?via=rss","image":"https://compote.slate.com/images/bf9bd838-a0f5-4e2a-9f1c-1807751d1d2a.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2024-08-18 23:00:00","author":"Steven Reisner","authors":["Steven Reisner"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.079},{"id":254393152,"title":"Harris and Trump offer worlds-apart contrasts on top issues in presidential race","text":"WASHINGTON — Vice President Kamala Harris has replaced President Biden atop the presidential ticket, but his “finish the job” campaign mantra can still largely apply to her top policy goals. She’s promising to continue a lot of what Biden was doing during the past four years if she’s elected to four of her own. Former President Donald Trump, for his part, is itching to get back to the White House and accomplish what he didn’t during his first term. Since Biden stepped down last month, the vice president has announced few major policy proposals beyond a new push to prevent price gouging by food producers and grocers and plans to cut taxes for families, attempt to bring down homebuying and rental prices and reduce medical debt. Harris also used a recent rally in Las Vegas, where the economy runs on the hospitality industry, to call for ending taxes on tips paid to restaurant, hotel and other service employees. That came more than a month after Trump used his own Las Vegas rally to promise the same on tips. Despite her lack of specifics on policy, the vice president has committed generally to some major policy positions on various matters, promising to sign sweeping legislation that’s unlikely to clear Congress. Those include measures codifying the federal right to an abortion, increasing the federal minimum wage, imposing an assault weapons ban, requiring universal background checks for firearm purchases and advancing several long-stalled voting rights measures. While details are still rather vague, there’s no doubt that whoever prevails in November will seek to shape the landscape of American life in ways wholly distinct from their opponent. On nearly every issue, the choices – if the winner gets his or her way – are sharply defined. The onward march of regulation and incentives to restrain climate change, or a slow walk if not an about-face. Higher taxes on the super rich, or cuts to benefit high-wage earners. Abortion rights reaffirmed, or left to states to restrict or allow as each decides. Another attempt to legislate border security and orderly entry into the country, or massive deportations. A commitment to stand with Ukraine or let go. Here’s where each candidate stands on 10 top issues: ABORTION HARRIS: The vice president has called on Congress to pass legislation guaranteeing in federal law abortion access, a right that stood for nearly 50 years before being overturned by the Supreme Court. Like Biden, Harris has criticized bans on abortion in Republican-controlled states and promised as president to block any potential nationwide ban should one clear a future GOP-run Congress. Harris was the Democrats’ most visible champion of abortion rights even while Biden was still in the race. She has promoted the administration’s efforts short of federal law – including steps to protect women who travel to obtain abortions and limit how law enforcement collects medical records. TRUMP: The former president often brags about appointing the Supreme Court justices who overturned Roe v. Wade, ending the constitutional right to an abortion. After dodging questions about when in pregnancy he believes the procedure should be restricted, Trump announced last spring that decisions on access and cutoffs should be left to the states. He said he would not sign a national abortion ban into law. But he’s declined to say whether he would try to limit access to the abortion pill mifepristone. He told Time magazine that it should also be left up to states to determine whether to prosecute women for abortions or to monitor their pregnancies. CLIMATE/ENERGY HARRIS: As a senator from California, the vice president was an early sponsor of the Green New Deal, a sweeping series of proposals meant to swiftly move the U.S. to fully green energy that is championed by the Democratic Party’s most progressive wing. Harris also said during her short-lived 2020 presidential campaign that she opposed offshore drilling for oil and hydraulic fracturing. But during her three and a half years as vice president, Harris has adopted more moderate positions, focusing instead on implementing the climate provisions of the Biden administration’s Inflation Reduction Act. That provided nearly $375 billion for things like financial incentives for electric cars and clean energy projects. The Biden administration has also enlisted more than 20,000 young people in a national “Climate Corps,” a Peace Corps-like program to promote conservation through tasks such as weatherizing homes and repairing wetlands. Despite that, it’s unlikely that the U.S. will be on track to meet Biden’s goal of cutting greenhouse gas emissions in half by 2030 – a benchmark that Harris hasn’t talked about in the early part of her own White House bid. TRUMP: His mantra for one of his top policy priorities: “DRILL, BABY, DRILL.” Trump, who in the past cast climate change as a “hoax” and harbors a particular disdain for wind power, says it’s his goal for the U.S. to have the cheapest energy and electricity in the world. He’d increase oil drilling on public lands, offer tax breaks to oil, gas and coal producers, speed the approval of natural gas pipelines and roll back the Biden administration’s aggressive efforts to get people to switch to electric cars, which he argues have a place but shouldn’t be forced on consumers. He has also pledged to re-exit the Paris Climate Accords, end wind subsidies and eliminate regulations imposed and proposed by the Biden administration targeting energy-inefficient kinds of lightbulbs, stoves, dishwashers and shower heads. DEMOCRACY/RULE OF LAW HARRIS: Like Biden, Harris has decried Trump as a threat to the nation’s democracy. But, in attacking her opponent, the vice president has leaned more heavily into her personal background as a prosecutor and contrasted that with Trump being found guilty of 34 felony counts in a New York hush money case and in being found liable for fraudulent business practices and sexual abuse in civil court. The vice president has also talked less frequently than Biden did about Trump’s denial that he lost the 2020 presidential election and his spurring on the Jan. 6, 2021, assault on the Capitol. When she’s interrupted during rallies with supporters’ “lock him up” chants directed at Trump, Harris responds that the courts can “handle that” and “our job is to beat him in November.” TRUMP: After refusing to accept his loss to Biden in 2020, Trump hasn’t committed to accepting the results this time. He’s repeatedly promised to pardon the Jan. 6 defendants jailed for assaulting police officers and other crimes during the attack on the Capitol. He vows to overhaul the Justice Department and FBI “from the ground up,” aggrieved by the criminal charges the department has brought against him. He also promises to deploy the National Guard to cities such as Chicago that are struggling with violent crime, and in response to protests, and has also vowed to appoint a special prosecutor to go after Biden. FEDERAL GOVERNMENT HARRIS: Like Biden, Harris has campaigned hard against “Project 2025,” a plan authored by leading conservatives to move as swiftly as possible to dramatically remake the federal government and push it to the right if Trump wins back the White House. She is also part of an administration that is already taking steps to make it harder for any mass firings of civil servants to occur. In April, the Office of Personnel Management issued a new rule that would ban federal workers from being reclassified as political appointees or other at-will employees, thus making them easier to dismiss. That was in response to Schedule F, a 2020 executive order from Trump that reclassified tens of thousands of federal workers to make firing them easier. TRUMP: The former president has sought to distance himself from “Project 2025,” despite his close ties to many of its key architects. He has nonetheless vowed an overhaul of the federal bureaucracy, which he has long blamed for blocking his first term agenda, saying: “I will totally obliterate the deep state.” The former president plans to reissue the Schedule F order stripping civil service protections. He says he’d then move to fire “rogue bureaucrats,” including those who ”weaponized our justice system,” and the “warmongers and America-Last globalists in the Deep State, the Pentagon, the State Department, and the national security industrial complex.” Trump has also pledged to terminate the Education Department and wants to curtail the independence of regulatory agencies like the Federal Communications Commission. IMMIGRATION HARRIS: Attempting to defuse a GOP line of political attack, the vice president has talked up her experience as California attorney general, saying she walked drug smuggler tunnels and successfully prosecuted gangs that moved narcotics and people across the border. Early in his term, Biden made Harris his administration’s point person on the root causes of migration. Trump and top Republicans now blame Harris for a situation at the U.S.-Mexico border that they say is out of control due to policies that were too lenient. Harris has attempted to counter that by arguing that a bipartisan Senate compromise that would have included tougher asylum standards and hiring more border agents, immigration judges and asylum officers was poised to clear Congress before Trump came out in opposition to it. Harris now says that Trump “talks the talk, but doesn’t walk the walk” on immigration. The vice president has endorsed comprehensive immigration reform, seeking pathways to citizenship for immigrants in the U.S. without legal status, with a faster track for young immigrants living in the country illegally who arrived as children. TRUMP: The former president promises to mount the largest domestic deportation in U.S. history – an operation that could involve detention camps and the National Guard. He’d bring back policies he put in place during his first term, like the Remain in Mexico program and Title 42, which placed curbs on migrants on public health grounds. And he’d revive and expand the travel ban that originally targeted citizens from seven Muslim-majority countries. After the Oct. 7 Hamas attack on Israel, he pledged new “ideological screening” for immigrants to bar “dangerous lunatics, haters, bigots, and maniacs.” He’d also try to deport people who are in the U.S. legally but harbor “jihadist sympathies.” He’d seek to end birthright citizenship for people born in the U.S. whose parents are both in the country illegally. ISRAEL/GAZA HARRIS: Harris says Israel has a right to defend itself, and she’s repeatedly decried Hamas as a terrorist organization. But the vice president might also have helped defuse some backlash from progressives by being more vocal about the need to better protect civilians during fighting in Gaza, where the civilian death toll has now exceeded 40,000. Like Biden, Harris supports a proposed hostage for extended cease-fire deal that aims to bring all remaining hostages and Israeli dead home. Biden and Harris say the deal could lead to a permanent end to the grinding nine-month war and they have endorsed a two-state solution, which would have Israel existing alongside an independent Palestinian state. TRUMP: The former president has expressed support for Israel’s efforts to “destroy” Hamas, but he’s also been critical of some of Israel’s tactics. He says the country must finish the job quickly and get back to peace. He has called for more aggressive responses to pro-Palestinian protests at college campuses and applauded police efforts to clear encampments. Trump also proposes to revoke the student visas of those who espouse antisemitic or anti-American views. LGBTQ+ ISSUES HARRIS: During her rallies, Harris accuses Trump and his party of seeking to roll back a long list of freedoms including the ability “to love who you love openly and with pride.” She leads audiences in chants of “We’re not going back.” While her campaign has yet to produce specifics on its plans, she’s been part of a Biden administration that regularly denounces discrimination and attacks against the LGBTQ+ community. Early in Biden’s term, his administration reversed an executive order from Trump that had largely banned transgender people from military service, and his Education Department issued a rule that says Title IX, the 1972 law that was passed to protect women’s rights, also bars discrimination based on sexual orientation or gender identity. That rule was silent on the issue of transgender athletes. TRUMP: The former president has pledged to keep transgender women out of women’s sports and says he will ask Congress to pass a bill establishing that “only two genders,” as determined at birth, are recognized by the United States. He promises to “defeat the toxic poison of gender ideology.” As part of his crackdown on gender-affirming care, he would declare that any health care provider that participates in the “chemical or physical mutilation of minor youth” no longer meets federal health and safety standards and won’t get federal money. He’d take similarly punitive steps in schools against any teacher or school official who “suggests to a child that they could be trapped in the wrong body.” Trump would support a national prohibition of hormonal or surgical intervention for transgender minors and bar transgender people from military service. NATO/UKRAINE HARRIS: The vice president has yet to specify how her positions on Russia’s war with Ukraine might differ from Biden’s, other than to praise the president’s efforts to rebuild alliances unraveled by Trump, particularly NATO, a critical bulwark against Russian aggression. The Biden administration has pledged unceasing support for Ukraine against Russia’s invasion. The government has sent tens of billions of dollars in military and other aid to Ukraine, including a tranche of aid that totaled $61 billion in weapons, ammunition and other assistance that is expected to last through the end of this year. The administration has maintained that continuing U.S. assistance is critical because Russian leader Vladimir Putin will not stop at invading Ukraine. Harris has said previously that it would be foolish to risk global alliances the U.S. has established and decried Putin’s “brutality.” TRUMP: The former president has repeatedly taken issue with U.S. aid to Ukraine and says he will continue to “fundamentally reevaluate” the mission and purpose of the NATO alliance if he returns to office. He has claimed, without explanation, that he will be able to end the war before his inauguration by bringing both sides to the negotiating table. (His approach seems to hinge on Ukraine giving up at least some of its Russian-occupied territory in exchange for a cease-fire.) On NATO, he has assailed member nations for years for failing to hit agreed-upon military spending targets. Trump drew alarms this year when he said that, as president, he had warned leaders that he would not only refuse to defend nations that don’t hit those targets, but “would encourage” Russia “to do whatever the hell they want” to countries that are “delinquent.” TARIFFS/TRADE HARRIS: Though she was critical of free trade deals before becoming vice president, Harris has more recently offered no signs that she’ll oppose Biden’s policies. That might mean adhering to some protectionist practices that offer similarities with Trump. Biden, for instance, endorsed a tripling of tariffs on Chinese steel, a move that would shield U.S. producers from cheaper imports. In May, the Biden-Harris administration said it would raise the tariff rate on steel and aluminum to 25% from 7.5%. Biden has also said he opposes the proposed acquisition of U.S. Steel by Japan’s Nippon Steel, because it is “vital for it to remain an American steel company that is domestically owned and operated.” TRUMP: The former president wants a dramatic expansion of tariffs on nearly all imported foreign goods, saying that “we’re going to have 10% to 20% tariffs on foreign countries that have been ripping us off for years.” Penalties would increase if trade partners manipulate their currencies or engage in other unfair trading practices. He would also urge Congress to pass legislation giving the president authority to impose a reciprocal tariff on any country that imposes one on the U.S. Much of his trade agenda has focused on China. Trump has proposed phasing out Chinese imports of essential goods including electronics, steel and pharmaceuticals and wants to ban Chinese companies from owning U.S. infrastructure in sectors such as energy, technology and farmland. Whether higher tariffs come from a Biden administration or a Trump one, they are likely to raise prices for consumers who have already faced higher costs from inflation. TAXES HARRIS: The vice president has promised to work with state entities to cancel $7 billion of medical debt for up to 3 million qualifying Americans and plans to push Congress to make permanent a $3,600 per child tax credit approved through 2025 for eligible families. She also wants to offer a new $6,000 tax credit for those with newborn children, and cut taxes for frontline workers and on healthcare plans offered on the marketplace created by the Affordable Care Act. Harris says her administration will expand tax credits for first-time homebuyers and push to build 3 million new housing units in four years, while wiping out taxes on tips and endorsing steeper taxes on corporations. That last part mirrors Biden, who proposed raising the corporate tax rate to 28% and the corporate minimum tax to 21% as a matter of “fundamental fairness” that will bring in more money to invest in Americans. The current corporate rate is 21% and the corporate minimum, raised under the Inflation Reduction Act, is at 15% for companies making more than $1 billion a year. Harris has called for restoring the child tax credit that was enacted under the 2021 COVID-19 relief package, but has since expired. TRUMP: The former president has promised to extend the 2017 tax cuts that he signed into law and are set to expire at the end of 2025. That package cut the corporate tax rate from 35% to 21% and roughly doubled the standard deduction and child tax credit. Those elements will remain until and unless a new law changes them, but many other tax cuts in Trump’s package will lapse without further action by Congress. Trump says he wants to trim the corporate tax rate further – to as low as 15% – and repeal any tax increases that occurred under Biden. Trump also promised to eliminate taxes on tipped income – though doing so would probably require congressional approval.","summary":"While details are still rather vague, there's no doubt that whoever prevails in November will seek to shape the landscape of American life in ways wholly distinct from their opponent.","url":"https://www.centralmaine.com/2024/08/18/harris-and-trump-offer-worlds-apart-contrasts-on-top-issues-in-presidential-race/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2024/08/Election_2024_Where_They_Stand_30203-1724022259.jpg?w=1000","video":null,"publish_date":"2024-08-18 22:57:26","author":"By WILL WEISSERT,JILL COLVIN and SEUNG MIN KIM - Associated Press,Will Weissert, Jill Colvin And Seung Min Kim","authors":["By WILL WEISSERT","JILL COLVIN and SEUNG MIN KIM - Associated Press","Will Weissert, Jill Colvin And Seung Min Kim"],"language":"en","catgory":"politics","source_country":"US","sentiment":0},{"id":254393650,"title":"Running against Harris ‘should be an easy race’ if Trump sticks to policies: Sununu","text":"Gov. Chris Sununu (R-NH) argued that former President Donald Trump could easily win the 2024 election against Vice President Kamala Harris if he sticks to criticizing her policies rather than making personal attacks against her. Former United Nations ambassador Nikki Haley, who ran against Trump in the Republican Party’s 2024 presidential primary, argued last week that the former president needs to “quit whining” about Harris and that simple labels on the Democratic candidate will not sway voters. Sununu, who supported Haley in the primary, agreed with the former U.N. ambassador, suggesting that any Republican who is not Trump would probably be ahead of Harris “by 10 points.” “And so the message is very clear: if you stick to the issues, if you stick to what matters, this should be an easy race for Donald Trump. It really should,” Sununu said on CNN’s State of the Union. Sununu explained that Trump is doing better with male voters in polling data but is down by “10, 12 points at least” among female voters ever since Harris entered the 2024 race. He predicted this voting block would come out “in much bigger numbers” this November if President Joe Biden were still seeking reelection against Trump. As such, the New Hampshire governor advised Trump to remind voters that he is running against “the most liberal and most unpopular vice president in history.” He also noted how Harris selected a very liberal running mate, Gov. Tim Walz (D-MN), as her vice presidential candidate, and that the 2024 race is shaping up to be “a huge Republican win” in the coming months. “He‘s got to deliver, and we‘ve all showed him exactly that playbook to do so,” Sununu said. “If he can get it together in the last sixty days, he can. And remind folks that they, as individuals, they‘re more important than the government.” CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER This week will see the Democratic National Convention be held in Chicago, with Sununu arguing it will be “a great opportunity” for Trump. The governor argued that Chicago is not a very safe city, and that Republicans can point to the DNC being hosted in this city and argue “this is what the Democrats highlight.” Similar to Sununu and Haley, former House Speaker Kevin McCarthy has advised Trump to “stop questioning” the legitimacy of Harris’s campaign crowds, and instead stick to criticizing the about-face she has made on various topics. Trump has accused Harris of using artificial intelligence to manipulate the size of her crowds, though the Harris campaign has confirmed to the Washington Examiner that the photo Trump referenced was taken by the Harris campaign and was not altered by AI.","summary":"Gov. Chris Sununu (R-NH) argued that former President Donald Trump could easily win the 2024 election against Vice President Kamala Harris if he sticks to criticizing her policies rather than making personal attacks against her. Former United Nations ambassador Nikki Haley, who ran against Trump in the Republican Party’s 2024 presidential primary, argued last week [&#8230;]","url":"https://www.washingtonexaminer.com/news/3125412/running-against-harris-should-be-an-easy-race-if-trump-sticks-to-policies-sununu/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Chris-Sununu-on-Trump-scaled.webp","video":null,"publish_date":"2024-08-18 22:56:15","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.26},{"id":254392584,"title":"Hackers are targeting Tory leadership hopefuls with ‘phishing’ scams warning they have been compromised by Russia","text":"HACKERS are targeting Tory leadership contenders with “phishing” scams warning they have been compromised by Russia, The Sun can reveal. Emails claiming that their X/Twitter accounts have been breached by hackers in Kraswnoark, Siberia have been sent to at least one frontrunner. But the email - which appears to be from Elon Musk’s social media firm’s security - is a fake that instead attempts to garner passwords and personal information. It is understood the attack is being investigated by Parliament’s security officers. All hopefuls and high profile politicians have been urged to up their cyber security. Last month a breach of Donald Trump’s campaign HQ was believed to have been a coordinated attack blamed on the Russians. Britain’s cyber-spooks said: “We offer personalised briefings to senior politicians where there is a significant cyber threat against them personally and to help them safeguard their personal communications and those of their private offices. A spokesman for the National Cyber Security Centre added: “Suspicious emails can be forwarded to the NCSC at report@phishing.gov.uk where they will be analysed and taken down where appropriate.”","summary":"","url":"https://www.thesun.co.uk/news/29948885/hackers-targeting-tory-leadership-hopefuls/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/08/computer-hacker-stealing-data-laptop-923670443_698d3a.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-08-18 22:43:31","author":"Harry Cole","authors":["Harry Cole"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.672},{"id":254392858,"title":"Guide to the upcoming first vote in the presidential election starting next month","text":"The 2024 political season has been one of the most tumultuous in history, but in just a month, the first voters will already be able to start casting ballots in the presidential election. While each state has its own rules on absentee voting and in-person early voting ahead of Election Day on November 5, some voters can begin submitting their ballots as many as 50 days out. Vice President Kamala Harris and former President Donald Trump are neck-and-neck in the race for the finish line. The average of the latest polls have them in a virtual tie with less than three months to go. The majority of states offer multiple ways for people to vote in the upcoming election. The most common option is voting on Election Day, but there are also vote-by-mail, early in-person voting and absentee voting options depending on the state. Forty-seven states, the District of Columbia, Guam, Puerto Rico, and the Virgin Islands offer early in-person voting to all voters at some point ahead of Election Day, according to tracking by the National Conference of State Legislatures. That includes eight states and the District of Columbia which conduct their entire elections primarily by mail with some in-person options for voters who prefer it. Democrats have not even held their convention yet, and Harris and Trump are not set to come face-to-face on a debate stage until September 10, but by then, some voters could have their ballots already in hand. Both campaigns this year have encouraged supporters to vote in whichever way works best for them by Election Day after some Republicans rejected vote-by-mail options in 2020 amid criticism from Trump. It is important for voters to check the requirements and deadlines specific to voting before Election Day in their state, but here is what voters should know ahead of the very first voting getting underway: The first ballots for the election start being mailed out on September 6 in the battleground state of North Carolina. Those ballots are sent by county boards of elections to eligible voters who submitted an absentee ballot request form. Absentee voting in Alabama starts just days later on September 11. The crucial state of Pennsylvania does not have early voting, but depending on the county, some voters in the battleground state can start voting absentee or by using the mail-in ballot in person 50 days out, meaning September 16. Just a few days after that, some early voting options become available in Minnesota, South Dakota and Virginia on September 20. That includes early in person or vote by mail in Minnesota. In Virginia, voters can start casting ballots in person early at their local county registrar’s office. And absentee voting begins in South Dakota. New York also starts sending out ballots to some eligible voters including those in the military while West Virginia starts sending out mail ballots. Kentucky also begins sending out some absentee voters. On September 21, the first ballots start being mailed out in New Jersey, but some counties could act even sooner. Idaho and Louisiana also begin mailing some ballots. More ballots start being mailed out two days later in Maryland, Mississippi and Vermont on September 23. On September 24, mailed ballots also begin going out in Missouri. On September 26, early voting begins in Illinois which requires the option be available 40 days out from Election day. Depending on how and when they are requested, ballots also start being mailed out to some eligible voters in Florida, Michigan and North Dakota. The first ballots in Nebraska start being mailed out on September 30 to those who have requested one. Once October rolls around, 19 more states participate in early mail-in voting. 34 more states begin participating in some in-person early or absentee voting that month. All-Mail Elections Eight states and the District of Columbia conduct their entire elections primarily by mail. California, Colorado, Hawaii, Nevada, Oregon, Utah, Vermont and Washington state all have mail-in elections, but each have their own timelines and rules for when voters can bring their ballots back in person should they prefer rather than putting their ballot in the mail.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe 2024 political season has been one of the most tumultuous in&#8230;\n\n\nThis Post: Guide to the upcoming first vote in the presidential election starting next month first appeared on Internewscast Journal","url":"https://internewscast.com/politics/guide-to-the-upcoming-first-vote-in-the-presidential-election-starting-next-month/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-What-to-know-as-the-first-voting.jpg","video":null,"publish_date":"2024-08-18 22:39:58","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.006},{"id":254392952,"title":"Democratic voters are almost extinct in parts of rural America","text":"Her neighbors call her “the crazy Democrat,” although it’s more a term of endearment than derision. Some less populated counties have fewer. There are 21 Democrats in Clark County, Idaho, and 20 in Blaine County, Nebraska. But Niobrara County’s Democrats, who account for just 2.6% of registered voters, are the most outnumbered by Republicans in the 30 states that track local party affiliation, according to Associated Press election data. In Wyoming, the state that has voted for Donald Trump by a wider margin than any other, overwhelming Republican dominance may be even more cemented-in now that the state has passed a law that makes changing party affiliation much more difficult. Tuesday’s primary will be the first election since the law took effect. In Niobrara County’s grassy rangelands and pine-spattered hills adjoining Nebraska and South Dakota, it’s not easy being blue. A paralegal for the Republican county attorney, Blackburn hears a lot of right-wing views around town. “Normally I just roll my eyes and walk away because I’m fighting a losing battle and I’m fully aware of that,” she said. “Maybe that is why I’m well-liked, because I keep my mouth shut 10 times more than I want to.” Not that she’s politically shy. She flies an LGBTQ+ flag in support of her lesbian daughter at her house in Lusk, a ranching town of 1,500 and the Niobrara County seat. In political season, Blackburn stocks up on Democratic political signs to replace those that get swiped. She speaks approvingly of policing reform, taxation for government services and the transgender social media celebrity Dylan Mulvaney. Maybe because she’s open about those views — and far too outnumbered to put them into action — Blackburn really does seem well-liked in Lusk, where she recently served nine years on the Town Council. “I won two elections here. Even though that’s nonpartisan, people still knew I had left-leaning values,” she said. Nationwide, Democrats account for fewer than 3% of voters in three counties this year, up from one county in 2020 but down from seven in 2016. There were none with such a low percentage of Democratic registrations in the presidential election years of 2012, 2008 and 2004, according to the AP data. The most Republican counties in recent years are concentrated in Idaho, Utah and Wyoming. The most Democratic areas, meanwhile, are much less one-party-dominant. The District of Columbia, where 77% of voters are Democrats, ranks second for Democratic dominance. First is Breathitt County, Kentucky, which through tradition is 79% Democratic but not to the core. Republican vice-presidential candidate JD Vance has family there and in 2020 the county went 75% for former President Donald Trump. Niobrara County was not always quite so Republican. It had more than twice as many Democrats, 83, in 2012, and in 2004 there were more than four times as many, 139. The Democrats’ struggle in Wyoming mirrors the party’s challenges across rural America, where the party has been losing ground for years. It wasn’t always this way. Seventy years ago, Democrats were a political force across southern Wyoming, where union mining and railroad jobs were abundant. Now, the party’s only strongholds are in the university town of Laramie and resort town of Jackson. Meanwhile, as Wyoming Democrats face difficulty fielding viable candidates at all levels, many Democrats have been switching their registration to vote in more competitive Republican primaries, then changing back for the general election. “You feel skeevy and dirty when you do it. But you do it anyway and you change it back as soon as you can, because you don’t want to start getting the Republican mailings,” Blackburn said. Republicans decided they’d had enough. The Wyoming Legislature, where the GOP controls over 90% of the seats, passed legislation last year banning voters from changing their party registration in the three months before the August primary. Party-switching had “undermined the sanctity of Wyoming’s primary process,” Wyoming’s Republican secretary of state, Chuck Gray, said in a statement of approval. Wyoming’s Republican and Democratic primaries on Tuesday will be the first in modern memory where voters won’t be able to change party affiliation at the polls. For Democrats, it will be slim pickings. Statewide, obscure candidates who have done little campaigning are unopposed for the Democratic nomination for U.S. House and Senate. In Niobrara County, no Democrats are running. They aren’t contesting a seat in the Wyoming House of Representatives or an open seat on the county commission, the two major races, or even running for local party positions. Yet the area had a Democratic state representative not too long ago: Ross Diercks, who is recognized and warmly greeted at the Outpost Cafe, a homey breakfast and lunch spot in Lusk. A former middle school English teacher, Diercks was a Republican before deciding the GOP didn’t do enough to support public education. He beat a Republican incumbent in 1992 to launch an 18-year run in the Legislature. Knowing voters personally and keeping up on issues helped him hold office. When he got a C-minus on a National Rifle Association questionnaire, for example, he resolved to improve. For subsequent elections, he scored A’s on the survey. Many Republican lawmakers are friends. When one from just down the road died, he sang at his funeral. Then in 2022, Diercks temporarily switched parties to vote in the GOP primary against Harriet Hageman, who was challenging then-Rep. Liz Cheney for the state’s lone House seat. How many other Democrats did the same is hard to count, but Diercks was far from alone. Hageman, the daughter of the lawmaker he sang for at his funeral, nonetheless won the race by a wide margin. The new law keeping Diercks and others from switching their registration so easily has him exasperated with the GOP. “How far are they going to go to limit one’s ability to vote? If it really comes down to purifying the party, on a voting level all the way up to the elected officials, pretty soon there isn’t going to be anyone left who’s pure enough to be in the party,” Diercks said. Truck driver Pat Jordan supports many left-leaning goals, including universal healthcare, but said he only registers as a Republican. “The best way to participate in meaningful change is to try to sway the dominant party,” said Jordan, who lives in Niobrara County. “You know, we need to have a government that serves the people, all of them, not just Republicans and not just rural and not just urban and not just Democrats — and definitely not just the rich and the wealthy.” Last winter, dozens of locals gathered outside to honk and cheer as one Democrat left town. But they weren’t cheering as Ed Fullmer was headed off for good. Fullmer was on the high school boys basketball team bus as they left for the state championship. They lost, but Fullmer coached the Tigers to their best record in a decade, 20-8. He said people know his views but rarely put him on the spot about politics. “Most people don’t want to dive into those type of discussions,” he said. “They respect you for what you do, how you work.” Blackburn, for one, intends to hold her political ground, even as it shrinks around her. “I am who I am, and I have the views that I have,” she said. “And I don’t care if it bothers people or not.”","summary":"The Democrats' struggle in Wyoming mirrors the party's challenges across rural America, where the party has been losing ground for years.","url":"https://fortune.com/2024/08/18/democratic-voters-extinct-rural-america-donald-trump-republicans-wyoming-idaho-nebraska/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/AP24226756895323-e1724020380167.jpg","video":null,"publish_date":"2024-08-18 22:39:41","author":"Mead Gruver,The Associated Press","authors":["Mead Gruver","The Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.136},{"id":254393034,"title":"The DNC will be another stage to prop up Dems’ Kamala Harris lies","text":"Democrats will be putting on a show at their national convention this week — and absolutely nothing but a show. Vice President Kamala Harris has already been crowned the nominee in an online vote: Nothing will actually be decided in Chicago. Which makes the convention as much of a fake as the candidate. The show will strive to present Harris is a fresh face with new ideas, rather than a veteran Hollywood progressive pitching the same policy mix she’s embraced these last 3½ years as President Biden’s No. 2: policies that sent inflation surging, millions of illegal migrants surging into the interior, energy prices soaring and the economy slowing. The fiction is of the party “joyfully” embracing this surprise marvel, rather than falling back on her after its leaders pushed out Biden when they finally realized could only lose and drag down their Senate and House hopefuls, too. Yet she’s a less familiar face than Joe mainly because she’s been a do-nothing veep who largely avoided the media once it became clear she’d stick her foot in her mouth every time she was in front of a camera without a teleprompter. Recall the disastrous Lester Holt interview where she claimed she’d been to the border when she hadn’t (and got called out on it). Democrats are relieved that Joe’s out, but their enthusiasm for Kamala depends on keeping her a blank slate to most voters. And she’s inevitably filling in that blank — and so ending her honeymoon. She just doubled-down on the worst of Joe’s policies, promising $2 trillion in goodies that add up to little more than vote-buying: cancel billions in medical debt, “forgiving” more student loans, a $6,000 tax credit for newborns $25,000 for homebuyers. Spend, spend, spend! More of exactly what caused triggered crushing inflation in the first place. And her prescription for inflation? Stop “price-gouging,” though it’s higher wholesale costs, not corporate greed, that’s driven eye-popping costs for basic goods. Biden himself tried both the “bribe the voters” and “blame the corporations” gimmicks; Harris is barely even repackaging them. And her only other “fresh” ideas come straight from the opposition: Donald Trump’s “no tax on tips” and JD Vance’s “boost the child tax credit” talk. She’s actually dropped any ideas that distinguished her from Joe (banning fracking, supporting single-payer health care, doing away with ICE) because they were losers when she ran on them four years ago, and are even worse now. But the DNC show will use pomp and circumstance to paint Harris as the second coming of Barack Obama — a symbol of hope and change. That’s why they’re rushing Joe onstage — and off, ASAP — on the first night. The big crowd-pleasers will be the Obamas the second night and Bill Clinton on the third. But Kamala Harris herself has to carry the finale, still bringing nothing new to the table — leaving undecided viewers to ask why the candidate who stands for Democrats’ future is so hopelessly less inspiring than the ones who stand for its past.","summary":"Democrats will be putting on a show at their national convention this week.","url":"https://nypost.com/2024/08/18/opinion/the-dnc-will-be-another-stage-to-prop-up-dems-kamala-harris-lies/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-2wamjtgal-1724019389139.jpg?quality=75&strip=all&1724005081&w=1200","video":"https://cdn.jwplayer.com/videos/rXOIs62d-RyIcpnTz.mp4","publish_date":"2024-08-18 22:35:04","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.411},{"id":254392574,"title":"J.D. Vance Compares Kamala Harris to Jeffrey Epstein as Donald Trump Says He’s ‘Better Looking’ Than Her","text":"Donald Trump and J.D. Vance are facing criticism after making some unorthodox comparisons involving their Democratic opponent, Vice President Kamala Harris. On Sunday, Aug. 18, Vance, 40, made an appearance on Fox News Sunday, during which he heavily criticized Harris' policies and claimed that Trump's campaign is doing well, despite the GOP's concerns about Harris, 59, pulling ahead in the polls. \"Giving Kamala Harris control over inflation policy, Shannon, it’s like giving Jeffrey Epstein control over human trafficking policy,\" Vance said, speaking to host Shannon Bream, who did not respond to the comment. \"The American people are much smarter than that. They don't buy the idea that Kamala Harris represents a fresh start. She is more of the same.\" Social media users were quick to point out that while Harris has no connection to Epstein — who was charged with sex trafficking of minors in 2019 and later died in prison — Trump and third-party presidential candidate Robert F. Kennedy Jr. have both been associated with Epstein in the past. \"If my running mate was in numerous photos and videos with Epstein, I'd do anything to avoid saying his name,\" one X (formerly Twitter) user wrote, criticizing Vance's comparison. Epstein and Trump were photographed together several times, and the former president stated that he was a \"terrific guy.\" Politico also reported in 2017 that Trump flew at least once on one of Epstein’s private planes and that they had each other's personal phone numbers, among other connections. While appearing on the podcast Flagrant in March, Kennedy, 70, confirmed that knew Epstein and had flown on his planes, adding: \"You don’t know these people are swamp creatures until all this stuff comes out.\" This isn't the first time a member of Trump's campaign has made a highly questioned comparison regarding Harris. On Saturday, Aug. 17, Trump himself made comments about the vice president's appearance during a campaign rally in Wilkes-Barre, Pa. Seemingly referring to a recent Time magazine cover, which features an illustrated portrait of Harris, Trump stated: \"Don't ever call a woman beautiful, because that'll be the end of your political career, please,\" per ABC News. \"But I say that I am much better looking. I'm a better-looking person than Kamala,\" Trump said later on, per the outlet. \"They said, 'No, her biggest advantage is that she's a beautiful woman.' I'm going, 'Huh?' I never thought of that. I'm better looking than she is.\" Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. Just last week, the Republican presidential nominee also discussed Harris' appearance on the magazine cover during a virtual interview with Elon Musk on X. \"I saw a picture of [Harris] on Time magazine today. She looks like the most beautiful actress ever to live,\" he said. \"Actually, she looked very much like our great first lady, Melania.\" \"She didn’t look like Kamala, that’s right,\" he continued. \"But of course, she’s a beautiful woman, so we’ll leave it at that.\" Trump and Harris have each agreed to debate for the first time on Sept. 10 on ABC News.","summary":"Vance is being heavily criticized for comparing Harris to Epstein, with critics citing Trump&#39;s connection to the convicted sex offender","url":"https://people.com/jd-vance-compares-kamala-harris-to-jeffrey-epstein-as-donald-trump-says-hes-better-looking-than-her-8697125","image":"https://people.com/thmb/gRqTloWbXsqQTm3vhTlH1DF1HEs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(737x242:739x244)/kamala--jd-vance-trump-081824-8f75ff5b9b084904ac1eb030d1ce5168.jpg","video":null,"publish_date":"2024-08-18 22:33:44","author":"Charlotte Phillipp","authors":["Charlotte Phillipp"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.056},{"id":254392182,"title":"THE EXTRAORDINARY MAKEOVER OF KAMALA HARRIS","text":"At a time when a current president decides not to run for re-election and a past president is shot, what could possibly be an even more remarkable event? Certainly, the transformation and makeover of Vice President Kamala Harris from, at best, a second class politician finding difficulty in speaking plain English to Superwoman status wins that distinction even in these extraordinary conditions. Wow! How could this have happened? How could someone who was widely accused of being an inferior vice president and an extreme left wing progressive now has reversed the highly negative perceptions and bad press to become the darling of the media? Was this blind luck? Was it shrewd planning by the Democrats? Or are there other answers? About Vice President Harris, most people are not familiar with her background. She was elected San Francisco’s district attorney and twice as California’s attorney general. She was elected to the Senate in 2017 and as vice president in 2021. Democrats assert that this experience and background makes Harris an ideal candidate for president. In his initial reactions to Harris’s candidacy, Trump has stumbled badly. The brief against Harris was that she was an extreme progressive who supported radical programs to include the “Green New Deal,” defunding the police and ICE (Immigration and Customs Enforcement); and Medicare for all. The Hill recently reported that Harris was the second most extreme liberal Democrat to serve in the Senate. But since winning the nomination, Harris has reversed course of these and other policies, moving to the center with such alacrity that would induce whiplash in most ordinary people. Regardless of the reasons for her embrace of positions she once vigorously opposed, in the days since President Joe Biden stepped down as a candidate, Harris has run an immaculate campaign. So far, not only has she not made a misstep. She has put ex-President Donald Trump on his back foot as polls show a much tighter race in which Trump is behind in several key battleground states. Remarkable does not adequately describe this political reversal of fortune. In large part and surprisingly, the depth of despair Democrats held for Biden’s chances of winning was underestimated. The sense of intense relief led to raising over $300 million and 100,000 volunteers in the first few days. And characteristics such a cackling laugh and excessive use of body language to substitute for verbal failings became assets. Harris is a very attractive campaigner. That she smiles almost promiscuously turned out to project a very positive attitude in these difficult times especially when contrasted with Trump’s glower. While she has been assailed by Republicans for refusing to answer questions, those charges have not hit home yet. Perhaps that Harris is 59, very energetic and enthusiastic is a refreshing contrast withBiden. She also has been good in using the teleprompter to pass on her sound bites and zingers that have been well received by supporters. And the huge turnout at her rallies indicates the depth of support she has received in a very short period of time. People have speculated over her choice of Minnesota Governor Tim Walz as her vice president. My guess is that Harris felt very comfortable and congenial with Walz. Further, unlike Pennsylvania Governor Josh Shapiro, Walz has no aspirations for the presidency and thus would be a very loyal vice president. Democrats have attacked Walz as another extreme progressive and have used his twenty-four years service in the Minnesota National Guard to “Swiftboat” him as exaggerating his rank and lying about wartime service. Frankly, many people see Walz as grandfatherly and even Santa Claus-like. That alone will deflect these allegations. Teamed with Walz, Harris has picked a partner whose good nature reinforces the positive nature of her campaign. It is still early days. And with the Democratic Convention less than a week away, Harris’s momentum will probably grow. But after Labor Day, the honeymoon will be over. Some argue it is Trump’s election to lose. In his initial reactions to Harris’s candidacy, Trump has stumbled badly. His vice presidential choice, JV Vance, likewise has subjected himself to foot in mouth political disease. If Trump does not make a major course change, Harris must be seen as the favorite. The FT’s perceptive US columnist Ed Luce argues that it is Harris’ election, not Trump’s, to lose. What he means is that Harris cannot realistically depend on Trump imploding, which he may well. She will come under intense scrutiny. If she survives that, against all odds, Kamala Harris may become America’s 47th president. The writer is a senior advisor at Washington, DC’s Atlantic Council and a published author.","summary":"At a time when a current president decides not to run for re-election and a past president is shot, what could possibly be an even more remarkable event? Certainly, the transformation and makeover of Vice President Kamala Harris from, at best, a second class politician finding difficulty in speaking plain English to Superwoman status wins [&#8230;]","url":"https://dailytimes.com.pk/1218610/the-extraordinary-makeover-of-kamala-harris/","image":"https://dailytimes.com.pk/assets/uploads/2019/05/hkuphoto-e1556801578495.jpg","video":null,"publish_date":"2024-08-18 22:21:29","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","source_country":"pk","sentiment":0.085},{"id":254394646,"title":"Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire","text":"CHICAGO (AP) — Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza. While Vice President Kamala Harris has energized crowds of supporters as she prepares to accept the Democratic nomination, progressive activists maintain their mission remains the same. Activists say they learned lessons from last month’s Republican National Convention in Milwaukee and are predicting bigger crowds and more robust demonstrations in Chicago, a city with deep social activism roots. Who is protesting? Demonstrations are expected every day of the convention and, while their agendas vary, many activists agree an immediate ceasefire in the Israel-Hamas war is the priority. Things are set to kick off Sunday on the convention’s eve with an abortion rights march along iconic Michigan Avenue. Organizer Linda Loew said even though Democrats have pushed to safeguard reproductive rights at home, the issue is international. They will march in solidarity with people everywhere who struggle for the right to control what happens to their bodies, as well as to protest the money the U.S. spends to back wars that could be used for healthcare, she said. “We believe that the billions of dollars that continue to flow to the state of Israel and the flow of weapons are having an inordinate and horrific impact, but in particular on women, children and the unborn,” she said. “All of these things are tied together.” The largest group, the Coalition to March on the DNC, has planned demonstrations on the first and last days of the convention. Organizers say they expect at least 20,000 activists, including students who protested the war on college campuses. “The people with power are going to be there,” said Liz Rathburn, a University of Illinois Chicago student organizer. “People inside the United Center are the people who are going to be deciding our foreign policy in one way or another.” Where are they protesting? Activists sued the city earlier this year, saying restrictions over where they can demonstrate violate their constitutional rights. Chicago leaders rejected their requests for permits to protest near United Center on the city’s West Side, where the convention is taking place, offering instead a lakefront park more than 3 miles (5 kilometers) away. Later, the city agreed to allow demonstrations at a park and a march route closer to the United Center. A federal judge recently signed off on the group’s roughly 1-mile (1.6-kilometer) route. Coalition to March on the DNC spokesman Hatem Abudayyeh said the group is pleased it won the right to protest closer to the convention, but he believes its preferred 2-mile (3-kilometer) march would be safer for larger crowds. The group is chartering buses for activists from about half a dozen states. “We’re going forward, full speed ahead,” he said. The city has designated a park about a block from United Center for a speakers’ stage. Those who sign up get 45 minutes. The Philadelphia-based Poor People’s Army, which advocates for economic justice, plans to set up at Humboldt Park on the city’s Northwest Side and will feature events with third-party candidates Jill Stein and Cornel West, plus a 3-mile (5 kilometer) march Monday to the United Center. Some group members have spent the last few weeks marching the more than 80 miles (130 kilometers) from Milwaukee, where they protested during the Republican convention. “Poor and homeless people are being brutalized, with tents and encampments destroyed and bulldozed away, from San Francisco to Philadelphia to Gaza and the West Bank,” spokesperson Cheri Honkala said in a statement as the group reached Illinois. “These preventable human rights violations are being committed by Democratic and Republican leaders alike.” How does a new nominee change things? Many activists believe nothing much will change because Harris is part of the Biden administration. “The demands haven’t changed. I haven’t seen any policy changes,” said Erica Bentley, an activist with Mamas Activating Movements for Abolition and Solidarity. “If you’re going to be here, you’re going to have to listen to what’s important to us.” Pro-Palestinian protesters in Chicago have been highly visible, shutting down roads to the airport and staging sit-ins at congressional offices. Some are planning their own one-day convention Sunday with third-party candidates. “Regardless of who the nominee is, we’re marching against the Democrats and their vicious policies that have allowed Israel to kill over 40,000 Palestinians in Gaza,” said Fayaani Aboma Mijana, an organizer with the Chicago Alliance Against Racist and Political Repression. It’s unclear if the convention will draw far-right extremists who ardently support former President Donald Trump. Secret Service Deputy Special Agent in Charge Derek Mayer said last week there are no known specific security threats against the convention. Is Chicago ready? The convention will draw an estimated 50,000 people to the nation’s third-largest city, including delegates, activists and journalists. The city says it has made necessary preparations with police and the Secret Service. Security will be tight, with street closures around the convention center. To combat traffic concerns, city leaders are touting a new $80 million train station steps from the United Center. They also have tried to beautify the city with freshly planted flowers and new signs. City leaders also cleared a nearby homeless encampment. Police have undergone training on constitutional policing, county courts say they are opening more space in anticipation of mass arrests and hospitals near the security zone are beefing up emergency preparedness. Authorities and leaders in the state have said people who vandalize the city or are violent will be arrested. “We’re going to make sure that people have their First Amendment rights protected, that they can do that in a safe way,” Mayor Brandon Johnson told The Associated Press in a recent interview. But some have lingering safety concerns, worried that protests could become unpredictable or devolve into chaos. Activist Hy Thurman protested and was arrested at the infamous 1968 convention. The 74-year-old now lives in Alabama but plans to come to Chicago to protest the war in Gaza. “It’s extremely personal for me,” he said. “I see parallels.” Illinois Gov. JB Pritzker has said that he expects peaceful protests. “We intend to protect the protesters’ First Amendment rights, and also the residents of the city of Chicago and the visitors to Chicago at the same time,” Pritzker told the AP in a recent interview. __ Associated Press video journalist Melissa Perez Winder contributed to this report. (Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"CHICAGO (AP) — Thousands of activists are expected to converge on Chicago this week for the&#160;Democratic National Convention, hoping to call attention to abortion rights,...","url":"https://whdh.com/news/thousands-of-activists-expected-in-chicago-for-democratic-convention-to-call-for-gaza-ceasefire/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/08/security.jpg?quality=60&strip=color","video":"https://bcbolt446c5271-a.akamaihd.net/media/v1/pmp4/static/clear/4744899807001/2c3b2222-1605-464e-a092-adceef9b5e28/b27cda64-aab9-482b-869e-ac6a7508672e/main.mp4?akamai_token=exp=1724045984~acl=/media/v1/pmp4/static/clear/4744899807001/2c3b2222-1605-464e-","publish_date":"2024-08-18 22:21:11","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.064},{"id":254392216,"title":"Democrats Confronted With Criticism of Kamala Harris' New Economic Plan","text":"Following Vice President Kamala Harris' new economic policy proposal that she recently announced during a campaign rally, several members of the Democratic Party were confronted on Sunday about criticism surrounding her plan.Harris, the presumptive Democratic nominee, took the stage at a rally in the swing state of North Carolina on Friday as she introduced several proposals aimed at bringing down the cost of groceries, the housing market and other essential goods. The vice president's plan includes tax cuts, a federal ban on price gouging by food producers and offering down payment assistance for first-time homebuyers who qualify.\"As president, I will take on the high costs that matter most to most Americans, like the cost of food,\" she said. \"We all know that prices went up during the pandemic when the supply chains shut down and failed. But our supply chains have improved and prices are still too high.\"The economy has become a key issue for voters as Harris and former President Donald Trump, the GOP's nominee, aim to address the issue. Trump, who spoke about his economic proposals at a Wednesday rally in North Carolina, said he would expand his stance on tariffs on foreign countries as he criticized Harris' proposal on Thursday, likening it to \"Maduro-esque price controls\" that have crippled the Venezuelan economy.Trump's response comes as Harris has received criticism for promising to go after price gouging as a way to tackle inflation as economists warned the plan could backfire, and likely does not address the root problems of it.Newsweek has reached out to Harris' campaign via email for comment.In an interview appearance on Sunday on NBC News' Meet The Press, Democratic Michigan Governor Gretchen Whitmer was asked by host Kristen Welker if Harris' plan to ban price gouging is \"anything more than a gimmick?\" a reference to The Washington Post's editorial board's criticism of the plan.According to the Post's opinion column on Friday, it accused Harris of being \"less forthright\" with voters about the reasons why prices remain, adding that Harris \"squandered the moment on populist gimmicks.\"\"I think it speaks to Kamala Harris' values that she wants consumers to keep more money in their pockets...We know we got to have business growth in this country...We also know that you can't gouge and hurt the American consumer to pad your bottom line and I think there is a balance there,\" Whitmer said.Continuing to push, Welker asked, \"So you think it's a smart policy?\"Whitmer responded that she thinks \"any effort we make to keep more money in Americans' pockets is worth walking the path.\"In an interview appearance on CBS News' Face the Nation, Democratic Kentucky Governor Andy Beshear was asked by host Margaret Brennan about if he knows how Harris' plan would work.\"I do because I've been an attorney general just like the vice president...this isn't about trying to price-fix. It's just making sure that the economy is operating the way it should, that this is really supply and demand,\" Beshear said.However, Brennan noted Republican criticisms that accuse Harris of advocating for price controls like in communist countries and asked Beshear to explain \"how you define what an excessive price is if you don't have a benchmark?\"Beshear responded: \"First, these are types of statutes that exist in state law...This has to be evidence-based. Ultimately, you bring an action, and you have to prove it in court. So, you have to have the evidence that this is beyond supply demand—that this is people taking advantage of us.\"In an appearance on CNN's State of the Union, House Minority Leader Hakeem Jeffries doubled down on Democrats' support of Harris' economic plan stating it is a \"very important plan to make sure that we are lowering costs for everyday Americans.\"CNN host Jake Tapper then asked, \"Is it part of the problem when it comes to high prices and inflation, the fact that you and your colleagues on Capitol Hill, along with both President Trump and Biden, infused the economy with perhaps too much cash because of the pandemic?\"In response, Jefferies pointed towards challenges \"inherited\" from the former president, adding that one of those challenges is price gouging.\"It's fair to say that part of the challenge that many everyday Americans have felt is that price gouging is occurring by some bad actors and its reasonable for us to look into how we can stop it from occurring. Harris is simply saying we have to make sure that markets are properly functioning,\" the House minority leader said.Meanwhile, when asked by ABC News' This Week host Martha Raddatz if Democratic Illinois Senator Tammy Duckworth is \"comfortable\" with Harris' economic proposals that could possibly add to the federal deficit, Duckworth said, \"I am comfortable with that because what we need to do is get rid of the Trump tax cuts for the wealthy...This is all about balancing things out.\"Among the biggest policy ideas floated by Trump is the extension of the 2017 Tax Cuts and Jobs Act (TCJA), which is currently due to expire in 2025. When it was first enacted under his presidency in 2017, it created a single flat corporate tax rate of 21 percent.","summary":"\"As president, I will take on the high costs that matter most to most Americans, like the cost of food,\" the vice president said at a recent rally.","url":"https://www.newsweek.com/democrats-confronted-criticism-kamala-harris-new-economic-plan-1940894","image":"https://d.newsweek.com/en/full/2452337/kamala-harris.jpg","video":null,"publish_date":"2024-08-18 22:16:16","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.379},{"id":254391860,"title":"Donald Trump Gets Some Good Signs From New Poll Amid Kamala Harris Surge","text":"Former President Donald Trump received some good news in a poll released on Sunday, as national aggregate and battleground state surveys have largely favored Vice President Kamala Harris in recent days.A CBS News/YouGov poll of 3,258 registered voters conducted from August 14 to 16, with a margin of error of plus or minus 2.1 percentage points, shows a very tight presidential race between Trump, the GOP's presidential nominee, and Harris, with Trump leading among people who believe the economy, inflation, and the U.S.-Mexico border are major factors in their voting decision.It comes nearly a month after Harris has joined the presidential race following President Joe Biden's exit from the campaign trail and endorsement of her on July 21. She is set to officially accept the party's nomination on Thursday, the final night of the Democratic National Convention (DNC).Newsweek has reached out to the Trump campaign for comment via email on Sunday.Battleground StatesThe CBS News/YouGov poll puts Trump and Harris in a complete deadlock in battleground states—Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania, and Wisconsin—with both candidates maintaining 50 percent of the vote.Battleground states play a key role in the presidential race, and polls from these states are often considered more telling than national averages, as the popular vote does not guarantee the White House. To become president, a candidate must secure 270 Electoral College votes, and battleground states can swing the election to either candidate.Updates to CBS News' statistic model from the poll, which has a margin of error of plus or minus 4 percentage points, show the candidates completely tied at 50 percent in Pennsylvania and 49 percent in Wisconsin.It shows Trump leading by a margin of 1 percentage point in Arizona, 50 percent to Harris' 49 percent, and 2 percentage points in Georgia and North Carolina, 50 percent to 48 percent.On the other hand, the model shows Harris leading in Nebraska, 50 percent to Trump's 47 percent, Nevada with 50 percent to Trump's 48 percent, and Michigan by 49 percent to 48 percent.A recent New York Times/Siena College poll of likely voters in battleground states shows Harris leading Trump in North Carolina and Arizona, while Trump holds a lead over Harris in Nevada and Georgia. In a survey of 655 likely voters in North Carolina conducted between August 9 and 14, it showed Harris leading Trump 49 to 47 percent. The margin of error is plus or minus 4.2 percentage points in this state poll.In Arizona, among 677 likely voters from August 8 to 15, Harris garnered 50 percent of the vote to Trump's 45 percent. The margin of error is plus or minus 4.1 percentage points in the Arizona state poll.In Nevada, Trump edged ahead by 1 percentage point among 661 likely voters from August 9 to 14, leading Harris 48 to 47 percent. The state poll had a margin of error of plus or minus 4.2 percentage points.Trump had the greatest margin in Georgia, with a poll of 661 likely voters found 50 percent would vote for Trump and 46 percent for Harris. The poll, conducted between August 9 and 14 has a margin of error of plus or minus 4.1 percentage points.The Trump campaign issued a press memo in response to the Times/Siena College poll, which said its \"once again, a perfect example of how wildly inaccurate recalled 2020 vote between President Trump and Joe Biden is being used to create a phony lead for Kamala Harris.\"Economy and InflationThe CBS News poll shows that 83 percent of voters consider the economy a \"major factor\" in their decision-making for the upcoming election, with inflation as the second most popular, at 76 percent. Voters can identify multiple issues as major factors in their voting decision.When ask if voters thought \"the price you pay for food and groceries\" will change under Harris or Trump, 48 percent said they will go up under Harris, whereas 37 percent said they would increase under Trump. The poll was largely conducted before Harris outlined her economic plan to ban price-gouging on groceries during a campaign speech Friday.More than half of the voters believe that Harris' decision as vice president have impacted the economy in some way, with 24 percent indicating \"a lot\" and 33 percent \"some.\"Among those voting for Trump, 56 percent selected the economy as a major factor, and 61 percent said inflation.Immigration and the Southern BorderVoters overwhelmingly believe Trump is more likely to reduce border crossings compared to Harris if reelected as president. When asked if their policies would increase border crossings, 48 percent of voters said they expect an increase if Harris wins, while 8 percent said the same for Trump. Conversely, 72 percent believe Trump would decrease border crossings if elected, while 21 percent think Harris would.Nearly a third of voters believe that Harris had \"a lot\" to do with the current border situation, while 28 percent believe she had some impact.Among survey respondents who plan to vote for Trump, 76 percent consider the U.S.-Mexico border a major factor in their decision. In contrast, only 24 percent of those who said they would vote for Harris view it as a major factor.Polling AveragesNationally, the CBS News poll showed Harris leading Trump among likely voters, 51 to 48 percent.Several other national polls have put Harris in the lead, while a survey released Thursday by conservative pollster Rasmussen Reports shows Trump leading Harris by 4 percentage points among likely voters, 49 to 45 percent.The Rasmussen Reports survey of 1,885 likely voters was conducted on August 8 and between August 11 and 14. It has a margin of error of plus or minus 2 percentage points.As of Sunday, several national aggregate polls have also placed Harris in the lead, including FiveThirtyEight, RealClearPolitics, The New York Times, and The Hill, with margins ranging from 1 to 2.6 percentage points.Battleground state aggregators have also inched towards Harris, with the Times aggregate polls showing Harris only behind in Georgia and tied in Arizona, otherwise leading Trump.Nate Silver's Silver Bulletin aggregate puts Harris ahead in Arizona but slipping behind Trump in Nevada and Georgia.","summary":"A poll released on Sunday shows that Trump leads among voters who believe the economy and the U.S.-Mexico border are major factors in their voting decision.","url":"https://www.newsweek.com/donald-trump-good-signs-new-poll-amid-kamala-harris-surge-1940880","image":"https://d.newsweek.com/en/full/2452328/donald-trump.jpg","video":null,"publish_date":"2024-08-18 22:09:49","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.129},{"id":254391822,"title":"Trump supporters gather in Woodstock, Illinois before Chicago DNC 2024","text":"WOODSTOCK, Ill. (WLS) — While Democrats are preparing for their convention in Chicago, many Republicans are gathering in the northwest suburbs. They’re taking part in a pro-Trump rally, which is underway Sunday afternoon. ABC7 Chicago is now streaming 24/7. Click here to watch It is a day-long rally event being held by Donald Trump supporters in Woodstock. Hundreds filled the McHenry County Fairgrounds in Woodstock, rallying in support of the former president on the eve of the Democratic National Convention. “They’re having their party downtown. We’re having our party here,” rally organizer Tom Meredith said. The timing is no coincidence. It was set to show that their candidate also has strong support in the Chicago area as thousands of people are converging in Chicago for this week’s DNC. DNC LIVE BLOG | Chicago DNC 2024: Live updates on street closures, security, parking, protests and more The Illinois GOP is seeking to strengthen the backing for their down-ballot candidates in a state where the top of the ticket is not in play. It’s going to be an opportunity to share what our vision is, and I think we’re going to provide a better vision,” Illinois Republican Party Co-Chairman Aaron Del Marco said. Among those in attendance was Project Hood’s Pastor Corey Brooks, who was also on stage at the Republican National Convention in Milwaukee last month. “Today is the alternative to a lot of the things that are going on in the City of Chicago,” Brooks said. “It’s our opportunity to stand up for the principles and policies that we believe will make America better.” While McHenry County is reliably Republican, the margins in recent years have gotten tighter. In 2020, Trump won the popular vote there by only two percentage points. That is why those in attendance Sunday kept highlighting the need to get out the vote, not just in the county, but also across the state. “We have to show the flag,” said Val Ojeda with the Hispanic Coalition for Trump. “We have to show the Democrats we’re not playing around. We’re going to hold them accountable… If you don’t vote, you don’t matter. You have to get out and vote.” While the DNC will garner most of the attention this week in Chicago, Illinois GOP officials told ABC7 they will be raising their voices each day as well as they continue to campaign not just for Donald Trump, but for all of their down-ballot Republican candidates as well.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWOODSTOCK, Ill. (WLS) &#8212; While Democrats are preparing for their convention in&#8230;\n\n\nThis Post: Trump supporters gather in Woodstock, Illinois before Chicago DNC 2024 first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-supporters-gather-in-woodstock-illinois-before-chicago-dnc-2024/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-08-18 21:54:50","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.069},{"id":254392888,"title":"JD Vance Compares Kamala Harris to Jeffrey Epstein in Inflation Policy Attack | Video","text":"J.D. Vance came out swinging against Kamala Harris on Sunday. While speaking with Fox News’ Shannon Bream, the Republican vice presidential candidate insisted, “Giving Kamala Harris control over inflation policy, Shannon, it’s like giving Jeffrey Epstein control over human trafficking policy. The American people are much smarter than that.” “They don’t buy the idea that Kamala Harris represents a fresh start,” he continued. “She is more of the same. It is doubling down on the failed policies of the Harris administration to give Kamala Harris a promotion rather than to fire her, which is what I think most Americans are going to do in November.” The Trump-Vance campaign featured scrutiny recently for using Epstein’s former plane, which many used as an occasion to bring up Trump’s own connections with the notorious sex trafficker while Epstein was still alive. Vance had attempted to blame the vice president for domestic inflation and added that she hasn’t done anything about the problem “for the past 1,300 days.” His reference to “the failed policies of the Harris administration” appeared to be an attempt to implicate her in any perceived failures of the sitting president, Joe Biden, despite the vice president traditionally not being in a position to exert a significant amount of power. The GOP vice presidential candidate also insisted that the Trump/Vance ticket is “going to be in the right place come November” and that they are unbothered by poll numbers showing Harris and Minnesota Gov. Tim Walz surging ahead. “We can’t worry about polls, we have to run through the finish line and encourage everybody to get out there and vote. But our message is going to be very simple: If you wanna get back to the peace and prosperity, the rising take-home pay, Donald Trump delivered it once and he can do it again,” Vance argued. Trump inherited a better economy from his predecessor, President Barack Obama, than Biden did from Trump himself. It’s also true that Trump was at the helm of the United States during the first months of the COVID-19 pandemic, causing serious struggles for the U.S. economy. Trump claimed that following those months, the economic recovery experienced by the U.S. was “the biggest in the history of our country by almost triple…that’s bigger than any nation” — a statement that proved false when the nation’s recovery was compared to that of the Eurozone as a whole, as well as to Italy and Germany’s own recovery efforts. Vance also accused “the media” of using “fake polls to drive down Republican turnout and to create dissension and conflict with Republican voters.” He added, “I’m telling you, every single person who’s watching this, the Trump campaign is in a very, very good spot.” It is unclear which if any specific “fake polls” Vance was speaking about, but he seemed to be repeating a claim Trump made repeatedly while running against Hillary Clinton in 2016. In 2018, a study out of Ohio State University stated that “fake news” may have helped Trump win that election. The study, which was not peer-reviewed, concluded that 4% of Obama’s supporters from the 2012 election did not vote for Clinton due to misinformation they had read. Those voters “were 3.9 times more likely to defect from the Democratic ticket in 2016 than those who believed none of these false claims, after taking into account all of these other factors,” researchers wrote. You can watch the interview with J.D. Vance in the video above.","summary":"He says the vice president has done little to address the American economy \"for the past 1,300 days\" as VP\n\n\nThe post JD Vance Compares Kamala Harris to Jeffrey Epstein in Inflation Policy Attack | Video appeared first on TheWrap.","url":"https://www.thewrap.com/jd-vance-compares-kamala-harris-to-jeffrey-epstein/","image":"https://www.thewrap.com/wp-content/uploads/2024/08/vance-harris-economy.jpg","video":null,"publish_date":"2024-08-18 21:46:29","author":"Stephanie Kaloi","authors":["Stephanie Kaloi"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.106},{"id":254391390,"title":"Trumpworld’s DNC counter-programming plans revealed","text":"Republicans will join the swathes of Democrats descending on Chicago this week as Trumpworld tries to find a way to blunt Kamala Harris's momentum. As the four-day Democratic National Convention gets under way in the Windy City, Donald Trump and his allies are making plans for counter-programming to the event. Trump's Chicago hotel will become the epicenter of the Republican world as his allies including Florida Senator Rick Scott and his colleague in the House, Byron Donalds, are among those who will lead the GOP's efforts to counter-program the convention. Themes of the four-day event at the Trump hotel will include immigration, crime and the economy, and will mirror issues being spoken about at the DNC in order to drive home the Republican party’s message. Trump campaign spokespeople Susie Wiles and Chris LaCivita issued a statement on Sunday: “At the DNC, Kamala Harris will hide behind celebrities because everyday families know that she has been an absolute disaster for our nation, and real Americans are worse off now than four years ago. “Harris has failed to answer media questions for 28 days because she can’t explain away her record of supporting policies that cause inflation, bans on private health insurance, destroying American energy, and higher taxes.” They went on to note that Trump and running mate JD Vance will host rallies and smaller “messaging events” around the country as Democrats are concentrated in Chicago. Trump’s schedule for the week is more packed than it has been in months, with events featuring him and Vance every day. He’ll cap off the week Friday with events in Arizona and Nevada. “As they meet Americans where they are in battleground states across the country, President Trump and Senator Vance will remind voters that under their leadership, we can end inflation, protect our communities from violent criminals, secure the border, and Make America Great Again,” said LaCivita and Wiles. The Independent has reached out to the DNC for a response. It’s an attempt by the former president to push Harris out of the spotlight as her party’s convention is set to be a four-day cheerleading session highlighting Democratic victories over the past three years while also portraying Trump himself as a threat to democracy and abortion rights. Since Biden dropped out of the race, Democrats have seen a surge in volunteers. Harris’s campaign raised a staggering $310m in July despite Biden being the nominee for much of the month; Trump’s, by comparison, raised $139m in the same period. The former president has watched and appeared to grow increasingly annoyed as Harris has rebounded in the polls since entering the race, putting swing states back into close contention and throwing Republicans onto the defense. Another bump in the polls caused by the DNC, should it go unanswered by Republicans, could put Harris at an advantage in those key battleground states. The former president shook up his campaign last week and brought onboard 2016 campaign manager Corey Lewandowski in a senior advisory role reportedly above his de facto campaign managers Wiles and LaCivita, amid reports that Trump is nostalgic for his lean but winning 2016 operation.","summary":"Republicans are convening at Trump’s hotel in Chicago for events highlighting border security issues, inflation and crime – while Kamala Harris takes center stage at the DNC","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-dnc-events-vance-b2598146.html","image":"https://static.independent.co.uk/2024/08/18/22/GettyImages-2166903102.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/UxKpHD1v-OhrQWqOm.mp4","publish_date":"2024-08-18 21:43:02","author":"John Bowden","authors":["John Bowden"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.155},{"id":254392822,"title":"Democrats are dwindling in Wyoming. A primary election law further reduces their influence.","text":"In some far reaches of rural America, Democrats are flirting with extinction. In Niobrara County, Wyoming, the least-populated county in the least-populated state, Becky Blackburn is one of just 32 left. Her neighbors call her “the crazy Democrat,” although it’s more a term of endearment than derision. Some less populated counties have fewer. There are 21 Democrats in Clark County, Idaho, and 20 in Blaine County, Nebraska. But Niobrara County’s Democrats, who account for just 2.6% of registered voters, are the most outnumbered by Republicans in the 30 states that track local party affiliation, according to Associated Press election data. In Wyoming, the state that has voted for Donald Trump by a wider margin than any other, overwhelming Republican dominance may be even more cemented-in now that the state has passed a law that makes changing party affiliation much more difficult. Tuesday’s primary will be the first election since the law took effect. In Niobrara County’s grassy rangelands and pine-spattered hills adjoining Nebraska and South Dakota, it’s not easy being blue. A paralegal for the Republican county attorney, Blackburn hears a lot of right-wing views around town. “Normally I just roll my eyes and walk away because I’m fighting a losing battle and I’m fully aware of that,” she said. “Maybe that is why I’m well-liked, because I keep my mouth shut 10 times more than I want to.” Not that she’s politically shy. She flies an LGBTQ+ flag in support of her lesbian daughter at her house in Lusk, a ranching town of 1,500 and the Niobrara County seat. In political season, Blackburn stocks up on Democratic political signs to replace those that get swiped. She speaks approvingly of policing reform, taxation for government services and the transgender social media celebrity Dylan Mulvaney. Maybe because she’s open about those views — and far too outnumbered to put them into action — Blackburn really does seem well-liked in Lusk, where she recently served nine years on the Town Council. “I won two elections here. Even though that’s nonpartisan, people still knew I had left-leaning values,” she said. Nationwide, Democrats account for fewer than 3% of voters in three counties this year, up from one county in 2020 but down from seven in 2016. There were none with such a low percentage of Democratic registrations in the presidential election years of 2012, 2008 and 2004, according to the AP data. The most Republican counties in recent years are concentrated in Idaho, Utah and Wyoming. The most Democratic areas, meanwhile, are much less one-party-dominant. The District of Columbia, where 77% of voters are Democrats, ranks second for Democratic dominance. First is Breathitt County, Kentucky, which through tradition is 79% Democratic but not to the core. Republican vice-presidential candidate JD Vance has family there and in 2020 the county went 75% for former President Donald Trump. Niobrara County was not always quite so Republican. It had more than twice as many Democrats, 83, in 2012, and in 2004 there were more than four times as many, 139. The Democrats’ struggle in Wyoming mirrors the party’s challenges across rural America, where the party has been losing ground for years. It wasn’t always this way. Seventy years ago, Democrats were a political force across southern Wyoming, where union mining and railroad jobs were abundant. Now, the party’s only strongholds are in the university town of Laramie and resort town of Jackson. Meanwhile, as Wyoming Democrats face difficulty fielding viable candidates at all levels, many Democrats have been switching their registration to vote in more competitive Republican primaries, then changing back for the general election. “You feel skeevy and dirty when you do it. But you do it anyway and you change it back as soon as you can, because you don’t want to start getting the Republican mailings,” Blackburn said. Republicans decided they’d had enough. The Wyoming Legislature, where the GOP controls over 90% of the seats, passed legislation last year banning voters from changing their party registration in the three months before the August primary. Party-switching had “undermined the sanctity of Wyoming’s primary process,” Wyoming’s Republican secretary of state, Chuck Gray, said in a statement of approval. Wyoming’s Republican and Democratic primaries on Tuesday will be the first in modern memory where voters won’t be able to change party affiliation at the polls. For Democrats, it will be slim pickings. Statewide, obscure candidates who have done little campaigning are unopposed for the Democratic nomination for U.S. House and Senate. In Niobrara County, no Democrats are running. They aren’t contesting a seat in the Wyoming House of Representatives or an open seat on the county commission, the two major races, or even running for local party positions. Yet the area had a Democratic state representative not too long ago: Ross Diercks, who is recognized and warmly greeted at the Outpost Cafe, a homey breakfast and lunch spot in Lusk. A former middle school English teacher, Diercks was a Republican before deciding the GOP didn’t do enough to support public education. He beat a Republican incumbent in 1992 to launch an 18-year run in the Legislature. Knowing voters personally and keeping up on issues helped him hold office. When he got a C-minus on a National Rifle Association questionnaire, for example, he resolved to improve. For subsequent elections, he scored A’s on the survey. Many Republican lawmakers are friends. When one from just down the road died, he sang at his funeral. Then in 2022, Diercks temporarily switched parties to vote in the GOP primary against Harriet Hageman, who was challenging then-Rep. Liz Cheney for the state’s lone House seat. How many other Democrats did the same is hard to count, but Diercks was far from alone. Hageman, the daughter of the lawmaker he sang for at his funeral, nonetheless won the race by a wide margin. The new law keeping Diercks and others from switching their registration so easily has him exasperated with the GOP. “How far are they going to go to limit one’s ability to vote? If it really comes down to purifying the party, on a voting level all the way up to the elected officials, pretty soon there isn’t going to be anyone left who’s pure enough to be in the party,” Diercks said. Truck driver Pat Jordan supports many left-leaning goals, including universal healthcare, but said he only registers as a Republican. “The best way to participate in meaningful change is to try to sway the dominant party,” said Jordan, who lives in Niobrara County. “You know, we need to have a government that serves the people, all of them, not just Republicans and not just rural and not just urban and not just Democrats — and definitely not just the rich and the wealthy.” Last winter, dozens of locals gathered outside to honk and cheer as one Democrat left town. But they weren’t cheering as Ed Fullmer was headed off for good. Fullmer was on the high school boys basketball team bus as they left for the state championship. They lost, but Fullmer coached the Tigers to their best record in a decade, 20-8. He said people know his views but rarely put him on the spot about politics. “Most people don’t want to dive into those type of discussions,” he said. “They respect you for what you do, how you work.” Blackburn, for one, intends to hold her political ground, even as it shrinks around her. “I am who I am, and I have the views that I have,” she said. “And I don’t care if it bothers people or not.”","summary":"In some far reaches of rural America, Democrats are flirting with extinction, with the most Republican counties concentrated in Idaho, Utah and Wyoming.","url":"https://www.nbcnews.com/politics/politics-news/democrats-are-dwindling-wyoming-primary-election-law-reduces-influence-rcna167088","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-08/240818-democrats-dwindling-wyoming-wm-233p-21760e.jpg","video":null,"publish_date":"2024-08-18 21:39:13","author":"The Associated Press","authors":["The Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.115},{"id":254390720,"title":"Rep. Turner says Iran could be a nuclear weapons state \"by the end of the year\"","text":"Washington — Rep. Mike Turner, the chairman of the House Intelligence Committee, said Sunday that Iran could declare itself a nuclear weapons state \"by the end of the year,\" blaming Biden administration policies for what would mark a major escalation that the U.S. has sought for years to avoid. \"What we see now with this administration, [Iran] might declare themselves a nuclear weapons state by the end of this year, with the reports have been- news reports have been out stating that there is a possibility,\" Turner said Sunday on \"Face the Nation with Margaret Brennan.\" Brennan asked him if Iran's \"Supreme Leader has changed his conclusion\" on the country's nuclear capability.\"There is a possibility, with the advances that have been made under the Biden administration's policy, that Iran could, reports are out, that Iran could declare itself a nuclear weapon state by the end of the year, if- and you would not have had that,\" Turner said.\"But that conclusion hasn't been made, has it?\" Brennan asked. \"No,\" Turner answered.The comments came as Turner, an Ohio Republican, defended recent remarks by former President Donald Trump, who said in recent days that he's \"not looking to be bad to Iran\" and that the U.S. would be \"friendly\" to the country. The former president noted that \"they can't have a nuclear weapon, and we were all set to make sure that they don't have a nuclear weapon,\" because once they do, he said \"it's a whole different world.\" The former president pulled the U.S. out of the Obama-era Iran nuclear deal in 2018 after arguing that the deal — a multi-nation effort to keep Iran's nuclear program at bay — allowed Iran to amass nuclear weapons. President Biden sought to revive parts of the deal during his first two years in office but was unsuccessful. Turner said Trump is \"anti-Iran,\" while arguing that acknowledging the strengths of one's adversaries is \"not having weakness on your own part.\" He added that \"Donald Trump, with the maximum pressure campaign on Iran, put the most pressure on Iran that they have had in any administration — both economically, militarily.\"\"They were on the ropes,\" Turner said of Iran. \"What we see now with this administration… they might declare themselves a nuclear weapons state by the end of this year.\"Turner said that possibility would not have occurred under the Trump administration's \"maximum pressure campaign,\" saying the \"flexibility and freedom that they've had under the Biden administration has given them the ability to both try to influence our elections, actively try to undertake a plot to assessing Donald Trump, and to continue their nuclear weapons and their nuclear enrichment programs.\"Federal investigators have been looking into whether Iranian hackers targeted individuals associated with the Trump and Biden-Harris campaigns, CBS News has learned after the Trump campaign said it had been hacked earlier this month and suggested Iranian actors were involved. Earlier this year, U.S. intelligence also detected an Iranian plot against Trump.Turner said the Biden administration \"on the hacking side, on the misinformation side, and on the alleged attempt on Donald Trump's life is not holding Iran accountable.\"\"There is not a response that impacts Iran or that has a deterrent effect, or holds them accountable,\" Turner added. \"And that, of course, results in increased activity and increased emboldening of Iran to meddle in our elections, and to, I think, you know, have people at risk in our country.\"","summary":"Rep. Mike Turner, chairman of the House Intelligence Committee, said Iran could declare itself a nuclear weapons state \"by the end of the year.\"","url":"https://www.cbsnews.com/news/mike-turner-house-intelligence-committee-iran-nuclear-weapons-state-face-the-nation/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/18/3d8fb8d6-ea11-4458-9fe8-fe6931f7761b/thumbnail/1200x630/7a9d13807a1303bb1952b651430f04da/1723995430065.png?v=d8f7565ef3e8b72561ee316b5993cbf9","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3129585_hls/master.m3u8","publish_date":"2024-08-18 21:37:44","author":"Kaia Hubbard","authors":["Kaia Hubbard"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.256},{"id":254390480,"title":"Trump’s strategy on climate? Amplify myths about Harris","text":"An unrelentingly bitter US presidential race, defined by name-calling, attack ads and stunted campaigning, has so far left little space for discussion about climate change, despite the world experiencing unprecedented heat and disasters. But with Donald Trump now facing Kamala Harris rather than Joe Biden, the Republican has used recent rallies to echo misinformation and memes on X, including fictional bans on red meat and gas stoves. The aim? To undermine Harris. “Kamala called for slashing consumption of red meat to fight climate change,” Trump said during a July 27 rally in the state of Minnesota. The Democratic nominee would “get rid of all cows … and I guess that at some point, they’ll go after the humans,” the former president added, echoing “depopulation” conspiracy theories that have plagued Harris in right-wing spaces since she waded into the topic of “climate anxiety” among younger generations at a White House press conference last year. J.D. Vance, Trump’s running mate, amplified the claims in an August 3 speech in Atlanta, saying Harris “wants to take away your gas stoves, she even wants to take away your ability to eat red meat.” Such climate myths took on a life of their own on X, encouraged by conservative commentators in swing states and MAGA accounts with hundreds of thousands of followers. However, Harris made no such campaign promise. She has cooked with a gas stove herself and noted in a 2019 environmental panel that she “love(s) cheeseburgers from time to time,” although she has supported the idea of updating dietary guidelines. “A tried-and-true tactic in politics is to misrepresent your opponent’s positions to make them sound extreme and unacceptable. Trump and Vance are doing exactly that with Vice President Harris’s positions on climate action,” said Edward Maibach, director of George Mason University’s Center for Climate Change Communication. The false narratives add onto Trump and Vance’s criticism of the vice president’s stance on issues such as fracking, a violently disruptive underground oil and gas extraction technique. Harris initially advocated banning the practice in 2019 before becoming Biden’s running mate in 2020. She has more recently sought to avoid questions about it, particularly in the crucial swing state of Pennsylvania where fracking is big business. Still, climate activists have mostly saluted Harris, whose environmental stance has historically been to the left of the president — notably in going after oil companies as California attorney general. The Biden administration also pushed a renewable energy shift in passing the Inflation Reduction Act, the largest investment in reducing carbon pollution in US history.","summary":"An unrelentingly bitter US presidential race, defined by name-calling, attack ads and stunted campaigning, has so far left little space for discussion about climate change, despite the world experiencing unprecedented heat and disasters. But with Donald Trump now facing Kamala Harris rather than Joe Biden, the Republican has used recent rallies to echo misinformation and [&#8230;]","url":"https://dailytimes.com.pk/1218567/trumps-strategy-on-climate-amplify-myths-about-harris/","image":null,"video":null,"publish_date":"2024-08-18 21:34:12","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","catgory":"politics","source_country":"pk","sentiment":0.026},{"id":254392064,"title":"Harris and Walz rally volunteers on Pennsylvania bus tour before DNC in Chicago","text":"Democratic presidential nominee Kamala Harris and running mate Tim Walz embarked on a bus tour in southwestern Pennsylvania on Sunday, hoping to ride a wave of enthusiasm for her candidacy to their party's nominating convention in Chicago this week. Vice President Harris and Walz, the governor of Minnesota, were joined by their spouses, Doug Emhoff and Gwen Walz, as they made their first stop visiting local volunteers making phone calls at a campaign office in the borough of Rochester, in Beaver County. Donald Trump, the Republican presidential nominee, won the county in 2020. But the Democrats are riding on renewed enthusiasm after President Joe Biden exactly four weeks ago dropped his reelection bid and endorsed Harris to replace him on the ticket. Harris, while speaking to a group of supporters and volunteers outside the campaign office, spoke about strength and leadership. She appeared to make a veiled reference to Trump, who is known for his pugilistic style and projection of a strongman image, when she said the “real and true measure of a strength of a leader is based on who you lift up,\" rather than who they beat down. “Anybody who is about beating down other people is a coward,” she yelled, drawing cheers and applause. “This is what strength looks like.” Walz in his remarks seemed to assume the role of his former job coaching high school football and told the volunteers: “Let’s leave it all on the field. Let’s get this thing done.” Southwestern Pennsylvania is a critical part of a key battleground state that has long commanded the attention of presidential candidates. The state voted for Trump in 2016 and for Biden in 2020. Both Harris and Trump are vying to see who can put Pennsylvania in their column on Nov. 5. Most polls, including from the New York Times/Siena College and Fox News, find Harris and Trump locked in a tight race statewide. Trump held a rally Saturday in Wilkes-Barre in the northeastern part of the state, following his earlier rallies in July in Harrisburg and Butler, where he survived an assassination attempt. The bus tour marks Harris' eighth trip to Pennsylvania this year, and her second this month. The vice president chose to make her first joint appearance with Walz on the ticket in Philadelphia on Aug. 6. On Sunday, they arrived with their spouses earlier at Pittsburgh International Airport and greeted supporters. The foursome held hands and raised their arms together before cheering supporters who held campaign signs. They then boarded a bright blue bus that says “Harris Walz” in big white letters as they set off to make stops in the Pittsburgh area to glad-hand with voters. In Rochester, Harris, Walz and their spouses spent a few minutes sitting at tables with volunteers and making phone calls to line up support. “79 days to go, Hannah,” Harris said while on the phone. At another point while making calls, she said, “We’re all in this together.” Walz hung up his phone and said of the caller, “He’s all in,” and gave a thumbs up. He made another call and asked the person on the line, “How are you feeling? What are you hearing from folks?” Kristin Kanthak, associate professor of political science at the University of Pittsburgh, said Pennsylvania “is a state that traditionally has been super important, but southwestern Pennsylvania has been really kind of the battleground part of the battleground state.” Allegheny County, which includes Pittsburgh, is a diverse county with urban, suburban and rural areas, and a lot of people there haven't decided how they will vote, she said. “It makes sense to come here and ask for votes because there are votes up for grabs here,” Kanthak said of Harris. “It’s not just about turning out your base. It’s about having an opportunity to speak to truly undecided voters.” In the 2020 race, Biden won Allegheny County with 60% of the vote, while Trump won neighboring Beaver County, which includes Rochester, with about 58% of the vote. After Trump’s surprise win in the state in 2016, Biden flipped Pennsylvania in 2020 — and, in so doing, won the White House — in part by running up his vote totals in heavily Democratic Pittsburgh, the state’s second-largest city and the county seat of Allegheny County. Biden assiduously courted the area’s blue-collar labor unions, kicking off his 2020 presidential campaign at a Teamsters hall in Pittsburgh by declaring, “I am a union man.” As president, he opposed the acquisition of Pittsburgh’s storied U.S. Steel by a Japanese company, saying it “should remain totally American,” and enacted steeper tariffs on Chinese steel. Trump, who is counting on strong turnout from his base of white, working-class voters, is not conceding the area. The counties around Pittsburgh have shifted from Democrat to Republican in recent presidential contests, delivering for Trump in both of his earlier runs. Trump has also embraced protectionist trade policies and insists he is pro-worker. His vow to increase U.S. energy production and “drill, baby, drill” has resonated in southwestern Pennsylvania blue-collar counties like Washington, where a natural gas drilling boom has helped make Pennsylvania the nation’s No. 2 producer after Texas. Harris once wanted to ban fracking, an oil and gas extraction process, before recently disavowing her earlier position. Dana Brown, director of Chatham University's Pennsylvania Center for Women & Politics, said in an interview that Harris will use the bus trip to spin up local media coverage as well as reach out to voters in the state's southwestern region “while she still has a great deal of momentum at her back.\" “She is going to garner a lot of that free media attention,” Brown said. “I believe their hope ... is to keep that momentum up and focused on her and less so on her opponent.” Bus tours have become a staple of political campaigns partly because of the free media coverage they generate. Such trips get the candidates out of their power suits and out of Washington so they can travel the country and score face time with voters in small venues like diners and mom-and-pop shops. Biden rolled across Iowa on an eight-day bus tour he dubbed “No Malarkey\" in December 2019. During his 2012 reelection campaign, President Barack Obama traveled though small-town Ohio on his “Betting on America” bus tour. “It's always fun just being out of Washington, and for me to be able to interact with folks is wonderful,” Obama said at one stop. Presidents George W. Bush and Bill Clinton also traveled by bus when they campaigned for a second term. The Democratic National Convention opens Monday. © Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Democratic presidential nominee Kamala Harris and running mate Tim Walz embarked on a bus tour in southwestern Pennsylvania on Sunday, hoping to ride a wave of enthusiasm for…","url":"https://japantoday.com/category/world/harris-and-walz-will-campaign-by-bus-in-pennsylvania-before-the-democratic-convention-in-chicago","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/93/96/e4ae5c09ffee0abc145a49b9044bb447ed38/download/_w1700.jpg","video":null,"publish_date":"2024-08-18 21:17:46","author":"Darlene Superville,Japan Today Editor","authors":["Darlene Superville","Japan Today Editor"],"language":"en","source_country":"jp","sentiment":-0.015},{"id":254390892,"title":"Melania Trump's ex-bestie hits out at her, calls 'unpatriotic' for this reason","text":"Melania Trump's former friend, Stephanie Winston Wolkoff, who authored the New York Times bestseller Melania and Me: The Rise and Fall of My Friendship with the First Lady alleged that Donald Trump's wife was selling ornaments bearing resemblance to the Presidential Medal of Freedom -- on her site. Stephanie posted photo of the memorabilia on sale on Melania's site and claimed that the former First Lady altered the image of the Medal of Freedom. \"The tension between legality and morality is where Melania Trump toes the line. FLOTUS of the USA altered the image of The Medal of Freedom to monetize from it for personal gain. It’s an exploitation of a national symbol & disrespects its symbolic meaning. It’s unpatriotic,\" Stephanie wrote.— SWinstonWolkoff (@SWinstonWolkoff) \"WOW! Appears Melania Trump likes the Medal of Freedom so much too that she’s selling Collectibles & Christmas Ornaments that sure do look like they were ‘inspired’ by the real thing,\" Stephanie wrote in another post. The allegations came at a time Melania is missing from the public eye while her husband is running the presidential campaign against Kamala Harris. Stephanie used to work at Vogue and started organizing Met Galas. They developed a remarkable friendship with regular monthly lunches and other events but eventually the fell apart and Stephanie published the book in 2020 as Trump lost the election. Stephanie and Melania became friends when Donald Trump asked Vogue's Anna Wintour to help Melania introduce to New York society -- before their Marriage. Melania was presented at the 2004 Met Gala and their friendship continued as Melania got married to Donald, became mother to Barron. As Donald Trump became the president, Stephanie joined Melania's team as a senior advisor to the first lady. In her tell-all book, she exposed Melania and Trump's marriage as sham and said that the relationship was created by the TV executives for Donald Trump's The Apprentice. After Stephanie and Melania's public fallout, Trump said Stephanie was a \"total airhead\" who was dumped by Melania years ago for being a publicity seeker. \"I find it baffling & shocking Trump hired 'an airhead' to produce 18 Trump inaugural events acting as Melania's senior advisor....'Airhead,' I'm not. Melania didn't have the chance to 'dump me.' I QUIT! (And have the letter to prove it!)\" Stephanie hit back.","summary":"Melania Trump's former friend, Stephanie Winston Wolkoff, who authored the New York Times bestseller Melania and Me: The Rise and Fall of My Friendship with the First Lady alleged that Donald Trump's wife was selling ornaments bearing resemblance to the Presidential Medal of Freedom -- on her site. Stephanie posted photo of the memorabilia on sale on Melania's site and claimed that the former First Lady altered the image of the Medal of Freedom.","url":"https://timesofindia.indiatimes.com/world/us/melania-trumps-ex-bestie-hits-out-at-her-calls-unpatriotic-for-this-reason/articleshow/112612746.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112612755/112612755.jpg","video":null,"publish_date":"2024-08-18 21:15:50","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.165},{"id":254390250,"title":"Kamala Harris leads Donald Trump overall, but not on handling of the economy: POLL","text":"Vice President Kamala Harris heads into her nominating convention this week leading former President Donald Trump in a head-to-head matchup, bolstered by vast improvements over President Joe Biden in enthusiasm and perceived readiness for the job and sharply better support among key groups including swing-voting independents, according to a new latest ABC News/Washington Post/Ipsos poll. Yet Trump retains the upper hand on the two top-cited election issues in the poll -- the overall economy and inflation -- and also leads on a third -- immigration -- keeping the race a closely contested one. Among all adults -- relevant since there's plenty of time to register -- Harris and Gov. Tim Walz lead Trump and Sen. JD Vance by 50%-45%. Among those now registered to vote, it's 49%-45%, a slight Harris advantage given sampling tolerances. And Harris has a 6-point lead among likely voters, 51%-45%. Roughly echoing these results, this poll, produced for ABC by Langer Research Associates with fieldwork by Ipsos, also finds that more people see Harris as qualified for the job, 53%, than say the same about Trump, 47%. See PDF for full results. In a five-way matchup, the poll finds Harris/Walz and Trump/Vance at 47%-44% among the general public and registered voters alike, and 49%-45% among likely voters. None of these is a statistically significant difference, suggesting the Democrats would prefer a two-way race. That said, among all adults, support for Robert F. Kennedy Jr. (and his running mate Nicole Shanahan) is down to 5%, from a peak of 12% in April. Cornel West/Melina Abdullah have 1%, as does Jill Stein of the Green Party. These candidates' ballot access is to be determined; per ABC News estimates, Kennedy currently is on the ballot in 21 states, Stein in 20 and West in eight. Candidate attributes Underlying shifts from July are dramatic, particularly in views of some candidate attributes. There also are sharp increases in Democrats' satisfaction with the presidential matchup and enthusiasm for their candidate. Among all adults, Harris leads on two measures on which Biden lagged badly. Americans by a wide 56%-26% pick her over Trump as having the physical health to serve effectively as president, reversing Trump's 31-point lead over Biden on this attribute last month. And Harris leads Trump by 9 percentage points in being seen as having the mental sharpness it takes to serve effectively, erasing a 30-point Trump lead over Biden on this measure. Harris also leads Trump by 15 points on honesty and trustworthiness and by 6 points in better-representing people's personal values, both roughly matching Biden's position before he left the race. And she leads Trump by 7 points in empathy -- understanding the problems of people like you -- an important gauge on which Biden and Trump were essentially even in July. There's another characteristic particular to Harris: Thirty-eight percent of Americans say that having a woman serve as president would be a good thing for the country, far more than the 14% who see it as a bad thing. The rest, 47%, say it makes no difference. (Forty percent of women call a woman president a good thing, as do 35% of men.) Strength/enthusiasm In another sharp change, 60% of Harris' backers support her strongly, matching Trump's strong support and compared with just 34% strong support for Biden last month. Further, 50% overall say they'd be enthusiastic or satisfied if Harris were elected, compared with 36% who said that about Biden in early 2023, even before concerns about his cognitive age grew. Just among Democrats and Democratic-leaning independents, enthusiasm or satisfaction with Harris as their candidate is 19 points higher than Biden's at that time, at 91% versus 72%. Forty-five percent overall say they'd be enthusiastic or satisfied with a Trump victory, about the same as in early 2023 (43%). It's 85% among Republicans and GOP-leaning independents, up 6 points. To be sure, fewer than half of Americans, 44%, are satisfied with a Harris-Trump matchup, with 55% dissatisfied. But that's sharply improved from views on a Biden-Trump race, with which just 28% were satisfied, 71% dissatisfied, last month. It's also the case that Harris' choice of Walz as her running mate has been better received than Trump's selection of Vance, as reported Friday. Key issues At the same time, Trump leads Harris by 9 points in trust to handle the economy and inflation alike, roughly maintaining his position on these issues against Biden last month. More than 85% of adults rate both of these as highly important in their vote for president, tops among 11 issues tested. Trump also leads Harris, by 10 points, in trust to handle the immigration situation at the U.S.-Mexico border, versus a 14-point Trump lead in July. But other issues surpass immigration in importance, including health care, on which Harris leads Trump by 7 points; protecting American democracy, Harris +6; and crime and safety, on which they're close. Notably, the gap on crime and safety has narrowed from a Trump lead, +7 points, in July, to Trump +3 points now, not a significant gap. And Harris leads by 5 points in trust to handle gun violence, compared with a virtual tie for Biden (+1) against Trump in July. Both shifts may reflect Harris' credentials as a former prosecutor. Harris also leads, by 5 points, in trust to handle appointments to the U.S. Supreme Court. Among items lower on the importance list, she leads Trump by 12 points in trust to handle abortion and 14 points to handle race relations, while he's +5 points on handling the Israel/Hamas war (down from +9 against Biden). Candidate influence While Trump leads in trust to handle the economy and immigration, most people give Harris at least somewhat of a pass on the Biden administration's policies on both issues. The public by about a 2-1 margin, 64%-33%, thinks Harris had limited influence on Biden's economic policies, and by 57%-39% says the same about her influence on immigration policies. Economic views matter, given the issue's importance. With 72% of Americans rating the economy negatively, Trump is sure to seek to pin blame on Harris, and she to try to avoid it. Currently, he leads by 61%-33% among those who rate the economy negatively; she, by 89%-8% among those who rate it positively. Wednesday's new inflation figure, a low since early 2021, may offer help to Harris, but prices and interest rates still have risen sharply on the Biden/Harris watch, and recession fears are afoot. Trump may face more of a challenge on the abortion issue. Although fewer rate it as highly important, it's also the case that Americans by 56%-39% think Trump had substantial influence in bringing about the U.S. Supreme Court decision eliminating the constitutional right to an abortion -- a decision the public opposes by 62%-35%. Supporters of the abortion ruling support Trump by 81%-13%, but the majority that opposes it supports Harris, by 72%-25%. Indeed, among people who think Trump had a larger role in bringing about the abortion ruling, Harris leads, 69%-28%. Among those who think Trump had less influence, that flips to a 73%-22% Trump lead. Vote-preference gaps based on views of Harris' influence on economic and immigration policy are far less pronounced, and run in the opposite direction. She does 10 points better with people who think she's had more influence on economic policy, and 9 points better among those who think she had more influence on immigration policy, both compared with those who think she's had less influence. Vote groups Some of the changes among groups from Biden to Harris are striking. Among them: Independents went from +4 points for Trump in July to +11 Harris now, a 15-point swing. Classic swing voters, independents have gone with the winner in nine of the last 12 presidential elections, all but those in 2012, 2004 and 1976.People younger than age 40 have moved from +2 Biden in July to +20 for Harris now, an 18-point swing.Women age 18-29 split about evenly (Trump +2) in July; now they favor Harris by 23 points, a 25-point swing in this group. It's almost as big, an 18-point swing to Harris, among women age 30 to 49. Harris also has improved from Biden's score among men age 18-29, from Biden +1 in July to Harris +14 now, a 13-point swing.Support from Black people has swung by 12 points in Harris' direction, from +60 for Biden in July to +72 for Harris now. Her gain is about equal among Black men and Black women alike. (Harris is a Black and South Asian person. The sample size of Asians in this survey is too small for a vote-preference estimate, but a combination of the last two surveys with a Harris-Trump matchup, the first done before Biden withdrew, finds Harris ahead of Trump among Asians by 65%-32%.)Harris has seen an 8-point swing among Hispanic people. That's occurred mostly among Hispanic women, a 17-point swing from +2 for Trump in July to +15 for Harris now.In the middle-income range, people with household incomes from $50,000 to $99,999 have gone from Trump +7 in July to Harris +8 now, a 15-point shift. Looking ahead Some potential voters may be persuadable in the campaign ahead. Among people who don't currently support Trump, 12% say they'd consider voting for him. Among those who don't now support Harris, an almost equal number, 11%, say they'd consider her. The question is how the candidates attract new supporters while keeping their bases motivated. Appeals on ideological lines seem thin: While 46% see Harris as too liberal, as Trump consistently charges, almost as many, 42%, see him as too conservative. Another challenging line is Trump's contention that the Democratic Party encouraged the sentiment that led to an attempt on his life. Instead, more Americans blame the Republican Party for the risk of politically motivated violence in this country, 37%, than blame the Democrats, 26%; an additional 25% blame both equally. Best for Trump is his advantage on the economy and Harris' association with Biden, who labors under a 37%-55% job approval rating, essentially steady the past 15 months. Indeed, Harris' own rating for handling her job as vice president is just 39%-49%. But Trump's retrospective rating also is underwater, 44%-49%. And at this stage, at least, Harris possesses one potentially crucial election commodity: momentum. Methodology This ABC News/Washington Post/Ipsos poll was conducted online via the probability-based Ipsos KnowledgePanel Aug. 9-13, 2024, in English and Spanish, among a random national sample of 2,336 adults. Partisan divisions are 29%-29%-29%, Democrats-Republicans-independents. Results have a margin of sampling error of 2 percentage points, including the design effect, for the full sample. Sampling error is not the only source of differences in polls. The survey was produced for ABC News by Langer Research Associates, with sampling and data collection by Ipsos. See details on ABC News survey methodology here.","summary":"The Kamala Harris campaign pounced on Trump's words, saying he \"knows nothing about service to anyone or anything but himself.\"","url":"https://abc13.com/2024-presidential-election-kamala-harris-leads-donald-trump-overall-but-not-on-handling-of-the-economy-abc-news-poll-shows/15201187/","image":"https://cdn.abcotvs.com/dip/images/15200961_081824-wls-our-chicago-part-2-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/081824-wls-our-chicago-part-2-vid.mp4","publish_date":"2024-08-18 21:13:44","author":"ABCNews,Gary Langer","authors":["ABCNews","Gary Langer"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.109},{"id":254391274,"title":"Kamala Harris leads Donald Trump overall, but not on handling of the economy: POLL","text":"Vice President Kamala Harris heads into her nominating convention this week leading former President Donald Trump in a head-to-head matchup, bolstered by vast improvements over President Joe Biden in enthusiasm and perceived readiness for the job and sharply better support among key groups including swing-voting independents, according to a new latest ABC News/Washington Post/Ipsos poll. Yet Trump retains the upper hand on the two top-cited election issues in the poll -- the overall economy and inflation -- and also leads on a third -- immigration -- keeping the race a closely contested one. Among all adults -- relevant since there's plenty of time to register -- Harris and Gov. Tim Walz lead Trump and Sen. JD Vance by 50%-45%. Among those now registered to vote, it's 49%-45%, a slight Harris advantage given sampling tolerances. And Harris has a 6-point lead among likely voters, 51%-45%. Roughly echoing these results, this poll, produced for ABC by Langer Research Associates with fieldwork by Ipsos, also finds that more people see Harris as qualified for the job, 53%, than say the same about Trump, 47%. See PDF for full results. In a five-way matchup, the poll finds Harris/Walz and Trump/Vance at 47%-44% among the general public and registered voters alike, and 49%-45% among likely voters. None of these is a statistically significant difference, suggesting the Democrats would prefer a two-way race. That said, among all adults, support for Robert F. Kennedy Jr. (and his running mate Nicole Shanahan) is down to 5%, from a peak of 12% in April. Cornel West/Melina Abdullah have 1%, as does Jill Stein of the Green Party. These candidates' ballot access is to be determined; per ABC News estimates, Kennedy currently is on the ballot in 21 states, Stein in 20 and West in eight. Candidate attributes Underlying shifts from July are dramatic, particularly in views of some candidate attributes. There also are sharp increases in Democrats' satisfaction with the presidential matchup and enthusiasm for their candidate. Among all adults, Harris leads on two measures on which Biden lagged badly. Americans by a wide 56%-26% pick her over Trump as having the physical health to serve effectively as president, reversing Trump's 31-point lead over Biden on this attribute last month. And Harris leads Trump by 9 percentage points in being seen as having the mental sharpness it takes to serve effectively, erasing a 30-point Trump lead over Biden on this measure. Harris also leads Trump by 15 points on honesty and trustworthiness and by 6 points in better-representing people's personal values, both roughly matching Biden's position before he left the race. And she leads Trump by 7 points in empathy -- understanding the problems of people like you -- an important gauge on which Biden and Trump were essentially even in July. There's another characteristic particular to Harris: Thirty-eight percent of Americans say that having a woman serve as president would be a good thing for the country, far more than the 14% who see it as a bad thing. The rest, 47%, say it makes no difference. (Forty percent of women call a woman president a good thing, as do 35% of men.) Strength/enthusiasm In another sharp change, 60% of Harris' backers support her strongly, matching Trump's strong support and compared with just 34% strong support for Biden last month. Further, 50% overall say they'd be enthusiastic or satisfied if Harris were elected, compared with 36% who said that about Biden in early 2023, even before concerns about his cognitive age grew. Just among Democrats and Democratic-leaning independents, enthusiasm or satisfaction with Harris as their candidate is 19 points higher than Biden's at that time, at 91% versus 72%. Forty-five percent overall say they'd be enthusiastic or satisfied with a Trump victory, about the same as in early 2023 (43%). It's 85% among Republicans and GOP-leaning independents, up 6 points. To be sure, fewer than half of Americans, 44%, are satisfied with a Harris-Trump matchup, with 55% dissatisfied. But that's sharply improved from views on a Biden-Trump race, with which just 28% were satisfied, 71% dissatisfied, last month. It's also the case that Harris' choice of Walz as her running mate has been better received than Trump's selection of Vance, as reported Friday. Key issues At the same time, Trump leads Harris by 9 points in trust to handle the economy and inflation alike, roughly maintaining his position on these issues against Biden last month. More than 85% of adults rate both of these as highly important in their vote for president, tops among 11 issues tested. Trump also leads Harris, by 10 points, in trust to handle the immigration situation at the U.S.-Mexico border, versus a 14-point Trump lead in July. But other issues surpass immigration in importance, including health care, on which Harris leads Trump by 7 points; protecting American democracy, Harris +6; and crime and safety, on which they're close. Notably, the gap on crime and safety has narrowed from a Trump lead, +7 points, in July, to Trump +3 points now, not a significant gap. And Harris leads by 5 points in trust to handle gun violence, compared with a virtual tie for Biden (+1) against Trump in July. Both shifts may reflect Harris' credentials as a former prosecutor. Harris also leads, by 5 points, in trust to handle appointments to the U.S. Supreme Court. Among items lower on the importance list, she leads Trump by 12 points in trust to handle abortion and 14 points to handle race relations, while he's +5 points on handling the Israel/Hamas war (down from +9 against Biden). Candidate influence While Trump leads in trust to handle the economy and immigration, most people give Harris at least somewhat of a pass on the Biden administration's policies on both issues. The public by about a 2-1 margin, 64%-33%, thinks Harris had limited influence on Biden's economic policies, and by 57%-39% says the same about her influence on immigration policies. Economic views matter, given the issue's importance. With 72% of Americans rating the economy negatively, Trump is sure to seek to pin blame on Harris, and she to try to avoid it. Currently, he leads by 61%-33% among those who rate the economy negatively; she, by 89%-8% among those who rate it positively. Wednesday's new inflation figure, a low since early 2021, may offer help to Harris, but prices and interest rates still have risen sharply on the Biden/Harris watch, and recession fears are afoot. Trump may face more of a challenge on the abortion issue. Although fewer rate it as highly important, it's also the case that Americans by 56%-39% think Trump had substantial influence in bringing about the U.S. Supreme Court decision eliminating the constitutional right to an abortion -- a decision the public opposes by 62%-35%. Supporters of the abortion ruling support Trump by 81%-13%, but the majority that opposes it supports Harris, by 72%-25%. Indeed, among people who think Trump had a larger role in bringing about the abortion ruling, Harris leads, 69%-28%. Among those who think Trump had less influence, that flips to a 73%-22% Trump lead. Vote-preference gaps based on views of Harris' influence on economic and immigration policy are far less pronounced, and run in the opposite direction. She does 10 points better with people who think she's had more influence on economic policy, and 9 points better among those who think she had more influence on immigration policy, both compared with those who think she's had less influence. Vote groups Some of the changes among groups from Biden to Harris are striking. Among them: Independents went from +4 points for Trump in July to +11 Harris now, a 15-point swing. Classic swing voters, independents have gone with the winner in nine of the last 12 presidential elections, all but those in 2012, 2004 and 1976.People younger than age 40 have moved from +2 Biden in July to +20 for Harris now, an 18-point swing.Women age 18-29 split about evenly (Trump +2) in July; now they favor Harris by 23 points, a 25-point swing in this group. It's almost as big, an 18-point swing to Harris, among women age 30 to 49. Harris also has improved from Biden's score among men age 18-29, from Biden +1 in July to Harris +14 now, a 13-point swing.Support from Black people has swung by 12 points in Harris' direction, from +60 for Biden in July to +72 for Harris now. Her gain is about equal among Black men and Black women alike. (Harris is a Black and South Asian person. The sample size of Asians in this survey is too small for a vote-preference estimate, but a combination of the last two surveys with a Harris-Trump matchup, the first done before Biden withdrew, finds Harris ahead of Trump among Asians by 65%-32%.)Harris has seen an 8-point swing among Hispanic people. That's occurred mostly among Hispanic women, a 17-point swing from +2 for Trump in July to +15 for Harris now.In the middle-income range, people with household incomes from $50,000 to $99,999 have gone from Trump +7 in July to Harris +8 now, a 15-point shift. Looking ahead Some potential voters may be persuadable in the campaign ahead. Among people who don't currently support Trump, 12% say they'd consider voting for him. Among those who don't now support Harris, an almost equal number, 11%, say they'd consider her. The question is how the candidates attract new supporters while keeping their bases motivated. Appeals on ideological lines seem thin: While 46% see Harris as too liberal, as Trump consistently charges, almost as many, 42%, see him as too conservative. Another challenging line is Trump's contention that the Democratic Party encouraged the sentiment that led to an attempt on his life. Instead, more Americans blame the Republican Party for the risk of politically motivated violence in this country, 37%, than blame the Democrats, 26%; an additional 25% blame both equally. Best for Trump is his advantage on the economy and Harris' association with Biden, who labors under a 37%-55% job approval rating, essentially steady the past 15 months. Indeed, Harris' own rating for handling her job as vice president is just 39%-49%. But Trump's retrospective rating also is underwater, 44%-49%. And at this stage, at least, Harris possesses one potentially crucial election commodity: momentum. Methodology This ABC News/Washington Post/Ipsos poll was conducted online via the probability-based Ipsos KnowledgePanel Aug. 9-13, 2024, in English and Spanish, among a random national sample of 2,336 adults. Partisan divisions are 29%-29%-29%, Democrats-Republicans-independents. Results have a margin of sampling error of 2 percentage points, including the design effect, for the full sample. Sampling error is not the only source of differences in polls. The survey was produced for ABC News by Langer Research Associates, with sampling and data collection by Ipsos. See details on ABC News survey methodology here.","summary":"The Kamala Harris campaign pounced on Trump's words, saying he \"knows nothing about service to anyone or anything but himself.\"","url":"https://abc7news.com/2024-presidential-election-kamala-harris-leads-donald-trump-overall-but-not-on-handling-of-the-economy-abc-news-poll-shows/15201187/","image":"https://cdn.abcotvs.com/dip/images/15200961_081824-wls-our-chicago-part-2-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/081824-wls-our-chicago-part-2-vid.mp4","publish_date":"2024-08-18 21:13:44","author":"ABCNews,Gary Langer","authors":["ABCNews","Gary Langer"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.109},{"id":254389740,"title":"US budget deficit rises to all-time high under Biden","text":"BERNAMA – The United States (US) budget deficit during the presidency of Joe Biden has hit the all-time high at USD6.6 trillion, according to Sputnik calculations based on data from the US Treasury Department. The US government’s expenses over three and a half years under Biden exceeded revenues by USD6.6 trillion – the highest in the entire history of these statistics. Thus, in 2021, the indicator amounted to USD2.8 trillion, or to 13 per cent of gross domestic product (GDP). The following year, the negative balance decreased to USD1.4 trillion, or 6.3 per cent of GDP, but last year it increased to USD1.7 trillion, or 7.6 per cent of GDP. Over the first six months of this year, it amounted to USD758.2 billion, and the share of GDP on a rolling annual basis was 5.5 per cent. His predecessor, Donald Trump, accumulated a total deficit of USD5.6 trillion. At the same time, under Trump, there was a maximum annual negative budget balance of USD3.1 trillion, or 15.5 per cent of GDP, in the COVID-19-peak year of 2020. Barack Obama became the only American leader in this century who managed to reduce the US budget deficit by the end of his presidency, to USD2.2 trillion from USD5.1 trillion under George W Bush. However, Bush was the last president under whom the US budget posted a full-year surplus of USD130 billion in 2001. The US has been in a state of chronic excess of expenditures over income for almost a century; the last time there was a long period of surplus was from 1920 to 1930. The only US leader after World War II with a budget surplus was Harry Truman (1946-1950), and the largest government spending surplus was under Ronald Reagan at USD1.34 trillion. The US finances such a gigantic budget deficit from the national debt, which in July for the first time exceeded the USD35 trillion mark, and just two weeks later grew by another USD160 billion.","summary":"","url":"https://borneobulletin.com.bn/us-budget-deficit-rises-to-all-time-high-under-biden/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/08/page-10-E_19082024.jpg","video":null,"publish_date":"2024-08-18 21:08:43","author":null,"language":"en","catgory":"politics","source_country":"bn","sentiment":0.1},{"id":254389638,"title":"Kamala Harris Polling Compared to Hillary Clinton's in 2016","text":"With Vice President Kamala Harris' surge in the polls, former President Donald Trump has downplayed the data, saying he's \"leading by a lot\" and pointing to polling that suggested former Democratic presidential candidate Hillary Clinton would beat him in 2016.Clinton, a former Secretary of State and senator for New York, lost the election to Trump eight years ago despite numerous polls, as well as polling averages, showing her ahead. Trump pulled off his win by narrowly winning in key battleground states, flipping Michigan, Wisconsin and Pennsylvania red for the first time since the 1980s. Florida, which had gone for former President Barack Obama in 2008 and in 2012, also flipped red for Trump.At the same time, Clinton did win the popular vote by more than 2.8 million votes—a margin of 2.1 points. However, as the Electoral College, which awards each state a certain number of electoral votes based on population, determines the election's outcome, her national vote lead didn't matter. Trump's win was widely viewed as an upset victory and led many to question what went wrong with the polls.\"You know, in 2016, I was polling low because people didn't want to say who they're voting for. I don't know if that's supposed to be a good thing or a bad thing, but it is what it is. And we did very well in 2016,\" Trump told reporters during a press conference at his Bedminster golf club in New Jersey on Thursday.Newsweek reached out to the Harris campaign via email for comment on Sunday. The Trump campaign, when reached for comment, emailed Newsweek polling data from conservative polling company Rasmussen Reports showing the former president leading the vice president by 4 points nationally.But how do the polls in 2024 actually compare to 2016? Here's a closer look at where things stood then versus now.National Polling 2016 vs. 2024Exactly eight years ago on August 18, 2016, polling analysis site FiveThirtyEight, which became part of ABC News in 2018, showed Clinton with a substantial national polling lead over Trump. The polling average showed the Democratic candidate with 43.6 percent support compared to Trump's 36.8 percent—a lead of 6.8 points for Clinton.Comparatively, Harris is only 2.6 points ahead of Trump nationally in FiveThirtyEight's current average as of Sunday afternoon. The Democrat has the backing of 46.4 percent of voters while the Republican has the support of 43.8 percent. Notably, Harris' national lead is smaller than Clinton's on the same day in 2016, although the vice president's overall support appears to be a little higher.Michigan Polling 2016 vs. 2024Clinton was substantially ahead of Trump in Michigan at this point in 2016, according to FiveThirtyEight's average. The average showed Clinton more than 11 points ahead of Trump on August 18, 2016.Comparatively, Harris is just 2.6 points ahead in the current average. Trump has the support of 43.4 percent of Michiganders while Harris has the backing of 46 percent as of Sunday.Clinton went on to lose Michigan by just 0.23 percent in 2016. Trump carried the Midwestern state by 47.5 percent compared to her 47.27 percent. The margin was less than 11,000 votes.Pennsylvania Polling 2016 vs. 2024Trump was down substantially in Pennsylvania in August 2016 as well. Exactly eight years ago, the FiveThirtyEight's polling average showed the Republican with 41.2 percent and Clinton ahead by 8.3 points at 49.5 percent.As of Sunday, FiveThirtyEight has Harris narrowly ahead of Trump in Pennsylvania by 1.4 points. The vice president has the support of 46.2 percent of Pennsylvania voters while the former president is backed by 44.8 percent.Trump won Pennsylvania by 0.72 percent in 2016. He secured 48.18 percent of the state's voters compared to Clinton's 47.46 percent. The margin was just over 44,000 votes.Wisconsin Polls 2016 vs. 2024Similar to Michigan, Clinton was leading Trump by more than 11 points in FiveThirtyEight's Wisconsin average eight years ago today. The average had the Democrat at 50.7 percent and the Republican at 39.4 percent.Harris currently is ahead of Trump by about 3 points in Wisconsin. The FiveThirtyEight average has the vice president with the backing of 47.2 percent of Wisconsin voters compared to 44.2 percent that back Trump.Clinton lost in Wisconsin by 0.77 percent, or just under 23,000 votes. The Democrat won 46.45 of the vote in the state and the Republican won 47.22 percent.Florida Polls 2016 vs. 2024Back in 2016, Clinton was more than 5 points ahead of Trump in Florida at this point in the race, according to FiveThirtyEight's average. The Democrat had the backing of 48.7 percent of Floridians and the Republican was supported by 43.2 percent.The polling average for Florida is nearly reversed as of Sunday, with Trump in the lead by 4.6 points. The former president leads Harris with 47.9 percent of the Southern state's voters to her 43.3 percent.Trump won Florida by 1.2 points in 2016. He carried the state with 49.02 percent of the vote while Clinton had 47.82 percent. The margin was nearly 113,000 votes.Will the Polls Be Wrong Again?Analysts have offered multiple theories for what went wrong with the polling in 2016. As Trump mentioned on Thursday, some have suggested that voters did not admit to pollsters that they planned to vote for the Republican. Others have suggested that the polls were weighted badly, giving certain demographics too much influence.Some Trump voters may also have been less likely to respond to surveys. An April 2021 report from the Pew Research Center explains part of why this could be the case.\"Achieving proper representation of Republicans is more difficult than it used to be. Survey participation has long been linked to individuals' levels of education and social trust. Now that the GOP is doing better attracting voters with lower levels of education and, according to some analysts, doing better than in the past attracting low trust adults, Republican participation in surveys is waning, increasing reliance on weighting as a corrective,\" the report said.Many pollsters believe they've made significant improvements and corrections compared to 2016. However, the polls were notably off in 2020 as well, underestimating support for Trump. Although they largely showed President Joe Biden winning nationally and in key battleground states, the margins were closer than the polls suggested.","summary":"\"In 2016, I was polling low because people didn't want to say who they're voting for,\" former President Donald Trump said last week.","url":"https://www.newsweek.com/kamala-harris-polling-compared-hillary-clintons-2016-1940839","image":"https://d.newsweek.com/en/full/2452319/clinton-trump-harris.jpg","video":null,"publish_date":"2024-08-18 21:08:10","author":"Jason Lemon","authors":["Jason Lemon"],"language":"en","source_country":"us","sentiment":-0.345},{"id":254392824,"title":"Here's the biggest news you missed this weekend","text":"Kamala Harris’ big week As the Democratic National Convention kicks off in Chicago on Monday, the party will be looking to introduce Kamala Harris to the many Americans who still know little about her, with just 11 weeks until Election Day. A mad scramble is underway to roll out her biography as Trump works to villainize her. The DNC speakers this week will include former presidents Barack Obama and Bill Clinton, former first lady Michelle Obama and former Secretary of State Hillary Clinton. On Monday night, President Joe Biden will deliver a speech at the event that just weeks ago was expected to center on his re-election bid, but has been rapidly reshaped around his vice president’s own candidacy. Progressives meanwhile are homing in on a a more pragmatic, economy-focused policy agenda like raising the minimum wage and child care funding in place of sky-high ambitions like Medicare for All and a Green New Deal as they prepare for a potential Harris presidency. Chicago has been bracing for thousands of protesters to show up outside the convention, amid concerns about a potential confrontation with police. Mayor Brandon Johnson said Sunday, “Our local police department, along with the local police agencies as well as the Secret Service, we are ready for this convention.” As Israel strikes Gaza, Blinken heads to region for cease-fire talks Secretary of State Antony Blinken headed to the Middle East on Sunday to try to seal a cease-fire deal after months of contentious negotiations. The U.S. and fellow mediators Egypt and Qatar said they were closing in on a deal after two days of talks in Doha, with American and Israeli officials expressing cautious optimism. But Hamas has signaled resistance to what it says are new demands by Israel, and the long-running talks have repeatedly stalled. An Israeli delegation was set to travel to Cairo on Sunday for further talks, and Blinken is expected to meet with Israeli Prime Minister Benjamin Netanyahu on Monday. Israeli strikes have continued across Gaza despite the renewed hopes of a deal, with an overnight bombardment killing 28 people including a woman and her six children, Palestinian officials said Sunday. In the West Bank, some Palestinians say Israelis are taking advantage of the fact that the world is focused on Gaza to redouble their efforts to “colonize” the Palestinian territory. Ernesto forecast to become a hurricane again as it moves north Tropical Storm Ernesto was downgraded from a hurricane Saturday night after making landfall in Bermuda, but as of Sunday morning it’s forecast to strengthen again as it heads toward Canada’s Newfoundland. “Some intensification is possible Sunday and Sunday night,” the National Hurricane Center said. “The cyclone will likely become post-tropical near southeastern Newfoundland by Monday night or Tuesday morning.” Thousands in Bermuda lost power, and as of Sunday afternoon more than 10,000 utility customers (about 34% of the island) were still without. Dangerous beach conditions, including large waves and rip currents, are expected along the East Coast and Atlantic Canada until early next week. Who is the ‘Ketamine Queen’ charged in Matthew Perry’s death? Jasveen Sangha, deemed the “Ketamine Queen” by investigators, is accused of supplying the drugs that killed “Friends” star Matthew Perry. She had been selling ketamine and other drugs “since at least 2019” and had turned her home into a “stash house,” federal prosecutors say. Court documents say a search of Sangha’s residence found “evidence of drug trafficking” and pills containing “methamphetamine, psilocybin mushrooms, cocaine, and prescription drugs that appeared to be fraudulently obtained.” Sangha was arrested in March in a separate federal drug case and was out on $100,000 bond when she was arrested and charged in Perry’s death. She faces anywhere from 10 years to life in federal prison if convicted. Meet the Press South Carolina GOP Sen. Lindsey Graham has suggested former President Donald Trump “may not win this election” unless he focuses on policy over showmanship. “President Trump can win this election. His policies are good for America, and if you have a policy debate for president, he wins. Donald Trump the provocateur, the showman, may not win this election,” Graham told “Meet the Press” moderator Kristen Welker. Graham also suggested that he and fellow Republicans who are “giving advice on TV to President Trump” should “get together and actually campaign for the guy,” citing Trump’s former rivals Nikki Haley and Ron DeSantis. You can watch the full interview here. Politics in brief Santos fraud case: Former GOP Rep. George Santos is expected to plead guilty on Monday to multiple charges related to campaign finance fraud, two sources familiar with the matter told NBC News. Home front: Both Trump and Harris want to sell voters on ways to ease housing shortages, but the practicalities of bringing down costs leave both campaigns navigating political minefields. Voter registration: A nonprofit aimed at youth voters is connecting high school students passionate about civic engagement to the resources they need to galvanize their peers. Since 2018, they’ve registered more than 80,000 high schoolers to vote. Earthquake scientists are learning warning signs of the ‘big one’ Japan’s recent “megaquake” warning had seismologists watching carefully. Did the smaller quake mean that the “big one” was on the doorstep? No one could say for sure, but the odds were suddenly higher. The warning ultimately ended Thursday after no unusual activity was detected, but it highlighted a big question for U.S. seismologists: If they find clues that a devastating earthquake is more likely, even just slightly, what warrants sounding the alarm? “You don’t want a mass evacuation panic that’s not warranted, but you want people not to go on their merry ways,” said Harold Tobin, Washington’s state seismologist. Forecasting this future catastrophe is critical, and researchers think they are homing in on the triggers or precursors of earthquakes in the world’s most dangerous seismic regions, but the science is far from settled. This restaurant is big on TikTok — and entirely fictional Drew Talbert is a longtime restaurant worker who came up with Bistro Huddy in 2020. It’s an entirely imaginary restaurant, but it’s very popular on TikTok, with 4.5 million followers. Talbert and his wife have been able to quit their jobs to focus on growing their online brand full time, creating POV skits about working in a restaurant and selling Bistro Huddy merch. The videos initially focused on what it was like to work as a server, but fans now watch for the familiar storylines and drama about the staple cast of characters. “It doesn’t get much better than what’s going on right now,” Talbert said. “We have full creative control. We’re at home with our kids.” In case you missed it As concerns mount about the spread of mpox, infectious disease experts expressed cautious optimism that one type of the virus would not spread as broadly in the U.S.A new study suggests that many people with severe brain injury are more aware than originally thought, and are responding to commands mentally even if they don’t physically.A couple is suing an Atlanta hospital that allegedly lost part of a patient’s skull after it was removed during brain surgery.Priceless paintings by Monet, Cézanne, Van Gogh and others were unharmed Saturday after firefighters worked to douse a blaze that broke out in the roof of Somerset House, a historic building and arts venue in London.Nearly 70 million people in southern Africa are suffering from the effects of a major drought. The situation is particularly dire in Malawi, with half the nation's population — an estimated 9 million people — in need of humanitarian aid.Tech billionaire Elon Musk has repeatedly posted he believes Europe is headed toward “civil war” due to the arrival of refugees, echoing a frequent talking point from some far-right activists meant to stoke tensions around immigration.A new age of “power lesbian” fashion is here — and women across the sexuality spectrum are adopting the look.","summary":"Kamala Harris re-introduces herself to voters. George Santos is expected to plead guilty. And who is the \"Ketamine Queen\" charged in Matthew Perry's death?","url":"https://www.nbcnews.com/news/weekend-rundown-aug-18-rcna167010","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-08/240818-hurricane-ernesto-vl-332p-72683a.jpg","video":null,"publish_date":"2024-08-18 21:06:54","author":"Josh Feldman,Nick Duffy","authors":["Josh Feldman","Nick Duffy"],"language":"en","source_country":"us","sentiment":-0.003},{"id":254392316,"title":"Trump’s promise to ‘drill, baby, drill’ probably won’t change much","text":"by Carlos Nogueras Ramos for Texas Tribune Former President Donald Trump has vowed to “drill, baby, drill” on Day One of his next administration. He wants, as his website says, for the U.S. to be “the dominant energy producer in the world, by far!” It already is — thanks to Texas. Earlier this year, the Texas Oil & Gas Association, the state’s leading industry group, reported that Texas supplied 42% of the nation’s oil in 2023. Texas broke records last year when operators drilled nearly 2 billion barrels of oil and 12 trillion cubic feet of natural gas. And it was a banner year for oil and gas across the U.S., which produced 12.9 million barrels of oil per day. The previous record was 12.3 million barrels of oil per day in 2019. Already, the federal Energy Information Administration is projecting companies will produce on average 13.2 million barrels per day this year and 13.7 million barrels per day in 2025. No other country comes close to producing the amount of oil the United States does. Russia, the world’s second-largest producer, estimated about 9 million barrels a day in June. This wasn’t always the case. During the 1990s and early 2000s, the U.S. trailed Saudia Arabia and Russia. The U.S. took the lead in 2018. According to industry analysts Texas is again poised to contribute billions of gallons of oil this year. And next. And the one after at. A number of factors influence how much oil and gas companies should supply at any given point to meet demand, but there is no doubt that the industry is teeming with liquid oil, the analysts say. And while Trump might be encouraging more drilling, it is the market, not the person in the Oval Office who sets production standards. However, the industry would welcome less regulation, which would be more likely in any Republican administration. The Biden administration orchestrated efforts to combat climate change, including federal rules to lessen methane emissions, blocking nearly half a million acres of federal land in Alaska from drilling, temporarily pausing exports of liquefied natural gas and listing a desert lizard as endangered to protect it from extinction — neither of which has significantly impacted production, analysts say. Still, they have been enough to sour the relationship with the oil and gas industry, which has said the policies harm production and argued it wants a seat at the policy-crafting table. In contrast, Trump has pledged to eliminate any roadblocks to drilling. Texas is drilling record amount of oil thanks to fracking and horizontal drilling Most of the state’s oil comes from the Permian Basin, a 75,000-square-mile area straddling Texas and New Mexico where the biggest names in the energy industry — including Chevron, ExxonMobil and ConocoPhillips — are drilling. Texas’s share of the Permian Basin is owned by the state and private property owners, according to the Federal Reserve Bank of Dallas. Federal restrictions on drilling would mostly affect New Mexico, where half of production occurring on its soil is federally owned. Those companies and countless others pumped more oil in 2023 than the nine top-producing states in the nation combined, data by Texas 2036 showed. Drillers extracted 2 billion barrels of oil. The other states, which include Pennsylvania, New Mexico, Oklahoma and North Dakota, pumped about 1.8 billion barrels. “The sheer magnitude of oil and gas production coming out of Texas is off the charts,” said Jeremy Mazur, a senior policy adviser with Texas 2036. There is no slowdown in sight. So far this year, the state’s oil and gas regulator approved about 4,500 new drilling permits as of August. That’s about 70 percent of the permits the Railroad Commission of Texas approved last year, which was roughly 6,400. To drill in Texas, companies must first seek approval from the commission, which has 46 days to approve an application. There is no federal law that limits how many applications the commission may approve. Texas’s most recent oil boom has been made possible due to technological advances in fracking and horizontal drilling, not a shift in law. Mazur said that a horizontal drilling boom in 2019, in which rigs drill further in distance rather than depth, allowed operators to access more oil without needing as many wells. Those advances come at a time when energy both domestically and internationally is soaring. And the rising demand for artificial intelligence computing will only add to it. “There's a whole global market out there, and there are substantial demands for energy, and Texas has the natural resources in the form of oil and natural gas to supply these commodities to an international market that's demanding them,” Mazur said. Supply and demand, not the president, will drive oil and gas production James Coleman, a professor of law and senior fellow at the American Enterprise Institute, said Trump’s pledge to “drill, baby, drill” is not policy, but political rhetoric meant to excite his base.","summary":"by&nbsp;Carlos Nogueras Ramos for Texas Tribune\n\n\n\n\n\n\n\nFormer President Donald Trump has vowed to “drill, baby, drill” on Day One of his next administration. He wants, as his website says, for the U.S. to be “the dominant energy producer in the world, by far!”\n\n\n\nIt already is — thanks to Texas.\n\n\n\nEarlier this year, the Texas Oil &amp; Gas Association, the state’s leading industry group,&nbsp;reported&nbsp;that Texas supplied 42% of the nation’s oil in 2023. Texas broke records last year when operators drilled nearly 2 billion barrels of oil and 12 trillion cubic feet of natural gas.\n\n\n\nAnd it was a banner year for oil and gas across the U.S., which produced 12.9 million barrels of oil per day. The previous record was 12.3 million barrels of oil per day in 2019. Already, the federal Energy Information Administration is projecting companies will produce on average 13.2 million barrels per day this year and 13.7 million barrels per day in 2025.","url":"https://www.dailykos.com/story/2024/8/18/2263480/-Trump-s-promise-to-drill-baby-drill-probably-won-t-change-much?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1335175/story_image/AP24228782440884.jpg?1723852079","video":null,"publish_date":"2024-08-18 21:00:09","author":"Texas Tribune","authors":["Texas Tribune"],"language":"en","source_country":"US","sentiment":-0.115},{"id":254389954,"title":"Elon Musk’s AI photo tool is generating realistic, fake images of Trump, Harris and Biden","text":"New York (CNN) — Elon Musk’s AI chatbot Grok on Tuesday began allowing users to create AI-generated images from text prompts and post them to X. Almost immediately, people began using the tool to flood the social media site with fake images of political figures such as former President Donald Trump and Vice President Kamala Harris, as well as of Musk himself — some depicting the public figures in obviously false but nonetheless disturbing situations, like participating in the 9/11 attacks. Unlike other mainstream AI photo tools, Grok, created by Musk’s artificial intelligence startup xAI, appears to have few guardrails. In tests of the tool, for example, CNN was easily able to get Grok to generate fake, photorealistic images of politicians and political candidates that, taken out of context, could be misleading to voters. The tool also created benign yet convincing images of public figures, such as Musk eating steak in a park. Some X users posted images they said they created with Grok showing prominent figures consuming drugs, cartoon characters committing violent murders and sexualized images of women in bikinis. In one post viewed nearly 400,000 times, a user shared an image created by Grok of Trump leaning out of the top of a truck, firing a rifle. CNN tests confirmed the tool is capable of creating such images. RELATED | Gov. Little signs AI-generated porn bill into law The tool is likely to add to concerns that artificial intelligence could create an explosion of false or misleading information across the internet, especially ahead of the US presidential election. Lawmakers, civil society groups and even tech leaders themselves have raised alarms that the misuse of such tools could cause confusion and chaos for voters. “Grok is the most fun AI in the world!” Musk posted on X Wednesday, in response to a user praising the tool for being “uncensored.” Many other leading AI companies have taken some steps to prevent their AI image generation tools from being used to create political misinformation, although researchers found users can still sometimes find ways around enforcement measures. Some companies, including OpenAI, Meta and Microsoft, also include technology or labels to help viewers identify images that have been made with their AI tools. Rival social media platforms, including YouTube, TikTok, Instagram and Facebook have also taken steps to label AI-generated content in users’ feeds, either by using technology to detect it themselves or asking users to identify when they’re posting such content. X did not immediately respond to a request for comment regarding whether it has any policies against Grok generating potentially misleading images of political candidates. By Friday, xAI appeared to have introduced some restrictions on Grok, in response to critical reports and the disturbing images that users were creating and posting. The tool now refuses to create images of political candidates or widely recognized cartoon characters (whose intellectual property belongs to other companies) committing acts of violence or alongside hate speech symbols, although users noted the restrictions seemed limited to only certain terms and image subjects. X has a policy against sharing “synthetic, manipulated, or out-of-context media that may deceive or confuse people and lead to harm,” although it’s unclear how the policy is enforced. Musk himself shared a video last month on X that used AI to make it appear that Harris had said things she, in fact, did not — in an apparent violation of the policy and with only a laughing face emoji to suggest to followers that it was fake. The new Grok image tool also comes as Musk faces criticism for repeatedly spreading false and misleading claims on X related to the presidential election, including a post raising questions about the security of voting machines. It also comes days after Musk hosted Trump for a more than two-hour livestreamed conversation on X in which the Republican hopeful made at least 20 false claims without pushback from Musk. Other AI image generation tools have faced backlash for various issues. Google paused the ability for its Gemini AI chatbot to generate images of people after it was blasted for producing historically inaccurate depictions of people’s races; Meta’s AI image generator came under fire for struggling to create images of couples or friends from different racial backgrounds. TikTok was also forced to pull an AI video tool after CNN discovered that any user could create realistic-looking videos of people saying anything, including vaccine misinformation, without labels. Grok does appear to have some restrictions; for example, a prompt requesting a nude image returned a response saying, “unfortunately, I can’t generate that kind of image.” In a separate test, the tool said it also has “limitations on creating content that promotes or could be seen as endorsing harmful stereotypes, hate speech, or misinformation.” “It’s important to avoid spreading falsehoods or content that could incite hatred or division. If you have other requests or need information on a different topic, feel free to ask!” Grok said. However, in response to a different prompt, the tool did generate an image of a political figure standing alongside a hate speech symbol — a sign that whatever restrictions Grok does have, they appear not to be enforced consistently. –CNN’s Jon Passantino contributed to this report. This story has been updated to reflect changes xAI has made to Grok. The-CNN-Wire ™ & © 2024 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.","summary":"New York (CNN) — Elon Musk’s AI chatbot Grok on Tuesday began allowing users to create AI-generated images from text prompts and post them to X. Almost immediately, people began using the tool to flood the social media site...","url":"https://nation.lk/online/elon-musk-s-ai-photo-tool-is-generating-realistic-fake-images-of-trump-harris-and-biden-274071.html","image":"https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2024/08/Grok.jpg","video":null,"publish_date":"2024-08-18 21:00:06","author":"Jon Passantino","authors":["Jon Passantino"],"language":"en","source_country":"lk","sentiment":0.01},{"id":254390782,"title":"Harris and Walz make phone calls, rally volunteers on Pennsylvania bus tour before DNC in Chicago","text":"WASHINGTON (AP) — Democratic presidential nominee Kamala Harris and running mate Tim Walz embarked on a bus tour in southwestern Pennsylvania on Sunday, hoping to ride a wave of enthusiasm for her candidacy to their party’s nominating convention in Chicago this week. Vice President Harris and Walz, the governor of Minnesota, were joined by their spouses, Doug Emhoff and Gwen Walz, as they made their first stop visiting local volunteers making phone calls at a campaign office in the borough of Rochester in Beaver County. Harris, while speaking to a group of supporters and volunteers outside the campaign office, spoke about strength and leadership. She appeared to make a veiled reference to Donald Trump, the Republican presidential nominee, who is known for his pugilistic style and projection of a strongman image, when she said the “real and true measure of a strength of a leader is based on who you lift up,” rather than who they beat down. “Anybody who is about beating down other people is a coward,” she yelled, drawing cheers and applause. “This is what strength looks like.” Walz in his remarks seemed to assume the role of his former job coaching high school football and told the volunteers: “Let’s leave it all on the field. Let’s get this thing done.” Trump won the county in 2020. But the Democrats are riding on renewed enthusiasm after President Joe Biden exactly four weeks ago dropped his reelection bid and endorsed Harris to replace him on the ticket. As Harris’ motorcade left town, it rolled by a group of about 50 Trump supporters waiting near the road with signs of support for the former president. A handful of Harris supporters were standing nearby with their own signs. Southwestern Pennsylvania is a critical part of a key battleground state that has long commanded the attention of presidential candidates. The state voted for Trump in 2016 and for Biden in 2020. Both Harris and Trump are vying to see who can put Pennsylvania in their column on Nov. 5. Most polls, including from the New York Times/Siena College and Fox News, find Harris and Trump locked in a tight race statewide. Trump held a rally Saturday in Wilkes-Barre in the northeastern part of the state, following his earlier rallies in July in Harrisburg and Butler, where he survived an assassination attempt. The bus tour marks Harris’ eighth trip to Pennsylvania this year, and her second this month. The vice president chose to make her first joint appearance with Walz on the ticket in Philadelphia on Aug. 6. On Sunday, they arrived with their spouses earlier at Pittsburgh International Airport and greeted supporters. The foursome held hands and raised their arms together before cheering supporters who held campaign signs. They then boarded a bright blue bus that says “Harris Walz” in big white letters as they set off to make stops in the Pittsburgh area to glad-hand with voters. In Rochester, Harris, Walz and their spouses spent a few minutes sitting at tables with volunteers and making phone calls to line up support. “79 days to go, Hannah,” Harris said while on the phone. At another point while making calls, she said, “We’re all in this together.” Walz hung up his phone and said of the caller, “He’s all in,” and gave a thumbs up. He made another call and asked the person on the line, “How are you feeling? What are you hearing from folks?” Kristin Kanthak, associate professor of political science at the University of Pittsburgh, said Pennsylvania “is a state that traditionally has been super important, but southwestern Pennsylvania has been really kind of the battleground part of the battleground state.” Allegheny County, which includes Pittsburgh, is a diverse county with urban, suburban and rural areas, and a lot of people there haven’t decided how they will vote, she said. “It makes sense to come here and ask for votes because there are votes up for grabs here,” Kanthak said of Harris. “It’s not just about turning out your base. It’s about having an opportunity to speak to truly undecided voters.” In the 2020 race, Biden won Allegheny County with 60% of the vote, while Trump won neighboring Beaver County, which includes Rochester, with about 58% of the vote. After Trump’s surprise win in the state in 2016, Biden flipped Pennsylvania in 2020 — and, in so doing, won the White House — in part by running up his vote totals in heavily Democratic Pittsburgh, the state’s second-largest city and the county seat of Allegheny County. Biden assiduously courted the area’s blue-collar labor unions, kicking off his 2020 presidential campaign at a Teamsters hall in Pittsburgh by declaring, “I am a union man.” As president, he opposed the acquisition of Pittsburgh’s storied U.S. Steel by a Japanese company, saying it “should remain totally American,” and enacted steeper tariffs on Chinese steel. Trump, who is counting on strong turnout from his base of white, working-class voters, is not conceding the area. The counties around Pittsburgh have shifted from Democrat to Republican in recent presidential contests, delivering for Trump in both of his earlier runs. Trump has also embraced protectionist trade policies and insists he is pro-worker. His vow to increase U.S. energy production and “drill, baby, drill” has resonated in southwestern Pennsylvania blue-collar counties like Washington, where a natural gas drilling boom has helped make Pennsylvania the nation’s No. 2 producer after Texas. Harris once wanted to ban fracking, an oil and gas extraction process, before recently disavowing her earlier position. Dana Brown, director of Chatham University’s Pennsylvania Center for Women & Politics, said in an interview that Harris will use the bus trip to spin up local media coverage as well as reach out to voters in the state’s southwestern region “while she still has a great deal of momentum at her back.” “She is going to garner a lot of that free media attention,” Brown said. “I believe their hope … is to keep that momentum up and focused on her and less so on her opponent.” Bus tours have become a staple of political campaigns partly because of the free media coverage they generate. Such trips get the candidates out of their power suits and out of Washington so they can travel the country and score face time with voters in small venues like diners and mom-and-pop shops. Biden rolled across Iowa on an eight-day bus tour he dubbed “No Malarkey” in December 2019. During his 2012 reelection campaign, President Barack Obama traveled though small-town Ohio on his “Betting on America” bus tour. “It’s always fun just being out of Washington, and for me to be able to interact with folks is wonderful,” Obama said at one stop. Presidents George W. Bush and Bill Clinton also traveled by bus when they campaigned for a second term. The Democratic National Convention opens Monday. Price reported from New York. Associated Press writers Michael Rubinkam in northeastern Pennsylvania and Linley Sanders in Washington contributed to this report.","summary":"WASHINGTON (AP) — Democratic presidential nominee Kamala Harris and running mate Tim Walz embarked on a bus tour in southwestern Pennsylvania on Sunday, hoping to ride a wave of enthusiasm for her candidacy to their party&#8217;s nominating convention in Chicago this week. Vice President Harris and Walz, the governor of Minnesota, were joined by their [&#8230;]\n\n\nThe post Harris and Walz make phone calls, rally volunteers on Pennsylvania bus tour before DNC in Chicago appeared first on Boston.com.","url":"https://www.boston.com/news/politics/2024/08/18/harris-and-walz-make-phone-calls-rally-volunteers-on-pennsylvania-bus-tour-before-dnc-in-chicago/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2024/08/Election_2024_Harris_31627-66c25f9c2feda-768x432.jpg","video":null,"publish_date":"2024-08-18 20:58:40","author":"Jack Pickell","authors":["Jack Pickell"],"language":"en","source_country":"US","sentiment":0.052},{"id":254389424,"title":"Trump falsely accuses female boxers of being men and criticizes them despite winning two gold medals at the Olympics","text":"Video above: Hate speech on female boxer Khelif ‘totally unacceptable,’ IOC chief says WASHINGTON (AP) — Former President Donald Trump on Saturday again decried two gold medalist Olympic athletes, falsely labeling the female boxers as men. Trump made the comments while speaking at a campaign rally in Pennsylvania and pledging to “keep men out of women’s sports,” turned his attention to the recently concluded Olympic Games and the case of two athletes who became the subject of international scrutiny regarding misconceptions about their gender. Trump has long criticized transgender people as part of his rallies and focused specifically on transgender athletes, using language about gender identity that LGBTQ+ advocates say is wrong and harmful. In the case of the two boxers, both Imane Khelif of Algeria and Li Yu-ting of Taiwan have faced misconceptions about their gender created by the fallout from the Olympic-banished International Boxing Association’s decision last year to disqualify both fighters from the world championships for allegedly failing an eligibility test. Trump did not mention the athletes by name but remarked that “in the Olympics, they had two transitioned.” “They were men. They transitioned to women, and they were in the boxing,” Trump said. Despite being born and raised as women, Khelif and Lin found themselves in the crosshairs of Western debates about gender, sex and sports after failing the unspecified and untransparent eligibility tests for women’s competition from the now-banned International Boxing Association. Trump and other prominent figures have complained about Khelif being allowed to compete and Trump has previously referred to Khelif as a man. On Saturday, he did so again and in describing both athletes competing in the games as “crazy” and said, “It’s so demeaning to women.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nVideo above: Hate speech on female boxer Khelif &#8216;totally unacceptable,&#8217; IOC chief&#8230;\n\n\nThis Post: Trump falsely accuses female boxers of being men and criticizes them despite winning two gold medals at the Olympics first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-falsely-accuses-female-boxers-of-being-men-and-criticizes-them-despite-winning-two-gold-medals-at-the-olympics/","image":"https://internewscast.com/wp-content/uploads/2024/08/1724014635_rewrite-this-title-Trump-again-decries-two-gold-medalist-Olympic.jpg","video":null,"publish_date":"2024-08-18 20:58:38","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.05},{"id":254389270,"title":"Pro-Palestinian delegates plan to push US Democratic convention for Israel arms embargo","text":"Dozens of Muslim delegates and their allies, angry at US support for Israel’s offensive in Gaza, are seeking changes in the Democratic platform and plan to press for an arms embargo this week, putting the party on guard for disruptions to high-profile speeches at its national convention in Chicago. Calling itself “Delegates Against Genocide”, the pro-Palestinian group says it will exercise its freedom of speech rights during main events at the four-day Democratic National Convention convening on Monday to formally nominate Vice-President Kamala Harris for president in the November 5 election against Republican former president Donald Trump. Group organisers declined to give details, but said they would offer amendments to the party platform and use their rights as delegates to speak on the convention floor. US President Joe Biden is expected to speak on Monday and Harris on Thursday. Pro-Palestinian delegates say they deserve a bigger role in the writing of the party platform. The convention takes place in Chicago, which has the largest Palestinian American population of any US city. The group wants to include language backing enforcement of laws that ban giving military aid to individuals or security forces that commit gross violations of human rights. “We’re going to make our voices heard,” said Liano Sharon, a business consultant and delegate who signed an alternative platform along with 34 other delegates. “Freedom of expression necessarily includes the right to stand up and be heard even when the authority in the room says to shut up.” The Harris campaign declined to comment. The party’s draft platform released in mid-July calls for “an immediate and lasting ceasefire” in the war and the release of remaining hostages taken to Gaza during an October 7, 2023 attack by Islamist militant Hamas fighters in which Israel says 1,200 people were killed. The platform does not mention the more than 40,000 people that Palestinian health authorities in Gaza say have been killed in Israel’s subsequent offensive. Nor does it mention any plans to curtail US arms shipments to Israel. The United States approved US$20 billion in additional arms sales to Israel on Tuesday. Mediators including the US have sought to broker a truce between Israel and Hamas, which rules Gaza, based on a plan Biden put forward in May but so far have not succeeded. The war, now in its 11th month, reduced support for Democrats among Muslim and Arab-American voters, who represent crucial votes in election battleground states such as Arizona, Michigan and Pennsylvania. While the activists make up a tiny fraction of convention delegates, disruptions inside the hall and large protests outside could mar the party’s plan to unify Democrats around Harris after Biden dropped out of the race on July 21 under pressure from fellow Democrats. Pro-Palestinian activists say Harris has been more sympathetic to Gazans than Biden has been. Her national security adviser said on X, formerly Twitter, this month that she does not support an arms embargo on Israel. But after meeting Israeli Prime Minister Benjamin Netanyahu last month, Harris told reporters not only that Israel had a right to defend itself but also in reference to Gaza: “We cannot allow ourselves to become numb to the suffering and I will not be silent.” Some 40,000 protesters are expected to gather outside the convention on Monday to demonstrate against the Biden administration’s position on Israel. Organisers say the number could swell to more than 100,000. Nadia Ahmad, a law professor at Florida’s Barry University and a delegate, said there were about 60 Muslim delegates, a fraction of the 5,000 overall. But their concerns were shared by others, she said. The Uncommitted National Movement, a separate effort pushing Democrats to change policy on Israel that won over 30 delegates in primary elections, also wants an arms embargo. But it has focused, unsuccessfully so far, on winning a main-stage speaking slot for a Palestinian American or Gaza humanitarian worker. Late on Saturday, convention organisers added a daytime panel discussion on Arab and Palestinian issues to Monday’s agenda and one on antisemitism. Jewish Americans, traditionally Democratic voters, have voiced concern about rising anti-Jewish activity and Muslims have denounced rising American Islamophobia. Layla Elabed, the Uncommitted National cochairwoman, Minnesota Attorney General Keith Ellison, a Muslim ally of Biden’s, and a doctor who has worked on the Gaza front lines will be speakers on the first panel, sources said. Uncommitted, which said it is not planning to disrupt the convention proceedings, is pressing Harris to make a statement about the use of US weapons to kill Palestinians.","summary":"‘Delegates Against Genocide’ will exercise freedom of speech rights at Democratic convention events to formally nominate Harris for president.","url":"https://www.scmp.com/news/world/united-states-canada/article/3274965/pro-palestinian-delegates-plan-push-us-democratic-convention-israel-arms-embargo","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/19/ecc3fabc-7290-48a1-a371-c36504f1c45f_42575a3e.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/08/07/web%20version%20walz%20china.mp4","publish_date":"2024-08-18 20:54:53","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.084},{"id":254389262,"title":"Lindsey Graham says Trump can win election if he focuses on policy: ‘Key to the White House’","text":"Sen. Lindsey Graham implored former President Donald Trump on Sunday to fixate on policy — not showmanship — in order to win this election. Graham (R-SC) echoed former UN Ambassador Nikki Haley’s comments from last week in urging Trump to focus on serious policy discussion over personally attacking his opponent, Vice President Kamala Harris. “President Trump can win this election. His policies are good for America, and if you have a policy debate for president, he wins,” Graham told NBC’s “Meet the Press” on Sunday. “Donald Trump the provocateur, the showman, may not win this election.” “I’m looking for President Trump to show up in the last 80 days to define what he will do for our country, to fix broken borders, to lower inflation,” Graham continued. The senator underscored that forcing Harris to defend her track record as vice president would put Democrats in a tough spot. “A nightmare for Harris is to defend her policy choices,” Graham surmised. “Every day we’re not talking about her policy choices as vice president, and what she would do as president, is a good day for her and a bad day for us.” “Policy is the key to the White House.” Last week, Haley, Trump’s last standing 2024 GOP primary rival, publicly warned that the 45th president — who has attacked Harris on her race identity and looks — needs to “make a serious shift” and be more “focused” on kitchen-table issues. The Palmetto State senator stressed that top Republicans, even those who critique Trump’s slash-and-dash antics and unencumbered brand of politics, should “actually campaign for the guy rather than just give advice.” “Me and Nikki need to go to Georgia. We’re giving advice on TV to President Trump,” he told “Meet the Press,” referring to others such as Florida Gov. Ron DeSantis (R) and Virginia Gov. Glenn Youngkin (R). “Let’s get together and actually campaign for the guy.” Other allies of Trump such as former adviser Kellyanne Conway, have also pressed him that the winning formula is “fewer insults, more insights and that policy contrast.” GOP vice presidential nominee JD Vance took note of those criticisms, particularly from Haley. “I think Ambassador Haley is right that we have to reach a broader group of voters, but I think that we’re doing exactly that,” Vance told “Fox News Sunday.” “We’ve been making a very simple argument that when Kamala Harris became president or vice president, I should say, she caused policies that led to a rapid increase in inflation and a rise in chaos around the world,” he added. Trump also indicated that he would “love” to have Haley campaign for him.","summary":"\"His policies are good for America, and if you have a policy debate for president, he wins,\" Graham told NBC's \"Meet the Press\" on Sunday.","url":"https://nypost.com/2024/08/18/us-news/sen-graham-trump-can-win-election-if-he-focuses-on-policy/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/lindsey-graham-pleads-donald-trump-87950682.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/pEWfQHZD-RyIcpnTz.mp4","publish_date":"2024-08-18 20:50:50","author":"Ryan King","authors":["Ryan King"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.113},{"id":254391070,"title":"Fact Check: Sen. Tammy Duckworth Falsely Claims Tim Walz Is a 'Retired Command Sergeant Major'","text":"CLAIM: Sen. Tammy Duckworth (D-IL) claimed Sunday that Democrat vice-presidential candidate Gov. Tim Walz (MN) is a “retired command sergeant major.” VERDICT: FALSE. Walz is not a retired command sergeant major. He was promoted to command sergeant major, but his rank was reduced to master sergeant a day before he retired, due to his failure to complete the requirements to remain a command sergeant major. Thus, he is a retired master sergeant (E-8), not a retired command sergeant major (E-9). WATCH — Sen. Duckworth: Republican Attacks on Tim Walz Are “Despicable”: Duckworth said on ABC News’s This Week, “This man served 24 years in uniform. He was a — he’s a retired command sergeant major. I’m excited to have a retired command sergeant major in the vice president’s office, in the Situation Room, when we look at issues of conflicts around the world. It’s going to be great to have that experience.” Despite Walz not being a retired command sergeant major, he has claimed that he is one since he retired from the Minnesota National Guard on May 16, 2005. The rank and title of command sergeant major carries weight — as a command sergeant major is in charge of enlisted soldiers in a battalion. While Walz was promoted to command sergeant major, he did not retain that rank, since he retired before his contract was up and did not finish the Sergeant Majors Academy. He was reduced back to a master sergeant on May 15, 2005, a day before he retired, according to a statement from the Minnesota National Guard released on August 13, 2024. The statement said (emphasis added): Governor Tim Walz received his notification of eligibility for retirement on August 3, 2002. He was promoted to sergeant major (E-9) on September 17, 2004, and immediately began serving as the command sergeant major for the 1st Battalion, 125th Field Artillery while his packet was submitted to the National Guard Bureau to appoint him to command sergeant major (E-9). Once approved by NGB, he was laterally appointed to command sergeant major (E-9) on April 1, 2005. He retired from the Minnesota National Guard on May 16, 2005. Our records do not indicate when he made his request to retire. Leadership reviews and approves all requests to retire. He was administratively reduced to master sergeant (E-8) on May 15, 2005, because he did not complete all required U.S. Army Sergeants Major Academy coursework. Just got an email from a reader asking for the \"link\" to the statement from the Minnesota National Guard saying Tim Walz's rank was reduced to master sergeant a DAY BEFORE he retired — below is the emailed press statement I and other reporters got. pic.twitter.com/X5gSnHU6OD — Kristina Wong ?? (@kristina_wong) August 18, 2024 Duckworth, herself a retired Army National Guard reservist, should know the distinction between the ranks of a command sergeant major and a master sergeant, yet she perpetuated the lie. WATCH — U.S. Veteran: Tim Walz Should Drop Out of Presidential Race for Lying About His Rank: Matt Perdie / Breitbart News However, she appeared to cover for Walz and deflect, calling it “despicable” for Republicans to point out Walz’s lies. “And, frankly, it’s despicable what Republicans are doing, the same party that thinks that Donald Trump, who dodged a draft five times, who thinks veterans are suckers and losers, that’s who they think is better than someone who served 24 years in uniform, protecting and defending us every single day,” Duckworth said. She added, “And, frankly, I don’t have a single problem with Tim Walz. I think he’s, in fact, somebody that I think will be very good for America to have in the Situation Room, with his vast military experience.” Walz never deployed to war, serving one deployment to Italy in 2003, despite claiming to be “in war,” and not correcting people when they erroneously called him an Afghanistan War veteran. Follow Breitbart News’s Kristina Wong on ”X”, Truth Social, or on Facebook.","summary":"CLAIM: Sen. Tammy Duckworth (D-IL) claimed Sunday that Democrat vice-presidential candidate Gov. Tim Walz (MN) is a \"retired command sergeant major.\"\n\n\nThe post Fact Check: Sen. Tammy Duckworth Falsely Claims Tim Walz Is a &#8216;Retired Command Sergeant Major&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/08/18/fact-check-sen-tammy-duckworth-falsely-claims-tim-walz-is-a-retired-command-sergeant-major/","image":"https://media.breitbart.com/media/2024/08/GettyImages-1449688693-640x335.jpg","video":null,"publish_date":"2024-08-18 20:50:42","author":"Kristina Wong","authors":["Kristina Wong"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.157},{"id":254389136,"title":"Harris and Walz conclude campaigning before convention in Chicago","text":"Pressed on whether it was wrong for Democrats to push Biden out of the race, Pritzker said there remains “an enormous amount of reverence” for Biden despite his struggle to maintain support in the weeks leading up to the DNC after his poor June debate performance. “For 50 years, he has fought for the American people and for working families. And so as we were approaching this convention, I think everybody was looking at the polls and seeing that there were some real challenges ahead,” he said. “There is a danger on the horizon here, and that is that Donald Trump might become president again. And it’s a danger that a majority of Americans will reject. But they need to know that who they’re voting for is somebody that they can be excited and electrified by. And I think they weren’t feeling that about Joe Biden.” Pritzker anticipated that the convention will be a “celebration” of Biden and what he has accomplished during his presidency. “We’re also going to see how Kamala Harris has brought the party together with Tim Walz — by the way, a good friend of mine and a fellow Midwestern governor, who’s an everyday guy and somebody that everybody relates to,” he said. “So, I think that collection, that pair, it has turned this place into — well, frankly, it’ll be like a rock concert. I think people are going to be cheering and pretty excited.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nIllinois Gov. JB Pritzker dismissed comparisons between the 1968 DNC and the&#8230;\n\n\nThis Post: Harris and Walz conclude campaigning before convention in Chicago first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/harris-and-walz-conclude-campaigning-before-convention-in-chicago/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Harris-and-Walz-make-final-campaign-stops.jpg","video":null,"publish_date":"2024-08-18 20:48:14","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.039},{"id":254388846,"title":"Democratic National Convention to start in Chicago: Here’s the details, where to watch","text":"In a dramatic and historic reversal of fortunes, President Joe Biden will deliver the keynote address on the opening day of the Democratic National Convention instead of accepting the party’s nomination at the end of the four-day event. Meanwhile outside the DNC in Chicago, thousands of protesters are expected to rally for a ceasefire in the Israel-Hamas war — bringing back memories from the 1968 DNC in the Windy City. In the weeks that followed Biden’s disastrous late June debate performance and subsequent decision to step aside from political consideration, Vice President Kamala Harris’ campaign has taken off like a rocket. Her campaign has more than recovered what ground was lost to the public’s perception of the sitting president’s ability to meet the rigors of office thru another four-year term — and evidently frustrating former President Donald Trump’s plan to campaign against the 81-year-old incumbent former candidate’s apparently diminished capabilities. Harris, buoyed by renewed political enthusiasm among the nation’s left-leaning constituency and essentially uncontested by party leaders, now suddenly stands ready to ceremonially accept the party nomination she already won via roll call vote not even two weeks ago. Biden, meanwhile, will set the stage with a speech scheduled for Monday evening. “The President will give the keynote address at the Democratic National Convention. The First Lady will also speak at the Democratic National Convention on Monday night,” according to the White House. What is the DNC? The Democratic National Convention will bring together around 4,600 party delegates from across the country for a four-day meeting during which the party’s platform will be officially adopted. Under normal circumstances it’s also where the party’s nomination vote would take place. This year’s convention will feature a ceremonial nomination for Harris and her running mate, Minnesota Gov. Tim Walz. Harris, and according to party rules Walz by extension, was officially nominated by 99% of the party’s delegates during a five-day long virtual roll call vote that ended on Aug. 6. The Vice President was the only candidate allowed a vote, after a short nominating window opened following Biden’s July 21 decision to exit the race and closed without a contender surfacing. When and Where is the DNC? This year’s event will be held in Chicago, with speeches given at the United Center in the evening and policy meetings held at McCormick Place during the day, from Monday through Thursday. The DNC was last held in Chicago in 1996, when former President Bill Clinton was seeking reelection. The entire event will be broadcast live by C-SPAN, on both their cable network and their mobile app, and most news networks are scheduled to cover the evening speeches or hold special programing. The event will also stream on the DNC website, YouTube, and the social media platform formerly known as Twitter. Who will be there? The event will feature a who’s-who of Democratic politicians. An official schedule has not yet been released, but in addition to the President and First Lady, former Secretary of State Hillary Clinton is reportedly slated to speak Monday. Axios is reporting that the theme of the evening is “For the People.” Former President Barack Obama and former First Lady Michelle Obama are expected to deliver addresses on Tuesday alongside Harris’ husband, Second Gentleman Doug Emhoff, under the theme “A Bold Vision for America’s Future.” Walz will accept the vice presidential nomination on Wednesday when he’ll be joined by former President Clinton and Transportation Secretary Pete Buttigieg, under the theme “A Fight for Our Freedoms.” Harris will speak and accept the party nod on Thursday, simultaneously becoming the first Black woman and first Asian American to secure a major party presidential nomination is U.S. history. The theme that evening will be “For our Future.” Former Speaker of the House Nancy Pelosi, Senate Majority Leader Chuck Schumer, House Minority Leader Hakeem Jeffries, Illinois Gov. J.B. Pritzker, and Chicago Mayor Brandon Johnson are also expected to address the convention. Massachusetts Gov. Maura Healey will be in attendance, and is scheduled to lead an LGBTQ+ caucus event on Monday. The other team Republicans held their own convention in Milwaukee last month, when Trump secured the party nomination for a third time running and announced U.S. Sen. JD Vance would join him on the ticket. That event, which on Sunday Trump’s campaign dubbed “the most unifying political event in history,” came not long after an apparent assassination attempt against the former president. Whereas Trump “demonstrated tremendous strength and resolve following an attempt on his life,” according to Trump Campaign Senior Advisors Chris LaCivita and Susie Wiles, Harris will use the DNC to “hide behind celebrities because everyday families know that she has been an absolute disaster for our nation, and real Americans are worse off now than four years ago.” Trump’s campaign also announced a five day swing-state tour to coincide with the DNC. Protests In an eerie echo of the 1968 DNC that saw protestors violently suppressed by the police and Illinois National Guard, this year’s DNC is expected to include plenty of counter programming. Where before it was Vietnam, this time protestors are concerned over Harris’ apparent support of Israel as they continue a military campaign in Gaza. Thousands of protestors are expected, and Gov. Pritzker is warning them to be on their best behavior. “We intend to protect the protesters’ First Amendment rights, and also the residents of the city of Chicago and the visitors to Chicago at the same time,” he told the Associated Press.","summary":"President Joe Biden will set the stage at the DNC with a speech scheduled for Monday evening.","url":"https://www.bostonherald.com/2024/08/18/democratic-national-convention-to-start-in-chicago-heres-the-details-where-to-watch/","image":"https://www.bostonherald.com/wp-content/uploads/2024/08/US-NEWS-DNC-HARRIS-PH.jpg?w=1024","video":null,"publish_date":"2024-08-18 20:46:34","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.04},{"id":254389062,"title":"Vance says voters see Harris as ‘more of the same’ instead of ‘fresh start’","text":"Sen. J.D. Vance (R-OH) argued voters view a presidency under Vice President Kamala Harris as “more of the same” they experienced under President Joe Biden, and that voters will instead want to go back to former President Donald Trump’s leadership. Vance, Trump’s 2024 running mate, argued that Harris’s campaign has experienced a “sugar high” since she stepped in for Biden as the Democratic Party’s 2024 nominee, citing the Trump campaign’s internal data that Harris’s support has “leveled off.” He contended that voters do not buy the idea of Harris addressing inflation as president, joking that Harris being in charge of inflation policy would be like Jeffrey Epstein being in charge of human trafficking policy. “The American people are much smarter than that,” Vance said on Fox News Sunday with Shannon Bream. “They don’t buy the idea that Kamala Harris represents a fresh start. She is more of the same. It is doubling down on the failed policies of the Biden administration to give Kamala Harris a promotion rather than to fire her, which is what I think most Americans are going to do on November.” The vice presidential candidate also dismissed polling that has placed Harris ahead of Trump, arguing press outlets release “fake polls to drive down Republican turnout” ahead of elections. He also said his campaign is in “a very, very good spot,” and that all it needs to do is make it to the finish line. Regarding the Harris campaign, Vance argued that the campaign’s case to voters is to “forget how good things were” under Trump’s leadership. “We cannot give her more power and more influence; she’s just going to do more of the same, which has already made the affordability crisis for Americans very, very real,” Vance said. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER During a campaign rally in Michigan, Vance deemed Harris’s presidential ticket as “fake” for making promises to improve the lives of voters even though Harris had already been vice president for almost four years. He also said Wednesday that he believes voters are “too smart” to vote for Harris come November. Vance is set to debate Gov. Tim Walz (D-MN), Harris’s 2024 running mate, on Oct. 1 at the vice presidential debate, which will be hosted by CBS News. Trump and Harris, meanwhile, will participate in a presidential debate hosted by ABC News on Sept. 10.","summary":"Sen. J.D. Vance (R-OH) argued voters view a presidency under Vice President Kamala Harris as “more of the same” they experienced under President Joe Biden, and that voters will instead want to go back to former President Donald Trump’s leadership. Vance, Trump’s 2024 running mate, argued that Harris’s campaign has experienced a “sugar high” since [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3125394/vance-voters-see-harris-more-same-instead-fresh-start/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Vance-inflation-scaled.webp","video":null,"publish_date":"2024-08-18 20:45:13","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","source_country":"US","sentiment":-0.36},{"id":254388842,"title":"Don Lemon shocked by deep blue New Jersey voters’ support for Trump in 2024","text":"Former CNN host Don Lemon appeared to be surprised by historically deep blue New Jersey where voters told him that they would be supporting Donald Trump in the election. Lemon recently spoke to folks in Atlantic City and attempted to defend Vice President Harris in a video he posted on Saturday. The first interviewee said, “Trump for the win,” and added Vice President Harris wasn’t good for the lead role. “Does it have anything to do with being a woman?” the former CNN host replied, and the person said it had nothing to do with her gender. Harris quickly took over President Biden’s position at the top of the Democratic ticket after the president announced he would be dropping out of the race, following weeks of pressure from fellow Democrats. “Four years ago, it was a lot better. I made a lot more money than I do now,” another voter said. Lemon pushed back and said, “I know you feel that way, but that’s not actually what the record shows, the economy was better under Biden.” The voter laughed as Lemon added, “No, I’m serious.” “Do you watch CNN?” the voter shot back. One voter Lemon spoke to said he thought Harris would win the election, but said he planned to support Trump, because Harris doesn’t “have any experience.” Lemon shot back, “she’s the vice president, she’s a senator.” The next woman in the video said she wanted Trump to win and said she wanted somebody that had a “stronger background with the military.” Lemon told the interviewee that Harris had been a prosecutor, an attorney general, a senator and the vice president. Another voter said he was supporting the former president because of Harris’ record on immigration and the border crisis. Lemon’s video concluded with the reporter saying, “I’ve got to get out of Atlantic City. Where are we going to next?” The former CNN journalist also recently stopped in Pittsburgh, Pennsylvania, and found that most of the voters he spoke to were planning to support Harris. “It’s about time. We don’t just have a woman represent[ing] the country, but a woman of color. She’s going to be able to represent, I think, a broader group of people than anybody else we’ve ever seen,” one woman told Lemon. The Harris campaign announced on Wednesday that she would institute a “federal ban on price gouging on food and groceries” as president in an attempt to stop “big corporations” from taking advantage of consumers. Washington Post columnist Catherine Rampell criticized Harris’ proposal, writing, “It’s hard to exaggerate how bad this policy is.” “But more to the point: If your opponent claims you’re a ‘communist,’ maybe don’t start with an economic agenda that can (accurately) be labeled as federal price controls,” she wrote. “We already have plenty of economic gibberish coming from the Republican presidential ticket. Do we really need more from the other side, too?”","summary":"Lemon's video concluded with the reporter saying, \"I've got to get out of Atlantic City. Where are we going to next?\" ","url":"https://nypost.com/2024/08/18/us-news/don-lemon-shocked-by-deep-blue-new-jersey-voters-support-for-trump-in-2024/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/100-individuals-defining-next-generation-87951222.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/90G8aY75-RyIcpnTz.mp4","publish_date":"2024-08-18 20:40:41","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":-0.515},{"id":254389426,"title":"Conservatives Are Already Working to Enact Their Project 2025 Agenda","text":"With former President Donald Trump actively running away from Project 2025, the controversial policy and personnel program’s leaders have maintained they’ve already accomplished their goals — and will still provide Trump’s team with their lists of policy recommendations and potential second term hires. But the Heritage Foundation, the conservative think tank that produced Project 2025, isn’t waiting around for a second Trump administration to begin implementing its agenda — it’s working to do so right now. As journalist Chris Geidner reports, the Heritage Foundation filed a lawsuit last week attempting to block the Biden administration’s guidance protecting LGBTQ employees from discrimination in the workplace. The suit also seeks to limit the powers of the Equal Employment Opportunity Commission (EEOC). Those aims line up closely with items in Project’s 887-page policy blueprint. In the lawsuit, the Heritage Foundation complains that the protections for LGBTQ workers — which require employers to use employees’ preferred pronouns and allow them to use bathrooms that match their gender identity — could force the organization to spend money to update its dress code and renovate its bathrooms. The lawsuit notes that Heritage Foundation employees must “come to work in professional dress,” and that “Heritage employees dress in a manner traditionally befitting their biological sex.” It adds that “employees use Heritage’s on-site bathroom, shower, and nursing facilities according to biological sex, and use pronouns that correspond to people’s biological sex in the workplace and in their work product.” The organization worries it would “need to devote significant time and resources to creating or updating policies, customs, or training programs,” and may have to spend “significant financial resources” in order to convert its “existing sex-specific intimate facilities into single-occupancy units.” (The Heritage Foundation reported $106 million in revenue in 2022, and $332 million in net assets.) The foundation further warns that adhering to President Joe Biden’s LGBTQ protections will cause “substantial brand and reputational damage, resource costs (such as staff resignations, fewer applications for staff openings, and lost donor support) and moral costs (such as lower employee morale, loss of employee privacy and safety, and forced affirmation of philosophical, moral, and ideological beliefs).” The Heritage Foundation says this is “unacceptable,” because the organization “is one of the most prominent public voices against the very gender ideology” expressed in the Biden administration guidance. By filing the lawsuit with Texas Attorney General Ken Paxton (R) in the Amarillo Division of the Northern District of Texas, the Heritage Foundation ensured the case would be heard by an ultra-conservative Trump appointee, Judge Matthew Kacsmaryk. Conservative organizations have strategically filed lawsuits before Kacsmaryk in recent years, because he is one of the most reliably right-wing actors in the federal judiciary. A former lawyer for a conservative Christian litigation group, Kacsmaryk tried to ban the abortion pill mifepristone nationwide. The case was apparently too contrived for the Supreme Court’s conservative supermajority; this summer, the court issued a unanimous ruling protecting access to mifepristone, at least for now. Kacsmaryk has already previously blocked two efforts from Biden to protect LGBTQ Americans. Before he became a judge, Kacsmaryk wrote a commentary in the National Catholic Register complaining about how many gender-identity options users could select on Facebook. He warned: “As sexually revolutionized definitions of marriage, sexuality and sexual identity are mainstreamed and codified in the non-discrimination boilerplate, faith-based organizations cannot safely assume that their external contracts, grants, or cooperative agreements honor their sincerely held religious beliefs.”","summary":"The Heritage Foundation isn’t waiting for a Trump presidency to try to limit workplace protections for LGBTQ Americans","url":"https://www.rollingstone.com/politics/politics-news/trump-project-2025-heritage-foundation-lgbtq-1235082563/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/trump-heritage-one.jpg","video":null,"publish_date":"2024-08-18 20:35:40","author":"Andrew Perez","authors":["Andrew Perez"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.329},{"id":254389064,"title":"Trump campaign hitting key battleground states in effort to counter DNC","text":"While the Democratic National Convention will serve as a national pitch for Vice President Kamala Harris‘s White House bid, former President Donald Trump‘s campaign is not sitting idly as the Democrats gather in Chicago. The Trump campaign announced a slew of events with the presidential nominee and Trump’s running mate, Sen. J.D. Vance (R-OH), in several key battleground states. The events will center on several key issues of the campaign, including the economy, crime, national security, and immigration. On Monday, Trump will host an event on the economy in York, Pennsylvania, while Vance will hold an event on the same topic in Philadelphia. Trump and Vance will hold events about crime on Tuesday, with Trump going to Detroit, Michigan, and Vance going to Kenosha, Wisconsin. On Wednesday, Trump and Vance will hold an event focusing on national security in North Carolina, while on Thursday, Trump and Vance will host individual events about immigration. Trump’s Thursday event will be in Montezuma Pass, Arizona, while Vance’s event that day will be in Valdosta, Georgia. Trump will hold two events on Friday, including a rally in Glendale, Arizona, and an event focusing on his “no tax on tips” proposal in Las Vegas, Nevada. The Republican’s campaign said it is hoping to provide a contrast to the DNC, where they claim Harris’s campaign will “hide behind celebrities because everyday families know that she has been an absolute disaster for our nation.” “As they meet Americans where they are in battleground states across the country, President Trump and Senator Vance will remind voters that under their leadership, we can end inflation, protect our communities from violent criminals, secure the border, and Make America Great Again,” Trump campaign senior advisers Chris LaCivita and Susie Wiles said in a statement Sunday. While Trump will be campaigning in key swing states, the campaign has also said it will hold press conferences in Chicago, where the DNC is being held, for each day of the convention, where Trump allies will boost the former president‘s bid to return to the White House. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER While Trump’s campaign traverses the key battleground states, they will look to improve polling which has shown Harris close the gap the former president had when President Joe Biden was at the top of the Democratic ticket. The Democratic National Convention, where Harris is scheduled to accept the party’s nomination in a prime-time speech on Thursday, will begin on Monday in Chicago. Other notable speakers include Biden and former presidents Barack Obama and Bill Clinton.","summary":"While the Democratic National Convention will serve as a national pitch for Vice President Kamala Harris&#8216;s White House bid, former President Donald Trump&#8216;s campaign is not sitting idly as the Democrats gather in Chicago. The Trump campaign announced a slew of events with the presidential nominee and Trump&#8217;s running mate, Sen. J.D. Vance (R-OH), in [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3125380/trump-campaign-hitting-key-battleground-states-counter-dnc/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/trump-rally-dnc-2024.webp","video":null,"publish_date":"2024-08-18 20:34:20","author":"Jack Birle","authors":["Jack Birle"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.308},{"id":254389700,"title":"Sweet home, Chicago: the Democrats return to the site of their most tumultuous convention. This time, they are united","text":"Democratic Party delegates from across the United States will gather in Chicago for the Democratic National Convention (DNC) this week. While the usual purpose of a convention is for delegates from around the country to confirm the party’s nominee for a presidential election, this time around, Kamala Harris has already been confirmed by a virtual roll call. Presidential nominees these days have usually been decided through the party’s primary voting process by the time the convention arrives. As a result, modern conventions are primarily a media opportunity. It’s often where a vice-presidential candidate is introduced to a national audience and the “ticket” publicly stands together for the first time. Conventions also help to mobilise the party and its voting base, inspiring people to volunteer, encouraging party unity and, perhaps most importantly, boosting fundraising for the campaign. These huge events, which usually go for nearly a week, are also a rare opportunity for a party to attract a broad, prime-time audience. The nominees’ speeches are subject to a great deal of scrutiny. This means that, like presidential debates, conventions tend not to matter until they do. A good convention speech can make or break a politician’s career. At the 2004 DNC in Boston, for example, then-Senator Barack Obama’s keynote address launched his national political career. Four years later, he was the party’s presidential nominee. This DNC is different from those past, largely due to incumbent President Joe Biden’s decision to step aside last month and endorse Harris. And Harris has already announced and started campaigning with her running mate, Tim Walz. Stability has been secured, in an unprecedented manner. After the tensions and ruptures of recent weeks, the Democrats now need to demonstrate their unity. The fact that a national convention in Chicago is their best opportunity to do so, however, is filled with political resonance. Chicago’s meaning for the Democratic Party. Coincidentally, the last time a sitting Democratic president, Lyndon B. Johnson, decided not to run for a second term (in 1968), the DNC also met in Chicago to anoint his successor. This was the last “brokered convention”, where the presidential nominee was decided by an open vote. That 1968 convention was a traumatic experience for the party, marked by turmoil inside the convention and clashes between protesters and police outside on the streets. But Chicago has also been a site of hope and promise for the party. After all, this was where Obama, as a young Harvard graduate and community organiser, started his career in politics. Obama became the 2008 presidential nominee following a bruising Democratic primary against Hillary Clinton. But the party coalesced around him in an ultimately successful campaign. The 2008 convention was pivotal for the party, demonstrating how it could restore unity after a period of discord. Just a few short weeks ago, it seemed as though this Chicago convention would mirror that of 1968. But after much internal debate over Biden’s candidacy, the Democrats have coalesced behind a new chosen candidate. So, there will be echoes of both 1968 and 2008 in Chicago this week. And knowing this history is vital to understanding the current state of the Democratic Party. The ghosts of 1968 The 1968 Democratic National Convention came at a pivotal moment in the country’s devastating war in Vietnam. In January of that year, the Tet offensive undermined the assurances Johnson had been giving the nation that the US was in the ascendancy and the end of the conflict was in sight. Facing mounting pressure, Johnson was challenged by anti-war candidate Eugene McCarthy in the Democratic primaries. The strength of McCarthy’s showing in the New Hampshire primary in March rocked the party. Four days later, Robert F. Kennedy announced he was entering the contest. By the end of the month, Johnson had decided to step aside. There were also widespread protests outside the party’s ranks – most of it targeted at the Democratic administration. The anti-war movement overlapped with students demanding greater control over their lives and American society, Black Power activists determined to resist what they considered a system of racialised violence, and the burgeoning women’s liberation movement. Together, these groups believed there was serious decay at the heart of American political life. And for many, the Democratic Party under Johnson came to represent everything they were against. In a year of such dramatic social upheaval and polarisation, both Kennedy and Martin Luther King Junior were targets of political violence. After King was assassinated in April, protests and riots broke out in many cities, shaking the nation. Months later at the DNC, protesters were waiting for the delegates when they arrived. Chicago Mayor Richard Daly was a hardened and traditional Democratic Party boss with no sympathy for the anti-war generation. His police force was empowered to quell the protests with violence if it deemed it necessary. And they did just that. Throughout the convention, the city’s streets were consumed by protests and violence. Republicans eagerly seized upon this, promising further discord if the Democrats were allowed to continue to govern. Meanwhile, inside the arena, the party’s bruising battles over its identity and purpose were exposed to an eager media. This included physical altercations on the convention floor. With the strong support of the party establishment, Vice President Hubert Humphrey won the nomination – to the anger of anti-war activists. Humphrey had been anointed by party bosses without contesting a single primary, prompting changes to how the party chose its presidential nominees. Humphrey would go on to lose the presidential election that November to Richard Nixon. Read more: 2024 is not 1968 − and the Democratic convention in Chicago will play out very differently than in the days of Walter Cronkite Return to the ‘windy city’ Returning to Chicago over half a century later, Democrats will be hoping for a very different outcome. This convention will offer its own tour through the party’s history. Among the early speakers will be Biden, Obama and Bill and Hillary Clinton. The rest of the convention will mark a changing of the guard: Walz, followed by Harris. The proceedings will most likely treat the past with respect, while also looking to the future. In that way, while avoiding shallow comparisons, the convention may seek to echo the joyful hope of Obama’s 2008 campaign. No doubt conscious of the party’s catastrophic failure to present a realistic and compelling vision of the future in 1968, Harris and Walz will seek to contrast their vision of hope, joy and freedom with the dark tones of their Republican rivals, Donald Trump and J.D. Vance. Haunted by 1968, Harris and her predecessors will also emphasise a message of unity. As Democrats once more return to Chicago, it remains to be seen if the homecoming will be a sweet one.","summary":"Chicago has been a site of both discord and hope for the Democrats. As the party nominates Kamala Harris this week, it will seek to put conflict behind it.","url":"https://theconversation.com/sweet-home-chicago-the-democrats-return-to-the-site-of-their-most-tumultuous-convention-this-time-they-are-united-236866","image":"https://images.theconversation.com/files/613938/original/file-20240816-25-zjqlii.jpg?ixlib=rb-4.1.0&rect=53%2C8%2C5937%2C2964&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2024-08-18 20:32:40","author":"Adjunct Senior Fellow,Honorary Fellow,Liam Byrne,RMIT University,School of Global,School of Historical and Philosophical Studies,The University of Melbourne; Emma Shortis,Urban and Social Studies","authors":["Adjunct Senior Fellow","Honorary Fellow","Liam Byrne","RMIT University","School of Global","School of Historical and Philosophical Studies","The University of Melbourne; Emma Shortis","Urban and Social Studies"],"language":"en","catgory":"politics","source_country":"AU","sentiment":0.064},{"id":254389180,"title":"The Democratic National Convention is here. Here’s how to watch it.","text":"CHICAGO (AP) — The Democratic National Convention kicks off Monday, with delegates and officials descending on Chicago after a wild few weeks that saw the party switch out its nominee, upending what had already been an unprecedented campaign year. With the departure of President Joe Biden from the campaign, and Vice President Kamala Harris’ swift ascension to the top of the ticket, Democrats have essentially rejiggered the general election fight against the Republican nominee, former President Donald Trump, just months before the Nov. 5 election. The campaign redesign has also required changes in the platform that party officials will adopt before proceedings in Chicago, as well as physical reconfigurations of the signage and other materials in and around the convention hall, to reflect Democrats’ new ticket. Here’s how to watch the action at the DNC: When is the DNC? The convention begins Monday and runs through Thursday, with televised speeches and floor activity happening each night in prime time. A complete schedule hasn’t been released, but Harris, running mate Minnesota Gov. Tim Walz, Biden, former Presidents Barack Obama and Bill Clinton, as well as 2016 nominee Hillary Clinton and former first lady Michelle Obama, are all expected to speak during the week’s evening programming. What channel is carrying the convention?The DNC will livestream on more than a dozen platforms, including the convention website, YouTube and X. For the first time in convention history, organizers say, they will also host vertical streams across TikTok, Instagram and YouTube to make the proceedings more accessible on mobile devices. Convention officials say there will be English and Spanish versions, as well as American Sign Language interpretation and an audio description service. A number of network and cable news outlets have announced special programming for the prime-time portions of the convention, when Harris and others will give speeches from the hall where delegates are convening. Other media outlets, both local and national, will stream whatever is happening on the floor. The actual space itself is closed to the public, behind several layers of security accessible only to delegates, officials, volunteers and credentialed media. The DNC has also credentialed social media influencers for this year’s convention, meaning that there may be a number of ways to see first-hand happenings across those accounts on various platforms, too. Where is the DNC taking place? Democrats are convening at the United Center, home to the NBA’s Chicago Bulls and NHL’s Chicago Blackhawks. Other facilities such as the McCormick Place Convention Center are hosting event spaces, including areas where convention officials will hold media briefings and delegates will hold caucus meetings and other gatherings. Illinois is a reliably Democratic state when it comes to presidential elections, voting for the Democratic candidate in every presidential election since 1992. Chicago was the scene of Democrats’ raucous floor fight in 1968 — a year fraught with President Lyndon B. Johnson’s decision not to seek reelection and the assassination of candidate Robert F. Kennedy — that ended with delegates defeating a peace platform seeking an end to the Vietnam War. Thousands of anti-war protesters marched in the streets and were attacked by police. There’s uncertainty afoot about the Democrats’ return to Chicago, where protesters plan to oppose the Biden administration’s support for Israel in its war with Hamas — leaving some to wonder whether a 1968 redux could be coming. Police say they’ve undergone extensive de-escalation training in preparation. Who will be on stage? Harris is expected to give her nomination acceptance on Thursday night, as is tradition. Walz will accept his nomination as her running mate on Wednesday night. Biden will speak Monday, and the Obamas are scheduled to speak Tuesday. Given the unprecedented nature of how this campaign year has unfolded, much of what the top-of-the-ticket candidates will be doing is introducing themselves to a national audience. Harris began her own run for president only four weeks ago and made Walz her pick only two weeks after that. America has still had more time to get to know Walz before his speech than they did Trump’s running mate, Ohio Sen. JD Vance, before Republicans’ convention last month. Trump waited until the convention’s opening day to announce Vance as his running mate in a post on his Truth Social platform. The DNC on Sunday listed its themes for each of the four days: “For the People,” “A Bold Vision for America’s Future,” “A Fight for Our Freedoms” and “For Our Future.” Convention organizers are likely to release more specifics each morning for that night’s programming. What’s up next? On Sept. 10, less than three weeks after the DNC wraps up, Harris and Trump are slated to meet on stage for a debate hosted by ABC News. Walz and Vance also have a debate set for Oct. 1, and it’s possible that more presidential and vice presidential debates could be scheduled. Associated Press writer Darlene Superville in Washington contributed to this report.","summary":"CHICAGO (AP) — The Democratic National Convention kicks off Monday, with delegates and officials descending on Chicago after a wild few weeks that saw the party switch out its nominee, upending what had already been an unprecedented campaign year. With the departure of President Joe Biden from the campaign, and Vice President Kamala Harris&#8217; swift [&#8230;]\n\n\nThe post The Democratic National Convention is here. Here&#8217;s how to watch it. appeared first on Boston.com.","url":"https://www.boston.com/news/politics/2024/08/18/the-democratic-national-convention-is-here-heres-how-to-watch-it/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2024/08/Election_2024_DNC_01834-66c259a62392a-768x432.jpg","video":null,"publish_date":"2024-08-18 20:32:21","author":"Jack Pickell","authors":["Jack Pickell"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.027},{"id":254388592,"title":"Kamala Harris Condemns ‘Perversion’ of Bullying, ‘Coward’ Leaders","text":"Kamala Harris condemned Donald Trump without using his name Sunday in a forceful stump speech in Rochester, Pennsylvania, on Sunday, as she and running mate Tim Walz barnstormed the state on a bus tour accompanied by their spouses. “Over the last several years, there's been this kind of perversion that has taken place, I think, which is to suggest that the measure of the strength of a leader is based on who you beat down when,” Harris said, flanked by her husband Doug Emhoff, Walz and his wife Gwen Walz. “What we know is the real and true measure of the strength of a leader is based on who you lift up.” “That's what strength looks like. Anybody who's about beating down other people is a coward,” she added.","summary":"Angela Weiss/AFP via GettyKamala Harris condemned Donald Trump without using his name Sunday in a forceful stump speech in Rochester, Pennsylvania, on Sunday, as she and running mate Tim Walz barnstormed the state on a bus tour accompanied by...","url":"https://nation.lk/online/kamala-harris-condemns-perversion-of-bullying-coward-leaders-274068.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-18 20:30:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":0.078},{"id":254388192,"title":"Kamala Harris Condemns ‘Perversion’ of Bullying, ‘Coward’ Leaders","text":"Kamala Harris condemned Donald Trump without using his name Sunday in a forceful stump speech in Rochester, Pennsylvania, on Sunday, as she and running mate Tim Walz barnstormed the state on a bus tour accompanied by their spouses. “Over the last several years, there's been this kind of perversion that has taken place, I think, which is to suggest that the measure of the strength of a leader is based on who you beat down when,” Harris said, flanked by Walz, her husband Doug Emhoff, and his wife Gwen Walz. “What we know is the real and true measure of the strength of a leader is based on who you lift up.” “That's what strength looks like. Anybody who's about beating down other people is a coward,” she added. Harris, Walz, and their spouses barreled through the critical swing state throughout Sunday as they seek to shore up support ahead of this week’s Democratic National Convention in Chicago. The state is a pivotal part of both her and Donald Trump’s quest for 270 electoral votes. Trump visited the state for a rally in Wilkes-Barre on Saturday and will return for another event on Monday. In her speech on Sunday, Harris praised Pennsylvania Sen. Bob Casey and Rep. Chris Deluzio and acknowledged the state’s importance. “You’ve got a lot of work Pennsylvania on your shoulders right now that you're carrying,” she told supporters. Harris used that framing to emphasize her “fight” message, an element of her theme surrounding protecting individual freedoms. “This campaign for us is really born out of love of country,” she said. “We love our country, and we know our country is going to be as strong as our willingness to fight for it, and to fight for what we stand for.”","summary":"Angela Weiss/AFP via GettyKamala Harris condemned Donald Trump without using his name Sunday in a forceful stump speech in Rochester, Pennsylvania, on Sunday, as she and running mate Tim Walz barnstormed the state on a bus tour accompanied by their spouses.\n\n“Over the last several years, there's been this kind of perversion that has taken place, I think, which is to suggest that the measure of the strength of a leader is based on who you beat down when,” Harris said, flanked by Walz, her husband Doug Emhoff, and his wife Gwen Walz. “What we know is the real and true measure of the strength of a leader is based on who you lift up.”\n\n“That's what strength looks like. Anybody who's about beating down other people is a coward,” she added.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/kamala-harris-condemns-perversion-of-bullying-coward-leaders","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3573,w_6351,x_0,y_207/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1724010952/GettyImages-2166623173_bnyqbl","video":null,"publish_date":"2024-08-18 20:24:47","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.184},{"id":254388380,"title":"Yomiuri: Japan’s Kishida plans U.S. visit in late September","text":"TOKYO >> Outgoing Japanese Prime Minister Fumio Kishida is finalizing plans to visit the U.S. in late September for the U.N. General Assembly and a possible meeting with President Joe Biden, the Yomiuri newspaper reported on Saturday. The visit may take place for several days starting on Sept. 22, the report said, citing multiple government sources it did not identify. The Japanese Foreign Ministry, in response to a request for comment from Reuters, said “nothing has been decided yet”. Kishida on Wednesday dropped out of the leadership race for the ruling Liberal Democratic Party, meaning he will step down as prime minister when his term as party leader ends in late September. The date of the LDP election is not yet set. It could be as early as Sept. 20, in which case Kishida would likely address the General Assembly after Japan’s parliament, where the LDP has a majority, has chosen his replacement as prime minister, according to the Yomiuri. Some in the Japanese government think it best if Kishida’s successor does not develop close ties with Biden, who is due to leave office in January, the newspaper said. Biden, who dropped out of November’s U.S. presidential election, was replaced as the Democratic Party nominee last month by Vice President Kamala Harris. She faces the Republican candidate, former President Donald Trump.","summary":"TOKYO >> Outgoing Japanese Prime Minister Fumio Kishida is finalizing plans to visit the U.S. in late September for the U.N. General Assembly and a possible meeting with President Joe Biden, the Yomiuri newspaper reported on Saturday.","url":"https://www.staradvertiser.com/2024/08/18/breaking-news/yomiuri-japans-kishida-plans-u-s-visit-in-late-september/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-18T003120Z_1_LYNXMPEK7H004_RTROPTP_3_JAPAN-USA-KISHIDA.JPG","video":null,"publish_date":"2024-08-18 20:15:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":-0.251}]}