{"offset":0,"number":50,"available":19582,"news":[{"id":380643580,"title":"Soybean futures ease from 17-month peak as traders gauge China buying pace","text":"USDA reports more American soybean sales to China*Analysts doubt China will meet year-end soy buying target*Global wheat supplies considered ampleBy Tom PolansekCHICAGO, - U.S. soybean futures fell on Wednesday after climbing to their highest level since June 2024 in the previous session, with traders watching to see whether a wave of Chinese purchases would continue after the trade truce between Beijing and Washington.Corn and wheat futures also weakened. The soybean market has retreated after rallying on Monday, when Reuters reported that Chinese state-owned grain trader COFCO bought around 840,000 metric tons of U.S. soy for shipment in December and January. This was China's largest purchase since at least January and the most significant since a summit between U.S. President Donald Trump and President Xi Jinping in late October. The U.S. Department of Agriculture confirmed that China purchased 792,000 tons of American beans on Tuesday and reported sales of another 330,000 tons of U.S. soybeans to China on Wednesday.DOUBTS ABOUT CHINA TARGET Last month, Washington said China would buy 12 million tons of U.S. soybeans by year-end. Some analysts have doubted China will meet the deadline, though. Recent deals remain well below that volume.“This 12 million tons is probably not going to happen by the end of the year,” said Jim Gerlach, president of A/C Trading in Indiana.The most-active soybean contract on the Chicago Board of Trade was down 16-1/2 cents at $11.37 a bushel by 12:30 p.m. CST , compared with Tuesday's 17-month peak of $11.69-1/2.Some farmer selling and profit-taking by investors likely helped pressure the market, Argus analysts said in a note.\"We saw bullish momentum on Monday as China bought U.S. cargoes, but the market is a bit overbought right now,\" said one Singapore-based trader.In the wheat market, futures were recently buoyed by hopes that China could turn to U.S. supplies as part of its purchases of American farm goods. However, traders said the outlook for prices remained fundamentally bearish given ample supply in major production zones. Ukraine will not restrict wheat exports in 2025/26 due to a larger harvest and slower shipments at the start of the season, the country's deputy economy minister told Reuters.CBOT March wheat fell 10 cents to $5.49 a bushel after rising on Tuesday to a July high of $5.63-1/4. CBOT March corn dropped 8-3/4 cents to $4.40-3/4 a bushel.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/market/commodities/soybean-futures-ease-from-17-month-peak-as-traders-gauge-china-buying-pace-11763579316341.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/market1_1733465997762_1733466008348.jpg","video":null,"publish_date":"2025-11-20 19:08:35","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":-0.337},{"id":380643582,"title":"Is Trump softening crackdown on immigration, H-1B visas? US President says Saudi investors can bring their own workers","text":"Amid launching an aggressive crackdown on immigration and H-1B visas, US President Donald Trump on Wednesday said that Saudi investors can bring their own workers to the US who in turn can teach Americans.Trump made the remarks during a keynote address to a business gathering at a Saudi investment conference which took place a day after he hosted Saudi Arabia's de facto ruler Mohammed bin Salman at the White House.Addressing the summit, Trump said, “If you are coming here and if you find that we don't have people that did (work) before, we are allowing you (to bring people). To get those plants open, we want you to get that, and we want you to teach our people how to make computer chips and other things.”Trump added that he might take a little heat from the people — the people who love him and the people he loves.“You can't come in and open up a massive computer chip factory for billions of dollars like being done in Arizona, and think you are going to hire people off an unemployment line. They have to bring thousands of people with them, and I am going to welcome those people,” said Trump.Stating that he loves his conservative friends, Trump added, “I love MAGA, but this is MAGA and those people are going to teach our people how to make computer chips and in a short period of time, our people are going to be great.”During the address, Trump said that 270 billion in agreements and sales are being signed at a US-Saudi Investment Forum between dozens of companies.“I want to thank you for bringing all those jobs and all those great opportunities to America.”In a message to all the leaders and investors at the Forum, Trump said that under the Trump Administration, America is back — and America is open for business.Trump takes jibe at Joe BidenTrump also took a potshot at the former President, saying in four long years, Joe Biden secured less than $1 trillion dollars.\"In nine short months, I have secured $18 trillion dollars to rebuild our factories, create hundreds of thousands of jobs, and bring back those beautiful words — MADE IN AMERICA.The US President also claimed that 1.9 million more American-born workers are employed today than when he took office. “Under Biden, 1 out of every 4 new jobs went to increase the size of the federal government. Under my administration, 100% of all new jobs created came out of the private sector.”Trump stated that a company named GE Aerospace would deliver dozens of new airplane engines for 787 Dreamliners to Saudi Arabia.\"Every new job and every new factory created by these announcements builds up our Middle Class, and strengthens the industrial backbone of America.\"","url":"https://www.livemint.com/news/us-news/is-trump-softening-his-immigrant-h-1b-visa-crackdown-us-president-says-saudi-investors-can-bring-own-workers-in-america-11763575606402.html","image":"https://www.livemint.com/lm-img/img/2025/11/19/1600x900/logo/USA-SAUDI-NUCLEARPOWER-0_1763578277912_1763578288221.JPG","video":null,"publish_date":"2025-11-20 18:57:20","author":"Pratik Prashant Mukane","authors":["Pratik Prashant Mukane"],"language":"en","category":"politics","source_country":"in","sentiment":0.061},{"id":380685894,"title":"Dominica Republic decriminalises same-sex relations in police, army","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRainbow flag of the LGBT community \n\n International News, Latest News \n\nNovember 19, 2025\n\n\n\n\n Dominica Republic decriminalises same-sex relations in police, army \n\n\n\n\n\n\n\nSANTO DOMINGO, Dominican Republic (AFP)—A top court in the Dominican Republic on Wednesday decriminalised same-sex sexual relations for police and military members, which until now was punishable by up to two years in prison.\n\nSame-sex marriage is illegal in the Caribbean nation, which is largely Catholic and highly conservative, and where LGBTQ community members complain of routine stigmatisation.\n\nThe Constitutional Court — the highest body for issues related to Dominican law — declared references to sodomy in the legal codes of the police and armed forces as “not in accordance with the Constitution,” ordering their removal.\n\n“It has been proven that the challenged norms violate the principle of reasonableness, unjustifiably discriminate against people based on their sexual orientation, affect privacy, the free development of personality, and the right to work,” the court said.\n\n“The Constitution mandates equal consideration and respect for all people, so public authorities are obliged to provide such treatment to all Dominicans who wish to serve in the military of the country that grants them that dignified treatment,” it added.\n\n\n\n\n\n\n\n\n\nTags: Caribbean Dominican Republic same-sex relations \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Golfview Hotel hosts job fair as part of recovery efforts for hospitality sector \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n MANCHESTER, Jamaica—Golfview Hotel in Mandeville on Wednesday, hosted a job fair for individuals in central Jamaica following the passage of Hurricane... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Forex: $161.21 to one US dollar \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — The United States (US) dollar on Wednesday, November 19, ended trading at 161.21, down 75 cents, according to the Bank of Jamaica’... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n CDB issues inaugural sustainable bond in Swiss market \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n BRIDGETOWN, Barbados – The Caribbean Development Bank (CDB) said on Wednesday it has raised 100 million Swiss francs (US $110 million) in a five-year ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n TAJ clarifies circulating video as western tax offices remain closed after hurricane \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Tax Administration Jamaica (TAJ) is distancing itself from a video circulating on social media that claims to be a public service ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police seize firearm, ammunition after shooting incident on Mandela Highway \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica—Two firearms and ammunition were reportedly seized by the police following a shooting incident on the Nelson Mandela Highway in St C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide loca... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/dominica-republic-decriminalises-sex-relations-police-army/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2020/09/106cb0d2638b7f0cba244fbe9e150c84.jpg","video":null,"publish_date":"2025-11-20 03:36:31","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.246},{"id":380674110,"title":"Golfview Hotel hosts job fair as part of recovery efforts for hospitality sector","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGolfview Hotel hosted a job fair for individuals in central Jamaica on Wednesday \n\n Latest News, News \n\nNovember 19, 2025\n\n\n\n\n Golfview Hotel hosts job fair as part of recovery efforts for hospitality sector \n\n\n\n\n\n\n\nMANCHESTER, Jamaica—Golfview Hotel in Mandeville on Wednesday, hosted a job fair for individuals in central Jamaica following the passage of Hurricane Melissa, which disrupted the hospitality sector.\n\nThe job fair offers opportunities in front office, security, maintenance, housekeeping, and food and beverage service.\n\nThis initiative forms part of Golfview Hotel’s wider recovery focus, where employment and stable income are recognised as central to rebuilding lives and strengthening the national economy.\n\n“Golfview Hotel recognises that national recovery after Hurricane Melissa is about more than repairing physical structures; it is about restoring livelihoods and stability for families,” said Letesha Whyte, marketing and sales manager at Golfview Hotel and host of the job fair.\n\n“Through this job fair, Golfview Hotel is creating employment opportunities in central Jamaica so that more households can rebuild their income, regain a sense of security, and actively participate in the recovery of Jamaica’s economy.”\n\nWhyte noted that the hospitality industry remains an important engine for employment and local commerce in central Jamaica. By creating pathways to work, Golfview Hotel aims to support both the well-being of individual households and the resilience of the wider community.\n\n\n\n\n\n\n\n\nTags: Golfview Hotel Hurricane Melissa Job Fair \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Forex: $161.21 to one US dollar \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — The United States (US) dollar on Wednesday, November 19, ended trading at 161.21, down 75 cents, according to the Bank of Jamaica’... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n CDB issues inaugural sustainable bond in Swiss market \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n BRIDGETOWN, Barbados – The Caribbean Development Bank (CDB) said on Wednesday it has raised 100 million Swiss francs (US $110 million) in a five-year ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n TAJ clarifies circulating video as western tax offices remain closed after hurricane \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Tax Administration Jamaica (TAJ) is distancing itself from a video circulating on social media that claims to be a public service ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police seize firearm, ammunition after shooting incident on Mandela Highway \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica—Two firearms and ammunition were reportedly seized by the police following a shooting incident on the Nelson Mandela Highway in St C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide loca... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/golfview-hotel-hosts-job-fair-part-recovery-efforts-hospitality-sector/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/WhatsApp-Image-2025-11-19-at-13.46.43_47f2f1a3-768x1024.jpg","video":null,"publish_date":"2025-11-20 03:07:44","author":null,"language":"en","source_country":"jm","sentiment":0.14},{"id":380674108,"title":"Forex: $161.21 to one US dollar","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News \n\nNovember 19, 2025\n\n\n\n\n Forex: $161.21 to one US dollar \n\n\n\n\n\n\n\nKINGSTON, Jamaica — The United States (US) dollar on Wednesday, November 19, ended trading at 161.21, down 75 cents, according to the Bank of Jamaica’s daily exchange trading summary.\n\nMeanwhile, the Canadian dollar ended trading at $114.83 down from $115.42 and the British pound ended at $210.61 down from $212.18.\n\n\n\n\n\n\n\n\nTags: daily trade Foreign Exchange Forex \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n CDB issues inaugural sustainable bond in Swiss market \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n BRIDGETOWN, Barbados – The Caribbean Development Bank (CDB) said on Wednesday it has raised 100 million Swiss francs (US $110 million) in a five-year ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n TAJ clarifies circulating video as western tax offices remain closed after hurricane \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Tax Administration Jamaica (TAJ) is distancing itself from a video circulating on social media that claims to be a public service ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police seize firearm, ammunition after shooting incident on Mandela Highway \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica—Two firearms and ammunition were reportedly seized by the police following a shooting incident on the Nelson Mandela Highway in St C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide loca... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/forex-161-21-one-us-dollar-20251119-2151-360250/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2024/01/fcf2691526d181bd2df3311283cb5e6e.jpg","video":null,"publish_date":"2025-11-20 02:51:36","author":null,"language":"en","category":"business","source_country":"jm","sentiment":0.311},{"id":380674114,"title":"CDB issues inaugural sustainable bond in Swiss market","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe headquarters of the Caribbean Development Bank (CDB) in Bridgetown, Barbados. The regional financial institution recently successfully launched its inaugural CHF 100 million sustainable bond in the Swiss market. \n\n Latest News \n\nNovember 19, 2025\n\n\n\n\n CDB issues inaugural sustainable bond in Swiss market \n\n\n\n\n\n\n\nBRIDGETOWN, Barbados – The Caribbean Development Bank (CDB) said on Wednesday it has raised 100 million Swiss francs (US $110 million) in a five-year sustainable bond, its first such issuance under a new framework designed to fund environmental and social projects.\n\nThe bond, which carries a fixed coupon of 0.59 per cent, saw strong demand that allowed the bank to price the deal at the top of its initial guidance, CDB said in a statement. The order book closed within 90 minutes of opening.\n\nProceeds will be allocated to projects in the bank’s borrowing member countries, in areas including renewable energy, climate adaptation, sustainable water management and food security, in accordance with the bank’s Sustainable Finance Framework.\n\nThe investor base was composed mainly of treasury departments, which took 62 per cent of the deal. Asset managers accounted for 17 per cent, private banks for 11per cent, with pension plans and insurance companies each taking 5 per cent.\n\nThe Aa1/AA+/AA+-rated bank said the transaction strengthens its yield curve and demonstrates its commitment to integrating sustainability into its operations.\n\nCDB, established in 1970, has 19 borrowing members in the Caribbean and nine non-borrowing members, including Brazil, Canada, China, and the United Kingdom. Its total assets stood at US$2.02 billion as of December, 2024.\n\n\n\n\n\n\n\n\nTags: Bond Caribbean Development Bank climate adaptation \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n TAJ clarifies circulating video as western tax offices remain closed after hurricane \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Tax Administration Jamaica (TAJ) is distancing itself from a video circulating on social media that claims to be a public service ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police seize firearm, ammunition after shooting incident on Mandela Highway \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica—Two firearms and ammunition were reportedly seized by the police following a shooting incident on the Nelson Mandela Highway in St C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide loca... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/cdb-issues-inaugural-sustainable-bond-swiss-market/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/WhatsApp-Image-2025-11-19-at-3.46.25-PM.jpeg","video":null,"publish_date":"2025-11-20 02:24:29","author":null,"language":"en","source_country":"jm","sentiment":0.388},{"id":380674112,"title":"TAJ clarifies circulating video as western tax offices remain closed after hurricane","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News \n\nNovember 19, 2025\n\n\n\n\n TAJ clarifies circulating video as western tax offices remain closed after hurricane \n\n\n\n\n\n\n\nKINGSTON, Jamaica — Tax Administration Jamaica (TAJ) is distancing itself from a video circulating on social media that claims to be a public service announcement about services at the Montego Bay Revenue Service Centre (MBRSC). The agency says the video, dated Monday, November 17, 2025, is an old recording unrelated to current operations.\n\nIn the wake of Hurricane Melissa, TAJ has reopened most of its offices across the island but confirms that the Montego Bay office and several western satellite locations remain closed due to ongoing repair work. These include the Darliston, Falmouth, Jackson Town, Lucea and Savanna-la-Mar tax offices.\n\nDuring the temporary closures, taxpayers are being asked to conduct transactions at the St Ann’s Bay, Moneague and Brown’s Town tax offices.\n\nTAJ is also reminding the public that multiple online payment channels remain active, such as its official website, Direct Funds Transfer, Scotia Online, NCB Online Banking and the TAJ Mobile App.\n\nThe authority apologises for any inconvenience and urges Jamaicans to rely only on its verified communication platforms for reopening updates and service information.\n\nFor further assistance, individuals may contact the Customer Care Centre at 888-TAX-HELP, visit the TAJ website or follow the agency on social media.\n\n\n\n\n\n\n\n\n\nTags: Hurricane Melissa Montego Bay Revenue Service Centre Tax Administration Jamaica \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police seize firearm, ammunition after shooting incident on Mandela Highway \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica—Two firearms and ammunition were reportedly seized by the police following a shooting incident on the Nelson Mandela Highway in St C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide loca... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Jamaica to know play-off opponents on Thursday \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Jamaica’s Reggae Boyz will know their semi-final opponents in the play-offs for the FIFA World Cup set for March in Mexico at Thur... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/taj-clarifies-circulating-video-western-tax-offices-remain-closed-hurricane/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/mbrc.jpg","video":null,"publish_date":"2025-11-20 02:16:06","author":null,"language":"en","source_country":"jm","sentiment":-0.026},{"id":380674106,"title":"Police seize firearm, ammunition after shooting incident on Mandela Highway","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrime scene on the Nelson Mandela Highway in St Catherine where three men wereshot and killed (Photo: Llewellyn Wynter) \n\n Latest News, News \n\nNovember 19, 2025\n\n\n\n\n Police seize firearm, ammunition after shooting incident on Mandela Highway \n\n\n\n\n\n\n\nKINGSTON, Jamaica—Two firearms and ammunition were reportedly seized by the police following a shooting incident on the Nelson Mandela Highway in St Catherine, which resulted in the death of three men, on Wednesday.\n\nReports are that about 11:45 am, police officers assigned to the Counter Terrorism and Organised Crime Investigation Branch (C-TOC), acting on information regarding a black Honda Fit motor car said to be involved in several cases of robberies, spotted the vehicle along Mandela Highway and signalled the car to stop.\n\nThe occupants reportedly did not comply. The police officers reportedly intercepted the vehicle, and the occupants opened gunfire at the police.\n\nAfter the shooting subsided, three men were reportedly seen suffering from gunshot wounds. They were rushed to the Spanish Town Hospital, where they were pronounced dead.\n\nA Taurus G2C 9mm pistol, a magazine containing five 9mm cartridges and one 9mm cartridge, along with one Beretta 9mm pistol fitted with a magazine containing two 9mm cartridges and one 9mm cartridge, were reportedly seized by the police.\n\nREAD: Three fatally shot by police on Mandela Highway\n\n\n\n\n\n\n\n\nTags: ammunition Firearm Mandela Highway Police three killed \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n CDB issues inaugural sustainable bond in Swiss market \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n BRIDGETOWN, Barbados – The Caribbean Development Bank (CDB) said on Wednesday it has raised 100 million Swiss francs (US $110 million) in a five-year ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n TAJ clarifies circulating video as western tax offices remain closed after hurricane \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Tax Administration Jamaica (TAJ) is distancing itself from a video circulating on social media that claims to be a public service ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide loca... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/police-seize-firearm-ammunition-shooting-incident-mandela-highway/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/Scene-of-crime-1024x682.jpg","video":null,"publish_date":"2025-11-20 02:14:13","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.133},{"id":380657012,"title":"Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBiomedical - Caledonia Avenue, Kingston. \n\n Latest News \n\nNovember 19, 2025\n\n\n\n\n Biomedical now accepts NHF cards for key cancer and diabetes tests at all locations \n\n\n\n\n\n\n\nKINGSTON, Jamaica — Biomedical Caledonia Medical Laboratory Limited has expanded National Health Fund (NHF) card access across all its islandwide locations, allowing patients to receive subsidised pap smears, prostate-specific antigen (PSA) tests, and HbA1c diabetes monitoring.\n\nThe move means Jamaicans can now access these critical preventive screenings at any Biomedical outstation, including its recently opened Holborn Road facility in Kingston.\n\nCEO Helen Christian said the expansion aims to remove financial barriers that prevent many from getting early detection tests.\n\n“Access to affordable diagnostic testing can mean the difference between early detection and late-stage diagnosis,” she said. “Early detection saves lives, and we are committed to making these essential services available to every community we serve.”\n\nThe rollout follows collaboration with the NHF and Advanced Integrated Systems (AIS) to streamline processing across all sites, assign provider numbers, and train staff to handle NHF claims efficiently.\n\nThe NHF Card Programme supports Jamaicans living with any of 24 chronic illnesses by subsidising medications, supplies, and diagnostic tests. Regular pap smears help prevent cervical cancer, PSA tests support early detection of prostate cancer, and HbA1c testing is vital for managing diabetes—one of the country’s most widespread chronic conditions.\n\nWith more than 50 collection centres and ISO 15189 accreditation, Biomedical said it is well-positioned to improve access across communities.\n\nChristian added that the partnership with the NHF represents a step toward broader, equitable access to diagnostic services, ensuring that\n\n“Geography and finances never stand between Jamaicans and the healthcare they need,” she said.\n\n\n\n\n\n\n\n\nTags: Advanced Integrated Systems Biomedical Caledonia Medical Laboratory Limited HbA1c diabetes National Health Fund \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n Jamaica to know play-off opponents on Thursday \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Jamaica’s Reggae Boyz will know their semi-final opponents in the play-offs for the FIFA World Cup set for March in Mexico at Thur... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n UPDATE: Section of Mandela Highway closed after police shooting \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Motorists are being advised that the westbound lane of the Mandela Highway in the vicinity of the entrance to the PJ Patterson Hig... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Donovan Lewis to close St George’s College lecture series \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — St George’s College will conclude its three-part lecture series with a presentation from entrepreneur Donovan Lewis. Lewis, an inv... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/biomedical-now-accepts-nhf-cards-key-cancer-diabetes-tests-locations/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/File-Photo-Biomedical-Caledonia-Avenue-Kingston-1024x768.jpeg","video":null,"publish_date":"2025-11-20 01:30:55","author":null,"language":"en","source_country":"jm","sentiment":0.307},{"id":380657010,"title":"Trump faces moment of truth on explosive Epstein files","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUS President Donald Trump arrives for a special dinner hosted in his honour and state leaders by South Korea's President Lee Jae Myung at the Hilton Gyeongju hotel in Gyeongju on October 29, 2025. (Photo by ANDREW CABALLERO-REYNOLDS / AFP) \n\n International News, Latest News \n\nNovember 19, 2025\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nWASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wednesday, spurring a showdown over whether the US president will allow full disclosure — or return to trying to bury the case.\n\nTrump stunned Washington at the weekend, reversing his months-long opposition to the Epstein Files Transparency Act, ensuring that it sailed through Congress on Tuesday in a rare show of bipartisan unity.\n\nThe spotlight now turns to the Republican president, a former close friend of the late sex offender. Only Trump can stand in the way of the release and he has pledged to sign the bill, despite featuring heavily in the case file.\n\nInsiders warn that even with the president’s signature, his administration could lean on redactions, procedural delays or lingering federal investigations to keep explosive details out of the public eye.\n\n“Once the president signs the bill, he must apply and execute it faithfully. There must be no funny business from Donald Trump,” top Democrat Chuck Schumer warned in a speech on the Senate floor.\n\n“He must not use the excuse of frivolous investigations to release some Epstein documents, while intentionally hiding others that deserve to be seen by the American public.”\n\nEpstein, a wealthy financier, moved in elite circles for years, cultivating close ties with business tycoons, politicians, academics and celebrities to whom he was accused of trafficking girls and young women for sex.\n\nTrump and his allies spent years pushing theories about powerful Democrats being protected over involvement with Epstein, framing the case as a potent symbol of how powerful men can hide behind lawyers, money and connections.\n\nBut Trump himself was a longtime associate of Epstein, raising questions over what he knew about the notorious figure.\n\nFar beyond Trump’s conspiracy-minded voter base, the saga dented public trust in the US justice system and raised suspicion among voters who believe important pieces of the story were either hidden or ignored.\n\nEpstein’s 2019 arrest fueled a storm of outrage and pressure for a full accounting of his network, his finances and the people who helped him evade.\n\nConspiracy theories about a cover-up only deepened after his death — ruled a suicide — in a New York jail soon after.\n\n– ‘Smoke screen’? –\n\nPassage of the Epstein Files Transparency Act in Congress marked a moment of deep emotional resonance, with abuse survivors filling the House gallery as the vote was called, hugging and cheering when it passed.\n\nIt was a sharp rebuke of Trump and his ally, House Speaker Mike Johnson, who had led efforts to prevent disclosure.\n\nJohnson said he would “cross that bridge” when asked if he’d push Trump to veto the bill.\n\nThe president had warned House Republicans off the action but reversed course, fearing humiliation as he faced the largest rebellion of his presidency.\n\nOnce signed, the Justice Department has a month to dump its unclassified files online — in a searchable trove of transcripts, flight logs and communications that could unearth unseen names and connections.\n\nThe text makes only narrow exceptions for personal data and genuine legal and security concerns.\n\nBut analysts question whether officials will comply, or argue that sensitive material cannot be released because related probes remain active — including a new investigation ordered by Trump last week into Epstein’s ties with Democrats.\n\n“(This) might be a big smoke screen, these investigations, to open a bunch of them as a last ditch effort to prevent the release of the Epstein files,” Thomas Massie, the Kentucky Republican who pushed the House vote, told ABC News.\n\nThe Justice Department and FBI said in July they had uncovered no evidence in a review of the files that would support further action, and it was not clear if the new probe ordered by Trump on Friday would hamper disclosure.\n\nAttorney General Pam Bondi was pressed on the justification for further investigation and said there was “new information, additional information.”\n\n“If there are any victims, we encourage all victims to come forward,” she told reporters. “And we will continue to provide maximum transparency under the law.”\n\n\n\n\n\n\n\n\nTags: Epstein files Jeffrey Epstein US President Donald Trumpp \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Jamaica to know play-off opponents on Thursday \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Jamaica’s Reggae Boyz will know their semi-final opponents in the play-offs for the FIFA World Cup set for March in Mexico at Thur... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n UPDATE: Section of Mandela Highway closed after police shooting \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Motorists are being advised that the westbound lane of the Mandela Highway in the vicinity of the entrance to the PJ Patterson Hig... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Donovan Lewis to close St George’s College lecture series \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — St George’s College will conclude its three-part lecture series with a presentation from entrepreneur Donovan Lewis. Lewis, an inv... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Hurricane victims hopeful after visit by PM and Caricom heads \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — The visit to Whitehouse and adjoining communities in Westmoreland by Prime Minister Andrew Holness and Caribbean Community (Carico... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/trump-faces-moment-truth-explosive-epstein-files/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/10/000_82CZ9J7.jpg","video":null,"publish_date":"2025-11-20 01:16:31","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.251},{"id":380700652,"title":"Former FBI employee says he was wrongfully terminated for displaying Pride Flag","text":"WASHINGTON — A former longtime Federal Bureau of Investigation employee is suing the agency and the U.S. Department of Justice, alleging he was fired over displaying a Progress Pride Flag in his office, according to a lawsuit filed with the U.S. District Court for the District of Columbia.\n\nDavid Maltinsky had worked at the FBI as an intelligence specialist since 2009, and displayed the flag — which flew in front of the FBI's Wilshire Federal Building in Los Angeles in 2021 — in his office, gifted to him by the agency itself, according to the complaint. It also states that Maltinsky displayed the flag for several years in his office with the permission of two supervisors.\n\nThe complaint alleges that FBI Director Kash Patel unjustly fired Maltinsky in October because he \"exercised poor judgment with an inappropriate display of political signage in [his] work area during [his] previous assignment at the Los Angeles Field Office,\" according to the lawsuit, which cites Maltinsky's termination letter.\n\n\"I believe I was fired not because of who I am, but what I am: a proud gay man,\" Maltinsky said in a statement.\n\nThe lawsuit comes as President Donald Trump's administration continues to attack diversity, equity, and inclusion in the federal government, and the FBI fires employees at an unprecedented clip.\n\n\"It is obvious that David is being targeted for political reasons by Kash Patel,\" said Christopher Mattei, a partner for Koskoff Koskoff & Bieder and lead counsel representing Maltinsky. \"But that does not convert the display of a Pride Flag to a partisan political expression; to the contrary, it was a personal expression of his own identity.\"\n\nThe FBI did not immediately respond to a request for comment.\n\nWhen Maltinsky was fired, he had completed 13 of 16 weeks at the agency's Special Agent Training Academy at Quantico. Previously, he worked as an intelligence specialist supporting the agency's public corruption and cybercrime investigations. Maltinsky also received multiple accolades for diversity and inclusion at the agency, and believes that's why he was fired, he said in a statement.\n\nAccording to the complaint, Patel’s actions violated Maltinsky's First and Fifth Amendment rights, amounting to retaliation for protected expression, viewpoint discrimination, and denial of equal protection under the law. Mattei said Maltinsky is only seeking reinstatement at the agency.\n\n(Reporting by David Hood-Nuño; Editing by Lincoln Feast.)","url":"https://eu.usatoday.com/story/news/nation/2025/11/19/fbi-pride-flag-lawsuit-david-maltinsky-justice-department/87362472007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/11/20/USAT/87362771007-usatsi-19869288.jpg?auto=webp&crop=3599,2025,x0,y187&format=pjpg&width=1200","video":null,"publish_date":"2025-11-20 01:03:52","author":"David Hood-Nuño, Usa Today","authors":["David Hood-Nuño, Usa Today"],"language":"en","source_country":"us","sentiment":-0.334},{"id":380657008,"title":"Parents, guardians urged to store household chemicals properly","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHealth Promotion and Education Officer at the Westmoreland Health Department, Gerald Miller. \n\n Latest News, News \n\nNovember 19, 2025\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance in securing household chemicals, following the recent passage of Hurricane Melissa.\n\nIn an interview with JIS News, he pointed out that many children are now confined to the home, as some schools remain closed.\n\n“With the passing of Hurricane Melissa, which has devastated a lot of homes in the parish of Westmoreland, the health promotion unit is just reminding parents to be very vigilant with their children, since many homes now would have the children staying within that space, given the fact that [some] schools are out,” Miller said.\n\nHe noted that families often increase their use of sanitising products after flood events, emphasising that improper storage could put children at risk for accidental poisoning.\n\n“Ensure that the chemicals are not in the reach of the children, because we can have accidental poisoning occurring, which can place our health facilities under extreme stress,” Miller argued.\n\n“We are asking the parents to be extremely careful to secure the chemicals from the children, so as not to have them accidentally swallowing any of these chemicals that can harm them,” he cautioned.\n\nMiller further highlighted the additional pressure the health sector faces during recovery efforts after the hurricane.\n\n“We know that this is a time that our health system becomes very overburdened, and we don’t want children to be victims of accidental poisoning, because of inappropriate storage,” he said.\n\nDespite storage challenges in some homes, Miller urged families to improvise where necessary.\n\n“We know the challenges, and some persons might not have the facility for the storage, but as best as possible, even if you have to hide it in a tree or somewhere, but you can’t have that in your space, so the children can access it,” Miller said.\n\n\n\n\n\n\n\n\n\nTags: chemicals Gerald Miller parents \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n BY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n\n\n\nNovember 19, 2025 \n\n\n Jamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n Jamaica to know play-off opponents on Thursday \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Jamaica’s Reggae Boyz will know their semi-final opponents in the play-offs for the FIFA World Cup set for March in Mexico at Thur... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n UPDATE: Section of Mandela Highway closed after police shooting \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Motorists are being advised that the westbound lane of the Mandela Highway in the vicinity of the entrance to the PJ Patterson Hig... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Donovan Lewis to close St George’s College lecture series \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — St George’s College will conclude its three-part lecture series with a presentation from entrepreneur Donovan Lewis. Lewis, an inv... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Hurricane victims hopeful after visit by PM and Caricom heads \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — The visit to Whitehouse and adjoining communities in Westmoreland by Prime Minister Andrew Holness and Caribbean Community (Carico... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/parents-guardians-urged-store-household-chemicals-properly/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2020/11/d0fc88a5b4fb011e076c1a9f5f76a1bb.jpg","video":null,"publish_date":"2025-11-20 01:02:13","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.08},{"id":380701554,"title":"How Democrats—and Trump—turned 2026 into a potential blue wave","text":"Riding a streak of unexpectedly strong election wins, Democrats have found yet another reason to feel bullish about 2026. A new PBS News/NPR/Marist poll shows a clear majority of voters leaning blue if the midterms were held today—a rare cushion in an era defined by razor-thin margins. \n\nThe headline number is almost jarring: Democrats lead the generic congressional ballot 55% to 41%. That’s the party’s biggest edge in this poll since late 2017, just before Democrats flipped more than 40 House seats during President Donald Trump’s first term. The symmetry isn’t perfect, but it’s close enough to make operatives on both sides sit up straighter. It’s the same point in Trump’s presidency; same polling drift away from the GOP; same ominous rumble of a potential blue wave.\n\nBut the map today is far less forgiving. A decade of hyper-aggressive gerrymandering—much of it encouraged by Trump—has drained the battlefield of competitive districts. Red states have raced to redraw maps mid-decade, and blue states have retaliated. The House is now a chessboard engineered to resist blowouts, even as public sentiment sours against the party in power.\n\nRelated | The blue wave has Trump panicking\n\nTo be sure, the Marist survey paints a rosier picture for Democrats than most. A FiftyPlusOne average of generic-ballot polling shows the party up by only 4 points. Even so, the broader landscape appears to be tilting their way. A November poll from Strength in Numbers/Verasight had Democrats leading 47% to 42%, and that edge widened once voters were reminded that Republicans currently run Washington.\n\nIndependents shifted especially hard: In the Marist poll, they prefer a Democrat over a Republican by nearly 2 to 1, an ominous sign for a GOP already stretched thin.\n\nPart of the story is simply political gravity. When one party controls every lever of the federal government, voters tend to flirt with the other. And Democrats come into 2026 freshly emboldened by victories in New York, New Jersey, and Virginia—races that revealed just how fragile the Republican coalition has become under Trump’s second-term stewardship.\n\nThose campaigns also shared a common throughline: an unrelenting focus on the cost of living. While Republicans centered their messaging on immigration and crime, voters kept drifting back to grocery bills and rent. It shows. Fifty-seven percent of Americans say lowering prices should be the president’s top priority. Immigration—Trump’s defining crusade—lags a staggering 41 points behind.\n\nThe White House has taken notice, albeit later than many Democrats hoped. In the past few weeks, the administration has started talking more about “affordability,” even scaling back some tariffs that made basic groceries more expensive. \n\nStill, plenty of voters doubt the president really grasps how strained people feel right now. Trump has spent much of his second term focused on crime, foreign conflicts, and drug trafficking—issues where public opinion is far more diffuse. The polling suggests this disconnect is exacting a visible political cost.\n\nTrump’s approval rating has slid to 39%, the lowest of his second term, and only 24% of independents give him high marks. Nearly half the country—48%—now strongly disapproves of his performance. That’s a number he hasn’t seen since the immediate aftermath of the Jan. 6 attack on the Capitol, NPR reports.\n\nThe GOP-led government shutdown hasn’t helped. As Congress finally broke the 43-day standoff, poll respondents placed the blame squarely on Republican shoulders. Six in 10 say Trump or congressional Republicans caused the crisis, a judgment that tracks with political reality: the GOP controls the presidency, both chambers of Congress, and the Supreme Court. \n\nRelated | Here's how Democrats can take back the House\n\nBeneath all of this sits a deeper erosion. Americans’ faith in institutions has collapsed to historic lows. Congress is the worst hit—80% say they have little or no confidence in it—but the media (75%), the Supreme Court (62%), and both political parties trail not far behind.\n\nDemocrats have their own internal vulnerabilities; only 57% of Democratic voters express strong confidence in their party. Republicans fare slightly worse, and independents tilt more favorably toward Democrats on measures of honesty and open-mindedness.\n\nThe hostility between the parties is almost total. More than eight in 10 Republicans and Democrats see the other side as “closed-minded,” and roughly three-quarters say the opposing party is “dishonest.” Independents aren’t neutral arbiters—they tend to view Republicans as more closed-off and less trustworthy. It’s a quiet but meaningful advantage for Democrats, especially at a time when the GOP runs every branch of government.\n\nThis is the backdrop to the 2026 midterm elections: a country exhausted by polarization, wary of its institutions, skeptical of its president, and, for now, favoring the party that’s out of power. The map may not allow for a 2018-style wave, but the fundamentals are unmistakably aligned in Democrats’ favor.\n\nWhether they can hold that edge through another year of volatility is the open question. But at this moment, Democrats have momentum; Republicans have a Trump problem; and voters appear ready—once again—to hand the opposition the keys.","summary":"Riding a streak of unexpectedly strong election wins, Democrats have found yet another reason to feel bullish about 2026. A new PBS News/NPR/Marist poll shows a clear majority of voters leaning blue if the midterms were held today—a rare cushion in an era defined by razor-thin margins. \n\n\n\nThe headline number is almost jarring: Democrats lead the generic congressional ballot 55% to 41%. That’s the party’s biggest edge in this poll since late 2017, just before Democrats flipped more than 40 House seats during President Donald Trump’s first term. The symmetry isn’t perfect, but it’s close enough to make operatives on both sides sit up straighter. It’s the same point in Trump’s presidency; same polling drift away from the GOP; same ominous rumble of a potential blue wave.\n\n\n\nBut the map today is far less forgiving. A decade of hyper-aggressive gerrymandering—much of it encouraged by Trump—has drained the battlefield of competitive districts. Red states have raced to redraw maps mid-decade, and blue states have r","url":"https://www.dailykos.com/story/2025/11/19/2354587/-How-Democrats-and-Trump-turned-2026-into-a-potential-blue-wave?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1489562/story_image/AP25291641865470.jpg?1760819737","video":null,"publish_date":"2025-11-20 01:01:18","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":0.018},{"id":380699432,"title":"Morning Digest: SC verdict on Presidential Reference on timelines for President, Governors to clear Bills; Climate talks veer away from ‘implementation’, and more","text":"Nitish Kumar to take oath as Bihar CM for record 10th time on Nov. 20 in presence of PM Modi\n\nJanata Dal-(United) president Nitish Kumar was on Wednesday (November 19, 2025) unanimously elected as leader of the National Democratic Alliance (NDA) Legislature Party ahead of the formation of a new government under his leadership in the State on November 20. Mr. Kumar, who will take oath as Bihar Chief Minister for a record 10th time, was first elected as leader of the JD-(U) Legislature Party during the meeting with the new MLAs held at his official residence in Patna.\n\nPresidential Reference: Supreme Court verdict on November 20 on fixing timeline for President, Governors to clear bills\n\nThe Supreme Court is scheduled on Thursday (November 20, 2025) to pronounce its advisory opinion on a Presidential Reference questioning the apex court’s authority to “impose” timelines and prescribe the manner of conduct of Governors and the President while dealing with State bills sent to them for assent or reserved for consideration.\n\nClimate talks veer away from ‘implementation’\n\n“Stop the blah-blah, down with gas in Asia,” chants a group of activists in the hallways of the COP30 venue in Belém, Brazil, while they raise colourful banners and placards condemning oil and gas drilling. The walls of this sprawling venue hosting the climate talks – once this harbour-city’s airport – are makeshift and porous and these chants bleed through into the more sombre rooms where teams of delegates from a coalition of countries — nearly all of them Asian — cobble together common ground to stone-wall and delay firm action on eschewing fossil fuel use. They are collectively called the ‘Like Minded Developing Countries (LMDC).\n\nRed Fort blast: doctors with foreign degrees come under police scrutiny\n\nDoctors with medical degrees from foreign universities have come under the scanner, as the Delhi police sought their details from healthcare centres in the Capital on Wednesday (November 19, 2025). The move comes amid the police probing the doctors’ links with the terror networks following four doctors taken into custody for their suspicious involvement in the Red Fort Bomb blast case.\n\nAuthorities begin exercise of inspecting lockers of doctors, medical staff in hospitals of Jammu and Kashmir\n\nAuthorities in Jammu and Kashmir on Wednesday (November 19, 2025) began the exercise of inspecting the lockers of doctors and medical staff in hospitals as part of enhanced security measures after the recent Delhi blast and recovery of arms and ammunition in the “white collar” terror module, officials said.\n\nU.P. ATS seeks details on madrassas; opposition alleges fear mongering \n\nThe Uttar Pradesh police’s Anti-Terrorist Squad (ATS) recently made inquiries with the administration in Prayagraj for information on madrassas. They have been asked to provide details on students, clerics engaged as teachers, management and other staff. A letter from the Prayagraj field unit dated November 15 has surfaced, and it is assumed similar letters may have been sent to other districts as well. In the letter, written to the District Minority Welfare Officer of multiple districts in the Prayagraj region, the ATS said according to directions from the ATS headquarters, information on these institutions is being sought.\n\nEmployment under MGNREGS falls for second year in a row\n\nA comparison of employment generated under Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS) from April to September 2025 with the corresponding periods in the previous two financial years, 2024-25 and 2023-24, points to a declining trend, according to the biannual tracker released by Lib Tech, a consortium of academics and activists.\n\nDays after delivering death sentence for former PM Hasina, Bangladesh invites NSA Doval to visit Dhaka\n\nAmidst tense bilateral ties, Bangladesh’s National Security Adviser Khalilur Rahman has invited Indian National Security Adviser Ajit Doval to visit Dhaka. The invitation was extended by the Bangladesh side during a meeting between the two NSAs that took place in New Delhi on Wednesday (November 19, 2025) ahead of the 7th Meeting of the National Security Advisers of the Colombo Security Conclave on Thursday (November 20, 2025).\n\nTaliban’s trade Minister in Delhi amidst Afghanistan-Pakistan clashes to enhance sea connectivity\n\nAgainst the backdrop of continued hostilities between Pakistan and Afghanistan, Minister of Industry and Commerce of the Taliban administration Alhaj Nooruddin Azizi started a five-day tour of India on Wednesday (November 19, 2025). Official sources said the visit, which highlights Afghanistan’s desire to avoid Pakistani ports for its commercial requirements, will help Afghanistan bypass Pakistan for enhanced connectivity.\n\nBus tragedy: High-level Indian delegation arrives in Saudi Arabia\n\nA high-level Indian government delegation arrived in Saudi Arabia on Wednesday (November 19, 2025) to provide assistance and oversee relief measures in coordination with Saudi authorities following the tragic bus accident involving Indian pilgrims. The delegation, led by Andhra Pradesh Governor Justice S. Abdul Nazeer, arrived in Madina, the Indian Embassy in Riyadh said in a social media post.\n\nTrump is no longer leading; he is being led by MAGA forces \n\nA year after riding a MAGA— Make America Great Again — wave to win a second term as President of the U.S., Donald J. Trump is no longer leading the movement. He is being led by it. Mr. Trump is now being accused by many of his former followers of turning into a mouthpiece of what he once berated as the “Washington establishment”. \n\nIsraeli strikes hit Lebanon after evacuation warnings\n\nThe Israeli military said it struck Hezbollah weapons storage facilities in several south Lebanon towns on Wednesday (November 19, 2025), and accused the group of rebuilding its capabilities close to the border. The Israeli military has kept up frequent air strikes in Lebanon in spite of a ceasefire sealed last November that sought to end more than a year of hostilities with Iran-backed Hezbollah.\n\nU.S. authorises export of advanced American semiconductors to companies in Saudi, UAE\n\nThe U.S. Commerce Department said on Wednesday (November 19, 2025) it has authorised the export of advanced artificial intelligence chips, the equivalent of up to 35,000 NVIDIA Blackwell chips, to two companies in Saudi Arabia and the United Arab Emirates. The two companies are G42, which is a state-run AI company based in Abu Dhabi, and Humain, which is a Saudi government-backed AI venture.\n\nIndia’s shift away from Russian oil imports predates Trump tariffs\n\nIndia is implementing a larger strategy to reduce its dependence on oil imports from Russia, with the higher tariffs imposed by the U.S. coming at a time when India was already cutting its Russian oil imports, according to an analysis of official data. This has also been confirmed by government officials. An analysis by The Hindu of government trade data shows India’s oil imports from Russia in September 2025 — the first full month during which the U.S.’ 50% tariffs on Indian imports were applicable — were 29% lower in terms of value and 17% lower in terms of volume than in September 2024.","url":"https://www.thehindu.com/news/morning-digest-november-20-2025/article70301523.ece","image":"https://th-i.thgim.com/public/incoming/2g2a3e/article70301526.ece/alternates/LANDSCAPE_1200/2025-11-19T192056Z_1152407036_RC2UZHAR6BPI_RTRMADP_3_CLIMATE-COP30.JPG","video":null,"publish_date":"2025-11-20 01:01:04","author":"Lib Tech","authors":["Lib Tech"],"language":"en","category":"politics","source_country":"in","sentiment":0.442},{"id":380701544,"title":"Trump administration makes major changes to a report it commissioned on FEMA reforms, AP sources say","text":"By GABRIELA AOUN ANGUEIRA\n\nA draft of a much-anticipated report on reforms to the Federal Emergency Management Agency has been whittled down in size, with recommendations compiled by a council appointed by the president slashed and amended by Homeland Security Secretary Kristi Noem’s office, according to three people familiar with the developments.\n\nThe report “got nuked,” said one former FEMA official. The three people, who spoke to The Associated Press on condition of anonymity to discuss the issue with the media, said the report shrunk from over 160 pages to roughly 20. They said it left council members and other emergency management leaders concerned that some of the recommendations about the country’s disaster preparedness won’t make it into the final copy, which is expected around Dec. 12.\n\nThe draft report’s downsizing reflects the Trump administration’s push to disengage the federal government from disaster management and the agency overseeing it, FEMA, pushing more responsibility for preparing, responding to and recovering from climate on states, tribes and territories.\n\nThe former officials said that cutting some of the original recommendations and adding others that further diminish FEMA will not only show that the administration is intervening politically in a professional undertaking. They said the changed recommendations could ultimately leave states and other governments unequipped to prepare for or recover from disasters.\n\nThose who oppose shrinking FEMA say most state and local governments can’t take on more of the enormous financial and logistical strains of rebuilding, especially as the frequency and severity of extreme weather wrought by climate change grows, and that FEMA plays a key coordinating role, shepherding help from across the federal government.\n\nDHS did not immediately respond to requests for comment. Asked about the status of the report, White House spokeswoman Abigail Jackson said the review council will recommend to President Donald Trump how FEMA may be reformed “such that the Federal role remains supplemental and appropriate to the scale of disaster,” and that “Secretary Noem is working hard to implement the President’s vision that will best serve the American public.”\n\nThe initial draft sought reforms to FEMA\n\nThe council, appointed by Trump and made up almost exclusively by members from Republican-led states who support significant FEMA reforms, finished a draft report in early November of over 160 pages, according to the three people.\n\nA table of contents obtained by the AP showed the initial draft included nine “key principles,” including reforming public assistance, flood insurance, direct assistance to survivors, and improving rural resilience.\n\nIt also included sections on potential reforms to the Stafford Act, which dictates most of FEMA’s authorities, and proposes a phased approach to the changes, to prepare state and local governments.\n\nTwo former officials familiar with the matter told the AP the initial recommendations included several of the reforms Trump and Noem have repeatedly touted, including giving states upfront direct grants for disaster recovery instead of reimbursing for the work after it’s done, a process that is often criticized for being too slow and bureaucratic.\n\nOther initial recommendations would reduce how much FEMA pays for disasters by reducing the federal cost share below its current minimum of 75%, and raising the threshold of how much a disaster must be estimated to cost before FEMA recommends to the president that it receive a major disaster declaration. Declarations are ultimately up to the president regardless of that formula.\n\nThe new draft cuts proposed reforms and makes others\n\nAfter submitting the draft in early November to DHS for comment and approval, council members learned Noem’s office cut the report to around 20 pages, the former officials said.\n\nTwo people who had not seen the DHS version but are close to members of the council who did said the new draft removes any mention of mitigation programs and slashes preparedness dollars for local emergency management agencies. The AP could not independently confirm other changes made to the draft.\n\nNoem called a last-minute meeting of the FEMA Review Council on Wednesday afternoon. DHS did not respond to questions about the meeting.\n\nThe AP could not reach council members for comment.\n\nAt a disaster resilience conference in Florida Wednesday, council member and Florida Division of Emergency Management Executive Director Kevin Guthrie said federal funds would “continue to come down” to states, but that, with legislative changes, the money could potentially arrive in “days and weeks,” hinting at the transition to using direct grants. He did not address the draft report in his remarks.\n\nMany of the expected recommendations would require action by Congress because the 1988 Stafford Act lays out most of FEMA’s responsibilities. Other changes could be implemented by Trump or the FEMA administrator.\n\nA Republican-dominated council\n\nFor nearly a year, the council has been meeting around the country, holding listening sessions in disaster-impacted places and surveying emergency management professionals and others on how to reform FEMA, and streamline federal support after disasters.\n\nTrump created the review council by executive order on Jan. 24, the same day he proposed “ getting rid of ” FEMA after touring Hurricane Helene damage in North Carolina.\n\nIt is co-chaired by Noem and Defense Secretary Pete Hegseth, though Hegseth did not attend the last of three public meetings, and Noem attended two meetings virtually.\n\nThe members are almost exclusively from Republican-led states and include the emergency management directors of Texas and Florida, Virginia Gov. Glenn Youngkin, and Texas Gov. Greg Abbott. Former Mississippi Gov. Phil Bryant is vice chair.\n\nMembers held three public meetings between May and August in Washington, D.C., New Orleans and Oklahoma City, along with multiple closed-door listening sessions with Native tribes and in disaster-impacted states and territories including North Carolina and Puerto Rico. They also surveyed emergency management directors and others involved with disaster recovery.\n\nExperts hoped that what they believed was a thorough approach would mean that the final recommendations would be reflective of the broad input.","summary":"The report, expected around Dec. 12, included recommendations on disaster preparedness.","url":"https://www.ocregister.com/2025/11/19/fema-reform-report-nuked/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/FEMA_Review_Council_76753-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-20 01:01:01","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":-0.035},{"id":380700170,"title":"Trump administration makes major changes to a report it commissioned on FEMA reforms, AP sources say","text":"By GABRIELA AOUN ANGUEIRA\n\nA draft of a much-anticipated report on reforms to the Federal Emergency Management Agency has been whittled down in size, with recommendations compiled by a council appointed by the president slashed and amended by Homeland Security Secretary Kristi Noem’s office, according to three people familiar with the developments.\n\nThe report “got nuked,” said one former FEMA official. The three people, who spoke to The Associated Press on condition of anonymity to discuss the issue with the media, said the report shrunk from over 160 pages to roughly 20. They said it left council members and other emergency management leaders concerned that some of the recommendations about the country’s disaster preparedness won’t make it into the final copy, which is expected around Dec. 12.\n\nThe draft report’s downsizing reflects the Trump administration’s push to disengage the federal government from disaster management and the agency overseeing it, FEMA, pushing more responsibility for preparing, responding to and recovering from climate on states, tribes and territories.\n\nThe former officials said that cutting some of the original recommendations and adding others that further diminish FEMA will not only show that the administration is intervening politically in a professional undertaking. They said the changed recommendations could ultimately leave states and other governments unequipped to prepare for or recover from disasters.\n\nThose who oppose shrinking FEMA say most state and local governments can’t take on more of the enormous financial and logistical strains of rebuilding, especially as the frequency and severity of extreme weather wrought by climate change grows, and that FEMA plays a key coordinating role, shepherding help from across the federal government.\n\nDHS did not immediately respond to requests for comment. Asked about the status of the report, White House spokeswoman Abigail Jackson said the review council will recommend to President Donald Trump how FEMA may be reformed “such that the Federal role remains supplemental and appropriate to the scale of disaster,” and that “Secretary Noem is working hard to implement the President’s vision that will best serve the American public.”\n\nThe initial draft sought reforms to FEMA\n\nThe council, appointed by Trump and made up almost exclusively by members from Republican-led states who support significant FEMA reforms, finished a draft report in early November of over 160 pages, according to the three people.\n\nA table of contents obtained by the AP showed the initial draft included nine “key principles,” including reforming public assistance, flood insurance, direct assistance to survivors, and improving rural resilience.\n\nIt also included sections on potential reforms to the Stafford Act, which dictates most of FEMA’s authorities, and proposes a phased approach to the changes, to prepare state and local governments.\n\nTwo former officials familiar with the matter told the AP the initial recommendations included several of the reforms Trump and Noem have repeatedly touted, including giving states upfront direct grants for disaster recovery instead of reimbursing for the work after it’s done, a process that is often criticized for being too slow and bureaucratic.\n\nOther initial recommendations would reduce how much FEMA pays for disasters by reducing the federal cost share below its current minimum of 75%, and raising the threshold of how much a disaster must be estimated to cost before FEMA recommends to the president that it receive a major disaster declaration. Declarations are ultimately up to the president regardless of that formula.\n\nThe new draft cuts proposed reforms and makes others\n\nAfter submitting the draft in early November to DHS for comment and approval, council members learned Noem’s office cut the report to around 20 pages, the former officials said.\n\nTwo people who had not seen the DHS version but are close to members of the council who did said the new draft removes any mention of mitigation programs and slashes preparedness dollars for local emergency management agencies. The AP could not independently confirm other changes made to the draft.\n\nNoem called a last-minute meeting of the FEMA Review Council on Wednesday afternoon. DHS did not respond to questions about the meeting.\n\nThe AP could not reach council members for comment.\n\nAt a disaster resilience conference in Florida Wednesday, council member and Florida Division of Emergency Management Executive Director Kevin Guthrie said federal funds would “continue to come down” to states, but that, with legislative changes, the money could potentially arrive in “days and weeks,” hinting at the transition to using direct grants. He did not address the draft report in his remarks.\n\nMany of the expected recommendations would require action by Congress because the 1988 Stafford Act lays out most of FEMA’s responsibilities. Other changes could be implemented by Trump or the FEMA administrator.\n\nA Republican-dominated council\n\nFor nearly a year, the council has been meeting around the country, holding listening sessions in disaster-impacted places and surveying emergency management professionals and others on how to reform FEMA, and streamline federal support after disasters.\n\nTrump created the review council by executive order on Jan. 24, the same day he proposed “ getting rid of ” FEMA after touring Hurricane Helene damage in North Carolina.\n\nIt is co-chaired by Noem and Defense Secretary Pete Hegseth, though Hegseth did not attend the last of three public meetings, and Noem attended two meetings virtually.\n\nThe members are almost exclusively from Republican-led states and include the emergency management directors of Texas and Florida, Virginia Gov. Glenn Youngkin, and Texas Gov. Greg Abbott. Former Mississippi Gov. Phil Bryant is vice chair.\n\nMembers held three public meetings between May and August in Washington, D.C., New Orleans and Oklahoma City, along with multiple closed-door listening sessions with Native tribes and in disaster-impacted states and territories including North Carolina and Puerto Rico. They also surveyed emergency management directors and others involved with disaster recovery.\n\nExperts hoped that what they believed was a thorough approach would mean that the final recommendations would be reflective of the broad input.","summary":"The report, expected around Dec. 12, included recommendations on disaster preparedness.","url":"https://www.sandiegouniontribune.com/2025/11/19/fema-reform-report-nuked/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/11/FEMA_Review_Council_76753-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-20 01:01:01","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"US","sentiment":-0.035},{"id":380699150,"title":"\"Sudan has become most violent place, single biggest humanitarian crisis\": Trump","text":"Washington, DC [US], November 20 (ANI): US President Donald Trump on Wednesday (local time) said that “tremendous atrocities” are taking place in Sudan, which was once considered a “Great Civilisation” and has become the “single biggest humanitarian crisis” on earth.President Trump wrote on Truth Social, “Tremendous atrocities are taking place in Sudan. It has become the most violent place on Earth and, likewise, the single biggest Humanitarian Crisis. Food, doctors, and everything else are desperately needed. Arab Leaders from all over the World, in particular the highly respected Crown Prince of Saudi Arabia, who has just left the United States, have asked me to use the power and influence of the Presidency to bring an immediate halt to what is taking place in Sudan”.Trump said that Sudan, considered a “great civilisation”, can be fixed with the “cooperation and coordination” of countries and noted that they will work with their partner countries to put an “end” to these atrocities.“It is considered a Great Civilization and Culture, unfortunately gone bad, but one that can be fixed with the cooperation and coordination of Countries, including those in the Region of tremendous Wealth, who want this to happen. We will work with Saudi Arabia, United Arab Emirates, Egypt, and other Middle Eastern partners to get these atrocities to end, while at the same time stabilizing Sudan. Thank you for your attention to this matter. GOD BLESS THE WORLD!”Earlier, the Rapid Support Forces (RSF) in Sudan said it agreed to a proposal by the US for a ceasefire in Sudan after more than two years of fighting with the Sudanese Armed Forces (SAF), Al Jazeera reported.The paramilitary group said in a statement that it would accept a “humanitarian ceasefire” proposed by the US-led “quad” mediator group, which includes Saudi Arabia, Egypt and the United Arab Emirates, “to address the catastrophic humanitarian consequences of the war and to enhance the protection of civilians”.Earlier, the US senior adviser for Arab and African affairs, Massad Boulos, said efforts were under way to reach a truce and that the warring sides had “agreed in principle,” as per Al Jazeera.The World Health Organization had reported the “tragic killing of more than 460 patients and medical staff” at a former children’s hospital during the city’s takeover.Both the warring sides have been accused of war crimes. In a September report, the UN Human Rights Council accused both sides of extrajudicial killing, large-scale attacks against civilians and torture. It also reported an “overwhelming volume” of evidence on sexual violence primarily perpetrated by RSF and SAF members, as per Al Jazeera. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/sudan-has-become-most-violent-place-single-biggest-humanitarian-crisis-trump-9719272.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-11-20 01:00:02","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.029},{"id":380698984,"title":"Trump is in a rage as the Fed flies blind","text":"In September, there was a near-consensus, with only Stephen Miran, hastily parachuted onto the board by Donald Trump in September so that he could vote at the October meeting, the lone dissenter. Where the majority agreed on a 25 basis point cut, he argued for a 50 basis point reduction, as he did again last month.\n\nAccording to the minutes of the October meeting, however, views – particularly of the merits of another cut in December – have become more polarised.\n\n“Some” participants thought the Fed’s policy stance would be too restrictive even after the rate cut. Others pointed to the resilience of the economy and supportive financial conditions as indicators that monetary policy wasn’t clearly restrictive.\n\n“In discussing the near-term course of monetary policy, participants expressed strongly differing views about what policy decisions would most likely be appropriate at the committee’s December meeting.”","url":"https://www.smh.com.au/business/banking-and-finance/trump-is-in-a-rage-as-the-fed-flies-blind-20251120-p5ngxu.html","image":"https://static.ffx.io/images/$zoom_0.2617957621082621%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_60/t_crop_custom/q_86%2Cf_auto/a76d26839ec3438a7214fb4c35c646297d9fd49a","video":null,"publish_date":"2025-11-20 00:57:26","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":-0.551},{"id":380698748,"title":"New Epstein emails expose how titans of industry secretly sought his advice post-conviction","text":"Titans of industry and best-selling authors, world-renowned scientists and banking moguls, top-tier journalists and political power players often turned to the same man for advice, for connections, and to banter and trade gossip about President Donald Trump. That man was Jeffrey Epstein, CNN reported.According to the report, new emails exposed that many of Epstein's pen-pals looked to him for guidance on avoiding their own sexual scandals. This was even after Epstein was registered as a sex offender after a 2008 conviction for soliciting prostitution with a minor – but that did not seem to deter his pen pals.Those messages were laid bare in extraordinary fashion last week when the House Oversight Committee released more than 23,000 pages of records obtained from the estate of Epstein.Epstein died in a Manhattan jail cell in 2019 while awaiting trial on federal sex trafficking charges.Those messages were reportedly scrutinised for new revelations about Epstein’s relationship with Trump – and indeed, show that Epstein relished talking about their one-time friendship as Trump rose to political power, offering his opinions on everything from the president’s sanity – “f***ing crazy” – to who should be in his Cabinet, CNN reported.However, there were thousands of Epstein emails which also showed another key aspect of his uniquely corrupting role in American society: How he cast himself at the center of a web of power and influence.CNN’s analysis of about 2,200 email threads found that at least 740 were exchanges between Epstein and prominent figures in academia, government, media and business.Epstein’s correspondence with them, which also included numerous text messages, spanned a decade from 2009 to the day before his July 2019 arrest.Those text messages also showed him communicating with other figures who apparently aren’t named in unredacted emails, including messages exchanged with Democratic Rep. Stacey Plaskett during a 2019 Congressional hearing.Plaskett told CNN that Epstein was a constituent, and that he was “a reprehensible person, absolutely disgusting.”In starkly revealing terms, the emails show personal conversations between American luminaries and a man they knew to be a sexual predator – and yet still trusted for access, advice and friendship.For example...In November 2018, Larry Summers, the former president of Harvard University and US Treasury secretary, forwarded Epstein an email from a woman he was romantically interested in, writing, “Think no response for a while probably appropriate.”Epstein replied, “she’s already beginning to sound needy :) nice.”In March 2019, in the aftermath of the Miami Herald’s investigation revealing Epstein’s abuse of underage girls, Summers and Epstein exchanged emails appearing to debate whether Summers should message back a woman.Epstein argued that a note would be “BAD FORM.”“Why bad form. Supposed to be face to face?” Summers wrote back.“you care very much for this person. you might want to demonstrate that. a note does the very opposite,” Epstein replied.The two shared friendly exchanges, as in another email in which Summers called Epstein a “wall st tough guy w intellectual curiosity.”And they talked about politics, like in emails from October 2016, in which Epstein wrote about Trump bringing women who had accused former President Bill Clinton of abuse to a debate with Hillary Clinton. \"they wilil feature in the hillary says you should give the benefit of the doubt to victims,” wrote Epstein, adding it’s “disgraceful.”Summers replied, “Press is so revolted by trump that I'd expect they will not be for benefit of doubt.”Epstein also brokered connections, as shown in an email exchange from November 2016 when Summers agreed to meet with Karim Wade, the son of the former president of Senegal, at Epstein’s urging. Summers wrote, “Always quiet advice to anybody who can use it. Try always discreet.”","url":"https://www.livemint.com/news/us-news/new-epstein-emails-expose-how-titans-of-industry-secretly-sought-his-advice-postconviction-11763599380856.html","image":"https://www.livemint.com/lm-img/img/2025/11/20/1600x900/USA-TRUMP-EPSTEIN-1_1763405745960_1763405750645_1763600056504.JPG","video":null,"publish_date":"2025-11-20 00:55:14","author":"Livemint","authors":["Livemint"],"language":"en","source_country":"in","sentiment":-0.126},{"id":380698724,"title":"House returns to session with focus on censures","text":"WASHINGTON (AP) — The U.S. House is back in session after a multi-week hiatus, but its agenda has been quickly overtaken by a sudden flurry of censures, reprimands and the investigation of members, leaving little bandwidth for legislating.\n\nWith few bills to consider — and no quick fix for the problem of skyrocketing health insurance premiums — the House has instead devoted time to lawmakers’ demands to punish each other for their personal and political transgressions in showy spectacles on and off the chamber floor.\n\n“I feel sorry for this body,” said Del. Stacey Plaskett, a Democrat who represents the U.S. Virgin Islands and was the subject of a failed effort by House Republicans to censure and remove her from the House Intelligence Committee.\n\nOn Wednesday, an effort to censure another lawmaker, Rep. Cory Mills, R-Fla., was filed just hours before the House Ethics Committee suddenly announced it would investigate the congressman.\n\nReprimands leave little time for legislating\n\nThe escalating environment of political scrutiny is leaving the House, with just weeks to go before the end of year, without much time to make progress on unfinished business. Particularly unsettled is whether Congress will be able to deal with the expiration of the health care tax credits on Dec. 31, which threaten to leave millions of Americans unable to afford insurance coverage in the new year. \n\nHouse Speaker Mike Johnson had insisted that once the government reopened from the federal shutdown, talks would get underway with President Donald Trump on the health care debate. But this first full week back in session has shown few signs of progress on that or other issues, including the routine bills to fund the government and prevent another shutdown.\n\n“It’s time for the House to actually do things that matter for the American people,” said House Democratic Leader Hakeem Jeffries at his weekly press conference.\n\nJeffries said the House Republicans were “forced to come crawling back into the Capitol” after their nearly seven-week absence during the shutdown, and “they still haven’t brought a single bill to the floor that actually addresses the high cost of living in the United States.”\n\n“What is wrong with these people?” he asked.\n\nHealth care and government funding at stake\n\nAs Johnson tries to exert control over the House, where Republicans have narrow majority control, the GOP speaker’s leadership is being tested in new and confrontational ways by rank-and-file lawmakers. They are seizing on the tools at their disposal to maneuver around the GOP speaker.\n\nJohnson had to reverse course and support the vote to release the Jeffrey Epstein files after a mass uprising from lawmakers demanding action. What started as a rogue action by a handful of lawmakers on what’s called a discharge petition became a nearly unanimous roll call, sending the bill to the Senate — and then to Trump to become law.\n\n“Having now forced the vote, none of us want to go on record and in any way be accused of not being for maximum transparency,” Johnson said. “Of course we’re for maximum transparency.”\n\nEpstein files unleash more scrutiny\n\nRepublicans, including those from the Freedom Caucus, launched the campaign against Plaskett over text messages she had received from Epstein during a committee hearing with Trump’s former political fixer Michael Cohen in 2019.\n\nGOP Rep. Ralph Norman, who is running for governor in his state of South Carolina, said the text exchanges were improper and he was seeking to remove Plaskett from her role on the House Permanent Select Committee on Intelligence.\n\n“She did it to herself,” he said during Tuesday’s heated floor debate.\n\nBut Plaskett, a former U.S. attorney in New York who had been appointed to the Department of Justice during the Bush administration, defended her actions. She said she was simply interacting with a constituent — Epstein had owned two tiny islands in the U.S. Virgin Islands — one of many people texting as her phone exploded with messages during the high-profile hearing. At the time, it was not publicly known that Epstein was under investigation, she explained.\n\nThe effort failed, 214-209, with three Republicans joining the Democrats to oppose the resolution of censure and removal from the Intelligence Committee. Also failing, by a vote of 214-213, was an effort by the Democratic leadership to refer the situation to the Ethics Committee for review.\n\nGOP Rep. Nancy Mace, who is also running for governor in South Carolina, filed her resolution against Mills midday Wednesday claiming he brings “discredit” on the House for a long list of alleged transgressions. A Florida judge has granted a protective order against Mills at the request of a former girlfriend who claimed that he threatened to release nude images of her and physically harm her future boyfriends after she broke up with him. \n\nAnd starting the week was a vote, 236-186, to reprimand Rep. Jesus “Chuy” Garcia, D-Ill., after his chief of staff became the only candidate who submitted the paperwork needed to run for the congressional seat once he announced he was not seeking reelection.\n\nA new normal of disruptions in House\n\nThere have been at least a half-dozen efforts this year to censure or other reprimand lawmakers, largely from Republicans seeking to punish Democrats — though Democrats have been retaliating with their own threats to file actions against Republicans. \n\nJeffries said there’s “not enough time in the legislative calendar if Republicans want to go down this road.”\n\nAnd lawmakers of both parties have used the discharge petition strategy to force issues — like the Epstein files — to the fore over the objections of the GOP leadership.\n\nJohnson has bemoaned the disruptions he has been unable to fully control and repeatedly said he wishes he could be speaker over a “normal” House. But others see this House as the new normal. \n\n“I think it’s indicative of how the House has been for quite some time,” said Rep. Tim Burchett, R-Tenn. “And that’s by design. Nothing gets done.”\n\nRep. David Schweikert, R-Ariz., who faced his own violations with the Ethics Committee in 2020, said the punishments are the new normal. \n\n“It’s being Weaponized. Back and forth. Back and forth,” he said.\n\n“In previous times, you would have gotten fussed at by the speaker saying, please don’t do this.”\n\nAssociated Press writer Joey Cappelletti contributed to this report.","url":"https://apnews.com/article/stacey-plaskett-cory-mills-house-speaker-johnson-323969f10ebbbf87ede3a93c2d5bd535","image":"https://dims.apnews.com/dims4/default/124a7ec/2147483647/strip/false/crop/2853x1902+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F05%2Ff898d224b4a9a7e2c53d5b12fbfc%2Faafcf1dac3cc46598061e5e1a64ff28f","video":null,"publish_date":"2025-11-20 00:53:31","author":"Lisa Mascaro","authors":["Lisa Mascaro"],"language":"en","category":"politics","source_country":"us","sentiment":-0.458},{"id":380700352,"title":"US Presses Ukraine to Cede Land as Russian Strikes Kill 26","text":"TERNOPIL, Ukraine: A new US peace proposal would see Kyiv ceding land and more than halving its army, a source told AFP Wednesday, as a Russian strike in the west of Ukraine killed 26 people, including three children. The proposal appears to repeat Russia's maximalist terms to end the war -- demands consistently rejected by Ukraine as tantamount to capitulation. The surprise initiative comes as Russian missiles hit the city of Ternopil, far from the front line, in one of the deadliest attacks on western Ukraine since the invasion began in 2022. Ukrainian President Volodymyr Zelensky's efforts to re-engage US President Donald Trump's administration in the peace process during a visit to Turkey fell flat after an American envoy thought to be joining him did not make the trip. The draft US peace proposal provides for \"recognition of Crimea and other regions that the Russians have taken\" and \"reduction of the army to 400,000 personnel\", a source familiar with it, who did not wish to be identified, told AFP. It would also see Ukraine giving up all long-range weapons. \"An important nuance is that we don't understand whether this is really Trump's story\" or \"his entourage's\", the official added. It was \"unclear\" what Russia was supposed to do in return, according to the source. At the same time, US Army Secretary Daniel Driscoll arrived in Kyiv, leading a high-profile Pentagon delegation to meet Ukrainian officials and find ways to settle the conflict, US broadcaster CBS News said, citing the US military. Driscoll met Ukrainian Defence Minister Denys Shmygal on Wednesday. Ukraine's top military commander Oleksandr Syrsky said he had held a \"productive\" meeting with the US delegation. \"I once again stressed that reinforcing the protection of Ukraine's airspace, expanding our long-range strike capabilities against enemy military targets and maintaining and stabilising the front line will undermine the offensive potential of the adversary,\" he said in social media posts. American media outlet Axios earlier reported Moscow and Washington had been working on a secret plan to end the almost four-year war. The Kremlin declined to comment on the report, later saying there was nothing new in the peace settlement progress. AFP has contacted the White House for comment. Russia now occupies around a fifth of Ukrainian territory, much of it ravaged by fighting. - 'Too late' - In Ternopil, AFP saw dozens of rescuers searching through rubble after cruise missiles slammed into apartment blocks, using cranes to reach the destroyed building. Thick grey smoke engulfed the streets just after explosions were heard at 7:00 am (0500 GMT). City officials reported the fires had caused chlorine levels in the air to spike to six times the norm, and called on Ternopil's 200,000 residents to stay home and close their windows. Wrapped in a pink blanket, 46-year-old Oksana waited for news of her 20-year-old son, Bohdan. \"I went to work, and my son stayed at home. I called him from the minibus and said 'Bohdan, get dressed and come out',\" she said. \"He said: 'Mum, don't worry, everything will be fine.' But it was too late,\" she told AFP. Her sister, Natalia Bachinska, said the family lived on the ninth floor. \"Their apartment is completely gone... He still has not been found.\" The state emergency service said 26 people, including three children, were killed, and another 92 people, including 18 children, wounded. \"These were people who were simply at home, peacefully sleeping,\" Zelensky said. UN human rights chief Volker Turk said he was \"appalled\" by the number of civilian casualties in the attack. \"The horror of powerful long-range missiles combined with waves of drones increasingly being used by Russian forces was again painfully laid bare in Ukraine this morning,\" Turk said in a statement. \"This is how Russia's 'peace plans' look in reality,\" said Ukrainian Foreign Minister Andriy Sybiga. - Winter looming - The strike on Ternopil came as Russia batters Ukraine's energy grid ahead of winter, and with Kyiv's stretched troops under pressure on the front line. Kyiv had pitched Zelensky's unexpected visit to Turkey as part of efforts to re-engage the United States in trying to end the war. But Trump's envoy Steve Witkoff did not travel after Ukraine had said he was expected to join the talks. And there were no Russian officials present. Turkish President Recep Tayyip Erdogan urged the warring sides to join talks in Istanbul, where three rounds of negotiations this year have yielded only prisoner exchanges and the repatriation of killed soldiers' bodies. Zelensky said he wanted to resume POW swaps with Russia by the end of the year. But Ukraine's main hope is that Washington can push Russia to the negotiating table, including by imposing sanctions. On the battlefield, Russian troops are making slow but steady advances, and Moscow...","summary":"The proposal appears to repeat Russia's maximalist terms to end the war -- demands consistently rejected by Ukraine as tantamount to capitulation.","url":"https://www.deccanchronicle.com/world/us-presses-ukraine-to-cede-land-as-russian-strikes-kill-26-1918298","image":"https://www.deccanchronicle.com/h-upload/2025/11/20/1980564-aa-5965380.webp","video":null,"publish_date":"2025-11-20 00:52:29","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.269},{"id":380657004,"title":"JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIan Parsard, Senior VP: Finance & Corporate Planning/Exec Dir:\"When you have this kind of coordinated and deliberate efforts by the leadership, that's what makes this difficult.\" \n\n Business, Latest News \n\nBY DASHAN HENDRICKS Business content manager hendricksd@jamaicaobserver.com \n November 19, 2025\n\n\n\n\n JBG chief questions how auditors missed massive fraud as multiple checks failed to detect $46b irregularities \n\n\n\n\n\n\n\nJamaica Broilers Group (JBG) executives have raised serious questions about how multiple audit teams failed to detect a massive, multi-year fraud in the company’s United States (US) operations, with Chief Executive Officer Chris Levy pointedly noting the oversight failure as “another question” that needed answering.\n\nThe revelation came as the company disclosed that three separate layers of auditors — including those from the US banking syndicate and the group’s own auditors — all gave clean opinions on financial statements that later required $46 billion in adjustments.\n\n“Well, that’s another question,” Levy remarked pointedly when it was noted that his internal team discovered irregularities that the external auditors had missed. His comment underscored the deep concern about comprehensive audit failures in detecting the four-year scheme.\n\nIan Parsard, senior vice president of finance and corporate planning/executive director, expressed astonishment at the comprehensive failure of oversight systems. “When you have this kind of coordinated and deliberate efforts by the leadership, that’s what makes this difficult,” he told investors at the Mayberry Forum.\n\n“Let me mention three different set of auditors here,” Parsard detailed. “First we had the auditors of the US that for multiple years did not pick up any adverse findings…We have a banking syndicate in the US that is led by one of the top three banks in the US. They have their own auditors that come in and audit the borrowing-based facility that we have… There was no adverse findings from the bank’s auditors. And then of course we have our group auditors that review all of these different audit reports etc. And over all of these years, there has been no adverse findings.”\n\nThe fraud, which involved hiding costs in biological assets and inventory accounts while understating vendor financing, eventually came to light not through formal audit processes, but through a whistleblower who pointed investigators in the right direction.\n\nLevy revealed that the company had already been suspicious because of the disconnect between reported profits and actual cash generation, but the sophisticated nature of the scheme made it difficult to uncover through conventional means.\n\n“So that’s the difficulty,” Parsard emphasised, “When you have this kind of coordinated effort to be able to uncover it very quickly, it’s not very easy.”\n\nThe company has since taken drastic measures to overhaul its financial oversight, including replacing its entire US accounting team, changing auditors and implementing new controls with the help of IBM. The new auditors, according to Parsard, have specific poultry industry experience and “know where to look” for irregularities that their predecessors missed.\n\nThe admission raises broader questions about audit effectiveness in complex, multi-jurisdictional companies and highlights how determined management can potentially circumvent even multiple layers of financial oversight. For JBG, the comprehensive audit failure has proven devastating, requiring a complete restructuring of the company’s financial position and damaging shareholder confidence.\n\n\n\n\n\n\n\n\nTags: business Chris Levy Jamaica Broilers Group \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump faces moment of truth on explosive Epstein files \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (AFP)—A bill requiring the release of government records on Jeffrey Epstein heads to Donald Trump for his signature on Wedn... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Parents, guardians urged to store household chemicals properly \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n ST JAMES, Jamaica— Health promotion and education officer for Westmoreland, Gerald Miller, is urging parents and guardians to heighten their vigilance... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n New report shows violence against women is pervasive in the Americas \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n WASHINGTON, United States (CMC) – The World Health Organization (WHO) on Wednesday said that violence against women and girls continues to be a seriou... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n Jamaica to know play-off opponents on Thursday \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Jamaica’s Reggae Boyz will know their semi-final opponents in the play-offs for the FIFA World Cup set for March in Mexico at Thur... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n UPDATE: Section of Mandela Highway closed after police shooting \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — Motorists are being advised that the westbound lane of the Mandela Highway in the vicinity of the entrance to the PJ Patterson Hig... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Donovan Lewis to close St George’s College lecture series \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — St George’s College will conclude its three-part lecture series with a presentation from entrepreneur Donovan Lewis. Lewis, an inv... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Hurricane victims hopeful after visit by PM and Caricom heads \n\n\n\n\n\n\n\nNovember 19, 2025 \n\n\n KINGSTON, Jamaica — The visit to Whitehouse and adjoining communities in Westmoreland by Prime Minister Andrew Holness and Caribbean Community (Carico... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/19/jbg-chief-questions-auditors-missed-massive-fraud-multiple-checks-failed-detect-46b-irregularities/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/WhatsApp-Image-2025-11-19-at-14.08.58_a068b054.jpg","video":null,"publish_date":"2025-11-20 00:47:54","author":"By Dashan Hendricks Business Content Manager","authors":["By Dashan Hendricks Business Content Manager"],"language":"en","source_country":"jm","sentiment":0.246},{"id":380696904,"title":"Is Trump turning to Modinomics with his baby accounts and tariff payouts?","text":"This is the season of economic populism, and financial security has become the political currency of choice. In Bihar, the direct transfer of Rs 10,000 to more than 1.5 crore women worked squarely in Prime Minister Narendra Modi’s favour, helping the NDA return with a stronger mandate than in the previous Assembly elections.Across the Atlantic, with midterms nearing and Republicans’ control of Congress at stake, President Donald Trump appears to be drawing from his \"friend’s\" playbook of economic welfarism.TRUMP LOOKS TO MODI-STYLE DIRECT TRANSFERSTrump has pitched a one-time $1,000 (Rs 88,500) deposit into a tax-deferred account that will track stock market indices. The accounts - controlled by a child’s parents or guardians - would be created for American babies born between late 2024 and early 2029.At the same time, India’s long-running Direct Benefit Transfer programme continues to scale up. Buoyed by over Rs 44 lakh crore transferred in 11 years, India is on track to overtake China as the world’s largest social security provider by 2026..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}Trump’s broader populist agenda follows a similar pattern. He is expected to roll out his branded baby accounts and the proposed $2,000 (Rs 1,77,000) \"tariff dividend\" for every \"non–high-income\" American - essentially those earning below $100,000 a year - by mid-2026.THE COST QUESTION: A SHARED CHALLENGEIndia now covers nearly 100 crore people - 64% of the population - under at least one social protection scheme, up from 19% a decade ago. But the political payoff comes with a cost.Nearly 9% of the 2024-25 Union Budget - about $51.4 billion (Rs 4.26 trillion) - was allocated to subsidies, largely for food, fertiliser and domestic LPG. It remains one of the biggest recurring pressures on the exchequer.Trump faces a similar headache. A Washington-based think tank, the Tax Foundation, estimates that revenue from his proposed tariffs will fall far short of paying for $2,000 dividend cheques for the \"non–high-income\" group. According to Treasury Secretary Scott Bessent, that group includes Americans earning under $100,000 a year.TARIFFS VS PAYOUTS: THE NUMBERS DON'T MATCHThe Tax Foundation projects that Trump’s tariffs would generate about $158.4 billion in 2025 and $207.5 billion in 2026. But the cost of sending cheques to the eligible population is estimated between $279.8 billion and $606.8 billion - far higher than the revenue his trade plan would generate.For economists at the Tax Foundation and other independent think tanks, Trump’s maths doesn’t work, or at the very least leaves taxpayers carrying a much larger burden.Still, Trump insists any leftover tariff revenues will help \"pay down the national debt\" - a claim that the numbers do not currently support.Trump is not relying solely on tariffs to fund the $1,000-per-baby proposal. He plans to draw from a 1% international remittance tax included in his “Big Beautiful Bill,” along with additional corporate and excise tax revenues.INDIA'S SAVINGS STORY: DBT'S QUIET ADVANTAGEIndia’s subsidy picture, while large, has a small silver lining. Modi’s Direct Benefit Transfer system has cut leakages and bypassed middlemen, saving an estimated Rs 3.48 lakh crore between 2009 and 2024 and almost halving the subsidy share of the Union Budget from 16% to 8.8%.Every penny saved, in economic terms, becomes an opportunity cost advantage - translating directly into measurable benefits for millions of people.- EndsPublished By: Sayan GangulyPublished On: Nov 20, 2025","summary":"Is Trump turning to Modinomics with his baby accounts and tariff payouts?","url":"https://www.indiatoday.in/india/story/modi-vs-trump-us-president-turning-to-modinomics-with-his-baby-accounts-and-tariff-dividend-payouts-2822795-2025-11-20","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202511/modi-trump-asean-summit-204539907-16x9_0.jpg?VersionId=XckbmtO_NVkB4m..4vAwY9BWo5FcVokU?size=1280:720","video":null,"publish_date":"2025-11-20 00:46:01","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.079},{"id":380698148,"title":"Nicolle Wallace Slams Pam Bondi’s ‘Maximum Transparency’ Promise for Epstein Files: ‘The Public Isn’t Buying It’ | Video","text":"Nicolle Wallace slammed U.S. Attorney General Pam Bondi for promising “maximum transparency” when it came to the Epstein files following Congress’ nearly unanimous vote in favor of their release.\n\nOn Wednesday’s episode of “Deadline: White House,” the MS NOW host took the U.S. Attorney General and President Donald Trump to task for claiming transparency while also refusing to release the records themselves and force it through a laborious House and Senate vote.\n\n“Following the law and maximum transparency when it comes to the Epstein files,” Wallace said. “Public isn’t buying it. Those are two things this Department of Justice is not known for, even among Republicans. \n\n“Again, if Pam Bondi wanted transparency when it comes to the Epstein material, she could have released the files instead of publishing an unsigned memo that said she wasn’t going to, that sought to sweep the whole thing under the rug,” Wallace continued. “Comments like her comments today, though, are part of a pattern by Team Trump that suggests anything but maximum transparency.”\n\nWatch the full “Deadline: White House” segment below:\n\nBondi renewed her promise of maximum transparency after the effort to release the files passed in both the House and Senate on Tuesday. Trump has yet to sign the Epstein Bill and has not announced a timeline on when it will happen, though the vote mandates he has 30 days.\n\n“We have released 33,000, over 33,000 Epstein documents to the Hill and we’ll continue to follow the law and to have maximum transparency,” Bondi said in a press conference. “Also, we will always encourage all victims to come forward.”\n\nOn Tuesday, Congress passed the bill ordering the U.S. Justice Department to release its files on Epstein within 30 days. The measure was sent to Trump to sign into law after it was approved in a 427-1 House vote. The bill will require the DOJ to publicize all classified documents and communications related to Epstein, as well as investigate all materials on his probe and prosecution.","summary":"\"Her comments today, though, are part of a pattern by Team Trump that suggests anything but maximum transparency,\" the MS NOW host says\n\n\nThe post Nicolle Wallace Slams Pam Bondi&#8217;s &#8216;Maximum Transparency&#8217; Promise for Epstein Files: &#8216;The Public Isn&#8217;t Buying It&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/nicolle-wallace-pam-bondi-epstein-files-reaction/","image":"https://www.thewrap.com/wp-content/uploads/2025/11/NicolleWallace.jpg","video":null,"publish_date":"2025-11-20 00:44:20","author":"Jacob Bryant,Team Trump","authors":["Jacob Bryant","Team Trump"],"language":"en","category":"politics","source_country":"US","sentiment":-0.504},{"id":380697572,"title":"Trump's White House tried to slow-walk a vote on the Epstein files. It failed.","text":"WASHINGTON - The White House was quietly lobbying senators to slow-walk a vote to force the release of investigative files on Jeffrey Epstein even as President Donald Trump publicly insisted his administration had nothing to hide and urged Congress to act, according to two sources with direct knowledge of the matter.The effort unraveled on Tuesday when senators approved the measure passed by the Republican-controlled House of Representatives without the changes Trump aides had pressed for, exposing the limits of the president’s sway over his party on an issue that has bedeviled him since he returned to power this year.The measure is now expected to land on Trump's desk as soon as Wednesday, and he has indicated he plans to sign it.","url":"https://www.japantimes.co.jp/news/2025/11/20/world/politics/trump-slow-walk-epstein-files/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/11/20/506972.JPG?v=3.1","video":null,"publish_date":"2025-11-20 00:40:27","author":"Nandita Bose","authors":["Nandita Bose"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.306},{"id":380699574,"title":"Release of Epstein files","text":"Suddenly it was no longer a hoax but a political minefield. Seeing lawmakers in the House of Representatives openly talking about the need for a veto-proof majority while outing the Epstein files and an unrelenting base that wanted to see it all, President Donald Trump did a remarkable about-face.\n\nFrom excoriating Republicans who were falling for a Democratic bogus line and wilful diversion; ordering the Department of Justice (DOJ) to investigate Democrats’ connection with Jeffrey Epstein; and unleashing vitriol on at least one of his ardent supporters, Majorie Taylor Greene, who had signed on to the discharge petition, President Trump suddenly called on Republican lawmakers in the House to vote for the release of the files, perhaps convinced that the noise and din would not subside with Democrats on the receiving end.\n\nFalling in line\n\nStanding by the President’s directive, the Republicans fell in line when all but a single lawmaker from Louisiana joined Democrats for a massive 427 to 1 vote in the House; the Senate soon expressing unanimous consent to pass the House Bill which is now all but a formality and perhaps in a similar lopsided manner.\n\nWith the President’s signature, the DOJ will have to bare it all after proper redactions. Just how soon it will get this done is unsure but for a city that is known for dramas, undue delays will see tongues wagging on motives all over again.\n\nThe ’beauty’ of the DOJ and the Epstein files is that it required neither a House nor a Senate vote and the signature of the President. All that was needed was a telephone call from President Trump to his Attorney General, Pam Bondi. Instead what Americans saw an elaborate circus starting with the Presidential campaign of 2024 that the Biden administration which had prepared the dossier had something to hide; and with this a promise by candidate Trump that this would be one of first things of attention upon elected President.\n\nAnd some 10 months into the second term, patience started running thin especially within the moral brigade of the base egged on by unverified snippets of the connection between the late Epstein and the President.\n\nPresident Trump has not denied a friendship with Epstein but has consistently maintained he had kicked out the former financier-cum-sex trafficker before Epstein pleaded guilty to charges of soliciting a minor for prostitution in 2008. President Trump has also denied any knowledge of Epstein’s abuse and trafficking of underage girls. But what has also been flagged is that the Epstein connection will hurt the Democrats more given prominent personalities like former President Bill Clinton and senior administration officials were also involved with an alleged paedophile who took his life in prison in 2019.\n\nThe Democrats have had their fair share of philanderers in the political spectrum. And no one is expecting the DOJ list to stop with a handful of Democrats; and for now few seem to be interested in what President Clinton was up to other than occasional use of Epstein jets or if former Treasury Secretary Lawrence (Larry) Summers leaned on the disgraced financier for donations to a private University he was leading. Or the connections between leading financial houses and the disgraced financier. That Epstein was a Democrat is hardly of any consequence at this point of time.\n\nA serious issue\n\nThe Epstein files go beyond conversations that may have taken place in golf clubs or upscale restaurants. For that matter it was not a simple exchange of business cards either. They involve a serious issue of knowledge and involvement in sex trafficking and abuse of underage girls.\n\nPolitical parties playing games at a time when victims are still crying out for justice long years after the trauma will have to pay a heavy price in November 2026 and beyond.\n\nThe writer is a senior journalist who has reported from Washington DC on North America and United Nations\n\nPublished on November 20, 2025","summary":"Trump’s about-turn adds new twist to drama","url":"https://www.thehindubusinessline.com/opinion/release-of-epstein-files/article70300045.ece","image":"https://bl-i.thgim.com/public/incoming/6mfo2v/article70300098.ece/alternates/LANDSCAPE_1200/2025-11-18T181826Z_837362981_RC24ZHAS86P6_RTRMADP_3_USA-TRUMP-EPSTEIN.JPG","video":null,"publish_date":"2025-11-20 00:40:00","author":"Sridhar","authors":["Sridhar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.539},{"id":380701050,"title":"President Sheinbaum Says No Way To US Strikes On Cartels In Mexico","text":"Mexican President Claudia Sheinbaum has again sought to stand up to President Donald Trump, on Tuesday repeating her rejection of any possibility of US military intervention against cartels on sovereign Mexican soil.\n\nTrump has recently floated openness toward the possibility, and also Colombia, in exchanges with reporters related to the military build-up off Venezuela. \"It’s not going to happen,\" Sheinbaum said, according to The Associated Press. \"He (Trump) has suggested it on various occasions, or he has said, ‘we offer you a United States military intervention in Mexico, whatever you need to fight the criminal groups.'\"\n\nTrump had been asked asked on Monday if he would seek the Mexican government's permission before launching any potential strikes and responded that he \"wouldn’t answer that question.\" He added that he has been \"speaking\" with Mexico and that they \"know how I stand.\"\n\nThat exchange had started as follows:\n\nSpeaking to reporters in the Oval Office, Trump answered a question about potentially striking Mexico or sending American troops or other personnel into the country by saying it would be “OK with me.\"“Would I launch strikes in Mexico to stop drugs? OK with me, whatever we have to do to stop drugs. Mexico is — look, I looked at Mexico City over the weekend. There’s some big problems over there,” Trump said after he was asked whether he was considering such action.\n\nThe military campaign ongoing in the southern Caribbean and off Latin America is called \"Operation Southern Spear,\" per a prior announcement from Pentagon chief Pete Hegseth.\n\n\"We’ve stopped the waterways, but we know every route. We know every route, we know the addresses of every drug lord,\" Trump had additionally explained.\n\n\"We know their address, we know their front door. We know everything about every one of them. They’re killing our people. That’s like a war. Would I do it? I’d be proud to.\"\n\nMexican President Claudia Sheinbaum rejected on Tuesday a potential U.S. military intervention in Mexico after President Donald Trump suggested the previous day he would support more aggressive measures against drug cartels, including ground strikes.\nSheinbaum stated that Trump… pic.twitter.com/mSwThnzjB0\n— CBS News (@CBSNews) November 18, 2025\n\nThe question of US military action south of the border is not a completely 'new' one; however, Operation Southern Spear marks the first time in history that the Pentagon has parked this many US naval assets, including a carrier group, just off Latin America. It's making leaders in the region very nervous, to say the least.","url":"https://www.zerohedge.com/geopolitical/president-sheinbaum-says-no-way-us-strikes-cartels-mexico","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-11/sheinbaum.jpg?h=dd5063d9&amp;itok=gOz_4-oo","video":null,"publish_date":"2025-11-20 00:40:00","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.169},{"id":380696300,"title":"Just what is the truth about Donald Trump and Jeffrey Epstein? The unanswered questions that just won't go away...","text":"Donald Trump loves to use capital letters to make it clear when he’s REALLY ANGRY about something.\n\nAnd he certainly had his finger on the shift key on Sunday night as he tapped out what amounted to the biggest climbdown of his second presidency so far.\n\nWriting on his social media platform, Truth Social, he said House Republicans must vote to release the remaining unpublished files about the Jeffrey Epstein case ‘because we have nothing to hide, and it’s time to move on from this Democrat Hoax perpetrated by Radical Left Lunatics in order to deflect from the Great Success of the Republican Party, including our recent Victory on the Democrat “Shutdown”.’\n\nThe US, he stressed, had to avoid falling into the ‘Epstein “TRAP”’ and becoming distracted by a long-dead sex offender who ‘nobody cared about…when he was alive’ instead of concentrating on the president’s epic achievements.\n\nLeft unsaid was that these words constituted a monumental U-turn by Trump amid a controversy handled so incompetently that it’s overshadowing his second presidency.\n\nUntil the weekend, Trump had done all he possibly could to resist publishing what the government holds on the Epstein scandal. And he only reversed course when he realised he was swimming against the tide - even within his own party.\n\nLike the Democrats, Republicans say they want transparency about what Epstein investigators have uncovered, especially if it pertains to an old Epstein mucker who now inhabits the White House.\n\nThis reportedly close friendship, coupled with Trump’s failed attempts to play it down, have antagonised many of his own MAGA supporters who suspect the 47th President IS at the heart of a vast (and entirely unproven) conspiracy to protect the rich and powerful.\n\nAnd that crisis in Trump’s once rock-solid base of support erupted on Tuesday when the Republican-controlled House of Representatives voted, with the President’s grudging blessing, by 427 to 1 to release the remaining Epstein files.\n\nThe decision, which would compel the Justice Department to disclose its evidence against Epstein (who died while awaiting trial), was swiftly approved unanimously by the Senate and sent yesterday [weds] to Trump to sign off .\n\nIt’s the first concrete sign, say pundits, that Trump’s once iron grip on Republicans is slipping.\n\nHow did Trump know Epstein in the first place?\n\nOf all the potential difficulties that Trump might have faced in his second term, few could have predicted the most intractable would be a long-expired friendship with Jeffrey Epstein, a former neighbour and fellow party boy among the billionaires of Palm Beach, Florida.\n\nThis was during a period - from the late 1980s to the early 2000s - well before The Donald ever dreamed of a political career.\n\nEpstein died in a prison cell 2019 but Trump - who’s consistently denied any wrongdoing in relation to his former friend - insists they’d fallen out as far back as 2004.\n\nThe president says they became estranged because Epstein was recruiting teenage girls from Trump’s Mar-a-Lago resort to work for him. Others say it occurred when they both tried to buy the same Florida property.\n\nWhy is the Epstein scandal still rumbling on?\n\nIt’s not just because Trump and Epstein were once best buddies, although that has inevitably turbocharged the intrigue.\n\nIn fact, there were many unanswered questions left when the financier died in a New York prison cell in 2019, not least the mysteries of where his money came from and who else was involved in Epstein’s sex-trafficking and abuse of women.\n\nSome of Epstein’s accusers - there are potentially hundreds - claim he farmed them out as young women or even as underage girls to his rich and powerful friends.\n\nYet only one person aside from Epstein, former British socialite Ghislaine Maxwell, has ever been prosecuted over this alleged sex trafficking ring.\n\nToday, the women who claim to be Epstein’s victims are among the loudest voices calling for Trump and Congress to publish everything it has on the case so that others - not only individuals who abused them but institutions who either aided or ignored Epstein’s behaviour - might be brought to book.\n\nSome big names have been toppled already.\n\nPrince Andrew - now plain Andrew Mountbatten Windsor, of course - is ruined thanks to his connection to Epstein and the financier’s self-described ‘sex slave’, the late Virginia Giuffre.\n\n(Andrew has always denied wrongdoing, including Virginia’s claims that they had sex three times when she was a teenager.)\n\nA handful of others, including former Barclays chief Jes Staley and former ambassador to the US Peter Mandelson, have been damaged through their connection with Epstein. Otherwise, the scandal has been conspicuous for how few people have been made accountable.\n\nWhy has the Epstein scandal engulfed the Trump administration?\n\nLast week, Democrats on the House Oversight committee released three newly acquired emails that mentioned Trump from among thousands held by the Epstein estate. The Republicans responded by releasing the remaining 23,000 pages.\n\nBut whether this huge dump of Epstein emails has left us any the wiser about the case is debatable.\n\nEpstein was a notorious liar and manipulator who loved to exaggerate how close he was to the rich and powerful. Moreover, his emails aren’t just unreliable they’re usually incomprehensible. The spelling, like the grammar, is dreadful and he loved to write in riddles.\n\nYet, once again, the president has been his own worst enemy.\n\nWhile running for the White House, he and close allies relentlessly encouraged supporters, especially the many conspiracy theorists among them, to believe there had been a huge cover-up around Epstein and that the federal government was protecting powerful individuals.\n\nMany of these conspiracy theorists - who still believe, for example, that Epstein didn’t commit suicide but was murdered to ensure his silence - have shown they are willing to put this obsession before their loyalty to Trump.\n\nAnd Epstein, remember, was a generous donor to the Democrat Party with friends including former Democrat president Bill Clinton. Republicans have long scented a major political scandal that could sink their Washington rivals.\n\nNot that it’s quite working out like that.\n\nDespite Trump’s volte face - last week he urged the Justice Department to launch an investigation into Epstein’s relationship with prominent Democrats - it’s Republicans who are now more likely to panic at mention of the ‘E’ word.\n\nTrump had pledged in his 2024 election campaign that he would declassify the Epstein files, including a much-anticipated ‘list’ of clients of Epstein’s sex trafficking ring.\n\nBut, in a hugely embarrassing (not to say, suspicious) about-turn, some of the very same Trumpites such as Attorney General Pam Bondi and FBI Director Kash Patel - who had previously fanned the flames of the conspiracy theory - announced once they got into power that, well, there was actually no list.\n\nEven his own supporters scoffed. Late last week, Trump had a spectacular bust up with Marjorie Taylor Greene, previously one of his loudest supporters in Congress, whom he condemned as a ‘traitor’ and ‘lunatic’ thanks largely to her insistence that the Epstein files be released.\n\nMeanwhile, Trump’s concerted efforts to distance himself from Epstein have backfired.\n\nFor years, Trump had played down his relationship with the billionaire financier, insisting they were merely associates and that - as he claimed after the latter’s disgrace - he’d never liked him anyway.\n\nIt has since emerged that the truth may have been rather different.\n\nWhat do we now know about Trump’s involvement with Epstein?\n\nTrump and Epstein attended numerous parties together and it’s claimed that in 1992 Trump arranged for a ‘calendar girl’ competition for ‘VIP guests’ to be held at his Palm Beach home ofMar-a-Lago, where he and Epstein were the only two men watching the 28 glamorous contestants.\n\nBut Trump has insisted that he never took part in Epstein’s sordid sexual activities and had no idea they were even taking place.\n\nThis is despite telling the author of a 2002 magazine article that Epstein was a ‘terrific guy… it is even said that he likes beautiful women as much as I do, and many of them are on the younger side’.\n\nTrump’s name appeared seven times in the passenger logs of Epstein’s private jets.\n\nFor Epstein’s 50th birthday in 2003 - three years before he was first arrested - Trump allegedly wrote a cryptic message to him alongside a hand-drawn outline of a naked woman in a book of tributes from friends. (Trump denies doing it and is suing the Wall Street Journal’s parent company Dow Jones and owner Rupert Murdoch for claiming that he did).\n\nAlthough the president says he cut off contact with Epstein in 2004 after he poached Virginia Giuffre from Trump’s Mar-a-Lago club (to work as a ‘masseuse’, Epstein was still discussing his old friend 14 years later.\n\nAmong the messages released by Congress last week was a 2011 email to Ghislaine Maxwell in which Epstein said: ‘I want you to realise that that the dog that hasn’t barked is trump… [VICTIM] spent hours at my house with him, he has never once been mentioned.’\n\n(The White House later said the redacted name was that of Virginia Giuffre who, in a deposition lodged before her death earlier this year, said that Trump never had sex with her or even flirted.)\n\nIn 2015, Epstein emailed a journalist to ask: ‘Would you like photso [sic] of donald and girls in bikinis in my kitchen.’\n\nEpstein also told him about Trump once being ‘so focused’ on watching young women in a swimming pool that he bumped into a door, ‘leaving his nose print on the glass’.\n\nIn another email, this time from 2018, Epstein said of Trump that ‘I am the one able to take him down’. In a message to a former White House lawyer for Barack Obama, ‘I know how dirty donald is’.\n\nThe White House said these emails ‘prove literally nothing’ while Trump has dismissed them as a ‘hoax’.\n\nWho else has been implicated?\n\nWho would have thought Peter Mandelson would become the first politician to be brought down by the scandal. The former New Labour supremo and Business Secretary in Gordon Brown’s government, was sacked as UK Ambassador to Washington in September after emails showed he’d been rather closer to Epstein than he’d previously admitted.\n\nIn particular, he’d sent Epstein supportive messages after the financier pleaded guilty in 2008 to soliciting a minor and was still in touch with him in 2016.\n\nThe newly released emails have further damaged Andrew Mountbatten Windsor who, referring to the now-notorious photo that showed him with 17-year-old Virginia Giuffre, has steadfastly insisted it is a fake.\n\nAs he said in his car-crash Newsnight interview in 2019: ‘I can absolutely categorically tell you [the meeting with Virginia] never happened.’\n\nYet an email sent by Epstein to a journalist in 2011, reads: ‘Yes she [Giuffre] was on my plane and yes she had her picture taken with Andrew.’ It is supposed that the camera was held by Epstein himself.\n\nThis week, Larry Summers, former president of Harvard University and Treasury Secretary under President Clinton, said he will step back from public life after his emails with Epstein - including some in which he asked for advice on pursuing a woman he described as a ‘mentee’ - were made public.\n\n‘I am deeply ashamed of my actions and recognise the pain they have caused,’ said Summers.\n\nWhat else could come out?\n\nAlthough thousands of pages of Epstein-related documents have been released, even more have not.\n\nMost of the discussion has focused on a supposed list of Epstein’s sex trafficking clients which, if it exists, is yet to emerge. The Department of Justice insists that no such list exists.\n\nAlan Dershowitz, Epstein’s former lawyer, says Epstein never had any such list but believes the FBI did draw up one of people it suspected were on it. We haven’t seen that list, either.\n\nThen there is Ghislaine Maxwell, currently serving a 20-year sentence for helping Epstein.\n\nShe has made it clear she doesn’t want her testimony to the grand jury (which examined the evidence before she went to trial) in her case to be unsealed, so it seems fairly likely that there is, indeed, more to come out about her.\n\nThe other abiding question - at least among Trump’s opponents - is whether there’s anything in the correspondence that could bring down the president.\n\nGiven that the Biden administration, which of course had no love for Trump, never tried to do anything with the contents of the files, it seems unlikely.\n\nYet Trump’s refusal to abide by his election promise to reveal all on Epstein has already cost him dearly with some of his supporters and possibly sparked a backlash just as his popularity is fading in the polls.\n\nThe sex-abusing financier who boasted that ‘I am the one able to take him down’ might yet manage it.","summary":"Until the weekend, Trump had done all he possibly could to resist publishing what the government holds on the Epstein scandal.","url":"https://www.dailymail.co.uk/news/article-15307653/Just-truth-Donald-Trump-Jeffrey-Epstein-unanswered-questions-just-wont-away.html","image":"https://i.dailymail.co.uk/1s/2025/11/19/23/103830629-0-image-m-45_1763594427529.jpg","video":null,"publish_date":"2025-11-20 00:37:09","author":"Editor,Tom Leonard","authors":["Editor","Tom Leonard"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.151},{"id":380695820,"title":"Social media ban: Meta and other digital giants protest Australia’s under-16 restrictions and new TV production rules","text":"WorldNorth AmericaSocial media\n\nWashington | American media and technology giants are urging President Donald Trump to reprimand Australia over new laws that dictate foreign players’ television production plans and ban kids from accessing social media.Powerful lobby groups representing Netflix, Disney, Facebook owner Meta, YouTube parent Alphabet and others say a raft of rules put in place by the Albanese government to protect Australians online and regulate the digital economy unfairly target companies from the United States.Loading...Jessica Gardner is The Australian Financial Review’s United States correspondent. She was previously deputy editor - news. Connect with Jessica on Twitter. Email Jessica at jgardner@afr.com or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? License articleFollow the topics, people and companies that matter to you.Find out moreRead MoreSocial mediaTrump diplomacyTrump's AmericaUSAFilm & TV productionChild protectionTradeTrade warsForeign relationsMedia & marketing\n\nFetching latest articlesNo Rolex? No problem – here’s what our watch editor recommends nowBani McSpeddenWhy your mascara and skincare should be in a time capsuleHow the ultra-rich keep their watches and jewellery safeWhy more company directors need to speak outPatrick DurkinWhy this CEO insists on 2 referee checks, and often does them herselfWant to chair a board? 4 tips from a former Macquarie chairmanWhy Mount Gambier’s rock-star grapes are worth travelling forMax AllenForget the typical Euro hustle – Bordeaux is a place to pauseReset and go – Europe’s best spa hotels to visit in 2026Inside Australia’s most expensive country estateGreg BearupThe moment that led to a $750m coal fortune and a Ferrari obsessionLaundys sell pub on NSW’s Central Coast for $18.5 million","url":"https://www.afr.com/world/north-america/trump-urged-to-punish-australia-over-social-media-ban-digital-rules-20251120-p5ngz0","image":"https://static.ffx.io/images/$zoom_0.4505%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_212%2C$y_84/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/b9556eea955a7db5a569fb6d68d7c69bd1ed8c49cad99bcd6ddc1adac1767dc0","video":null,"publish_date":"2025-11-20 00:36:11","author":"Jessica Gardner","authors":["Jessica Gardner"],"language":"en","category":"politics","source_country":"au","sentiment":0.411},{"id":380696870,"title":"DoJ to release Epstein Files within 30 days, says Pam Bondi. Can Trump stop it from happening?","text":"US Attorney General Pam Bondi announced on Wednesday that the country’s Department of Justice would release the infamous Epstein Files within 30 days. The announcement came after the US Congress voted nearly unanimously, demanding the release of files from the DoJ’s investigation into the late British financier and sex offender Jeffrey Epstein.\nThe files in question are expected to shed more light on the activities of Epstein and who he used to socialise with. The calls for its release became intense because of his past association with the current US President, Donald Trump. The scandal has torn the Trump camp for months, partly because he amplified conspiracy theories about Epstein to his own supporters.\nSTORY CONTINUES BELOW THIS AD Many Trump voters have held the belief that his administration has covered up Epstein’s ties to the powerful figures in the United States and presented obscured details surrounding his death, which was ruled a suicide, in a Manhattan jail in 2019 as he faced federal sex trafficking charges.\nMore from United States Of America Did Epstein threaten to take Trump down? Email trove says… Have Republicans had enough? Is Trump facing his biggest rebellion yet over Epstein Files? Files to be out in 30 days: Bondi While speaking at a news conference on Wednesday, Bondi confirmed that the DoJ will release its Epstein-related material within 30 days, as required by legislation that passed the Republican-controlled House of Representatives and Senate on Tuesday. “We will continue to follow the law and encourage maximum transparency,” she said.\nHowever, many are sceptical about what the DoJ actually releases since the legislation passed by the US Congress allows the Justice Department to hold back personal information about Epstein’s victims and material that would jeopardise an active investigation.\nLast week, Trump ordered the agency to investigate several Democratic figures who were associated with Epstein. However, officials decided at that time not to release any information tied to those people.\nThe department has regularly cited the need to protect ongoing investigations when withholding other information from the public. In the past, courts have rejected requests by Trump’s Justice Department this year to unseal transcripts of proceedings before grand juries that investigated Epstein and his former associate Ghislaine Maxwell.\nQuick Reads View All As Trump weaponises tariff, Fed sees a bigger worry: Not jobs, but rising prices in America Despite a backdown deal, Trump deploys hundreds more National Guard troops in Washington DC But will Trump release the files? It is pertinent to note that the bill passed by the US Congress would first need to be signed by Trump, which he has said he will do, but has not as of Wednesday. According to the American Constitution, a president has 10 days after the White House officially receives the bill from Capitol Hill to sign the measure into law or veto it and send it back to Congress.\nHowever, a veto from Trump in this case seems unlikely since the bill has been passed overwhelmingly in both branches of Congress. Overriding a veto takes only a two-thirds majority in the House and Senate.\nTrump can choose not to sign the bill, in which case it would become law in 10 days (minus Sundays). If he does nothing, and lawmakers adjourn within 10 days, that is what’s called a “pocket veto,” something that hasn’t happened in decades. If that happens, supporters of the bill will have to start the process all over again.\nSTORY CONTINUES BELOW THIS AD If Trump signs the bill, the DoJ is obligated to release the files within 30 days. Trump’s own name is expected to be mentioned in the files. According to a CNN report published earlier this year, Bondi told Trump this year that his name appears in the Epstein files.\nNot only this, emails and communications from Epstein’s estate released by the House Oversight Committee also mentioned Trump. His name also appeared in the files released by the Department of Justice in February. However, there was nothing that implicated Trump in wrongdoing at that time.\nWith inputs from Reuters.","url":"https://www.firstpost.com/world/united-states/epstein-files-to-release-within-30-days-pam-bondi-says-can-trump-stop-it-doj-13952289.html","image":"https://images.firstpost.com/uploads/2025/09/AFP__20250925__2237018590__v1__HighRes__PresidentTrumpSignsExecutiveOrderInTheOvalOf-1-2025-09-ec09e9e4f3ad8015933b504f7d52f251.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2025-11-20 00:33:12","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.148},{"id":380698718,"title":"Trump administration makes major changes to a report it commissioned on FEMA reforms, AP sources say","text":"A draft of a much-anticipated report on reforms to the Federal Emergency Management Agency has been whittled down in size, with recommendations compiled by a council appointed by the president slashed and amended by Homeland Security Secretary Kristi Noem’s office, according to three people familiar with the developments.\n\nThe report “got nuked,” said one former FEMA official. The three people, who spoke to The Associated Press on condition of anonymity to discuss the issue with the media, said the report shrunk from over 160 pages to roughly 20. They said it left council members and other emergency management leaders concerned that some of the recommendations about the country’s disaster preparedness won’t make it into the final copy, which is expected around Dec. 12.\n\nThe draft report’s downsizing reflects the Trump administration’s push to disengage the federal government from disaster management and the agency overseeing it, FEMA, pushing more responsibility for preparing, responding to and recovering from climate on states, tribes and territories. \n\nThe former officials said that cutting some of the original recommendations and adding others that further diminish FEMA will not only show that the administration is intervening politically in a professional undertaking. They said the changed recommendations could ultimately leave states and other governments unequipped to prepare for or recover from disasters. \n\nThose who oppose shrinking FEMA say most state and local governments can’t take on more of the enormous financial and logistical strains of rebuilding, especially as the frequency and severity of extreme weather wrought by climate change grows, and that FEMA plays a key coordinating role, shepherding help from across the federal government.\n\nDHS did not immediately respond to requests for comment. Asked about the status of the report, White House spokeswoman Abigail Jackson said the review council will recommend to President Donald Trump how FEMA may be reformed “such that the Federal role remains supplemental and appropriate to the scale of disaster,” and that “Secretary Noem is working hard to implement the President’s vision that will best serve the American public.”\n\nThe initial draft sought reforms to FEMA\n\nThe council, appointed by Trump and made up almost exclusively by members from Republican-led states who support significant FEMA reforms, finished a draft report in early November of over 160 pages, according to the three people. \n\nA table of contents obtained by the AP showed the initial draft included nine “key principles,” including reforming public assistance, flood insurance, direct assistance to survivors, and improving rural resilience.\n\nIt also included sections on potential reforms to the Stafford Act, which dictates most of FEMA’s authorities, and proposes a phased approach to the changes, to prepare state and local governments.\n\nTwo former officials familiar with the matter told the AP the initial recommendations included several of the reforms Trump and Noem have repeatedly touted, including giving states upfront direct grants for disaster recovery instead of reimbursing for the work after it’s done, a process that is often criticized for being too slow and bureaucratic.\n\nOther initial recommendations would reduce how much FEMA pays for disasters by reducing the federal cost share below its current minimum of 75%, and raising the threshold of how much a disaster must be estimated to cost before FEMA recommends to the president that it receive a major disaster declaration. Declarations are ultimately up to the president regardless of that formula.\n\nThe new draft cuts proposed reforms and makes others\n\nAfter submitting the draft in early November to DHS for comment and approval, council members learned Noem’s office cut the report to around 20 pages, the former officials said.\n\nTwo people who had not seen the DHS version but are close to members of the council who did said the new draft removes any mention of mitigation programs and slashes preparedness dollars for local emergency management agencies. The AP could not independently confirm other changes made to the draft.\n\nNoem called a last-minute meeting of the FEMA Review Council on Wednesday afternoon. DHS did not respond to questions about the meeting.\n\nThe AP could not reach council members for comment. \n\nAt a disaster resilience conference in Florida Wednesday, council member and Florida Division of Emergency Management Executive Director Kevin Guthrie said federal funds would “continue to come down” to states, but that, with legislative changes, the money could potentially arrive in “days and weeks,” hinting at the transition to using direct grants. He did not address the draft report in his remarks.\n\nMany of the expected recommendations would require action by Congress because the 1988 Stafford Act lays out most of FEMA’s responsibilities. Other changes could be implemented by Trump or the FEMA administrator.\n\nA Republican-dominated council\n\nFor nearly a year, the council has been meeting around the country, holding listening sessions in disaster-impacted places and surveying emergency management professionals and others on how to reform FEMA, and streamline federal support after disasters. \n\nTrump created the review council by executive order on Jan. 24, the same day he proposed “ getting rid of ” FEMA after touring Hurricane Helene damage in North Carolina. \n\nIt is co-chaired by Noem and Defense Secretary Pete Hegseth, though Hegseth did not attend the last of three public meetings, and Noem attended two meetings virtually. \n\nThe members are almost exclusively from Republican-led states and include the emergency management directors of Texas and Florida, Virginia Gov. Glenn Youngkin, and Texas Gov. Greg Abbott. Former Mississippi Gov. Phil Bryant is vice chair. \n\nMembers held three public meetings between May and August in Washington, D.C., New Orleans and Oklahoma City, along with multiple closed-door listening sessions with Native tribes and in disaster-impacted states and territories including North Carolina and Puerto Rico. They also surveyed emergency management directors and others involved with disaster recovery. \n\nExperts hoped that what they believed was a thorough approach would mean that the final recommendations would be reflective of the broad input.","url":"https://apnews.com/article/fema-review-council-kristi-noem-trump-disasters-22274e65fad13b9e3005e302bcce9cbb","image":"https://dims.apnews.com/dims4/default/3cd142d/2147483647/strip/false/crop/6000x4000+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F8f%2F94a8811628c3d398f7544835e5db%2F96a3f8427dc749ceb037a8b0ab6a4fd6","video":null,"publish_date":"2025-11-20 00:31:47","author":"Gabriela Aoun Angueira","authors":["Gabriela Aoun Angueira"],"language":"en","source_country":"us","sentiment":-0.024},{"id":380700866,"title":"Texas Republicans have gerrymandered their way into a corner","text":"IF DICTIONARIES OF idioms came with illustrations, the congressional-district map that Texas’s government passed in August would be a textbook example of “hoist by one’s own petard”. In response to this nearly unprecedented mid-cycle redistricting, designed to increase the Republican advantage in the state’s congressional delegation from 25-13 to 30-8, voters in California approved a retaliatory gerrymander earlier this month, which is expected to flip five Republican-held seats in the House of Representatives. Then, adding insult to injury, on November 18th a panel of federal judges threw out the Texas map on the grounds that it was racially discriminatory. One of the two judges in the majority was appointed by Donald Trump.","url":"https://www.economist.com/united-states/2025/11/20/texas-republicans-have-gerrymandered-their-way-into-a-corner","image":"https://www.economist.com/content-assets/images/20251122_USP508.jpg","video":null,"publish_date":"2025-11-20 00:31:06","author":"The Economist","authors":["The Economist"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.522},{"id":380700808,"title":"Israel serang Gaza tanpa pedulikan gencatan senjata, 27 maut","text":"GAZA: Serangan udara Israel terbaharu di Gaza meragut 27 nyawa, lapor pihak berkuasa di wilayah terbabit, dengan Israel dan Hamas saling menuding jari berhubung pelanggaran gencatan senjata yang rapuh di wilayah berkenaan.\n\nIa antara serangan yang merekodkan jumlah kematian tertinggi di Gaza sejak perjanjian gencatan senjata dipersetujui kedua-dua pihak berkuat kuasa bulan lalu. \n\nTragedi terbabit berlaku ketika Israel mengumumkan siri serangan serentak menyasarkan Hizbullah di Lubnan, selepas gencatan senjata berlangsung hampir setahun di negara itu.\n\nMenurut agensi pertahanan awam wilayah Gaza yang beroperasi di bawah kendalian pihak berkuasa Hamas, 14 individu terbunuh di bahagian utara Gaza dan 13 lagi di kawasan Khan Younis dalam serangan Rabu lalu itu.\n\nDua hospital yang dihubungi AFP mengesahkan angka korban sama.\n\nTentera Israel berkata, pihaknya menyerang Hamas selepas pasukan terbabit 'melanggar perjanjian gencatan senjata' dengan melepaskan tembakan ke arah kawasan operasi tenteranya di selatan.\n\nHamas menafikan dakwaan itu selain mengecam serangan terbabit 'meningkatkan ketegangan' yang boleh menjejaskan gencatan senjata yang berlangsung sejak 10 Oktober lalu dengan sebahagian besar daripada kandungan perjanjian itu dipatuhi.\n\nSekatan media di Gaza serta kesukaran memasuki banyak kawasan menyebabkan AFP tidak dapat mengesahkan angka korban dan perincian yang diberikan kedua-dua pihak.\n\nMenurut statistik pertahanan awam dan data diterima AFP daripada lima hospital di Gaza, sejak gencatan senjata berkuat kuasa 10 Oktober lalu, angka korban harian tertinggi direkodkan pada 29 Oktober, di mana lebih 100 orang terbunuh dalam serangan Israel.\n\nMenurut statistik Kementerian Kesihatan Gaza yang ditadbir Hamas, lebih 280 penduduk Palestin terbunuh berikutan serangan berulang Israel yang menyasarkan Hamas sepanjang gencatan senjata berlangsung.\n\nPelaksanaan fasa kedua pelan damai Presiden Amerika Syarikat (AS), Donald Trump, masih belum dipersetujui, khususnya berhubung pelucutan senjata Hamas, penubuhan pihak berkuasa peralihan dan penempatan pasukan penstabilan antarabangsa.\n\nMajlis Keselamatan Pertubuhan Bangsa-Bangsa Bersatu (PBB) Isnin lalu dalam undian menyokong resolusi digubal AS bagi mengesahkan pelan Trump, namun Hamas menolaknya kerana ia didakwa gagal memenuhi 'tuntutan politik dan kemanusiaan' rakyat Palestin. - AFP","summary":"GAZA: Serangan udara Israel terbaharu di Gaza meragut 27 nyawa, lapor pihak berkuasa di wilayah terbabit, dengan Israel dan Hamas saling menuding jari berhubung pelanggaran gencatan senjata  yang rapuh di wilayah berkenaan.","url":"https://www.bharian.com.my/dunia/asia/2025/11/1473968/israel-serang-gaza-tanpa-pedulikan-gencatan-senjata-27-maut","image":"https://assets.bharian.com.my/images/articles/bh20strike-o_BHfield_image_listing_featured.var_1763598653.jpg","video":null,"publish_date":"2025-11-20 00:30:58","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.539},{"id":380699588,"title":"EXCLUSIVE: Exposed — King Charles and Donald Trump's 'Dirty Double Deal' Over Jeffrey Epstein Scandal","text":"King Charles and Donald Trump struck a secretive \"dirty double deal\" during the president's recent state visit to the U.K., agreeing the royal family's public backing for Trump would be offered in exchange for assurances that former prince Andrew would not be called to testify before US Congress about his ties to Jeffrey Epstein, sources familiar with the negotiations have told RadarOnline.com.\n\nThe agreement was made while Trump, 79, was enjoying an unprecedented second state visit to Windsor Castle in September 2025, at a time when both he and Charles, 77, faced mounting pressure over scandals linked to Epstein.King Charles' Need for ProtectionTrump, beleaguered by growing demands for transparency on the Epstein files, sought royal endorsement to boost his image and shield himself from domestic critics. \n\nCharles, meanwhile, was grappling with public outrage over his younger brother, the now ex-Prince Andrew's association with the convicted sex offender, and aimed to prevent further international scrutiny of his family.\n\nInsiders claim Trump is convinced being pictured with the royals \"makes him untouchable.\" \n\nOne source said: \"He believes that no matter how bad the scandals are at home, standing next to the King gives him an aura of respectability that washes away the dirt. It's not about diplomacy for him – it's about image and survival.\"The Epstein Birthday BookThe House Oversight Committee's recent release of Epstein's \"birthday book\" – with contacts and notes purportedly linked to Trump – had triggered renewed scrutiny about the president's ties to Epstein. \n\nDuring Trump's visit to Britain, activists projected images of the contentious Epstein birthday card onto the walls of Windsor Castle to highlight his alleged ties to the disgraced sex trafficker. \n\nTrump has denied writing a mucky birthday note to Epstein around the shape of a naked woman.\n\nBut demands to have Andrew, 65 – who Charles recently stripped of his royal titles over his relationship with Epstein – answer questions in Washington about the scandalous bond with the sex predator were growing at the time of Trump's U.K. visit, and insiders say Charles seized the opportunity to strike a deal with the president to quietly back Andrew.A Necessary SecrecyA royal insider claimed: \"There was immense pressure on both sides. \"Charles wanted to protect the monarchy from being dragged deeper into the Epstein scandal, while Trump saw support from the royals as a powerful weapon for his public relations.\"\n\nThe arrangement to back each other made on his U.K. visit made sense for both, but has obviously been shrouded in secrecy out of necessity.\"\n\nAndrew's ties to Epstein have also led Charles to order him out of the $40million Royal Lodge home he has called home for decades.Trump has voiced public sympathy for the royals. In reference to Andrew's disgrace and the fallout from the Epstein affair, he said, \"I feel very badly. I mean, it's a terrible thing that's happened to the family.\"\n\nTrump's reverence for British royalty began with his mother, Mary Anne, a Scottish immigrant who idolized Queen Elizabeth II. \n\n\"I still remember my mother, who is Scottish by birth, sitting in front of the television set to watch Queen Elizabeth's coronation and not budging for an entire day,\" he has said. \n\nA political insider said about his visits to royalty as president: \"He sees these visits as redemption arcs. He can be facing indictments one day, then standing in Windsor Castle the next. \n\n\"In his mind, that contrast frees him from scandal. It's classic Trump – he thinks the crown can launder his mucky reputation.\"","summary":"King Charles and Donald Trump's double deal over the Epstein scandal has been revealed, according to insiders.","url":"https://radaronline.com/p/king-charles-donald-trump-dirty-deal-epstein-scandal/","image":"https://media.radaronline.com/brand-img/9caHp2rWr/0x0/exclusive-exposed-king-charles-and-donald-trumps-dirty-double-deal-over-jeffrey-epstein-scandal1-1763571690400.jpg","video":null,"publish_date":"2025-11-20 00:30:00","author":"Aaron Tinney","authors":["Aaron Tinney"],"language":"en","category":"politics","source_country":"us","sentiment":-0.098},{"id":380699578,"title":"Pakistan’s Munir on a power consolidation trip","text":"Is this the man who has grabbed all the levers of power — or a military strongman, with tanks and troops massed behind him, now teetering on the brink of a precipice of his own making?\n\nThat’s the question swirling around Pakistan’s Field Marshal Asim Munir, a figure who’s effectively tossed his country’s hard-won constitutional framework into the fast-flowing Indus River. He has stamped on what little judicial power the country had. Two Supreme Court judges and a High Court judge have quit in protest since the government created the new Federal Constitutional Court, an institution almost certain to supersede the Supreme Court, Pakistan’s apex judicial body. And the new FCC appears compromised even before its first sitting: the president and prime minister have retained the power to appoint its judges, ensuring the court is anything but independent.\n\nBut the more dangerous, unprecedented changes are unfolding inside the armed forces. Munir will now formally command the air force and navy in addition to the army, transforming the army chief’s role into something far more sweeping. This is particularly galling for the Pakistan Air Force, which has long considered itself a professional, technocratic force and a crucial deterrent against far-larger India. The PAF has traditionally kept itself apart from Pakistan’s political brawls and prides itself on its “high-flying” ethos. What’s more, it argues with justification that May’s Four-Day War was fought with missiles, drones and electronic warfare, not by lumbering land armies. This, they insist, is the template for Next-Gen wars ahead.\n\nPakistan’s 27th Constitutional Amendment entrenches Munir still further by giving him a fresh five-year term. That’s inevitably angered the many senior generals below him who will lose their chance to rise to the top, a particularly bitter blow in a military culture where promotions hinge on timing and seniority. There’s rumbling in the ranks that even top brass disagree with the scale and speed of the structural overhaul. And then comes the most extraordinary provision of all: lifetime prosecution immunity for Munir. Even General Zia-ul-Haq, Pakistan’s most authoritarian military ruler, who dominated every civilian institution during his tenure, didn’t claim such an astonishing privilege.\n\nMunir, those around him say, sees himself as emulating Saudi Arabia’s Crown Prince Mohammad bin Salman (MBS), a leader who smashed old taboos to drag his kingdom out of its most archaic constraints, including bans on women driving. But commentators have pointed out, with no small sarcasm, MBS may not be the most reassuring model, considering the dismemberment of dissident journalist Jamal Khashoggi.\n\nMunir is also glancing over his shoulder, aware the shadow of ex-prime minister Imran Khan still looms large over the army and country. Khan may be in prison, but if he were ever released, he would almost certainly draw enormous crowds. The Establishment fears could turn into something far more explosive.\n\nAnd that, ultimately, is the deeper anxiety driving the 27th Amendment and the 26th before it. As one senior Pakistani commentator puts it, the country’s Establishment is terrified some maverick judge might order Khan’s release, triggering a mass uprising. But it would indeed be a very brave judge who dared to challenge the country’s all-powerful military today.\n\nMunir hopes to position Pakistan as a pivotal player in the New World Order taking shape, and has begun dabbling in geopolitical balancing acts. But to succeed, he must continue the delicate double-game between China and the US. President Donald Trump has unexpectedly described Munir as his “favourite general”. Pakistan, meanwhile, has suggested letting the US develop Pasni in Baluchistan as a port, a proposal fraught with complications, since Pasni sits uncomfortably close to Gwadar, China’s crown jewel investment under the China-Pakistan Economic Corridor. How long can this geopolitical juggling continue? The answer seems increasingly doubtful.\n\nBattered economy\n\nAlso, the harsh reality is while the military plays its power games, there’s little evidence anyone, least of all Munir, can revive Pakistan’s battered economy. The country remains on IMF-mandated life support. While the government has implemented IMF-ordered reforms, that discipline will almost certainly evaporate the moment external oversight ends. It’s also becoming ever clearer Pakistan cannot afford its colossal military expenditure.\n\nThe Chinese once envisioned Pakistan as a model economic partner through the China-Pakistan Economic Corridor, building power plants, so Pakistan now produces more electricity than it consumes. But there’s little chance the broader economy can be rescued while the military holds the upper hand. In Pakistan, tanks, or perhaps now drones, will always triumph over civilian needs. As economic journalist Khurram Husain puts it: “In Pakistan, there’s no debate between guns and butter. The guns always win.”\n\nPublished on November 20, 2025","summary":"Apart from a fresh 5-year term and command of the air force and navy as well, he has got himself lifetime immunity from prosecution and has virtually side-tracked the Supreme Court","url":"https://www.thehindubusinessline.com/opinion/pakistans-munir-on-a-power-consolidation-trip/article70299966.ece","image":"https://bl-i.thgim.com/public/incoming/6cm2ck/article70299982.ece/alternates/LANDSCAPE_1200/2025-07-21T081542Z_182702572_RC2T8EA7M057_RTRMADP_3_INDIA-USA-PAKISTAN.JPG","video":null,"publish_date":"2025-11-20 00:30:00","author":"Paran Balakrishna","authors":["Paran Balakrishna"],"language":"en","category":"politics","source_country":"in","sentiment":0.299},{"id":380698798,"title":"Nvidia reports 'off the charts' demand for AI chips","text":"Nvidia shares climbed Wednesday after it beat quarterly earnings expectations on fierce demand for its sophisticated chips that power artificial intelligence.\n\nThe solid results come amid increasing talk among Wall Street analysts of an AI bubble, with all eyes on how Nvidia, the industry's bellwether company, will weather the doubts.\n\n\"There's been a lot of talk about an AI bubble,\" Nvidia chief executive Jensen Huang said on an earnings call.\n\n\"From our vantage point, we see something very different.\"\n\nJensen reasoned that companies around the world are shifting from classical computing machines and software relying on CPUs to AI-infused systems needing graphics processing units (GPUs) that are Nvidia's specialty.\n\nAdd to that software programs rapidly adapting to the AI age and a trend of AI \"agents\" capable of independently tending to computer work, according to Jensen.\n\n\"Nvidia is chosen because our singular architecture enables all three transitions across every phase of AI,\" Jensen said.\n\n\"Our customer financing is up to them. We see opportunity to grow for quite some time.\"\n\nAI is already paying off for internet giants in the form of improved recommendation engines and efficiencies, according to Jensen.\n\n\"The internet has trillions of pieces of content,\" Jensen said.\n\n\"How could they possibly figure out what to put in front of you and your tiny screen, unless they have really sophisticated recommender systems to do so well -- that has gone generative AI.\"\n\nAI industry rivals have been pouring billions of dollars into Nvidia's prized GPUs to power the technology despite questions regarding how the investments will pay off.\n\nWedbush analyst Dan Ives referred to Nvidia earnings as a \"pop the champagne\" moment for the tech sector and a sign that worries of an AI bubble are overstated.\n\n China sales stalled \n\nNvidia reported profit of $31.9 billion on record-high quarterly revenue of $57 billion, sending shares up more than 5 percent.\n\nIt also took in some 60 percent more money in the quarter than it did during the same period the prior year, according to earnings figures.\n\n\"Blackwell sales are off the charts, and cloud GPUs are sold out,\" Huang said, referring to the latest model of its state-of-the-art hardware.\n\n\"The AI ecosystem is scaling fast -- with more new foundation model makers, more AI startups, across more industries, and in more countries.\"\n\nRevenue in the current quarter is expected to be $65.0 billion, nearly $3 billion more than forecast by Wall Street analysts.\n\nMost of the money brought in during the recently ended quarter came from Nvidia's unit devoted to GPUs for data centers.\n\nNvidia was valued at more than $4.5 trillion based on the number of outstanding shares.\n\nIn the period, Nvidia announced strategic partnerships with OpenAI to deploy at least 10 gigawatts of systems for next-generation AI infrastructure, while Anthropic will adopt one gigawatt of compute capacity using Nvidia's latest systems.\n\nNvidia is caught up in President Donald Trump's trade war with China, where Beijing has responded by expressing national security concerns about Nvidia chips and urging Chinese businesses to rely on local suppliers instead.\n\nSales of H-20 GPUs, which are designed for the Chinese market due to US restrictions on exports of AI chips to that country, tallied only $50 million in the quarter, according to chief financial officer Colette Kress.\n\n\"Sizable purchase orders never materialized in the quarter due to geopolitical issues and the increasingly competitive market in China,\" Kress said on an earnings call.\n\n\"To establish a sustainable leadership position in AI computing, America must win the support of every developer and be the platform of choice for every commercial business, including those in China.\"\n\nSource: AFP","summary":"Nvidia shares climbed Wednesday after it beat quarterly earnings expectations on fierce demand for its sophisticated chips that power artificial intelligence. - China sales stalled - Nvidia reported profit of $31.9 billion on record-high quarterly revenue of $57 billion, sending shares up more than 5 percent.","url":"https://yen.com.gh/business-economy/295001-nvidia-reports-charts-demand-ai-chips/","image":"https://cdn.yen.com.gh/images/1200x675/f33cc9ff90b7a252.jpeg?v=1","video":null,"publish_date":"2025-11-20 00:28:03","author":"Samuel Obour","authors":["Samuel Obour"],"language":"en","source_country":"gh","sentiment":-0.257},{"id":380700750,"title":"Killings in Nigeria: A nation living in denial","text":"By Ebun-Olu Adegboruwa, SAN\n\nThe flurry of activities since November 3, 2025, when America declared Nigeria as a country of particular concern, has been mind-boggling but generally not unexpected. \n\nThe government has been in panic mode, with several inconsistent policies and statements. While in one breath, it was touted that President Tinubu was on his way to the White House to meet with the American Vice- President, another stated clearly that no such meeting was scheduled or envisaged. \n\nBut one thing is clear, mainly that the government is coming to terms with the collapsing security situation in the country.\n\nIf it takes President Donald Trump to wake up President Bola Tinubu to the reality of the enormous responsibility placed upon him by law to protect the people, so be it. Two recent events shaped my resolve on this issue. I watched an unedited video of officers of the Nigeria Customs Service, narrating how they share confiscated rice to terrorists as a form of ransom to secure the lives of these officers and to buy peace. Then I listened to the former Editor of The Guardian Newspapers, Mr. Martins Oloja, in another video interview, wherein he catalogued the various persecutions being suffered by Northerners who are of the Christian faith, undergoing so many deprivations and denials. Because of my own personal experience in the South-West zone of Nigeria, I truly do not see religion as the main issue facing us as a nation.\n\nBut I cannot dismiss or close my eyes to the peculiar circumstances prevailing in the Northern states of Nigeria. I grew up with Muslims, I ate and dined with a good number of them as my fellow comrades, clients and colleagues and I have never truly felt the need to highlight religion as a dividing issue. I was actually trained in my law practice by a muslim who believed solely in merit as the major factor of relating with people. We were trained to dwell together as one big family. Indeed, the Constitution of Nigeria in its section 42 prohibits discrimination against anyone on the ground of faith. It is that serious. But this is not to say that some others are not carrying on as if the Constitution does not exist.\n\nThose should be our target. And it is wrong to pretend that the extremists do not exist to derail the secular nature of our country. The various states in Nigeria that are busy implementing various Sharia Laws over non-muslims who reside and work in their states, are undermining the sanctity of the Constitution and indeed, the sovereignty of Nigeria. As it is presently, we seem to have lost our sovereignty to Sharia Law and jihadists.\n\nLet me share with you a piece that I read on The Nigerian Lawyer WhatsApp platform and other opinions on this issue.\n\n“Thank you for raising the point about Sharia Law’s sacred nature to Muslims. It is an important aspect of this discussion. However, Senator Cruz’s position is not an attack on the personal faith or religious practices of individual Muslims. Rather, it is a necessary stand against how certain aspects of Sharia Law are implemented by the state in ways that systematically violate fundamental human rights, often with deadly consequences. You questioned whether Senator Cruz truly understands Sharia Law, calling it a sacred, divinely derived framework from the Quran and Sunnah that forms the very way of life for Muslims, and suggested his bill reflects “crass ignorance,” much like his takes on the Israeli-Palestinian conflict. With respect, that is a profound misunderstanding of both the bill and the realities on the ground in Nigeria.\n\nCruz’s legislation is not meddling in theology or private devotion. It is a targeted response to state-enforced blasphemy laws that have led to mob lynchings, death sentences, and a culture of impunity. Far from ignorance, this is informed advocacy drawing on documented human rights abuses.\n\nLet me break it down. I asked what the state of Nigeria has done and how many constitutions it practices. This is central to the issue. Nigeria operates under one constitution, the Constitution of the Federal Republic of Nigeria 1999 (as amended). This supreme law guarantees fundamental rights to all citizens, including the right to life (Section 33) and the right to freedom of thought, conscience, and religion (Section 38). However, twelve northern states have implemented Sharia penal codes alongside the national constitution. This creates a de facto legal duality where state-sanctioned religious laws can, in practice, override constitutional protections.\n\nThis is the very conflict Senator Cruz’s legislation seeks to address, sanctioning Nigerian officials who enforce these parallel systems, not Muslims practising their faith.\n\nThe Tragic Reality\n\nRegarding people killed in the name of blasphemy and the state’s response:\n\nPeople have been killed through both extrajudicial mob violence and state-sanctioned sentences. The case of Deborah Yakubu in 2022 is a stark example. She was a Christian student beaten to death and burned by a mob after being accused of blasphemy on WhatsApp. Arrests were made, but the case has dragged on in court with many suspects released or granted bail, fostering a chilling sense of impunity.\n\nState Inaction and Complicity\n\nThe state’s response is often weak, delayed, or non-existent. Mob attackers are rarely prosecuted to conviction, and some individuals have been sentenced to death for blasphemy under Sharia codes, such as Yahaya Sharif-Aminu in Kano State in 2020. His death sentence was only commuted after years of international outcry and appeals. More recently, in 2023, a Bauchi court sentenced a man to death for similar charges, highlighting how these laws embolden vigilantes and perpetuate fear. Nigeria’s National Human Rights Commission has documented over 50 blasphemy-related incidents since 2010, many unresolved.\n\nSenator Cruz’s bill does not seek to tell Muslims how to practise their faith in private.\n\nIt targets officials who enforce a parallel legal system that contravenes Nigeria’s Constitution and international human rights obligations, including the African Charter on Human and Peoples’ Rights, which Nigeria ratified.\n\nWhen state authorities arrest, try, and sentence a citizen to death for blasphemy or fail to protect them from mobs, it is not an act of private religious devotion. It is state-sponsored persecution. The question is not whether Sharia is sacred to Muslims, but whether any government should have the power to legally execute someone for insulting a religion.\n\nIn a country that is a signatory to international human rights covenants and has a constitution guaranteeing freedom of conscience, the answer must be no. Senator Cruz is right to use the tools of U.S. foreign policy, including targeted sanctions, to hold accountable state officials whose actions directly enable this violence and persecution.\n\nThis is not about religious intolerance. It is about defending the universal principle that no one should live in fear of their government for what they believe or say. If we truly value Sharia as a way of life, let’s ensure it is not weaponized by the state to end lives.”\n\nChioma Kate Unini, Editor, The Nigerian Lawyer. \n\n“Genocide is not a contest of body counts. It is not about how many die. It is about why they die. The Fulani militia that burn Christian villages in Benue or Plateau do not ask names. They ask about religion. They do not attack to steal. They attack to cleanse. That is the truth. To pretend otherwise is to help the killers. To explain away their acts is to join their intent. Obfuscation serves evil. It distorts the moral compass of a people. It makes the truth look like politics. The danger of obfuscation is that it normalises horror.\n\nWhen every killing is called “reprisal,” genocide loses meaning. When every massacre is called a “clash”, the state escapes blame. When every burnt church is called a “dispute,” the victims vanish into abstraction. This is how countries lose souls. History is full of such losses.” – Abdul Mahmud, Esq.\n\n“You see, it’s easy to protest against help when you have never lived under the sound of gunfire. Easy to speak boldly when you have never watched people die for simply gathering to pray. But when you come to the North, you see what it truly means to carry the cross in a land where faith is a risk. This is not politics; this is survival. People are being slaughtered, families displaced, churches burnt, yet some talk like we are exaggerating.\n\nDon’t speak of peace from the comfort of your air-conditioned room when others are weeping over the ashes of their homes. And hear me well; this is not a war against any tribe or religion; it is a stand against evil, against extremism that values blood over life.\n\nSo, before you talk, listen. Before you post, understand. If your words won’t heal the wounded, don’t add to their pain. Nigeria is bleeding, and silence is no longer an option. We must speak the truth until justice reigns.” – Prophet Isa El-Buba.\n\nIt is hypocritical to profess that genocide against Christians in Nigeria does not exist when hundreds of people are systematically being wiped out on a daily basis simply on account of their faith. We cannot say that the terrorists are not killing indigenous people and taking over their land but it is possible to posit that their actions do not represent the true religion of Islam. And if this be the case, then we should do all things possible to eliminate them as soon as possible.\n\nIf we are unwilling or unable to do this, anyone who is able and willing to do it deserves the support and encouragement of all. Wherever terrorists operate, whether in the North or South, whether as Christians or Muslims, so long as they pose a threat to the unity and peace of our land, the duty of the government is to combat them and to eliminate them. This is a sacred responsibility imposed upon the government by section 14 of our Constitution.\n\nWe do not need President Donald Trump to tell us this if we are indeed serious about the fight against insecurity. We prolong the issue if we live in denial.","url":"https://www.vanguardngr.com/2025/11/killings-in-nigeria-a-nation-living-in-denial/","image":"https://cdn.vanguardngr.com/wp-content/uploads/2023/09/Adegboruwa.jpg","video":null,"publish_date":"2025-11-20 00:27:00","author":"Nwafor","authors":["Nwafor"],"language":"en","source_country":"ng","sentiment":-0.021},{"id":380698710,"title":"Congress passes measure to reverse Biden's Alaska oil leasing limits","text":"JUNEAU, Alaska (AP) — Congress has passed a measure to overturn a plan enacted during the Biden administration that put off limits to oil and gas leasing nearly half a vast petroleum reserve in Alaska. Critics see the vote as political meddling that creates confusion over the future management of the National Petroleum Reserve-Alaska.\n\nTuesday’s House vote followed passage by the Senate during the government shutdown of the resolution disapproving a management plan for the reserve that was finalized in 2022 under then-President Joe Biden. The offices of Alaska’s Republican congressional delegation members have said the resolution “fulfills the objectives” of an Alaska-specific executive order signed by President Donald Trump earlier this year. The executive order called for reinstating a plan dating to the first Trump administration that sought to make available for leasing about 80% of the reserve. \n\nThe measure next goes to Trump for consideration.\n\nThere has been outsized attention on Alaska since Trump’s return to office, with moves to expand development of oil and gas and other resources cheered by state political leaders who had considered the Biden administration overly restrictive in its approach.\n\nThe votes are among the latest taken under the Congressional Review Act that are aimed at nullifying land management plans adopted under Biden. A statement from the congressional delegation last month said the review act provides an expedited way to overturn certain federal rules and forbids an agency from issuing another substantially similar rule unless it’s authorized by law.\n\nBut Alex Cohen, director of government affairs for the Alaska Wilderness League, called use of the act a “super, super blunt instrument.” Regulatory policy instead requires “very careful, considered stakeholder engagement, scientific analysis,” he said.\n\nThe approach taken by Congress also raises questions about what constitutes a substantially similar rule, Cohen said, adding there is a lack of clarity around what happens when a plan is overturned.\n\nA bill passed earlier this year calls for oil and gas lease sales in the petroleum reserve, for which the last sale was held in 2019, and in the Arctic National Wildlife Refuge. \n\nMajor companies sat out the first two lease sales held for the Arctic National Wildlife Refuge; the first was at the end of Trump’s first term and the second near the end of Biden’s.","url":"https://apnews.com/article/alaska-petroleum-reserve-congress-vote-1d023817a2b5725e313163d60491f58a","image":"https://dims.apnews.com/dims4/default/141570e/2147483647/strip/false/crop/6000x3908+0+0/resize/1486x968!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F4f%2F5e1de53ef29ab709ce3d049de039%2F340e35d9bc274e67b9d689e9a3ee6d38","video":null,"publish_date":"2025-11-20 00:25:50","author":"Becky Bohrer","authors":["Becky Bohrer"],"language":"en","source_country":"us","sentiment":-0.008},{"id":380701538,"title":"Democratic senator accuses Trump of playing politics with aviation safety during shutdown","text":"By JOSH FUNK\n\nDemocratic Sen. Tammy Duckworth suggested during a hearing Wednesday that the Trump administration was playing politics with the aviation system during the shutdown to force an agreement to reopen the government.\n\nDuckworth, of Illinois, zeroed in on why the Federal Aviation Administration and Transportation Secretary Sean Duffy never shared the safety data they relied upon when they decided to order airlines to cut some of their flights at 40 busy airports near the end of the shutdown. She also questioned why President Donald Trump didn’t just find a way to pay air traffic controllers the way he did for the military, although the government relied on help from a private donor to pay soldiers.\n\n“It fails to strengthen confidence in good government, and the American people are understandably suspicious of a DOT and FAA that does not show its work,” Duckworth said during the Commerce Committee’s aviation subcommittee hearing.\n\nDuring the shutdown, Duffy said repeatedly that the FAA ordered airlines to cut flights because of concerning safety data that FAA experts recognized. He said the order was based on the increasing number of controllers calling out of work as they dealt with the financial pressures of working without a paycheck, along with some reports from pilots concerned about controllers’ responses and a number of runway incursions.\n\nDuckworth got political during Wednesday’s hearing because she took offense to the way Republican leaders on the committee said when they announced it that it would “examine the toll Democrats’ government shutdown took on the air traffic control system, airline operations, and training.”\n\nThe White House said Duckworth was the one playing politics after her party repeatedly voted against reopening the government while Democrats tried to reach an agreement on health insurance subsidies.\n\n“If Tammy Duckworth had a shred of integrity and honesty, she would be commending Secretary Duffy’s heroic efforts to keep the skies safe while she and fellow Democrats prioritized playing stupid political games,” White House spokesman Kush Desai said Wednesday.\n\nShutdown may hurt the effort to eliminate controller shortage\n\nAlthough Duckworth led the hearing on a detour into the debate about health insurance subsidies, most of the discussion focused on worries that there could be lasting damage to efforts to eliminate the longstanding shortage of air traffic controllers and attract young people to the profession.\n\n“How do you go into a high school and encourage someone who is about to graduate to get excited about aviation? Get excited about the industry when the headline every single day is you don’t get paid?” said former New Hampshire Gov. Chris Sununu, who now leads the Airlines for America trade group.\n\nAviation industry backs paying controllers during shutdowns\n\nThat’s why the entire aviation industry, through the Modern Skies Coalition, is saying it hopes Congress can find a way to spare crucial workers at the FAA and other agencies the pain of working without pay during the next government shutdown because thousands of flights were delayed or canceled nationwide during this fall’s lapse in funding.\n\nThe airline trade group said more than 6 million travelers were affected by delays and cancellations.\n\nEfforts to address the controller shortage and hire more FAA technicians and test pilots were set back by the shutdown because some people decided to leave the profession and the yearslong training process for these crucial FAA employees was interrupted. The government did find a way to keep the academy that trains air traffic controllers open. But Duffy said that some students and young controllers quit and the number of experienced controllers who decided to retire spiked.\n\nSeveral bills that would make it possible for the FAA to pay its employees during a shutdown have been proposed since the last major shutdown in the first Trump administration, but none have passed because of concerns about costs. Lawmakers hope that the disruptions this fall might provide enough motivation to finally pass a measure like the bipartisan one introduced in the House Tuesday or one that Kansas Republican Sen. Jerry Moran, who led the hearing, proposed again before the shutdown.\n\nFinancial stress weighed on controllers\n\nThe president of the National Air Traffic Controllers Association union, Nick Daniels, said the financial stress of going without pay for a prolonged period adds risks to the nation’s aviation system. Many controllers already work 10-hour shifts six days a week because the FAA is so short on staffing.\n\n“Asking these dedicated, patriotic American workers to survive working full time for more than a month without pay is simply not sustainable,” Daniels said. “That situation creates substantial distractions for individuals who are already engaged in extremely stressful work.”\n\nShutdown delayed plane makers\n\nJim Viola, who leads the General Aviation Manufacturers Association, said he understands how disruptive shutdowns can be because he lived through them when he used to work at the FAA. He said this fall’s shutdown only added to the backlog of applications to get new designs and advancements of planes certified.\n\n“The most significant impact of the 2025 government shutdown on manufacturers is that no new certification projects were allowed to start which impacted the pace of U.S. aerospace innovation and completely halted new business activities,” Viola said. “During the shutdown, the FAA could not accept or facilitate work on any new applications for design and production approvals.”","summary":"More than 6 million travelers were affected by delays and cancellations.","url":"https://www.ocregister.com/2025/11/19/government-shutdown-aviation-politics/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/US_Government_Shutdown_Air_Traffic_Controllers_93783-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-20 00:25:12","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":380695910,"title":"Democratic senator accuses Trump of playing politics with aviation safety during shutdown","text":"By JOSH FUNK\n\nDemocratic Sen. Tammy Duckworth suggested during a hearing Wednesday that the Trump administration was playing politics with the aviation system during the shutdown to force an agreement to reopen the government.\n\nDuckworth, of Illinois, zeroed in on why the Federal Aviation Administration and Transportation Secretary Sean Duffy never shared the safety data they relied upon when they decided to order airlines to cut some of their flights at 40 busy airports near the end of the shutdown. She also questioned why President Donald Trump didn’t just find a way to pay air traffic controllers the way he did for the military, although the government relied on help from a private donor to pay soldiers.\n\n“It fails to strengthen confidence in good government, and the American people are understandably suspicious of a DOT and FAA that does not show its work,” Duckworth said during the Commerce Committee’s aviation subcommittee hearing.\n\nDuring the shutdown, Duffy said repeatedly that the FAA ordered airlines to cut flights because of concerning safety data that FAA experts recognized. He said the order was based on the increasing number of controllers calling out of work as they dealt with the financial pressures of working without a paycheck, along with some reports from pilots concerned about controllers’ responses and a number of runway incursions.\n\nDuckworth got political during Wednesday’s hearing because she took offense to the way Republican leaders on the committee said when they announced it that it would “examine the toll Democrats’ government shutdown took on the air traffic control system, airline operations, and training.”\n\nThe White House said Duckworth was the one playing politics after her party repeatedly voted against reopening the government while Democrats tried to reach an agreement on health insurance subsidies.\n\n“If Tammy Duckworth had a shred of integrity and honesty, she would be commending Secretary Duffy’s heroic efforts to keep the skies safe while she and fellow Democrats prioritized playing stupid political games,” White House spokesman Kush Desai said Wednesday.\n\nShutdown may hurt the effort to eliminate controller shortage\n\nAlthough Duckworth led the hearing on a detour into the debate about health insurance subsidies, most of the discussion focused on worries that there could be lasting damage to efforts to eliminate the longstanding shortage of air traffic controllers and attract young people to the profession.\n\n“How do you go into a high school and encourage someone who is about to graduate to get excited about aviation? Get excited about the industry when the headline every single day is you don’t get paid?” said former New Hampshire Gov. Chris Sununu, who now leads the Airlines for America trade group.\n\nAviation industry backs paying controllers during shutdowns\n\nThat’s why the entire aviation industry, through the Modern Skies Coalition, is saying it hopes Congress can find a way to spare crucial workers at the FAA and other agencies the pain of working without pay during the next government shutdown because thousands of flights were delayed or canceled nationwide during this fall’s lapse in funding.\n\nThe airline trade group said more than 6 million travelers were affected by delays and cancellations.\n\nEfforts to address the controller shortage and hire more FAA technicians and test pilots were set back by the shutdown because some people decided to leave the profession and the yearslong training process for these crucial FAA employees was interrupted. The government did find a way to keep the academy that trains air traffic controllers open. But Duffy said that some students and young controllers quit and the number of experienced controllers who decided to retire spiked.\n\nSeveral bills that would make it possible for the FAA to pay its employees during a shutdown have been proposed since the last major shutdown in the first Trump administration, but none have passed because of concerns about costs. Lawmakers hope that the disruptions this fall might provide enough motivation to finally pass a measure like the bipartisan one introduced in the House Tuesday or one that Kansas Republican Sen. Jerry Moran, who led the hearing, proposed again before the shutdown.\n\nFinancial stress weighed on controllers\n\nThe president of the National Air Traffic Controllers Association union, Nick Daniels, said the financial stress of going without pay for a prolonged period adds risks to the nation’s aviation system. Many controllers already work 10-hour shifts six days a week because the FAA is so short on staffing.\n\n“Asking these dedicated, patriotic American workers to survive working full time for more than a month without pay is simply not sustainable,” Daniels said. “That situation creates substantial distractions for individuals who are already engaged in extremely stressful work.”\n\nShutdown delayed plane makers\n\nJim Viola, who leads the General Aviation Manufacturers Association, said he understands how disruptive shutdowns can be because he lived through them when he used to work at the FAA. He said this fall’s shutdown only added to the backlog of applications to get new designs and advancements of planes certified.\n\n“The most significant impact of the 2025 government shutdown on manufacturers is that no new certification projects were allowed to start which impacted the pace of U.S. aerospace innovation and completely halted new business activities,” Viola said. “During the shutdown, the FAA could not accept or facilitate work on any new applications for design and production approvals.”","summary":"More than 6 million travelers were affected by delays and cancellations.","url":"https://www.sandiegouniontribune.com/2025/11/19/government-shutdown-aviation-politics/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/11/US_Government_Shutdown_Air_Traffic_Controllers_93783-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-20 00:25:12","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":380697732,"title":"Democratic senator accuses Trump of playing politics with aviation safety during shutdown","text":"By JOSH FUNK\n\nDemocratic Sen. Tammy Duckworth suggested during a hearing Wednesday that the Trump administration was playing politics with the aviation system during the shutdown to force an agreement to reopen the government.\n\nDuckworth, of Illinois, zeroed in on why the Federal Aviation Administration and Transportation Secretary Sean Duffy never shared the safety data they relied upon when they decided to order airlines to cut some of their flights at 40 busy airports near the end of the shutdown. She also questioned why President Donald Trump didn’t just find a way to pay air traffic controllers the way he did for the military, although the government relied on help from a private donor to pay soldiers.\n\n“It fails to strengthen confidence in good government, and the American people are understandably suspicious of a DOT and FAA that does not show its work,” Duckworth said during the Commerce Committee’s aviation subcommittee hearing.\n\nDuring the shutdown, Duffy said repeatedly that the FAA ordered airlines to cut flights because of concerning safety data that FAA experts recognized. He said the order was based on the increasing number of controllers calling out of work as they dealt with the financial pressures of working without a paycheck, along with some reports from pilots concerned about controllers’ responses and a number of runway incursions.\n\nDuckworth got political during Wednesday’s hearing because she took offense to the way Republican leaders on the committee said when they announced it that it would “examine the toll Democrats’ government shutdown took on the air traffic control system, airline operations, and training.”\n\nThe White House said Duckworth was the one playing politics after her party repeatedly voted against reopening the government while Democrats tried to reach an agreement on health insurance subsidies.\n\n“If Tammy Duckworth had a shred of integrity and honesty, she would be commending Secretary Duffy’s heroic efforts to keep the skies safe while she and fellow Democrats prioritized playing stupid political games,” White House spokesman Kush Desai said Wednesday.\n\nShutdown may hurt the effort to eliminate controller shortage\n\nAlthough Duckworth led the hearing on a detour into the debate about health insurance subsidies, most of the discussion focused on worries that there could be lasting damage to efforts to eliminate the longstanding shortage of air traffic controllers and attract young people to the profession.\n\n“How do you go into a high school and encourage someone who is about to graduate to get excited about aviation? Get excited about the industry when the headline every single day is you don’t get paid?” said former New Hampshire Gov. Chris Sununu, who now leads the Airlines for America trade group.\n\nAviation industry backs paying controllers during shutdowns\n\nThat’s why the entire aviation industry, through the Modern Skies Coalition, is saying it hopes Congress can find a way to spare crucial workers at the FAA and other agencies the pain of working without pay during the next government shutdown because thousands of flights were delayed or canceled nationwide during this fall’s lapse in funding.\n\nThe airline trade group said more than 6 million travelers were affected by delays and cancellations.\n\nEfforts to address the controller shortage and hire more FAA technicians and test pilots were set back by the shutdown because some people decided to leave the profession and the yearslong training process for these crucial FAA employees was interrupted. The government did find a way to keep the academy that trains air traffic controllers open. But Duffy said that some students and young controllers quit and the number of experienced controllers who decided to retire spiked.\n\nSeveral bills that would make it possible for the FAA to pay its employees during a shutdown have been proposed since the last major shutdown in the first Trump administration, but none have passed because of concerns about costs. Lawmakers hope that the disruptions this fall might provide enough motivation to finally pass a measure like the bipartisan one introduced in the House Tuesday or one that Kansas Republican Sen. Jerry Moran, who led the hearing, proposed again before the shutdown.\n\nFinancial stress weighed on controllers\n\nThe president of the National Air Traffic Controllers Association union, Nick Daniels, said the financial stress of going without pay for a prolonged period adds risks to the nation’s aviation system. Many controllers already work 10-hour shifts six days a week because the FAA is so short on staffing.\n\n“Asking these dedicated, patriotic American workers to survive working full time for more than a month without pay is simply not sustainable,” Daniels said. “That situation creates substantial distractions for individuals who are already engaged in extremely stressful work.”\n\nShutdown delayed plane makers\n\nJim Viola, who leads the General Aviation Manufacturers Association, said he understands how disruptive shutdowns can be because he lived through them when he used to work at the FAA. He said this fall’s shutdown only added to the backlog of applications to get new designs and advancements of planes certified.\n\n“The most significant impact of the 2025 government shutdown on manufacturers is that no new certification projects were allowed to start which impacted the pace of U.S. aerospace innovation and completely halted new business activities,” Viola said. “During the shutdown, the FAA could not accept or facilitate work on any new applications for design and production approvals.”","summary":"More than 6 million travelers were affected by delays and cancellations.","url":"https://www.twincities.com/2025/11/19/government-shutdown-aviation-politics/","image":"https://www.twincities.com/wp-content/uploads/2025/11/US_Government_Shutdown_Air_Traffic_Controllers_93783-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-20 00:25:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":380696318,"title":"Democratic senator accuses Trump of playing politics with aviation safety during shutdown","text":"By JOSH FUNK\n\nDemocratic Sen. Tammy Duckworth suggested during a hearing Wednesday that the Trump administration was playing politics with the aviation system during the shutdown to force an agreement to reopen the government.\n\nDuckworth, of Illinois, zeroed in on why the Federal Aviation Administration and Transportation Secretary Sean Duffy never shared the safety data they relied upon when they decided to order airlines to cut some of their flights at 40 busy airports near the end of the shutdown. She also questioned why President Donald Trump didn’t just find a way to pay air traffic controllers the way he did for the military, although the government relied on help from a private donor to pay soldiers.\n\n“It fails to strengthen confidence in good government, and the American people are understandably suspicious of a DOT and FAA that does not show its work,” Duckworth said during the Commerce Committee’s aviation subcommittee hearing.\n\nDuring the shutdown, Duffy said repeatedly that the FAA ordered airlines to cut flights because of concerning safety data that FAA experts recognized. He said the order was based on the increasing number of controllers calling out of work as they dealt with the financial pressures of working without a paycheck, along with some reports from pilots concerned about controllers’ responses and a number of runway incursions.\n\nDuckworth got political during Wednesday’s hearing because she took offense to the way Republican leaders on the committee said when they announced it that it would “examine the toll Democrats’ government shutdown took on the air traffic control system, airline operations, and training.”\n\nThe White House said Duckworth was the one playing politics after her party repeatedly voted against reopening the government while Democrats tried to reach an agreement on health insurance subsidies.\n\n“If Tammy Duckworth had a shred of integrity and honesty, she would be commending Secretary Duffy’s heroic efforts to keep the skies safe while she and fellow Democrats prioritized playing stupid political games,” White House spokesman Kush Desai said Wednesday.\n\nShutdown may hurt the effort to eliminate controller shortage\n\nAlthough Duckworth led the hearing on a detour into the debate about health insurance subsidies, most of the discussion focused on worries that there could be lasting damage to efforts to eliminate the longstanding shortage of air traffic controllers and attract young people to the profession.\n\n“How do you go into a high school and encourage someone who is about to graduate to get excited about aviation? Get excited about the industry when the headline every single day is you don’t get paid?” said former New Hampshire Gov. Chris Sununu, who now leads the Airlines for America trade group.\n\nAviation industry backs paying controllers during shutdowns\n\nThat’s why the entire aviation industry, through the Modern Skies Coalition, is saying it hopes Congress can find a way to spare crucial workers at the FAA and other agencies the pain of working without pay during the next government shutdown because thousands of flights were delayed or canceled nationwide during this fall’s lapse in funding.\n\nThe airline trade group said more than 6 million travelers were affected by delays and cancellations.\n\nEfforts to address the controller shortage and hire more FAA technicians and test pilots were set back by the shutdown because some people decided to leave the profession and the yearslong training process for these crucial FAA employees was interrupted. The government did find a way to keep the academy that trains air traffic controllers open. But Duffy said that some students and young controllers quit and the number of experienced controllers who decided to retire spiked.\n\nSeveral bills that would make it possible for the FAA to pay its employees during a shutdown have been proposed since the last major shutdown in the first Trump administration, but none have passed because of concerns about costs. Lawmakers hope that the disruptions this fall might provide enough motivation to finally pass a measure like the bipartisan one introduced in the House Tuesday or one that Kansas Republican Sen. Jerry Moran, who led the hearing, proposed again before the shutdown.\n\nFinancial stress weighed on controllers\n\nThe president of the National Air Traffic Controllers Association union, Nick Daniels, said the financial stress of going without pay for a prolonged period adds risks to the nation’s aviation system. Many controllers already work 10-hour shifts six days a week because the FAA is so short on staffing.\n\n“Asking these dedicated, patriotic American workers to survive working full time for more than a month without pay is simply not sustainable,” Daniels said. “That situation creates substantial distractions for individuals who are already engaged in extremely stressful work.”\n\nShutdown delayed plane makers\n\nJim Viola, who leads the General Aviation Manufacturers Association, said he understands how disruptive shutdowns can be because he lived through them when he used to work at the FAA. He said this fall’s shutdown only added to the backlog of applications to get new designs and advancements of planes certified.\n\n“The most significant impact of the 2025 government shutdown on manufacturers is that no new certification projects were allowed to start which impacted the pace of U.S. aerospace innovation and completely halted new business activities,” Viola said. “During the shutdown, the FAA could not accept or facilitate work on any new applications for design and production approvals.”","summary":"More than 6 million travelers were affected by delays and cancellations.","url":"https://www.bostonherald.com/2025/11/19/government-shutdown-aviation-politics/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/US_Government_Shutdown_Air_Traffic_Controllers_93783-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-20 00:25:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":380699052,"title":"The Epstein files: What do we know about what could be included?","text":"The House of Representatives on Tuesday voted 427-1 on a bill to compel the Justice Department to publicly release its files on Jeffrey Epstein, after which the Senate agreed to unanimously approve it, sending it on to President Donald Trump's desk, who has said that he would sign it.\n\nIf that happens, it means that potentially a substantial cache of documents -- in addition to those already made public, which include thousands released last week by the House Oversight Committee -- could be made public about the late multi-millionaire financier, who died by suicide in 2019 while in federal custody after being indicted for alleged sexual trafficking of minors.\n\nThose files would include witness statements, plus electronic and physical evidence, gathered by federal agents and prosecutors during the course of two major investigations of Epstein.\n\nShortly after the Senate approved and sent a bill to force the release of the Jeffrey Epstein files to President Donald Trump's desk on Wednesday, Attorney General Pam Bondi faced questions on how the administration will respond.\n\n\"We have released over 33,000 Epstein documents to the Hill, and we will continue to follow the law and to have maximum transparency. Also, we will always encourage all victims to come forward,\" Bondi said at a news conference alongside FBI Director Kash Patel, Deputy Attorney General Todd Blanche and other officials on an unrelated law enforcement action.\n\nThe exact nature of the documents yet to be released, what information they may include and how redacted the documents may be, remains to be seen. However, there are indications to be found based on the documents and other information already made public.\n\nThe government's Epstein \"Evidence List\"\n\nWhen Attorney General Bondi released Epstein-related files in February, in what she called the \"first phase,\" included in that disclosure was a three-page document that stood out from all the other documents, almost all of which were previously made public. That document, called the “Evidence List,” is a catalog of material apparently obtained through searches of Epstein's properties in New York and the U.S. Virgin Islands after his arrest in 2019, and a search of his Palm Beach mansion more than a dozen years earlier.\n\nThat little-noticed index, which lists the evidence inventoried by federal law enforcement during the multiple investigations into Epstein's conduct, offers a road map to what could be included in the materials that President Donald Trump's administration has so far declined to release, including logs of who potentially visited Epstein's private island and the records of a wiretap of Maxwell's phone.\n\nAccording to the evidence list, the remaining materials include 40 computers and electronic devices, 26 storage drives, more than 70 CDs, and six recording devices – all of which hold more than 300 gigabytes of cumulative data, according to the Justice Department.\n\nThe evidence also includes approximately 60 pieces of physical evidence, including photographs, travel logs and employee lists, as well as multiple documents related to two islands Epstein owned in the U.S. Virgin Islands: Little St. James, where his compound was located, and Greater St. James. They include a Little St. James logbook as well as multiple logs of boat trips to and from the island – documents that could shed light on who visited the island.\n\nFurther evidence noted in the index includes multiple lists, one vaguely described as a \"document with names\" and an employee contact list. Investigators also recovered pages of handwritten notes, multiple photo albums, an Austrian passport with Epstein's photograph, and more than a dozen financial documents.\n\nThe records also include three discs containing the outcome of \"court authorized intercept[s]\" of a phone number previously belonging to Ghislaine Maxwell, the Epstein associate who's currently serving a 20-year prison sentence for recruiting and grooming the underage girls whom Epstein sexually abused.\n\nJustice Department statement on sealed evidence\n\nAdditional indications of what may be included in the yet-to-be-released Epstein files is an unsigned Justice Department statement from July, when the government determined that there would be no further files made public. That statement said the DOJ and FBI had conducted an \"exhaustive review of investigative holdings\" pertaining to Epstein, which they said included \"a significant amount of material, including more than 300 gigabytes of data and physical evidence.\"\n\nIncluded in that evidence, according to the DOJ statement, is \"a large volume of images of Epstein, images and videos of victims who are either minors or appear to be minors, and over ten thousand downloaded videos and images of illegal child sex abuse material and other pornography.\"\n\n\"Only a fraction of this material would have been aired publicly had Epstein gone to trial,\" the DOJ statement further said, adding that the information was sealed \"to protect victims and did not expose any additional third-parties to allegations of illegal wrongdoing\" and that a \"systematic review revealed no incriminating 'client list.' There was also no credible evidence found that Epstein blackmailed prominent individuals as part of his actions. We did not uncover evidence that could predicate an investigation against uncharged third parties.\"\n\nFBI Freedom of Information Act Library\n\nA third repository of evidence collected from Epstein investigations is already publicly available but mostly unknown. The FBI maintains what is essentially an online repository of evidence that was unsealed in response to Freedom of Information Act (FOIA) requests, dating from prior to the current controversy that has engulfed the Trump administration.\n\nIn 2017, the website Radar Online filed a lawsuit against the FBI after its requests for access to FBI records on Epstein were largely denied. In the course of that litigation, the FBI started posting, on a rolling basis, thousands of pages of heavily redacted documents to the FBI website known as The Vault, which the investigative agency describes as \"our FOIA Library.\"\n\nThe Vault contains hundreds of pages of heavily redacted documents posted in 22 separate batches – redactions so extensive as to render most of the records incomprehensible. The government often cites exemptions to public disclosure statutes to redact the names of uncharged third parties to protect their privacy.\n\nThe FBI’s disclosures in response to the Radar Online lawsuit ceased in 2019, when the DOJ reopened its investigation into Epstein and FOIA requests were subsequently denied. Also cited by the government for its denial of new FOIA requests was the criminal prosecution of Ghislaine Maxwell and her appeals that followed.\n\nIt's possible that if all of the government's Epstein files are in fact released, they could include some of the FOIA documents in the FBI Vault with at least some of those redactions lifted. However, those Vault materials wouldn't include anything that post-dates the renewed investigation of Epstein in 2018-19, nor would it include anything recovered from searches of Epstein’s residences after his arrest in 2019.\n\nThe DOJ can also withhold material that \"would constitute a clearly unwarranted invasion of personal privacy\" or \"depicts or contains child sexual abuse,\" according to the bill.\n\nHowever, the bill does contain language that stipulates, \"no record shall be withheld, delayed, or redacted on the basis of embarrassment, reputational harm, or political sensitivity, including to any government official, public figure, or foreign dignitary.\"\n\n'Active' investigations\n\nThe measure also states the Attorney General may withhold or redact info that \"would jeopardize an active federal investigation or ongoing prosecution, provided that such withholding is narrowly tailored and temporary.\"\n\nFor any materials it chooses to withhold or redact, the DOJ is required, within 15 days of their public release, to outline its justifications for doing so. \n\nThe bill's exception regarding an \"active investigation\" could include the new probe of any connections top Democrats had to Epstein that Trump ordered Bondi to pursue last Friday.\n\nABC News' Peter Charalambous contributed to this report.","summary":"Files would include witness statements and electronic and physical evidence gathered by federal agents and prosecutors during two major investigations of Epstein.","url":"https://abcnews.go.com/US/epstein-files-included/story?id=127672425","image":"https://i.abcnewsfe.com/a/4969acf5-2970-4763-9057-4a70b1d98c47/GettyImages-587967668_1763598689364_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-11-20 00:25:00","author":"James Hill","authors":["James Hill"],"language":"en","source_country":"us","sentiment":-0.076},{"id":380698716,"title":"Army secretary to meet with Zelenskyy on Ukraine peace talks, officials say","text":"WASHINGTON (AP) — Several high-ranking Army officials, including Army Secretary Dan Driscoll, are in Ukraine to help with peace talks, U.S. officials said Wednesday, as Trump administration efforts to halt Russia’s war in Ukraine have stalled.\n\nDriscoll had been planning a trip to Ukraine for some time to discuss the country’s drone warfare innovations and tactics, but last week President Donald Trump decided to identify him as a kind of “special representative” to kick-start peace negotiations and conduct a fact-finding mission, one of the officials said.\n\nThat official confirmed Driscoll is scheduled to meet with Ukrainian President Volodymyr Zelenskyy this week as well as top Ukrainian government, military and defense industry officials.\n\nDriscoll is accompanied by Army Chief of Staff Gen. Randy George, the service’s most senior officer; Gen. Chris Donahue, U.S. Army Europe and Africa commanding general; and Sgt. Maj. Michael Weimer, the Army’s top enlisted official, an Army official said.\n\nBoth officials spoke on condition of anonymity to discuss sensitive plans.\n\nUkraine’s ambassador to the United States, Olga Stefanishyna, said in a post on Facebook that the U.S. Army officials began their visit by meeting with Ukrainian Defense Minister Denys Shmyhal. She said they were told about the situation on the battlefield and what was needed to strengthen Ukraine’s defense capabilities, and the two sides also discussed areas of potential defense cooperation. \n\nShmyhal posted a picture on X of himself meeting with Driscoll. Both he and the ambassador noted that the Americans and Ukrainians were focused on implementing defense agreements reached between Trump and Zelenskyy.\n\nNeither Ukrainian official mentioned any discussion about renewing peace negotiations with Russia.\n\nWhite House deputy chief of staff Stephen Miller declined to comment on reports that the Trump administration has drafted a new peace plan and had dispatched U.S. defense officials to Kyiv to go over it with the Ukrainians.\n\n“I would agree that that’s an issue in which the president has continued to put at the forefront of our foreign policy goal, which is to reach a settlement in the Ukraine-Russia war, so that we can have peace in Europe and we can end the killing and the slaughter of so many innocents,” Miller said.\n\nThe Trump administration’s efforts to broker an end to the war have hit roadblocks since the president met with Russian President Vladimir Putin in Alaska in August. Tough new U.S. sanctions on Russia’s oil industry are aimed at pushing him to the negotiating table.\n\nTrump said last month that he was putting on hold his plan for a meeting with Putin in Budapest, Hungary, because he didn’t want it to be a “waste of time.”\n\nZelenskyy and Turkish President Recep Tayyip Erdogan met in Ankara on Wednesday and said they’re committed to finding a peaceful settlement. Kremlin spokesman Dmitry Peskov said Tuesday that Russia was not sending a representative to the meeting in Turkey, but insisted that Moscow was ready to negotiate.\n\nThe U.S. official, meanwhile, said Driscoll is hoping to make a subsequent trip to meet with Russian officials for similar negotiations, adding that the intent is to achieve Trump’s desire for peace as quickly as possible in a way that both sides support.\n\nThe trip to Ukraine also will help the U.S. address the issue of drone warfare, which military officials have consistently said is being pioneered by Ukraine.\n\nDuring an appearance Sunday on CBS’ “Face the Nation,” Driscoll said that drones were the “threat of humanity’s lifetime.”\n\nHe has spent a major portion of his tenure as Army secretary pushing greater integration of drones into the U.S. military arsenal.\n\nShmyhal said in his post that the Americans were shown Ukraine’s “developments in defense innovation: production of FPV drones, interceptors, and deep-strike capabilities.”\n\nThe Wall Street Journal first reported the visit by the Army officials.\n\nAssociated Press writer Aamer Madhani contributed to this report.","url":"https://apnews.com/article/us-army-ukraine-russia-war-trump-talks-308f9a0864c57f3976c0bcbd97fa6d31","image":"https://dims.apnews.com/dims4/default/b3af9a5/2147483647/strip/false/crop/3676x2451+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F63%2F087a15fdf279048c4d1fd70c9131%2Fde1af4997c4f4554aa7e189a8921bdce","video":null,"publish_date":"2025-11-20 00:24:59","author":"Konstantin Toropin","authors":["Konstantin Toropin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.109},{"id":380697372,"title":"Wike Describes Opposition’s Call On Trump As ‘National Security Threat’","text":"Minister of the Federal Capital Territory (FCT), Nyesom Wike, has described recent attempts by the opposition party to involve former U.S. President Donald Trump in Nigeria’s political affairs as a “national security threat” that must be condemned by all patriots.\n\nThe minister made this known on Wednesday during a courtesy visit by the board of the South-South Development Commission (SSDC) to his office in Abuja.\n\nWike singled out factional members within the Peoples Democratic Party (PDP) for making what he termed ‘reckless’ allegations against the government and then seeking foreign intervention.\n\n“Look at what someone said yesterday. You have internal crises in your own party, yet you go on national television claiming there’s genocide against Christians.\n\n“Essentially, you are telling the world that this government is committing genocide. And when security agencies invite you to clarify your claims, people shout, ‘They want to kill him!’” he said.\n\nThe minister further revealed that some political actors had reached out to U.S. President Donald Trump for intervention.\n\n“This is a national security threat. Some are even calling on Trump to ‘save their democracy.’ How can you call an outsider to save you when you can’t obey a simple court order? You cannot keep your house in order and then blame others for your failures. Impunity cannot continue,” he said.\n\nWike, while turning to the SSDC board, cautioned them about the dangers of internal conflict, predicting that the commission’s current harmony would be tested once significant funds are released.\n\n“My advice to you: particularly directors and executive directors, if you don’t work with your board, you will fail. Today, you’re united because there’s no project and no money yet. But the moment ₦50 billion drops and someone spends it without approval, fights will start,” he said.\n\nHe urged the commission members to focus on their mandate and avoid the pitfalls that have plagued other intervention agencies, emphasising the need for total loyalty to President Bola Tinubu.\n\n“Don’t disappoint Mr President. Make him proud of your work. Whatever criticisms people throw at me, I leave with my head high. They can call me stubborn, that’s fine. The right thing must be done,” he said.\n\nEarlier, the managing director of the SSDC, Ms Usoro Akpabio, praised Wike’s leadership and pledged the commission’s commitment to regional development.\n\n“Your hard work continues to inspire us in pursuing our national collective goals,” Akpabio said.\n\nShe assured that the SSDC would strengthen its liaison office in Abuja to enhance collaboration with federal agencies and ensure the South-South region remains at the forefront of policy administration and action plans.","summary":"Minister of the Federal Capital Territory (FCT), Nyesom Wike, has described recent attempts by the opposition party to involve former U.S. President Donald Trump in Nigeria’s political affairs as a “national security threat” that must be condemned by all patriots. The minister made this known on Wednesday during a courtesy visit by the board of [&#8230;]","url":"https://leadership.ng/wike-describes-oppositions-call-on-trump-as-national-security-threat/","image":"https://leadership.ng/wp-content/uploads/2025/10/Wike-1200x778-1.jpg","video":null,"publish_date":"2025-11-20 00:24:30","author":"Igho Oyoyo,Toby Moses","authors":["Igho Oyoyo","Toby Moses"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.339},{"id":380699230,"title":"The Epstein Grifters","text":"There are plenty of serious questions to be asked about Jeffrey Epstein.\n\nWhere did he get his money?\n\nWhy did so many major figures hobnob with him long after his plea agreement on sex charges with minors?\n\nBut when it comes to the ongoing Epstein fallout, there's something else going on: an enormous amount of cynical politicking.\n\nLet's begin with the figures who are supposedly deeply concerned with the Epstein scandal -- and who have been promoting evidence-free conspiracy theories. Take, for example, Steve Bannon. Bannon, who has spent his adult life as a political parasite finding new and larger hosts, glommed onto Epstein in the middle of 2018, by text records. As The Guardian reports, \"the pair were devising responses to the gathering storm of public outrage about Epstein's criminal history, his favorable treatment by the justice system, and his friendships with powerful figures in business, politics and academia.\" The two \"frequently spoke on the phone.\" Bannon even spent \"months in the financier's homes in Manhattan and Paris,\" according to the The Insider; he still has over a dozen hours of footage with Epstein he has never released.\n\nAnd yet earlier this year, Bannon appeared at a Turning Point USA conference at which he spewed conspiracy theories about Epstein: \"Epstein is a key that picks the lock on so many things ... intelligence institutions, foreign governments and who was working with him on our intelligence apparatus and in our government.\"\n\nThis is, to put it mildly, suspicious.\n\nBannon should know the answers to those questions -- he was a close confidant of the sex trafficker. But instead, he has decided to promote conspiracy theories regarding Epstein -- theories that seem to implicate President Donald Trump in a coverup.\n\nAnd Bannon isn't alone.\n\nRep. Marjorie Taylor Greene adopted the Epstein case as a club with which to beat the Trump administration. She made no push to release the Epstein files while Joe Biden was president; instead, she waited until political differences on foreign policy emerged, particularly over Trump's bombing of the Iranian nuclear facility at Fordow, and then signed onto the Epstein Files Transparency Act. The same holds true of Rep. Thomas Massie, another opponent of Trump's foreign policy.\n\nIt's no surprise that these anti-Trump personalities are finding allies on the political left, all of whom despise Trump. That's because these figures are attempting to undermine Trump's policy by attacking him collaterally on Epstein. Their goal is to seize control of the \"Make America Great Again\" movement from Trump, driving it in a far more alt-right-aligned direction. Their true target, of course, is Vice President JD Vance, whom they hope to rope into their ideological maneuver.\n\nWe'll see if it works for them. But as they split the GOP for their own ends, implying that Trump is himself involved in a coverup of a sex trafficking scheme -- all in order to push the GOP to adopt a far less popular or morally palatable platform -- it's clear that the hubbub surrounding Epstein is far less about Epstein than about targeting Trump. And Trump ought to take note.\n\nEditor’s Note: Support and follow PJ Media’s coverage of breaking news and immigration enforcement. Join PJ Media VIP and use promo code FIGHT to get 60% off your membership.","url":"https://pjmedia.com/benshapiro/2025/11/19/the-epstein-grifters-n4946200","image":"https://media.townhall.com/cdn/hodl/2023/62/bb2433fd-dfdb-4623-ba53-a6296c6802ca.png","video":null,"publish_date":"2025-11-20 00:24:00","author":"Ben Shapiro","authors":["Ben Shapiro"],"language":"en","source_country":"us","sentiment":-0.418},{"id":380694748,"title":"A mad House: Members of Congress trade censures and curse words","text":"WASHINGTON — During the House’s long 54-day shutdown recess, lawmakers in both parties begged Speaker Mike Johnson to call them back into session. Now that they’re back, some members are already at each other’s throats and openly defying leadership, while others can’t wait to return home for the holidays. In just the past 48 hours, members of the House have tried to force votes to formally rebuke individual colleagues four times for alleged bad behavior. Resolutions like that used to be rare, but they’ve become a symbol of the bad blood flowing through this toxic Congress. One of them succeeded. On Tuesday, the House voted for Democratic Rep. Marie Gluesenkamp Perez’s resolution to rebuke fellow Democratic Rep. Chuy Garcia for what she called election subversion. The same day, the House rejected a resolution censuring Del. Stacey Plaskett, a Democrat from the Virgin Islands, over her communications with Jeffrey Epstein during a congressional hearing. That resolution was authored by GOP Rep. Ralph Norman, who is running for governor in South Carolina. One of his opponents in that race, Rep. Nancy Mace, on Wednesday brought up her own censure resolution, this one against a fellow Republican, Rep. Cory Mills of Florida, for his alleged misconduct with women and other issues. (Mills has denied wrongdoing). Earlier, Democrats had moved to censure Mills but backed off when the Plaskett censure failed. “I think four censure resolutions in a week says it all. It’s not good for the institution,” Rep. Don Bacon, R-Neb., told NBC News on Wednesday. “The mob mentality is not healthy.” “It’s insanity. They want to convict and sentence people, and then send it to Ethics for investigation. Ass backwards,” added another House Republican lawmaker, who spoke on the condition of anonymity to speak frankly about colleagues. “This is Mace and Norman using their positions for publicity at the expense of the institution.” After the Plaskett vote went down in flames, Rep. Lauren Boebert, R-Colo., a member of the Freedom Caucus that was spearheading the censure, began wagging her finger and lashing out at her GOP colleagues in an F-bomb-laden tirade. “It was multiple F-bombs,” said one Republican who witnessed it on the floor. “At least one of them that I heard clearly was, ‘What the f--- am I doing here?” Rep. Anna Paulina Luna, R-Fla., made a brief speech on the House floor after the vote, accusing the leadership in both parties of “cutting backroom deals” to protect their own members, which they’ve denied. After Luna made her point, another member was heard whooping and telling Luna: “Get it, girl!” Luna then wrote on social media that Mills, a fellow Florida Republican whom she was once close with, is “having lots of issues and should NOT seek re-election.” Then she trained her fire more directly at Mills. After he posted a statement on social media but disabled the comments on Wednesday, Luna quoted the post and wrote: “Turn your comments on, Mills… Stop bulls----ing the American people and Florida residents. Get your crap together, not in Congress.” The Ethics Committee said Wednesday it voted to create a subcommittee to investigate Mills. Rep. Darrell Issa, R-Calif., summed up the week this way: “Those who were happy warriors came back happier than ever, and those who were unhappy warriors came back madder than ever. And I think what those 54 days did is it sort of created people going more the way they were going.” Count Rep. Tim Burchett in the “madder” camp. The Tennessee Republican declared on social media that he was “ticked off” by the lack of serious commitment to a congressional stock trading ban. The House Administration Committee held a hearing on Wednesday exploring potential policy options to crack down on the practice, but some members want to move faster. Luna is threatening to use a discharge petition to force floor action on a ban if she doesn’t feel like leadership is making real progress on the issue. “This is a fist fight, folks,” Burchett said before the hearing. “You know, everybody talks about this place being a dadgum swamp. It’s not a swamp. A swamp is something cool God created. It filters water, animal life lives and flourishes around it. This is a sewer, this was created by man, and it needs to stop.” The discharge petition is a rare procedural tool that rank-and-file members can use to bypass leadership and force bills to the floor — if they can collect the signatures of half of the House, 218 members. They’ve historically had limited success in the House, but members have already successfully used a discharge petition twice since coming back into session just over a week ago: one on forcing the release of the Epstein files and another related to federal workers’ union rights. The increasing frequency of going around leadership is a sign of the growing unrest among lawmakers in both parties. And then there’s the stunning blowup between onetime allies Rep. Marjorie Taylor Greene and President Donald Trump. The president mocked the GOP congresswoman as “Marjorie Traitor Greene” over the weekend, following months of Greene criticizing her own party on a range of issues. And Greene, who signed the Epstein discharge petition, hit back by insinuating Trump was the traitor. “He called me a traitor for standing with these women and refusing to take my name off the discharge petition,” Greene said at a news conference Tuesday, flanked by Epstein victims and their family members. “Let me tell you what a traitor is: A traitor is an American that serves foreign countries and themselves,” Greene said ahead of Trump’s White House meeting with Saudi Arabia’s crown prince followed by a black-tie dinner. Even the usually sunny House speaker has shown visible frustration this week, after the Senate ignored his pleas to amend the Epstein bill and the Senate blindsided the House with a provision allowing senators to sue the DOJ if their phone data is collected without being notified. Railing against what he called the Senate’s “Who Wants to Be a Millionaire provision,” Rep. Kevin Kiley, R-Calif., directed blame at Speaker Johnson and his GOP leadership team, arguing that had they brought the House back into session sooner, the offending provision might never have made its way into the bill that ended the government shutdown. “We also need to ask how this was allowed to happen? And I have to tell you, it doesn’t help that the House wasn’t even here. For six straight weeks, House leadership decided to cancel our sessions, every oversight hearing, every markup of legislation, everything, and why to this day, there’s been no coherent rationale offered?” Kiley said in a floor speech Wednesday. “Now, throughout this time, I warned that this was not only holding back our own legislative priorities, but was also making the House irrelevant in any deal to reopen the government,” he said. “And of course, that’s what ended up happening.” Kiley has also lambasted his own party for starting a nationwide redistricting battle that will likely leave him without a seat in Congress. And adding insult to injury, the GOP’s redrawn Texas map that triggered it all was recently struck down, although the governor is planning to appeal. As censures and curse words fly around the chamber, members of the Appropriations Committee said they’re just trying to keep their heads down and focus on the work of crafting funding bills to avoid another shutdown on Jan. 30. “We’re focused on another package of bills before Christmas,” said Rep. Tony Gonzales, R-Texas. “Other members are getting lots of play throwing rocks at each other — including from their own sides.” Rep. Rashida Tlaib, D-Mich., the sole Palestinian in Congress who herself was censured in 2023 for her critical remarks of Israel after the Oct. 7 terror attack that year, said she found the 50-plus days back in her district to be extremely productive, including helping people secure their Social Security benefits. “The seven weeks I was in the district, overwhelmingly they’re not asking us about Marjorie Taylor Greene or Cory Mills — they are asking us about what to do about the high costs,” Tlaib said in an interview. Each time someone brings a censure resolution, she added, “I always do pay attention and watch who sends a fundraising email right after.”","url":"https://www.nbcnews.com/politics/congress/mad-house-members-congress-trade-censures-curse-words-rcna244829","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-11/251119-Mace-Perez-gk-590267.jpg","video":null,"publish_date":"2025-11-20 00:22:25","author":"Melanie Zanona,Scott Wong","authors":["Melanie Zanona","Scott Wong"],"language":"en","source_country":"us","sentiment":-0.393},{"id":380699768,"title":"Quiet, piggy: Donald Trump&#039;s sexist outburst at woman journalist goes viral","text":"US President Donald Trump turned a routine Air Force One press gaggle into a spectacle on Monday, cutting off a Bloomberg reporter with the line: “Quiet. Quiet, piggy.” The remark, aimed at veteran White House correspondent Catherine Lucey, instantly set off a storm, adding a new flashpoint to Trump’s volatile history with the press.Lucey had asked Trump about the uproar surrounding the Jeffrey Epstein files and whether he supported a House vote to release them. She began her question with, “If there’s nothing incriminating in the files” but never got to finish. Trump jabbed a finger in her direction and said, “Quiet. Quiet, piggy.”Lucey, a senior Bloomberg reporter with more than two decades covering national politics, did not respond during the exchange. But the clip ricocheted across newsrooms within hours..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}The clip took off almost instantly, drawing sharp criticism from across the media world. Journalists and commentators said Trump had belittled a reporter for nothing more than trying to ask a question.CNN's lead anchor Jake Tapper called the remark disgusting and completely unacceptable as he shared the video on X.Former Fox News anchor Gretchen Carlson called the remark “disgusting and degrading.” She said it hit close to home, recalling the scrutiny she faced early in her career. “One of my Miss America judges, William Goldman, wrote an entire book calling me ‘Miss Piggy,’ saying I was too fat to win — at 105 pounds,” wrote Carlson, who won the Miss America title in 1989.California Governor Gavin Newsom, who has been using social media to take on Trump directly, jumped in by mocking Trump with his own brand of meme-style messaging.Meanwhile, the White House has defended Trump after he called a female reporter \"piggy\". \"This reporter behaved in an inappropriate and unprofessional way towards her colleagues on the plane,\" the statement read. \"If you're going to give it, you have to be able to take it.\"Bloomberg News stood by its reporter, saying its White House team performs a vital public service, asking questions without fear or favour, and added that the organisation will keep focusing on reporting issues of public interest fairly and accurately.YOU ARE A TERRIBLE REPORTERThis is not the first time Trump has targeted female correspondents with dismissive language. During a meeting with Saudi Crown Prince Mohammed bin Salman, he scolded ABC News’ Mary Bruce for asking about the murder of Jamal Khashoggi, telling her she was embarrassing their guest and brushing off her questions with, “ABC fake news. One of the worst in the business.”When Bruce pressed him again, this time on the Epstein files, Trump lashed out: “It’s your attitude. I think you are a terrible reporter.” He said he had nothing to do with Epstein, called the scandal a hoax, and accused ABC of being one of the perpetrators. He ended the exchange with: “No more questions from you.” He even suggested regulators should look at ABC’s broadcast licence.- EndsPublished By: Aashish VashisthaPublished On: Nov 20, 2025Tune InMust Watch","url":"https://www.indiatoday.in/world/us-news/story/quiet-piggy-donald-trump-sexist-outburst-at-female-journalist-goes-viral-watch-glbs-2822811-2025-11-20","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202511/donald-trump-174147886-16x9_2.png?VersionId=ceB7NwvsE5llOlhaxIg3KLrPgcbVV4t_?size=1280:720","video":null,"publish_date":"2025-11-20 00:22:23","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.359},{"id":380699022,"title":"US judge questions validity of indictment against Comey","text":"A US judge has repeatedly questioned the validity of the grand jury indictment of former FBI director James Comey secured by a prosecutor closely aligned with President Donald Trump in the latest signal that the charges may be dismissed before trial. After repeated questioning by US District Judge Michael Nachmanoff, prosecutors acknowledged that the final version of the indictment was never presented to the entire grand jury that approved the charges after panel members previously rejected one of the proposed criminal counts. Lawyers for Comey, one of three prominent critics of the Republican president indicted by Trump&apos;s Justice Department in recent months, used a 90-minute hearing in Alexandria, Virginia, to argue for throwing out the indictment ahead of the trial, currently scheduled for January. Defence lawyer Michael Dreeben told Nachmanoff the procedural error acknowledged by the prosecution regarding the indictment was yet another reason for dismissal. Comey pleaded not guilty after being charged in September with making false statements and obstructing a congressional investigation. A ruling by Nachmanoff to dismiss the case would be a major embarrassment for Trump&apos;s administration and would highlight a growing wave of scepticism within the judiciary about his efforts to prosecute political enemies. The hearing focused on Comey&apos;s argument that he is the target of an improper \"vindictive\" prosecution brought solely to punish him for his criticism of the president, who fired him in 2017 amid an FBI investigation into contacts between Trump&apos;s 2016 election campaign and Russians. Dreeben during the hearing called the case \"a blatant use of criminal justice to achieve political ends.\" The actions of Lindsey Halligan, the Trump ally serving as US Attorney for the Eastern District of Virginia, were in the spotlight during the hearing. In a tense but brief exchange, Nachmanoff posed questions directly to Halligan asking her to explain what version of the indictment was presented to the grand jury and who was present. Prosecutors in a Wednesday evening court filing sought to downplay the significance of the technical dispute over the Justice Department&apos;s handling of the indictment, arguing that it was not grounds for dismissing Comey&apos;s case. The filing said the proposed indictment that was shown to the grand jury contained three criminal counts, two of which the panel approved. After the panel declined to indict Comey on one of the charges, prosecutors dropped that count from the indictment, but did not change the language of the other charges when they prepared a subsequent two-count indictment, it said. That version was signed by the jury foreperson but not seen by the full grand jury, prosecutors wrote in their filing. The prosecution has accused Comey of lying to a Senate committee when he said he stood behind prior testimony denying that he authorised disclosures about FBI investigations to the news media. Comey has launched a multi-pronged effort to have the charges dismissed before a trial. His lawyers pointed to Trump&apos;s years of social media broadsides against Comey dating to his firing in 2017. Comey later called Trump unfit for office. Australian Associated Press","url":"https://www.canberratimes.com.au/story/9116062/us-judge-questions-validity-of-indictment-against-comey/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/ec3f4b9c-e1e4-414e-948f-43c78a4215af.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-11-20 00:20:24","author":"Andrew Goudsward And Sarah N. Lynch","authors":["Andrew Goudsward And Sarah N. Lynch"],"language":"en","category":"politics","source_country":"au","sentiment":-0.409},{"id":380694618,"title":"US judge questions validity of indictment against Comey","text":"A US judge has repeatedly questioned the validity of the grand jury indictment of former FBI director James Comey secured by a prosecutor closely aligned with President Donald Trump in the latest signal that the charges may be dismissed before trial. After repeated questioning by US District Judge Michael Nachmanoff, prosecutors acknowledged that the final version of the indictment was never presented to the entire grand jury that approved the charges after panel members previously rejected one of the proposed criminal counts. Lawyers for Comey, one of three prominent critics of the Republican president indicted by Trump&apos;s Justice Department in recent months, used a 90-minute hearing in Alexandria, Virginia, to argue for throwing out the indictment ahead of the trial, currently scheduled for January. Defence lawyer Michael Dreeben told Nachmanoff the procedural error acknowledged by the prosecution regarding the indictment was yet another reason for dismissal. Comey pleaded not guilty after being charged in September with making false statements and obstructing a congressional investigation. A ruling by Nachmanoff to dismiss the case would be a major embarrassment for Trump&apos;s administration and would highlight a growing wave of scepticism within the judiciary about his efforts to prosecute political enemies. The hearing focused on Comey&apos;s argument that he is the target of an improper \"vindictive\" prosecution brought solely to punish him for his criticism of the president, who fired him in 2017 amid an FBI investigation into contacts between Trump&apos;s 2016 election campaign and Russians. Dreeben during the hearing called the case \"a blatant use of criminal justice to achieve political ends.\" The actions of Lindsey Halligan, the Trump ally serving as US Attorney for the Eastern District of Virginia, were in the spotlight during the hearing. In a tense but brief exchange, Nachmanoff posed questions directly to Halligan asking her to explain what version of the indictment was presented to the grand jury and who was present. Prosecutors in a Wednesday evening court filing sought to downplay the significance of the technical dispute over the Justice Department&apos;s handling of the indictment, arguing that it was not grounds for dismissing Comey&apos;s case. The filing said the proposed indictment that was shown to the grand jury contained three criminal counts, two of which the panel approved. After the panel declined to indict Comey on one of the charges, prosecutors dropped that count from the indictment, but did not change the language of the other charges when they prepared a subsequent two-count indictment, it said. That version was signed by the jury foreperson but not seen by the full grand jury, prosecutors wrote in their filing. The prosecution has accused Comey of lying to a Senate committee when he said he stood behind prior testimony denying that he authorised disclosures about FBI investigations to the news media. Comey has launched a multi-pronged effort to have the charges dismissed before a trial. His lawyers pointed to Trump&apos;s years of social media broadsides against Comey dating to his firing in 2017. Comey later called Trump unfit for office. Australian Associated Press","url":"https://www.goulburnpost.com.au/story/9116062/us-judge-questions-validity-of-indictment-against-comey/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/ec3f4b9c-e1e4-414e-948f-43c78a4215af.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-11-20 00:20:24","author":"Andrew Goudsward And Sarah N. Lynch","authors":["Andrew Goudsward And Sarah N. Lynch"],"language":"en","category":"politics","source_country":"au","sentiment":-0.409}]}