{"offset":0,"number":50,"available":6431,"news":[{"id":260258508,"title":"Trump says would impose tariffs if China invades Taiwan","text":"US presidential candidate Donald Trump says he would impose additional tariffs on China if it were to \"go into Taiwan\", the Wall Street Journal reports.\n\n\"I would say: If you go into Taiwan, I'm sorry to do this, I'm going to tax you, at 150 per cent to 200 per cent,\" the former US president was quoted as saying in an interview with the newspaper.","summary":"Donald Trump says he would impose tariffs on China if were to \"go into Taiwan\", and US military intervention would not be needed there under his leadership.","url":"https://thewest.com.au/politics/trump-says-would-impose-tariffs-if-china-invades-taiwan-c-16446901","image":"https://images.thewest.com.au/publication/C-16446901/918f6d667c74c9ea40ff16beea74dd326f612226-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-10-19 00:12:49","author":"Kanishka Singh","authors":["Kanishka Singh"],"language":"en","category":"politics","source_country":"au","sentiment":-0.331},{"id":260258536,"title":"Gonzalez, Flores Debate in Texas Rematch for US House Seat","text":"Democrat U.S. Rep. Vicente Gonzalez and former Republican Congresswoman Mayra Flores squared off in their only debate before election day, with both candidates focusing on the economy and illegal immigration.\n\nThe televised debate took place in the heavily Hispanic Texas District 34 on Oct. 17, in a race that could determine which party controls Congress.\n\nGonzalez and Flores, who are in a rematch for the district seat, clashed over voting records and positions, often talking over each other.\n\nBoth parties have spent hundreds of thousands of dollars on the race. Republicans have been putting more money into South Texas in hopes of increasing their share of Latino voters in the Rio Grande Valley.\n\nOn inflation, one of the top issues, Flores contrasted the current high prices under the Biden-Harris administration to those under former President Donald Trump, who is seeking a second term in the White House.\n\nFlores said Democrats drove up inflation by overspending, which included sending billions of dollars overseas when Americans at home were hurting.\n\n“We have to put Washington on a budget. You know, Americans are on a budget, living paycheck to paycheck,” she said.\n\nGonzalez said inflation was caused by the global pandemic, adding that prices are coming down under the Biden-Harris administration.\n\nHe blamed grocery stores for high food prices, saying they were gouging consumers.\n\n“Clearly, meat prices, poultry prices, egg prices are higher than they should be, but we’ve got to go after corporate price gougers,” he said.\n\nGonzalez called for a government crackdown on “bad actors” taking advantage of consumers, an idea proposed by Vice President Kamala Harris, who is vying to keep the White House in the hands of Democrats.\n\nBoth candidates thought the minimum wage should be increased, with Gonzalez calling for $15 per hour.\n\nGonzalez said the immigration process has been broken for decades. One way to fix it, he said, was through the Safe Zones Act, which he introduced.\n\nThat would establish facilities in countries such as Guatemala, El Salvador, and Panama where asylum seekers could apply and await processing, he said.\n\nMigrants who bypassed those centers and attempted to cross the southern border illegally would be deported under the bill, he added.\n\nOn the issue of abortion, Gonzalez, who is Catholic, said he does not promote abortion, but he would never support a national abortion ban.\n\nHe accused Flores of supporting such a ban and working against in vitro fertilization (IVF) for co-sponsoring the Life at Conception Act while she was in office.\n\nThe bill didn’t pass but defined life as beginning at conception and didn’t include an exception for IVF.\n\n“It’s a national abortion ban. You need to read your own bills,” Gonzalez said.\n\nFlores said that as a mother of four children, she supports IVF as part of her pro-life stance but was not in favor of a national abortion ban.\n\nThe abortion issue has particularly attracted attention in Texas because it has one of the strictest abortion bans in the country.\n\nIt does not allow for the exceptions of rape or incest.\n\nHowever, it does permit abortions to save a pregnant woman’s life or prevent “substantial impairment of major bodily function.”\n\nThe debate was contentious at times, with Flores accusing Gonzalez of “pretending” to be a moderate while supporting leftwing causes such as transgender surgery for kids and men playing in women’s sports.\n\n“You don’t know what a woman is,” Flores said during the debate.\n\nDuring the campaign, the National Republican Congressional Committee helped her with an ad accusing Gonzalez of pushing “sex changes for kids.”\n\nIn the debate, Gonzalez countered by claiming Flores supported Project 2025, which she denied.\n\nDemocrats have attempted to tie Republicans to the plan—developed by the Heritage Foundation—that they consider extreme. Republicans deny involvement in the plan.\n\nDuring closing statements, Gonzalez touted his support for legislation to bring money to South Texas, saying $8 billion in resources have been earmarked to transform infrastructure in the region.\n\nHe said it was essential to take care of veterans and seniors and to support education.\n\nFlores, a legal immigrant from Mexico, focused on the economy in her final statement during the debate, asking voters if they were better off now or four years ago.\n\n“I need you to vote with your pockets. I need you to prioritize the needs of your family and your children,” she said.\n\nGonzalez is running for his fifth term in Congress. He is favored to win District 34, having defeated Flores by 8.5 percentage points in 2022.\n\nHowever, political analysts have said the seat is vulnerable and could be flipped.\n\nFlores, who focused her campaign on “God, family, and country” in 2022, won a special election to fill the seat temporarily that year before being defeated by Gonzalez later in the general election.","summary":"The race for Texas Congressional District 34 is one of a handful nationwide that could decide which party controls Congress.","url":"https://www.theepochtimes.com/us/gonzalez-flores-debate-in-texas-rematch-for-us-house-seat-5743715","image":"https://img.theepochtimes.com/assets/uploads/2024/10/19/id5743994-GettyImages-1153288577-300x180.jpg","video":null,"publish_date":"2024-10-19 00:10:41","author":"Darlene McCormick Sanchez","authors":["Darlene McCormick Sanchez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.374},{"id":260258254,"title":"Harris asks if Trump is \"fit to do the job,\" highlighting health questions","text":"Washington — Vice President Kamala Harris has increasingly questioned former President Donald Trump's ability to handle the demands of another four years in the White House as she seeks to contrast her age with Trump's. \"I'm seeing that his team at least is saying he's suffering from exhaustion,\" Harris, who turns 60 on Sunday, told reporters in Grand Rapids, Michigan, on Friday. Harris was citing a Politico report that said several Trump interviews that were in the works had failed to come to fruition because the 78-year-old Republican nominee was \"exhausted.\" A Trump campaign spokesperson told Politico that was \"unequivocally false.\"\"Look, being president of the United States is probably one of the hardest jobs in the world. And so we really do need to ask, if he's exhausted being on the campaign trail, is he fit to do the job? And I think that's an open-ended question and we need an answer,\" Harris said. Harris said it's a \"legitimate question,\" adding, \"it should be a concern if he can't handle the rigors of the campaign trail.\" Trump has yet to release his recent medical records, claiming Friday, \"you've got them all.\" His campaign has said he's in \"perfect and excellent health\" to be president. In November 2023, Trump shared a letter from his doctor of osteopathic medicine that said he had been examined in September 2023 and that his \"overall health is excellent.\" The letter did not give specifics on his vitals or medications. \"I've done five exams over the last four years,\" Trump told CBS News as he campaigned in Michigan. When pressed on whether he had actually released all of his medical records, Trump called on Harris to take a cognitive test. \"Obviously, I'm in the middle of a very big and very contentious fight we're leading,\" he said. \"I've given my health exams. I've also done cognitive tests twice, and I've aced them, meaning a perfect score. I want to see her do a cognitive test because she couldn't, because she wasn't born smart.\" Trump also said he's \"gone 48 days now without a rest,\" adding, \"I'm not even tired, I'm really exhilarated.\" If elected in November, Trump would be the oldest person to ever assume the Oval Office. Harris released a letter from her doctor last week that said she is in \"excellent health\" and \"possesses the physical and mental resiliency\" required to serve as president. Her physician, Dr. Joshua Simmons, said Harris' latest blood work and other test results were \"unremarkable,\" and that she has no personal history of high blood pressure, diabetes, cardiac disease, neurological disorders or other serious conditions. He noted that she has a history of allergies and urticaria, also known as hives, for which she has been on allergen immunotherapy for the past three years.In a recent letter, more than 230 doctors, nurses and health care professionals, most of whom are backing Harris, called on Trump to release his health records, arguing he was \"displaying alarming characteristics of declining acuity.\" Absent detailed records, the letter said, \"we are left to extrapolate from public appearances.\"","summary":"\"If he's exhausted being on the campaign trail, is he fit to do the job?\" Harris asked as Trump refuses to release detailed medical records.","url":"https://www.cbsnews.com/news/harris-questions-trump-health-medical-records/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/18/8f0e830f-f6bc-460e-ba6c-218303d306e0/thumbnail/1200x630/9d6f01366a53bf47ffbc4726e7f9559e/gettyimages-2178420840.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3261761_hls/master.m3u8","publish_date":"2024-10-19 00:03:25","author":"Caitlin Yilek","authors":["Caitlin Yilek"],"language":"en","category":"politics","source_country":"US","sentiment":-0.078},{"id":260257870,"title":"Anderson Cooper strongly criticizes Republican guest for making Trump assertion","text":"Anderson Cooper swore on-air at a Republican lawmaker who claimed Donald Trump made outlandish statements because he was a New Yorker. The CNN host’s interview with ex-California lieutenant governor Abel Maldonado quickly went off the rails on Wednesday.\n\nMilitary chiefs under the Trump administration have harshly criticized the former president for his conduct while in the top job , and whether he was fit to serve a second term. They include his chief of staff General John Kelly, who claimed he made insulting remarks about soldiers, and then-chairman of the Joint Chiefs of Staff, Mark Milley, who called him ‘fascist to the core’.\n\nMaldonado (second from left) claimed military figures like them thought Trump was a good president when they worked with him, and only criticized him afterwards. ‘A lot of these people, Anderson, when they’re working for him, he’s a good guy,’ he claimed, despite none of them ever saying so. ‘They’re only coming after President Trump after they leave, or they’ve been fired, one of the two.’\n\nThis ignited a fierce argument with Cooper and his other guest, Watergate reporter Carl Bernstein, who asked Maldonado is Trump was a fascist. Maldonado denied this, so Bernstein rephrased his question to ask, ‘Does he say fascistic things?’ ‘He’s a New Yorker. He’s a fighter, he’s a leader,’ Maldonado replied, setting off Cooper.\n\n‘You’re from California. The kids in the Central Park Five, they were actually New Yorkers,’ Cooper said. ‘So, the idea that Donald Trump is a New Yorker and this is what New Yorkers say, is just [expletive].’ The Central Park Five were five black teenagers wrongly convicted of [sexually assaulting] a white woman in 1989, who were eventually exonerated by DNA in 2002.\n\n‘I’m from California and we look at New York as you know, they’re fighters. They’re strong. They tell it like it is. They’ll say it out loud,’ Maldonado insisted. Cooper replied: ‘But that’s a comic book. I mean, again, there’s eight million people in the city.’ Maldonado also claimed during the argument that Trump hadn’t changed, so it was the military leaders who altered their tune.\n\n‘They went to work to help America, to help president Trump, and all of a sudden they have a disagreement. They move on. And then he’s a “fascist”,’ he claimed. Cooper argued that they likely went to work for Trump (or in Milley’s case were simply promoted to the position) so they could temper Trump’s worst impulses. ‘So, you believe that highly decorated General Milley, General Kelly, who was the chief of staff, whose son died serving this country, you believe that they are making stuff up,’ he said.\n\nMaldonado denied that was his point, or that he was accusing them of lying. ‘Donald Trump in 2016 when he ran, you know, who he was, you know who he is. That’s who he is. Trump is not gonna change ever,’ he said. Milley teed off on Trump in Bob Woodward’s book War, warning he planned to use the military against his political opponents. ‘He is the most dangerous person ever. I had suspicions when I talked to you about his mental decline and so forth, but now I realize he’s a total fascist. He is now the most dangerous person to this country,’ he said.\n\nMilley recalled in the book how Trump wanted to court martial generals who spoke out against him. Kelly claimed Trump called decorated military veterans ‘suckers’ and ‘losers’ and refused to be seen with military amputees because ‘it doesn’t look good for me’. He also described Trump as someone who ‘admires autocrats and murderous dictators’.\n\nWant more stories like this from the Daily Mail? Visit our profile page and hit the follow button above for more of the news you need.","summary":"Anderson Cooper swore on-air at a Republican lawmaker who claimed Donald Trump&#8230;","url":"https://internewscast.com/world-news/anderson-cooper-strongly-criticizes-republican-guest-for-making-trump-assertion/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Anderson-Cooper-blasts-Republican-guest-over-Trump-800x430.jpg","video":null,"publish_date":"2024-10-18 23:57:10","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.292},{"id":260257848,"title":"\"It raises real questions\": Harris questions Trump's fitness after media, rally cancellations","text":"Vice President Kamala Harris blasted former President Donald Trump for becoming “exhausted” by his campaign schedule on Friday, arguing that anyone without the stamina to run a campaign can't be an effective president.\n\n“He is ducking debates and canceling interviews. His own campaign team recently said it's because of exhaustion,” Harris said at a rally in Michigan, in her most direct shot at her opponent's health yet. “If you're exhausted on the campaign trail, it raises real questions about whether you are fit for the toughest job in the world.”\n\nThe attacks followed questions on whether Trump is ramping down his campaign commitments due to physical or mental limitations. The candidate pulled out of an NRA rally in Georgia on Thursday, following a raft of media cancellations.\n\nThe Grand Rapids speech came a day after Harris made three stops in Wisconsin.\n\nHarris became the Democratic nominee for president following President Joe Biden’s exit amid concerns about his age. Biden was then the oldest candidate for president in U.S. history. Trump would be the oldest president ever elected were he to win in November.\n\nBucking questions about his own cognitive decline, Trump responded to the jab by denying reports that he was tuckered.\n\n“Tell me when you’ve seen me take even a little bit of a rest, not only am I not– I'm not even tired. I'm really exhilarated,” Trump said on Friday. “She’s not a smart person.”","summary":"The vice president questioned whether her 78-year-old opponent had what it takes amid dwindling campaign schedule","url":"https://www.salon.com/2024/10/18/it-raises-real-questions-harris-questions-fitness-after-media-rally-cancellations/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2024/08/kamala_harris_2167983325.jpg ?>","video":null,"publish_date":"2024-10-18 23:55:57","author":"Griffin Eckstein","authors":["Griffin Eckstein"],"language":"en","category":"politics","source_country":"us","sentiment":0.143},{"id":260257612,"title":"The feds and FOIA subversion: Delay-until-they’re-dead edition","text":"Since its enactment almost 60 years ago, the Freedom of Information Act (FOIA) has been updated multiple times, often in order to try to stop prior federal agency or department practices that thwarted the FOIA’s intended purpose: increased government transparency. Based on the experience of Cato and several news organizations and reporters, federal agencies and departments are now using a new tactic to discourage or thwart FOIA requests: ludicrously low document production schedules.\n\nCato, Advanced Magazine Publishers, Bloomberg News, Buzzfeed News, and journalists Jason Leopold and Jimmy Tobias have all encountered this issue.\n\nSpecifically, the Departments of Justice, Defense (DoD), and Health and Human Services (HHS) as well as the Office of the Director of National Intelligence (ODNI), the Central Intelligence Agency (CIA), and the National Archives and Records Administration (NARA) are refusing to process and release any more that 250 pages per month in FOIA lawsuits brought by the plaintiffs listed above. In the case of Justice components, and specifically the FBI, this represents a 100 percent reduction over their previous monthly document production schedule from just a year ago.\n\nA current Cato FOIA lawsuit against the FBI focused on Situational Information Reports (SIRs) produced by any Strategic Information Operations Center (SIOC) established between January 1, 2020, and January 31, 2021.\n\nWhen the FBI believes that specific domestic incidents may lead to large scale protests and potential violence, the Bureau will often activate a SIOC and issue SIRs–a form of real-time intelligence product–to other federal, state, and local law enforcement partners. Cato is seeking a year’s worth of such data from the critical period covering the George Floyd murder protests and the post-election political protests culminating with the January 6, 2021, attempted coup by then-President Donald Trump and several thousand of his supporters to compare the Bureau’s response to each crisis.\n\nOn October 10 and without notifying Cato or its counsel, DoJ filed a report with the court confirming it had located “approximately 10,596 pages of potentially responsive records” and that it was “approximately 10,596 pages of potentially responsive records” and would complete reviewing and releasing all the material “on or before July 5, 2028” with the caveat that the July 2028 date “may be delayed should the FBI need to consult with other agencies and need to await responses from any such consulted agencies before making any final productions.”\n\nSimply stated and for reasons the FBI has never credibly explained, the Bureau intends to take almost five years to review and release critical law enforcement records on events from one of the most volatile and politically and socially consequential years in American history. And this is hardly the most outrageous example of FBI record production stonewalling.\n\nNearly five years ago this month, Cato filed a FOIA suit seeking the release of all FBI External Intelligence Notes (EINs) produced since that particular FBI intelligence product was created. During the still-ongoing litigation, the FBI has fought to keep every single one of these EIN’s secret, despite the fact that almost none of them contain classified information and that they are shared widely with federal, state, and local law enforcement partners.\n\nIn another Cato FOIA case seeking FBI investigative records known as “Assessments,” a type of investigation that can be opened on any person or organization without them having committed any crime, the FBI’s claimed processing times were astronomical. In court filings, the FBI claimed that processing Cato’s request as submitted would take nearly 2000 years. Even after Cato downscaled its request by 99 percent, the Bureau still claimed it would take over 200 years to process less than 1100 closed (i.e., finished or inactive) Assessments.\n\nCongress cannot allow the FBI or any other federal agencies to process so few records that they become useless to the journalist trying to break news. Congress also cannot allow the Bureau or other federal entities to have FOIA processing times measured in centuries, much less millennia. These tactics, which appear to have been adopted across the Executive branch, must be prohibited in statute.\n\nA fair system would guarantee requesters get the documents they seek in a truly timely fashion. To that end, Congress needs to once again update the FOIA statute.\n\nFailure to do so should not only provide requesters with a cause of action in federal court, but the government should also be forced to pay any attorney fees incurred in litigation, rather than allowing the Justice Department to try to stiff-arm requesters and their lawyers as they do today.\n\nAgencies or departments that are sued for failure to honor the original FOIA request within the 30-day time frame would have no more than 30 additional days to produce the records at issue. Failure to do so would then automatically result in an across-the-board 1 percent cut to the agency or department’s operating budget. Federal agency and department leaders are not going to take FOIA compliance seriously unless and until they know their entire organizations will suffer unless they produce the records requested as required by law.\n\nTo address the huge and every growing backlog of federal records, Congress should declare any permanent federal records 25 or more years old to be presumptively declassified (where applicable) and that all other FOIA exemptions potentially applicable to such records are waived and considered reviewed and the material made available to the public via NARA’s website or physical repositories.\n\nIf enacted, these proposals would make FOIA what its creator, the late Rep. John Moss (D-CA), intended it to be: a powerful tool for enabling meaningful citizen oversight of the federal government.\n\nFormer CIA analyst and ex-House senior policy advisor Patrick G. Eddington is a senior fellow at the Cato Institute.","summary":"Congress needs to once again update the FOIA statute.","url":"https://www.ocregister.com/2024/10/18/the-feds-and-foia-subversion-delay-until-theyre-dead-edition/","image":"https://www.ocregister.com/wp-content/uploads/2024/09/OCR-Z-NATIONAL-DEBT-0104.webp?w=1024","video":null,"publish_date":"2024-10-18 23:55:51","author":"Patrick Eddington","authors":["Patrick Eddington"],"language":"en","source_country":"US","sentiment":-0.097},{"id":260257650,"title":"Trump could scrap Education Dept., up school choice and boost education for all","text":"On the campaign trail this month, former President Donald Trump has repeatedly vowed to “close the federal Department of Education” and expand school choice — a wildly popular concept that cuts across party lines, new polling shows.\n\nGood news: If he wins the White House again, he can do both.\n\nThe federal Department of Education is an unconstitutional waste of time and money. \n\nIts very existence arguably violates the Tenth Amendment: The word “education” appears nowhere in the Constitution. \n\nThe federal government has spent well over a trillion dollars on K-12 education since the department’s inception, while failing to improve student performance.\n\nIt was created in 1980, at the tail end of President Jimmy Carter’s single term in office, as a payoff to the nation’s largest teachers’ union after it endorsed his unsuccessful re-election bid.\n\nTrump wants no part of it. \n\n“I’m going to take the Department of Education, close it in Washington,” he said at a September rally in Pennsylvania. \n\n“Let the states run their own education.” \n\nHe makes a good point. \n\nThe federal government could send the department’s budget back to the states so they can have more education funding to spend as they see fit.\n\nThat would allow for more local control — and less wasteful spending on useless bureaucrats in Washington. \n\nBut if Trump dismantled the federal education bureaucracy, could he also fulfill his separate commitment to unleash school choice?\n\nYes — and here’s how.\n\nThe Educational Choice for Children Act is a bill to set up a nationwide school-choice plan that would be neither run nor regulated by the federal Education Department. \n\nDuring a Fox News interview on Friday, Trump said he would sign it.\n\nAs a federal tax-credit scholarship initiative, ECCA would allow taxpayers to keep more of their own money if they donate to K-12 scholarship programs in their states.\n\nThe idea is popular: A poll released this week found that 69% of American voters “support a federal tax credit that would allow parents to send their students to a school of their choice, including private schools,” according to The Center Square — including 62% of Democrats and 77% of Republicans. \n\nAnd a bill to make that happen is already moving through Congress.\n\nThe House Ways and Means Committee passed ECCA last month along party lines, with all Republicans voting in favor and all Democrats in opposition.\n\nIt’s the first time in American history a nationwide school-choice initiative has advanced out of a congressional committee.\n\nThe bill creates a federal tax benefit for private donors to give to K-12 scholarship organizations. \n\nFamilies can use the scholarships for private-school tuition, tutoring, special needs services, education technology and curriculum materials. \n\nThe idea isn’t unprecedented. \n\nTwenty-one states already have school-choice programs in the form of tax-credit scholarships.\n\nFlorida, for example, launched its tax-credit scholarship initiative in 2001. \n\nNow, nearly half a million students have been awarded scholarships through private school-choice programs in the Sunshine State.\n\nOver the same period, Florida’s education system has climbed to the top of the national rankings — despite spending 27% less than the national average per student.\n\nECCA would benefit families in red states that already have school choice by giving them additional resources to make private education more affordable.\n\nMore importantly, it would give some form of school choice to families in blue states — end-running local lawmakers beholden to the teachers’ unions.\n\nSchool choice is a rising tide that lifts all boats. \n\nNationwide, 26 of the 29 studies on the topic have found that school-choice competition improves outcomes in public schools, forcing them to up their game in response to the competition.\n\nThe next step is for the bill to advance to the House floor, where it has strong Republican support. \n\nIn fact, 153 GOP representatives — about 70% of the caucus — are already listed as cosponsors of ECCA.\n\nAnd no wonder: School choice has become a GOP litmus-test issue after conservative parents in particular witnessed left-wing indoctrination in public schools during COVID-era remote learning.\n\nThe bill’s chance of success is unlikely in the Democrat-controlled Senate, although a majority of its voters support the concept — because the party is a subsidiary of the teachers’ unions.\n\nOver 99% of campaign contributions from Randi Weingarten’s American Federation of Teachers went to Democrats last election cycle, as they have for decades.Kamala Harris and Tim Walz are in lockstep with the unions: The 2024 Democratic Party Platform opposes school choice.\n\nBut with 31 Senate Republicans already signed on to ECCA and the GOP expected to take control of the chamber after November’s elections, nationwide school choice has a real shot at getting across the finish line in 2025 — if Republicans also hold the House and Donald Trump wins.\n\nThat kind of momentum would embolden them to send education back to the states for good by abolishing the federal Department of Education, too.\n\nCorey DeAngelis is a senior fellow at the American Culture Project and author of “The Parent Revolution: Rescuing Your Kids from the Radicals Ruining Our Schools.”","summary":"Former President Donald Trump has vowed to \"close the federal Department of Education\" and expand school choice, and if he wins the White House, there's a clear path for him to do both.","url":"https://nypost.com/2024/10/18/opinion/trump-could-scrap-doe-push-school-choice-and-boost-education/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/DJTDOE.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-18 23:54:59","author":"Corey DeAngelis","authors":["Corey DeAngelis"],"language":"en","source_country":"us","sentiment":0.01},{"id":260257360,"title":"Trump responds to Jack Smith’s release of a 1900-page report containing damaging details about him","text":"Former President Donald Trump slammed prosecutor Jack Smith as a ‘deranged lunatic’ after the judge in his election interference case released more evidence of the allegations against him.\n\nThe 1900-page dossier included how the then president drank soda while watching a mob of his supporters ransack the U.S. Capitol on Jan. 6, 2021 as well as descriptions of his conversations with family members and aides.\n\nTrump said the decision to release the information now, barely two weeks before polling day, amounted to election interference. \n\n‘He’s a deranged lunatic,’ Trump told reporters after landing in Detroit for a campaign event, and he pointed out that Smith had failed to prosecute him over documents found at Mar-a-Lago, after the case was tossed by a judge in July.\n\n‘There is no case. I did absolutely nothing wrong. He’s deranged person. \n\n‘You know what it is? It’s called election hunting. That’s all they are doing. Election hunting. \n\n‘The weaponization of the justice system and the people are wise to it. Nothing was released. There’s nothing released.’\n\nMany of the published pages were whited out and marked ‘sealed,’ but they also included material referenced in a sweeping court filing from earlier this month in which the special counsel argued that Trump was not immune from allegations in the case. \n\nThe unsealed filings include details of interviews conducted by the congressional investigation into the Jan. 6 violence.\n\nNames of witnesses were blacked out. \n\nTrump has pleaded not guilty to four criminal charges accusing him of conspiracy to obstruct the process to certify the results of his 2020 defeat to Democratic candidate Joe Biden.\n\nHis lawyers had argued that none of the material should be released ahead of the Nov. 5 election and successfully delayed its publication by a week.\n\nThe released evidence offers an insight into how Smith is prosecuting Trump. \n\nThe pages include a transcript from the House January 6 committee’s interview of a White House staffer.\n\nIt details how the employee told Trump that TV networks had dropped his speech because of ‘rioting down at the Capitol. \n\n‘And he was, like, What do you mean? I said, It’s, like, they’re rioting there at the Capitol,’ said the employee.\n\n‘And he was, like, Oh, really? And then he was like, All right, let’s go see.\n\n‘I’m taking off his outer coat that he’s wearing right now, and I get the TV, like, ready for him, and hand him over the remote, and he starts watching it.\n\nAnd I stepped out to get him a Diet Coke, come back in, and that’s pretty much it for me as he’s watching it and, like, seeing it for himself.’\n\nThe release infuriated Trump aides.\n\nTrump campaign spokesman Steven Cheung said: ‘Radical Democrats are hell-bent on interfering in the presidential election on behalf of Lyin’ Kamala Harris. With just over two weeks until Election Day, President Trump is dominating this race and Crazed Liberals throughout the Deep State are freaking out. \n\n‘As mandated by the Supreme Court’s historic decision on Presidential Immunity and other vital jurisprudence, this entire case is a sham and a partisan, Unconstitutional Witch Hunt that should be dismissed entirely—as should ALL of the remaining Democrat hoaxes.’","summary":"Former President Donald Trump slammed prosecutor Jack Smith as a &#8216;deranged lunatic&#8217;&#8230;","url":"https://internewscast.com/news/us/trump-responds-to-jack-smiths-release-of-a-1900-page-report-containing-damaging-details-about-him/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Trump-fires-back-after-Jack-Smith-reveals-800x430.jpg","video":null,"publish_date":"2024-10-18 23:49:03","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.21},{"id":260257538,"title":"Trump couldn't pronounce 'Assyrians.' The community is happy to be in the spotlight","text":"It was Donald Trump's mispronunciation that first caught attention.\n\n“Also, we have many Asur-Asians in our room,” Trump said at a weekend rally in Prescott Valley, Arizona. “We have some incredible people in our room.”\n\nAsur-Asians?\n\nIt turns out the former president was trying to shout out a small group of Assyrians supporting his campaign. They'd been given prominent seats right behind him, donning red “Assyrians for Trump” shirts as he spoke in a packed arena 90 minutes north of Phoenix.\n\nAssyrians, a Christian indigenous group tracing their ancestry to ancient Mesopotamia in the modern Middle East, are a tiny minority community in the United States, but they happen to have significant communities in two of the seven swing states that will decide the Nov. 5 election, Michigan and Arizona. That could give them outsized influence in an election that polls show is essentially tied. \n\n“Thank you, President Trump, for making a mistake in our name,” said Sam Darmo, a Phoenix real estate agent and a co-founder of Assyrians for Trump who was seated behind the president at the rally. “Because you know what? Assyrians became very famous. More Americans know who the Assyrians are today than they did back on Sunday.”\n\nAssyrians hail from portions of what is now Iraq, Iran, Syria and Turkey. They are descendants of a powerful Middle Eastern empire and early followers of Christianity whose language is a form of Aramaic, the language scholars believe Jesus Christ spoke. \n\nMany Assyrians, some identifying as Chaldean or Syriac, have fled centuries of persecution and genocide in their homeland, most recently at the hands of the Islamic State group. Ancient relics have been destroyed or stolen and trafficked.\n\nAbout 95,000 people living in the United States identify their ancestry as Assyrian/Chaldean/Syriac, according to U.S. Census Bureau data from 2022. By far the largest concentration is in Michigan, a battleground state home to 38,000 Assyrians. About 5,000 Assyrians live in Arizona. The other five battleground states have fewer than 500 Assyrians each. California and the Chicago area also have large Assyrian communities but are not politically competitive. \n\nThroughout the global Assyrian diaspora, the community has pushed to build monuments to preserve the memory of the atrocities they have faced, including the 1915 deportation and massacre of Assyrians, Armenians and Greeks by the Ottoman Turks. They've also pushed to convince local and national governments to formally recognize the massacre as a genocide, a term widely accepted by historians. Such declarations are vehemently fought by Turkey, which denies the deaths constituted genocide, saying the toll has been inflated and that those killed were victims of civil war and unrest.\n\nTrump pronounced Assyrian correctly in an interview released Thursday with podcaster Patrick Bet-David, who is Assyrian and Armenian. \n\n“You know why they were there?” Trump said. “They were so nice. I met them, the Assyrians. They said, 'Could you give us a shout out?' I said, ‘Who are you?’ I didn’t know. They said, ‘We’re Assyrians.' I said, ‘What’s that mean?’ But they were really nice people. But I said — I think I mispronounced it.”\n\nDarmo confirmed Trump's account, saying he asked Trump for the favor while four Assyrians posed with Trump before the rally. He said the former president instructed an aide to add a shoutout to the teleprompter and speculated that the aide may have misspelled Assyrians in the script. \n\n“We want the Americans to know who we are, and how much we suffered, and how many massacres, genocides have been committed against our people in the Middle East,” Darmo said. \n\nTrump sent his son, Eric Trump, to court Assyrians in Phoenix shortly before the 2020 election. \n\nRamond Takhsh, director of advocacy and outreach for the Assyrian American Association of Southern California, said the community, like all ethnic groups, is not monolithic, and the reaction to Trump's mangled shout-out was not universal. \n\n“We have a diverse spectrum of political viewpoints just like any other ethnic group,” Takhsh said. “Some Assyrians are happy with the recognition that came from former President Trump’s mispronunciation but some are not.”\n\nMona Oshana, an Iraqi-born Assyrian American who co-founded Assyrians for Trump during his first campaign, said the GOP is a good fit for a religious population that fled persecution by authoritarian governments. \n\n“We are an America First community because we came to America based on the echo of freedom and the Constitution,” Oshana said. “We often say we were Americans before coming to America, because we believed in the liberties of America, we believed in the Constitution, we believed in the fight of America.”\n\nDemocratic Vice President Kamala Harris ' campaign also has a grassroots organizing group, Chaldeans and Assyrians for Harris Walz, which is particularly active in Michigan. \n\nSome in the Assyrian community were infuriated by Trump's immigration policies, which significantly curtailed refugee resettlement in the United States. Some were affected by his travel ban restricting entry to the country from seven Muslim-majority countries, including Iran, Iraq and Syria. \n\nA low point was the 2019 death in Baghdad of a 41-year-old Chaldean man who had lived in the U.S. since he was an infant. Jimmy Al-Daoud, who had a history of diabetes and mental illness, was deported for committing multiple crimes in the U.S.","summary":"Assyrian Americans got an influx of attention when former President Donald Trump mangled the word “Assyrian” while giving a shout out at a rally in Arizona","url":"https://www.independent.co.uk/news/ap-donald-trump-michigan-united-states-turkey-b2631954.html","image":"https://static.independent.co.uk/2024/10/19/00/Election_2024_Trump_14793.jpg?width=1200","video":null,"publish_date":"2024-10-18 23:46:30","author":"Jonathan J. Cooper","authors":["Jonathan J. Cooper"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.014},{"id":260257270,"title":"CNN analyst says 'I cannot find 1 Arab-American' who will support Harris, 'even if it means the rise' of Trump","text":"A CNN contributor said on Thursday she was surprised to hear from Arab-Americans that they are not supporting Democratic presidential nominee Kamala Harris. \"I've been talking to people in the business sector, in the Arab-American community, and I was really surprised this week to get an earful, to hear them say that they would much rather either vote a third party, not vote at all or vote for Donald Trump,\" foreign affairs analyst Reena Ninan said. Ninan said that the polling of Arab-American support of former President Trump and Vice President Harris is \"neck and neck,\" but added, \"I cannot find one Arab-American within my social circle in business or personally who have said that they will vote for Kamala Harris,\" while acknowledging it's \"not, obviously, a significant sample size.\" President Biden and Harris have faced pressure from the Arab and Muslim community in the U.S. to implement a ceasefire in Gaza ever since the Israel-Hamas war began over a year ago. Muslim and Arab-Americans protested Biden in the Michigan Democratic primary earlier this year by voting \"uncommitted.\" MICHAEL MOORE URGES VP KAMALA HARRIS TO APPEAL TO ARAB AMERICANS OVER ‘SERIOUS CONCERNS’ ABOUT LOSING MICHIGAN Harris has said she supports Israel's right to defend itself and would not withhold weapons from the country, but has also called for a ceasefire, expressing hope that the killing of Hamas terror chief Yahya Sinwar could create an opportunity to end the war in Gaza. Trump recently said he is Israel's \"protector\" and reaffirmed his support for the Jewish state. According to Ninan, \"What [Arab-Americans] are saying, and this is not a Donald Trump campaign line … that Tiffany Trump's father-in-law, who's a Lebanese businessman, has been successful in kind of converting and talking to people to explain why Trump would be better, even with the Muslim ban, even with everything else that has happened.\" She went on to say of Arab-Americans, \"They feel they do not have any political clout. They don't have any political operation. The only political power they have is their vote, even if it means the rise of Donald Trump.\" \"That’s extraordinary,\" CNN host Abby Phillip replied. \"That’s extraordinary.\" TRUMP SAYS ISRAEL SHOULD HIT IRAN'S NUCLEAR FACILITIES, SLAMMING BIDEN'S RESPONSE Recent data from the Arab American Institute shows Muslim voters across the country being virtually tied between Harris and former President Donald Trump. Harris held a single-point edge against the former president. CLICK HERE TO GET THE FOX NEWS APP","summary":"A CNN contributor said on Thursday that many Arab-Americans are not supporting Vice President Kamala Harris because she is not doing enough in the Gaza conflict.","url":"https://www.foxnews.com/media/cnn-analyst-says-i-cannot-find-1-arab-american-who-support-harris-even-means-rise-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/senator-kamala-harris.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-18 23:42:30","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","source_country":"US","sentiment":-0.399},{"id":260256944,"title":"Trump again refuses to release current health records, as Harris questions his fitness","text":"Donald Trump on Friday dismissed more questions about whether he would release his current medical records, doubling down on refusing to provide a health update even as Kamala Harris works to sow doubts about his fitness for the presidency.\n\nThe 78-year-old Republican nominee, when asked if he will release his health records, suggested that he has already shared enough information about his medical status.\n\n“Yeah, my health records – I’ve done five exams over the last four years. You’ve got them all,” Trump told a reporter on an airport tarmac after landing in Detroit, Michigan, on Friday afternoon.\n\nTrump then appeared to suggest that he was too busy campaigning against Vice President Harris, the Democratic nominee, to devote time to update his records.\n\n“Obviously, I’m in the middle of a very big and very contentious fight,” he said. “We’re leading. I’ve given my health exams.”\n\nTrump added that he has “done cognitive tests twice, and I’ve aced them. Meaning a perfect score.”\n\n“I want to see her do a cognitive test because she couldn’t ace because she wasn’t born smart,” he said, before walking away from the press.\n\nThe Trump campaign did not respond to CNBC’s request for additional comment on Trump’s remarks in Michigan.\n\nTrump told CBS News in August that he would “very gladly” release his medical records, but his campaign has not done so.\n\nHarris, who turns 60 on Sunday, released a detailed health report from her White House doctor on Oct. 12. That same day, Trump campaign spokesman Steven Cheung claimed in a statement that the Republican nominee “has voluntarily released” multiple health reports.\n\nCheung pointed to a three-paragraph letter from Dr. Bruce Aronwald, which was shared last November and related to an exam of Trump that was conducted more than a year ago.\n\nCheung also referred to two memos penned in July by Republican Rep. Ronny Jackson of Texas, who formerly served as Trump’s White House physician. Those memos focused on the injury Trump sustained when he narrowly survived an assassination attempt at a July 13 campaign rally.\n\nHarris, meanwhile, has recently ramped up her health-focused attacks on Trump, who would become the oldest person in U.S. history elected president if he prevails in the Nov. 5 election.\n\nDuring a rally in North Carolina on Sunday, she put a spotlight on Trump’s refusal to release a comprehensive health report, along with his decision not to agree to a second debate.\n\n“It makes you wonder, why does his staff want him to hide away? One must question, one must question, are they afraid that people will see that he is too weak and unstable to lead America? Is that what’s going on?” Harris said.","summary":"Republican presidential nominee, former U.S. President Donald Trump, addresses the media as he arrives at Detroit Metropolitan Wayne County Airport on October 18, 2024, in Detroit, Michigan.  Win Mcnamee &#124; Getty Images Donald Trump on Friday dismissed more questions about whether he would release his current medical records, doubling down on refusing to provide a &#8230;\n\n\nThe post Trump again refuses to release current health records, as Harris questions his fitness appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/trump-again-refuses-to-release-current-health-records-as-harris-questions-his-fitness/","image":"https://image.cnbcfm.com/api/v1/image/108049972-1729282832381-gettyimages-2179388594-wm_10127_r9ijzrbp.jpeg?v=1729282901&w=1920&h=1080","video":null,"publish_date":"2024-10-18 23:36:23","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.368},{"id":260257502,"title":"'Art of the Deal' author says this would be Trump’s 'only limitation' if he wins a 2nd term","text":"The journalist who ghostwrote former President Donald Trump's most well-known book says his hints at being a \"dictator\" on \"Day One\" of a second term should be taken literally.\n\nOn Friday, Tony Schwartz — who wrote \"The Art of the Deal\" 30 years before Trump's ascendancy to the White House — joined MSNBC's Ari Melber to discuss the new film, \"The Apprentice,\" which is currently in theaters. But during one point of their conversation, Schwartz mentioned that Trump has a particularly dangerous personality not suited for public service, which he described as \"the absence of conscience\" combined with cognitive decline.\n\n\"Look, he has one term if he wins and, you know, Anne Applebaum, the writer, is now making connections to what Hitler said and to all of the language of other fascist dictators. That's what he's going to do,\" Schwartz said. \"The only limitation on what Trump will do if he is reelected president is what he can get away with.\"\n\nREAD MORE: 'Art of the Deal' author: Trump has 'been a fraud all his life' but now it's 'official'\n\nAs Schwartz mentioned, the Atlantic's Anne Applebaum wrote Friday about how Trump's latest speeches on the campaign trail is eerily similar to the political rhetoric of some of history's most notorious dictators. She particularly remarked at how similar the former president's description of the media as \"the enemy of the people,\" of the political left as \"vermin\" and immigrants as \"poisoning the blood of our country\" are to fascist dictators like Adolf Hitler of Germany, Benito Mussolini of Italy and Pol Pot of Cambodia.\n\n\"In each of these very different societies, the purpose of this kind of rhetoric was the same,\" she wrote. \"If you connect your opponents with disease, illness, and poisoned blood, if you dehumanize them as insects or animals, if you speak of squashing them or cleansing them as if they were pests or bacteria, then you can much more easily arrest them, deprive them of rights, exclude them, or even kill them.\" \n\n\"If they are parasites, they aren’t human,\" she continued. \"If they are vermin, they don’t get to enjoy freedom of speech, or freedoms of any kind. And if you squash them, you won’t be held accountable.\"\n\nApplebaum's observation that a dictator won't be held accountable for eradicating enemies they have successfully dehumanized harkens back to Schwartz's point about Trump only being held back by \"what he can get away with.\" And after the Supreme Court's 6-3 decision in the Trump v. United States case, Trump will be able to get away with virtually anything deemed an \"official act.\"\n\nREAD MORE: 'Fascist to the core': Trump's top general slams ex-president as 'most dangerous person'\n\nMelber pointed out earlier in his show that if Trump were to follow through on his promise to order the military to shoot migrants at the border, it would be considered an \"illegal order\" and that enlisted men and women would be duty-bound to say no. But as Supreme Court Justice Sonia Sotomayor said when the immunity ruling was handed down, Trump — or any president — would be free to assassinate political rivals with no way for the courts to step in.\n\n\"\"Orders the Navy’s Seal Team 6 to assassinate a political rival? Immune. Organizes a military coup to hold onto power? Immune. Takes a bribe in exchange for a pardon? Immune. Immune, immune, immune,\" she wrote in her dissent.\n\nWatch Schwartz's segment below, or by clicking this link.\n\nREAD MORE: Sonia Sotomayor: Supreme Court just gave presidents power to assassinate political rivals","summary":"The journalist who ghostwrote former President Donald Trump's most well-known book says his hints at being a \"dictator\" on \"Day One\" of a second term should be taken literally.\n\nOn Friday, Tony Schwartz — who wrote \"The Art of the Deal\" 30 years before Trump's ascendancy to the White House — joined MSNBC's Ari Melber to discuss the new film, \"The Apprentice,\" which is currently in theaters. But during one point of their conversation, Schwartz mentioned that Trump has a particularly dangerous personality not suited for public service, which he described as \"the absence of conscience\" combined with cognitive decline.\n\n\"Look, he has one term if he wins and, you know, Anne Applebaum, the writer, is now making connections to what Hitler said and to all of the language of other fascist dictators. That's what he's going to do,\" Schwartz said. \"The only limitation on what Trump will do if he is reelected president is what he can get away with.\"\n\nREAD MORE: 'Art of the Deal' author: Trump has 'been a fraud all his lif","url":"https://www.alternet.org/trump-limitation-second-term/","image":"https://www.alternet.org/media-library/image.png?id=53836391&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2024-10-18 23:33:19","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":0.105},{"id":260256866,"title":"Letters: East Bay parks | Gas prices | Dems’ no votes | Harris’ inexperience | Racism’s role","text":"Vote for Gonzales\nfor East Bay parks\n\nSupport Susan Gonzales for Ward 4 of the East Bay Regional Park District. \n\nSusan recognizes the need for action concerning maintaining and improving existing infrastructure, reviewing funding, providing appropriate staffing levels and addressing issues related to climate change, especially sea level rise.\n\nSusan has nearly 40 years of experience in public service; 16 years as part of the executive staff of the park district.\n\nPlease join me in voting for Susan Gonzales.\n\nAnne Rockwell\n\nNew policy will not\ndecrease gas prices\n\nRe: “Phillips 66 closing California refinery; more than 600 jobs at stake” (Oct. 17).\n\nThe cost of gas will go up, not down.\n\nLet’s face it, there are two factors that drive the high cost of gas in California. One is the high taxes we apply to it, and the other is the high cost of compliance with California regulatory requirements.\n\nI don’t see how forcing refineries to keep more gas on hand will lower costs, it will just lower the freshness of the gas.\n\nRauly Butler\n\nNo votes show Dems\nthink for themselves\n\nI thought an interesting question asked by Fox News in the Kamala Harris interview was, “Why did six Democratic senators vote against the border bill?”\n\nWell, you have 51 Democratic senators, most from different states with different priorities. And they each have different visions of what will work best for America. Some feel the bill did not go far enough, that too much compromise was made. Some feel the bill went too far in some details. So, getting 88% agreement on a complex bill is doing really well.\n\nIn the other party, loyalty to party seems to “Trump” all that. Republicans have to consider getting “primaried.” Therefore, their voting is more uniform. \n\nSo the answer to the question is really, “Because Democrats think for themselves.”\n\nHarris’ inexperience is\na threat to the nation\n\nRe: “What has Trump done to earn votes” (Page A6, Oct. 17 ).\n\nIn response to DiAnn Hillerman‘s letter,I ask a similar question: What has Kamala Harris done to be president?\n\nThe thought is frightening. Think of the people she would select for her staff and cabinet positions. Think of her inexperience with foreign affairs, the economy, the financial system and dealing with the Russians and Chinese. Think of her track record dealing with the border and crime, and how it might impact you and your kid’s personal safety. Think of her flip-flopping on strategic issues. Does the public know what Kamala’s policies might really do? Does she understand values vs. actions?\n\nAs for leadership and what’s best for the country, and watching Kamala in recent interviews, I’ll take my chances with Donald Trump and JD Vance. My guess is most of the rest of the country (sans California and New York) will as well.\n\nChris Kniel\n\nTrump’s racism informs\nviews on immigrants\n\nDonald Trump has been warning about how immigrants are bringing “bad genes” to America. Did he get bad genes from his immigrant mother? Did Donnie, Eric, Ivanka and Barron get bad genes from their immigrant mothers? He doesn’t say.\n\nBut he seems to feel Black, Brown and Chinese immigrants are a problem. This isn’t a matter of genes but of unvarnished racism.\n\nUnless all of one’s ancestors are Inuit, Hawaiian or Native American — the inhabitants of the states before colonization — then all of us are descended from immigrants. And that is not a bad thing.\n\nThe television series “Bob Hearts Abishola” focused on immigrants making their way in Detroit. Chuck Lorre, the creator of the show, often put this reminder in the final credits: “IMAG. Immigrants Made America Great.”\n\nI really don’t worry about the content of Trump’s veins. I worry about the malice in his heart.","summary":"East Bay Times Letters to the Editor for Oct. 20, 2024","url":"https://www.mercurynews.com/2024/10/18/letters-1908/","image":"https://www.mercurynews.com/wp-content/uploads/2019/01/SJM-L-CLEARSKY-0124-1.jpg?w=1024","video":null,"publish_date":"2024-10-18 23:30:21","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.113},{"id":260257726,"title":"Judge unseals heavily redacted trove of evidence in Trump’s 2020 election interference case","text":"By ERIC TUCKER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — The judge overseeing Donald Trump’s 2020 election interference case made public Friday a heavily redacted trove of documents that provide a small glimpse into the evidence prosecutors will present if the case ever goes to trial.\n\nThe nearly 1,900 pages of documents collected by special counsel Jack Smith’s team were initially filed under seal to help U.S. District Judge Tanya Chutkan decide what allegations can proceed to trial following the Supreme Court opinion in July that conferred broad immunity on former presidents for official acts they take in office.\n\nThe information that could be seen in the redacted version released Friday appeared to be material that for the most part had already been made public, including screenshots of Trump’s social media posts about the 2020 election and a transcript of the video statement he made on Jan. 6, 2021, in which he told the rioters attacking the Capitol to go home, but added: “we love you” and “you’re very special.”\n\nThe overwhelming majority of the pages released Friday were whited out. The redacted files are believed to include things like transcripts of grand jury testimony, which remain under wraps because of grand jury secrecy rules.\n\nOther information visible to the public includes passages from former Vice President Mike Pence’s book, excerpts of testimony provided by several witnesses to the House committee that investigated the Jan. 6 riot and a transcript of Trump’s phone call pressuring Georgia election officials to “find” enough votes to reverse his election loss in the state to Democrat Joe Biden.\n\nOther documents include fundraising emails from Trump’s 2020 campaign and Pence’s letter telling Congress on Jan. 6 that he could not claim “unilateral authority to determine which electoral votes should be counted and which should not.”\n\nThe filing was submitted as a series of appendices to a 165-page brief unsealed this month in which prosecutors disclosed new evidence against Trump to support their argument that the former president is not entitled to immunity from prosecution.\n\nTrump’s lawyers objected to the unsealing of the filing so close to next month’s presidential election, but Chutkan on Thursday rejected their bid to postpone the material from becoming public until after the election. She said it would be inappropriate to take the political calendar into account.","summary":"The overwhelming majority of the pages released Friday were whited out. The redacted files are believed to include things like transcripts of grand jury testimony, which remain under wraps because of grand jury secrecy rules.","url":"https://www.twincities.com/2024/10/18/evidence-unsealed-trump-2020-election-interference-case/","image":"https://www.twincities.com/wp-content/uploads/2024/10/Capitol_Riot_Sentencing_14197_fc1190.jpg?w=1024","video":null,"publish_date":"2024-10-18 23:29:42","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.115},{"id":260258024,"title":"Judge unseals heavily redacted trove of evidence in Trump’s 2020 election interference case","text":"By ERIC TUCKER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — The judge overseeing Donald Trump’s 2020 election interference case made public Friday a heavily redacted trove of documents that provide a small glimpse into the evidence prosecutors will present if the case ever goes to trial.\n\nThe nearly 1,900 pages of documents collected by special counsel Jack Smith’s team were initially filed under seal to help U.S. District Judge Tanya Chutkan decide what allegations can proceed to trial following the Supreme Court opinion in July that conferred broad immunity on former presidents for official acts they take in office.\n\nThe information that could be seen in the redacted version released Friday appeared to be material that for the most part had already been made public, including screenshots of Trump’s social media posts about the 2020 election and a transcript of the video statement he made on Jan. 6, 2021, in which he told the rioters attacking the Capitol to go home, but added: “we love you” and “you’re very special.”\n\nThe overwhelming majority of the pages released Friday were whited out. The redacted files are believed to include things like transcripts of grand jury testimony, which remain under wraps because of grand jury secrecy rules.\n\nOther information visible to the public includes passages from former Vice President Mike Pence’s book, excerpts of testimony provided by several witnesses to the House committee that investigated the Jan. 6 riot and a transcript of Trump’s phone call pressuring Georgia election officials to “find” enough votes to reverse his election loss in the state to Democrat Joe Biden.\n\nThe filing was submitted as a series of appendices to a 165-page brief unsealed this month in which prosecutors disclosed new evidence against Trump to support their argument that the former president is not entitled to immunity from prosecution.\n\nTrump’s lawyers objected to the unsealing of the filing so close to next month’s presidential election, but Chutkan on Thursday rejected their bid to postpone the material from becoming public until after the election. She said it would be inappropriate to take the political calendar into account.","summary":"The overwhelming majority of the pages released Friday were whited out. The redacted files are believed to include things like transcripts of grand jury testimony, which remain under wraps because of grand jury secrecy rules.","url":"https://www.sandiegouniontribune.com/2024/10/18/evidence-unsealed-trump-2020-election-interference-case/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/10/Capitol_Riot_Sentencing_14197_fc1190.jpg?w=1024","video":null,"publish_date":"2024-10-18 23:29:42","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.163},{"id":260256236,"title":"Trump needles Nikki Haley but insists former GOP primary rival is ‘helping’ his campaign: ‘Nikki is in’ ","text":"Former President Donald Trump said Friday that he doesn’t understand why Republicans are clamoring for Nikki Haley to join him on the campaign trail when he beat her “badly” in the primaries — while insisting that the former South Carolina governor is already “helping” with his White House run. \n\n“Yeah, I’ll do what I have to do,” Trump told “Fox and Friends” co-host Brian Kilmeade, when asked if he plans on inviting Haley on the campaign trail. \n\n“But let me just tell you — Nikki Haley and I fought, and I beat her by 50, 60, 90 points,” the former president continued. “I beat her in her own state by numbers that nobody’s ever been beaten by. \n\n“I beat Nikki badly,” he emphasized. \n\nTrump, 78, acknowledged that he’s aware “everybody” is calling on him to utilize Haley, 52, in the final weeks of the campaign, but he seemed baffled by it. \n\n“They don’t say, ‘Get Ron [DeSantis],’ and Ron did very well, but again, I beat everybody by numbers that have never happened before,” he said. “And they keep talking about Nikki, Nikki.”\n\nThe former president argued that “even in her own state [South Carolina] …. I beat her by a number that nobody ever [thought was possible].” \n\n“Fifty points or something,” Trump continued, “and then they say, ‘Oh, when is Nikki coming back in?’” \n\nHaley was the first major GOP candidate to challenge Trump in the primaries — entering the race three months after the former president launched his campaign — and the last one standing. \n\nThe former Trump administration official ended her White House bid in early March but she waited until late May to endorse Trump – and she didn’t release her delegates until July, just days before the Republican National Convention. \n\n“I like Nikki,” Trump insisted Friday, before adding, “Nikki, I don’t think should have done what she did, and that’s fine that she did it.”\n\nDespite their bitter campaign, “Nikki is in,” the former president declared. \n\n“Nikki is helping us already,” Trump continued, “She’s out there.” \n\nHaley, who could be used to help court Republicans and independents leaning toward voting for Vice President Kamala Harris, has yet to appear on the campaign trail alongside Trump.","summary":"“I beat Nikki badly,” Trump emphasized. ","url":"https://nypost.com/2024/10/18/us-news/trump-needles-nikki-haley-but-insists-ex-gop-primary-rival-is-helping-campaign/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/91888442.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/NXr5H9Cb-RyIcpnTz.mp4","publish_date":"2024-10-18 23:21:00","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.484},{"id":260256476,"title":"WATCH LIVE: Harris speaks at rally in Oakland County, Michigan","text":"Harris is scheduled to speak at approximately 8:20 p.m. Eastern time. Her remarks come after she previously rallied supporters in Grand Rapids and Lansing.\n\nFormer President Donald Trump made a dueling appearance in Oakland County earlier Friday afternoon, holding a manufacturing roundtable in the Detroit suburb. \n\nHarris’s barnstorming tour marks an effort to win over Michigan voters who have held her at arm’s length. The vice president has struggled to capture key voting blocks in the state, notably seeing growing cracks in support from its large Arab and Muslim populations.","summary":"Vice President Kamala Harris is set to speak to voters in Oakland County, Michigan, for the last of three rallies in the battleground state on Friday. Harris is scheduled to speak at approximately 8:20 p.m. Eastern time. Her remarks come after she previously rallied supporters in Grand Rapids and Lansing. CLICK HERE TO READ MORE FROM THE [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3195310/watch-live-harris-speaks-rally-oakland-county-michigan/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Harris-MI.webp","video":null,"publish_date":"2024-10-18 23:20:00","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","source_country":"US","sentiment":0.132},{"id":260256240,"title":"Kamala Harris’ ‘plan for black men’ is weird, insulting and RACIST","text":"We’re not sure what the Harris-Walz campaign was thinking when it came up with Kamala Harris’ “Opportunity Agenda for Black Men,” but it sure is insulting as well as bizarre.\n\nThe list of policy priorities to help black men “meet their full ambitions” is a weird mix of the blatantly unconstitutional, the irrelevant and the seemingly racist.\n\nShe starts with a promise for a million small-business loans, fully forgivable up to $20,000, for black entrepreneurs “and others who have historically faced barriers to starting a new business” — language that the courts have struck down as unconstitutional racial discrimination.\n\n(In classic Harris-Walz butt-covering, an anonymous campaign aide later told The Wall Street Journal that the program wouldn’t be racially exclusive, which means it wouldn’t be especially pro-black after all — but the campaign’s done nothing official about that shift.)\n\nHarris also promises to legalize marijuana and create “opportunities for Black Americans to succeed in this new industry,” which sure looks like a racist assumption that African-Americans have some special, intrinsic affinity for pot.\n\nOr maybe it’s just a bid to make up for the well-established fact that, as San Francisco DA, Harris convicted black men by the thousands for marijuana-related crimes?\n\nAlso tossed into the “plan” is a vow to “protect cryptocurrency investments so Black men who make them know their money is safe.”\n\nWe have no idea how to make crypto a safe investment, and neither does anyone else: All experience shows crypto values to be insanely erratic, and the risk is inherently tied to the potential for big rewards.\n\nThe fact of the matter is that black men overwhelmingly want what everyone else does: a strong economy that lets them find jobs with a good hope at rising wages, a lasting end to the inflation that’s slammed middle- and working-class Americans, a border that’s under control to protect our communities, etc. etc.\n\nAll issues where Donald Trump is killing Harris in the polls, and ample reason for her support among black men to be markedly down from what Democrats usually see.\n\n“The brothers,” as multimillionaire Barack Obama put it in his lecture demanding they get back in line, look to be thinking for themselves — and it’s hard to see how this pack of nonsense is going to change their minds.","summary":"We're not sure what the Harris-Walz campaign was thinking when it came up with Kamala Harris' “Opportunity Agenda for Black Men,\" but it sure is insulting as well as bizarre.","url":"https://nypost.com/2024/10/18/opinion/kamala-harris-plan-for-black-men-is-weird-insulting-and-racist/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/2024-grand-rapids-michigan-harris-91887522-e1729292798326.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/XYq5RCUN-RyIcpnTz.mp4","publish_date":"2024-10-18 23:19:14","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.132},{"id":260256016,"title":"Trump Can't Stop Talking About How Much He Loves Tariffs","text":"Former President Donald Trump waxed poetic about his love of tariffs again on Friday — including his love for the word itself.Speaking at a roundtable with voters in Auburn Hills, Michigan, the Republican presidential nominee said he thinks \"tariff\" is \"the most beautiful word in the dictionary.\"\"You have other words that are damn nice, like 'love,'\" Trump said, while others in the room laughed. \"But I tell you, I think it's more beautiful than 'love.'\"Trump, who calls himself \"Tariff Man,\" frequently touts his plan to impose steep tariffs on all imports if he's elected president again.He initially proposed a 10 percent tariff on American trading partners but suggested this week that that number could go as high as 50 percent. He also proposed a 60 percent tariff on imports from China. A Newsweek report found that such a proposal could hit his own businesses since his companies manufacture some products, such clothing accessories, in China, Vietnam and Bangladesh.\"If I'm going to be president of this country, I'm going to put a 100, 200, 2,000 percent tariff,\" Trump said while speaking at the Economic Club of Chicago on Tuesday. \"They're not going to sell one car in the United States,\" he added, referring to Mexico.\"Tariffs are the greatest thing ever invented,\" he said last month in Flint, Michigan.Economic analysts and experts aren't so sure that's the case.The Washington Post published a lengthy report this week detailing how, if implemented, Trump's tariff plan could be disastrous for the U.S. economy, with American consumers bearing the brunt of the cost. It could also lead to greater uncertainty in the stock market, and spark conflicts between the U.S. and other countries.\"We are talking about a plan of historic significance,\" Douglas A. Irwin, an economist at Dartmouth College, told The Post. \"It would be enormous, and the blowback would be even more enormous.\"Treasury Secretary Janet Yellen also warned that imposing \"sweeping, un-targeted tariffs\" would be a \"deeply misguided\" move that would negatively affect American businesses and ratchet up inflation.\"We cannot even hope to advance our economic and security interests — such as opposing Russia's illegal invasion of Ukraine — if we go it alone,\" Yellen said, speaking at the Council on Foreign Relations in New York.Vice President Kamala Harris has also ripped Trump's tariff proposal, calling it a \"Trump sales tax.\"But the Democratic nominee has to walk a fine line with the issue to avoid alienating swing-state voters whose support she needs to win the November election. According to a Bloomberg/Morning Consult poll published last month, a majority of likely voters in swing states either strongly or somewhat support a 10 percent tariff on all imports.Trump and Harris both stumped in Michigan on Friday as they seek to consolidate support in battleground states ahead of the election. Harris held a rally in the afternoon and addressed union auto workers after, and she'll head to Detroit for a second rally in the evening. Trump will also hold his own rally in Detroit this evening.","summary":"Former President Donald Trump waxed poetic about his love for tariffs — including his love for the word itself.","url":"https://www.newsweek.com/trump-cant-stop-talking-about-tariffs-michigan-roundtable-1971565","image":"https://d.newsweek.com/en/full/2499310/trump-michigan-roundtable.jpg","video":null,"publish_date":"2024-10-18 23:18:53","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","source_country":"US","sentiment":0.154},{"id":260256550,"title":"What we learned from newly unsealed evidence in Trump election case","text":"What we learned from newly unsealed evidence in Trump election case\n A judge on Friday unsealed more than 1,800 pages of documents in the federal 2020 election interference case against former President Donald Trump. Much of the unsealed documents, including interview transcripts and court hearings, remain heavily redacted. CBS News congressional correspondent Scott MacFarlane has the details.","summary":"A judge on Friday unsealed more than 1,800 pages of documents in the federal 2020 election interference case against former President Donald Trump. Much of the unsealed documents, including interview transcripts and court hearings, remain heavily redacted. CBS News congressional correspondent Scott MacFarlane has the details.","url":"https://www.cbsnews.com/video/newly-unsealed-evidence-trump-election-case-what-we-learned/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/18/3d25e238-5126-40b7-a68a-90e05ec56556/thumbnail/1200x630/6a422d19c9cb296faf6798d475e3e255/cbsn-fusion-newly-unsealed-evidence-trump-election-case-what-we-learned-thumbnail.jpg?v=edba3a63b5392b4c81ae19d89","video":null,"publish_date":"2024-10-18 23:17:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.227},{"id":260257604,"title":"Trump Says He Would Impose Tariffs On China If It Went Into Taiwan","text":"Republican presidential candidate Donald Trump told the Wall Street Journal that he would impose additional tariffs on China if China were to \"go into Taiwan.\"\"I would say: If you go into Taiwan, I'm sorry to do this, I'm going to tax you, at 150% to 200%,\" Trump was quoted as saying in the WSJ interview published on Friday evening.Trump, asked if he would use military force against a blockade on Taiwan by China, said it would not come to that because Chinese President Xi Jinping respected him.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Republican presidential candidate Donald Trump told the Wall Street Journal that he would impose additional tariffs on China if China were to \"go into Taiwan.\"","url":"https://www.ndtv.com/world-news/trump-says-he-would-impose-tariffs-on-china-if-it-went-into-taiwan-6822358","image":"https://c.ndtvimg.com/2024-10/f41du9is_donald-trump-afp_625x300_18_October_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-10-18 23:15:09","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.603},{"id":260256366,"title":"EU đồng thuận ban hành luật mới để đẩy nhanh trục xuất người nhập cư trái phép","text":"Ông Trump công bố 'chiến dịch Aurora' chống người nhập cư\n\n Cựu Tổng thống Mỹ Donald Trump ngày 11.10 tiếp tục có những tuyên bố cứng rắn về cam kết chống lại người nhập cư nếu đắc cử.\n\nLà người phản đối làn sóng nhập cư trái phép, ông Trump coi việc người di cư ồ ạt đến Mỹ như một cuộc \"xâm lược\". Trong bài phát biểu tại thành phố Aurora, bang Colorado, ông Trump thông báo về \"chiến dịch Aurora\" nhằm chống lại người nhập cư, The Guardian đưa tin ngày 11.10.\n\n Cựu Tổng thống Mỹ Donald Trump vận động tại thành phố Aurora, Colorado ngày 11.10. ẢNH: REUTERS\n\n\"Ngay sau khi nhậm chức, chúng tôi sẽ có chiến dịch Aurora ở cấp liên bang nhằm đẩy nhanh việc loại bỏ người nhập cư\", ông nói, nhấn mạnh điều này sẽ bao gồm sử dụng đạo luật kẻ thù nước ngoài năm 1798. Đạo luật này cho phép bắt giữ và trục xuất người không phải công dân Mỹ trong thời chiến, hoặc nếu tổng thống đương nhiệm tuyên bố đất nước đang xảy ra cuộc \"xâm lược\".\n\n\"Tôi kêu gọi áp dụng án t.ử hìn.h đối với bất kỳ người di cư nào giế.t chế.t công dân Mỹ hoặc nhân viên thực thi pháp luật\", ông Trump nói. Cựu tổng thống còn tuyên bố sẽ đề xuất dự luật cấm tất cả \"thành phố trú ẩn\" - thuật ngữ chỉ những khu vực có chính sách bảo vệ người nhập cư không giấy tờ.\n\nĐiện Kremlin xác nhận ông Trump từng gửi thiết bị xét nghiệm Covid-19 cho Nga\n\nĐộng thái trên đã bổ sung vào lập trường cứng rắn của ứng viên tổng thống đảng Cộng hòa về vấn đề nhập cư trong kỳ bầu cử năm nay. Ông Trump gần đây từng mô tả người nhập cư bị tình nghi trong các vụ giế.t ngườ.i \"mang gien xấu\". Ông nhiều lần tuyên bố sẽ thực hiện cuộc trục xuất lớn nhất trong lịch sử Mỹ nếu quay lại Nhà Trắng.\n\nCũng trong ngày 11.10, Phó tổng thống Kamala Harris có sự kiện vận động tại thành phố Scottsdale, bang Arizona. Viết trên mạng xã hội X, bà Harris nhấn mạnh sẽ sửa hệ thống nhập cư đang gặp vấn đề nếu tái đắc cử. \"Điều này bao gồm bảo vệ biên giới và đưa ra phương án nhân đạo để những người chăm chỉ có thể nhận quốc tịch. Tôi bác bỏ ý tưởng sai lệch rằng chúng ta không thể làm cả hai việc trên\", bà nói.","summary":"Việc đẩy nhanh quá trình trục xuất được kỳ vọng sẽ giúp các quốc gia thành viên kiểm soát tốt hơn dòng người nhập cư và giảm áp lực lên hệ thống phúc lợi xã hội.","url":"https://vietgiaitri.com/eu-dong-thuan-ban-hanh-luat-moi-de-day-nhanh-truc-xuat-nguoi-nhap-cu-trai-phep-20241019i7295846/","image":"https://t.vietgiaitri.com/2024/10/7/eu-dong-thuan-ban-hanh-luat-moi-de-day-nhanh-truc-xuat-nguoi-nhap-cu-trai-phep-600x432-2c8-7295846.webp","video":null,"publish_date":"2024-10-18 23:13:26","author":"Hương Giang - Vũ Hiệp","authors":["Hương Giang - Vũ Hiệp"],"language":"en","source_country":"vn","sentiment":-0.04},{"id":260256206,"title":"Biden urges European leaders to 'sustain our resolve' in support for Ukraine as Trump blames Zelenskyy for starting war","text":"US President Joe Biden urges the West to sustain its support for Ukraine in its fight against Russia, while Donald Trump blamed Ukrainian President Volodymyr Zelenskyy for having started the war. \n\nMr Biden was speaking to reporters in Berlin where he is speaking with ally German Chancellor Olaf Scholz about several matters including the Ukraine war. \n\n\"As Ukraine faces a tough winter, we must, we must sustain our resolve,\" Mr Biden said.\n\n\"And I know the cost is heavy, but make no mistake, it bears in comparison to the cost of living in a world where aggression prevails, where large states attack and bully smaller ones simply because they can.\"\n\nHe said he would talk to Mr Scholz about increasing military support for Ukraine and shoring up its civilian energy infrastructure \"by unlocking the value of frozen Russian assets\".\n\nThe pair were joined by British Prime Minister Keir Starmer and French President Emmanuel Macron.\n\n\"We discussed how to speed up our support for Ukraine\" Mr Starmer told reporters afterwards. \n\nBefore leaving Germany, Mr Biden added there was no consensus for giving Ukraine long-range weapons.\n\nMr Zelenskyy has been requesting the weapons from Western nations for months to conduct deeper strikes into Russia.\n\n\"Right now, there's no consensus for long-range weapons,\" Mr Biden said. \n\nTrump blames Zelenskyy for war's start \n\nMeanwhile, Republican nominee Donald Trump has said Mr Zelenskyy was to blame for starting the war, a comment which further suggests he is likely to decrease US support for Ukraine if he wins the November 5 election.\n\nThe former president has frequently criticised Zelenskyy on the campaign trail, repeatedly calling him \"the greatest salesman on Earth\" for having solicited and received billions of dollars of US military aid since Russia's full-scale invasion of its neighbour in 2022.\n\nHowever, Mr Zelenskyy was not elected until April 2019, more than five years after Russia seized Crimea in its initial 2014 invasion, while its proxy forces took over a large part of eastern Ukraine's Donbas region.\n\nMr Trump also suggested Ukraine may have to cede some of its land to Russia to make a peace deal, a concession Kyiv considers unacceptable.\n\nHis comments, on the PBD Podcast, went a step further than his previous criticism.\n\nMr Zelenskyy had presented his \"victory plan\" to end the war to Mr Trump during a meeting in New York in September, an encounter both leaders described as cordial.\n\nMr Trump's public comments, however, suggest he could seek to wind down aid for Ukraine if he defeats Vice-President Kamala Harris in the November election. \n\nHe has repeatedly said he could end the conflict before he takes office in January, but he has not said how.\n\nConversely, Ms Harris has pledged to continue supporting Ukraine, and she has portrayed a victory for the eastern European nation as a vital US national security interest. \n\nShe has frequently rebuked Mr Trump for being unwilling to stand up to Russian President Vladimir Putin.\n\nMr Trump was impeached in 2019 by the House of Representatives — and later acquitted by the Senate — for abuse of power stemming from his efforts to pressure Ukraine to investigate Joe Biden.","summary":"US President Joe Biden urges the West to increase its military support for Ukraine in its fight against Russia as it faces a bleak winter. ","url":"https://www.abc.net.au/news/2024-10-19/joe-biden-urges-support-for-ukraine-trump-blames-zelenskyy/104492692","image":"https://live-production.wcms.abc-cdn.net.au/ef89771a0f71e7338d3ee6c233766f4b?impolicy=wcms_crop_resize&cropH=1880&cropW=3342&xPos=0&yPos=174&width=862&height=485","video":null,"publish_date":"2024-10-18 23:12:39","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":0.159},{"id":260255322,"title":"Millions of Cubans lose power after national grid fails","text":"HAVANA, (Reuters) – Cuba plunged into a countrywide blackout today after one of the island’s major power plants failed and caused the national electrical grid to shut down, its energy ministry said.\n\nThe Communist-run government had already closed schools and non-essential industry and sent most state workers home in a last-ditch effort to keep the lights on during severe power shortages.\n\nBut shortly before midday, the Antonio Guiteras power plant, the country’s largest and most efficient, went offline, prompting a total grid failure and leaving approximately 10 million people without power.\n\nOfficials did not say what had caused the plant to fail.\n\n“There will be no rest until (power) is restored,” Cuban President Miguel Diaz-Canel said on X.\n\nThe blackout marks a new low point on an island where life has become increasingly unbearable, with residents already suffering from shortages of food, fuel, water and medicine.\n\nThe electricity shortages had already prompted officials to cancel all non-vital government services on Friday. Schools, including universities, were shuttered through Sunday. Recreational and cultural activities, including night clubs, were also ordered closed.\n\nOfficials said in mid-afternoon they had begun taking steps to restore power but that the process would take time.\n\nVirtually all commerce in the capital Havana ground to a halt on Friday. Many residents sat sweating on doorsteps. Tourists hunkered down in frustration.\n\n“We went to a restaurant and they had no food because there was no power, now we are also without internet,” said Brazilian tourist Carlos Roberto Julio, who had recently arrived in Havana. “In two days, we have already had several problems.”\n\nPrime Minister Manuel Marrero late on Thursday blamed worsening blackouts during the past several weeks on a perfect storm well-known to most Cubans – deteriorating infrastructure, fuel shortages and rising demand.\n\n“The fuel shortage is the biggest factor,” Marrero said in a televised message to the nation.\n\nStrong winds that began with Hurricane Milton last week has crippled the island’s ability to deliver scarce fuel from boats offshore to its power plants, officials said.\n\nCuba’s government also blames the U.S. trade embargo, as well as new sanctions under former President Donald Trump, for difficulties in acquiring fuel and spare parts to operate its oil-fired plants.\n\n“The complex scenario is caused primarily by the intensification of the economic war and financial and energy persecution of the United States,” Diaz-Canel said on X on Thursday.\n\n“The United States is not to blame for today’s blackout on the island, or the overall energy situation in Cuba,” a spokesperson for the White House National Security Council said.\n\nREDUCED FUEL\n\nWhile demand for electricity has grown alongside Cuba’s private sector, fuel supply has evaporated.\n\nCuba’s largest oil supplier, Venezuela, has reduced shipments to the island to an average of 32,600 barrels per day in the first nine months of the year, about half of the 60,000 bpd sent in the same period of 2023, according to vessel-monitoring data and internal shipping documents from Venezuela’s state company PDVSA.\n\nPDVSA, whose refining infrastructure is also ailing, has this year tried to avoid a new wave of fuel scarcity at home, leaving smaller volumes available for export to allied countries like Cuba.\n\nRussia and Mexico, which in the past have sent fuel to Cuba, have also greatly reduced shipments to the island.\n\nThe shortfalls have left Cuba to fend for itself on the far costlier spot market at a time when its government is near-bankrupt.","summary":"HAVANA,&#xA0; (Reuters) &#8211; Cuba plunged into a countrywide blackout today after one of the island&#8217;s major power plants failed and caused the national electrical grid to shut down, its energy ministry said.\n\n\nThe article Millions of Cubans lose power after national grid fails appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2024/10/18/news/regional/millions-of-cubans-lose-power-after-national-grid-fails/","image":"https://s1.stabroeknews.com/images/2019/06/sn-article-default.png","video":null,"publish_date":"2024-10-18 23:07:59","author":"Staff Editor","authors":["Staff Editor"],"language":"en","source_country":"gy","sentiment":-0.289},{"id":260257846,"title":"\"You shouldn't play negative ads\": Trump brags about plan to beg Murdoch for interference","text":"Former President Donald Trump told the hosts of “Fox and Friends” that he planned to beg their boss for help in defeating Kamala Harris.\n\nIn a Friday morning sit-down with the talk show, Trump said he was on his way to a “very big event,” a meeting with the News Corp owner to make an important ask. \n\n“I don’t know if he’s thrilled that I say it. And I’m going to tell him, I’m gonna tell him something very simple because I can’t talk to anybody else about it: Don’t put on negative commercials for 21 days,” Trump said, as hosts awkwardly laughed off the demand.\n\nEarlier in the segment, Trump reminisced about a golden age, noting that “in the old days, you [Fox] never played negative ads.”\n\n“For 19 days, I don’t think we should do that anymore. I think you shouldn’t play negative ads,” Trump told the “Fox and Friends” hosts.\n\nThe campaign ad axing wasn’t the only demand Trump planned to bring to Murdoch. He also vented about Democratic on-air talent and Harris campaign surrogates taking up the airwaves that should be reserved for his sycophants.\n\n“Don’t put on their horrible people—they come and lie. I’m going to say, ‘Rupert, please do it this way,’” Trump said.\n\nThe demands comes as Harris outspends Trump on ads in key swing states, driven by a massive fundraising advantage. The Harris campaign has drawn in a billion dollars since she joined the ticket.\n\nFox News recently aired a primetime interview with Vice President Harris, drawing the network’s largest ratings in months and angering Trump. Ahead of the interview, he said Fox News had “lost its way.”","summary":"The ex-president admitted the News Corp boss might not be \"thrilled\" about his publicizing their upcoming meeting","url":"https://www.salon.com/2024/10/18/you-shouldnt-play-negative-ads-brags-about-plan-to-beg-murdoch-for-interference/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2020/07/donald-trump-fox-news-0729201.jpg ?>","video":null,"publish_date":"2024-10-18 23:06:42","author":"Griffin Eckstein","authors":["Griffin Eckstein"],"language":"en","category":"politics","source_country":"us","sentiment":-0.236},{"id":260255406,"title":"Newsom sides with Elon Musk’s SpaceX lawsuit in surprising break with California agency","text":"“I’m with Elon. I didn’t like that. Look, I’m not helping the legal case. You just can’t bring up that explicit level of politics,” Newsom said during an interview Thursday evening, later adding he wished “his friends” on the state commission would exercise more impartiality by “calling balls and strikes.”\n\nNewsom’s statement came after Musk mounted a lawsuit against the state regulator, alleging “naked political discrimination” fueled the commission’s move to pour cold water on his SpaceX plans. \n\nThe California Coastal Commission voted on Tuesday to reject the Department of Defense and Musk’s proposal to increase the number of rockets launched off California’s coastline. The Space Force, which partners with SpaceX to transport some NASA astronauts, had previously recommended that Musk’s company be given permission to launch up to 50 rockets a year from Santa Barbara County’s Vandenberg Air Force Base. \n\nThe California Coastal Commission’s 6-4 vote rejecting the proposal cited Musk’s politics as its basis to stop SpaceX from increasing rocket launches. \n\n“Elon Musk is hopping about the country, spewing and tweeting political falsehoods and attacking FEMA while claiming his desire to help the hurricane victims with free Starlink access to the internet,” one of the agency’s commissioners, Gretchen Newsom (no relation to Gavin Newsom) claimed. \n\nThough the Democratic governor has publicly sparred with Musk in recent years, even prominently leading the Big Tech titan to pull his SpaceX and X headquarters out of California, Newsom expressed concerns that the California agency had displayed political bias and urged it to exercise impartiality.\n\n“These are friends of mine that said that. These are good commissioners. But you got to call balls and strikes. And trust me, I’m not big on the Elon Musk bandwagon right now. So that’s me calling balls and strikes,” he said. \n\nNewsom and Musk are still at opposite ends of the political spectrum. The California governor targeted Musk during his interview on Thursday, claiming his move to support former President Donald Trump calls his “character” into question.\n\nThe SpaceX founder has become one of Trump’s most powerful supporters in recent months, while Newsom has campaigned for Vice President Kamala Harris, his one-time Californian colleague.","summary":"Gov. Gavin Newsom (D-CA) expressed uncommon support for Elon Musk after the California Coastal Commission blocked the latter&#8217;s efforts to increase SpaceX launches at the state’s Vandenberg Space Force Base.  “I’m with Elon. I didn’t like that. Look, I’m not helping the legal case. You just can’t bring up that explicit level of politics,&#8221; Newsom [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3195595/newsom-sides-with-elon-musks-spacex-lawsuit-california-agency/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/SpaceX-1.webp","video":null,"publish_date":"2024-10-18 23:01:32","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","source_country":"US","sentiment":0.083},{"id":260255224,"title":"Letters: Stebbins for judge | Prop. 33 | Prop. 5 | Artificial turf | Trump and Musk | Affirmation vs. punishment","text":"Stebbins is the right\nchoice for judgeship\n\nSanta Clara County voters have the rare opportunity to fill a vacant seat on the Superior Court and Johnene Linda Stebbins is the highly qualified, experienced candidate to fill this seat.\n\nJohnene is the only candidate endorsed by Judge Vincent Chiarello to replace him for Superior Court judge . \n\nAs a Santa Clara County deputy district attorney for 26 years, Johnene prosecuted a wide range of criminal, consumer protection and environmental cases, and taught law to organizations and groups in the legal community. She is a women’s rights advocate who engages with the community on both professional and personal levels.\n\nJohnene Stebbins is the right choice for Superior Court judge.\n\nRebecca Elliot\n\nVote yes for rent\ncontrol with Prop. 33\n\nCalifornia is long overdue for comprehensive rent control. Your paper’s opposition to rent control is simply advocating for policies that take from the poor and give to the rich.\n\nThe rent control exemptions on new construction have allowed developers to tear down rent-controlled apartments, build new apartments with no rent control and displace existing residents.\n\nThe exemption on single-family homes has helped fuel an investor monopolization of home ownership.\n\nCalifornia’s high rents are not due to a lack of housing. They are due to corporate greed. A lot of people have been pushed into homelessness by rents that have doubled and tripled in just a couple of years. The same developers we’re told won’t build unless we give them every conceivable concession aren’t going to give anyone affordability out of the goodness of their hearts.\n\nVote yes for people and no for corporate greed. Yes on 33.\n\nSteve Van De Pitte\n\nProp. 5 will return\npower to communities\n\nAs affordable housing leaders in Santa Clara County and beyond, we are acutely aware of California’s massive housing shortage. Too many low- and middle-income neighbors struggle to afford, find and keep a roof over their heads.\n\nProposition 5 provides a crucial solution by returning the power to local communities, allowing us to create more affordable housing and ensuring that our public infrastructure keeps up with growth.\n\nProposition 5 is not just about building affordable housing; it also supports critical public infrastructure, such as transportation, parks and schools, that make neighborhoods thrive. Housing does not exist in isolation. Safe, livable communities require investment in infrastructure that connects people to jobs, education and services.\n\nLet’s seize this opportunity to change the future of our communities. We urge you to vote yes on Proposition 5 this November to create a stronger, more equitable California.\n\nRegina Celestin Williams\nand Noni Ramos\n\nArtificial turf is wrong\nchoice for environment\n\nRe: “Sides lining up to protect their turf” (Page A1, Oct. 15).\n\nThe Oct. 15 article on artificial turf overlooks critical concerns. While the Synthetic Turf Council, a “nonprofit that advocates for the turf industry,” claims synthetic fields save water, they often require thousands of gallons to cool down — an effort that lasts only 20 minutes. \n\nAddressing field shortages, the article fails to mention that artificial turf fields become dangerously hot. With temperatures reaching 50-70 degrees hotter than natural grass, extreme heat poses serious risks to athletes. Increasing reports from across the country highlight athletes suffering from heat exhaustion, and even death, on these fields.\n\nIn addition, artificial turf is difficult to dispose of, hard to recycle, and sits in landfills for hundreds of years. Sustainable solutions, like improving natural grass fields, need to be prioritized for our health and the environment.\n\nCheryl Weiden\n\nA vote for Trump\nis a vote for Musk\n\nWe see the once mighty Intel faltering, having lost its former mojo. It has gotten so bad that talk abounds of its susceptibility to takeover efforts by various rivals.\n\nSimilarly, Donald Trump has become confused, weak and sunk to dancing to golden oldies.\n\nThe danger is that he too, being weak, is subject to takeover by a stronger entity. Today that entity is Elon Musk. He has donated tens of millions to the Trump campaign and will have a strong hand over Trump and thus, over our nation’s resources (financial and military) if Trump is elected.\n\nIf you want to hand the car keys to a driven, narcissistic billionaire then a vote for Trump is really a vote for President Musk. Do you want that?\n\nMountain View\n\nAffirmation separates\nDemocrats, Republicans\n\nI notice a striking and important difference between the Republicans and Democrats.\n\nThe Republicans are all about punishment, of individuals and groups; the Democrats are about working together to find solutions to important problems.\n\nPunishment vs. affirmation is a telling difference in mindset.","summary":"Mercury News Letters to the Editor for Oct. 20, 2024","url":"https://www.mercurynews.com/2024/10/18/letters-1907/","image":"https://www.mercurynews.com/wp-content/uploads/2019/07/SJM-L-EB5SUIT-0702.jpg?w=1024","video":null,"publish_date":"2024-10-18 23:00:59","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.052},{"id":260255706,"title":"Ex-Republican operative says Harris will win in November ‘maybe easily’","text":"A former adviser to George W Bush and John McCain believes Vice President Kamala Harris will nab the presidential election “maybe easily.”\n\nWriting in a Vanity Fair op-ed released on Friday, Mark McKinnon, a former chief media adviser to George W Bush and John McCain, said: “I’m going to make a bold prediction here because I just don’t give a s*** if I’m wrong, even if this lives on the internet forever. \n\n“Kamala Harris is going to win.”\n\nHe attributed his theory to the level of enthusiasm among Harris’s supporters. Harris’s campaign got an eight-point lead in August when it came to voter enthusiasm after she announced Democratic Minnesota Governor Tim Walz as her running mate.\n\nAccording to Gallup, the party with the highest net-enthusiasm score at the end of a presidential campaign is likely to see their candidate in office. \n\n“Trump voters may be committed, but Harris voters are excited and enthusiastic,” he added.\n\nHe added that Republican presidential contender Donald Trump doesn’t seem up to the task.\n\n“Some days he makes it seem like the 25 in Project 2025 is a secret plan to execute the 25th Amendment if he actually gets elected, paving the way for—Lord help us—President JD Vance.” Some scholars claim the vice president and cabinet members can attempt to remove the president from office invoking Section 4 of the amendment if a disability is declared in the president. \n\nMcKinnon also said women are expected to come out in droves to elect Harris, particularly after the lasting impacts of the US Supreme Court’s decision to repeal a woman’s constitutional right to an abortion. \n\n“They are going to crawl over broken glass to break the glass ceiling,” he continued.","summary":"‘Trump voters may be committed, but Harris voters are excited and enthusiastic,’ wrote Mark McKinnon","url":"https://www.independent.co.uk/news/world/americas/us-politics/mark-mckinnon-kamala-harris-donald-trump-b2631923.html","image":"https://static.independent.co.uk/2024/10/18/14/Election_2024_Harris_22898.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/26tVB801-kPrKkZNL.mp4","publish_date":"2024-10-18 23:00:26","author":"Michelle Del Rey","authors":["Michelle Del Rey"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.485},{"id":260258430,"title":"Trump and other GOP goons can't stop stomping all over free speech","text":"When will the GOP learn that the media doesn’t exist to promote their draconian agenda—or any politician's agenda for that matter?\n\nA federal judge struck down Florida Gov. Ron DeSantis and Surgeon General Joseph Ladapo on Thursday for trying to block local TV stations from running ads for abortion rights. \n\nLadapo and DeSantis have been threatening stations with cease and desist letters for airing ads in favor of ballot measure Amendment 4, Floridians Protecting Freedom, which would broaden access to abortion rights. This is in response to the Sunshine State implementing a strict 6-week abortion ban after Roe v. Wade was overturned by the Supreme Court. \n\n“To keep it simple for the State of Florida, it’s the First Amendment, stupid,” U.S. District Judge Mark Walker wrote in his ruling.\n\nMeanwhile, you have creeps like Christian anti-abortion activist Randall Terry exploiting the First Amendment. Terry, who is on the presidential ballot in 12 states, paid for a gruesome political ad that the network was required to run under federal law. ABC issued a content warning for viewers before airing the ad during a live episode of “The View.” Terry’s political anti-abortion ad displayed graphic images of bloodied, dead fetuses and compared journalists to Nazis. \n\nAnd in his echo chamber—ahem—social media site, Truth Social, former President Donald Trump has been threatening all the networks, calling for CBS’ broadcast license to be revoked because Vice President Kamala Harris keeps making him look bad with facts. Earlier in the campaign cycle, he did the same thing to ABC and NBC/MSNBC. \n\nOn Thursday, Trump continued flailing, posting screenshots of a post on X and a link to the Fox News article that bolstered his theory of CBS’ “significant and intentional news distortion” made by a conservative law firm, the Center for American Rights, over Harris’ “Face the Nation” and “60 Minutes” appearances.\n\nThere is a pattern here—when networks do not bow to Trump’s falsehoods and tantrums, like a petulant toddler, he uses the only thing he knows—money—to try to litigate others into oblivion. Except, the law and the Constitution are on the side of the First Amendment. \n\nTrump tried it again on Friday morning. On “Fox & Friends,” Trump said after his appearance on the show, that he had another “big event” with right-wing media tycoon and Fox News network founder Rupert Murdoch. He said they would discuss keeping negative ads about Trump off of Fox’s airways in the lead-up to Election Day. \n\n“I’m going to tell him something very simple because I can’t talk to anybody else, but don’t put on negative commercials for 21 days,” he said. “Don’t put on the air. There are horrible people that come on and lie. I’m gonna say, Rupert, please do it this way, and then we’re gonna have a victory.”\n\nAnd then, naturally, there’s his recent comments from last Sunday with Fox News’ Maria Bartiromo, where he said he’d use the “National Guard” on “the enemy from within.” Despite many Republicans trying to defend and explain his comments, it’s pretty hard to justify a U.S. president wanting to use the military against political opponents. \n\nAnd let’s not forget his strange, opaque remarks earlier this month, when he suggested he’d punish the New York Times. \n\n“The New York Times is one of the most dishonest of all,” Trump said to right-wing podcaster Ben Shapiro. “I watched this New York Times, and it’s a classic. Wait until you see what I’m going to do with them. You’re going to have so much fun.”\n\nThe ultraconservative second Trump administration blueprint, Project 2025, created by 140 of Trump’s allies and colleagues, details plans to defund PBS, NPR, and any other public broadcasting.\n\nTrump’s ongoing threats to media networks and calls by those like DeSantis to cease and desist what they don’t like and revoke licenses, only reiterate the GOP’s broader strategy of controlling narratives and silencing any voice that does not placate their lies.","summary":"When will the GOP learn that the media doesn’t exist to promote their draconian agenda—or any politician's agenda for that matter?\n\n\n\nA federal judge struck down Florida Gov. Ron DeSantis and Surgeon General Joseph Ladapo on Thursday for trying to block local TV stations from running ads for abortion rights. \n\n\n\nLadapo and DeSantis have been threatening stations with cease and desist letters for airing ads in favor of ballot measure Amendment 4, Floridians Protecting Freedom, which would broaden access to abortion rights. This is in response to the Sunshine State implementing a strict 6-week abortion ban after Roe v. Wade was overturned by the Supreme Court. \n\n\n\n“To keep it simple for the State of Florida, it’s the First Amendment, stupid,” U.S. District Judge Mark Walker wrote in his ruling.","url":"https://www.dailykos.com/story/2024/10/18/2277721/-Trump-and-other-GOP-goons-can-t-stop-stomping-all-over-free-speech?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1357251/story_image/AP24287802363095.jpg?1729282829","video":null,"publish_date":"2024-10-18 23:00:10","author":"Morgan Stephens","authors":["Morgan Stephens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.395},{"id":260257000,"title":"OSV News Showcase | October 18, 2024","text":"Autumn weather is starting to settle in here in the Kansas City metro area, and in my household it’s time to break out the fire pit, sweaters, hot drinks and casserole recipes. We’re celebrating some birthdays this weekend, and it looks to be a delightfully cozy time — I hope you have an excellent weekend yourself.\n\nBelow are some highlights from the news we covered this week:\n\n— Tomorrow marks 40 years since the murder of Blessed Jerzy Popieluszko, the chaplain of Poland’s Solidarity union — the first independent trade union in the Soviet bloc — who was brutally murdered by officers of communist Poland’s security service. Earlier this week we had a story on him, interviewing his biographer, a childhood friend and others about his life story and the continued impact of his witness. It’s an interesting read for this weekend.\n\n— Looking ahead, the U.S. Conference of Catholic Bishops are gathering in Baltimore Nov. 11-14 for their 2024 fall plenary assembly — we’ll be covering that when the time comes, but in the meantime here are some possible items on their agenda (including some sainthood causes to keep an eye on.)\n\n— Also, pilgrimage organizers are seeking eight young adults to spend six weeks next summer traveling with the Eucharist from Indiana to California as perpetual pilgrims in the United States’ second National Eucharistic Pilgrimage. Applications are due Nov. 1. \n\n— Also in Eucharistic news, California-based Napa Institute and the Hallow prayer app collaborated on an event earlier this week that featured a spectacular Eucharistic procession through Midtown Manhattan in New York City — photos and a story can be found here.\n\nWith those last two news items, maybe I’ll attempt a bit of late-night adoration after the kids are asleep tonight. Hope you have a blessed weekend! \n\nMegan Marley\n\nDigital Editor\n\nP.S.: Enjoy reading this roundup? Find more OSV News stories at osvnews.com and @OSVNews on social media, and sign up to receive our emails here.\n\nMen grieve ‘shared suffering’ miscarriage differently than women, but can be overlooked\n\nWhile the past decade has seen a growth in miscarriage ministries, especially online, most are geared toward women. However, how miscarriage affects fathers and how that affects their relationships is an often overlooked aspect of this ministry’s developing landscape, several experts told OSV News. (October is Pregnancy and Infant Loss Awareness Month.)\n\nBritish court convicts army veteran for silent prayer in front of abortion clinic\n\nA court has convicted a British army veteran of violating a “buffer zone” around an abortion clinic after he prayed silently within the boundary. The Oct. 16 judgment of the Bournemouth, Christchurch & Poole Council, or court, on England’s south coast, represents the first time anyone has been convicted for praying silently outside an abortion facility in the U.K. \n\nLA Archdiocese to settle more than 1,300 historic abuse claims in new agreement\n\nThe Archdiocese of Los Angeles has reached an agreement in principle worth $880 million to compensate more than a thousand decades-old claims of childhood sexual abuse. Announced Oct. 16 in a joint statement from archdiocesan counsel and a committee of plaintiffs’ lawyers, the global settlement caps a yearlong mediation process that followed California’s three-year revival of civil claims of past sexual abuse involving minors. \n\nCardinal Ryś: The church of ‘we’ saves the community from ‘clerical narcissism’\n\nSYNOD: “There is no mission without a road” that is walked together, Cardinal Grzegorz Ryś of Lódź said. Otherwise, it’s “some drifting in place, some circling around.” \n\nPolls show tight contest in final stretch of presidential campaign season\n\nU.S. POLITICS: Polls show a tight contest between former President Donald Trump and Vice President Kamala Harris in the final stretch of the 2024 campaign season.\n\nHigh court hears ‘sham marriage’ immigration case raising risks for foreign-born spouse visas\n\nU.S. Supreme Court justices appeared skeptical during Oct. 15 oral arguments of a challenge from American citizens about their spouses’ revoked visa after authorities found the spouse had previously engaged in a “sham marriage” for the purpose of immigration. J. Kevin Appleby, senior fellow for policy at the Center for Migration Studies of New York and the former director of migration policy for the U.S. Conference of Catholic Bishops, told OSV News that the immigration law involved is meant to protect valid unions, but attempting to subvert it through fraudulent marriage plays into the hands of those seeking to abolish citizenship for foreign-born spouses.\n\nIn November, two Sundays are devoted to prayer for persecuted Christians around world\n\nA number of organizations are inviting faithful to pray for persecuted Christians throughout the month of November, as more than 365 million believers in Christ worldwide suffer high levels of persecution and discrimination, according to a 2024 report by the advocacy group Open Doors.\n\nINTERNET: “Russia blocks Catholic, other religious websites amid war in Ukraine“\n\nAt home or abroad, mission work involves ‘radical transformation’ in Christ, says US missions expert\n\nAhead of World Mission Sunday — which the Catholic Church celebrates on the second to last Sunday in October, and which in 2024 falls on Oct. 20 — OSV News spoke with Kevin Foy, executive director of the United States Catholic Mission Association, on current perspectives and trends in mission work. \n\n‘We must bring children up to the spotlight’: Praying and Learning con la Familia, a timely initiative in children’s ministry\n\nAs the U.S. Catholic Church is increasingly focusing on specialized ministerial formation to prepare leaders for various ministries, programs such as “Praying and Learning con la Familia,” developed by the Mexican American Catholic College in San Antonio, aim to highlight the unique needs of children’s spiritual growth, separate from youth ministry. \n\nDioceses navigate tensions, opportunities with Catholic homeschooling families\n\n“Catholic homeschooling is one of the methods that empowers parents to engage in their children’s education while incorporating the teachings of the church into daily life,” said Bishop Alfred A. Schlert of the Diocese of Allentown, adding that parents “dedicating time and effort to educate their children on the truths of the faith … can work alongside the church to guide youth in discovering their God-given vocations — whether that be in holy marriage, the priesthood, or religious life.”EDUCATION: “Church leaders speak up after French school supervising body fires principal of Catholic school“","summary":"Autumn weather is starting to settle in here in the Kansas City metro area, and in my household it&#8217;s time to break out the fire pit, sweaters, hot drinks and casserole recipes. We&#8217;re celebrating some birthdays this weekend, and it looks to be a delightfully cozy time &#8212; I hope you have an excellent weekend [&#8230;]\n\n\nThe post OSV News Showcase | October 18, 2024 first appeared on OSV News.","url":"https://www.osvnews.com/2024/10/18/osv-news-showcase-october-18-2024/","image":"https://www.osvnews.com/wp-content/uploads/2024/10/20241016T1240-NYC-EUCHARISTIC-PROCESSION-1783653-1024x576.jpg","video":null,"publish_date":"2024-10-18 23:00:00","author":"Karla Fierro,Megan Marley","authors":["Karla Fierro","Megan Marley"],"language":"en","category":"politics","source_country":"us","sentiment":0.236},{"id":260254798,"title":"Nate Silver Explains Why He Feels Trump Is 'Way Too Old' for Presidency","text":"Former President Donald Trump, the GOP presidential nominee, is \"way too old\" to assume the presidency for a second time \"given the demands of the job,\" pollster Nate Silver wrote Friday.In a post to his Silver Bulletin blog, Silver wrote on Friday that while media attention on the candidates' ages has dropped since President Joe Biden, 81, stepped out of the 2024 race in late July, similar pressure should be focused on Trump, who turned 78 in June. If he wins in November, Trump would be the oldest president in U.S. history to be elected, surpassing Biden's age on Inauguration Day in January 2021 by a couple of months.\"Trump is 78 and is seeking the presidency until he's 82,\" Silver wrote. \"That's way too old, given the demands of the job. Considering the long history of old presidents seeking to hold onto power when they were clearly diminished...we should probably just have a Constitutional amendment that says a president can't be older than 75 on Inauguration Day.\"After a rough debate performance in June against Trump, Biden, who turns 82 in November, faced pressure from within his own party to step aside as the Democratic nominee. Reports surfaced that the president had blamed the rough performance on his busy travel schedule in the weeks leading up to it, and some sources close to Biden claimed that he had signs of \"cognitive decline.\"Biden and his campaign rebuked such reports, but the president was eventually pushed out, making way for 59-year-old Vice President Kamala Harris to assume the Democratic nomination in late July.As Silver reported Friday, the frequency of media coverage about the candidates' ages has fallen significantly. In July, per Silver's tracking, the number of New York Times articles that mentioned \"age\" along with Biden's name peaked at 341 for the month. Similarly, the number of articles that mentioned \"age\" and Trump by the Times peaked at 273 during the same time frame. By mid-August, the frequency of such stories had dropped below 140 a month.Silver wrote that he believes there should be more focus on Trump's age and mental capacity but added that pressure should still be applied to Biden as well.\"He may not be a candidate for president anymore, but he's the leader of the free world in a dangerous time facing multiple simultaneous crises from Ukraine to the Middle East,\" he wrote. \"How effective is he at handling these or if something even worse happens?\"Trump has been under pressure in recent weeks to be more transparent about his medical records as Election Day draws near. Last Saturday, Harris' physician released a letter that the vice president maintains a healthy lifestyle and that her most recent physical in April was \"unremarkable.\"Harris' campaign released the report as a nudge to Trump who has been limited about what information he releases to the public regarding his health. A spokesperson for the former president's campaign said last week that medical reports Trump has voluntarily released have found that he is in \"perfect and excellent health to be Commander in Chief.\"Newsweek has reached out to Trump's campaign via email Friday for comment.Silver also said on Friday that he sees \"real movement\" toward the former president in recent polling data, although the race between Harris and Trump remains incredibly close.\"Harris's lead in national polls is down to 2.3 points from a peak of 3.5 on October 2,\" Silver wrote in a post on X, formerly Twitter, on Friday. \"The race remains a toss-up, but we're at a point where we can be pretty confident this is real movement and not statistical noise.\"According to Silver, Harris is leading Trump 49 percent to 46.7 percent on average across national polling as of Friday. But per the pollster's election model, Trump has a slightly higher chance (51.6 percent to 48.1 percent) of securing the necessary 270 Electoral votes for victory in November.","summary":"\"We should probably just have a Constitutional amendment that says a president can't be older than 75 on Inauguration Day,\" Silver wrote.","url":"https://www.newsweek.com/nate-silver-explains-why-he-feels-trump-way-too-old-presidency-1971560","image":"https://d.newsweek.com/en/full/2499301/silver-explains-why-trump-way-tooold.jpg","video":null,"publish_date":"2024-10-18 22:59:39","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.096},{"id":260255216,"title":"‘I’m With Elon’: Gavin Newsom Sides With Musk’s SpaceX in California Lawsuit","text":"California Gov. Gavin Newsom said he’s siding with Elon Musk and SpaceX after the rocket company sued a state commission this week, claiming its political bias against Musk blocked SpaceX from launching more rockets. \n\n“I’m with Elon,” Newsom said on Thursday night, according to Politico. “I didn’t like that.” \n\nNewsom made the comment while he was campaigning for fellow Democrat Kamala Harris in Pennsylvania. \n\nOn Tuesday, SpaceX’s lawsuit claimed the California Coastal Commission “engaged in naked political discrimination” during a recent debate on whether to allow SpaceX to increase rocket launches from 36 to 50 at Vandenberg Space Force Base. The lawsuit, as obtained by TheWrap, said commissioners overstepped their limits by considering Musk’s political leanings — violating his First Amendment right to free speech in the process.\n\n“The concern is with SpaceX increasing its launches, not with the other companies increasing their launches,” commissioner Caryl Hart said, according to the lawsuit. “We’re dealing with a company … the head of which has aggressively injected himself into the president race and made it clear what his point of view is.”\n\nOthers on the committee agreed with Hart’s sentiment, SpaceX’s lawsuit noted. The lawsuit quoted commissioner Gretchen Newsom, saying Musk hops around the U.S. “spewing and tweeting political falsehoods.”\n\nGov. Newsom on Thursday said he wasn’t a fan of Musk’s politics being mentioned when considering rocket launches. \n\n“Look, I’m not helping the legal case,” Newsom said. “You can’t bring up that explicit level of politics.”\n\nNewsom — who appointed some of the commission’s members — “broadly agreed” with SpaceX’s lawsuit, according to Politico. \n\n“These are friends of mine that said that,” Newsom said. “These are good commissioners. But you got to call balls and strikes. And trust me, I’m not big on the Elon Musk bandwagon right now. So that’s me calling balls and strikes.”\n\nMusk, for his part, has made it clear he isn’t on the Newsom Bandwagon. The Tesla head honcho, in an appearance on Tucker Carlson’s show last week, reiterated that he isn’t a fan of Newsom’s progressive views, calling the governor the “goddamn Joker.”\n\nEarlier this year, Musk said he was moving X and SpaceX’s headquarters from California to Texas. Musk said the “final straw” was when Gov. Newsom signed a bill barring teachers from notifying parents that their kids identified as transgender.\n\nAt the same time, Musk has been perhaps Donald Trump’s biggest supporter in recent months. He publicly endorsed the former president after the July assassination attempt in Butler, Pennsylvania. Since then, Musk’s posted on X — the app he owns — in favor of Trump, hosted a live conversation with him on X Spaces in August and joined the candidate on stage when he returned to Butler earlier this month.\n\nBeyond that, Musk has also put a lot of money into helping Trump get back into the White House. On Tuesday, Musk reported $75 million in contributions to America PAC, his pro-Trump political action committee. America PAC’s website, which includes a picture of Musk in his “dark MAGA” hat, lists a handful of top priorities, including free speech, safe cities and secure borders. \n\nSpaceX’s lawsuit, on top of saying the commission has violated Musk’s free speech rights, said the commission had interfered with national security operations.\n\n“Rarely has a government agency made so clear that it was exceeding its authorized mandate to punish a company for the political views and statements of its largest shareholder and CEO,” the lawsuit said.","summary":"The Golden State governor says the X owner's politics shouldn't be a factor in whether he gets to launch more rockets \n\n\nThe post &#8216;I&#8217;m With Elon&#8217;: Gavin Newsom Sides With Musk&#8217;s SpaceX in California Lawsuit appeared first on TheWrap.","url":"https://www.thewrap.com/gavin-newsom-elon-musk-lawsuit-spacex-california/","image":"https://www.thewrap.com/wp-content/uploads/2023/09/gavin-newsom-GettyImages-1340327673.jpg","video":null,"publish_date":"2024-10-18 22:57:17","author":"Sean Burch","authors":["Sean Burch"],"language":"en","source_country":"US","sentiment":-0.009},{"id":260254662,"title":"Barack and Michelle Obama to join Kamala Harris on the campaign tour next week as election race tightens","text":"Vice President Kamala Harris is bringing out the Democrat heavy-hitters as her campaign sees a slip in the polls. \n\nThe VP will campaign alongside both former President Obama and First Lady Michelle next week as the presidential race is in the dead heat for the final stretch. \n\nFirst Harris will be joined by the former president for a rally in Georgia on Thursday, October 24. It will be their first campaign event together with Harris as the Democratic presidential nominee.\n\nThen on Saturday, October 26, the former first lady will appear with the vice president at a rally in Michigan. \n\nThe blockbuster rally next Saturday will be the former first lady’s first in-person campaign event with Harris as well as her first time on the trail in 2024.\n\nOctober 26 marks the first day of early voting in Michigan. The vice president and former first lady will try to mobilize voters to cast their ballots early in the battleground state where polls show a tight race. \n\nMeanwhile, early voting in Georgia smashed records when it kicked off earlier this week. More than 600,000 people have already cast ballots in the 2024 election there. \n\nAt their event, Obama and Harris will encourage Georgia voters to go vote ahead of Election Day on November 5. \n\nHarris will also be in the state for the first time since early in-person voting began for a rally on Saturday in Atlanta.\n\nThe former president first hit the campaign trail for Harris with a solo event in Pittsburgh earlier this month, but their get-out-the-vote event next week will be their first campaign appearance together. \n\nBoth the blockbuster joint events with the former president and first lady are seen as a massive opportunity to harness voter enthusiasm ahead of Election Day, according to a senior campaign official given anonymity to discuss the sensitive unannounced campaign activity. \n\nThe Obamas remain perhaps the most beloved leaders in the Democratic party. Some voters had even hoped Michelle would run for president before she ruled it out earlier this year.\n\nWhile next week will be the first time the former first lady appears on the campaign trail in 2024, her speech at the Democratic National Convention in August stole the show overshadowing even her husband’s address.\n\nHer scathing take down of Donald Trump received thunderous applause from Democrats and reverberated across the internet.\n\nBefore she took the stage, it was not clear the former first lady would even make a showing in Chicago. The last time she was there was to memorialize her late mother.\n\nThe politics-adverse former first lady even acknowledged she was not sure she was up for the task during her speech, but she said she felt compelled to show up and honor her mom’s memory.\n\nWith that she delivered a powerful and heartfelt pitch for the vice president. \n\n‘My girl, Kamala Harris, is more than ready for this moment. She is one of the most qualified people ever to seek the office of the presidency,’ she said in her remarks.\n\nShe also told supporters ‘let us work like our lives depend on it.’\n\nSince her show-stopping speech, Obama has publicly encouraged people to register to vote across her social media platforms through When We All Vote.\n\nShe will headline a separate get-out-the-vote rally with the organization in Atlanta on October 29. \n\nMeanwhile, the former first lady has also offered high praise for the vice president online including after the September presidential debate when she wrote in a post Harris is the ‘only candidate in this race who is ready to be President.’\n\nDuring the pandemic in 2020, Obama did not hit the campaign for Biden, but she did deliver a video closing argument for him that October. In 2016, she campaigned both solo as well as with Hillary Clinton in person in the final stage of the campaign season.\n\nAhead of her first campaign appearance with Harris, the former first lady has been keeping busy working with a number of organizations and projects as well as criss-crossing the country promoting her latest book. \n\nFormer President Obama has been much more active in the 2024 election season to date. \n\nHe has been helping raise millions for the presidential race as well as Democrats down ballot with event appearances as well as in ads.\n\nAt his first solo 2024 campaign event in Pittsburgh last week, Obama delivered a blistering attack on Trump where he slammed him for ‘ranting and the raving about crazy conspiracy theories.’ \n\nHe also questioned ‘if Donald Trump does not care that a mob might attack his own vice president, do you think he cares about you?’ \n\nThe former president has several additional solo campaign stops in the coming days including in Arizona on Friday and Nevada on Saturday. \n\nNext week, he heads to Michigan and Wisconsin to campaign on Tuesday before joining the vice president in person for the first time in Georgia.","summary":"Vice President Kamala Harris is bringing out the Democrat heavy-hitters as her campaign sees&#8230;","url":"https://internewscast.com/politics/barack-and-michelle-obama-to-join-kamala-harris-on-the-campaign-tour-next-week-as-election-race-tightens/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Barack-and-Michelle-Obama-to-hit-the-800x430.jpg","video":null,"publish_date":"2024-10-18 22:55:56","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.017},{"id":260254674,"title":"How Libertarian Chase Oliver May Impact Trump, Harris Race in Swing States","text":"Libertarian candidate Chase Oliver could tip the scales in the tight 2024 presidential race between Vice President Kamala Harris and former President Donald Trump by drawing votes in battleground states with razor-thin margins.Oliver, who is on the ballot in 47 states and a registered write-in in three, is polling around 1 percent, which could be influential this election given the extremely narrow margins between Harris and Trump. However, it is important to note that it's unclear whether all Oliver voters would have otherwise backed Harris, Trump, or opted not to vote at all.A Pew Research Center survey of 5,110 adults, conducted between September 30 and October 6, found Harris narrowly leading Trump, 48 percent to 47 percent, with third-party candidates garnering 5 percent of the vote.When forced to choose between Harris and Trump, respondents' initially supporting third-party candidates are split: 36 percent favor Harris, 35 percent back Trump, and about 30 percent decline to answer. The poll has a margin of error of plus or minus 1.7 percentage points. Other national polls, show a smaller margin for third-party candidates.Third-party candidates have been called out by Republicans and Democrats over the years for swaying the election by voting for candidates who will not win. To this, Oliver told Newsweek in an email on Friday, \"To those in one party or the other who see us as spoilers, I say, the two-party system itself is spoiled rotten. But we welcome being a disruptor to the political binary.\"Newsweek has reached out to Harris' and Trump's campaign for comment via email on Friday.Oliver, 39, is the youngest candidate in the race, having told Newsweek in an exclusive interview this June, \"It's time for our generation to really rise up.\"Here's how Oliver is faring in key swing state races, and what that could mean for Harris and Trump.ArizonaA New York Times/Siena College poll of 808 likely voters in Arizona found Trump leading Harris, but both dropping their share of the vote when third-party candidates like Oliver are included.The poll, conducted between October 7 and 10, shows Trump with 51 percent of the vote, compared to Harris' 46 percent. However, with third-party candidates factored in, Trump lowers to 50 percent and Harris to 45 percent, while Oliver captures less than 1 percent, and Green Party candidate Jill Stein takes 1 percent. The poll has a margin of error of plus or minus 3.9 percentage points.GeorgiaA Georgia native, Oliver voted for himself in the Peach State earlier this week. Recent polls show he is garnering around 1 percent support in his home state.A Quinnipiac University poll of 1,328 likely voters conducted from October 10 to October 14 found Trump with a 7-point lead in the state, and Oliver and Stein each garnering 1 percent. The poll has a margin of error of plus or minus 2.7 percentage points.Oliver previously ran for Georgia's U.S. Senate seat in 2022, earning 2.1 percent of the vote, which forced a runoff between Democratic Senator Raphael Warnock and Republican Herschel Walker, as neither secured a majority. Warnock went on to win the December runoff with 51 percent of the vote, while Walker received 48.6 percent.MichiganOliver appears to maintain his 1 percent in Michigan, too. A Quinnipiac University poll of 1,007 likely Michigan voters shows Trump leading with 50 percent and Harris with 47 percent, while Oliver garners 1 percent support. With a margin of error of plus or minus 3.1 percentage points, Oliver's support could prove influential in the state.NevadaOliver performs below his average among Nevadan voters, with a New York Times/ Siena College poll of 677 registered voters surveyed between August 12 and 15, finding his support at less than 1 percent. That same poll found Trump leading Harris by 3 percentage points, 45 percent to 42 percent, which is within the poll's margin of error of plus or minus 4.2 percentage points.North CarolinaIn North Carolina, Oliver garners 1 percent of support. A Quinnipiac University poll of 1,031 likely voters conducted from October 10 to 14, found Oliver with 1 percent support, Harris at 49 percent, and Trump at 47 percent. In a hypothetical head-to-head matchup between Harris and Trump, Harris' lead widened to 50 percent over Trump's 47 percent.This could mean that Oliver's supporters in North Carolina may lean slightly toward Harris, though it's important to note that 1 percent were undecided, and another 1 percent refused to answer, leaving the result inconclusive. The poll has a margin of error of 3.1 percentage points.PennsylvaniaThe Keystone State is pivotal in the presidential race, as the winner of Pennsylvania and its 19 Electoral votes—more than any other swing state—could determine the outcome of the 2024 election.Oliver is on the ballot in the state, telling Newsweek in an email on Friday, \"We are happy to provide Pennsylvania voters an option outside of a two-party system that more and more ignores individual liberty.\"A New York Times/Philadelphia Inquirer/Siena College poll of 857 likely voters in the state found Harris leading Trump, but both dropping their share of the vote when third-party candidates like Oliver are included.The poll, conducted between October 7 and 10, shows Harris with 50 percent of the vote, compared to Trump's 47 percent. However, with third-party candidates factored in, Harris drops to 49 percent and Trump to 45 percent, while Oliver captures less than 1 percent, and Stein takes 1 percent. Harris' lead is within the margin of error of plus or minus 3.8 percentage points.A recent Quinnipiac University poll conducted from October 3 to 7, among 1,412 likely voters found Stein and Oliver each receiving 1 percent of the vote in Pennsylvania, with Harris 49 percent and Trump 46 percent.In a hypothetical head-to-head matchup between only the Democratic and Republican nominees, Harris maintained 49 percent support, while Trump edged closer with 47 percent, suggesting that more third-party candidates may be supporting Trump in the state.Among independents, who make up 23 percent of respondents, 43 percent support Harris, while 47 percent back Trump, and 3 percent support third-party candidates, according to the poll. The poll's margin of error is plus or minus 2.6 percentage points.WisconsinA Quinnipiac University poll of 1,073 likely voters in the state, conducted between October 3 and 7, found Trump leading Harris, 48 to 46 percent, with Stein and Oliver each securing 1 percent support.The margin between the Republican and Democratic nominees stays the same if third-party candidates are excluded, with Trump receiving 49 percent of the vote and Harris 47 percent. The poll's margin of error is plus or minus 3 percentage points.Another poll found similar results. A Marquette Law School poll of 882 registered voters conducted between September 18 and 26, found Oliver receiving 1 percent of the vote, and Harris leading by 4 percentage points, 48 percent to Trump's 44 percent. This lead is within the margin of error of plus or minus 4.4 percentage points.","summary":"Libertarian Chase Oliver is typically polling around 1 percent, which could be influential in the extremely tight race between Harris and Trump.","url":"https://www.newsweek.com/how-libertarian-chase-oliver-impact-trump-harris-race-swing-states-1971455","image":"https://d.newsweek.com/en/full/2499287/chase-oliver.jpg","video":null,"publish_date":"2024-10-18 22:55:52","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"US","sentiment":-0.142},{"id":260255724,"title":"Trump again refuses to release current health records, as Harris questions his fitness","text":"Donald Trump on Friday dismissed more questions about whether he would release his current medical records, doubling down on refusing to provide a health update even as Kamala Harris works to sow doubts about his fitness for the presidency.\n\nThe 78-year-old Republican nominee, when asked if he will release his health records, suggested that he has already shared enough information about his medical status.\n\n\"Yeah, my health records – I've done five exams over the last four years. You've got them all,\" Trump told a reporter on an airport tarmac after landing in Detroit, Michigan, on Friday afternoon.\n\nTrump then appeared to suggest that he was too busy campaigning against Vice President Harris, the Democratic nominee, to devote time to update his records.\n\n\"Obviously, I'm in the middle of a very big and very contentious fight,\" he said. \"We're leading. I've given my health exams.\"\n\nTrump added that he has \"done cognitive tests twice, and I've aced them. Meaning a perfect score.\"\n\n\"I want to see her do a cognitive test because she couldn't ace because she wasn't born smart,\" he said, before walking away from the press.\n\nThe Trump campaign did not respond to CNBC's request for additional comment on Trump's remarks in Michigan.\n\nTrump told CBS News in August that he would \"very gladly\" release his medical records, but his campaign has not done so.\n\nHarris, who turns 60 on Sunday, released a detailed health report from her White House doctor on Oct. 12. That same day, Trump campaign spokesman Steven Cheung claimed in a statement that the Republican nominee \"has voluntarily released\" multiple health reports.\n\nCheung pointed to a three-paragraph letter from Dr. Bruce Aronwald, which was shared last November and related to an exam of Trump that was conducted more than a year ago.\n\nCheung also referred to two memos penned in July by Republican Rep. Ronny Jackson of Texas, who formerly served as Trump's White House physician. Those memos focused on the injury Trump sustained when he narrowly survived an assassination attempt at a July 13 campaign rally.\n\nHarris, meanwhile, has recently ramped up her health-focused attacks on Trump, who would become the oldest person in U.S. history elected president if he prevails in the Nov. 5 election.\n\nDuring a rally in North Carolina on Sunday, she put a spotlight on Trump's refusal to release a comprehensive health report, along with his decision not to agree to a second debate.\n\n\"It makes you wonder, why does his staff want him to hide away? One must question, one must question, are they afraid that people will see that he is too weak and unstable to lead America? Is that what's going on?\" Harris said.","summary":"Donald Trump would become the oldest person in U.S. history elected president if he beats Kamala Harris in the Nov. 5 election.","url":"https://www.cnbc.com/2024/10/18/trump-health-records-harris-exhausted.html","image":"https://image.cnbcfm.com/api/v1/image/108049972-1729282832381-gettyimages-2179388594-wm_10127_r9ijzrbp.jpeg?v=1729282901","video":null,"publish_date":"2024-10-18 22:53:34","author":"Kevin Breuninger","authors":["Kevin Breuninger"],"language":"en","source_country":"US","sentiment":-0.368},{"id":260255048,"title":"DC Judge Unseals New Evidence in Jack Smith’s Jan 6 Election Case | Capitol Report","text":"Oct-18-2024\n\nMore evidence is now public from special counsel Jack Smith’s revised indictment of former President Donald Trump. Smith is trying to keep the case alive after the Supreme Court ruled Trump’s official acts are immune to prosecution.\n\nThe United States hopes the death of a Hamas terrorist group leader will bring Israel closer to ...","summary":"More evidence is now public from special counsel Jack Smith&#8217;s revised indictment of former President Donald Trump. Smith is trying to keep the case alive after the Supreme Court ruled Trump&#8217;s official acts are immune to prosecution. The United States hopes the death of a Hamas terrorist group leader will bring Israel closer to ending [&#8230;]","url":"https://www.theepochtimes.com/epochtv/dc-judge-unseals-new-evidence-in-jack-smiths-jan-6-election-case-capitol-report-5743885","image":"https://img.theepochtimes.com/assets/uploads/2024/10/18/id5743974-6f66f6ff70bafa80891f0fc8.jpg","video":null,"publish_date":"2024-10-18 22:53:04","author":"Steve Lance","authors":["Steve Lance"],"language":"en","category":"politics","source_country":"us","sentiment":0.209},{"id":260254518,"title":"DNC knows its key endorsement all too well as it launches new Swift themed ads","text":"The Democratic National Committee has launched a last minute campaign designed to capitalize on one of its most high-profile backers – Taylor Swift.\n\nThe DNC announced the campaign on Friday – with just over two weeks to go before election day – in an attempt to galvanize younger voters, and fans of the US pop megastar and guide them into their “Kamala Era.”\n\nSwift announced her official endorsement of Kamala Harris in the race on September 10, moments after the presidential debate with Donald Trump, saying that she was voting for Harris “because she fights for the rights and causes I believe.”\n\nThe ‘Shake It Off’ and ‘All Too Well’ singer, who is set to perform in Miami on Friday as part of a final set of dates on her The Eras Tour, also urged people to do their research and register to vote.\n\nThe DNC’s Swift-themed “I Will Vote” campaign includes an exclusive new Snapchat filter urging young voters to be “fearless” on the issues that will decide this election – including abortion and the economy.\n\nThe snapchat filter will feature “In My Voting Era” at the top.\n\nThe ads will kick off in Miami with a mobile billboard on a boat near Swift’s concert venue, as well as other billboards across the city, and the filter will be available in other key battleground states.\n\n“This election will determine the future for young voters, from student loan debt relief and economic opportunity to whether they have fewer rights than their grandmothers did,” said Rosemary Boeglin, DNC Communications Director.\n\n“Democrats are reaching out to young voters where they are, from concert venues to social media platforms, to make sure they have the resources they need to cast their ballot.\n\n“We’re not taking any vote for granted, and we’ll continue to make sure young voters across the country know everything that’s at stake and the stark contrast between Vice President Harris’ New Way Forward and Donald Trump’s Project 2025 agenda.\n\n“Our country’s youth are mobilized to speak now for the future they deserve, and they’ll elect Vice President Harris, Governor Tim Walz, and Democrats down the ballot in November.”\n\nThe DNC has previously leaned into having Swift on board with the Harris campaign, offering friendship bracelets featuring words including “voter” and “Democrat,” in the style of those worn by fans during the The Eras Tour.\n\nIn her Instagram post, Swift wrote: “I’ve done my research, and I’ve made my choice. Your research is all yours to do, and the choice is yours to make. I also want to say, especially to first time voters: Remember that in order to vote, you have to be registered! I also find it’s much easier to vote early. I’ll link where to register and find early voting dates and info in my story.\n\nThe singer signed off the post as a “Childless Cat Lady” – a reference to controversial comments made by Trump running mate JD Vance about Democratic leaders.","summary":"The DNC announced the campaign on Friday – with just over two weeks to go before election day – in an attempt to galvanize younger voters","url":"https://www.independent.co.uk/news/world/americas/us-politics/taylor-swift-democrat-dnc-kamala-harris-trump-b2631930.html","image":"https://static.independent.co.uk/2024/10/16/14/f6e67e275cab2c7ec05978ee65d6558bY29udGVudHNlYXJjaGFwaSwxNzI5MTcxMTg0-2.76685165.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/1t1scSfa-4VHSaSK0.mp4","publish_date":"2024-10-18 22:49:14","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":0.276},{"id":260254162,"title":"Donald Trump Accused of Overcharging Secret Service at Hotel: Read Report","text":"Former President Donald Trump was \"fleecing taxpayers\" while in the White House and taking \"the Secret Service to the cleaners\" by overcharging for Washington, D.C., hotel stays, according to House Democrats.On Friday, the House Oversight Committee Democrats released a report on what they called \"a glimpse into President Trump's domestic emoluments rackets and pay-to-play schemes.\" Trump was accused of taking part in an \"unconstitutional art of the steal\" during his first and so far only term.The U.S. Constitution's emoluments clause prohibits presidents from profiting from foreign governments and from taking any money from the U.S. government other than the usual presidential salary.Friday's report accuses Trump of forcing the Secret Service to pay \"exorbitant hotel charges\" while agents were obliged to stay at the Trump International Hotel in Washington to protect members of Trump's family who were staying at the property. The hotel, which has since been sold and is now the Waldorf Astoria, is located close to the White House.\"During protective travel, it is necessary for some Secret Service personnel to accompany protectees at all times and in all locations to ensure their safety,\" a Secret Service spokesperson told Newsweek. \"We are required by policy to use government rates when they are available to ensure fiscal responsibility.\"Eric Trump, the GOP presidential nominee's son, was quoted in the report as having falsely claimed in 2019 that Secret Service agents stay at Trump properties \"for free.\" Instead, the report alleges, the Secret Service often paid rates that were far higher than others staying at the D.C. hotel on the same nights.\"Throughout the Trump Administration, The Trump Organization attempted to downplay the amount of Secret Service spending at its properties,\" the report states. \"However...[Trump] treated the Secret Service not as a gratis friend and guest but as a 'captive customer,' using the agency as a fabulously wealthy sucker for whom price was no object.\"The report also says that the Secret Service \"approved a waiver to pay a room rate of $600 when the per diem for that month was $201\" so that agents could stay at the D.C. hotel during \"an apparent stay by Eric Trump and his wife, Lara Trump, on November 28, 2017.\"\"Notably, that very night, the Trump International Hotel in Washington, D.C., rented out more than 80 rooms at rates less than $600 per room, including a dozen rooms rented to the Inner Mongolia Yitai Coal Co., Ltd.—which is headquartered in China—for $338.85 each,\" the report continues.Newsweek reached out via email for comment to Trump's office on Friday.The report goes on to highlight several other expensive Secret Service stays at the Trump hotel. In one case, the agency paid $895 per night during an Eric Trump stay in February 2018, despite the hotel renting out \"more than 100 rooms that evening at rates of less than $895—including at least one room rented out for just $150.50.\"The report also accuses Trump of committing numerous additional violations of the emoluments clause by charging foreign dignitaries and others to stay at the D.C. hotel and other Trump properties while he was serving as president.\"In some instances, President Trump was fleecing the U.S. government for more money in constitutionally prohibited domestic emoluments than he was shaking down from foreign states and monarchs for constitutionally prohibited foreign emoluments,\" the report states.Read the full 57-page report below","summary":"A report from House Democrats accuses the former president of \"fleecing taxpayers\" during his presidency.","url":"https://www.newsweek.com/donald-trump-accused-overcharging-secret-service-hotel-read-report-1971541","image":"https://d.newsweek.com/en/full/2499298/donald-trump-overcharging-secret-service-hotel-report.jpg","video":null,"publish_date":"2024-10-18 22:48:32","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.14},{"id":260254782,"title":"Home stretch: Harris, Trump hold dueling events, rallies in crucial battleground state","text":"LANSING, Mich. — Vice President Kamala Harris is back in the crucial Great Lakes battleground state of Michigan. \"It's the time to make a plan to vote. Make a plan,\" Harris urged supporters at a rally in Grand Rapids, the first of her three stops here Friday. \"Michigan, today I ask you…..are you ready to make your voices heard?\" And she emphasized to the crowd that \"we've got to energize and organize and mobilize and remind our neighbors and our friends that their vote is their voice.\" However, the Democratic presidential nominee didn't have Michigan to herself on Friday with under three weeks to go until Election Day. CRUNCH TIME: KAMALA HARRIS TO TEAM UP WITH THE OBAMAS NEXT WEEK Former President Trump, the Republican standard-bearer, is also in Michigan. Trump's first stop: a campaign office in Hamtramck, the only Muslim-majority city in the U.S. Hamtramck Democratic Mayor Amer Ghalib, the first Arab American and first Muslim to lead the city, attended the event. Ghalib made headlines a month ago by endorsing Trump, even though three city council members in the same city have endorsed Harris. WATCH DONALD TRUMP'S INTERVIEW ON ‘FOX AND FRIENDS' \"Frankly, it's an honor,\" Trump said if the mayor's endorsement, as he took questions from reporters upon arrival in Michigan. Both Trump and Harris are courting the state's consequential Arab American voters, who make up over two percent of Michigan's population, the highest percentage of any state in the nation. The Trump campaign this year has seen an opening among Arab Americans, over their anger at the current administration's support for Israel in its war with Hamas in Gaza. \"I don't think they're going to be voting for her [Harris],\" Trump argued. And pointing to the latest polls in the state, he touted \"I hear we're leading in Michigan.\" CHECK OUT THE LATEST FOX NEWS POWER RANKINGS IN THE 2024 ELECTION Many of the latest public opinion surveys in the swing state do indicate Trump with a very slight edge over Harris in a margin-of-error race. Matt Grossman, a Michigan State University political science professor, spotlighted the state's \"unique dynamics\" as he pointed to Harris' perceived \"weakness\" with Arab American voters as well as the state's sizable Black electorate. Michigan is one of seven crucial swing states whose razor-thin margins decided President Biden's 2020 election victory over Trump. And all seven states are likely to determine if Harris or Trump wins November's election to succeed Biden in the White House. Michigan, along with Pennsylvania and Wisconsin, are the three Rust Belt states that make up the Democrats' so-called \"Blue Wall.\" The party reliably won all three states for a quarter-century before Trump narrowly captured them in the 2016 election to win the White House. CLICK HERE TO GET THE FOX NEWS APP Four years later, in 2020, Biden carried all three states by razor-thin margins to put them back in the Democrats' column and defeated Trump. Harris, who in July replaced Biden atop the Democrats' 2024 ticket, and Trump — as well as their running mates — have made numerous stops in the Blue Wall states this summer and autumn, and both campaigns and allied groups have built up get-out-the Rust Belt battlegrounds. And on Friday evening, both Harris and Trump were scheduled to be campaigning in and around Detroit. The vice president was holding a rally in suburban Oakland County, while the former president was also in the county for a roundtable discussion in Auburn Hills before headlining a rally in downtown Detroit. CLICK HERE TO GET THE FOX NEWS APP With Michigan a must win state for Harris, she is spending the night and holding a get-out-the-vote event on Saturday in Detroit with Lizzo, a popular singer and rapper who was born in the Motor City. Lizzo revealed this week that she had voted early for Harris. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Vice President Kamala Harris and former President Donald Trump hold dueling campaign events in battleground Michigan with less than three weeks to go until Election Day.","url":"https://www.foxnews.com/politics/home-stretch-harris-trump-dueling-events-rallies-crucial-battleground-state","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/kamala-harris-donald-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-18 22:46:57","author":"Deirdre Heavey,Paul Steinhauser","authors":["Deirdre Heavey","Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.015},{"id":260254362,"title":"Kamala Harris takes the lead over Donald Trump in early voting","text":"Early voting has kicked off in multiple states across the country with less than three weeks go before Election Day, and Democrats are surging ahead.\n\nMore than eight million people have already voted early, either in person or by absentee ballot, according to tracking by TargetSmart. \n\nThat includes more than 4.5 million registered Democrats who have cast ballots, significantly more than the 3.1 million registered Republicans. Another 740,000 early voters are not with either party. \n\nIt also breaks down to more than 4.4 million women who have already voted compared to more than 3.7 million men.\n\nThe data comes as Democrats have been more likely to cast ballots early or by mail in the past, and former President Donald Trump has previously criticized the process.\n\nHowever, in this campaign, Republican party officials have been pushing GOP voters to cast ballots in any way they can, including taking advantage of early voting options. \n\nDemocrats are currently outpacing Republicans when it comes to early and absentee voting in the seven key battleground states that will likely decide the election. \n\nMore than 2.6 million ballots have been cast in the swing states of Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania and Wisconsin. \n\nOf those, more than 1.4 million were cast by Democrats while just over 964,000 were cast by Republicans. Another 253,000 unaffiliated voters have also cast ballots in the battleground states. \n\nHowever, when it comes to the breakdown in each state, the results are mixed. \n\nRepublicans currently lead in early and absentee voting in Arizona, Georgia and Nevada, the model shows. \n\nDemocrats are ahead in Michigan, North Carolina, Pennsylvania and Wisconsin. \n\nIn Arizona, the data shows Republicans have cast 87,000 ballots as of Friday while Democrats have cast 67,000 ballots. Another 6,900 unaffiliated voters have also cast ballots. The breakdown between men and women voters was nearly split.\n\nIn Georgia, where early in-person voting smashed records when it kicked off this week, more than 292,000 Republicans have cast ballots while 283,000 Democrats have. Some 28,000 unaffiliated voters have also voted already. \n\nThe number of women voting early in Georgia has outpaced the number of men by more than 25,000 as of Friday. \n\nMeanwhile, early in-person voting in Michigan kicks off next week, but some 855,000 people have already submitted ballots. Democrats cast 467,000 of them while Republicans have 305,000, the tracking shows.\n\nIn Nevada, early in-person voting begins on Saturday, October 19, but the state began mailing ballots earlier this week. More than 8,400 people have voted so far. The breakdown includes more than 5,700 GOP ballots and 2,300 ballots from Democrats.\n\nIn North Carolina, mail-in voting has been underway for weeks but early in-person voting is also officially underway. \n\nThe state broke records with more than 350,000 people casting ballots on the first day of early in-person voting on Thursday. \n\nAccording to the data provided by the state, more than 428,000 people have now cast ballots in the state. That includes more than 156,000 Democrats, 142,000 Republicans and more than 127,000 unaffiliated voters who make up the largest percentage of registered voters in the state.\n\nAt the same time, more than 669,000 people have voted in the crucial battleground state of Pennsylvania. And when it comes to early voting, Democrats there have surged ahead as well.\n\nMore than 461,000 of the ballots already cast in Pennsylvania were by Democrats while Republicans have cast just 193,000 ballots. \n\nWomen have cast more than 55 percent of the ballots in the Keystone State so far.\n\nIn Wisconsin, early in-person voting kicks of on October 22, but at least 281,000 people have already been able to vote. \n\nDemocrats are outpacing Republicans by 112,000 ballots to 53,000. \n\nHowever, the vast majority of ballots submitted in Wisconsin, more than 115,000, came from voters in the state who are not identified as Democrats or Republicans.","summary":"Early voting has kicked off in multiple states across the country with&#8230;","url":"https://internewscast.com/news/us/kamala-harris-takes-the-lead-over-donald-trump-in-early-voting/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Kamala-Harris-surges-ahead-of-Donald-Trump-800x430.jpg","video":null,"publish_date":"2024-10-18 22:45:55","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.437},{"id":260254374,"title":"Harris mocks pro-life protesters 'at the wrong rally' hours before Catholic charity dinner snub","text":"Vice President Kamala Harris didn't hold back on pro-life protesters as she talked to her supporters about expanding abortion rights at her campaign stop in Wisconsin on Thursday, just hours before she skipped the Al Smith Catholic charity dinner. \"We will move forward because ours is a fight for the future, and it is a fight for freedom — for freedom. Like the fundamental freedom of a woman to make decisions about her own body and not have her government tell her what to do,\" Harris said to the crowd. \"And again, we’re not going to be gaslighted on this. We remember Donald Trump hand-selected three members of the United States Supreme Court with the intention that they would undo the protections of Roe v. Wade, and they did as he intended,\" she added. VP HARRIS RIPPED BY VICTIM OF ILLEGAL IMMIGRANT RELEASED UNDER HER PROGRAM OVER RESURFACED SPEECH Harris was then interrupted by anti-abortion protesters and said, \"Oh, you guys are at the wrong rally,\" as she flashed a grin. \"I think you meant to go to the smaller one down the street,\" she added — referring to former President Trump's — as rallygoers erupted in cheers. On social media, users speculated Harris was responding to a particular attendee who shouted, \"Jesus is Lord.\" Fox News Digital has reached out to the Harris campaign for comment. The rally came as Harris skipped the 79th Alfred E. Smith Memorial Foundation Dinner in New York City. The dinner was launched in 1946 and has raised millions of dollars for charities supporting women and children. CLICK TO GET THE FOX NEWS APP It has since grown to become a political and cultural hallmark of election seasons, but Harris surprised many by skipping the bipartisan political event that typically adds a bit of levity to the campaign trail each presidential election cycle. Harris was the first major-party presidential contender since Walter Mondale in 1984 to skip the event. Fox News Digital's Brian Flood and Emma Colton contributed to this report.","summary":"Vice President Kamala Harris on Thursday told pro-life protesters they were at the &quot;wrong rally&quot; as she campaigned in Wisconsin and skipped the Al Smith Catholic charity dinner.","url":"https://www.foxnews.com/politics/harris-mocks-pro-life-protesters-wrong-rally-hours-before-catholic-charity-dinner-snub","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/kamala-haris-erie-pa-oct.-14-2024-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-18 22:37:32","author":"Jamie Joseph","authors":["Jamie Joseph"],"language":"en","source_country":"US","sentiment":-0.121},{"id":260256892,"title":"Why Israel Targeted Yahya Sinwar","text":"Skip to contentSkip to site index\n\nnew video loaded: Why Israel Targeted Yahya Sinwar\n\nWhy Israel Targeted Yahya Sinwar\nBy Ronen Bergman, Nikolay Nikolov, James Surdam, Laura Salaberry, Farah Otero-Amad and Dave Horn•October 18, 2024\nWhat does the killing of Yahya Sinwar, mastermind of the Oct. 7 attack, mean for Israel and Gaza? Ronen Bergman, a staff writer for The New York Times Magazine who is based in Tel Aviv, explains.\n\nBehind the Reporting\nRecent Episodes\n\nNOW PLAYING\nWhy Israel Targeted Yahya Sinwar\n\nWill the Polls in 2024 Be More Accurate Than in 2016 and 2020?\n\nElon Musk Is Going All In to Elect Donald Trump\n\nWhere Trump and Harris Stand on Immigration\n\nThe Brutal Reality of Panda Breeding\n\n4 Creepy Books to Read This Halloween\n\nGOP Is Making Inroads With Black and Hispanic Voters\n\nHow Palestinians Are Roadblocked in the West Bank\n\nHow Trump Distorted a Claim About Migrant Children\n\nHow Harris and Trump Are Battling for Pennsylvania\n\nWhy Milton and Helene ‘Exploded’ in Strength\n\nHow Book Bans Happen Under the Radar\n\nHow Trump’s Speeches Raise Questions About Age\n\nThe Fight for Rural America\n\nWhere Trump and Harris Stand on the Economy\n\nWhat to Know About the Verdict in the Tyre Nichols Case\n\nThe War’s Toll on Sick Ukrainian Children\n\nHurricane Helene Leaves Trail of Destruction in North Carolina\n\nFact-Checking JD Vance and Tim Walz\n\nVance and Walz Spar Over Key Policy Issues\n\nWhy Georgia’s Election Board Is Being Sued\n\nThe Border in the Campaign and in Real Life\n\nWho Was Hassan Nasrallah, Leader of Hezbollah?\n\nHow to Understand Election Polls\n\nRecent episodes in Behind the Reporting\n\nNOW PLAYING\n\nWhy Israel Targeted Yahya Sinwar\n\nWill the Polls in 2024 Be More Accurate Than in 2016 and 2020?\n\nElon Musk Is Going All In to Elect Donald Trump\n\nWhere Trump and Harris Stand on Immigration\n\nThe Brutal Reality of Panda Breeding\n\n4 Creepy Books to Read This Halloween\n\nGOP Is Making Inroads With Black and Hispanic Voters\n\nHow Palestinians Are Roadblocked in the West Bank\n\nHow Trump Distorted a Claim About Migrant Children\n\nHow Harris and Trump Are Battling for Pennsylvania\n\nWhy Milton and Helene ‘Exploded’ in Strength\n\nHow Book Bans Happen Under the Radar\n\nShow more videos from Behind the Reporting\n\nLatest Video\nHong Kong Protests\n2020 Elections\nMost-Viewed\nVisual Investigations\nThe Dispatch\nDiary of a Song\nHow We Got Here\n\nAdvertisementSKIP ADVERTISEMENT\n\nSite Information Navigation\n\n© 2024 The New York Times Company\n\nAccessibility\nWork with us\n\nT Brand Studio\nYour Ad Choices\nPrivacy Policy\nTerms of Service\nTerms of Sale\n\nInternational\n\nSubscriptions\n\nManage Privacy Preferences","summary":"What does the killing of Yahya Sinwar, mastermind of the Oct. 7 attack, mean for Israel and Gaza? Ronen Bergman, a staff writer for The New York Times Magazine who is based in Tel Aviv, explains.","url":"https://www.nytimes.com/video/world/middleeast/100000009768679/who-was-yahya-sinwar.html","image":"https://static01.nyt.com/images/2024/10/18/world/middleeast/vid-sinwar-cover12/vid-sinwar-cover12-facebookJumbo.jpg?video-overlay","video":null,"publish_date":"2024-10-18 22:27:07","author":"Farah Otero-Amad and Dave Horn,James Surdam,Laura Salaberry,Nikolay Nikolov,Ronen Bergman","authors":["Farah Otero-Amad and Dave Horn","James Surdam","Laura Salaberry","Nikolay Nikolov","Ronen Bergman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.014},{"id":260252896,"title":"Bitcoin Surges as Trump’s Election Odds Improve","text":"Bitcoin’s recent price surge has caught investors’ attention, partly due to its potential link to Donald Trump’s improving chances in the upcoming U.S. presidential election.\n\nThe digital asset has risen by about 13% in the past week, outpacing global stock indicators and gold. Billionaire Stan Druckenmiller pointed to crypto as one of the signs that markets are pricing in a Trump victory.\n\nTrump has pledged to make the U.S. the crypto capital of the world if he wins the tight race against his Democratic rival. His opponent in the election is Vice President Kamala Harris.\n\nThe cryptocurrency’s advance coincided with shifts in prediction markets, where people can bet on election outcomes. On the Polymarket platform, Trump‘s odds have increased to 60%, while Harris’s have decreased to 40%.\n\nPredictIt shows Trump’s chances at 54%, compared to Harris’s 50%. Arisa Toyosaki, co-founder of crypto derivatives provider Cega, noted that enthusiasm in prediction markets is causing high levels of implied volatility.\n\nShe also mentioned that this has led to a rally in Bitcoin spot prices. Net inflows into a group of U.S. Bitcoin ETFs have exceeded $285 million ($1.6 billion) since October 11.\n\nPrice Surges Amid Political Shifts\n\nBitcoin traded around $67,300 on Thursday in London, compared to its March record of $73,798. Though prediction markets favor Trump, most polls show a margin-of-error difference with less than three weeks until Election Day.\n\nHarris has taken a nuanced stance on cryptocurrencies, promising to support a regulatory framework for digital assets and sector growth with proper safeguards.\n\nHer position has sparked optimism among crypto traders, as it contrasts with the Biden Administration’s crackdown.\n\nMeltem Demirors, general partner at Crucible Capital, told Bloomberg Television that crypto’s emergence as an election issue is directing attention to bitcoin.\n\nShe added that it is also drawing focus to crypto assets in general. This attention translates into sentiment, which drives flows.\n\nTrump’s support for the sector marks a shift from his previous stance, where he once called it a scam. Digital asset firms have become influential players in elections through large donations to political action committees seeking friendlier rules.\n\nDruckenmiller stated in a Bloomberg Television interview that the market over the last 12 days seemed “very convinced” of a Trump victory, visible in bank stocks and crypto performance.\n\nAs the election approaches, the connection between Bitcoin’s price and political developments continues to intrigue investors and analysts alike.","summary":"Bitcoin&#8217;s recent price surge has caught investors&#8217; attention, partly due to its potential link to Donald Trump&#8217;s improving chances in the upcoming U.S. presidential election. The digital asset has risen by about 13% in the past week, outpacing global stock indicators and gold. Billionaire Stan Druckenmiller pointed to crypto as one of the signs that [&#8230;]","url":"https://www.riotimesonline.com/brazil-news/markets/bitcoin-surges-as-trumps-election-odds-improve/","image":"https://www.riotimesonline.com/wp-content/uploads/2024/10/Untitled-14.webp","video":null,"publish_date":"2024-10-18 22:27:05","author":"RT Staff Reporters","authors":["RT Staff Reporters"],"language":"en","category":"politics","source_country":"br","sentiment":-0.041},{"id":260252908,"title":"Elon Musk Promises $100 to Pennsylvania Voters During Campaigning for Trump","text":"Elon Musk, the world’s richest man, has found a new way to put his money to work in the election by offering $100 to registered Pennsylvania voters for signing a free speech and Second Amendment petition.\n\nThe owner of X and Tesla has decamped to the battleground to run a vast get-out-the-vote operation in support of Donald Trump.\n\nAnd whoever wins Pennsylvania’s 19 electoral college votes on November 5 will be in prime position to take the White House.\n\nOn Thursday night, Musk appealed directly to Pennsylvania voters. \n\n‘If you’re a registered Pennsylvania voter, you and whoever referred you will now get $100 for signing our petition in support of free speech and right to bear arms,’ he posted on his own social media platform. \n\n‘Earn money for supporting something you already believe in! Offer valid until midnight on Monday.’\n\nMusk, who is worth more than $200 billion, has thrown himself into the race in recent weeks.\n\nHe appeared alongside Trump at a rally in Butler, Pennsylvania, this month and has set up a political action committee to funnel his money into the fight.\n\nThis is the second time he has offered supporters money. His America PAC previously offered $47 (Trump would be the 47th president if he wins in November, as well as the 45th) for each swing state voter to sign the petition.\n\nFilings released this week show he gave $75 million to the group for the final stretch.\n\nAnd on Thursday night he kicked off a campaign swing in the state, speaking at a town hall for people who had signed up with his PAC. \n\n‘I can’t emphasize enough that Pennsylvania is, I think, the linchpin in this election,’ he told a crowd in Folsom, before setting out why he had decided to wade into politics in 2024\n\n‘This election, I think, is going to decide the fate of America, and along with the fate of America, the fate of Western civilization.’\n\nThe race in the state could not be more important or tighter.\n\nA DailyMail.com/J.L. Partners poll last week found that Trump was running neck-and-neck with Harris. They would each get 47 percent of the vote if the election were tomorrow. \n\nTrump is all in on winning the state.\n\nHe will hold a rally at an airfield outside Pittsburgh on Saturday, before a string of events a day later.\n\nRepublicans have made inroads into Democrats’ longstanding advantage in voter registrations.\n\n‘The next, basically, three days are essential,’ Musk told his audience as he detailed the fine margins at work. \n\n‘I think we see that this election will be decided in Pennsylvania by, it could be 10,000 votes, it could be 1,000 votes, it could be 10 votes. \n\n‘It could be some very tiny number, so every incremental person is a huge difference.’","summary":"Elon Musk, the world&#8217;s richest man, has found a new way to&#8230;","url":"https://internewscast.com/celeb/celeb-news/elon-musk-promises-100-to-pennsylvania-voters-during-campaigning-for-trump/","image":"https://internewscast.com/wp-content/uploads/2024/10/1729290299_rewrite-this-title-Elon-Musk-offers-Pennsylvania-voters-100-each-800x430.jpg","video":null,"publish_date":"2024-10-18 22:25:48","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.148},{"id":260257096,"title":"Rick Nolan, former northern Minnesota congressman, has died","text":"Rick Nolan, former northern Minnesota congressman, has died\n\nThe former U.S. representative won the northeastern Minnesota seat in 2012 and followed with two tricky re-election campaigns. He had served earlier in Congress and the Minnesota House.\n\nBy Christa Lawler\n\nThe Minnesota Star Tribune\n\nOctober 18, 2024 at 10:18PM\n\nRep. Rick Nolan has died, according to the Minnesota DFL. The longtime northern Minnesota lawmaker was 80. (Star Tribune file photo/The Minnesota Star Tribune)\n\nLess than two weeks before he died, Rick Nolan spent a day on the Iron Range campaigning for Democratic candidate Lorrie Janatopoulos, who is running to represent House District 7B in the upcoming election. First he gave a rip-roaring, barn-burner of a speech, according to his friend and former aide Jeff Anderson, then he went door-knocking.\n\nNo one expected the door-knocking, Anderson said. Nolan insisted.\n\nNolan, a former Democratic congressman from Minnesota’s 8th District — remembered for his captivating speeches and personal connections, and recognized in 2015 nationally as a top 10 effective lawmaker — has died. He was 80. The cause of death has not yet been made public.\n\nNolan entered the political ring in the 1960s, left in the 1980s, then returned in the 2010s. Anderson was Nolan’s district director and deputy chief of staff in his second political go-round. Before that, they were both part of a large contingent of Democrats bent on challenging Chip Cravaack, a Republican who had pushed out Rep. Jim Oberstar from the District 8 congressional seat in 2010.\n\nBy the primary election, just three candidates remained. Nolan won — but he brought Anderson with him.\n\n“This guy is the real deal,” Anderson remembered thinking the first time he saw Nolan speak. “He could give a speech like no one else. It harkened back to some old-time politicians, their fist and fingers and voices raised. That was Rick. He was so passionate.”\n\nA host of Minnesota politicians who knew him offered condolences to Nolan’s family on Friday, including Gov. Tim Walz, who said Nolan’s speeches could blow the lid off a roof, and U.S. Rep. Betty McCollum, who lauded his hot dish.\n\nView post on X\n\n“He’d share sap that he harvested, venison that he hunted, and wild rice that he gathered with his own hands,” she wrote in a public statement.\n\nMinnesota’s DFL Chair Ken Martin said Nolan was a champion for the Northland and dedicated public servant. Former Duluth mayor Don Ness said he had a fire in his belly that “was just about Wellstonian.”\n\nIn an email, the conservation director of Wilderness Watch remembered the way Nolan celebrated the Boundary Waters Canoe Area Wilderness, which wasn’t always a popular move in the late 1970s.\n\n“Rick knew the value of protecting the area as a wilderness, and always stuck with that belief,” said Kevin Proescholdt.\n\nNolan, a native of Brainerd and at one time a social studies teacher, was first elected to the U.S. House in 1974 — considered one of the “Watergate babies” alongside the surge of dozens of Democrats voted in after President Richard Nixon’s resignation. He left office in 1981. At the time, he planned to start a small model farm in central Minnesota, according to a Star Tribune story.\n\n“I want to read, write, become a good guitar player and enjoy some leisure time,” he said at the time. “In short, I’m looking forward to leading a normal life again, doing normal things.”\n\nDecades later, he doubled back to politics.\n\nAfter ousting Cravaack in 2012, he went on to win two more expensive and highly competitive races against Republican Stewart Mills — including in 2016, when the district favored President Donald Trump.\n\nNolan had planned to run for re-election in 2018, then changed his mind. At the time, he said he was no longer willing to make the sacrifices necessary run a competitive congressional campaign.\n\n“When you get in these tough election contests, you’ve got to give it everything you’ve got or I don’t think you should run,” he told the Star Tribune in a February 2018 interview. “That’s what I did over the years, and that’s how I won. But now it’s time to give something back to my family and my wife, and I’m really hungry for more time with them.”\n\nHe had more than a dozen grandchildren on top of four children — one who was battling Stage 4 lung cancer. Katherine Bensen died in 2020.\n\nU.S. Rep. Rick Nolan with his daughter Katherine.\n\nU.S. Sen. Amy Klobuchar on Friday described Nolan as a “consummate outdoorsman, friend of labor, and he never forgot where he came from.” He was the “comeback kid,” she said, after being one of the youngest members of Congress to one of the oldest “freshmen” when he returned to politics.\n\nNolan had one more go after that, joining gubernatorial candidate and former Minnesota Attorney General Lori Swanson in the 2018 governor’s race, with Nolan up for lieutenant governor. The duo finished third in the primary, falling to Gov. Tim Walz and Lt. Gov. Peggy Flanagan, who went on to win.\n\nNolan is survived by his wife, Mary, whose early years of campaigning alongside him included several hiccups. According to a Star Tribune article from 1976, she was struck by a truck while talking to someone in a parked car along a highway near Marshall, Minn., and broke her pelvis. She had a gall bladder incident during a parade once, and another time a stalled airplane ran over a pilot and hit the car she was sitting in. She was uninjured.\n\nAround this same time, Nolan was in an airplane that made an emergency landing on the Mississippi River.\n\n“I am half-tempted to get off the campaign trail,” he said at the time. “It seems full of little pitfalls.”\n\nSen. Grant Hauschild remembered Nolan for the way he made personal connections with the people he met. The former lawmaker had door-knocked with him in Hoyt Lakes, Minn., before Hauschild was elected.\n\n“No one fought harder for the place they loved than him,” Hauschild wrote on social media. “His eternal optimism was contagious and he always spent his capital on uplifting future leaders. Northern Minnesota will miss our champion as he joins the other political titans from our region in heaven.”\n\nView post on X\n\nLibrarian John Wareham contributed to this story.","summary":"The former U.S. representative won the northeastern Minnesota seat in 2012 and followed with two tricky re-election campaigns. He had served earlier in Congress and the Minnesota House.","url":"https://www.startribune.com/rick-nolan-former-northern-minnesota-congressman-has-died/601164338","image":"https://arc.stimg.co/startribunemedia/JUUP76W6T3DT5DA26AP245YSHI.jpg?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2024-10-18 22:18:46","author":"Christa Lawler","authors":["Christa Lawler"],"language":"en","category":"politics","source_country":"US","sentiment":-0.157},{"id":260252910,"title":"Chicago Mayor Brandon Johnson to support Vice President Kamala Harris in Detroit, Michigan before 2024 election.","text":"CHICAGO (WLS) — Chicago Mayor Brandon Johnson has already campaigned for Vice President Kamala Harris in Nevada.\n\nThis weekend, he is headed to the battleground state of Michigan with a message that Harris’ campaign hopes will resonate with Black men, in particular.\n\nABC7 Chicago is now streaming 24/7. Click here to watch\n\nJohnson was at the Garfield Park Conservatory on Friday, talking West Side investments, but this weekend, he is slated to hit the Detroit pulpit circuit, visiting several prominent Black churches there as a surrogate for Harris.\n\n“Affordable housing, her position there to create homeownership. Those are values that we agree on. Her investment for public education. Speak about those values, particularly,” Johnson said.\n\nEarlier Friday, Harris held a rally in Grand Rapids, and among those there, knocking on doors for her, was Illinois State Rep. Kam Buckner. He says the mayor can be an effective voice for her.\n\n“I think the role in the history and the journey of Black men in this country is a very specific and nuanced one. And as we, folks like myself and the mayor and the Attorney General Kwame Raoul are having these conversations with other Black men that we can speak directly to that experience, and I know he will,” Johnson said.\n\nWith former President Donald Trump gaining some ground among Black men, the Harris campaign is concerned about losing any support, and some of the reluctance to back her is, perhaps, connected to feelings about former President Barack Obama.\n\n“I think they’re disappointed and disillusioned and they feel that the Democratic Party in general has let them down and if an African American president, the first African American president couldn’t change that, why can we why can we expect it from a second?” said ABC7 Political Analyst Laura Washington.\n\nBut Johnson plans to remind those Detroit churchgoers on Sunday that Harris is their best bet.\n\n“What I would say, specifically to Black men, is what I’ve been saying, is that it’s our responsibility to provide, to prepare, to protect our democracy,” Johnson said.","summary":"CHICAGO (WLS) &#8212; Chicago Mayor Brandon Johnson has already campaigned for Vice&#8230;","url":"https://internewscast.com/news/us/chicago-mayor-brandon-johnson-to-support-vice-president-kamala-harris-in-detroit-michigan-before-2024-election/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Chicago-Mayor-Brandon-Johnson-to-campaign-for-800x430.jpg","video":null,"publish_date":"2024-10-18 22:17:21","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":260252214,"title":"Trump, Harris Odds of Winning in Every Recent Major Poll With 17 Days Left","text":"As the 2024 presidential race enters its final stretch, recent polls indicate momentum for former President Donald Trump in his contest against Vice President Kamala Harris. Trump has maintained strong polling numbers for two consecutive weeks, benefiting from favorable trends.With Election Day rapidly approaching, both campaigns are working to win over the remaining undecided voters in crucial battleground states, where polling data shows an exceptionally tight race.This week, the campaigns employed distinct strategies to sway these voters. Harris' team ramped up its media presence, investing heavily in digital and TV ads in key battlegrounds, appearing on Charlamagne tha God's podcast to court Black voters, and securing a rare solo interview with Fox News' Bret Baier.The vice president concluded the week campaigning in Michigan, making stops in Grand Rapids before hosting events in Lansing and Oakland County, near Detroit.Meanwhile, Trump had a media blitz, participating in interviews with friendly media outlets while avoiding less favorable ones. This week, he attended a pre-taped women-only town hall with Fox host Harris Faulkner, followed by a Hispanic town hall with Univision.On Thursday, he had a sit-down with Fox & Friends co-host Lawrence Jones at a Bronx barber shop, met with the Wall Street Journal editorial board, and gave a video interview with George \"Tyrus\" Murdoch for OutKick. He also spoke at the Al Smith charity dinner.On Friday, he appeared on Fox & Friends, joined The Dan Bongino Show, and taped an interview with wrestler Mark Calaway before heading to Michigan.Emerson College Poll (October 14-16)A new poll by Emerson College, conducted from October 14 to 16 among 1,000 likely voters, shows the race is in a dead heat. Harris holds a slim lead with 50 percent of the vote, while Trump follows closely with 49 percent. This near-even split reflects a highly polarized electorate, with both candidates working to win over undecided voters in the critical final weeks.Fairleigh Dickinson University Poll (October 8-14)A poll from Fairleigh Dickinson University, conducted from October 8 to 14 with 755 likely voters, shows Harris leading by 3 points, with 50 percent support compared to Trump's 47 percent. While Harris maintains a steady lead, the poll highlights Trump's resilience in retaining his core supporters. In this poll, the simple sampling error for 806 registered voters is +/-3.5 percentage points.Fox News Poll (October 11-14)In contrast, a Fox News poll conducted by Beacon Research/Shaw & Company Research from October 11 to 14 among 870 likely voters shows Trump leading by 2 points, with 50 percent support compared to Harris's 48 percent. This represents a notable shift toward Trump, reflecting growing momentum in key regions. The gains suggest that Trump's campaign efforts in swing states may be proving effective as he narrows the gap with Harris. This poll has a margin of sampling error of +/- 3 percentage points.The Trump momentumOn Friday, Nate Silver's popular forecast confirmed the momentum shifting toward Trump, noting that his chances of winning are at their highest since August. The updated model reflected several strong polling numbers in Trump's favor in crucial swing states like Wisconsin, Michigan, and Pennsylvania.Silver's latest projections show Trump holding a slight edge in the Electoral College, with a 50.2 percent chance of winning, compared to Harris' 49.5 percent — despite Harris having a 75 percent chance of winning the popular vote.While FiveThirtyEight's simulations also favor Trump, the model gives him a 52 out of 100 chance of winning, compared to Harris's 48 out of 100.","summary":"Donald Trump has sustained strong polling numbers for two consecutive weeks, buoyed by favorable surveys.","url":"https://www.newsweek.com/trump-harris-odds-winning-every-recent-major-poll-17-days-left-1971531","image":"https://d.newsweek.com/en/full/2499269/donald-trump-kamala-harris.jpg","video":null,"publish_date":"2024-10-18 22:16:58","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","source_country":"US","sentiment":0.048},{"id":260252508,"title":"Cuba without power as national grid shuts down","text":"Cuba’s national power grid shut down on Friday, leaving around 10 million people on the island without electricity.\n\nCuban President Miguel Diaz-Canel said officials were giving “absolute priority” to fixing the problem.\n\n“There will be no rest until it is restored,” he added.\n\nThe government on the island closed schools and “non-essential” industrial sites on Friday morning in a last-ditch effort to preserve supplies.\n\nBut shortly before midday, the Antonio Guiteras power plant – one of Cuba’s biggest – went offline, causing a total grid failure.\n\nOfficials did not go into details about what caused the shutdown or say how long it might take to get the site back online.\n\nAll “non-vital” government services, along with schools and universities, are expected to remain closed until at least Sunday. Cultural and recreational sites, including nightclubs, have also been ordered to shut.\n\nHowever, not everyone on the island has been left without power.\n\nSome homes and businesses, such as restaurants, have private generators.\n\nThe US’s Guantanamo Bay naval base, on the island’s southeastern coast, is also thought to be unaffected because it has its own power supply.\n\nIt comes following rolling power cuts across the country in recent weeks.\n\nCuban Prime Minister Manuel Marrero said on Thursday the issues had been caused by a combination of infrastructure problems, fuel shortages and rising demand, including from household air conditioning units.\n\n“The fuel shortage is the biggest factor,” he said in a televised address.\n\nResidents in Havana interviewed by Sky News’ US partner NBC News expressed dismay at the latest outage.\n\nOne man told the broadcaster: “This is incredible. I don’t see a solution to this problem.”\n\nA woman added: “It really worries me that we may not yet be at the bottom of this electricity crisis.”\n\nBrazilian tourist Carlos Roberto Julio also expressed frustration.\n\nHe told news agency Reuters: “We went to a restaurant and they had no food because there was no power, now we are also without internet.\n\n“In two days, we have already had several problems.”\n\nRead more from Sky News:Hamas confirms death of leaderFather and daughter driven to suicide by ‘catfish’UK braces for Storm Ashley\n\nOfficials said strong winds from Hurricane Milton last week had hampered efforts by boats to deliver fuel needed to run its power plants.\n\nA US trade embargo, along with sanctions introduced by former president Donald Trump, has also been blamed for reducing supplies of fuel and spare parts needed to repair machinery in Cuba’s power plants.\n\nPresident Diaz-Canel said in a statement earlier this week: “The complex scenario we are going through has its main cause in the intensification of the economic war and financial and energy persecution by the United States, which makes it difficult to import fuel and other resources necessary for this industry.”\n\nThe White House has hit back at the claims. A US national security council spokesperson said: “The United States is not to blame for today’s blackout on the island or the overall energy situation in Cuba.”\n\nCuba’s largest oil supplier, Venezuela, has added to the problems by reducing shipments to the island this year as it grapples with its own shortages.\n\nRussia and Mexico have also significantly reduced supplies to the Caribbean country.","summary":"Cuba&#8217;s national power grid shut down on Friday, leaving around 10 million people on the island without electricity. Cuban President Miguel Diaz-Canel said officials were giving &#8220;absolute priority&#8221; to fixing the problem. &#8220;There will be no rest until it is restored,&#8221; he added. Image: A man at his home in Matanzas, Cuba, during a power &#8230;\n\n\nThe post Cuba without power as national grid shuts down appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/cuba-without-power-as-national-grid-shuts-down/","image":"https://e3.365dm.com/24/10/1600x900/skynews-cuba-blackout-power-cut_6720259.jpg?20241018211441","video":null,"publish_date":"2024-10-18 22:15:17","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.237},{"id":260252594,"title":"Not even ‘Fox and Friends’ can hide Trump’s dementia","text":"Some of Donald Trump’s highly visible supporters seem concerned that their man is losing his mind and everyone can see it.\n\nThe former president was scheduled for an early-morning interview today, a regular thing for a presidential candidate. It was even more regular for someone like Trump. The show was “Fox and Friends.”\n\nBut to hear them tell it, it was unbelievable!\n\n\"He never stops,\" one said. \"It is really amazing.\" \n\n“The GOAT [greatest of all time] is a machine!” another said. \n\n“This man is on a MISSION!” one said. \n\nSame one asked: “How does he do it?” \n\nAnother said Trump has “unreal stamina!” \n\nYet another nearly gave the game away: \n\n“Dude is in his late 70s and out-working people half his age.”\n\nIn truth, there’s nothing out-of-the-ordinary about a candidate staying out late the night before and showing up for work early the next day. \n\nThat’s called running for president. \n\nBut you might be motivated to make the ordinary seem extraordinary if you are worried about the candidate’s mental health. Fact is, Trump’s state of mind has deteriorated dramatically since the start of the week, when he swayed and bopped on stage to music for 39 minutes, as if he’d temporarily forgotten that he was campaigning for president. \n\nThat’s when you hype even harder. \n\nDude is out-working people half his age!\n\nUnfortunately, for his rightwing supporters, the “Fox and Friends” interview didn’t go well. Like other media he did this week, it badly exposed what I’m calling his deepening descent into dementia. \n\nAaron Rupar posted the whole thing, but here’s what stood out:\n\nHe revealed without meaning to that “a couple of people at Fox” wrote some of the “jokes” he told at last night’s Al Smith Dinner.He failed to pick up on a cue from a co-host. He was supposed to say that he’d love to have Nikki Haley stump for him in the hopes of winning over Republicans who voted for her in the GOP primary. Instead, he talked about how “badly he beat her.”He gave up trying to keep track of the conversation when he started talking about “the old days.” Back then, he said, there were “no negative ads” on Fox. I think he meant ads promoting his Democratic opponent Kamala Harris, but I’m not sure. I’m not sure anyone else on “the curvy couch” was sure either.Co-host Brian Kilmeade seemed to realize Trump was losing his mind on live TV, so he scrambled to cover up for him by bringing up “the weave.” In reality, the weave is when Trump flits from one thing to another, without any apparent reason for doing so. By referring to his dementia as “the weave,” Kilmeade tried making a mental disability look like a clever rhetorical device.\n\nThe weirdest moment was when he responded to a child’s question about his favorite farm animal. Trump said he loves cows. But, he added, “if we go with Kamala, we won’t have any cows anymore.” \n\nThis was met with laughter, but his face seemed to register confusion, as if to ask: why are these people laughing? So he said it again, seeming to ensure that they knew he wasn’t joking. “According to Kamala, who’s a radical-left lunatic, we won't have any cows anymore.” \n\nThere was less laughing the second time.\n\nIt was so bad that one of his maga-bros felt the urge to cheerlead even louder than usual. Trump was “sharp, tactful, encouraging, presidential,” with special stress on “sharp” and “encouraging,” as if his conspicuous mental deterioration threatens to dampen enthusiasm. \n\nHis campaign seems to understand what a conservative pundit said recently – “the more Trump speaks, the more Americans are reminded of his deficiencies as a candidate, both in character and coherence.” So his staff has canceled previously planned appearances with “60 Minutes,” CNBC, NBC and smaller media outlets. Trump won’t do a second debate with Harris. His campaign pulled out of an NRA rally. \n\nThis morning, Politicocited two people familiar with conversations between the Trump campaign and The Shade Room, a podcast popular with young, Black professionals. Harris made an appearance there recently. Talks fell apart, however, according to Politico. “A Trump adviser told The Shade Room producers that Trump was ‘exhausted and refusing [some] interviews but that could change’ at any time.”\n\n“Exhaustion” is probably the most common euphemism for mental health issues used by celebrities and other highly visible people. In Trump’s case, the issue is pretty clearly some form of dementia. The condition runs in his family. His dad died of Alzheimer’s. Trump often says he “aced” two cognitive tests, but he’s known to have dictated his medical reports to his doctors when he was president. Harris released her health records before blasting Trump for not releasing his. \n\nIndeed, the Harris campaign has bird-dogged the topic of Trump’s mental decline for weeks. On Tuesday, spokesman Ian Sams told CNN: “I’m not entirely sure what [the weave] is besides rambling and meandering. So it does raise the real question of ‘are you fit for the job? Are you up to the task?’ This is a very serious moment in a very serious time for our country. And you think about the decisions that a president has to make. Are you physically capable of doing it?”\n\nTrump’s campaign denies he’s “exhausted.” A spokesperson told Politico that he’s “running laps around” Harris. Even so, his staff is clearly concerned about voters viewing Trump in the same way that they viewed Joe Biden after the June debate between them. His people are trying to minimize his exposure by restricting him to friendly media.\n\nBut Trump still has to perform well, no matter how friendly the media. As today’s “Fox and Friends” segment showed, he can’t do even that.","summary":"Some of Donald Trump’s highly visible supporters seem concerned that their man is losing his mind and everyone can see it.\n\nThe former president was scheduled for an early-morning interview today, a regular thing for a presidential candidate. It was even more regular for someone like Trump. The show was “Fox and Friends.”\n\nBut to hear them tell it, it was unbelievable!\n\n\"He never stops,\" one said. \"It is really amazing.\" \n\n“The GOAT [greatest of all time] is a machine!” another said. \n\n“This man is on a MISSION!” one said. \n\nSame one asked: “How does he do it?” \n\nAnother said Trump has “unreal stamina!” \n\nYet another nearly gave the game away: \n\n“Dude is in his late 70s and out-working people half his age.”\n\nIn truth, there’s nothing out-of-the-ordinary about a candidate staying out late the night before and showing up for work early the next day. \n\nThat’s called running for president. \n\nBut you might be motivated to make the ordinary seem extraordinary if you are worried about the candidate’s mental health. ","url":"https://www.alternet.org/alternet-exclusives/trump-fox-friends/","image":"https://www.alternet.org/media-library/image.png?id=53836334&width=1200&height=600&coordinates=0%2C99%2C0%2C99","video":null,"publish_date":"2024-10-18 22:15:14","author":"John Stoehr","authors":["John Stoehr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.14},{"id":260252334,"title":"Elon Musk and Marjorie Taylor Greene risk Dominion’s wrath with revived conspiracy theories","text":"More than a year after the company reached a record-breaking settlement with Fox News over similar claims, Elon Musk promoted a debunked conspiracy theory that suggested Dominion Voting Systems had manipulated the outcome of the 2020 election.\n\nDuring a town hall in Pennsylvania to promote Donald Trump’s campaign on Thursday, the world’s wealthiest man rattled off a series of false claims about elections, including alluding to a conspiracy theory that Dominion was part of a plot to rig the election against Trump.\n\n“When you have mail-in ballots and no proof of citizenship, it’s almost impossible to prove cheating,” he said. “Statistically there are some very strange things that happen that are statistically incredibly unlikely. There’s always this question of, say, the Dominion voting machines. It is weird that, I think, they were used in Philadelphia and in Maricopa County [Arizona] but not in a lot of other places. Doesn’t that seem like a heck of a coincidence?”\n\nHe added that “the last thing I would do is trust a computer program.”\n\nThe following day, Republican congresswoman Marjorie Taylor Greene of Georgia claimed that a Dominion machine “changed” a voter’s ballot in her district. Early voting in the state started this week.\n\n“It had switched,” she told conspiracy theory-fuelled media network InfoWars on Friday.\n\n“They had to start over, and they went through it several times, and it kept on making the same error. Kept on switching the votes. And so this is something we’re just starting to look into today … We will be following up.”\n\nThe Indepedent has requested comment from Dominion.\n\nLast year, Fox News agreed to settle a defamation lawsuit from Dominion that accused the network of spreading false statements about its business in the aftermath of the 2020 presidential election. The network settled for more than $787 million, marking the largest-ever settlement of its kind in American history.\n\nDominion has also filed lawsuits against former Trump-allied attorneys Rudy Giuliani and Sidney Powell and election conspiracy theorists Mike Lindell and Patrick Byrne, as well as right-wing media networks One America News and Newsmax, over similarly false statements about the company.\n\nA Dominion spokesperson refuted Musk’s statements: “Fact: Dominion does not serve Philadelphia County. Fact: Dominion’s voting systems are already based on voter verified paper ballots. Fact: Hand counts and audits of such paper ballots have repeatedly proven that Dominion machines produce accurate results. These are not matters of opinion. They are verifiable facts.”\n\nElection officials, courts and Trump’s own administration and campaign have failed to produce any evidence of widespread election fraud. Musk’s suggestion that Dominion produced irregularities in Arizona and Pennsylvania — two states that Trump lost in 2020 — is also not grounded in reality; election officials from both parties have repeatedly verified the results in those states, and the company’s machines were not even used in Philadelphia.\n\nThe persistent false narrative that Trump lost the 2020 election due to fraud also fuels his 2024 campaign. At least 14 of the 82 state electors chosen to represent the Republican Party this year are tied to “fake elector” schemes in several states. Some are currently under criminal prosecution. Another 16 falsely believe President Joe Biden only won because of widespread fraud.","summary":"Fox News reached a mammoth settlement with Dominion Voting Systems over the company’s defamation claims","url":"https://www.independent.co.uk/news/world/americas/us-politics/elon-musk-dominion-marjorie-taylor-greene-b2631928.html","image":"https://static.independent.co.uk/2024/10/18/22/2179030530.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/VYEKpXJ8-4VHSaSK0.mp4","publish_date":"2024-10-18 22:11:44","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","source_country":"gb","sentiment":-0.373}]}