{"offset":0,"number":50,"available":10190,"news":[{"id":372849144,"title":"Trump official drops hammer on Newsom after 'illegal' migrant trucker was involved in deadly crash","text":"Sean Duffy is threatening revoke California's ability to give out commercial drivers licenses and remove $160 million in federal funding after three people died in a horrific highway crash that was allegedly caused by an illegal migrant. \n\nTransportation Secretary said he was fed up with Gavin Newsom allowing illegal migrants to be granted licenses, and indicated he has plans to penalize him.\n\n'I'm about to pull $160 million from California and as we pull more money, we also have the option of pulling California's ability to issue commercial driver's licenses,' he told Fox Business on Sunday. \n\nThe penalty will be issued for Newsom's refusal to comply with an order sent out by Duffy on September 26 which gave him 30 days to get the license situation in order. \n\n'Newsom cares more about illegals getting CDLs than he does the citizens of his own state,' he said. \n\nDuffy was discussing the Department of Transport's (DOT) report on a licensed illegal immigrant who is accused of killing three people when he slammed his truck into halted traffic on Tuesday afternoon.\n\nHe said that Newsom's attitude toward requests for review had been completely ignored. \n\n'Gavin Newsom has thumbed his nose at us, he has refused to comply with the rules that have come from DOT which is: stop issuing these licenses and go back and review all the licenses that you have issued and make sure its been done legally,' Duffy said. \n\nThe Daily Mail has reached out to a spokesperson for Governor Newsom for comment. \n\nNewsom previously claimed that Duffy is trying to play politics over the incident.\n\n'This is a tragic situation and as with every tragedy over the last ten months, Secretary [Kristi] Noem has ordered Secretary Duffy to look for every opportunity to manipulate the facts to score cheap political points, but the FEDERAL government needs to look within before they cast blame outside.' \n\nHe instead blamed the federal government for having 'approved and renewed this individual's FEDERAL employment authorization multiple times – which allowed him to obtain a commercial driver's license in accordance with FEDERAL law.'\n\nHowever, Newsom did spend part of his Sunday looking to take shots at the transportation secretary. \n\nThe governor responded to a report of staffing shortages at Southern California airports due to the government shutdown in Washington.\n\n'Hell of a job, Secretary Duffy. Can’t wait to see what you do with NASA,' Newsom's press office wrote.\n\nA DOT audit revealed that one in four CDLs were 'issued improperly' and demanded California pause their program as a response to the incident earlier this week. \n\nPolice have identified the driver in Tuesday's tragedy as 21-year-old Jashanpreet Singh from Yuba City, California. \n\nHe was arrested at the scene for being under the influence of drugs and vehicular manslaughter, according to KTLA.\n\nThree people, including a Pomona High School basketball coach and his wife, died. \n\nFour others were taken to local hospitals to be treated for their injuries. \n\nSingh is an undocumented immigrant from India who was caught and released at the California border in 2022. \n\nMelugin reported on X that ICE placed a detainer request on Singh, which would allow the San Bernardino County Sheriff's office to hold him passed the normal release time.\n\nThe suspect has been booked into West Valley Detention Center in Rancho Cucamonga to await charges. \n\nThe fight between Duffy and Newsom is just the latest between the liberal California governor and the Trump administration, as Newsom admitted Sunday morning he has his aims on Donald Trump's job.\n\nWhen asked if he was seriously considering a campaign for the White House, Newsom said: 'Yeah, I'd be lying otherwise. I'd just be lying. And I can't do that.'\n\nIt's the clearest indication thus far that the firebrand Democrat, and staunch political enemy of the Trump administration, has his eyes on the Oval Office in 2028. \n\nNewsom spoke to CBS News Sunday Morning about his ambitions, but continued to shy away from fully committing himself to the liberal ticket for the next election.\n\nThe governor is no stranger to the political spotlight - and has used his voice to heavily critique Trump since his inauguration earlier this year.\n\nRecently, Newsom's social media team has desperately tried to troll the president by mimicking his online style.","summary":"Secretary Duffy said he was fed up with Newsom's dismissive attitude toward the Trump administration over the licenses and had plans to penalize him.","url":"https://www.dailymail.co.uk/news/article-15229309/Sean-Duffy-Gavin-Newsom-threatens-strip-California.html","image":"https://i.dailymail.co.uk/1s/2025/10/27/00/103333111-0-image-m-15_1761525548447.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/10/23/4269237403021914378/1024x576_MP4_4269237403021914378.mp4","publish_date":"2025-10-27 01:25:34","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.241},{"id":372848348,"title":"US, China Near Trade Deal Ahead of Trump-Xi Meet","text":"KUALA LUMPUR: A trade deal between the United States and China is drawing closer, officials from the world’s two largest economies said Sunday as they reached an initial consensus for President Donald Trump and Chinese leader Xi Jinping to aim to finalize during their high-stakes meeting. Any agreement would be a relief to international markets even if it does not address underlying issues involving manufacturing imbalances and access to state-of-the-art computer chips. Beijing recently limited exports of rare earth elements that are needed for advanced technologies, and Trump responded by threatening additional tariffs on Chinese products. The prospect of a widening conflict risked weakening economic growth worldwide . China’s top trade negotiator, Li Chenggang, told reporters the two sides had reached a “preliminary consensus,\" while Trump's treasury secretary, Scott Bessent, said there was “a very successful framework.\" Trump also expressed confidence that an agreement was at hand, saying the Chinese \"want to make a deal and we want to make a deal.” The Republican president is set to meet with Xi on Thursday in South Korea, the final stop of his trip through Asia. Bessent told CBS’ “Face the Nation” that the threat of additional higher tariffs on China was “effectively off the table.” In interviews on several American news shows, he said discussions with China yielded initial agreements to stop the precursor chemicals for fentanyl from coming into the U.S., and that Beijing would make “substantial” purchases of soybean and other agricultural products while putting off export controls on rare earths. When asked how close a deal was, Trump’s trade representative, Jamieson Greer, said on “Fox News Sunday” that “it’s really going to depend” on the two presidents. Meanwhile, Trump reiterated that he plans to visit China in the future and suggested that Xi could come to Washington or Mar-a-Lago, Trump’s private club in Florida. The progress toward a potential agreement came during the annual summit of the Association of Southeast Asian Nations , in Kuala Lumpur, with Trump seeking to burnish his reputation as an international dealmaker. Yet his way of pursuing deals has meant serious disruptions at home and abroad. His import taxes have scrambled relationships with trading partners while a U.S. government shutdown has him feuding with Democrats. Trump attends ceasefire ceremony between Thailand and Cambodia At the summit, Thailand and Cambodia signed an expanded ceasefire agreement during a ceremony attended by Trump. His threats of economic pressure prodded the two nations to halt skirmishes along their disputed border earlier this year. Thailand will release Cambodian prisoners and Cambodia will begin withdrawing heavy artillery as part of the first phase of the deal. Regional observers will monitor the situation to ensure fighting doesn't restart. “We did something that a lot of people said couldn’t be done,\" Trump said. Cambodian Prime Minister Hun Manet called it a “historic day,” and Thai Prime Minister Anutin Charnvirakul said the agreement creates “the building blocks for a lasting peace.” The president signed economic frameworks with Cambodia, Thailand and Malaysia, some of them aimed at increasing trade involving critical minerals. The United States wants to rely less on China, which has used limits on exports of key components in technology manufacturing as a bargaining chip in trade talks. “It’s very important that we cooperate as willing partners with each other to ensure that we can have smooth supply chains, secure supply chains, for the quality of life, for our people and security,” Greer said. Trump reengages with a key region of the world Trump attended this summit only once during his first term, and U.S. Defense Secretary Pete Hegseth seemed unfamiliar with ASEAN during his confirmation hearing in January. This year's event was a chance for Trump to reengage with nations that have a combined $3.8 trillion economy and 680 million people. “The United States is with you 100%, and we intend to be a strong partner and friend for many generations to come,\" Trump said. He described his counterparts as “spectacular leaders” and said that “everything you touch turns to gold.” Trump's tariff threats were credited with helping spur negotiations between Thailand and Cambodia. Some of the worst modern fighting between the two countries took place over five days in July, killing dozens and displacing hundreds of thousands of people. The president threatened, at the time, to withhold trade agreements unless the fighting...","summary":"Beijing recently limited exports of rare earth elements that are needed for advanced technologies, and Trump responded by threatening additional tariffs on Chinese products","url":"https://www.deccanchronicle.com/world/us-china-near-trade-deal-ahead-of-trump-xi-meet-1912794","image":"https://www.deccanchronicle.com/h-upload/2025/10/27/1971515-aa-5820800.webp","video":null,"publish_date":"2025-10-27 01:07:36","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.255},{"id":372847906,"title":"Monday Cable – October 27, 2025","text":"One year has passed since Georgia’s October 26, 2024, parliamentary elections, which handed the ruling Georgian Dream party a much-disputed victory. On Sunday evening, a larger-than-usual crowd marched in protest from Tbilisi’s Republic Square to the Parliament building, where opposition leaders and Georgia’s fifth president, Salome Zurabishvili, addressed those who continue to reject the government’s legitimacy. \n\nAfter one year, demonstrators continue to demand the government’s resignation through a fair rerun of the vote, and the release of those they consider politically imprisoned. Over the past year, Georgian Dream has struggled to gain the domestic and international legitimacy it sought, with Parliament remaining one-party and the presidency still held by a GD-elected figure picked by that parliament. Meanwhile, the opposition remains unable to present a clear program and coherent alternative. The political deadlock remains, while repression, arrests, and persistent street protests continue.\n\nProtest arrests skyrocket: We estimate that more than 100 people have been arrested over the past week for blocking the road and wearing masks during daily rallies on Tbilisi’s Rustaveli Avenue. Almost all protest-related arrests have resulted in the maximum 14 days of administrative detention. Everyone has been sent behind bars, including critical journalists and foreigners. The detentions are carried out under new rules that came into force ten days ago, replacing fines with immediate administrative detention for such offenses, while repeated violations now constitute a criminal offense. This means that those who leave prison and are arrested again for “artificially” blocking the road when the authorities deem the number of protesters is too small to block traffic will face up to one year in prison. That’s what we are bracing for in the coming days, as Georgian Dream seems determined to end the Rustaveli rallies. \n\nOne More Arrested Under Criminal Charges: During the tense protest rally on October 22, where police snatched dozens of protesters from the sidewalks on Rustaveli Avenue, Tamar Lortkipanidze, a woman who briefly climbed onto the roof of a police car, was among those detained. While authorities initially described her actions as “hooliganism,” she was soon charged with the harsher criminal offenses of “attacking a police officer’s vehicle” and “violence,” placed in pretrial detention, and faces up to seven years in prison. \n\nSeven Charged for Obstructing Pro-GD Press: Seven people have been charged with “unlawful interference with a journalist’s professional activities,” a criminal offense, over incidents of election-day unrest on October 4, involving reporters from pro-government TV channels Imedi and Rustavi 2, as well as the similarly government-leaning Public Broadcaster.\n\n Garibashvili Released on Bail: While face masks were carefully zipped up as evidence and Rustaveli Avenue unblocked by arrests, Georgia’s former Prime Minister Irakli Garibashvili, once one of Bidzina Ivanishvili’s closest allies, has been indicted on serious money-laundering charges, as authorities confirmed what corruption watchdogs have long alleged — that the former GD strongman declared wealth far beyond what could be legally obtained. Garibashvili, who “fully cooperated” with the investigation targeting him and several former high-ranking GD officials, “admitted to receiving illicit income over the years.” Yet, he walked free from court after being granted bail of GEL 1 million. His passport was seized, and he has been prohibited from leaving the country. As part of the same investigation, authorities arrested two associates of former State Security Service chief Grigol Liluashvili.\n\nIn Other Arrests and Convictions…The State Security Service arrested three Chinese citizens for attempting to purchase two kilograms of uranium and transport it to China via Russia. Meanwhile, the court sentenced former riot police officer Gela Udzilauri to life in prison after finding him guilty of the intentional and contract killing of businessman Levan Jangveladze - a mysterious high-profile case involving a criminal underworld figure and possibly Georgia’s former Prosecutor General, the sanctioned Otar Partskhaladze.\n\nGakharia Ends Boycott: The Georgian Dream parliament will, at least formally, no longer be one-party, as former and exiled Prime Minister Giorgi Gakharia’s opposition For Georgia party has ended its parliamentary boycott and is set to take up its 12 seats. One on the list has reportedly refused and quit the party. Read details here. \n\nKallas Hints at Targeted Visa-Free Suspension: EU foreign policy chief Kaja Kallas said the new rules allowing visa-free travel suspensions for third countries may apply only to “some groups” in Georgia, raising hopes among some that the entire population will not be penalized for the government’s authoritarian drift. Read more here. \n\nTbilisi Hosted Fifth Silk Road Forum: Tbilisi hosted the biennial Silk Road Forum for the fifth time. The forum, under the theme “Invest in Connectivity – Grow in Stability,” was opened by PM Irakli Kobakhidze and was attended, among others, by Armenian PM Nikol Pashinyan and Azerbaijani PM Ali Asadov. The Asian Development Bank, an official partner, apparently isn't bothered by GD's shaky democratic credentials. Read more here. \n\nWorld Honors Mzia Again: After receiving the EU’s Sakharov Prize for Freedom of Thought, jailed journalist and founder of the online media outlets Batumelebi and Netgazeti, Mzia Amaghlobeli, has also been named by the International Press Institute (IPI) as one of this year’s World Press Freedom Heroes, alongside six other journalists.\n\nSpeaking of the press: A new report by ISFED showed that the ruling party funnels millions to loyal online media outlets, while Georgian Dream’s flagship Imedi TV once again attacked the European Commission, alleging an illegal scheme that bypasses FARA to fund local NGOs it claims are behind the anti-government protests.\n\nInternational Reports\n\nRussian Oil Arrives at Georgia’s New Kulevi Refinery: Reuters reported that Russia’s Russneft delivered the first shipment of crude oil to Georgia’s newly built Kulevi refinery on the Black Sea coast. The refinery, operated by Black Sea Petroleum, a company founded by Georgian businesswoman Maka Asatian, is valued at around $600–700 million and co-financed by the state-run Georgian Fund for Development. The project, promoted by the government as a strategic step toward energy security, was launched in October 2024 near the Kulevi terminal, with PM Irakli Kobakhidze attending the opening ceremony.\n\nA follow-up investigation by Russian outlet Agentstvo revealed that Asatiani’s family maintains extensive business ties in Russia. Her son, Kakhaber Zhordania, previously owned the Russian oil-trading firm Oil Energy Group and now co-owns a logistics company, SDO-Logistic, with Sergei Alekseev, the son of Lieutenant General Vladimir Alekseev, First Deputy Chief of Russia’s military intelligence service (GRU). The investigation noted that Alekseev Jr. formerly worked for Russneft, the very company supplying oil to the Georgian refinery.\n\nThe investigation further reported that Alekseev Jr. also co-founded a business in southern Russia with Syrian national Mohammad Jaber, known as the leader of the pro-Assad militia Desert Falcons, which guarded oil sites during the Syrian war. While these links have not been independently verified, the report raises concerns over the network of interests surrounding Georgia’s first refinery and its proximity to figures within Russia’s intelligence and wartime oil operations. Georgian officials, meanwhile, insist that the refinery operates in full compliance with national law and does not source oil from sanctioned entities.\n\nGD Lobbies in the U.S.: Reuters also reported that Steve Nicandros, co-founder of the Texas-based oil company Frontera Resources, which years ago was locked in a legal dispute with the Georgian Dream government, is now lobbying U.S. lawmakers against a bill that would prohibit the U.S. government from recognizing Georgian Dream as legitimate. Read more here. \n\nGerman Media Reports on Georgian Deportees: Several German media outlets reported over the weekend that Georgians made up the second-largest group of deportees from Germany during the first nine months of this year. Deutsche Welle also said that Germany recently deported family members of Zelimkhan Khangoshvili, a Georgian citizen of Chechen descent who was assassinated in Berlin in 2019 by a Russian hitman.\n\nWhat to Expect:\n\nOpposition-Banning Constitutional Appeal: Although Georgian Dream had promised to submit its appeal to the Constitutional Court seeking to ban opposition parties by the end of last week, the document has not yet been published. With the GD-elected President having just appointed a new judge to the Court following another’s resignation, the appeal is now highly expected to be released any day.\n\nFrom Civil.ge's Archives:\n\nAs Georgia was emerging from the election shock last year, Civil.ge published a Monster piece: “October 27, 2024, was one of the hardest mornings for many Georgians to wake up to. November 6 wasn’t any easier. Just as the pro-Western segment of the country was piecing together the evidence of the alleged scheme behind the shock victory of the Georgian Dream, figuring out the next steps, and searching within itself for the strength to continue the struggle, the re-election of Donald Trump in the United States plunged the country into a whole new level of uncertainty. The hard question now is what it takes to save democracy in one country when democratic values are under threat elsewhere. A bigger question, however, is whether democracy will remain our main focus at all.” Read the full Dispatch here.\n\nVisual Stories\n\nGeorgia's fifth President, Salome Zurabishvili, among protesters on Tbilisi's Rustaveli Avenue near Parliament, October 26, 2025; Photo: Konstantin Hadzi-Vukovic","summary":"One year has passed since Georgia’s October 26, 2024, parliamentary elections, which handed the ruling Georgian Dream party a much-disputed victory. On Sunday evening, a larger-than-usual crowd marched in protest from Tbilisi’s Republic Square to the Parliament building, where opposition leaders and Georgia’s fifth president, Salome Zurabishvili, addressed those who continue to reject the government’s &#8230;","url":"https://civil.ge/archives/708261","image":"https://civil.ge/wp-content/uploads/2025/07/The-Cable.png","video":null,"publish_date":"2025-10-27 01:00:00","author":"Civil.ge","authors":["Civil.ge"],"language":"en","source_country":"ge","sentiment":-0.579},{"id":372849140,"title":"How Anthony Albanese is now channelling TRUMP after meeting the US President","text":"How Anthony Albanese is now channelling TRUMP after meeting the US President\n\nAlbanese slams 'fake media' narratives\n\nREAD MORE: Dick Smith issues urgent warning about Australia\n\nBy NICHOLAS COMINO, NEWS REPORTER, AUSTRALIA\n\nPublished: 00:54 GMT, 27 October 2025 | Updated: 00:59 GMT, 27 October 2025\n\nAnthony Albanese returned to Australia following his meeting with Donald Trump sounding very much like the US President, slamming the news media as 'fake'.\n\nThe Prime Minister took a series of Trump-style swipes at the media when he was asked about fresh comments by Trump regarding Australian ambassador to the US, Kevin Rudd, on Sunday.\n\nOn Weekend Today, Albanese was asked if he was considering replacing Rudd, giving a blunt answer.\n\n'No,' he said.\n\n'And frankly, it says more about the journo … who asks the question more than anything else. I was in the room. It was fine.'\n\nAlbanese continued to slam the press, accusing journalists of chasing 'fake media' narratives and ignoring the real achievements from his trip, echoing Trump's own war on 'fake news.'\n\nFresh from his high-profile White House visit, Albanese insisted his relationship with Trump was 'very strong' and described the talks as an 'enormous success.'\n\nTrump, who once branded Rudd someone he 'didn't like and probably never will', appeared to bury the hatchet during the summit, reportedly telling the ambassador 'all is forgiven.'\n\nAlbanese (right) channelled Trump (left) while backing Rudd attacking 'fake media' narratives\n\nHowever, as he departed for Asia late Friday, the President made a fresh jab at Rudd. \n\n'I think he said a long time ago something bad. You know, when they say bad about me, I don't forget,' Trump said.\n\nBefore his diplomatic posting, Rudd had called Trump 'a traitor to the West' and 'the most destructive president in history,' remarks that were later deleted from his social media. \n\nHis four-year term as ambassador runs until March 2027. \n\nThe Prime Minister's combative tone raised eyebrows, given Labor's previous attacks on Peter Dutton's Coalition for embracing 'Trump-style politics.' \n\nDuring the election, Albanese's team accused the opposition of importing US-style division, yet here was the PM borrowing from Trump's playbook, railing against the media and dismissing uncomfortable questions.\n\n'What was important was the issues of substance. That's what I'm focused on,' Albanese told Weekend Sunrise, adding that Trump's response was unsurprising given the 'leading question' he was asked.\n\nDonald Trump on Friday said that he wouldn't 'forget' about Rudd's negative comments\n\nDuring the visit, Albanese and Trump struck a major critical minerals deal aimed at breaking China's grip on rare earth supply chains. \n\nThe framework promises billions in investment and faster approvals for joint projects, alongside renewed U.S. backing for the AUKUS nuclear submarine pact.\n\nAlbanese hailed the agreement as a cornerstone of his 'Future Made in Australia' strategy, while Trump boasted of 'months of work' to secure vital materials for defence and technology industries.\n\nOpposition Deputy Leader Sussan Ley had initially demanded Rudd's sacking, calling his position 'untenable.' \n\nBut after the summit won bipartisan praise, she softened her stance, conceding the ambassador had played a key role in delivering the minerals deal.\n\nAlbanese and Trump are now in Kuala Lumpur for the Association of Southeast Asian Nations (ASEAN) Summit. \n\nOn Wednesday, the Prime Minister will travel to Gyeongju, South Korea, for the Asia-Pacific Economic Cooperation (APEC) Forum, where a high-stakes meeting between Trump and Chinese President Xi Jinping is expected, with hopes of easing escalating trade tensions.\n\nAnthony Albanese\n\nShare or comment on this article:\nHow Anthony Albanese is now channelling TRUMP after meeting the US President\n\nAdd comment","summary":"Anthony Albanese has been accused of invoking Donald Trump, as he doubles down on his defence of Kevin Rudd's US ambassadorship.","url":"https://www.dailymail.co.uk/news/article-15229357/Albanese-trump.html","image":"https://i.dailymail.co.uk/1s/2025/10/27/00/103334721-0-image-a-11_1761526026644.jpg","video":null,"publish_date":"2025-10-27 00:59:50","author":"Editor,Nicholas Comino","authors":["Editor","Nicholas Comino"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.157},{"id":372846584,"title":"Vladimir Putin unveils 'tiny flying Chernobyl' nuclear missile","text":"Oct. 26 (UPI) -- Russian President Vladimir Putin said the country has tested a new, nuclear-capable missile and is preparing to deploy it.\n\nPutin's military maneuver comes just after a planned meeting with President Donald Trump collapsed.\n\nThe weapon runs on nuclear power, which makes it capable of flying much further than other missiles, according to the Kremlin, and is able to evade missile detection and defense systems.\n\n\"This is a unique product that no one in the world has, Putin, dressed in military fatigues, said during a meeting with military commanders, according to a video posted by the Kremlin. \"We need to identify potential uses and begin preparing the infrastructure for deploying this weapon in our armed forces.\"\n\nValery V. Gerasimov, general staff of the Russian armed forces, said the missile had remained in flight for 15 hours and traveled 8,700 miles during testing.\n\n\"It is a tiny flying Chernobyl,\" Gerasimov said during a briefing, referring to a nuclear power plant in Ukraine that became widely known for a catastrophic explosion in 1986.\n\nThe missile, known as the SSC-X-9, has been in development for years, and while Putin's announcement was not a surprise, nuclear experts say it is a bad turn of events.\n\n\"This is a bad development,\" said Jeffrey Lewis, a nuclear nonproliferation expert at Middlebury College. \"It is one more science fiction weapon that is going to be destabilizing and hard to address in arms control.\"\n\nPutin's announcement of the missile revives the back and forth between the United States and Russia over nuclear arms, but the first action since President Donald Trump took office in January.\n\nIt is the latest in a long series of volleys over nuclear arms between the two countries stretching back decades.","summary":"Russian President Vladimir Putin said the country has tested a new, nuclear-capable missile and is preparing to deploy it. ","url":"https://www.upi.com/Top_News/World-News/2025/10/26/puting-announces-tiny-flying-chernobyl/4941761526208/","image":"https://cdnph.upi.com/sv/ph/og/upi/4941761526208/2025/1/8518ba998f115d68438c2a5bffb279a3/v1.5/Vladimir-Putin-unveils-tiny-flying-Chernobyl-nuclear-missile.jpg","video":null,"publish_date":"2025-10-27 00:57:33","author":"Mark Moran","authors":["Mark Moran"],"language":"en","category":"politics","source_country":"us","sentiment":-0.078},{"id":372848372,"title":"Jon Stewart Wants to Stay at ‘Daily Show’ Past December Contract – if It’s up to Him","text":"Jon Stewart says he’s not ready to leave “The Daily Show” after his contract expires in December, and is actively working on an extension with Comedy Central – which now falls under David Ellison’s Skydance Media.\n\n“We’re working on staying,” Stewart said in a conversation with New Yorker editor David Remnick, according to THR.\n\nStewart left the late-night Comedy Central show in 2015, but returned in early 2024 to host its Monday editions. Since then, Comedy Central parent Paramount Global merged with Skydance, just days after Stewart’s former “Daily Show” colleague Stephen Colbert’s show at CBS – also a Paramount property – was told it was being sunsetted next year.\n\nThat announcement came shortly after Colbert criticized Paramount for a $16 million settlement with Donald Trump over the edited “60 Minutes” interview with Kamala Harris. \n\nDuring the Sunday conversation, Stewart jokingly referred to Ellison, now CEO of the combined company, as his “new boss,” THR reported.\n\nStewart has openly questioned on “The Daily Show” whether Colbert’s cancellation, and the suspension of Jimmy Kimmel over at ABC, were politically motivated. Stewart’s contract discussions with Comedy Central are ongoing.","summary":"\"We're working on staying\" to host Monday nights, Stewart said Sunday at the New Yorker Festival\n\n\nThe post Jon Stewart Wants to Stay at &#8216;Daily Show&#8217; Past December Contract – if It&#8217;s up to Him appeared first on TheWrap.","url":"https://www.thewrap.com/jon-stewart-stay-daily-show-comedy-central-paramount-skydance-david-ellison/","image":"https://www.thewrap.com/wp-content/uploads/2025/10/stew.jpg","video":null,"publish_date":"2025-10-27 00:48:29","author":"Josh Dickey","authors":["Josh Dickey"],"language":"en","category":"politics","source_country":"US","sentiment":-0.357},{"id":372848876,"title":"Much at stake during Trump’s Asia visit","text":"It is not just the US but three other capitals in Asia which are hoping that President Donald Trump’s visit to the region proceeds smoothly so that each one of the major actors can claim that their objectives were met. The challenges are such that no one is willing to declare victory in advance. After much haggling Washington finally said that the President will be travelling to Malaysia, the sticking point being the peace deal between Thailand and Cambodia which Trump was supposed to preside over. Still there is no final word if Bangkok and Phnom Penh have arrived at a pact.\n\nPresident Trump will only be the third American leader to visit Malaysia after Lyndon Johnson and Barack Obama, and it will be his second attendance at an ASEAN summit, an event that will see the presence of leaders from China, Japan, South Korea, Brazil, South Africa, Canada, Australia and New Zealand as well. It will be interesting to see how Trump interacts — if he chooses to at all — with the Prime Minister of Canada and the Brazilian President. He cancelled ongoing trade negotiations with Ottawa, citing false advertising, using former President Ronald Reagan’s statement on tariffs and trade; and Luiz Inacio Lula da Silva wants Washington to scale down the high tariffs on Brazilian imports.\n\nFocus on APEC\n\nBut the Malaysia summit may not be top priority for the Trump administration, which is fervently working on the meeting between the US President and President Xi Jinping of China, scheduled on October 30 on the sidelines of the Leaders meet of the Asia Pacific Economic Cooperation forum in South Korea. In the aftermath of Beijing’s squeeze on rare earths and Washington’s response of additional 100 per cent tariffs on Chinese products, the two sides are looking at a full-fledged tariff war unless the Trump-Xi meeting substantially lowers the temperature. It is in this scenario that top US trade and treasury officials are set to meet Chinese Premier Li Qiang in Malaysia.\n\n“This is one of the riskiest trips any president of the United States has taken. The Chinese Communist Party has declared open economic warfare against America, so this is what they call a throw of the ‘iron dice.’ This is as high stakes as it gets”, Steve Bannon, Trump’s former White House chief strategist has been quoted in Politico. The argument has been that President Trump has to calm not only anxious farmers in Republican states who are seeing much of their soybeans still unsold, but also American consumers looking at a lighter wallet in the upcoming holiday season.\n\nBut China alone isn’t the focus of attention at the APEC. South Korea and its newly elected President are also looking at a trade pact with the US, even as critics question Seoul’s commitment to invest $350 billion in the US. They are also questioning why its auto industry gets slapped 25 per cent tariffs while its counterparts in Europe and Japan face lower rates.\n\nIn addition to Malaysia and South Korea, President Trump is due to visit Tokyo for talks with the newly elected Prime Minister of Japan, Sanae Takaichi. On the surface her hawkish stance may be appealing to President Trump. But even without the domestic baggage of ultra-conservatism Premier Takaichi has raised her eyebrows on the trade deal struck by her predecessor, especially the $550 billion Japanese investment in America. Advancing by five years the commitment to spend 2 per cent of GDP on defence may not be quite appealing to Washington, which still sees Tokyo in the “free riders” category. All this is not to rule out some unexpected excitement by way of a repeat of the 2019 event on the DMZ with the leader of North Korea, Kim Jong Un.\n\nThe writer is a senior journalist who has reported from Washington DC on North America and United Nations\n\nPublished on October 27, 2025","summary":"Meeting with Chinese, South Korean and Japanese leaders is particularly significant for resolving pending trade issues","url":"https://www.thehindubusinessline.com/opinion/much-at-stake-during-trumps-asia-visit/article70205794.ece","image":"https://bl-i.thgim.com/public/incoming/vv8f9w/article70205793.ece/alternates/LANDSCAPE_1200/2025-10-26T035522Z_2118226494_RC2EJHANWCYL_RTRMADP_3_ASEAN-SUMMIT-TRUMP.JPG","video":null,"publish_date":"2025-10-27 00:45:00","author":"Sridhar","authors":["Sridhar"],"language":"en","category":"politics","source_country":"in","sentiment":0.308},{"id":372843626,"title":"Beware Democrats’ election skullduggery in a key NJ gov-race county","text":"When criminals plan to steal something — whether jewels from the Louvre or a New Jersey election — they last thing they want around is a security camera.\n\nThat seems the likeliest explanation for this month’s decision by the Democratic-controlled Passaic County, NJ, Board of Elections to ban cameras for ballot storage areas in next month’s gubernatorial election.\n\nAnd for its refusal to enforce sign-in and sign-out logs for people who access mail-in ballots.\n\nState GOP Chairman Glenn Paulsen rightly calls this blatant preparation to steal the vote nothing short of “alarming.”\n\nWhy else, after all, would the board — whose chairman, John Currie, also happens to be head of the county’s Democratic Party — not want extra security measures that could make it harder to rig voting and boost public confidence that the election was fair?\n\nEspecially given Passaic’s history of voter irregularities.\n\nDemocrats must fear the race for governor between ex-Assemblyman Jack Ciattarelli (R) and Rep. Mikie Sherrill (D) is simply too close to leave up to voters.\n\nFor good reason: Ciattarelli steadily whittled down Sherrill’s lead in the polls, with a Quantas Insights Poll this month putting him just 3.3 points behind — well within the margin of error.\n\nAnd the Democratic National Committee has been desperately pouring in cash to save Sherrill, with another infusion last week to push the total past $3 million.\n\nHeavily populated Passaic is a key swing county: President Donald Trump lost there by 16.6 percentage points in 2020, but won by three last year. \n\nIt could well decide Jersey’s next governor.\n\nNo wonder Garden State GOPers are begging the Justice Department to send monitors to oversee the election — or, at least, the vote-by-mail ballots.\n\nAttorney General Pam Bondi: Your duty calls.\n\nAfter the 2020 COVID election, when more than 90% of Jersey voters mailed in their ballots, prosecutors uncovered numerous stinks in Passaic.\n\nThey slapped ex-Paterson City Council President Alex Mendez, Councilman Michael Jackson and other officials with a host of charges, including election fraud, unauthorized ballot possession, forgery and tampering with public records.\n\nVoters needs assurances that this year’s critical vote will be fair.\n\nIf Democrats can’t agree to that, why trust them at all?","summary":"There's an obvious reason the Democratic-controlled Board of Elections in pivotial Passaic County are refusing to all security cameras for ballot storage areas in next month’s gubernatorial election.","url":"https://nypost.com/2025/10/26/opinion/beware-of-jersey-democrats-election-tricks-in-passaic-in-the-race-for-governor/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/mikie-sherrill-greets-people-end-114129846_0e3fce-e1761524710468.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-27 00:33:30","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.562},{"id":372843008,"title":"ELDER: White Democrats ‘will not vote for Black candidates,’ says NAACP","text":"Article content\n\nThe Supreme Court is considering a Louisiana redistricting case that could have a greater impact on U.S House of Representatives seats than the Texas and California “gerrymandering” manoeuvres combined.\n\nThe New York Times wrote, “Democrats would be in danger of losing around a dozen majority-minority districts across the South if the court struck down part of the Voting Rights Act.”\n\nWhite House Deputy Chief of Staff Stephen Miller tweeted, “How many people just realized that Dems had as many as 20 extra seats based on years of unconstitutional race-based gerrymandering?”\n\nFor the purpose of “racial justice” under the Voting Rights Act, Democrat legislatures and politicians created several “majority-minority” districts in order to elect Black and Hispanic congressional members. The Supreme Court will rule on whether these districts violate equal protection under the Constitution.\n\nACLU Voting Rights Project Director Sophia Lin Lakin, who supports these majority-minority districts, said: “Sec. 2 of the Voting Rights Act has been a critical tool in safeguarding the promise that people of colour can participate in our democracy on equal terms. It has been our shield against discriminatory maps and our answer to laws designed to suppress the vote. Congress passed the Voting Rights Act with overwhelming, bipartisan support — and reauthorized it again and again — because our leaders understood a fundamental truth: you cannot cure discrimination by pretending it doesn’t exist.”\n\nNAACP lawyer Janai Nelson told the court, “It was clear that, regardless of party, white Democrats were not voting for Black candidates whether they were Democrats or not. We know that there is such a significant chasm between how Black and white voters vote in Louisiana that there is no question that even if there is some correlation between race and party, that race is the driving factor.”\n\nThe Supreme Court decades ago in Shaw v. Reno (1993) and Miller v. Johnson (1995) ruled against districts where gerrymandering by race was the dominant factor. “Ethnic cleansing!” cried Jesse Jackson after the Miller decision. Elaine Jones of the NAACP Legal Defense Fund said, “The noose is tightening.” Her colleague, Theodore Shaw, warned that once this decision goes through, the Black Congressional Caucus “could meet in the back seat of a taxicab.” But of the Black House members in the four redesigned majority-white Southern districts who decided to run for reelection, three won. One chose not to run.\n\nIn 2016, the city of over 100,000 population that most voted for Donald Trump, with 80% of the vote, was Abilene, Texas, a city that is over 75% white. Shortly after Trump’s election, Abilene voted for its first Black mayor. Black Rep. Byron Donalds (R-Fla.) recently said: “Myself, Wesley Hunt, Burgess Owens, John James — we are all Black men who represent majority-white districts (referring to Texas, Utah, and Michigan, respectively.) Tim Scott is the United States senator from South Carolina. South Carolina does have a strong Black population, but it’s a predominantly white state. These are the facts.” America’s three largest cities, New York, Los Angeles and Chicago, all have Black mayors though none of these cities is majority Black. There are many examples of Blacks elected to statewide offices in a country where no state has a majority Black population. These include Sens. Barack Obama, Kamala Harris, Carol Moseley Braun and Cory Booker, as well as Govs. Doug Wilder, Deval Patrick and Wes Moore.\n\nAbout the 2008 presidential election, Obama’s principal rival for the Democratic nomination was Hillary Clinton. Obama was attempting to become the first Black president, while Clinton was attempting to become the first female president. On the Republican side, the two primary rivals were Mitt Romney, who would become the first Mormon president, and John McCain, who would become at 72 the oldest elected president. In February 2007, Gallup found that 5% of Americans said they “would not vote for” a Black presidential candidate; 11% “would not vote for” a woman; 24% “would not vote for” a Mormon; and 42% “would not vote for” a presidential candidate who is “72 years of age.” So, Obama’s hurdle was the lowest.\n\nAs for the Supreme Court, Rep. Alexandria Ocasio-Cortez (D-N.Y.) calls Republican-appointed jurists “often underqualified or completely unqualified for their role.”\n\nNothing says qualified quite like a bartender-turned-congressional candidate. And AOC got elected, proving yet again that despite America’s “systemic racism,” there’s hope.\n\n— Larry Elder is a bestselling U.S. author and nationally syndicated radio talk-show host.\n\n Share this Story : ELDER: White Democrats 'will not vote for Black candidates,' says NAACP Copy Link Email X Reddit Pinterest LinkedIn Tumblr","summary":"The Supreme Court is considering a Louisiana redistricting case that could have a greater impact on U.S House of Representatives seats than the Texas and California &#8220;gerrymandering&#8221; manoeuvres combined. The New York Times wrote, &#8220;Democrats would be in danger of losing around a dozen majority-minority districts across the South if the court struck down part [&#8230;]","url":"https://torontosun.com/opinion/columnists/elder-white-democrats-vote-black-candidates-naacp","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/10/Janai-Nelson-NAACP-Oct15.jpg?quality=100&strip=all","video":null,"publish_date":"2025-10-27 00:22:25","author":"Larry Elder,Spiro Papuckoski","authors":["Larry Elder","Spiro Papuckoski"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.096},{"id":372846386,"title":"US sees opportunity to expand strategic ties with Pakistan","text":"Secretary of State Marco Rubio has said that the US sees an opportunity to expand its strategic relationship with Pakistan and that the recent strengthening of ties between the two countries does not come at the expense of Washington’s relationship with New Delhi.\n\nHe made these remarks during a press briefing on Saturday, during which he was asked whether India had raised any concerns about the “stronger relationship” between the US and Pakistan.\n\n“They really haven’t – I mean, we know they’re concerned for obvious reasons because of the tensions that have existed between Pakistan and India historically. But, I think they have to understand, we have to have relations with a lot of different countries,” he said, according to a transcript of the briefing on the State Department’s website.\n\nHe continued, “We see an opportunity to expand our strategic relationship with Pakistan, and I think we’ve made – that’s our job, is to try to figure out how many countries we can find how we can work with on things of common interest.\n\n“So, I think the Indians are very mature when it comes to diplomacy and things of that nature. Look, they have some relationships with countries that we don’t have relationships with. So, it’s part of a mature, pragmatic foreign policy. I don’t think anything we’re doing with Pakistan comes at the expense of our relationship or friendship with India, which is deep, historic, and important.”\n\nRubio was also asked whether the recent improvement in ties between the US and Pakistan was based on Islamabad’s “recognition of the US role and President [Donald Trump’s] role in resolving and in avoiding potential war between India and Pakistan?”\n\n“What do you think was the turning point?” a reporter asked him, according to the transcript on the State Department’s website.\n\nTo that, Rubio began his response with, “I think they appreciated.”\n\nHe then went on to say that “anytime you work with someone, you get to know them and you interact with them, and so I do think there was some sense of happiness about it. But even before that conflict had started, I had already reached out to them and said look, we are interested in rebuilding an alliance, a strategic partnership with you. We think there are things we can work together with them on”.\n\nThe secretary of state reiterated that the US was “fully aware of the challenges with regards to India and everything else, but our job is to try to create opportunities for partnerships with countries where it’s possible. And we’ve had a long history of partnering with Pakistan on counterterror and things of that nature. We’d like to expand it beyond that, if possible, understanding that there’ll be some difficulties and some challenges”.\n\nSeparately, US President Donald Trump said on Sunday that he would get the conflict between Pakistan and Afghanistan “solved very quickly”, calling Prime Minister Shehbaz Sharif and COAS Field Marshal Asim Munir “great people”.\n\nAddressing the border dispute on the sidelines of an ASEAN summit, Trump referred to it as “one of eight wars that my administration has ended in just eight months”.\n\n“We’re averaging one a month. There’s only one left,” he said. “Although I heard that Pakistan and Afghanistan have started up, but I’ll get that solved very quickly.”\n\nHe added, “I know them both … the Pakistan field marshal and the prime minister are great people, and I know we’re gonna get that done quickly. That one started up a few days ago.”\n\nReferring to his own role in halting wars around the world, the US president said, “I just feel it’s something I can do. I do it nicely.\n\n“I don’t need to do it, I guess,” he added. “But if I can take time and save millions of lives, that’s really a great thing. I can’t think of anything better to do.”\n\nTrump had previously thanked both Shehbaz and “my favourite” Munir for their efforts in securing the ceasefire deal in Gaza, while Shehbaz praised Trump’s “exemplary [and] visionary leadership” and reconfirmed Pakistan’s plan to nominate him for the Nobel Peace Prize 2026.\n\nWhen the fighting broke out between Pakistan and Afghanistan, the US president was quick to express interest in assisting with establishing peace, although he was at the time occupied with overseeing a hostage exchange between Hamas and Israel.\n\n“I said, ‘I’ll have to wait till I get back. I am doing another one,'” he told reporters at the time. “Because I’m good at solving wars, I’m good at making peace, and it is an honour to do it.”","summary":"Secretary of State Marco Rubio has said that the US sees an opportunity to expand its strategic relationship with Pakistan and that the recent strengthening of ties between the two countries does not come at the expense of Washington&#8217;s relationship with New Delhi. He made these remarks during a press briefing on Saturday, during which [&#8230;]","url":"https://dailytimes.com.pk/1390274/us-sees-opportunity-to-expand-strategic-ties-with-pakistan/","image":"https://dailytimes.com.pk/assets/uploads/2025/10/WhatsApp-Image-2025-10-26-at-9.55.jpg","video":null,"publish_date":"2025-10-27 00:21:22","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","source_country":"pk","sentiment":0.145},{"id":372844928,"title":"US and China agree on trade framework ahead of leaders’ meeting","text":"KUALA LUMPUR: Top Chinese and US economic officials agreed on the framework for a trade agreement on Sunday as US President Donald Trump said he was confident of hashing out a deal with Chinese President Xi Jinping when they meet in the coming days. \n\nUS Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer met with Chinese Vice Premier He Lifeng and top trade negotiator Li Chenggang on the sidelines of the ASEAN summit in Kuala Lumpur for a fifth round of in-person discussions since May. \n\n“I think we have a very successful framework for the leaders to discuss on Thursday,” Bessent told reporters. \n\nBessent told NBC’s “Meet the Press” that he anticipated the agreement would defer China’s expanded export controls on rare earth minerals and magnets and avoid a new 100% US tariff on Chinese goods threatened by Trump. \n\nHe said Trump and Xi would discuss soybean and agricultural purchases from American farmers, more balanced trade and resolving the US fentanyl crisis, which was the basis of 20% US tariffs on Chinese goods. \n\nChina’s Li said both sides had reached a “preliminary consensus” and will next go through their respective internal approval processes. \n\n“The US position has been tough,” Li said. “We have experienced very intense consultations and engaged in constructive exchanges in exploring solutions and arrangements to address these concerns.” \n\nTrump arrived in Malaysia on Sunday for a summit of the Association of Southeast Asian Nations, his first stop in a five-day Asia tour that is expected to culminate in a face-to-face with Xi in South Korea on October 30. \n\nAfter the talks, he struck a positive tone, saying: “I think we’re going to have a deal with China”. \n\nBoth sides are looking to avert an escalation of their trade war after Trump threatened new 100% tariffs on Chinese goods and other trade curbs starting on November 1, in retaliation for China’s expanded export controls on rare earth magnets and minerals. \n\nBeijing and Washington rolled back most of their triple-digit tariffs on each other’s goods under a trade truce, which is due to expire on November 10. \n\nThe US and Chinese officials said they discussed trade expansion, an extension of the truce, fentanyl, US port entrance fees, rare earths, TikTok and more. \n\nLi described the discussions as “candid”, while Bessent said they were “very substantial negotiations”. \n\nBessent said the truce could be extended, pending the president’s decision, marking a second extension since it was first signed in May. \n\nWhile the White House has officially announced the highly anticipated Trump-Xi talks, Beijing has yet to confirm that the two leaders will meet. \n\nOn the sidelines of the ASEAN Summit, Trump hinted at possible meetings with Xi in China and the United States. \n\n“We’ve agreed to meet. We’re going to meet them later in China, and we’re going to meet in the US, in either Washington or at Mar-a-Lago,” he said. \n\nAmong Trump’s talking points with Xi are Chinese purchases of US soybeans, concerns around democratically-governed Taiwan which Beijing views as its own territory, and the release of jailed Hong Kong media tycoon Jimmy Lai. \n\nThe detention of the founder of the now-defunct pro-democracy newspaper Apple Daily has become the most high-profile example of China’s crackdown on rights in Hong Kong. \n\nTrump also said that he would seek China’s help in Washington’s dealings with Russia, as Moscow’s war in Ukraine grinds on.","summary":"KUALA LUMPUR: Top Chinese and US economic officials agreed on the framework for a trade agreement on Sunday as US President Donald Trump said he was confident of hashing out a deal with Chinese President Xi Jinping when they meet in the coming days. \n\n\n\nUS Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer met with Chinese Vice Premier He Lifeng and top trade negotiator Li Chenggang on the sidelines of the ASEAN summit in Kuala Lumpur for a fifth round of in-person discussions since May. \n\n\n\n“I think we have a very successful framework for the leaders to discuss on Thursday,” Bessent told reporters. \n\n\n\nBessent told NBC’s “Meet the Press” that he anticipated the agreement would defer China’s expanded export controls on rare earth minerals and magnets and avoid a new 100% US tariff on Chinese goods threatened by Trump. \n\n\n\nHe said Trump and Xi would discuss soybean and agricultural purchases from American farmers, more balanced trade and resolving the US fentanyl crisis, which was the bas","url":"https://www.brecorder.com/news/40389330/us-and-china-agree-on-trade-framework-ahead-of-leaders-meeting","image":"https://i.brecorder.com/large/2025/10/68fe964aaecd5.jpg","video":null,"publish_date":"2025-10-27 00:16:52","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.106},{"id":372844908,"title":"Long-shot socialist Mamdani in touching distance of becoming NY mayor","text":"NEW YORK: An unknown local lawmaker just a few months ago, leftist Zohran Mamdani has burst onto New York’s political scene and is closing in on becoming the first Muslim mayor of America’s most populous city.\n\nSince his surprise victory in the Democratic Party primary in June, New Yorkers have become used to seeing his bearded, smiling face on television — and on badges proudly worn by his young supporters. \n\nThe 34-year-old election frontrunner was born in Uganda to a family of Indian origin and has lived in the United States since he was seven, becoming a naturalized US citizen in 2018. \n\nHe is the son of filmmaker Mira Nair (“Monsoon Wedding,” “Salaam Bombay!”) and Mahmood Mamdani, a professor and respected Africa expert — leading some of his detractors to call him a “nepo baby.” \n\nHe followed a path trodden by other youngsters from elite liberal families, attending the elite Bronx High School of Science followed by Bowdoin College in Maine, a university seen as a bastion of progressive thought.\n\nUnder the alias “Young Cardamom,” he ventured into the world of rap in 2015, influenced by hip-hop outfit “Das Racist” made up of two members of Indian origin who played with references and tropes from the subcontinent.\n\nMamdani’s attempt to break into the competitive world of professional music did not last, with the performer-turned-politician calling himself a second-rate artist. \n\nHe was bitten by the politics bug when he learned that rapper Heems (Himanshu Suri) was supporting a candidate for city council — and joined that campaign as an activist.\n\nMamdani went on to become a foreclosure prevention counselor, helping financially struggling homeowners avoid losing their homes. \n\nHe was elected in 2018 as a lawmaker from Queens, a melting pot of predominantly poor and migrant communities, representing the area in the New York State Assembly. \n\n‘Disaffected voters’ \n\nThe self-proclaimed socialist, who has been re-elected three times, forged an image that has become his trademark — a progressive Muslim just as comfortable at a Pride march as he is at an Eid banquet.\n\nHe has put the goal of making the city affordable for everyone who are not wealthy, the majority of its approximately 8.5 million residents, at the heart of his campaign. \n\nHe has promised more rent control, free day care and buses, and city-run neighborhood grocery stores. \n\nMamdani is also a long-standing supporter of the Palestinian cause, although his positions on Israel — which he has called an “apartheid regime” while branding the war in Gaza a “genocide” — have drawn the ire of some in the Jewish community. \n\nIn recent months he has made a point of vocally denouncing antisemitism. \n\nMamdani has attracted scorn from President Donald Trump, who calls him a “little communist” but — like the president — he is something of an establishment “outsider,” according to Costas Panagopoulos, a political science professor at Northeastern University. \n\n“He has managed to galvanize support from disaffected voters and others in New York City who are dissatisfied with the status quo and with an establishment that they perceive to be overlooking their needs and policy preferences,” he said.\n\nMamdani, a keen soccer and cricket fan, recently married US illustrator Rama Duwaji, and put his experience of activism to work in a strategically coordinated canvassing and leafleting campaign that he has paired with a massive and often humorous use of social media. \n\n“He really is a kind of an hybrid of a great 1970s campaign and a great 2025 campaign,” said Lincoln Mitchell, a Columbia University professor.","summary":"NEW YORK: An unknown local lawmaker just a few months ago, leftist Zohran Mamdani has burst onto New York’s political scene and is closing in on becoming the first Muslim mayor of America’s most populous city.\n\n\n\nSince his surprise victory in the Democratic Party primary in June, New Yorkers have become used to seeing his bearded, smiling face on television — and on badges proudly worn by his young supporters. \n\n\n\nThe 34-year-old election frontrunner was born in Uganda to a family of Indian origin and has lived in the United States since he was seven, becoming a naturalized US citizen in 2018. \n\n\n\nHe is the son of filmmaker Mira Nair (“Monsoon Wedding,” “Salaam Bombay!”) and Mahmood Mamdani, a professor and respected Africa expert — leading some of his detractors to call him a “nepo baby.” \n\n\n\nHe followed a path trodden by other youngsters from elite liberal families, attending the elite Bronx High School of Science followed by Bowdoin College in Maine, a university seen as a bastion of progressive thought.\n\n","url":"https://www.brecorder.com/news/40389334/long-shot-socialist-mamdani-in-touching-distance-of-becoming-ny-mayor","image":"https://i.brecorder.com/large/2025/10/68fe977d9c85a.jpg","video":null,"publish_date":"2025-10-27 00:16:52","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":0.278},{"id":372844892,"title":"Trump says increasing tariffs on Canada by 10pc","text":"ABOARD AIR FORCE ONE: US President Donald Trump said Saturday he was hiking tariffs on Canadian goods by an additional 10 percent, in the latest fallout over a Canadian anti-tariff ad that featured late US leader Ronald Reagan. \n\nThe announcement came two days after Trump said he had terminated all trade talks with Canada over what he called the “fake” ad campaign.\n\n“Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD,” Trump said on his Truth Social platform, posting the message as he flew to Asia for meetings with key regional leaders.\n\n“Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10 percent over and above what they are paying now,” he said.","summary":"ABOARD AIR FORCE ONE: US President Donald Trump said Saturday he was hiking tariffs on Canadian goods by an additional 10 percent, in the latest fallout over a Canadian anti-tariff ad that featured late US leader Ronald Reagan. \n\n\n\nThe announcement came two days after Trump said he had terminated all trade talks with Canada over what he called the “fake” ad campaign.\n\n\n\n“Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD,” Trump said on his Truth Social platform, posting the message as he flew to Asia for meetings with key regional leaders.\n\n\n\n“Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10 percent over and above what they are paying now,” he said.","url":"https://www.brecorder.com/news/40389331/trump-says-increasing-tariffs-on-canada-by-10pc","image":"https://i.brecorder.com/large/2025/10/68fe9697259f4.jpg","video":null,"publish_date":"2025-10-27 00:16:52","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":-0.243},{"id":372844922,"title":"Fed will likely cut again despite economic murkiness from shutdown","text":"WASHINGTON: The Federal Reserve is expected to announce its second rate cut of the year on Wednesday, despite a lack of clarity over the health of the US economy due to the ongoing government shutdown.\n\nThe US central bank’s second-to-last rate meeting of the year is taking place against the backdrop of a weeks-long standoff between Republicans and Democrats over healthcare subsidies, resulting in the ceased publication of almost all official data. \n\nWithout these key insights into the US economy, Fed officials will be forced to set interest rates without the full spectrum of data they normally rely upon. \n\nAnalysts and traders expect the bank will plough ahead with a quarter percentage-point cut, lowering its key lending rate to between 3.75 percent and 4.00 percent, without giving too much away about the final rate cut of the year in December.\n\nThe lack of official information complicates the ongoing debate at the Fed over whether to cut rates swiftly in order to support the weakening labor market, or to stand firm in the face of inflation which remains stuck stubbornly above the bank’s long-term target of two percent, fueled by Donald Trump’s sweeping tariffs on top trading partners.","summary":"WASHINGTON: The Federal Reserve is expected to announce its second rate cut of the year on Wednesday, despite a lack of clarity over the health of the US economy due to the ongoing government shutdown.\n\n\n\nThe US central bank’s second-to-last rate meeting of the year is taking place against the backdrop of a weeks-long standoff between Republicans and Democrats over healthcare subsidies, resulting in the ceased publication of almost all official data. \n\n\n\nWithout these key insights into the US economy, Fed officials will be forced to set interest rates without the full spectrum of data they normally rely upon.  \n\n\n\nAnalysts and traders expect the bank will plough ahead with a quarter percentage-point cut, lowering its key lending rate to between 3.75 percent and 4.00 percent, without giving too much away about the final rate cut of the year in December.\n\n\n\nThe lack of official information complicates the ongoing debate at the Fed over whether to cut rates swiftly in order to support the weakening labor market,","url":"https://www.brecorder.com/news/40389340/fed-will-likely-cut-again-despite-economic-murkiness-from-shutdown","image":"https://i.brecorder.com/large/2025/10/68fe9a377fee4.jpg","video":null,"publish_date":"2025-10-27 00:16:52","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":-0.012},{"id":372843628,"title":"Arnold Schwarzenegger slams Gavin Newsom’s claim that California’s redistricting is ‘temporary’","text":"Former California Gov. Arnold Schwarzenegger dismissed current Gov. Gavin Newsom’s argument that the proposed redistricting in the state was temporary, calling the notion “total fantasy.”\n\n“I think when he — when they say this is temporary, there is no such thing. I mean, the longest programs are government programs that are temporary. Okay, just remember that if this is a tax program or if it is the redistricting program, anything that is temporary with government is permanent,” he told CNN’s Jake Tapper on “State of the Union,” responding to a clip of Newsom touting his Proposition 50 legislation that would reshape congressional seats.\n\nVoting opened last week to add as many as five Democrat-held seats in Congress, which could possibly offset President Donald Trump’s moves in Texas and elsewhere to help Republicans in the 2026 election. Obama endorsed Prop 50 this week.\n\n“In the year 2032 when the independent redistricting commission is supposed to come back, they‘re going to say, ‘Wait a minute. There‘s still gerrymandering going on in Texas. There‘s still gerrymandering going on in Ohio. There‘s still gerrymandering going on in Florida. We have to continue with gerrymandering.’ This is what‘s going to happen. They will find an excuse. So therefore I don‘t think it is temporary. So that‘s total fantasy,” Schwarzenegger said.\n\nNewsom issued a response to those who oppose Proposition 50 and said, “Spare me the moral high ground.”\n\nSchwarzenegger called the redistricting efforts cheating, and said Democrats needed to outperform Trump.\n\n“What the Democrats should do is they should outperform Trump. To me, it‘s all about competition creates performance. And so what they do is with the redistricting commission is that they‘re going to go and try to draw the district lines in such a way that they get voted in, no matter if they work well or not for the American people. So the American people get cheated on this whole thing. That is really the problem here,” he said.\n\nThe former Republican California governor said that he understood Republicans and Democrats needed to “fight” about it, but argued that Americans were being cheated.\n\n“I think that if you want to really fight for democracy, why would you go in, destroy the Constitution in California, tear it up and redo it, do the whole thing? So to me, it just doesn‘t make any sense at all,” he added.\n\nSchwarzenegger has come out against the redistricting efforts in a post on social media, where he posted a photo of himself at the gym wearing a t-shirt that read “terminate gerrymandering.”\n\nThe former governor also told CNN that he and Newsom were friendly and spoke about the issue. Schwarzenegger said they’ve been speaking out about it without attacking one another.","summary":"Arnold Schwarzenegger rejects Newsom's claim that California's redistricting is temporary.","url":"https://nypost.com/2025/10/26/us-news/arnold-schwarzenegger-dismisses-newsom-argument-that-redistricting-effort-is-temporary-as-total-fantasy/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/114264168.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/tuytEuTf-RyIcpnTz.mp4","publish_date":"2025-10-27 00:15:52","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"zm","sentiment":-0.558},{"id":372842164,"title":"Diplomasi ASEAN diteruskan dengan lima sidang kemuncak utama hari ini","text":"KUALA LUMPUR: Diplomasi ASEAN di arena global diteruskan hari ini dengan lima sidang kemuncak utama. \n\nSidang-sidang kemuncak berkenaan adalah seperti berikut: \n\n• Sidang Kemuncak ASEAN–Republik Korea ke-26 \n\n• Sidang Kemuncak ASEAN Plus Three ke-28 \n\n• Sidang Kemuncak Regional Comprehensive Economic Partnership (RCEP) ke 5 \n\n• Sidang Kemuncak Asia Timur ke-20 \n\n• Sidang Kemuncak ASEAN-Pertubuhan Bangsa-Bangsa Bersatu ke-15 \n\nMenurut Setiausaha Akhbar Kanan kepada Perdana Menteri, Tunku Nashrul Abaidah, Sidang-Sidang Kemuncak hari ini akan memberi tumpuan kepada pengukuhan kerjasama ekonomi serantau, transformasi digital, peralihan tenaga bersih dan ketahanan rantaian bekalan — menegaskan bahawa ASEAN bukan sekadar pusat pertumbuhan, tetapi juga pemacu kestabilan dan keseimbangan strategik di rantau Indo-Pasifik. \n\nSelain itu, YAB Perdana Menteri juga dijangka mengadakan beberapa pertemuan dengan rakan pimpinan lain dan mengakhiri hari kedua Sidang Kemuncak ASEAN dengan penganjuran Majlis Makan Malam Gala ASEAN bersama para pemimpin ASEAN dan rakan-rakan dialog. \n\n\"Insya-Allah, dengan momentum yang telah dibina, Malaysia akan terus menggalas amanah kepimpinan serantau dengan tekad dan keyakinan, memperkukuh perpaduan ASEAN serta memacu kerjasama yang membawa manfaat kepada seluruh rantau,\" katanya. \n\nMenurutnya, semalam, hari pertama Sidang Kemuncak ASEAN ke-47 dan Sidang Sidang berkaitan berjalan dengan lancar, dan telah mencatat detik bersejarah buat Malaysia dan ASEAN. \n\nKita menyaksikan lahirnya lembaran baharu apabila Timor-Leste secara rasminya diterima sebagai Negara Anggota ASEAN ke-11 — melengkapkan keluarga Asia Tenggara yang bersatu dan berdaulat. \n\n\"Semalam, kita telah mendengar ucapan dasar daripada Perdana Menteri, Datuk Seri Anwar Ibrahim sewaktu Majlis Perasmian Sidang Kemuncak ASEAN ke-47, di mana beliau menegaskan bahawa Malaysia telah memimpin ASEAN untuk kekal bersatu, relevan dan berpaksikan rakyat. \n\n\"Penyertaan rasmi Timor-Leste ini bukan sekadar simbol diplomasi, tetapi hasil keteguhan Malaysia yang sejak sekian lama menyokong penyertaan negara tersebut ke dalam ASEAN melalui latihan, bantuan teknikal dan pengukuhan kapasiti,\" katanya. \n\nDiplomasi Keamanan – Perjanjian Perdamaian Kuala Lumpur, semalam juga mencatat sebuah lagi sejarah apabila Perjanjian Perdamaian Kuala Lumpur antara Thailand dan Kemboja berjaya ditandatangani dengan disaksikan oleh Perdana Menteri dan Presiden Donald Trump. \n\nPerjanjian ini menjadi titik tolak kepada berakhirnya pertikaian antara kedua-dua negara — sebuah kejayaan yang berakar daripada rundingan damai yang dimulakan oleh Perdana Menteri pada Julai lalu. \n\nLangkah ini menandakan kesediaan kedua-dua negara untuk menghentikan peperangan, membebaskan tawanan, dan membenarkan pemerhati ASEAN termasuk Malaysia menilai pelaksanaan damai di lapangan, tambahnya. \n\nSeperti kelaziman penganjuran Sidang Kemuncak ASEAN, Perdana Menteri semalam telah mempengerusikan lima Sidang Kemuncak termasuk: \n\n• Sidang Kemuncak Asean ke-47 \n\n• Sidang Kemuncak ASEAN–Amerika Syarikat ke-13 \n\n• Sidang Kemuncak ASEAN–Jepun ke-28 \n\n• Mesyuarat Pemimpin Komuniti Pelepasan Sifar Asia (AZEC) ke-3 \n\n• Sidang Kemuncak ASEAN–India ke-22 (secara maya) \n\n\"Sidang-sidang ini telah berjaya menjadi wadah untuk memperkukuh kerjasama strategik ASEAN bersama rakan-rakan strategik atau rakan dialog, memperluas sinergi dalam bidang perdagangan, digital, tenaga dan pembangunan mampan — sekali gus mengangkat suara ASEAN ke tahap yang lebih berpengaruh di pentas global,\" katanya.","summary":"KUALA LUMPUR: Diplomasi ASEAN di arena global diteruskan hari ini dengan lima sidang kemuncak utama.","url":"https://www.bharian.com.my/berita/nasional/2025/10/1463864/diplomasi-asean-diteruskan-dengan-lima-sidang-kemuncak-utama-hari","image":"https://assets.bharian.com.my/images/articles/BH27MAKANSIANG_BHfield_image_listing_featured.var_1761523918.jpg","video":null,"publish_date":"2025-10-27 00:12:05","author":"Wartawan BH","authors":["Wartawan BH"],"language":"en","category":"politics","source_country":"my","sentiment":0.518},{"id":372842476,"title":"World News | US Deports 54 Haryana Men, Police Probe 'Donkey Route' Trail","text":"New Delhi [India], October 27 (ANI): The US has deported 54 youths from Haryana, India, for allegedly entering the country via the Donkey Route, an illegal pathway. They arrived at Delhi's Indira Gandhi International Airport, Terminal-3, on Flight OAE-4767, police said on Sunday.\nAccording to information received so far, 16 of these young people are from Karnal, 15 from Kaithal, 5 from Ambala, 4 from Yamuna Nagar, 4 from Kurukshetra, 3 from Jind, 2 from Sonipat and 1 each from Panchkula, Panipat, Rohtak and Fatehabad.\nAlso Read | ASEAN-India Summit 2025 in Malaysia: 21st Century Belongs to India and ASEAN, Says PM Narendra Modi (Watch Video).\nAs per the data available, most of the deported youths are between 25 and 40 years of age. Karnal police handed them over to families; no agent complaints were received. The individuals were brought back to Delhi's IGI Airport and handed over to their families. The Trump administration's strict stance on illegal immigration has led to increased deportations.\nKarnal DSP Sandeep Kumar said that these deported individuals entered the US via the illegal donkey route.\nAlso Read | ASEAN-India Dialogue Relations Remain a Force for Stability, Says Malaysian PM Anwar Ibrahim (See Pics).\n\"Today, more Indians were deported from the United States, including 50 from Haryana, with approximately 16 from Karnal district. These individuals, from various villages and towns, had entered the US illegally via the 'donkey route' but were deported today. Karnal police informed the media that about 16 people who had gone to America through the \"donkey route\" were deported. Karnal police brought them back and handed them over to their families. They stated that no complaint has been received regarding any agent. They also advised against anyone attempting to go abroad illegally, emphasising that it is the wrong method that leads to significant problems later on. The police further stated that an investigation is underway, and if anyone has a criminal record, it will come to light during the investigation,\" he said.\nEarlier this year, hundreds of people were deported to India by US authorities. The US government regularly deports individuals who violate immigration laws or have no valid basis to remain in the country. After Donald Trump assumed office as the US President in January this year, the country's law enforcement agencies have launched a crackdown against illegal immigrants.\nMeanwhile, in a major breakthrough in its sustained campaign against organised crime, the Special Task Force (STF) of Haryana has arrested a close associate of gangster Lawrence Bishnoi.\nThe accused has been identified as Lakhwinder Singh, alias Lakha, a resident of Titram village in Kaithal district and a close aide of gangster Lawrence Bishnoi, who has been deported from the United States of America and arrested by the STF Ambala Unit after completion of all legal formalities.\nAccording to an official release, Lakhwinder Singh had been operating from the USA since 2022 under the directions of Haryana STF arrests close associate of gangster Lawrence Bishnoi, Anmol Bishnoi and was actively involved in around a dozen cases of extortion and firing incidents related to extortion in Haryana and Punjab.\nLakhwinder Singh has a significant criminal record in Haryana, including cases registered in Sonipat, Rohtak, Yamuna Nagar, Kaithal, and Ambala.\nA Look Out Circular (LOC) and Red Corner Notice (RCN) were issued against him in 2023 and 2024, respectively, by STF Haryana. After nearly a year of continuous coordination and legal follow-up with national and international agencies, his legal deportation from the USA has been successfully executed. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  According to information received so far, 16 of these young people are from Karnal, 15 from Kaithal, 5 from Ambala, 4 from Yamuna Nagar, 4 from Kurukshetra, 3 from Jind, 2 from Sonipat and 1 each from Panchkula, Panipat, Rohtak and Fatehabad.","url":"https://www.latestly.com/agency-news/world-news-us-deports-54-haryana-men-police-probe-donkey-route-trail-7177581.html","image":"https://st1.latestly.com/wp-content/uploads/2025/10/ANI-20251026193148.jpg","video":null,"publish_date":"2025-10-27 00:08:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.531},{"id":372841682,"title":"Argentines vote in midterms testing Milei’s economic reforms","text":"Argentines voted on Sunday in legislative elections that will test support for President Javier Milei’s free-market reforms and deep austerity measures and determine whether he has the backing to continue his economic overhaul.\n\nThe president’s party, La Libertad Avanza, aims to significantly boost its small minority in Congress to increase investor confidence in Milei’s vision and maintain the support of U.S. President Donald Trump, who recently provided Argentina with a hefty financial bailout but has threatened to pull away if Milei does not do well.\n\n“Don’t give up because we’re halfway there,” Milei told supporters at a closing campaign event in the port city of Rosario on Thursday. “We’re on a good path.”\n\nHalf of Argentina’s lower Chamber of Deputies, or 127 seats, as well as a third of the Senate, or 24 seats, are up for election in the midterm vote. The Peronist opposition movement holds the largest minority in both houses, while Milei’s relatively new party has only 37 deputies and six senators.\n\nElection results are expected to come in starting at 8 p.m. ET (0000 GMT).\n\nMilei voted on Sunday morning in Buenos Aires’ leafy middle-class Almagro neighborhood and waved to the public but did not give any statements. At voting centers across the city, some residents told Reuters they wanted to continue supporting the president’s overhaul.\n\n“Milei is risking it all for a deep change and he needs support because it’s not an easy task after years of populism,” said Cecilia Juarez, a 22-year-old university student, before voting, referring to the Peronist governments that dominated much of Argentine politics over the last 50 years.\n\nSilvio Caballero, 54, a university professor, was more pessimistic.\n\n“The economic growth is very slow, I don’t know when we’ll be able to be a first world country,” Caballero said. He did not say who he was voting for.\n\nThe White House and foreign investors have been impressed by the government’s ability to significantly reduce monthly inflation – from 12.8% before Milei’s inauguration to 2.1% last month – achieve a fiscal surplus, and enact sweeping deregulation measures.\n\nBut Milei’s popularity has fallen in recent months due to public frustration with his cuts to public spending and a corruption scandal tied to his sister, who also serves as his chief of staff.\n\nArgentina’s President Javier Milei turned out to vote at a Buenos Aires polling station on Sunday, in midterm elections that will determine whether he has the backing to continue his economic overhaul.\n\n“Milei’s adjustment has been done with treachery and cruelty,” said Axel Kicillof, the governor of Buenos Aires province, during a closing campaign event for the Peronist opposition coalition on Thursday. “They enjoy each victim of the cuts.”\n\nPolitical experts say that more than 35% of the vote would be a positive outcome for Milei’s government and could allow him, through alliances with other parties, to block efforts by opposition lawmakers to overturn his vetoes against laws Milei has said threaten Argentina’s fiscal balance.\n\nMaria Laura Tagina, a political scientist at the Universidad Nacional de San Martin, said the Peronist movement will have to fight harder than Milei’s party to achieve a “good election” because many more of its seats are up for grabs.\n\nMilei has said he expects a cabinet shake-up after the election that could include members of the centrist PRO party, a frequent ally of the government in Congress led by former president Mauricio Macri. On Monday, foreign affairs minister Gerardo Werthein resigned.\n\nThe election will be closely watched by the White House. Trump’s potential $40 billion bailout of Argentina includes a signed $20 billion currency swap and a possible $20 billion debt investment facility.\n\nFollowing the results, many analysts predict a devaluation of the peso, which they say has been overvalued to contain inflation. If Milei’s party underperforms, that may result in a sharper foreign-exchange policy adjustment.","summary":"Argentines voted on Sunday in legislative elections that will test support for President Javier Milei&#8217;s free-market reforms and deep austerity measures and determine whether he has the backing to continue his economic overhaul. The president&#8217;s party, La Libertad Avanza, aims to significantly boost its small minority in Congress to increase investor confidence in Milei&#8217;s vision [&#8230;]","url":"https://www.fbcnews.com.fj/world/argentines-vote-in-midterms-testing-mileis-economic-reforms/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2025/10/world-3-2.png","video":null,"publish_date":"2025-10-27 00:00:05","author":"Edna Low,Reuters","authors":["Edna Low","Reuters"],"language":"en","category":"politics","source_country":"fj","sentiment":-0.015},{"id":372840824,"title":"Argentina election results: President Javier Milei emerges strengthened from midterms","text":"President Javier Milei looks set to emerge strengthened from Argentina’s legislative elections, with initial results showing his party may have secured close to 40 percent of the vote.\n\nWith XXX of polling stations reporting nationwide, Milei’s La Libertad Avanza had XXX of the national vote. Surveys and analysts had generally forecast between 30 and 35 percent prior to the election.\n\nThe ruling party, which ran in alliance with ex-president Mauricio Macri’s PRO party, was the only force to run in all provinces, meaning it is the only that can produce a national tally.\n\nPreliminary results showed strong performances for La Libertad Avanza in the provinces of Córdoba, Santa Fe and XXX. Milei’s party also looked odds-on to notch victories in XXXX.\n\nIn the nation’s closely watched key battleground region, Buenos Aires Province, home to some 40 percent of the electorate, La Libertad Avanza trailed Fuerza Patria by XXX points with XX of polling stations reporting.\n\nThe legislative elections were the first true national test of support for Milei since he won office two years ago on a promise to revive Argentina’s long-ailing economy.\n\nAround half of the seats in the lower house Chamber of Deputies (127 seats), and one-third of the Senate (24 benches) are up for grabs, vital seats that could shift the balance of power in either chamber.\n\nLa Libertad Avanza was hoping to significantly increase its seat tally in both chambers but was not expected to secure a majority.\n\nTurnout was low, at just 66.5 percent of the 36-million eligible voters – the lowest tally for a national election since the return of democracy in 1983.\n\nRun on currency\n\nThe election run-up was marked by a run on the national currency, the peso, that forced Milei to seek a bailout from US President Donald Trump.\n\nWashington has promised an unprecedented US$40-billion package of aid, but the assistance came with a warning from Trump to Argentines that he would not \"be generous\" if Milei failed to perform at the polls.\n\nArgentines fear the government could depreciate or devalue the peso, widely seen as too strong, after the vote.\n\nQuestioned about the possibility on Sunday after he cast his ballot, Economy Minister Luis Caputo replied: \"No.\"\n\n\"Monday is just another day, nothing changes to the economic programme or the band system,\" he said, referring to the peso-dollar exchange rate band set by the government in April.\n\n\nGreat leader?\n\nInvestors began dumping the peso last month after Milei's party suffered a heavy defeat in regional elections in Buenos Aires Province.\n\nTrump stepped in to shore up his closest Latin American ally, calling him a \"great leader\" and hosting him for talks at the White House.\n\nMilei's LLA party and its allies could still however struggle to garner the third of seats they need in each chamber to block attempts to overturn his vetoes and advance the president's reform agenda in the face of an increasingly combative opposition.\n\nThe self-declared \"anarcho-capitalist\" leader has already seen many of his signature policies blocked by Congress, notably his efforts to privatise major state-owned companies and his veto of increased spending on public universities, emergency paediatric care and people with disabilities.\n\nMembers of Milei's inner circle had been implicated in a variety of scandals prior to the election, but that failed to make the anticipated impact.\n\n– TIMES/AFP/PERFIL","summary":"Initial results show Milei’s party performing strongly in Córdoba, Mendoza, Entre Ríos and Buenos Aires City; La Libertad Avanza posts improved numbers in Buenos Aires Province. Leer más","url":"https://www.batimes.com.ar/news/argentina/argentina-election-results-initial-results-show-president-javier-milei-set-to-emerge-strengthened.phtml","image":"https://fotos.perfil.com/2025/10/26/cropped/696/696/center/president-javier-milei-votes-2125977.jpg","video":null,"publish_date":"2025-10-27 00:00:00","author":"James Grainger","authors":["James Grainger"],"language":"en","category":"politics","source_country":"ar","sentiment":-0.513},{"id":372842170,"title":"Kebijaksanaan diplomasi angkat imej Malaysia anjur Sidang Kemuncak  ASEAN","text":"Secara rasminya, Sidang Kemuncak ASEAN Ke-47 membuka tirainya. Berlangsung di Kuala Lumpur sempena Kepengerusian Malaysia 2025, ia melakar satu lagi detik penting dalam sejarah diplomasi Malaysia di rantau ini dan dunia. \n\n Selaku Pengerusi ASEAN 2025, persidangan kali ini menjulang nama Malaysia atas keupayaannya 'memujuk' dan menghimpunkan pemimpin utama dunia di Kuala Lumpur, khasnya Presiden Amerika Syarikat (AS), Donald Trump; Perdana Menteri China, Li Qiang, pemimpin utama ketua kerajaan dan negara luar termasuk ASEAN sendiri.\n\n Kehadiran tokoh berpengaruh ini bukan sahaja menyerlahkan peranan Malaysia sebagai tuan rumah persidangan penting ini, bahkan satu pengiktirafan rasmi antarabangsa terhadap kepemimpinan dan keupayaan negara mengemudi ASEAN.\n\n Malaysia di bawah pimpinan Perdana Menteri, Datuk Seri Anwar Ibrahim tidak membuang masa memenuhi peranannya sebagai Pengerusi ASEAN 2025 dengan memastikan sidang kemuncak kali ini amat bersejarah dan berprestij.\n\n Walaupun berdepan pelbagai cabaran dan rintangan, Kuala Lumpur berjaya menjadikan pertubuhan negara berusia lebih setengah abad ini menjadi satu blok pakatan dipercayai serta diyakini, berpaksikan nilai kebersamaan, keterangkuman dan kedaulatan serantau. \n\n Ia sejajar dengan pendirian Perdana Menteri yang menegaskan \"Malaysia mahu ASEAN menjadi jambatan menghubungkan kuasa besar, bukan medan perebutan pengaruh. Dunia memerlukan suara sederhana yang memilih rundingan berbanding konfrontasi\".\n\n Kehadiran Trump dan Qiang pada sidang kali ini memperlihatkan kepentingan strategik rantau ini dalam percaturan global antara AS dan China yang saling bersaing sebagai negara kuasa besar dunia sama ada dalam aspek perdagangan serta ketenteraan. Namun, pendirian Malaysia yang berkecuali serta bersahabat dengan semua negara berdaulat dapat memastikan Kuala Lumpur berjaya memainkan peranan penting sebagai pengantara berprinsip, memastikan ASEAN kekal bebas, berpengaruh menentukan hala tuju perdagangan, keselamatan dan ekonomi digital.\n\n Rantau ASEAN berada di ambang kebangkitan ekonomi baharu. Dengan sumbangan melebihi AS$3.6 trilion kepada Keluaran Dalam Negara Kasar (KDNK) global, ASEAN dijangka muncul sebagai ekonomi keempat terbesar menjelang 2030. Dalam konteks ini, Malaysia perlu pantas memanfaat peranannya sebagai Pengerusi ASEAN 2025 untuk memperkukuh perdagangan intra-ASEAN, merangsang pelaburan hijau, serta memperluas kerjasama teknologi dan tenaga boleh diperbaharui di pentas Asia dan global.\n\n Realitinya, era ASEAN baharu sangat berteraskan ekonomi rakyat. Pertumbuhan di rantau ini tidak boleh lagi bergerak secara silo dan bersendirian, sebaliknya perlu menjunjung kesaksamaan dan inklusif. Keamanan serta kemakmuran serantau hanya boleh dicapai melalui keadilan ekonomi.\n\n Kuala Lumpur kini menjadi tumpuan dunia, bukan sekadar lokasi persidangan, tetapi simbol keupayaan Malaysia membina jambatan diplomatik antara timur dan barat, antara gergasi dunia dan negara kecil demi kemakmuran bersama. Apa yang penting, kepemimpinan Malaysia menyerlahkan kepada dunia betapa kekuatan diplomasi bukan diukur pada saiz kuasa, tetapi pada kebijaksanaan mengemudi serta menguruskan perbezaan di pentas antarabangsa demi kestabilan bersama.","summary":"Secara rasminya, Sidang Kemuncak ASEAN Ke-47 membuka tirainya. Berlangsung di Kuala Lumpur sempena Kepengerusian Malaysia 2025, ia melakar satu lagi detik penting dalam sejarah diplomasi Malaysia di rantau ini dan dunia.","url":"https://www.bharian.com.my/berita/nasional/2025/10/1463855/kebijaksanaan-diplomasi-angkat-imej-malaysia-anjur-sidang-kemuncak","image":"https://assets.bharian.com.my/images/articles/bhimejnegara_BHfield_image_listing_featured.var_1761523003.jpg","video":null,"publish_date":"2025-10-26 23:56:49","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.088},{"id":372842990,"title":"Boston College Republicans In Hot Water After Condemning Conservative Speaker Nick Solheim","text":"A College Republicans chapter is facing criticism for disavowing its own guest speaker who gave a passionate speech in which he called for young conservatives to be “willing to die” to save America.\n\nBoston College Republicans hosted conservative podcast host Nick Solheim during its Oct. 20 chapter meeting. Solheim delivered a speech urging chapter members they “need to be willing to be killed” while still condemning political violence, according to multiple reports. Solheim’s remarks prompted the chapter’s executive board to issue a statement denouncing their invited guest’s comments days later. The chapter then hosted a Democratic member of Congress on Thursday, according to The Heights, an independent Boston College student newspaper. (RELATED: Here’s What Radical Leftists Are Telling Themselves After Charlie Kirk’s Assassination)\n\nSolheim is the CEO and co-founder of American Moment, a group that provides professional training for young conservatives, including for jobs in the Trump administration.\n\nThe chapter, an affiliate of College Republicans of America (CRA), immediately received blowback from its parent organization’s leader, who called on Boston College Republicans President Jake Wiepert to resign or be removed.\n\n“Cowardice and disloyalty will not be tolerated. If the Boston College ‘Republican’ President doesn’t resign, CRA will disaffiliate,” CRA founder and chairman William Branson Donahue wrote in a Saturday night post to X. “It would be a shame to lose a flagship chapter, but it’s been taken over by the opposition. The members need to remove Jake Wiepert. Now.”\n\n Cowardice and disloyalty will not be tolerated. If the Boston College “Republican” President doesn’t resign, CRA will disaffiliate. It would be a shame to lose a flagship chapter, but it’s been taken over by the opposition. The members need to remove Jake Wiepert. Now. https://t.co/hnC1HRJ6KE — William Branson Donahue (@realwilldonahue) October 26, 2025 \n\nHeritage Foundation President Kevin Roberts, minutes earlier, sent an X post defending Solheim’s comments saying the guest speaker was “right, and he’s a patriot for saying so.”\n\n“The future won’t belong to soft men chasing comfort. It will belong to those who risk safety to defend their homeland, their families, and their faith,” Roberts added in his post.\n\nSolheim replied to the major conservative think tank leader writing, “Grateful for your mentorship over the years. Proud to be rowing in the same direction with you.”\n\nSolheim, in his Oct. 20 speech to Boston College Republicans, reportedly encouraged his audience to “live in recognition of the fact that they will kill you and everybody that you love to get what they want — open borders, sex changes for minors, so-called gay marriages, health care for illegal immigrants, and so on.”\n\n“If they’re willing to kill the people making this policy, they’re more than willing to kill the people who voted for it, too,” he added, according to reports.\n\n“The likely next attorney general of the State of Virginia has called for the death of little fascist two- and five-year-old children of one of his Republican colleagues and has not been denounced by a single Democrat in or seeking federally elected office,” Solheim reportedly added in his speech, referring to embattled Democratic Virginia Attorney General nominee Jay Jones. (RELATED: Democrat Jay Jones Pivots To Jan. 6, Abortion When Called Out On His Death Threat Texts)\n\nSolheim also mentioned the Sept. 10 assassination of Turning Point USA founder Charlie Kirk in his remarks to Boston College Republicans, according to reports. Tyler Robinson, 22, the suspect in Kirk’s murder, reportedly had a transgender boyfriend. According to Robinson’s mother, her son “had become more political and had started to lean more to the left – becoming more pro-gay and trans-rights oriented,” a charging document shows.\n\nThe speaker reportedly denounced political violence during his speech while appearing to draw a contrast between the left and the right, saying, “We don’t assassinate, attack indiscriminately, or violate our enemy.”\n\nBoston College Republicans’s executive board, in a statement to The Heights, called Solheim’s “views and rhetoric were unprecedented and unrepresentative of the views of our club members,” adding that it does “not endorse any of these views.”\n\n“We uphold the notion of civil discourse and believe that there is always a time for respectful discussion, even with those who do not agree with us,” the executive board’s statement continued. “This lapse in understanding was a procedural oversight and result of a sincere miscommunication while organizing our event.”\n\nThe Republican group on Thursday then privately hosted Democratic Rep. Jake Auchincloss, according to The Heights. Auchincloss voted with his party to impeach President Donald Trump in 2021 and voted against Trump’s signature One Big Beautiful Bill Act multiple times.\n\nOne of several organizations under the “College Republicans” umbrella, CRA was founded in 2023 and now consists of 200 chapters across the country, according to its website.\n\nCRA describes its mission on its website as “to provide young conservatives with the resources, training, and networking opportunities they need to advocate for Republican principles, support GOP candidates, and effect positive change in their communities.”\n\nSolheim’s organization, American Moment, “was founded in 2021 to identify, educate, and credential young Americans who will implement public policy that supports strong families, a sovereign nation, and prosperity for all,” according to its website.\n\nAmerican Moment states that it finds, trains, and places “young talent in the 15,000 influential positions across public-policy organizations, congressional offices, presidential administrations, and allied businesses,” emphasizing that the young people it selects must “have a worldview that places America first.”\n\nA Politico profile piece published in November 2023 described American Moment as “a small but scrappy organization that’s quietly reshaping the conservative establishment in Washington.”\n\n“What we’re trying to do is credential people who would otherwise not be able to get here [Washington],” Solheim told Politico at the time. “People who didn’t go to elite universities, people who don’t have rich parents.”\n\nSolheim, Boston College Republicans, and College Republicans of America did not respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'It would be a shame to lose a flagship chapter, but it’s been taken over by the opposition'","url":"https://dailycaller.com/2025/10/26/boston-college-republicans-condemn-conservative-speaker-nick-solheim/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-1216059775-scaled-e1761518381924.jpg","video":null,"publish_date":"2025-10-26 23:49:13","author":"Anthony Iafrate","authors":["Anthony Iafrate"],"language":"en","category":"politics","source_country":"us","sentiment":0.119},{"id":372840586,"title":"Russia has tested a new nuclear-capable missile, Putin and top general say","text":"MOSCOW (AP): Russia tested a new \"nuclear-capable\" and powered cruise missile fit to confound existing defenses, inching closer to deploying it to its military, President Vladimir Putin said in remarks released on Sunday. \n\nThe announcement, which followed years of tests of the Burevestnik missile, comes as part of nuclear messaging from the Kremlin, which has resisted Western pressure for a ceasefire in Ukraine and strongly warned the US and other NATO allies against sanctioning strikes deep inside Russia with longer-range Western weapons.\n\nA video released by the Kremlin showed Putin, dressed in camouflage fatigues, receiving a report from Gen. Valery Gerasimov, Russia’s chief of general staff, who told the Russian leader that the Burevestnik covered 14,000 kilometers (8,700 miles) in a key test Tuesday.\n\nGerasimov said the Burevestnik, or storm petrel in Russian, spent 15 hours in the air, adding “that’s not the limit.”\n\nLittle is known about the Burevestnik, which was code-named Skyfall by NATO, and many Western experts have been skeptical about it, noting that a nuclear engine could be highly unreliable.\n\nWhen Putin first revealed that Russia was working on the weapon in his 2018 state-of-the-nation address, he claimed it would have an unlimited range, allowing it to circle the globe undetected by missile defense systems.\n\nMany observers argue such a missile could be difficult to handle and pose an environmental threat. The U.S. and the Soviet Union worked on nuclear-powered missiles during the Cold War, but they eventually shelved the projects, considering them too hazardous.\n\nThe Burevestnik reportedly suffered an explosion in August 2019 during tests at a navy range on the White Sea, killing five nuclear engineers and two service members and resulting in a brief spike in radioactivity that fueled fears in a nearby city.\n\nRussian officials never identified the weapon involved, but the U.S. said it was the Burevestnik.\n\n“We need to determine the possible uses and begin preparing the infrastructure for deploying these weapons to our armed forces,” Putin told Gerasimov.\n\nThe Russian leader also claimed it was invulnerable to current and future missile defenses, due to its almost unlimited range and unpredictable flight path.\n\nEarlier this week, Putin directed drills of Russia’s strategic nuclear forces that featured practice missile launches. The exercise came as his planned summit on Ukraine with US President Donald Trump was put on hold.\n\nThe Kremlin said that the maneuvers involved all parts of Moscow’s nuclear triad, including intercontinental ballistic missiles that were test-fired from launch facilities in northwestern Russia and a submarine in the Barents Sea. \n\nThe drills also involved Tu-95 strategic bombers firing long-range cruise missiles.\n\nThe exercise tested the skills of military command structures, the Kremlin said in a statement Wednesday.","summary":"Russia has tested a new nuclear-capable missile, Putin and top general say","url":"https://gulfnews.com/world/europe/russia-tests-a-new-nuclear-capable-missile-putin-1.500321915","image":"https://media.assettype.com/gulfnews%2F2025-10-26%2Fwuxxowfp%2Fpreview.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100","video":null,"publish_date":"2025-10-26 23:45:34","author":null,"language":"en","category":"politics","source_country":"ae","sentiment":-0.115},{"id":372845982,"title":"US Navy Sea Hawk helicopter, F/A-18F Super Hornet fighter jet go down in separate South China Sea incidents","text":"Two U.S. Navy aircraft from the USS Nimitz — a Sea Hawk helicopter and an F/A-18 Super Hornet fighter jet — crashed during separate \"routine operations\" over the South China Sea on Sunday, with all five crew members rescued and in stable condition as the Navy investigates both incidents. The U.S. Pacific Fleet — the Navy’s largest operational command — said in a post on X that around 2:54 p.m. local time, an MH-60R Sea Hawk helicopter assigned to the \"Battle Cats\" of Helicopter Maritime Strike Squadron 73 crashed in the South China Sea while conducting routine operations from the aircraft carrier USS Nimitz (CVN 68). Search-and-rescue teams from Carrier Strike Group 11, operating alongside the Nimitz, quickly launched recovery efforts and safely pulled all three helicopter crew members from the water. Officials said the personnel were returned to the carrier for medical evaluation and were later confirmed to be in stable condition. NAVY CALLS OFF SEARCH FOR MISSING SAILOR ASSIGNED TO USS GEORGE WASHINGTON NEAR AUSTRALIA Roughly 30 minutes after the helicopter incident, an F/A-18F Super Hornet from the Nimitz, assigned to the \"Fighting Redcocks\" of Strike Fighter Squadron 22, also went down in the South China Sea during flight operations. Search-and-rescue teams again responded swiftly, recovering the jet’s two crew members, who had successfully ejected before the aircraft hit the water. Both aviators were transported back to the Nimitz and are reported to be in stable condition. The U.S. Pacific Fleet said in a statement that all five service members involved in the crashes are safe and accounted for. SECRETARY OF STATE RUBIO CONFIRMS BECOMING ACTING USAID CHIEF The causes of both incidents remain under investigation, and the Navy has not released additional details about weather conditions, possible mechanical issues, or the nature of the training missions being conducted at the time of the crashes. While investigators work to determine what led to the two mishaps, operations aboard the USS Nimitz have continued as the carrier remains deployed in the Indo-Pacific region. 'THIS IS ABOUT FENTANYL': TARIFFS ARE CRUCIAL TO COMBATING 'DRUG WAR,' TRUMP AND CABINET OFFICIALS SAY The Nimitz—the Navy’s oldest active aircraft carrier—is serving as the centerpiece of Carrier Strike Group 11, which routinely conducts freedom-of-navigation and maritime security operations in the South China Sea, waters that have become increasingly contested amid rising tensions between the U.S. and China. The incidents come as the Nimitz undertakes its final deployment, capping more than 50 years of service since its commissioning in 1975. The carrier was previously involved in Operation Eagle Claw, the failed 1980 mission to rescue American hostages in Tehran. CLICK HERE TO DOWNLOAD THE FOX NEWS APP The crashes also coincided with President Donald Trump’s visit to Asia. The president spent Sunday night in Malaysia, located along the southern edge of the South China Sea, and he was expected to depart for Japan on Monday.","summary":"Navy helicopter and fighter jet from USS Nimitz crash in South China Sea during routine operations. All five crew members successfully rescued and stable.","url":"https://www.foxnews.com/world/us-navy-sea-hawk-helicopter-f-a-18f-super-hornet-fighter-jet-go-down-separate-south-china-sea-incidents","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/06/uss-nimitz-november-2024-san-diego-2.jpg","video":null,"publish_date":"2025-10-26 23:42:24","author":"Greg Wehner,Lucas Tomlinson","authors":["Greg Wehner","Lucas Tomlinson"],"language":"en","source_country":"us","sentiment":-0.035},{"id":372841506,"title":"US Navy Sea Hawk helicopter, F/A-18F Super Hornet fighter jet go down in seperate South China Sea incidents","text":"Two U.S. Navy aircraft from the USS Nimitz — a Sea Hawk helicopter and an F/A-18 Super Hornet fighter jet — crashed during separate \"routine operations\" over the South China Sea on Sunday, with all five crew members rescued and in stable condition as the Navy investigates both incidents. The U.S. Pacific Fleet — the Navy’s largest operational command — said in a post on X that around 2:54 p.m. local time, an MH-60R Sea Hawk helicopter assigned to the \"Battle Cats\" of Helicopter Maritime Strike Squadron 73 crashed in the South China Sea while conducting routine operations from the aircraft carrier USS Nimitz (CVN 68). Search-and-rescue teams from Carrier Strike Group 11, operating alongside the Nimitz, quickly launched recovery efforts and safely pulled all three helicopter crew members from the water. Officials said the personnel were returned to the carrier for medical evaluation and were later confirmed to be in stable condition. NAVY CALLS OFF SEARCH FOR MISSING SAILOR ASSIGNED TO USS GEORGE WASHINGTON NEAR AUSTRALIA Roughly 30 minutes after the helicopter incident, an F/A-18F Super Hornet from the Nimitz, assigned to the \"Fighting Redcocks\" of Strike Fighter Squadron 22, also went down in the South China Sea during flight operations. Search-and-rescue teams again responded swiftly, recovering the jet’s two crew members, who had successfully ejected before the aircraft hit the water. Both aviators were transported back to the Nimitz and are reported to be in stable condition. The U.S. Pacific Fleet said in a statement that all five service members involved in the crashes are safe and accounted for. SECRETARY OF STATE RUBIO CONFIRMS BECOMING ACTING USAID CHIEF The causes of both incidents remain under investigation, and the Navy has not released additional details about weather conditions, possible mechanical issues, or the nature of the training missions being conducted at the time of the crashes. While investigators work to determine what led to the two mishaps, operations aboard the USS Nimitz have continued as the carrier remains deployed in the Indo-Pacific region. 'THIS IS ABOUT FENTANYL': TARIFFS ARE CRUCIAL TO COMBATING 'DRUG WAR,' TRUMP AND CABINET OFFICIALS SAY The Nimitz—the Navy’s oldest active aircraft carrier—is serving as the centerpiece of Carrier Strike Group 11, which routinely conducts freedom-of-navigation and maritime security operations in the South China Sea, waters that have become increasingly contested amid rising tensions between the U.S. and China. The incidents come as the Nimitz undertakes its final deployment, capping more than 50 years of service since its commissioning in 1975. The carrier was previously involved in Operation Eagle Claw, the failed 1980 mission to rescue American hostages in Tehran. CLICK HERE TO DOWNLOAD THE FOX NEWS APP The crashes also coincided with President Donald Trump’s visit to Asia. The president spent Sunday night in Malaysia, located along the southern edge of the South China Sea, and he was expected to depart for Japan on Monday.","summary":"Navy helicopter and fighter jet from USS Nimitz crash in South China Sea during routine operations. All five crew members successfully rescued and stable.","url":"https://www.foxnews.com/world/us-navy-sea-hawk-helicopter-f-a-18f-super-hornet-fighter-jet-go-down-seperate-south-china-sea-incidents","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/06/uss-nimitz-november-2024-san-diego-2.jpg","video":null,"publish_date":"2025-10-26 23:42:24","author":"Greg Wehner,Lucas Tomlinson","authors":["Greg Wehner","Lucas Tomlinson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.035},{"id":372841716,"title":"Trump Raises Concerns Over Tylenol’s Potential Link to Autism","text":"Former President Donald Trump has once again issued a warning to the American public about the potential dangers of Tylenol, particularly for young children and pregnant women. He expressed these concerns in a strongly worded online post.\n\nThis isn’t the first time Trump has voiced apprehensions regarding Tylenol. On September 22, during a press conference with Health and Human Services Secretary Robert F. Kennedy Jr., he initially suggested a possible link between the medication and autism.\n\nOn Sunday, Trump took to his social media platform, Truth Social, to reiterate his stance. He not only cautioned against the use of Tylenol but also raised issues with various childhood vaccines.\n\n“Pregnant Women, DON’T USE TYLENOL UNLESS ABSOLUTELY NECESSARY, DON’T GIVE TYLENOL TO YOUR YOUNG CHILD FOR VIRTUALLY ANY REASON,” Trump declared emphatically in his post.\n\nFurthermore, Trump recommended that the MMR vaccine, which protects against measles, mumps, and rubella, should be administered as three separate shots rather than the standard combined dose.\n\nThe former president also suggested that the chickenpox vaccine, typically given alongside the MMR shot, should be administered separately.\n\nTrump also said that children should be given the vaccine for Hepatitis B at 12 years or older.\n\nThat shot is currently given in three parts in the first 18 months of a child’s life. \n\nHe ended by saying that children should be given their vaccines in ‘five separate medical visits’ to avoid potential vaccine injury. \n\nTrump’s post included a link to a story that accused the Food & Drug Administration of having ‘stayed silent as internal reports of potential Tylenol risks piled up.’ \n\nDaily Mail has reached out to Tylenol’s parent company, Kenvue, for comment. \n\nTrump wrote an almost identical post on September 26, four days after the press conference with Kennedy. \n\nOn September 22, Trump announced at the White House that taking Tylenol during pregnancy ‘can be associated with a very increased risk of autism’.\n\nTrump stressed multiple times: ‘Don’t take Tylenol.’\n\nHe also instructed pregnant women to ‘tough it out’ and avoid taking the medication when they’re sick.\n\nTylenol is known as acetaminophen in the US and paracetamol around the world.\n\nKenvue previously told the Daily Mail: ‘We believe independent, sound science clearly shows that taking acetaminophen does not cause autism. We strongly disagree with any suggestion otherwise and are deeply concerned about the health risks and confusion this poses for expecting mothers and parents.\n\n‘Acetaminophen is the safest pain reliever option for pregnant women as needed throughout their entire pregnancy. \n\n‘Without it, women face dangerous choices: suffer through conditions like fever that are potentially harmful to both mom and baby or use riskier alternatives. High fevers and pain are widely recognized as potential risks to a pregnancy if left untreated.’\n\nThe company added: ‘The facts are that over a decade of rigorous research, endorsed by leading medical professionals and global health regulators, confirms there is no credible evidence linking acetaminophen to autism. \n\n‘We stand with the many public health and medical professionals who have reviewed this science and agree.’\n\nIn April, the Centers for Disease Control and Prevention said that autism prevalence in the US had increased from one in 36 children to one in 31.\n\nKennedy previously said that the ‘autism epidemic’ was ‘running rampant’.\n\nSpeaking alongside Kennedy, Trump had also criticized America’s ‘disgraceful’ vaccine schedule, despite the link between autism and vaccines being long disproven.\n\nIt came as the administration unveiled the results of a federal review spearheaded by the health secretary, who earlier this year declared ‘autism destroys families’.\n\nTrump called the rise of autism in the US ‘one of most alarming medical crises in history,’ citing a 400 per cent surge over the last several decades. \n\nHe said: ‘You know it’s something artificial. \n\n‘With Tylenol, don’t take it. There’s not an alternative to that.’\n\nAdditionally, Trump went on to praise the CDC’s move to stop recommending the combined MMR and varicella vaccine and urged Americans to break up the MMR vaccine into three separate shots because mixing them ‘could be a problem’. \n\n‘I’ve heard bad things about [the MMR] personally,’ Trump said, despite also calling himself a ‘big believer in vaccines’. \n\nOn the flip side, Kennedy touted a development in autism improvement: the $2.50-per-pill drug leucovorin, which is derived from folic acid.\n\nWhile research on leucovorin is also mixed, doctors specializing in the relationship between the drug and autism told the Daily Mail the administration’s focus on it ‘gives hopes’ to families across the country. \n\nTylenol faced further controversy when the White House’s X account reposted a March 7, 2017 post from Tylenol that read: ‘We actually don’t recommend using any of our products while pregnant. Thank you for taking the time to voice your concerns today.’\n\nThe White House’s comment was accompanied by a photo of Trump showing off a ‘TRUMP WAS RIGHT ABOUT EVERYTHING’ baseball cap, which the US leader recently also mentioned to the United Nations General Assembly.\n\nKenvue said about the post: ‘This eight-year-old consumer response is incomplete and did not address our full guidance on the safe use of Tylenol which has not changed.’ \n\nThe company added that it recommended pregnant women to not take any over-the-counter medication – including acetaminophen – without talking to their doctor first.\n\nHowever, the damage to one of the most prominent brands in American medicine may already be done. \n\nEric Schiffer, a crisis PR expert, told the Daily Mail that Trump’s comments could cost Tylenol up to $100 million this year.\n\nHe said: ‘With Trump attacking, it is like having your brand dragged across asphalt from the moving car.’\n\nSchiffer expects ‘scared checkout baskets’ for 6-12 months as Tylenol takes ‘body blows from hell’.\n\n‘I think you’ll see a bleed, a checkout with new parents, and then the lawsuits will have additional massive incoming missiles,’ he said.\n\nSchiffer, the CEO of Reputation Management Consultants, added that he would advise Tylenol to ‘lead with clinicians, not marketers’.\n\nHe would feature pediatric physicians ‘doing the work’ on social media platforms frequented by young mothers-to-be to ‘counter message’ the negative connotations with Tylenol after the president’s comments.\n\nSchiffer said: ‘I’d make sure the data is clear, and I would get their facts out via the pediatrics and OB-GYNs. I’d be deploying OB ambassadors on TikTok and YouTube shorts, and tackle anxiety where it breathes.’\n\nA $50million – $100million hit is expected to be taken by the company this year, Schiffer predicted, but he does not believe Tylenol to be going through a ‘Bud Light moment’.\n\nNoa Gafni, faculty at Columbia and New York University, also told the Daily Mail that Tylenol would suffer ‘significant’ consequences following Trump’s remarks.\n\nShe said: ‘I’m sure this will impact Tylenol financially, not just in the short term, but potentially in the long term, and the reason for that is because it got caught in the culture wars.’\n\nGafni also pointed to the Bud Light boycott, in which conservatives stopped buying the beer after the brand collaborated on an ad campaign with transgender influencer Dylan Mulvaney.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer President Donald Trump has once again issued a warning to the&#8230;\n\n\nThis Post: Trump Raises Concerns Over Tylenol&#8217;s Potential Link to Autism first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-raises-concerns-over-tylenols-potential-link-to-autism/","image":"https://internewscast.com/wp-content/uploads/2025/10/Trump-issues-new-Tylenol-warning-after-linking-drug-to-autism.jpg","video":null,"publish_date":"2025-10-26 23:40:48","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.245},{"id":372840600,"title":"Venezuela announces arrest of alleged CIA-linked 'mercenaries'","text":"Venezuela has announced the arrest of alleged CIA-linked \"mercenaries\"..US military flew supersonic B-1 bombers up to the coast of Venezuela.US 'strikes' against drug cartels on the table, Trump indicates approval of CIA 'action' in Venezuela .Video: US strikes 'drug smuggling boat' in Pacific as Trump, Colombia leader trade threats.Video: US announces 7th strike on alleged drug-courier boat.The latest move came after Venezuelan Vice President Delcy Rodríguez claimed Sunday that the country’s security forces had captured a group of mercenaries allegedly planning a “false flag” operation in the region under the direction of the US Central Intelligence Agency (CIA)..Joint military exercisesRodríguez made the statement as joint military exercises between the United States and Trinidad and Tobago took place in the Caribbean. She denounced the drills as a “military provocation” against Venezuela, accusing both nations of escalating regional tensions.“A false flag attack is underway in waters bordering Trinidad and Tobago or from Trinidadian or Venezuelan territory to generate a full military confrontation with our country,” Rodríguez said in a statement.She did not provide evidence or additional details to substantiate the claims..US warshipHer remarks came as the USS Gravely, a US Navy guided missile destroyer, arrived in Port of Spain, the capital of Trinidad and Tobago, on Sunday. Both US and Trinidadian officials described the visit as part of a series of joint training exercises aimed at strengthening regional security.US Embassy Chargé d’Affaires Jenifer Neidhart de Ortiz said the drills were designed to “address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts.”An aerial image released Sunday showed the USS Gravely docked at Port of Spain, marking a visible show of US naval presence in the southern Caribbean.The destroyer’s arrival follows reports that the aircraft carrier USS Gerald R. Ford is also maneuvering closer to Venezuelan waters. President Nicolás Maduro condemned the deployment, calling it an attempt by Washington to “fabricate a new eternal war” against his government.Rising US-Venezuela tensionsEarlier this month, US President Donald Trump confirmed that he had authorized the CIA to carry out covert operations in Venezuela, a revelation that fueled Caracas’s accusations of interference.Maduro has previously accused the US of plotting false flag attacks, including an alleged plan to plant explosives in the US Embassy in Caracas in early October.Washington, for its part, has accused Maduro of leading the Tren de Aragua, a sprawling transnational crime syndicate. The US has also targeted vessels off Venezuela’s coast, claiming they were used to traffic drugs into the United States.Trump has hinted that such operations could “move inside Venezuelan territory” if deemed necessary — a statement that has only deepened fears of escalation in the region.","summary":"Venezuela announces arrest of alleged CIA-linked 'mercenaries'","url":"https://gulfnews.com/world/americas/venezuela-announces-arrest-of-alleged-cia-linked-mercenaries-1.500322273","image":"https://media.assettype.com/gulfnews/2025-10-26/yuvjf9s4/newsml_afp_com_20251026T233111Z_doc_822z29e.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-10-26 23:38:46","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"ae","sentiment":0.034},{"id":372837466,"title":"Transportation secretary threatens to take $160 million from California over commercial driver’s licenses for noncitizen truckers","text":"In an appearance on Fox News Channel’s “Sunday Morning Futures,” Duffy said Gov. Gavin Newsom has refused to comply with Department of Transportation rules that require the state to stop issuing such licenses and review those already issued.\n\n“So, one, I’m about to pull $160 million from California,” Duffy said. “And, as we pull more money, we also have the option of pulling California’s ability to issue commercial driver’s licenses.”\n\nA Newsom spokesperson referred a request for comment to the state’s transportation agency, which did not immediately respond Sunday.\n\nCalifornia has defended its practices previously. When Duffy threatened to revoke funds last month, a spokesperson for Newsom dismissed the attack and noted that CDL holders from California have a significantly lower rate of crashes than both the national average and that of Texas, which is the only state with more licensed commercial drivers.\n\nLast month the Transportation Department tightened commercial driver’s license requirements for noncitizensafter three fatal crashes that officials said were caused by immigrant truck drivers. Only three specific classes of visa holders will be eligible for CDLs under the new rules and states must verify an applicant’s immigration status in a federal database. The licenses will be valid for up to one year unless the applicant’s visa expires sooner.\n\nDuffy said last month that California should never have issued 25% of 145 licenses investigators reviewed. He cited four California licenses that remained valid after the driver’s work permit expired — sometimes years after. The state had 30 days to come up with a plan to comply or lose funding.\n\nA nationwide commercial driver’s license audit began after officials say a driver in the country illegally made a U-turn and caused a crash in Florida that killed three people. It found licenses that were issued improperly in California, Colorado, Pennsylvania, South Dakota, Texas and Washington.\n\nDuffy said Sunday that California has unlawfully issued tens of thousands of these licenses to noncitizens.\n\n“So you have 60,000 people on the roads who shouldn’t have licenses,” Duffy said. “They’re driving fuel tankers, they’re driving school buses, and we have seen some of the crashes on American roadways that come from these people who shouldn’t have these licenses.”\n\nDuffy said earlier this month that he would withhold $40 million from California because it is the only state that is failing to enforce English language requirements for truckers. California defended its practices in a formal response to the Transportation Department, but federal officials were not satisfied.\n\nThe investigation launched after the Florida crash found what Duffy called significant failures in the way California is enforcing rules that took effect in June after one of President Donald Trump’s executive orders. California had issued the driver a commercial license, but these English rules predate the crash.","summary":"“And, as we pull more money, we also have the option of pulling California’s ability to issue commercial driver’s licenses.”","url":"https://fortune.com/2025/10/26/transportation-secretary-160-million-california-commercial-drivers-licenses-noncitizen-truckers/","image":"https://fortune.com/img-assets/wp-content/uploads/2025/10/GettyImages-2213117752-e1761521106707.jpg","video":null,"publish_date":"2025-10-26 23:31:28","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.633},{"id":372835850,"title":"Trump issues blistering new Tylenol warning after linking drug to autism","text":"Donald Trump has once again warned Americans against the risks of Tylenol, claiming young children and pregnant women should not take the everyday drug in a furious post online. \n\nThe president first raised concerns about Tylenol and links to autism at a press conference on September 22 with Health and Human Services Secretary Robert F Kennedy Jr. \n\nIn a post to Truth Social on Sunday, Trump reiterated his guidance about using Tylenol as well as various childhood vaccines. \n\n'Pregnant Women, DON’T USE TYLENOL UNLESS ABSOLUTELY NECESSARY, DON’T GIVE TYLENOL TO YOUR YOUNG CHILD FOR VIRTUALLY ANY REASON,' he wrote.\n\nTrump also advised that the MMR (measles, mumps and rubella) vaccine be separated into three different shots. Typically, they are combined into one.\n\nThe president also wrote that the vaccine for chicken pox should also be taken separately, as they are usually given at the same times as the MMR shot. \n\nTrump also said that children should be given the vaccine for Hepatitis B at 12 years or older.\n\nThat shot is currently given in three parts in the first 18 months of a child's life. \n\nHe ended by saying that children should be given their vaccines in 'five separate medical visits' to avoid potential vaccine injury. \n\nTrump's post included a link to a story that accused the Food & Drug Administration of having 'stayed silent as internal reports of potential Tylenol risks piled up.' \n\nDaily Mail has reached out to Tylenol's parent company, Kenvue, for comment. \n\nTrump wrote an almost identical post on September 26, four days after the press conference with Kennedy. \n\nOn September 22, Trump announced at the White House that taking Tylenol during pregnancy 'can be associated with a very increased risk of autism'.\n\nTrump stressed multiple times: 'Don't take Tylenol.'\n\nHe also instructed pregnant women to 'tough it out' and avoid taking the medication when they're sick.\n\nTylenol is known as acetaminophen in the US and paracetamol around the world.\n\nKenvue previously told the Daily Mail: 'We believe independent, sound science clearly shows that taking acetaminophen does not cause autism. We strongly disagree with any suggestion otherwise and are deeply concerned about the health risks and confusion this poses for expecting mothers and parents.\n\n'Acetaminophen is the safest pain reliever option for pregnant women as needed throughout their entire pregnancy. \n\n'Without it, women face dangerous choices: suffer through conditions like fever that are potentially harmful to both mom and baby or use riskier alternatives. High fevers and pain are widely recognized as potential risks to a pregnancy if left untreated.'\n\nThe company added: 'The facts are that over a decade of rigorous research, endorsed by leading medical professionals and global health regulators, confirms there is no credible evidence linking acetaminophen to autism. \n\n'We stand with the many public health and medical professionals who have reviewed this science and agree.'\n\nIn April, the Centers for Disease Control and Prevention said that autism prevalence in the US had increased from one in 36 children to one in 31.\n\nKennedy previously said that the 'autism epidemic' was 'running rampant'.\n\nSpeaking alongside Kennedy, Trump had also criticized America's 'disgraceful' vaccine schedule, despite the link between autism and vaccines being long disproven.\n\nIt came as the administration unveiled the results of a federal review spearheaded by the health secretary, who earlier this year declared 'autism destroys families'.\n\nTrump called the rise of autism in the US 'one of most alarming medical crises in history,' citing a 400 per cent surge over the last several decades. \n\nHe said: 'You know it's something artificial. \n\n'With Tylenol, don't take it. There's not an alternative to that.'\n\nAdditionally, Trump went on to praise the CDC's move to stop recommending the combined MMR and varicella vaccine and urged Americans to break up the MMR vaccine into three separate shots because mixing them 'could be a problem'. \n\n'I've heard bad things about [the MMR] personally,' Trump said, despite also calling himself a 'big believer in vaccines'. \n\nOn the flip side, Kennedy touted a development in autism improvement: the $2.50-per-pill drug leucovorin, which is derived from folic acid.\n\nWhile research on leucovorin is also mixed, doctors specializing in the relationship between the drug and autism told the Daily Mail the administration's focus on it 'gives hopes' to families across the country. \n\nTylenol faced further controversy when the White House's X account reposted a March 7, 2017 post from Tylenol that read: 'We actually don't recommend using any of our products while pregnant. Thank you for taking the time to voice your concerns today.'\n\nThe White House's comment was accompanied by a photo of Trump showing off a 'TRUMP WAS RIGHT ABOUT EVERYTHING' baseball cap, which the US leader recently also mentioned to the United Nations General Assembly.\n\nKenvue said about the post: 'This eight-year-old consumer response is incomplete and did not address our full guidance on the safe use of Tylenol which has not changed.' \n\nThe company added that it recommended pregnant women to not take any over-the-counter medication - including acetaminophen - without talking to their doctor first.\n\nHowever, the damage to one of the most prominent brands in American medicine may already be done. \n\nEric Schiffer, a crisis PR expert, told the Daily Mail that Trump’s comments could cost Tylenol up to $100 million this year.\n\nHe said: ‘With Trump attacking, it is like having your brand dragged across asphalt from the moving car.’\n\nSchiffer expects ‘scared checkout baskets’ for 6-12 months as Tylenol takes ‘body blows from hell’.\n\n‘I think you’ll see a bleed, a checkout with new parents, and then the lawsuits will have additional massive incoming missiles,’ he said.\n\nSchiffer, the CEO of Reputation Management Consultants, added that he would advise Tylenol to ‘lead with clinicians, not marketers’.\n\nHe would feature pediatric physicians ‘doing the work’ on social media platforms frequented by young mothers-to-be to ‘counter message’ the negative connotations with Tylenol after the president's comments.\n\nSchiffer said: ‘I’d make sure the data is clear, and I would get their facts out via the pediatrics and OB-GYNs. I’d be deploying OB ambassadors on TikTok and YouTube shorts, and tackle anxiety where it breathes.’\n\nA $50million - $100million hit is expected to be taken by the company this year, Schiffer predicted, but he does not believe Tylenol to be going through a ‘Bud Light moment’.\n\nNoa Gafni, faculty at Columbia and New York University, also told the Daily Mail that Tylenol would suffer ‘significant’ consequences following Trump’s remarks.\n\nShe said: ‘I’m sure this will impact Tylenol financially, not just in the short term, but potentially in the long term, and the reason for that is because it got caught in the culture wars.’\n\nGafni also pointed to the Bud Light boycott, in which conservatives stopped buying the beer after the brand collaborated on an ad campaign with transgender influencer Dylan Mulvaney.","summary":"The president gave advice on Tylenol and several childhood vaccinations in an all-caps post to Truth Social on Sunday.","url":"https://www.dailymail.co.uk/news/article-15229245/Donald-Trump-Tylenol-warning.html","image":"https://i.dailymail.co.uk/1s/2025/10/26/22/103331687-0-image-a-8_1761518394865.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/22/6816150531602727685/1024x576_MP4_6816150531602727685.mp4","publish_date":"2025-10-26 23:22:35","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":-0.292},{"id":372844154,"title":"UK journalist Sami Hamdi detained in US amid pro-Israel lobby pressure","text":"British political commentator and journalist Sami Hamdi has been detained by federal authorities in the United States in what a US Muslim civil rights group has called an “abduction”.\n\nThe Council on American-Islamic Relations (CAIR) condemned Hamdi’s detention at San Francisco airport on Sunday as “a blatant affront to free speech”, attributing his arrest to his criticism of Israel’s war on Gaza.\n\nHamdi, a frequent critic of US and Israeli policy, had addressed a CAIR gala in Sacramento on Saturday evening and was due to speak at another CAIR event in Florida the next day before his detention by the Department of Homeland Security’s (DHS) Immigration and Customs Enforcement (ICE) agency.\n\nCAIR said he was stopped at the airport following a coordinated “far-right, Israel First campaign”.\n\n“Our nation must stop abducting critics of the Israeli government at the behest of unhinged Israel First bigots,” it said in a statement. “This is an Israel First policy, not an America First policy, and it must end.”\n\nIn a statement seen by Al Jazeera, friends of Hamdi called his arrest “a deeply troubling precedent for freedom of expression and the safety of British citizens abroad”.\n\nThe statement called for the United Kingdom Foreign Office to “demand urgent clarification from the US authorities regarding the grounds for Mr Hamdi’s detention”.\n\nAl Jazeera was told that he remains in US custody and has not been deported.\n\n“The detention of a British citizen for expressing political opinions sets a dangerous precedent that no democracy should tolerate,” the statement added.\n\nHamdi’s father, Mohamed El-Hachmi Hamdi, said in a post on X that his son “has no affiliation” with any political or religious group.\n\n“His stance on Palestine is not aligned with any faction there, but rather with the people’s right to security, peace, freedom and dignity. He is, quite simply, one of the young dreamers of this generation, yearning for a world with more compassion, justice, and solidarity,” he added.\n\nEarlier this morning, ICE agents abducted British Muslim journalist and political commentator Sami Hamdi at San Francisco Airport, apparently in response to his vocal criticism of the Israeli government during his ongoing speaking tour.\nWe can confirm that Mr. Hamdi has not been… https://t.co/dfcVGvz6UX\n— CAIR National (@CAIRNational) October 26, 2025\n\n‘Proud Islamophobe’\n\nDHS Assistant Secretary Tricia McLaughlin confirmed Hamdi’s detention on Sunday, claiming without evidence that he posed a national security threat. “This individual’s visa was revoked, and he is in ICE custody pending removal,” she wrote on X.\n\nHamdi has been outspoken in accusing US politicians of actively enabling Israel’s genocide in Gaza, and has been widely quoted, challenging Western governments directly over arms transfers and diplomatic cover for Israeli war crimes.\n\nHis detention comes amid a wider pattern of US authorities blocking entry to Palestinian and pro-Palestine voices.\n\nIn June, two Palestinian men, Awdah Hathaleen and his cousin, Eid Hathaleen, were denied entry at the same airport and deported to Qatar. Weeks later, Awdah was reportedly killed by an Israeli settler in the occupied West Bank.\n\nFar-right activist and ally of US President Donald Trump, Laura Loomer, who has publicly described herself as a “proud Islamophobe” and “white advocate”, immediately celebrated online for playing a part in Hamdi’s detention.\n\n“You’re lucky his only fate is being arrested and deported,” she wrote, falsely branding him “a supporter of HAMAS and the Muslim Brotherhood”.\n\nLoomer has previously pushed conspiracy theories, including the claim that the September 11 attacks in the US were an inside job.\n\nLoomer and others credited the escalation against Hamdi to the RAIR Foundation, a pro-Israel pressure network whose stated mission is to oppose “Islamic supremacy”. RAIR recently accused Hamdi of trying to “expand a foreign political network hostile to American interests” and urged authorities to expel him from the country.\n\nOn Sunday, Shaun Maguire, a partner at the tech investment firm Sequoia and a vocal defender of Israel, alleged without evidence that Hamdi had tried to get him fired through an AI-generated email campaign, claiming: “There are jihadists in America whose full time job is to silence us.”\n\nHamdi’s supporters and civil rights advocates say the opposite is true, and that this detention is yet another case of political retaliation against critics of Israel, enforced at the border level before a single public word is uttered.\n\nCAIR says it intends to fight the deportation order, warning that the US is sending a chilling message to Muslim and Palestinian speakers across the country.","summary":"Far-right activist and Donald Trump ally Laura Loomer celebrates Hamdi’s detention as US gov&#039;t says he&#039;s in ICE custody.","url":"https://www.aljazeera.com/news/2025/10/26/uk-journalist-sami-hamdi-detained-in-us-amid-pro-israel-lobby-pressure?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/10/AP25157540699407-1761520526.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-10-26 23:20:23","author":"Apps Support,Elis Gjevori","authors":["Apps Support","Elis Gjevori"],"language":"en","source_country":"QA","sentiment":-0.018},{"id":372838590,"title":"Netanyahu says Israel decides which foreign troops will secure Gaza ceasefire","text":"JERUSALEM - Prime Minister Benjamin Netanyahu said on Sunday that Israel would determine which foreign forces it would allow as part of a planned international force in Gaza to help secure a fragile ceasefire under U.S. President Donald Trump's plan.It remains unclear whether Arab and other states will be ready to commit troops, in part given the refusal of Palestinian Hamas militants to disarm as called for by the plan, while Israel has voiced concerns about the make-up of the force.While the Trump administration has ruled out sending U.S. soldiers into the Gaza Strip, it has been speaking to Indonesia, the United Arab Emirates, Egypt, Qatar, Turkey and Azerbaijan to contribute to the multinational force.","summary":"Last week Netanyahu hinted that he would be opposed to any role for Turkish security forces in Gaza.","url":"https://www.japantimes.co.jp/news/2025/10/27/world/politics/netanyahu-israel-foreign-troops-gaza/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/10/27/501907.JPG?v=3.1","video":null,"publish_date":"2025-10-26 23:10:00","author":"Steven Scheer,Web Master","authors":["Steven Scheer","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.101},{"id":372840136,"title":"Milei’s reforms face crucial test in Argentina’s pivotal midterm vote","text":"Milei's small La Libertad Avanza (LLA) party is hoping to significantly increase its seat tally in both chambers but is not expected to secure a majority.\n\nPolls closed at 6:00 pm (2100 GMT) after ten hours of voting, with low turnout seen as a sign of disillusionment both with Milei and the opposition.\n\nPreliminary results are expected Sunday evening.\n\nThe election run-up was marked by a run on the national currency, the peso, that forced Milei to seek a bailout from US President Donald Trump, a close ally.\n\nWashington has promised an unprecedented $40 billion package of aid, but the assistance came with a warning from Trump to Argentines that he would not \"be generous\" if the outcome Sunday is unfavorable for Milei.\n\nArgentines fear the government could depreciate or devalue the peso, widely seen as too strong, after the vote.\n\nQuestioned about the possibility on Sunday after he cast his ballot, Economy Minister Luis Caputo replied: \"No.\"\n\n\"Monday is just another day, nothing changes to the economic program or the band system,\" he said, referring to the peso-dollar exchange rate band set by the government in April.\n\nRead moreWhat to know about Argentina's mid-term vote, a key test for Trump ally Milei\n\n'Nothing for workers' \n\nClad in his trademark leather jacket, Milei voted in Buenos Aires on Sunday morning, greeting waiting supporters but refusing media questions.\n\nAdriana Cotoneo, a 69-year-old pensioner also voting in Buenos Aires, told AFP she backed his party \"not because I believe it's the best option, but because I'm clear about who I want to be gone\" -- a reference to the center-left Peronist party that governed Argentina for most of its post-war history but has been dogged by allegations of corruption.\n\nEconomist and former TV pundit Milei, 55, electrified the 2023 race by revving a chainsaw at rallies to signify his plans to slash a bloated state and one of the world's highest inflation rates.\n\nHe cut tens of thousands of public sector jobs, froze public works, cut spending on health, education and pensions and led a major deregulation drive, prompting repeated mass protests.\n\nHis reforms were blamed for initially plunging millions of Argentines deeper into poverty. But they did slow inflation by two-thirds, to the relief of many, although at a cost of faltering economic growth, consumption and manufacturing.\n\n\"The economic plan is not working for the people, for businesses, for industry,\" centrist opposition senator Martin Lousteau said as he voted in the capital.\n\n\"We need a better Congress, less polarised, with less shouting, insults, and more capacity for dialogue,\" he said.\n\nRead moreMilei promises change in Argentina ahead of mid-term elections\n\nUS generosity limited \n\nInvestors began dumping the peso last month after Milei's party suffered a blistering rejection in bellwether Buenos Aires provincial elections.\n\nTrump stepped in to shore up his closest Latin American ally, calling him a \"great leader\" and hosting him for talks at the White House.\n\nMilei's LLA party and its allies could still however struggle to garner the third of seats they need in each chamber to advance the president's reform agenda in the face of an increasingly combative opposition.\n\nThe self-declared \"anarcho-capitalist\" leader has already seen many of his signature policies blocked by Congress, notably his efforts to privatize major state-owned companies and his veto of increased spending on public universities, emergency pediatric care and people with disabilities.\n\nAdding to his woes, members of Milei's inner circle have been implicated in a variety of scandals.\n\n(FRANCE 24 with AFP)","summary":"Polls closed and counting began Sunday in Argentina’s midterm elections, a key test for libertarian President Javier Milei’s austerity-driven agenda. Voters will decide whether to back his push to shrink the state and overhaul the economy, with half the lower house and a third of the Senate seats contested.","url":"https://www.france24.com/en/americas/20251026-milei-reforms-argentinal-midterm-vote","image":"https://s.france24.com/media/display/b82d45d8-b284-11f0-be3c-005056bf30b7/w:1280/p:16x9/e63190447e7f5cda469b5c54566259f0481437af.jpg","video":null,"publish_date":"2025-10-26 23:05:26","author":"FRANCE 24","authors":["FRANCE 24"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.23},{"id":372840508,"title":"US warship docks in Trinidad and Tobago, putting more pressure on Venezuela","text":"A US warship docked in Trinidad and Tobago’s capital on Sunday as the Trump administration boosts military pressure on neighbouring Venezuela and its President Nicolas Maduro.\nThe arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation is in addition to the aircraft carrier USS Gerald R Ford, which is moving closer to Venezuela.\nMaduro criticised the movement of the carrier as an attempt by the US government to fabricate “a new eternal war” against his country.\nUS President Donald Trump has accused Maduro, without providing evidence, of being the leader of the organised crime gang Tren de Aragua.\nGovernment officials from the twin-island nation and the US said the massive warship will remain in Trinidad until Thursday so both countries can carry out training exercises.\nA senior military official in Trinidad and Tobago told Associated Press that the move was only recently scheduled. The official spoke on condition of anonymity as he is not authorised to discuss the matter publicly.\n\nKamla Persad-Bissessar, the prime minister of Trinidad and Tobago, has been a vocal supporter of the US military presence and the deadly strikes on suspected drug boats in waters off Venezuela.\nUS embassy chargé d’affaires Jenifer Neidhart de Ortiz said in a statement that the exercises seek to “address shared threats like transnational crime and build resilience through training, humanitarian missions and security efforts”.\nThe visit comes one week after the US embassy in Trinidad and Tobago warned Americans to stay away from US government facilities there. Local authorities said a reported threat against Americans prompted the warning.\nMany people in Trinidad and Tobago criticise the warship’s docking in town.\nAt a recent demonstration outside the US embassy, David Abdulah, the leader of the Movement for Social Justice political party, said Trinidad and Tobago should not have allowed the warship into its waters.\n“This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there’s a threat of war,” said Abdulah, who is also the leader of the Movement for Social Justice political party. “That’s an abomination.”\nCaricom, a regional trade bloc made up of 15 Caribbean countries, has called for dialogue. Trinidad and Tobago is a member of the group but Persad-Bissessar has said the region is not a zone of peace, citing the number of murders and other violent crimes.","summary":"A US warship docked in Trinidad and Tobago’s capital on Sunday as the Trump administration boosts military pressure on neighbouring Venezuela and its President Nicolas Maduro.\nThe arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation is in addition to the aircraft carrier USS Gerald R Ford, which is moving closer to Venezuela.\nMaduro criticised the movement of the carrier as an attempt by the US government to fabricate “a new eternal war” against his...","url":"https://www.scmp.com/news/world/americas/article/3330406/us-warship-docks-trinidad-and-tobago-putting-more-pressure-venezuela","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/27/48c58556-ad7e-4d5b-a9ce-9c76b2576d1d_01aa0ce3.jpg","video":null,"publish_date":"2025-10-26 23:02:39","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"cn","sentiment":-0.043},{"id":372835576,"title":"US warship arrives in Trinidad and Tobago – as Venezuela hits out at ‘military provocation’ | World News","text":"A US warship has docked in the capital of Trinidad and Tobago, as US President Donald Trump increases military pressure on Venezuela.\n\nThe guided missile destroyer, USS Gravely, is in addition to the aircraft carrier USS Gerald R Ford, which is moving closer to Venezuela.\n\nPresident Trump has accused the country’s president, Nicolas Maduro, of being the leader of an organised crime gang but has not offered any evidence.\n\nPresident Maduro has called the deployment of warships an attempt by the US government to “invent a new eternal war” against his country.\n\nGovernment officials in Trinidad and Tobago and from the US said the warship will remain in Trinidad until Thursday for training exercises.\n\nVenezuela’s government has since issued a statement condemning what it called a military provocation by Trinidad and Tobago and the US.\n\nThe country claimed it captured a group of mercenaries “with direct information of the American intelligence agency” who intended to carry out a false flag attack in the region.\n\nThe statement from vice president Delcy Rodriguez did not give any details or evidence of the alleged false flag attack.\n\nJenifer Neidhart de Ortiz, the US Embassy’s charge d’affaires, said the exercises sought to “address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts”.\n\nA senior military official, speaking on condition of anonymity, said the move was only recently scheduled.\n\nRead more: Inside Pablo Escobar’s home city where drugs are readily available\n\nThe presence of the ship is controversial for some.\n\n“This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there’s a threat of war,” said David Abdulah, leader of the Movement for Social Justice political party.\n\n“That’s an abomination.”\n\nRead more:US accused of ‘inventing a war’Survivors reported after boat strikeUS destroys ‘drug smuggling submarine’\n\nTrinidad and Tobago’s Prime Minister Kamla Persad-Bissessar is a supporter of the deadly US strikes on suspected drug boats in waters off Venezuela.\n\nOn Friday, the US secretary of war claimed six “narco-terrorists” had been killed in a strike on an alleged drug smuggling boat in the Caribbean Sea.\n\nPete Hegseth said his military had bombed a vessel, which he claimed was operated by Tren de Aragua – a Venezuelan gang that was designated a terror group by Washington in February.\n\nSpeaking during a White House news conference last week, Donald Trump argued the campaign against suspected smugglers from Venezuela would help tackle the opioid crisis in the US.\n\n“Every boat that we knock out, we save 25,000 American lives. So every time you see a boat, and you feel badly you say, ‘Wow, that’s rough’. It is rough, but if you lose three people and save 25,000 people,” he said.\n\nSome Democratic politicians have expressed concerns that the strikes risk dragging the US into a war with Venezuela because of their proximity to the South American country’s coast.\n\nOthers have condemned the attacks as extrajudicial killings that would not stand up in a court of law.","summary":"A US warship has docked in the capital of Trinidad and Tobago, as US President Donald Trump increases military pressure on Venezuela. The guided missile destroyer, USS Gravely, is in addition to the aircraft carrier USS Gerald R Ford, which is moving closer to Venezuela. Image: USS Gerald R Ford arrives in Mallorca in early [&#8230;]\n\n\nThe post US warship arrives in Trinidad and Tobago &#8211; as Venezuela hits out at &#8216;military provocation&#8217; | World News appeared first on Ghana Latest News.","url":"https://ghananewss.com/us-warship-arrives-in-trinidad-and-tobago-as-venezuela-hits-out-at-military-provocation-world-news/","image":"https://e3.365dm.com/25/10/768x432/skynews-uss-gerald-r-ford-venezuela_7063252.jpg?20251026200525","video":null,"publish_date":"2025-10-26 23:00:31","author":"Ghana News","authors":["Ghana News"],"language":"en","source_country":"gh","sentiment":-0.222},{"id":372838846,"title":"1 in 4 Americans believes in witches. What the devil?","text":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics or culture.\n\nFrom vaccine quackery and Tylenol panic to climate change denial and the erosion of the nation’s public health apparatus, the Trump administration may be the most aggressively anti-science in modern American history. But the sad truth is, large portions of America have long rejected science in favor of believing in some of the most absurd things you can imagine.\n\nLike witches. \n\nIn May, Gallup polled the public’s belief in eight paranormal phenomena, and while Americans are most skeptical about the existence of witches, only 60% don’t believe in them. Meanwhile, 1 in 4 adults believes that witches exist, and another 15% aren’t sure if they do.\n\nOn top of that, roughly half of Americans believe in or are not sure about the existence of various far-fetched mental abilities, like being able to predict the future, communicate telepathically, and hear and/or talk with the dead. Over 2 in 5 believe in or aren’t sure about astrology. And Americans are split on the existence of ghosts, with 39% believing in them, 42% disbelieving, and 19% not being sure. \n\nTwo other beliefs have a more direct tie to religious faith. Forty-nine percent believe in or aren’t sure about reincarnation. And 48% believe in psychic or spiritual healing, while 19% aren’t sure and only 32% don’t buy it.\n\nGallup finds that 34% of Americans believe in at least three of these paranormal phenomena, and among that 34%, the average person believes in five. But while the data firm downplays these findings with the headline “Paranormal Phenomena Met With Skepticism in U.S.,” the data actually shows the public is largely open to believing in things with zero scientific basis.\n\nThis speaks to a larger issue of Americans discarding science. \n\nFor instance, Gallup finds that only 62% of Americans believe humans are driving climate change, despite there being overwhelming evidence of that fact. Much of that doubt is tied to a larger societal distrust of experts. For instance, only 29% of Americans place “a great deal” of trust in climate scientists to give full and accurate information on climate change, according to a 2023 Pew study. Meanwhile, 45% trust those experts only “some,” “a little,” or not at all.\n\nThe odd thing is, despite the Democratic Party’s platform being more grounded in science and despite their overall higher trust in scientists, Democrats are about as likely as Republicans to believe in the paranormal, according to Gallup. Other surveys find Republicans slightly more likely to believe in some paranormal entities, such as ghosts or demons, but when it comes to paranormal abilities, even those surveys find the parties with similar levels of belief.\n\nHowever, in Gallup’s data, independents are slightly more likely than either Democrats or Republicans to believe in paranormal phenomena. And that holds across all eight types that Gallup asked about, though some results are within the margin of error.\n\nStill, if independents are a little more prone to believing in the paranormal, it could help explain why they made up the base of support for Robert F. Kennedy Jr’s independent bid for president 2024. Kennedy, now the health secretary, has long been a rabid conspiracy theorist. Most known for his anti-vaccine activism, he’s also endorsed ideas as batty as the chemtrails conspiracy, which falsely claims airplane contrails are really chemicals the government is releasing to poison us and/or control our minds. RFK Jr.’s anti-science positions just might not have turned off many of those voters.\n\nThat said, a candidate can still go too far. And in 2010, one did.\n\nThat year, Christine O'Donnell, a tea-party Republican, ran to fill Joe Biden’s Senate seat after he was elected vice president. During the campaign, TV host Bill Maher unearthed footage of O'Donnell appearing on his 1990s talkshow and declaring she had “dabbled” in witchcraft.\n\n“I never joined a coven. But … I dabbled into witchcraft,” she said in the footage. “I hung around people who were doing these things. I'm not making this stuff up. I know what they told me they do.”\n\nAfter this resurfaced, she released a jaw-dropping campaign ad in which she declares, speaking directly to camera, “I’m not a witch.”\n\nAbout a month later, in an election that saw Democrats got routed up and down the ballot, she lost her race to Democrat Chris Coons by over 16 percentage points\n\nBut perhaps she was telling the truth in the 1990s. Perhaps her dabblings in witchcraft imbued her with the ability to predict the future, because the very next year she released a memoir whose title presaged our entire political moment.\n\n“Troublemaker: Let's Do What It Takes to Make America Great Again.”\n\nAny updates?\n\n There was too much paranormal polling to fit into the article above, so here are some other interesting findings: Only 83% of Americans say vampires and werewolves don’t exist; 7% claim they’ve personally seen a demon, with another 9% not sure if they have; 4 in 10 think some UFOs that have been spotted were alien spacecraft; and 51% think those selling a home should be legally required to disclose if they believe the house is haunted. \n\n Millions turned out for last weekend’s “No Kings” protests against President Donald Trump’s authoritarian agenda, and despite the GOP’s lie-filled messaging campaign, 48% of Americans approve of the protests, according to YouGov. That even includes 14% of Republicans. Meanwhile, just 32% disapprove of the protests, with most disapproval coming from the right (67% of Republicans disapprove).\n\n Bad news for people who dislike extrajudicial killings: A plurality of Americans (48%) support the Trump administration lethally striking boats suspected of smuggling drugs, according to the latest YouGov/Economist poll. Thirty-eight percent oppose the strikes.\n\n If Democrats somehow beat the odds and retake the Senate next year, it may be because of one traditionally red state: Alaska. A new poll from Alaska Survey Research finds Democrat Mary Peltola leading incumbent Republican Dan Sullivan, 48% to 46%, among likely voters. Peltola, a former congresswoman, has not announced a run, but she is being courted by national Democrats. And hey, if our second-newest state gives Democrats a vote in the Senate, maybe the party will finally recognize its best path to correcting the chamber’s conservative bias is to create even more new states. \n\nTo keep with our spooky theme, let’s talk horror movies—and not the one playing at the White House. (Rimshot, cymbal.) No, we’re talking masked killers, possessed children, psychopathic cannibals—you know, fun stuff.\n\nAmericans are relatively averse to horror films, with only 50% saying they “like” or “love” them—a lower share than for any other genre of film—according to data from YouGov.\n\nHorror is by far the most polarizing genre, with equal shares (22%) saying they “love” and “hate” scary movies. It’s about three times as polarizing as science fiction, fantasy, and western films, which are tied for the second-most polarizing, according to the Daily Kos Movie-Genre Polarization Index.™️(Like our Food Polarization Index,™️ the methodology for this can be found in the chart’s footnote.)\n\nThat said, 67% of Americans say they watch horror, according to other YouGov data. \n\nAbout 2 in 3 Americans have seen the five most-viewed films: “The Exorcist,” “The Silence of the Lambs, “Halloween,” “Frankenstein,” and “Friday the 13th.” And “The Silence of the Lambs” earns the top marks, with 42% of Americans saying they “love” it and another 43% saying they “like” it—almost universal acclaim.\n\nThe most polarizing film in YouGov’s survey is “The Blair Witch Project,” a personal favorite of mine. “The Texas Chainsaw Massacre” comes in a close second.\n\nSo, what’s your favorite scary movie?","summary":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics or culture.\n\n\n\n\nFrom vaccine quackery and Tylenol panic to climate change denial and the erosion of the nation’s public health apparatus, the Trump administration may be the most aggressively anti-science in modern American history. But the sad truth is, large portions of America have long rejected science in favor of believing in some of the most absurd things you can imagine.\n\n\n\nLike witches. \n\n\n\nIn May, Gallup polled the public’s belief in eight paranormal phenomena, and while Americans are most skeptical about the existence of witches, only 60% don’t believe in them. Meanwhile, 1 in 4 adults believes that witches exist, and another 15% aren’t sure if they do.\n\n\n\nOn top of that, roughly half of Americans believe in or are not sure about the existence of various far-fetched mental abilities, like being able to predict the future, communicate","url":"https://www.dailykos.com/story/2025/10/26/2346283/-1-in-4-Americans-believes-in-witches-What-the-devil?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1491440/story_image/Survey.png?1761157949","video":null,"publish_date":"2025-10-26 23:00:06","author":"Andrew Mangan","authors":["Andrew Mangan"],"language":"en","category":"sports","source_country":"US","sentiment":-0.228},{"id":372833248,"title":"Why Donald Trump’s move to pay the troops was probably illegal, and why that probably doesn’t matter","text":"Donald Trump’s administration is using a large private donation and an executive order to make a big deal about efforts to keep members of the armed services paid during a federal government shutdown, which is now in its 25th day.\n\nBut experts agree that the White House and Pentagon’s efforts have likely crossed the bounds into illegality. The question is now: does that even matter anymore?\n\nWhen Democrats and Republicans failed to meet an October 1 deadline to fund the government for the current fiscal year, Congress kicked off a countdown clock. More than a million Americans, employed by the federal government in some manner, were due to miss a paycheck when the clock struck zero.\n\nIt did so on October 15, resulting in those hundreds of thousands of workers going unpaid. The same day, Trump signed an executive order restarting that clock for service members, directing the Pentagon to make sure the military continued to receive pay.\n\n“Funds used for military pay and allowances during the current lapse should be those that the Secretary of War determines are provided for purposes that have a reasonable, logical relationship to the pay and allowances of military personnel, consistent with applicable law, including 31 U.S.C. 1301(a),” that order stated.\n\nMost nonpartisan experts agree: the move was likely a violation of the Antideficiency Act, even with the administration’s attempts to satisfy its requirements via Trump’s order. The law prevents federal agencies from spending any money that has not been appropriated by Congress, and generally from accepting donations from the likes of Timothy Mellon, a major financial supporter of Trump’s 2024 bid for the presidency, who ponied up $130m to contribute to military pay. There are multiple requirements set by the law in which the Trump administration is apparently in violation of, including the use of money from a donation without congressional approval.\n\nAdministration officials separately reported $8bn in other funds they said they’d found to keep servicemembers paid. But that funding is due to dry up by the end of October. It, too, poses a likely violation of the Antideficiency Act, given that at least some was transferred from research and development funding the Pentagon claimed it had no obligation to spend; the money was appropriated by Congress for that purpose, regardless of which year it is used.\n\n“When President Trump used money authorized only for the purpose of supporting R&D to instead pay the troops, he used existing money for a purpose not allowed by that appropriation. He also spent money to pay the troops when he didn’t have an appropriation usable for that purpose,” explained Bobby Kogan, a former adviser to the Office of Management and Budget, in a blog for the Center for American Progress.\n\nRich Brady, an expert with the Society of Defense Financial Management, added to Federal News Network: “Research and development dollars that were appropriated in 2025 are good for obligation in fiscal 2025 and fiscal 2026 — it’s two years, so they’ve got some flexibility in that account. The question is, how much can they legally transfer over and use for military pay purposes? It’s likely not going to add up to the full $8 billion that they’re talking about.”\n\nBetween the donation from Mellon and the use of R&D funds, there are at least three likely violations of the Antideficiency Act that experts have pointed to in the wake of the first October 15th paycheck deadline. \n\nThe 2026 NDAA remains in Congress, which is gridlocked by the shutdown and Speaker Mike Johnson’s decision to send the House home until it ends. NDAA bills have passed both chambers, but are stuck in reconciliation. Committees are projected to finish their work by Thanksgiving, with final passage of the bill before the end of the calendar year.\n\nUntil that legislation reaches Donald Trump’s desk, pay for military members is imperiled. Congress has until the end of the week before federal workers and service members miss a second paycheck. House and Senate members could reach a compromise on a bill to extend military pay at current levels temporarily, as the chambers did with continuing resolutions in 2024, but those talks are mostly frozen right now amid the shutdown.\n\nHere’s the real question in a Trumpified country and justice system: Does any of this matter?\n\nWhether something is a violation of the law and whether the law is enforced are two separate matters. In this scenario, the latter is a far more relevant question as Donald Trump’s Justice Department has followed a clear trend in its prosecutions by cutting favors to figures like New York City Mayor Eric Adams and Tom Homan, Trump’s border czar, after Homan allegedly accepted a $50,000 bribe from undercover FBI agents.\n\nTrump’s DOJ is clearly more interested in pursuing criminal charges against his political enemies, even at the cost of forcing career prosecutors to resign in protest. It seems that the only chance these violations will result in criminal charges would be under a new administration. Even then, there will likely be far greater pressure for the agency to focus on other prosecutions related to the second Trump presidency, such as the military strikes against vessels in the Caribbean the administration alleges are drug traffickers, which even a Republican senator on Sunday referred to as “extrajudicial killings”.\n\nThere’s also the extreme likelihood, given past examples, that Donald Trump will issue a large number of pardons for members of his team ahead of leaving office. This could further complicate or entirely prohibit any criminal charges for Pete Hegseth, his Defense secretary, or members of Hegseth’s team.\n\nAll this is to say, the odds are stacked against any kind of law enforcement action ever stemming from what seems to be a blatant and multi-faceted violation of federal law.","summary":"Analysis: Experts argue that use of a donation and research funding present separate examples of Antideficiency Act violations writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/why-donald-trump-s-move-to-pay-the-troops-was-probably-illegal-and-why-that-probably-doesn-t-matter-b2852605.html","image":"https://static.independent.co.uk/2025/10/24/21/03/Trump-ktqt6c55.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/T8JB3vNV-4VHSaSK0.mp4","publish_date":"2025-10-26 22:53:02","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.49},{"id":372836766,"title":"Why Donald Trump’s move to pay the troops was probably illegal, and why that probably doesn’t matter","text":"Donald Trump’s administration is using a large private donation and an executive order to make a big deal about efforts to keep members of the armed services paid during a federal government shutdown, which is now in its 25th day.\n\nBut experts agree that the White House and Pentagon’s efforts have likely crossed the bounds into illegality. The question is now: does that even matter anymore?\n\nWhen Democrats and Republicans failed to meet an October 1 deadline to fund the government for the current fiscal year, Congress kicked off a countdown clock. More than a million Americans, employed by the federal government in some manner, were due to miss a paycheck when the clock struck zero.\n\nIt did so on October 15, resulting in those hundreds of thousands of workers going unpaid. The same day, Trump signed an executive order restarting that clock for service members, directing the Pentagon to make sure the military continued to receive pay.\n\n“Funds used for military pay and allowances during the current lapse should be those that the Secretary of War determines are provided for purposes that have a reasonable, logical relationship to the pay and allowances of military personnel, consistent with applicable law, including 31 U.S.C. 1301(a),” that order stated.\n\nMost nonpartisan experts agree: the move was likely a violation of the Antideficiency Act, even with the administration’s attempts to satisfy its requirements via Trump’s order. The law prevents federal agencies from spending any money that has not been appropriated by Congress, and generally from accepting donations from the likes of Timothy Mellon, a major financial supporter of Trump’s 2024 bid for the presidency, who ponied up $130m to contribute to military pay. There are multiple requirements set by the law in which the Trump administration is apparently in violation of, including the use of money from a donation without congressional approval.\n\nAdministration officials separately reported $8bn in other funds they said they’d found to keep servicemembers paid. But that funding is due to dry up by the end of October. It, too, poses a likely violation of the Antideficiency Act, given that at least some was transferred from research and development funding the Pentagon claimed it had no obligation to spend; the money was appropriated by Congress for that purpose, regardless of which year it is used.\n\n“When President Trump used money authorized only for the purpose of supporting R&D to instead pay the troops, he used existing money for a purpose not allowed by that appropriation. He also spent money to pay the troops when he didn’t have an appropriation usable for that purpose,” explained Bobby Kogan, a former adviser to the Office of Management and Budget, in a blog for the Center for American Progress.\n\nRich Brady, an expert with the Society of Defense Financial Management, added to Federal News Network: “Research and development dollars that were appropriated in 2025 are good for obligation in fiscal 2025 and fiscal 2026 — it’s two years, so they’ve got some flexibility in that account. The question is, how much can they legally transfer over and use for military pay purposes? It’s likely not going to add up to the full $8 billion that they’re talking about.”\n\nBetween the donation from Mellon and the use of R&D funds, there are at least three likely violations of the Antideficiency Act that experts have pointed to in the wake of the first October 15th paycheck deadline.\n\nThe 2026 NDAA remains in Congress, which is gridlocked by the shutdown and Speaker Mike Johnson’s decision to send the House home until it ends. NDAA bills have passed both chambers, but are stuck in reconciliation. Committees are projected to finish their work by Thanksgiving, with final passage of the bill before the end of the calendar year.\n\nUntil that legislation reaches Donald Trump’s desk, pay for military members is imperiled. Congress has until the end of the week before federal workers and service members miss a second paycheck. House and Senate members could reach a compromise on a bill to extend military pay at current levels temporarily, as the chambers did with continuing resolutions in 2024, but those talks are mostly frozen right now amid the shutdown.\n\nHere’s the real question in a Trumpified country and justice system: Does any of this matter?\n\nWhether something is a violation of the law and whether the law is enforced are two separate matters. In this scenario, the latter is a far more relevant question as Donald Trump’s Justice Department has followed a clear trend in its prosecutions by cutting favors to figures like New York City Mayor Eric Adams and Tom Homan, Trump’s border czar, after Homan allegedly accepted a $50,000 bribe from undercover FBI agents.\n\nTrump’s DOJ is clearly more interested in pursuing criminal charges against his political enemies, even at the cost of forcing career prosecutors to resign in protest. It seems that the only chance these violations will result in criminal charges would be under a new administration. Even then, there will likely be far greater pressure for the agency to focus on other prosecutions related to the second Trump presidency, such as the military strikes against vessels in the Caribbean the administration alleges are drug traffickers, which even a Republican senator on Sunday referred to as “extrajudicial killings”.\n\nThere’s also the extreme likelihood, given past examples, that Donald Trump will issue a large number of pardons for members of his team ahead of leaving office. This could further complicate or entirely prohibit any criminal charges for Pete Hegseth, his Defense secretary, or members of Hegseth’s team.\n\nAll this is to say, the odds are stacked against any kind of law enforcement action ever stemming from what seems to be a blatant and multi-faceted violation of federal law.","url":"https://uk.news.yahoo.com/why-donald-trump-move-pay-225302861.html","image":"https://s.yimg.com/ny/api/res/1.2/6OhcJ8bLnJyZ9aylec2EbA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/e145724055071d28498776787275055d","video":null,"publish_date":"2025-10-26 22:53:02","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.49},{"id":372837462,"title":"Dow futures jump 300 points as U.S.-China trade war heads for ceasefire while Wall Street eyes another Fed rate cut and earnings from AI giants","text":"Treasury Secretary Scott Bessent offered rough outlines of an agreement that include China easing rare earth export restrictions and buying “significant” amounts of U.S. soybeans in exchange for President Donald Trump removing his threat of adding 100% tariffs on China. \n\nTrump and Chinese President Xi Jinping are scheduled to meet Thursday on the sidelines of a regional economic conference in South Korea, where they will determine the final details of a deal.\n\nFutures tied to the Dow Jones industrial average rose 312 points, or 0.66%. S&P 500 futures were up 0.75%, and Nasdaq futures added 0.91%. That would add to Friday’s rally that saw fresh record highs.\n\nThe yield on the 10-year Treasury was flat at 4.003%. The U.S. dollar was down 0.03% against the euro and up 0.16% against the yen. \n\nGold fell 0.59% to $4,113.40 per ounce. U.S. oil futures rose 0.80% to $61.99 a barrel, and Brent crude climbed 0.76% to $66.44.\n\nWall Street is also looking ahead to the Federal Reserve’s policy meeting, which will conclude on Wednesday. Investors overwhelmingly expect another quarter-point rate cut, bringing the benchmark rate to 3.75%-4.00%.\n\nThat’s after the consumer price index for September inched up but came in below forecasts, clearing the way for the Fed to focus more on the maximum-employment side of its mandate than the inflation-fighting side.\n\nThe coming week will also be busy for tech earnings amid growing concerns that the AI boom may be starting to resemble a bubble.\n\nMeta, Microsoft and Google parent Alphabet report on Wednesday, while Apple and Amazon report on Thursday.","summary":"Meta, Microsoft and Google parent Alphabet report on Wednesday, while Apple and Amazon report on Thursday.","url":"https://fortune.com/2025/10/26/stock-market-today-dow-futures-us-china-trade-fed-rate-cut-tech-earnings/","image":"https://fortune.com/img-assets/wp-content/uploads/2025/10/GettyImages-2241622959-e1761517012948.jpg","video":null,"publish_date":"2025-10-26 22:52:59","author":"Jason Ma","authors":["Jason Ma"],"language":"en","source_country":"US","sentiment":-0.424},{"id":372842986,"title":"‘I’d Just Be Lying’: Newsom Teases 2028 Presidential Run As California Continues To Suffer From Dem Control","text":"Democratic California Gov. Gavin Newsom announced Sunday on CBS he will consider a potential bid for his party’s presidential nomination in the 2028 election following the 2026 midterms.\n\nDespite earlier speculation Newsom could be a top contender for the Democratic nomination, the California governor remained noncommittal until Sunday. During an interview on CBS’s “Sunday Morning,” national correspondent Robert Costa observed Newsom “slinging shots behind the coffee bar” during a South Carolina tour, noting, “this guy might run for president.”\n\n“The idea that a guy who got 960 on his SAT, that still struggles to read scripts, that was always in the back of the classroom, the idea that you even throw that out is in and of itself extraordinary,” Newsom said. “Who the hell knows? I’m looking forward to who presents themselves in 2028 and who meets that moment, and that’s the question for the American people.”\n\nCosta continued pressing Newsom on a potential run, asking if it would be “fair to say” the Democrat lawmaker is going to “give it serious thought” after the 2026 midterm elections.\n\n“Yeah, I’d be lying otherwise,” Newsom responded. “I’d just be lying, and I can’t do that.”\n\nWhile Newsom has faced criticism from California voters for years over his policies, including crime and homelessness, the governor came under intense scrutiny following the disastrous Los Angeles County fires. The incident, which affected both Pacific Palisades and Altadena communities, resulted in thousands of homes burning and hundreds of residents still displaced. (RELATED: ‘He B*tches On The Internet’: Anna Paulina Luna Says Gavin Newsom Has Feminine Energy)\n\nNewsom has opposed certain progressive policies in recent months, facing pushback from his own party after stating biological men competing in women’s sports is “deeply unfair.” California, though, continues to grapple with high rates of homelessness and crime in addition to a growing government role in education.\n\nDespite the criticism from his own voters, Newsom appears to continue focusing on opposing the Trump administration.\n\nIn February 2025, the Democrat governor launched a podcast, and his press office’s later ramped up attacks on X against President Donald Trump and other Republicans. But even with his online presence, many Californians remain skeptical of his leadership and priorities.\n\nA Berkeley Institute of Governmental Studies poll from April 2025 found that 54% of 6,201 registered voters polled believe Newsom is “doing things that might benefit him as a possible candidate for president,” while just 26% think he’s “governing the state and helping to solve its problems.”\n\nWhen Costa asked if he is “moving closer” to “figuring out” his own “why” — what could compel him to officially launch a 2028 campaign — Newsom responded by quoting German philosopher Friedrich Nietzsche.\n\n“Yeah, Nietzsche said if you have a compelling ‘why,’ you can endure any ‘how.’ So I don’t think, I think the biggest challenge for anyone who runs for any office is people see right through you if you don’t have that why. You’re doing it for the wrong reasons,” Newsom said. “Look, that faith will determine that.”\n\nAn Emerson College poll from October 2025 found that, in a hypothetical matchup between Newsom and Vice President JD Vance, 46% support Vance, 45% back Newsom, and 10% remain undecided. The poll noted that, since July, Newsom has gained three points, while Vance has picked up one.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'The idea that a guy who got 960 on his SAT, that still struggles to read scripts, that was always in the back of the classroom, the idea that you even throw that out is in and of itself extraordinary'","url":"https://dailycaller.com/2025/10/26/gavin-newsom-teases-2028-presidential-bid-california-voters/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-2240037316-scaled-e1761513242655.jpg","video":null,"publish_date":"2025-10-26 22:52:41","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","source_country":"us","sentiment":-0.151},{"id":372832128,"title":"Flight delays in US to grow worse, transportation secretary warns","text":"More than 3,000 US flights were delayed on Sunday, and Duffy said he expects the situation to grow worse.\n\n\"I am seeing the stress,\" Duffy said in an interview on Sunday Morning Futures, adding that he had met with several controllers to hear their concerns firsthand.\n\n\"They're taking second jobs, they're out there looking, 'Can I drive Uber, can I find another source of income to make ends meet?'\" he continued.\n\nDuffy added that on Saturday 22 alerts at airports said flights would be delayed due to a shortage of workers - one of the highest since the shutdown began.\n\nThe US government shutdown entered its 26th day on Sunday, making it the second-longest shutdown in history.\n\nDuffy has repeatedly warned that aviation regulators would slow down the number of planes in the air if there is a shortage of safety personnel.\n\nIn his interview, he would not answer directly when asked if it was safe to fly in the US, and instead made a direct appeal to controllers. \n\n\"I need my controllers focused on the airspace, not on the finances at home,\" Duffy said.\n\nOn Sunday, some planes were grounded at Los Angeles International Airport due to staffing shortages, leading to disruption at the fifth-busiest airport in the country and one of the busiest in the world, as well as other flights stretching north to the city of Oakland.\n\nThe Federal Aviation Administration (FAA) alert went out at 08:45 local time on Sunday. Many flights were back on schedule before noon.\n\nFlights at Newark Liberty International Airport, however, were delayed an average of 82 minutes due to staffing shortages, and the FAA said Dallas Fort-Worth, the second-busiest airport in the country, could experience problems from low staffing later in the day.\n\nThe FAA warned passengers in California to check with airlines about updated departure times. \n\nThe issue comes ahead of Game 3 of the World Series, which is due to be played in Los Angeles on Monday night, and about one month before the Thanksgiving holiday, one of the busiest times to fly in the US.\n\nStrain on US air travel helped end a government shutdown in 2019. At the time, the shutdown had entered its fifth week and disrupted airline operations, including pilot training.\n\nIt prompted several air traffic controllers to stay home on the same day on 25 January 2019, temporarily stopping travel at New York's LaGuardia airport.\n\nThat same day, Donald Trump, who at the time was in his first term as president, agreed to sign a short-term spending bill, effectively ending the government shutdown after 35 days.","url":"https://www.bbc.com/news/articles/cwy7xd5ej7ko","image":"https://ichef.bbci.co.uk/news/1024/branded_news/0059/live/b438aaa0-b291-11f0-ac49-67a9e9deace7.jpg","video":null,"publish_date":"2025-10-26 22:50:47","author":"Max Matza","authors":["Max Matza"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.314},{"id":372832124,"title":"Food stamps: US government says it will stop paying for food aid next week","text":"Democrats have condemned President Donald Trump for refusing to use the contingency fund.\n\n\"This is perhaps the most cruel and unlawful offense the Trump administration has perpetrated yet,\" Congresswomen Rosa DeLauro and Angie Craig said in a joint statement on Friday.\n\nThey also criticised Trump for providing assistance to Argentina and building a new White House ballroom during the shutdown.\n\nAccording to the Center on Budget and Policy Priorities (CBPP), a think-tank focused on policies that help low-income families, the contingency fund would only cover about 60% of one month of benefits, however.\n\nIn a letter sent to the agriculture department on Friday, Democratic House members said there was still \"significant funding available in Snap's contingency reserve – which Congress provides precisely for this reason – that can be used to fund the bulk of November benefits\".\n\nThey asked Agriculture Secretary Brooke Rollins to release the reserves and then transfer other available money in her department to fully fund the programme for the month.\n\nIn a memo obtained by US outlets, Rollins said the reserve can only be used for \"true emergencies\", mostly natural disasters.\n\nEarlier, in its published plan for the shutdown, her department had said it would keep a small number of employees from being furloughed to operate the programme, noting Congress had created \"multi-year contingency funds\" to ensure states could continue to distribute benefits.\n\nSnap works by giving people reloadable debit cards that they can use to buy essential grocery items.\n\nA family of four on average receives $715 (£540) per month, according to CBPP, which breaks down to a little less than $6 (£4.50) per day per person.\n\nThe states administer the programmes, with much of the funding coming from the federal government. \n\nSeveral states have pledged to use their own funds to cover any shortfall, however the federal government has warned that they will not be reimbursed.\n\nSome, including Massachusetts - where one million people are expected to lose benefits - have said they do not have enough money to make up for the lack of funds.\n\nMany states are working with people in Snap to try locate charity food pantries and find alternative sources for meals, and California is deploying its National Guard to help distribute food. \n\nThe US government shutdown entered its 26th day on Sunday, making it the second-longest shutdown in history.","url":"https://www.bbc.com/news/articles/c4g7d9j7p5qo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/260f/live/66383b60-b2a3-11f0-b2a1-6f537f66f9aa.jpg","video":null,"publish_date":"2025-10-26 22:50:47","author":"Max Matza","authors":["Max Matza"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.187},{"id":372835572,"title":"US and China agree framework of trade deal ahead of Trump-Xi meeting","text":"The US and China have agreed the framework of a potential trade deal that will be discussed when their respective leaders meet later this week, the US treasury secretary has said.\n\nScott Bessent told the BBC’s US news partner CBS that this included a “final deal” on TikTok’s US operations and a deferral on China’s tightened rare earth minerals controls.\n\nHe also said he did not anticipate the 100% tariff on Chinese goods threatened by US President Donald Trump coming into force, while China will resume substantial soybean purchases from the US.\n\nBoth nations are seeking to avoid further escalation in a trade war between the world’s two largest economies.\n\nTrump and Chinese President Xi Jinping are due to hold talks on Thursday in South Korea.\n\nBessent met senior Chinese trade officials on the sidelines of the Association of Southeast Asian Nations (Asean) summit in Malaysia, which Trump is also attending as part of a tour of Asia. Beijing said they had “constructive” discussions.\n\nBessent said the countries had “reached a substantial framework for the two leaders”, adding: “The tariffs will be averted.”\n\nThe Chinese government said in a statement that both negotiating teams “reached a basic consensus on arrangements to address their respective concerns”.\n\n“Both sides agreed to further finalise specific details,” they added.\n\nTrump’s tariff tactics\n\nSince Trump re-entered the White House, he has imposed and threatened sweeping tariffs on imports from overseas on various countries, arguing that the policy would help boost US manufacturing and jobs. The introduction of tariffs has resulted in many countries, including the UK, agreeing new deals with the US.\n\nBut the steepest levies he has threatened have been levelled at China. Beijing has hit back with measures of its own, though the two agreed to hold off implementing the levies while pursuing a trade deal.\n\nHowever, earlier this month Trump said he would impose an additional 100% tarriff on Chinese goods from November in response to China tightening restrictions on export of rare earths – materials essential to the production of many electronics. The US president accused Beijing of “becoming very hostile” and trying to hold the world “captive”.\n\nChina processes around 90% of the world’s rare earths, which go into everything from solar panels to smartphones, making supply of them to US manufacturers a key bargaining chip.\n\nThe last time Beijing tightened export controls – after Trump raised tariffs on Chinese goods early this year – there was an outcry from many US firms reliant on the materials.\n\nChina will “delay that for a year while they re-examine it”, Bessent told a different news show, This Week, on Sunday.\n\nAnother issue of contention is soybeans, of which China is the world’s biggest buyer. As the trade war began heating up, China halted all orders, hurting US farmers.\n\nBessent hinted the boycott may soon be over but refused to give details.\n\n“I’m actually a soybean farmer, so I have felt this pain too… I think we have addressed the farmers’ concerns,” he said on This Week.\n\n“I believe when the announcement of the deal with China is made public that our soybean farmers will feel really good about what’s going on for this season and the coming seasons for several years.”\n\nTikTok deal done?\n\nBessent also said a deal had been agreed on video-sharing platform TikTok’s US arm, with Trump and Xi left to “consummate that transaction on Thursday”.\n\nThe US has sought to prise the app’s US operations away from Chinese parent company ByteDance over national security concerns.\n\nTikTok was previously told it had to sell its US operations or risk being shut down, but Trump has delayed implementing the ban four times to facilitate negotiations, and has extended the deadline again to December.\n\nThe White House announced last month that US companies would control TikTok’s algorithm and Americans would hold six of seven board seats for the app’s US operations.\n\nWhile Trump initially called for TikTok to be banned during his first term, he has since changed course. He turned to the hugely popular platform to boost his support among young Americans during his successful 2024 presidential campaign.\n\nOn Sunday, Washington also annouced that trade deals with Malaysia and Cambodia had been secured and frameworks agreed with Thailand and Vietnam.\n\nSource link","summary":"The US and China have agreed the framework of a potential trade deal that will be discussed when their respective leaders meet later this week, the US treasury secretary has said. Scott Bessent told the BBC&#8217;s US news partner CBS that this included a &#8220;final deal&#8221; on TikTok&#8217;s US operations and a deferral on China&#8217;s [&#8230;]\n\n\nThe post US and China agree framework of trade deal ahead of Trump-Xi meeting appeared first on Ghana Latest News.","url":"https://ghananewss.com/us-and-china-agree-framework-of-trade-deal-ahead-of-trump-xi-meeting/","image":"https://ghananewss.com/storage/2023/01/ghananews-2023.png","video":null,"publish_date":"2025-10-26 22:48:48","author":"Ghana News,Jennifer Frimpong Wiredu","authors":["Ghana News","Jennifer Frimpong Wiredu"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.235},{"id":372835276,"title":"1 Incredible Reason to Buy Cameco (CCJ) Stock Before October Ends","text":"Cameco (CCJ +2.10%) stock has soared more than 60% in 2025 as of this writing, but this isn't another meme stock. Far from it.\n\nCameco is, in fact, a well-established stalwart in the uranium industry and is incredibly well-placed to benefit from the global nuclear energy resurgence. It is one of the few stocks you shouldn't go wrong with if you're looking to ride the nuclear wave.\n\nIn fact, you'll want to grab some shares of Cameco before October ends. Here's why.\n\nAll set to catch the nuclear energy boom\n\nNuclear energy is quickly taking center stage as a steady and a reliable source of clean energy to meet the surging demand for electricity, especially from artificial intelligence (AI) operations and data centers that consume massive amounts of power. That's one of the reasons why President Donald Trump is also going all in to boost the domestic nuclear energy industry.\n\nThat also means massive potential for the supply side of the industry, especially providers of nuclear fuel, uranium. And it's where Cameco steps in.\n\nCameco is one of the largest uranium miners in the world, selling uranium and fuel services to nuclear utilities across America, Europe, and Asia. Cameco's 49% stake in Westinghouse Electric Company also makes it a top supplier of nuclear equipment and technologies.\n\nHere's where things start to get interesting. Cameco's third-quarter earnings report coming up on Nov. 5 could propel the stock higher.\n\nWhy Cameco's sales and earnings could surge\n\nCameco has two big things going for it: uranium prices and Westinghouse.\n\nCameco regularly calculates average industry uranium prices and releases them. Its September-end spot uranium price of $82.63 per pound, as well as long-term price of $83 per pound, are the highest in all of 2025.\n\nWith Cameco also already locking in delivery commitments for 2025 under long-term contracts, its revenue could get a solid boost in Q3, backed by higher volumes as well as prices.\n\nWestinghouse, meanwhile, should drive Cameco's earnings higher. Last quarter, Cameco significantly bumped up its expectations from Westinghouse. The Trump administration's push to restart idled nuclear reactors and build more creates significant opportunities for Westinghouse.\n\nShould you buy Cameco stock hand over fist?\n\nA strong earnings report, though, is a short-term potential catalyst for Cameco stock. Its long-term thesis is a lot more compelling, and you should be able to get a glimpse of it as well in November.\n\nCameco plans its production for long-term contracting with utilities, not for spot uranium exposure. Cameco believes utilities will have to secure a \"significant amount of uranium\" through 2045 to meet their fuel needs. The World Nuclear Association's latest biennial report, meanwhile, suggests that demand for uranium could more than double by 2040.\n\nCameco has been steadfast and strong through the worst of times. Today, the outlook for nuclear energy and uranium looks better than ever. Cameco has been a monster stock in the past, and the next big bull run might just be getting started. Buying some shares now, therefore, could be a solid investment move.","summary":"Cameco stock looks poised to vault higher in November and beyond.","url":"https://www.fool.com/investing/2025/10/26/1-incredible-reason-to-buy-cameco-ccj-stock-oct/","image":"https://g.foolcdn.com/editorial/images/838114/mobile-investing-robinhood-stocks-personal-finance-growth.jpg","video":null,"publish_date":"2025-10-26 22:48:00","author":"Neha Chamaria","authors":["Neha Chamaria"],"language":"en","source_country":"us","sentiment":-0.286},{"id":372830964,"title":"Lavrov: Initiative to Hold Putin-Trump Meeting Still on the Table","text":"Moscow, October 26 (QNA) - Russian Foreign Minister Sergey Lavrov noted that the initiative to hold a high-level meeting between Russia and the United States remains relevant, but such negotiations require thorough preparation.\n\nHe recalled the phone conversation between US President Donald Trump and Russian President Vladimir Putin, during which Trump proposed a meeting in Budapest and Putin agreed, suggesting preparing for the meeting.\n\nFollowing this, a phone conversation took place between Secretary of State Marco Rubio and Russian Foreign Minister Sergey Lavrov.\n\nThe Russian foreign minister also referenced a statement from the Department of State, which indicated that the conversation between him and Rubio had been productive and that there is currently no need for further meetings.\n\nHe emphasized that the initiative from the Russian side exists, and upon receiving an invitation, they are ready to discuss the format, location, and timing of the meeting.\n\nHowever, the US side later stated that the cancellation of the invitation implies its postponement, leaving the question of next steps with the initiator. (QNA)","summary":"Moscow, October 26 (QNA) - Russian Foreign Minister Sergey Lavrov noted that the initiative to hold a high-level meeting between Russia and the United States remains relevant, but such negotiations require thorough preparation.","url":"https://qna.org.qa/en/news/news-details?id=lavrov-initiative-to-hold-putin-trump-meeting-still-on-the-table&date=26/10/2025","image":"https://cdn.qna.org.qa/media/cbyk4obq/qna_lavrof_fm0270902025.jpg?width=1200&height=900&v=1dc46d600b04550","video":null,"publish_date":"2025-10-26 22:44:08","author":null,"language":"en","category":"politics","source_country":"qa","sentiment":-0.341},{"id":372846134,"title":"US Warship USS Gravely Docks In Trinidad And Tobago, Escalating Tensions with Venezuela","text":"Port-of-Spain: A U.S. warship docked in Trinidad and Tobago 's capital Sunday as the Trump administration boosts military pressure on neighboring Venezuela and its President Nicolás Maduro.The arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation is in addition to the aircraft carrier USS Gerald R. Ford, which is moving closer to Venezuela. Maduro criticized the movement of the carrier as an attempt by the U.S government to fabricate \"a new eternal war” against his country.U.S. President Donald Trump has accused Maduro, without providing evidence, of being the leader of the organized crime gang Tren de Aragua.Government officials from the twin-island nation and the U.S. said the massive warship will remain in Trinidad until Thursday so both countries can carry out training exercises.A senior military official in Trinidad and Tobago told The Associated Press that the move was only recently scheduled. The official spoke under condition of anonymity due to lack of authorization to discuss the matter publicly.Kamla Persad-Bissessar, the prime minister of Trinidad and Tobago, has been a vocal supporter of the U.S. military presence and the deadly strikes on suspected drug boats in waters off Venezuela.U.S. Embassy Chargé d’Affaires Jenifer Neidhart de Ortiz said in a statement that the exercises seek to \"address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts.”The visit comes one week after the U.S. Embassy in Trinidad and Tobago warned Americans to stay away from U.S. government facilities there. Local authorities said a reported threat against Americans prompted the warning.Many people in Trinidad and Tobago criticize the warship's docking in town.At a recent demonstration outside the U.S. Embassy, David Abdulah, the leader of the Movement for Social Justice political party, said Trinidad and Tobago should not have allowed the warship into its waters.“This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there’s a threat of war,” said Abdulah, who is also the leader of the Movement for Social Justice political party. “That’s an abomination.”Caricom, a regional trade bloc made up of 15 Caribbean countries, has called for dialogue. Trinidad and Tobago is a member of the group, but Persad-Bissessar has said the region is not a zone of peace, citing the number of murders and other violent crimes.","summary":"US warship USS Gravely docks in Trinidad and Tobago, escalating tensions with Venezuela as Trump administration ramps up military pressure amid concerns over regional stability.","url":"https://www.republicworld.com/world-news/us-warship-uss-gravely-docks-in-trinidad-and-tobago-escalating-tensions-with-venezuela","image":"https://img.republicworld.com/all_images/us-warship-uss-gravely-docks-in-trinidad-and-tobago-escalating-tensions-with-venezuela-1761518577520-16_9.webp","video":null,"publish_date":"2025-10-26 22:43:03","author":"Associated Press Television News","authors":["Associated Press Television News"],"language":"en","source_country":"in","sentiment":-0.058},{"id":372837796,"title":"Boeing Workers Reject Contract Offer, Continue Months of Strike","text":"Thousands of machinists at three Midwest Boeing plants who develop and produce military aircraft and weapons voted Sunday to reject the company’s latest contract offer, extending a strike started nearly three months ago.\n\nA Boeing spokesperson told Newsweek in an email the company is “disappointed” with the vote but said the “vote failed by the slimmest of margins, 51% to 49%,” adding that “it’s clear many understand the value of our offer.”\n\nNewsweek has reached out to the International Association of Machinists and Aerospace Workers (IAM) for comment via email on Sunday.\n\nWhy It Matters\n\nMore than 3,200 Boeing defense workers at plants in St. Louis; St. Charles, Missouri; and Mascoutah, Illinois; have been on strike since August, rejecting the company’s contract that included a 20 percent wage increase over four years.\n\nBoeing’s defense and space security sector accounts for over a third of the company’s revenue, and is responsible for building fighter jets and weapons systems for the U.S. military. Last year, 33,000 Boeing machinists who help build commercial jets walked off the job amid heightened safety scrutiny. Around 345 people died in two separate Boeing 737 Max 8 crashes in 2018 and 2019.\n\nIn March, President Donald Trump awarded Boeing a multi-billion-dollar contract to build F-47 fighter jets. Air Force Chief of Staff General David Allvin at the time said, the new jets will be “the most advanced, lethal and adaptable fighter ever developed.”\n\nA worker performs hydraulics testing on a new F/A-18 at Boeing’s fighter aircraft production line on April 25, 2018, in St. Louis. (AP Photo/Ted Shaffrey)\n\nWhat To Know\n\nIn a Sunday vote, the workers rejected the latest contract offering by the aerospace giant. Boeing and the St. Louis Post-Dispatch reported that the vote was extremely narrow, with 51 percent voting against and 49 percent in favor. The IAM Union press release did not provide a vote tally.\n\nIAM Union says the individuals who are striking build and maintain “the F-15, F/A-18, and advanced missile and defense systems that are essential to U.S. national security.”\n\nIn September, the group pre-ratified an offer that would bring them back to work, seeking equality across regions on 401(k) retirement contributions, “strong wage increases that keep up with inflation,” and a ratification bonus comparable to other regions and non-union workers.\n\nThe picketers have rejected several offers, including a third proposal in September that included a $4,000 lump-sum signing bonus. Earlier this month, Steve Parker, the head of Boeing’s defense business, wrote in an letter to employees that “no matter how long the strike lasts, the economics won’t change,” arguing that “each of the offers we’ve put forward would give you a better deal than anything comparable we’ve seen in our region and industry, keeping our business competitive so we can keep winning and delivering together, and building on our proud St. Louis legacy for generations to come.”\n\nLast year, the 33,000 striking machinists in Washington state went on strike for over seven weeks and came back with a 38 percent wage increase over four years.\n\nWhat People Are Saying\n\nIAM Union International President Brian Bryant said in a Sunday press release: “Boeing claimed they listened to their employees – the result of today’s vote proves they have not. Boeing’s corporate executives continue to insult the very people who build the world’s most advanced military aircraft — the same planes and military systems that keep our servicemembers and nation safe. Our members aren’t going to be fooled by PR spin. It’s well past time for Boeing to stop cheaping out on the workers who make its success possible and bargain a fair deal that respects their skill and sacrifice.”\n\nA Boeing spokesperson told Newsweek in an email on Sunday: “We’re disappointed with the vote result. The union’s statement is misleading since the vote failed by the slimmest of margins, 51% to 49%. With the close result and the increased interest we’re hearing from teammates who want to cross the picket line, it’s clear many understand the value of our offer. We are turning our focus to executing the next phase of our contingency plan in support of our customers.”\n\nIAM Union Resident General Vice President Jody Bennett said in a Sunday press release: “Our members have shown incredible unity and strength throughout this strike. They’re standing up not just for themselves, but for every worker who deserves fairness, respect, and the same standard of treatment. Boeing can’t keep playing favorites between regions and expect our members to accept less.”\n\nSenator Bernie Sanders, a Vermont independent, said in an October 1 X post: “Boeing paid its CEO $18 million for 4 months of work while taking away health care benefits from 3200 machinists in St. Louis who have been on strike for 2 months & were making as little as $18 an hour. ...","summary":"Thousands of Boeing workers voted against the company&#039;s contract offer, continuing a strike that started in early August.","url":"https://www.newsweek.com/boeing-workers-reject-contract-offer-continue-months-of-strike-10941929","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/AP22215856665987.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-26 22:35:21","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"US","sentiment":-0.295},{"id":372833532,"title":"Trump oversees truce signing and trade deal flurry on first Asian stop","text":"KUALA LUMPUR >> President Donald Trump hit the ground running on the first leg of his Asian tour on Sunday, announcing a slew of trade agreements in Malaysia and joining the signing of an expanded truce between Thailand and Cambodia that he brokered in July. \n\nWithin six hours of landing in Kuala Lumpur for the summit of the Association of Southeast Asian Nations, Trump announced trade deals with four countries, met regional leaders and held talks with Brazilian President Luiz Inacio Lula da Silva, who said their teams would immediately start tariff discussions. Trump also said he was confident of hammering out a deal with Chinese President Xi Jinping ahead of an expected meeting on Thursday, as top trade officials from both sides met for a second day in Kuala Lumpur and agreed on a framework for a trade agreement.\n\nCambodia-Thailand ceasefire\n\nTop billing for Trump on Sunday was the signing of an agreement between Cambodia and Thailand, building on a ceasefire reached after he intervened to halt deadly border clashes, earning him a Nobel Peace Prize nomination by Cambodia. At a ceremony with the Thai and Cambodian leaders against a backdrop covered in U.S. insignia and the words “Delivering Peace” Trump, who has touted himself as a global truce-broker, said the agreement demonstrated his administration’s pursuit of peace “in every region where we can do it.”\n\n“My administration immediately began working to prevent the conflict from escalating,” Trump said. “Everybody was sort of amazed that we got it done so quickly.”\n\nTalks to deescalate trade war\n\nOn arriving in Malaysia, Trump was greeted by Malaysia’s premier and a troupe of ceremonial dancers, stopping briefly on the red carpet to dance with performers.\n\nAs he mingled with other leaders, U.S. and Chinese negotiators met on the sidelines to avert further escalations in a trade war between the world’s two largest economies.\n\nU.S. negotiators said the meeting had built a “successful framework” ahead of expected talks between Trump and Chinese counterpart Xi in South Korea.\n\n“I think we’re going to have a deal with China,” Trump told reporters, while Beijing’s top trade negotiator Li Chenggang said a preliminary consensus had been reached after “very intense consultations”. Both sides are looking to avert an escalation of their trade war after Trump threatened new 100% tariffs on Chinese goods and other trade curbs starting on November 1, in retaliation for China’s expanded export controls on rare earths. Within hours of landing in Malaysia, Trump and the White House had announced six trade agreements with four countries, some unexpected, including deals involving critical minerals with Thailand and Malaysia, amid competing efforts from Beijing in the rapidly growing sector.\n\nMalaysia agreed to refrain from banning or imposing quotas on exports to the United States of critical minerals or rare earth elements, the countries said. They did not specify whether Malaysia’s pledge applied to raw or processed rare earths. Trump also announced detailed frameworks towards wider trade deals with Cambodia and Thailand while the White House said an agreement had been reached with Vietnam to allow exporters in both countries “unprecedented” access to each other’s markets.\n\n‘United States is with you 100%’\n\nThe U.S. would maintain a tariff rate of 19% on most exports from Malaysia, Thailand and Cambodia, while a 20% rate on Vietnam will also be retained, the White House said. In all the agreements those tariffs could be eliminated on certain products.\n\nAddressing leaders of one of the regions hardest hit by tariffs, Trump said: “Our message to the nations of Southeast Asia is that the United States is with you 100% and we intend to be a strong partner for many generations.” Brazil’s Lula will aim to lower 50% tariffs imposed by Washington on Brazilian goods amid simmering trade tensions. In a post on X after meeting with Trump he said teams from both countries “will meet immediately to advance the search for solutions”.\n\nSpeaking alongside Lula, Trump expressed confidence of making “some pretty good deals for both countries”. A meeting with Canadian Prime Minister Mark Carney was not on the cards after talks between the neighbours came to an abrupt end. Trump said on Saturday he was increasing tariffs on Canada by an additional 10% “above what they’re paying now”.\n\nEast Timor, Asean’s newest member\n\nAsia’s youngest nation East Timor became the 11th member of the ASEAN bloc on Sunday after a 14-year wait, a landmark for a former Portuguese colony that won full independence in 2002 following an at-times bloody quarter-century occupation by neighbour Indonesia.\n\nAlso known as Timor-Leste, the country of 1.4 million people is among Asia’s poorest and hopes to see gains from integrating its fledgling economy, which at about $2 billion represents only a tiny fraction of ASEAN’s collective $3.8 trillion GDP.\n\n“This is not only a dream realised, but a powerful affirmation of our journey,” its Prime Minister Xanana Gusmao said.","summary":"KUALA LUMPUR >> President Donald Trump hit the ground running on the first leg of his Asian tour on Sunday, announcing a slew of trade agreements in Malaysia and joining the signing of an expanded truce between Thailand and Cambodia that he brokered in July.","url":"https://www.staradvertiser.com/2025/10/26/breaking-news/trump-oversees-truce-signing-and-trade-deal-flurry-on-first-asian-stop/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/10/web1_2025-10-26T151623Z_1773700161_RC2FJHAGXVRD_RTRMADP_3_ASEAN-SUMMIT.JPG","video":null,"publish_date":"2025-10-26 22:35:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.028},{"id":372831284,"title":"U.S. ramps up pressure on Venezuela as warship docks in Trinidad and Tobago","text":"A U.S. warship docked in Trinidad and Tobago ‘s capital Sunday as the Trump administration boosts military pressure on neighboring Venezuela and its President Nicolás Maduro.\n\nThe arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation is in addition to the aircraft carrier USS Gerald R. Ford, which is moving closer to Venezuela. Maduro criticized the movement of the carrier as an attempt by the U.S government to fabricate “a new eternal war” against his country.\n\nU.S. President Donald Trump has accused Maduro, without providing evidence, of being the leader of the organized crime gang Tren de Aragua.\n\nGovernment officials from the twin-island nation and the U.S. said the massive warship will remain in Trinidad until Thursday so both countries can carry out training exercises.\n\nA senior military official in Trinidad and Tobago told The Associated Press that the move was only recently scheduled. The official spoke under condition of anonymity due to lack of authorization to discuss the matter publicly.\n\nKamla Persad-Bissessar, the prime minister of Trinidad and Tobago, has been a vocal supporter of the U.S. military presence and the deadly strikes on suspected drug boats in waters off Venezuela.\n\nU.S. Embassy Chargé d’Affaires Jenifer Neidhart de Ortiz said in a statement that the exercises seek to “address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts.”\n\nThe visit comes one week after the U.S. Embassy in Trinidad and Tobago warned Americans to stay away from U.S. government facilities there. Local authorities said a reported threat against Americans prompted the warning.\n\nMany people in Trinidad and Tobago criticize the warship’s docking in town.\n\nAt a recent demonstration outside the U.S. Embassy, David Abdulah, the leader of the Movement for Social Justice political party, said Trinidad and Tobago should not have allowed the warship into its waters.\n\n“This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there’s a threat of war,” said Abdulah, who is also the leader of the Movement for Social Justice political party. “That’s an abomination.”\n\nCaricom, a regional trade bloc made up of 15 Caribbean countries, has called for dialogue. Trinidad and Tobago is a member of the group, but Persad-Bissessar has said the region is not a zone of peace, citing the number of murders and other violent crimes.","summary":"The arrival of the USS Gravely in the capital of the Caribbean nation is in addition to the aircraft carrier USS Gerald R. Ford, which is moving closer to Venezuela.","url":"https://globalnews.ca/news/11495748/us-warship-docked-trinidad-tobago-venezuela-pressure/","image":"https://globalnews.ca/wp-content/uploads/2025/10/uss-gravely.jpg?quality=65&#038;strip=all","video":null,"publish_date":"2025-10-26 22:32:52","author":"Globalnews Digital,The Associated Press","authors":["Globalnews Digital","The Associated Press"],"language":"en","source_country":"ca","sentiment":-0.063},{"id":372837010,"title":"Western Union Reports Fewer U.S. Dollars Being Sent Home by Migrants","text":"In another example of the Trump effect, money transfer giant Western Union is reporting that its revenue from cash transfers to locations outside the U.S. has seen a 12 percent decline this year.\n\nMigrants living in the U.S. both legally and illegally have traditionally been the greatest source of U.S. dollars flowing out of America and into foreign nations, even dwarfing the amount of foreign aid lavished on the world by the U.S. government. But with Donald Trump’s focus on immigration, Western Union is seeing far fewer customers needing their services.\n\nLast week, Western Union CEO Devin McGranahan told investors that the company had seen a huge decline in cash transfers to Mexico, El Salvador, Peru, and Ecuador, according to CPR News.\n\nWATCH — ICE Houston Officers Arrest Alleged Drunk Driving Illegal Alien in Nighttime Operation:\n\n“Recent policy changes have led to a substantial decline in border crossings and an increase in enforcement actions including workplace inspections and deportations which have created uncertainty and hesitation within migrant communities. These developments continue to impact customer behavior,” McGranahan said during the call with investors.\n\nThe loss of business sent Western Union’s stock down 15 percent this year.\n\n“We’re seeing this kind of an event that really hits them in the heart … The core of their business is U.S. to Latin America, and we’re seeing it getting hit across the board,” business analyst Brett Horn told CPR News.\n\nThe remarks last week by McGranahan are not the first to note the large drop in cash transfers to foreign nations, which are often termed “remittances.”\n\nIn August, the Latin Times noted that remittances from Mexico dropped more than 15 percent over 2024.\n\nThe amount sent by foreign nationals living in the U.S. is incredible, too. In total, about $63 billion has been sent in remittances from the U.S. to Mexico in the last 12 months — and that is less than 2023 and 2024’s totals.\n\nOther countries are also the happy recipients of hundreds of millions in U.S. dollars.\n\nWATCH — Democrats Threaten to Go After ICE Agents if They Take Back Power:\n\nIn January 2025, Nicaragua received $373.5 million in remittances, for instance. A World Bank report found that remittances amounted to 27 percent of Nicaragua’s Gross Domestic Product (GDP) in 2024.\n\nOther nations receiving huge amounts in cash sent home by foreign nationals living in the U.S. include El Salvador ($8.479 billion in 2024), Peru ($4.945 billion), Ecuador ($6.54 billion), and India ($135.46 billion).\n\nBy contrast, the U.S. government only lays out about $80 billion a year in direct foreign aid.\n\nWhile many criticize foreign aid doled out by Congress, claiming that the U.S. doesn’t really benefit from the expenditures, remittances are fully a detriment to America. It is money that does not go to benefit our local stores, our schools, our cities, or anything else. It is cash summarily sent away to benefit other countries.\n\nFollow Warner Todd Huston on Facebook at: Facebook.com/Warner.Todd.Huston, Truth Social @WarnerToddHuston, or at X/Twitter @WTHuston","summary":"Western Union is reporting that its revenue from cash transfers to locations outside the U.S. has seen a 12 percent decline this year.\n\n\nThe post Western Union Reports Fewer U.S. Dollars Being Sent Home by Migrants appeared first on Breitbart.","url":"https://www.breitbart.com/immigration/2025/10/26/western-union-reports-fewer-u-s-dollars-being-sent-home-by-migrants/","image":"https://media.breitbart.com/media/2025/10/AP24173602702309-640x335.jpg","video":null,"publish_date":"2025-10-26 22:30:21","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","source_country":"US","sentiment":-0.263},{"id":372837002,"title":"Avril Lavigne, Blink-182, Weezer Among Rockers at Politically Charged Las Vegas Concert: 'Destroy American Fascism'","text":"Rock stars including Avril Lavigne, Blink-182, Weezer, Simple Plan, The Offspring, and The Used, were among the artists to hit the stage in Las Vegas to express support for Palestine and denounce President Donald Trump’s administration.\n\nThe music groups were part of the “When We Were Young” concert held over a series of days earlier in October that cost fans a minimum of $425 a ticket and up.\n\nView this post on Instagram\n\nA post shared by When We Were Young Festival (@whenwewereyoungfest)\n\nMany of the artists involved expressly showed their support for Palestine and other left-wing political causes with anti-Trump slogans.\n\nThe artists mixed extreme, left-wing political messages with music. Used singer Bert McCracken, for instance, yelled “Freedom for fucking Palestine” from the stage, while Offspring guitarist donned a “No Kings” t-shirt. Meanwhile Story of the Year’s bassist Adam Russell wore a shirt with the message “Destroy American Fascism.” The band Used also unfurled a “Freedom for Palestine” flag during their set, according to the Hollywood Reporter.\n\nThe event was chiefly sponsored by convenience store chain 7 Eleven, but a number of other companies include rideshare co. Lyft, beer maker Coors, Club Wyndham, Don Julio and many more.\n\nThe festival was launched in 2017 as annual concert featuring emo, pop-punk, and alternative rock bands from the early 2000s.\n\nFollow Warner Todd Huston on Facebook at: Facebook.com/Warner.Todd.Huston, Truth Social @WarnerToddHuston, or at X/Twitter @WTHuston","summary":"Artists including Avril Lavigne, Blink-182, Weezer, Simple Plan, The Offspring, and more hit the stage in to express support for Palestine.\n\n\nThe post Avril Lavigne, Blink-182, Weezer Among Rockers at Politically Charged Las Vegas Concert: &#8216;Destroy American Fascism&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/10/26/avril-lavigne-blink-182-weezer-among-rockers-at-politically-charged-las-vegas-concert-destroy-american-fascism/","image":"https://media.breitbart.com/media/2025/10/BertMcCracken-640x335.jpg","video":null,"publish_date":"2025-10-26 22:27:07","author":"Warner Todd Huston,When We Were","authors":["Warner Todd Huston","When We Were"],"language":"en","category":"politics","source_country":"US","sentiment":0.33},{"id":372832140,"title":"Mark Sanchez Breaks Silence to Pay Tribute to Former New York Jets Teammate Nick Mangold","text":"Skip to main content\n\nOctober 26, 2025 3:25pm\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nMark Sanchez #6 and Nick Mangold #74 during a New York Jets against the San Diego Chargers game in 2011.\n\nNick Laham/Getty Images\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nMark Sanchez is paying tribute to his former New York Jets teammate Nick Mangold.\n\nSanchez took to Instagram on Sunday to share a heartfelt message remembering Mangold, who died Saturday at age 41 of complications from kidney disease. The two used to be teammates on the New York Jets for four seasons. from 2009-12.\n\n“We lost a good man today,” Sanchez wrote. “I know @realnickmangold will be a hall-of-famer, but there’s more to his story than his accomplishments on the gridiron. He was more than a teammate. He was my big brother who introduced me to the NFL. He showed me the ropes. He was my friend and confidant. He was a role model and a great father to his children and husband to his wife. Our hearts are heavy. We will miss you. Rest easy amigo. I love you big fella. #74.”\n\nRelated Stories\n\nJune Lockhart, Beloved Mom on 'Lassie' and 'Lost in Space,' Dies at 100\n\nGreen Bay Packers vs. Pittsburgh Steelers: How to Watch 'Sunday Night Football' Online Without Cable for Free\n\nThe post, which shared photos of him and Mangold during Jets games as well as them on a cover of Sports Illustrated, comes after Sanchez has remained silent on social media for the past couple of weeks since his arrest.\n\nView this post on Instagram\n\nEarlier this month, the Fox Sports analyst was hospitalized following a stabbing incident. On Oct. 4, Sanchez was arrested and faced with misdemeanor charges. However, on Oct. 6, Sanchez was charged with a level five felony battery resulting in serious bodily injury, which carries a potential sentence of up to six years in prison.\n\nAccording to the Associated Press, the incident in which Sanchez was injured happened over parking. Sanchez allegedly approached a 69-year-old truck driver who backed into a hotel’s loading docks in downtown Indianapolis. This caused a confrontation and the truck driver pulled out a knife to allegedly defend himself.\n\nSanchez’s trial date is set for Dec. 11.\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nDiane Keaton\n\nDiane Keaton’s Former Beverly Hills Estate Listed for $25M\n\nGavin Newsom\n\nGavin Newsom Considers 2028 Presidential Run: “I’d Be Lying Otherwise”\n\nKamala Harris Says She’s “Not Done” With Politics\n\nunited talent agency\n\nUTA Chief Jay Sures Denounces Antisemitism at Jewish Federation Los Angeles Gala\n\nGeneral News\n\nPeter Zerzan’s ‘The Tourist’ Begins Its Festival Journey at the 20th San Francisco Short Film Festival\n\ndonald trump\n\nHistoric White House Movie Theater Demolished as Part of $300 Million Ballroom Build\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"Mangold died Saturday at age 41 of complications from kidney disease.","url":"https://www.hollywoodreporter.com/news/general-news/mark-sanchez-breaks-silence-remembers-nick-mangold-jets-1236410428/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/10/GettyImages-130116141.jpg","video":null,"publish_date":"2025-10-26 22:25:43","author":"Lexi Carson","authors":["Lexi Carson"],"language":"en","source_country":"US","sentiment":0.166}]}