{"offset":0,"number":50,"available":10258,"news":[{"id":328211714,"title":"Trump Bans New Visas for Foreign Nationals From 12 Countries","text":"President Donald Trump on June 4 issued a full suspension on new visas for foreign nationals from a dozen countries applying for entry to the United States and a partial suspension on nationals from another seven.\n\nTitled “Restricting the Entry of Foreign Nationals to Protect the United States from Foreign Terrorists and Other National Security and Public Security Threats,” the proclamation follows Trump’s Day 1 executive order, “Protecting the United States from Foreign Terrorists and Other National Security and Public Safety Threats,” and is set to go into effect at 12:01 a.m. ET on June 9.","summary":"The president says the entry of these persons 'would be detrimental to the interests of the United States.'","url":"https://www.theepochtimes.com/us/trump-bans-new-visas-for-foreign-nationals-from-12-countries-5868072","image":"https://img.theepochtimes.com/assets/uploads/2025/06/04/id5868014-GettyImages-2217514835-300x180.jpg","video":null,"publish_date":"2025-06-05 01:08:13","author":"T.j. Muscaro","authors":["T.j. Muscaro"],"language":"en","category":"politics","source_country":"us","sentiment":0.329},{"id":328209548,"title":"Trump signs bombshell travel ban restricting people from 19 countries from entering the US","text":"President Donald Trump has banned visitors from 12 countries from entering the United States and partially restricted travelers from seven other nations.\n\nThe move is the latest in Trump's efforts to secure America's borders after a Colorado terror attack in which an Egyptian national who overstayed his visa allegedly set people alight at a pro-Israel demonstration.\n\nNationals of Afghanistan, Chad, Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Myanmar, Somalia, Sudan and Yemen will be barred from entering the United States under the new proclamation.\n\nFurther to that ban, citizens of Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will be partially restricted from traveling.\n\n'We don't want 'em,' Trump said in a video released shortly after the ban was announced. \n\n'Very simply, we cannot have open migration from any country where we cannot safely and reliably vet and screen.' \n\nTrump cited the recent terror attack in Boulder as an example of why such a ban is a necessary step to keep Americans safe.\n\nMohamed Soliman, who had overstayed his visa and was residing in the US illegally, is now in custody accused of firebombing a group as they gathered to honor the hostages still trapped in Gaza by Hamas militants.\n\nTrump said the tragedy 'underscored the extreme dangers posed to our country by the entry of foreign nationals who are not properly vetted.\n\n'We've seen one terror attack after another from foreign visa overstayers... thanks to Biden's open door policies today there are millions and millions of these illegals who should not be in our country.'\n\nWhite House Deputy Press Secretary Abigail Jackson confirmed the report on Wednesday evening, writing on X: 'President Trump is fulfilling his promise to protect Americans from dangerous foreign actors that want to come to our country and cause us harm. \n\n'These commonsense restrictions are country-specific and include places that lack proper vetting, exhibit high visa overstay rates, or fail to share identity and threat information. \n\n'President Trump will ALWAYS act in the best of interest of the American people and their safety.'\n\nDuring his first term in office, Trump announced a ban on travelers from seven majority-Muslim nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.\n\nFormer President Joe Biden, a Democrat who succeeded Trump, repealed the ban in 2021, calling it 'a stain on our national conscience.'\n\nBut Trump has not backed down, referring to the success of his initial 2017 travel bans in his proclamation.\n\n'During my first Administration, I restricted the entry of foreign nationals into the United States, which successfully prevented national security threats from reaching our borders and which the Supreme Court upheld,' the president wrote. \n\n'It is the policy of the United States to protect its citizens from aliens who intend to commit terrorist attacks, threaten our national security, espouse hateful ideology, or otherwise exploit the immigration laws for malevolent purposes.\n\n'The United States must be vigilant during the visa-issuance process to ensure that those aliens approved for admission into the United States do not intend to harm Americans or our national interests. \n\n'More importantly, the United States must identify such aliens before their admission or entry into the United States. \n\n'The United States must ensure that admitted aliens and aliens otherwise already present in the United States do not bear hostile attitudes toward its citizens, culture, government, institutions, or founding principles, and do not advocate for, aid, or support designated foreign terrorists or other threats to our national security.' \n\nTrump said the list is 'subject to revision' if nations work toward improving the vetting system of their nationals.\n\nSimilarly, other nations can be added to the list if Trump later believes they pose a risk to national security. \n\nBut as it stands, the nations included on the list have disappointed Trump in various ways, either by having a high rate of nationals who overstay their visas or by limiting the United States' access to security data. \n\nEritrea, for example, has been included on the list because 'the United States questions the competence of the central authority for issuance of passports or civil documents in Eritrea.'\n\nTrump wrote: 'Criminal records are not available to the United States for Eritrean nationals. Eritrea has historically refused to accept back its removable nationals.'\n\nWhereas the primary concern for Iranian nationals is that the government 'is a state sponsor of terrorism.'\n\nIn that instance, Trump argued 'Iran regularly fails to cooperate with the United States Government in identifying security risks, is the source of significant terrorism around the world, and has historically failed to accept back its removable nationals.'\n\nHaitian nationals, Trump argued, have a higher likelihood of trying to overstay their visas.\n\n'Additionally, hundreds of thousands of illegal Haitian aliens flooded into the United States during the Biden Administration,' the president said.\n\n'This influx harms American communities by creating acute risks of increased overstay rates, establishment of criminal networks, and other national security threats.'\n\nThe inclusion of Somalia comes after 'The United States Government identified Somalia as a terrorist safe haven. \n\n'Terrorists use regions of Somalia as safe havens from which they plan, facilitate, and conduct their operations.'\n\nTrump added that 'many of these countries have also taken advantage of the United States in their exploitation of our visa system and their historic failure to accept back their removable nationals.'\n\nTrump said the decision was made in collaboration with Secretary of State Marco Rubio, Secretary of Defense Pete Hegseth, Attorney General Pam Bondi, Secretary of Homeland Security Kristi Noem, Director of National Intelligence Tulsi Gabbard, and Director of the Central Intelligence Agency John Ratcliffe.\n\nFor the seven nations who have had their access to the United States severely restricted, Trump has clarified that authorities will no longer accept any immigrant visa applications.\n\nAdditionally, a host of nonimmigrant visa options will be revoked, and those that remain will have 'reduced validity... to the extent permitted by law.' \n\nLooking ahead to the 2028 Los Angeles Olympics, Trump has already added a clause in his proclamation which states: 'Any athlete or member of an athletic team, including coaches, persons performing a necessary support role, and immediate relatives, traveling for the World Cup, Olympics, or other major sporting event' will be exempt.","summary":"President Donald Trump has banned visitors from 12 countries from entering the United States and partially restricted travelers from seven other nations.","url":"https://www.dailymail.co.uk/news/article-14781963/trump-travel-ban-12-countries-united-states-access.html","image":"https://i.dailymail.co.uk/1s/2025/06/05/00/99056311-0-image-m-62_1749081078868.jpg","video":null,"publish_date":"2025-06-05 00:55:10","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.167},{"id":328209546,"title":"Trump suspends Harvard University's foreign student visa program for 'undermining' national security","text":"President Donald Trump has banned foreign nationals from studying at Harvard University in the latest escalation on his clash with the Ivy League institution.\n\nThe president issued an executive order Wednesday entitled Enhancing National Security by Addressing Risks at Harvard University, which suspends the Ivy League's student visa program - declaring that is a 'privilege granted by our government, not a guarantee.'\n\nHe also doubled down on his claims that the school violated federal law, and argued it is important to limit international students for national security reasons while he also restricted travel from a dozen countries.\n\n'The Federal Bureau of Investigation has long warned that foreign adversaries and competitors take advantage of easy access to American higher education to, among other things, steal technical information and products, exploit expensive research and development to advance their own ambitions and spread false information for political or other reasons,' the executive order states.\n\n'Our adversaries, including the People's Republic of China try to take advantage of American higher education by exploiting the student visa program for improper purposes and by using visiting students to collect information at elite universities in the United States.'\n\nHarvard has nearly 6,800 international students, who made up more than 27 percent of its enrollment in the past academic year, according to the BBC.\n\nAbout one-third of those international students are from China, and Trump has previously accused the Ivy League school of 'coordinating with the Chinese Communist Party.'\n\nIn his executive order on Wednesday - one of several that he issued - Trump further claims that Harvard failed 'to identify and address misconduct by those foreign students' amid his crackdown on universities that allowed antisemitic protests on campus during the war in Gaza.\n\n'In my judgment, it presents an unacceptable risk to our nation's security for an academic institution to refuse to provide sufficient information, when asked, about known instances of misconduct and criminality committed by its students,' he wrote, claiming that crime rates at the Massachusetts campus have 'drastically risen.'\n\n'When a university refuses to uphold its legal obligations, including its recordkeeping and reporting obligations, the consequences ripple far beyond the campus,' the executive order continues.\n\n'They jeopardize the integrity of the entire United States student and exchange visa system , compromise national security and embolden other institutions to similarly disregard the rule of law.' \n\nThe president then went on to reassert that Harvard is working with the Chinese Communist Party, claiming that it received more than $150 million from the country over the past decade.\n\nIn return, Trump writes that the Ivy League has 'repeatedly hosted and trained members of a Chinese Communist Party paramilitary organization,' citing a probe by the House of Representatives Select Committee on the Chinese Communist Party.\n\nThat same probe also claims Harvard has partnered with the Chinese 'on research that could advance China's military modernization.' \n\nThis is a breaking news story and will be updated.","summary":"President Donald Trump has officially declared he will restrict foreign nationals from studying at Harvard University.","url":"https://www.dailymail.co.uk/news/article-14782009/Trump-suspends-Harvard-University-foreign-student-visa-program-national-security.html","image":"https://i.dailymail.co.uk/1s/2025/06/05/01/99056751-0-image-a-9_1749083003706.jpg","video":null,"publish_date":"2025-06-05 00:54:32","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","category":"politics","source_country":"gb","sentiment":0.105},{"id":328211408,"title":"Trump moves to block foreigners from study at Harvard","text":"Nearly all foreign students will be blocked from entering the US to attend Harvard University, in Donald Trump's latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body.\n\nIn an executive order signed Wednesday, Trump declared that it would jeopardise national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts.\n\n\"I have determined that the entry of the class of foreign nationals described above is detrimental to the interests of the United States because, in my judgement, Harvard's conduct has rendered it an unsuitable destination for foreign students and researchers,\" Trump wrote in the order.\n\nIt's a further escalation in the White House's fight with the nation's oldest and wealthiest university. A federal court in Boston blocked the Department of Homeland Security from barring international students at Harvard last week. Trump's order invokes a different legal authority.\n\nIt stems from Harvard's refusal to submit to a series of demands made by the federal government. It has escalated recently after the Department of Homeland Security said Harvard refused to provide records related to misconduct by foreign students.\n\nHarvard says it has complied with the request, but the government said the school's response was insufficient.\n\nMeanwhile, the US Department of Education has notified a university accreditation body that it believes Columbia University violated federal anti-discrimination laws by an alleged failure to protect Jewish students on its campus.\n\nThe alleged violation means that Columbia has not met the standards of accreditation set by the Middle States Commission on Higher Education, the department said.\n\n\"Accreditors have an enormous public responsibility as gatekeepers of federal student aid. They determine which institutions are eligible for federal student loans and Pell Grants,\" US Secretary of Education Linda McMahon said in a statement.\n\nA spokesperson for Columbia, which has been under pressure from the Trump administration for months, said in a statement that the school addressed the department's concerns directly with the Middle States Commission on Higher Education and is continuing to work with the federal government to address anti-semitism.\n\nColumbia has been the epicentre of a pro-Palestinian and anti-Israel student protest movement that has roiled US campuses over the last year and a half as Israel's war in Gaza raged.\n\nThe Department of Education and the Department of Health and Human Services said last month an investigation found that the university had acted with \"deliberate indifference\" toward the harassment of Jewish students during campus protests.\n\nColumbia had previously said it would work with the government to address antisemitism, harassment and discrimination.\n\nwith Reuters","summary":"In the latest escalation of his dispute with Harvard University, Donald Trump has moved to block foreign students from entering the country to study there.","url":"https://thewest.com.au/politics/trump-moves-to-block-foreigners-from-study-at-harvard-c-18930775","image":"https://images.thewest.com.au/publication/C-18930775/85ea55bdce314561fc4f07651dd28e821c790b53-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-06-05 00:52:42","author":"COLLIN BINKLEY,Collin Binkleyapth","authors":["COLLIN BINKLEY","Collin Binkleyapth"],"language":"en","category":"politics","source_country":"au","sentiment":-0.534},{"id":328211388,"title":"ICE agents arrest a dozen immigrants as elected officials try to block them in the South Loop","text":"Advocates say about a dozen immigrants were arrested by federal immigration agents Wednesday after receiving text messages to show up for a routine immigration appointment at an office located at 2245 S.Michigan in the South Loop. The arrests are part of President Donald Trump’s ongoing efforts to crack down on immigration. Several reports indicate the administration has set new goals to increase the number of arrests immigration officers must make each day.\n\nIt’s unclear exactly how many people were arrested in total, but earlier in the afternoon Organized Communities Against Deportation, an organization that advocates for immigrants, sounded the alarm on social media about a long-time member who was detained after being asked to show up for a check- in with immigration.\n\nOCAD’s call to action drew attention from rapid response advocacy teams across the city and elected officials who arrived at the scene as families and immigration advocates waited for more information.\n\n“We were notified about the activities that were happening at this location earlier today,” said Ald. Anthony Quezada, 35th Ward, who spoke at a gathering that took place following the arrests. “I spoke with family members of people who were detained, saying that they had no information about the status of their [relatives].”\n\nAld. Quezada said he and others went inside the building to get more information about the individuals who were getting arrested but were met with hostility by officers inside the building. Quezada says he was shocked to see Chicago police department officers standing by federal agents as they escorted people out.\n\n“We have sanctuary laws in the city. We have the Trust Act, you know, law in the state of Illinois, we want to make sure that our local law enforcement is compliant with the laws that we passed,” Quezada said.\n\nBoth the Welcoming City ordinance and the Trust Act prohibit local law enforcement agents from collaborating with ICE officials to arrest and detain immigrants.\n\nIn a statement a Chicago Police Department spokesperson said officers responded to two calls to assist a police officer.\n\n“Officers arrived without knowledge of immigration enforcement occurring at the location. CPD spoke with individuals inside a building at the location, as well as the large crowd gathered outside. CPD was on-site to ensure the safety of all involved, including those exercising their First Amendment rights.”\n\nCPD says it did not assist in immigration enforcement and that all actions taken by the department during this incident were “ in accordance with CPD policy and the City of Chicago Municipal Code, including the Welcoming City Ordinance. “\n\nCPD said it didn’t make any arrests.\n\nShortly after CPD officials left Quezada said he saw ICE officials and federal agents amassing vehicles into a driveway nearby. He says along with Ald. Rossana Rodriguez and Cook County Commissioner Jessica Vasquez, they tried to block the driveway in an act of civil disobedience and to block the agent’s passage.\n\n“Then, in a Gestapo fashion, 50 agents or so walked down the street, stood right here in front of the driveway, then aggressively came through, knocked me down, assaulted me and other community members here today, then pulled out weapons and also pulled out their sticks, pushing some of us, punching some of us to get through to this driveway,” Quezada said, adding that he was pushed three times by ICE agents.\n\nAfter that chaotic interaction, he and other advocates say at least 10 people were brought out in handcuffs. “Fathers, our neighbors, mothers, people were coming out here in line, crying, crying, demanding that they not be taken away, while their family members stood on the side crying for them to be released,” Quezada said.\n\n“What we saw today is Gestapo style abductions happening in front of all of us,” Ald.Byron Sigcho Lopez, who also arrived at the scene. He demanded an investigation of what he calls the “proud boys, extremists” who arrested immigrants.\n\n“Who did they protect? Who did they serve?” Sigcho Lopez asked the crowd. “These are people who came to renew their work permits. Now we have a 10 year old boy without a mother.”","url":"https://chicago.suntimes.com/immigration/2025/06/04/elected-officials-tried-to-stop-ice-from-making-arrests-in-the-south-loop","image":"https://cst.brightspotcdn.com/dims4/default/c24d432/2147483647/strip/true/crop/3000x1713+0+144/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F2f%2F33%2Fb3c86d8c4e559cb6edbf61f16685%2Ficer","video":null,"publish_date":"2025-06-05 00:52:15","author":"Adriana Cardona-Maguigad | WBEZ","authors":["Adriana Cardona-Maguigad | WBEZ"],"language":"en","category":"politics","source_country":"us","sentiment":-0.47},{"id":328208344,"title":"Iran's World Cup status revealed after Donald Trump's USA travel ban","text":"BREAKING NEWSIran's World Cup status revealed after Donald Trump's USA travel ban\n\nREAD MORE: Teenage swimming star shatters Michael Phelps record \n\nBy JACK BEZANTS\n\nPublished: 01:30 BST, 5 June 2025 | Updated: 01:49 BST, 5 June 2025\n\nIran are one of 12 nations being placed on a United States travel ban as of Monday, but their soccer team will be allowed to compete in the World Cup next summer.\n\nTrump resurrected the ban from his first term on Wednesday night, signing a document preventing nationals from a dozen countries from entering the US.\n\n'I must act to protect the national security and national interest of the United States and its people,' Trump said in his proclamation.\n\nBut the White House has confirmed to Daily Mail that exemptions are in place for 'athletes or members of athletic teams, including coaches and support staff, and athletes traveling for the World Cup, Olympics or other sporting events'.\n\nIran qualified for next summer's tournament in March this year - one of only seven teams to officially make it as it stands.\n\nThe United States is hosting the 48-team competition next summer alongside Canada and Mexico, while Los Angeles is hosting the 2028 Olympic Games which will fall under Trump's second term as President.\n\nPresident Donald Trump placed a travel ban on 12 countries on Wednesday evening\n\nThe World Cup runs from June 11 until July 19 next year, with the final held at MetLife Stadium, just outside of New York. \n\nThe other countires included in Trump's ban are Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Libya, Somalia, Sudan and Yemen. \n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on 'hostile attitudes' toward the U.S. and whether entry from certain countries represented a national security risk. \n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela. \n\nOlympicsIran\n\nShare or comment on this article:\nIran's World Cup status revealed after Donald Trump's USA travel ban\n\nAdd comment","summary":"Trump resurrected the ban from his first term on Wednesday night, signing a document preventing nationals from a dozen countries from entering the US.","url":"https://www.dailymail.co.uk/sport/football/article-14782037/Iran-World-Cup-status-revealed-Donald-Trump-travel-ban.html","image":"https://i.dailymail.co.uk/1s/2025/06/05/01/99056977-0-image-m-13_1749083357126.jpg","video":null,"publish_date":"2025-06-05 00:49:17","author":"Editor,Jack Bezants","authors":["Editor","Jack Bezants"],"language":"en","source_country":"gb","sentiment":0.286},{"id":328207244,"title":"World News | Trump Orders Investigation in Biden While House Republicans Request Interviews for Their Own Probe","text":"Washington, Jun 5 (AP) President Donald Trump on Wednesday ordered his administration to investigate former President Joe Biden's use of an autopen to sign pardons and other documents, increasing the pressure on his predecessor as House Republicans also requested interviews with members of Biden's inner circle. An autopen is a mechanical device that is used to replicate a person's authentic signature, and presidents have used them for decades. However, Trump has frequently suggested that some of Biden's actions are invalid because his aides were usurping presidential authority to cover up what Trump claims is Biden's cognitive decline. Also Read | Operation Sindoor Outreach: Shashi Tharoor-Led Multi-Party Delegation Meets US Representatives, Congressmen in Washington DC. “This conspiracy marks one of the most dangerous and concerning scandals in American history,” Trump wrote in a memo. “The American public was purposefully shielded from discovering who wielded the executive power, all while Biden's signature was deployed across thousands of documents to effect radical policy shifts.” Trump directed Attorney General Pam Bondi and White House Counsel David Warrington to handle the investigation. Also Read | Nagpur Woman Sunita Jamgade, Who Crossed Into Pakistan for Love, Used Google Maps To Cross LoC: Report. Meanwhile, House Oversight Chairman James Comer of Kentucky, a Republican, requested transcribed interviews with five Biden aides, alleging they had participated in a “cover-up\" that amounted to “one of the greatest scandals in our nation's history.” “These five former senior advisors were eyewitnesses to President Biden's condition and operations within the Biden White House,” Comer said in a statement. “They must appear before the House Oversight Committee and provide truthful answers about President Biden's cognitive state and who was calling the shots.” Interviews were requested with White House senior advisers Mike Donilon and Anita Dunn, former White House chief of staff Ron Klain, former deputy chief of staff Bruce Reed and Steve Ricchetti, a former counselor to the president. Comer reiterated his call for Biden's physician, Kevin O'Connor, and former senior White House aides Annie Tomasini, Anthony Bernal, Ashley Williams and Neera Tanden to appear before the committee. He warned subpoenas would be issued this week if they refuse to schedule voluntary interviews. “I think that people will start coming in the next two weeks,” Comer told reporters. He added that the committee would release a report with its findings, “and we'll release the transcribed interviews, so it'll be very transparent.” Democrats have dismissed the effort as a distraction. “Chairman Comer had his big shot in the last Congress to impeach Joe Biden and it was, of course, a spectacular flop,” said Rep. Jamie Raskin, the Maryland Democrat who served as the ranking member on the oversight committee in the previous Congress. “And now he's just living off of a spent dream. It's over. And he should give up the whole thing.\" Republicans on the committee are eager to pursue the investigation. “The American people didn't elect a bureaucracy to run the country,\" said Rep. Brandon Gill, a freshman Republican from Texas. “I think that the American people deserve to know the truth and they want to know the truth of what happened.\" The Republican inquiry so far has focused on the final executive actions of Biden's administration, which included the issuing of new federal rules and presidential pardons that they claim may be invalid. Comer cited the book “Original Sin” by CNN's Jake Tapper and Axios' Alex Thompson, which details concerns and debates inside the White House and Democratic Party over Biden's mental state and age. In the book, Tapper and Thompson wrote, “Five people were running the country, and Joe Biden was at best a senior member of the board.” Biden and members of his family have vigorously denied the book's claims. “This book is political fairy smut for the permanent, professional chattering class,” said Naomi Biden, the former president's granddaughter. Biden withdrew from the presidential race last summer after a debate against Trump in which he appeared to lose his train of thought multiple times, muttered inaudible answers and misnamed different government programs. The disastrous debate performance pushed questions about his age and mental acuity to the forefront, ultimately leading Biden to withdraw from the presidential race. He was replaced on the ticket by Kamala Harris, who lost the election to Trump. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.    President Donald Trump on Wednesday ordered his administration to investigate former President Joe Biden's use of an autopen to sign pardons and other documents, increasing the pressure on his predecessor as House Republicans also requested interviews with members of Biden's inner circle.","url":"https://www.latestly.com/agency-news/world-news-trump-orders-investigation-in-biden-while-house-republicans-request-interviews-for-their-own-probe-6906415.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-05 00:46:07","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.117},{"id":328206434,"title":"Trump travel ban: Trump bars entry to US from 12 countries","text":"Early in Donald Trump's first term, he announced a ban on travel from seven Muslim-majority countries from entering the US. \n\nIt followed a campaign promise he made in 2015 for \"a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what is going on\".\n\nThousands of tourists, migrants, business visitors and US green card holders were immediately thrown into limbo at airports around the world, as airlines and global immigration authorities tried to work out the details. Many were turned away mid trip or prevented from boarding flights bound for the US.\n\nThe so-called \"travel ban\" sparked nearly instant pushback, with protesters in cities like New York and Washington DC taking to the streets. Demonstrators for and against the ban also gathered at airports for protests. \n\nCourt rulings temporarily blocked the policy, and the administration revised the order multiple times, variously narrowing or widening its scope.\n\nA 5-4 decision from the Supreme Court in 2018 allowed the ban to continue, overruling lower courts that found it to be unconstitutional. \n\nTrump garnered a major win and it was allowed to take full effect.","url":"https://www.bbc.com/news/live/cvgqwyxxpzgt","image":"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/a7bf/live/e5a9d210-41a0-11f0-bace-e1270fc31f5e.jpg","video":null,"publish_date":"2025-06-05 00:43:50","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.501},{"id":328208060,"title":"Trump announces travel ban barring nationals of a dozen countries from entering the United States","text":"US President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation on Wednesday night that prevents people from a dozen countries from entering the United States.The countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.In addition to the ban, which takes effect at midnight on Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.The list results from an executive order Trump issued on inauguration day – 20 January – requiring the departments of State, Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the US and whether entry from certain countries represented a national security risk.During his first term, Trump issued an executive order in January 2017 banning travel to the US by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.It was one of the most chaotic and confusing moments of his young presidency. Travellers from those nations were either barred from getting on their flights to the US or detained at US airports after landing.They included students and faculty as well as businesspeople, tourists and people visiting friends and family.The order, often referred to as the “Muslim ban” or “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.The ban affected various categories of travellers and immigrants from Iran, Somalia, Yemen, Syria and Libya and North Korea and some Venezuelan government officials and their families.Trump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias.However, the president had called for an explicit ban on Muslims during his first campaign for the White House.","summary":"The ban is set to go into effect on Monday, barring nationals of a dozen countries from entering the United States, in a resurrection of his controversial first term “Muslim ban” policy.","url":"https://www.euronews.com/2025/06/05/trump-announces-travel-ban-barring-nationals-of-a-dozen-countries-from-entering-the-united","image":"https://static.euronews.com/articles/stories/09/31/63/41/1440x810_cmsv2_a0f46755-bb27-5887-b974-2f48c5ce7026-9316341.jpg","video":null,"publish_date":"2025-06-05 00:42:25","author":"Malek Fouda","authors":["Malek Fouda"],"language":"en","category":"politics","source_country":"fr","sentiment":0.055},{"id":328210640,"title":"Trump moves to block US entry for foreigners planning to study at Harvard University","text":"WASHINGTON (AP) — President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body.\n\nIn an executive order signed Wednesday, Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts.\n\n“I have determined that the entry of the class of foreign nationals described above is detrimental to the interests of the United States because, in my judgment, Harvard’s conduct has rendered it an unsuitable destination for foreign students and researchers,” Trump wrote in the order.\n\nIt’s a further escalation in the White House’s fight with the nation’s oldest and wealthiest university. A federal court in Boston blocked the Department of Homeland Security from barring international students at Harvard last week. Trump’s order invokes a different legal authority.\n\nIt stems from Harvard’s refusal to submit to a series of demands made by the federal government. It has escalated recently after the Department of Homeland Security said Harvard refused to provide records related to misconduct by foreign students.\n\nHarvard says it has complied with the request, but the government said the school’s response was insufficient.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — President&#160;Donald Trump&#160;is moving to block nearly all foreign students from entering the country to attend Harvard University, his&#160;latest attempt&#160;to choke the Ivy...","url":"https://whdh.com/news/trump-moves-to-block-us-entry-for-foreigners-planning-to-study-at-harvard-university/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/04/harvard_605804.jpg?quality=60&strip=color","video":null,"publish_date":"2025-06-05 00:42:24","author":"Associated Press,Michael Mahar","authors":["Associated Press","Michael Mahar"],"language":"en","category":"politics","source_country":"us","sentiment":-0.722},{"id":328208606,"title":"Morning Digest: 11 die in stampede as RCB victory celebrations turn tragic at Bengaluru; MHA says next census to be completed by March 1, 2027, and more","text":"11 die in stampede as RCB victory celebrations turn tragic at Bengaluru\n\nWhat began as a day of rapturous celebration over the IPL victory of Royal Challengers Bengaluru (RCB) turned into one of crushing tragedy in Bengaluru on Wednesday evening when 11 people -- all aged below 40 -- died and 33 were injured when a massive build up of fans at the M. Chinnaswamy Stadium led to chaos and stampede.\n\nNext census to be completed by March 1, 2027: Centre\n\nIndia will count its population by March 1, 2027, in a census to be held after an unprecedented 16-year gap, the Union Ministry of Home Affairs announced on Wednesday (June 4, 2025). This will be the country’s first digital census, and the first in independent India to include an enumeration of castes as well.\n\nDonald Trump says Putin told him on call that Russia will respond to Ukrainian attack on airfields\n\nU.S. President Donald Trump said that Russian President Vladimir Putin told him “very strongly” in a phone call Wednesday that he will respond to Ukraine’s weekend drone attack on Russian airfields as the deadlock over the war drags on and Ukrainian President Volodymyr Zelenskyy dismisses Russia’s ceasefire proposal.\n\nCentre asks States to ensure supply of medical oxygen, isolation beds, ventilators\n\nSeven more COVID-19 deaths had been reported in the country in the previous 24 hours, as of 8 a.m. on Wednesday (June 4, 2025) morning. Maharashtra reported the highest number of deaths (four). One death each has been reported from Delhi, Gujarat, and Tamil Nadu. The total death toll stands at 44, according to data from the Union Health Ministry.\n\nDelimitation delay ploy to reduce Tamil Nadu’s voice in Parliament: CM Stalin\n\nTamil Nadu Chief Minister M.K. Stalin on Wednesday (June 4, 2025) said that while the Constitution mandates delimitation based on the first Census conducted after 2026, the Bharatiya Janata Party (BJP)-led Union Government had now postponed the Census to 2027, signalling an alleged attempt to curtail Tamil Nadu’s Parliamentary representation.\n\nAssam floods claim two more lives, Mizoram clocks 675 landslides\n\nLarge swathes of low-lying areas across the north-eastern region, primarily Assam and Manipur’s Imphal Valley, continued to reel under floods, while the hills of Mizoram witnessed more landslides and mudslides during the past 24 hours.\n\nBengaluru stampede: How what was to be a victory celebration ended in a tragedy\n\nAfter a night of celebrating the victory of Royal Challengers Bengaluru (RCB) in the 18th edition of the Indian Premier League (IPL), thousands of fans started gathering near the M. Chinnaswamy Stadium and Vidhana Soudha, between which a ‘victory parade’ was planned, by Wednesday afternoon. Clad in the jerseys of their favourite team, there were people from all age groups, including parents with children and the elderly. The banners, music, and dancing in the crowd reflected the fervour of the fans ... all until things started to take a very tragic turn.\n\n‘Small Matters’: Shashi Tharoor on Kerfuffle Over Trump’s Claims On Brokering India-Pakistan Ceasefire\n\nIndia did not want to jeopardize its relationship with the U.S. over details about the level of US President Donald Trump’s involvement in brokering the May 10 cease fire between India and Pakistan, Congress MP Shashi Tharoor has said. Mr Tharoor also pushed back against repeated claims by Mr Trump that he had resolved the latest round of fighting and used trade leverage in the process.\n\nGukesh, Erigaisi in title contention as Norway Chess enters crucial phase\n\nWorld champion D Gukesh and Arjun Erigaisi have caught the imagination of chess aficionados by queering the pitch for the likes of Magnus Carlsen and Hikaru Nakamura, as the Indian duo makes Norway Chess title bid when the tournament recommences Thursday after a rest day.","summary":"Here is a select list of stories to start the day","url":"https://www.thehindu.com/news/morning-digest-june-05-2025/article69658278.ece","image":"https://th-i.thgim.com/public/incoming/6n3y2v/article69659244.ece/alternates/LANDSCAPE_1200/_KMK5798.JPG","video":null,"publish_date":"2025-06-05 00:42:09","author":"Mr Trump","authors":["Mr Trump"],"language":"en","source_country":"in","sentiment":-0.223},{"id":328207252,"title":"World News | Trump Moves to Block US Entry for Foreigners Planning to Study at Harvard University","text":"Washington, Jun 4 (AP) President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body. In an executive order signed Wednesday, Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts. Also Read | Operation Sindoor Outreach: Shashi Tharoor-Led Multi-Party Delegation Meets US Representatives, Congressmen in Washington DC. “I have determined that the entry of the class of foreign nationals described above is detrimental to the interests of the United States because, in my judgment, Harvard's conduct has rendered it an unsuitable destination for foreign students and researchers,” Trump wrote in the order. It's a further escalation in the White House's fight with the nation's oldest and wealthiest university. A federal court in Boston blocked the Department of Homeland Security from barring international students at Harvard last week. Trump's order invokes a different legal authority. Also Read | Nagpur Woman Sunita Jamgade, Who Crossed Into Pakistan for Love, Used Google Maps To Cross LoC: Report. It stems from Harvard's refusal to submit to a series of demands made by the federal government. It has escalated recently after the Department of Homeland Security said Harvard refused to provide records related to misconduct by foreign students. Harvard says it has complied with the request, but the government said the school's response was insufficient. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body.","url":"https://www.latestly.com/agency-news/world-news-trump-moves-to-block-us-entry-for-foreigners-planning-to-study-at-harvard-university-6906410.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-05 00:42:07","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.438},{"id":328210552,"title":"Full List of Countries Affected by Trump's New Travel Ban","text":"President Donald Trump issued a new proclamation on Wednesday restricting travel by foreigners from 12 countries and partially restricting entry for travelers from an additional seven countries.Why It MattersSince his January 20 inauguration, Trump has cracked down on foreign nationals in the U.S., mainly through executive orders, and has prioritized immigration enforcement as a key pillar of his agenda.He has repeatedly invoked the Alien Enemies Act of 1798, a wartime law that grants the commander in chief authority to detain or deport non-citizens, to remove migrants from the U.S. The president's authority to invoke the statute has been challenged in multiple court cases related to the Trump administration's deportations.What To Know\"During my first Administration, I restricted the entry of foreign nationals into the United States, which successfully prevented national security threats from reaching our borders and which the Supreme Court upheld,\" Trump said in his proclamation.The president added that foreign nationals with admitted entry into the United States must not \"bear hostile attitudes toward its citizens, culture, government, institutions, or founding principles, and do not advocate for, aid, or support designated foreign terrorists or other threats to our national security.\"Trump said he directed some of his Cabinet to identify countries with insufficient vetting and screening as to warrant a partial or full suspension of admission into the United States.The ban goes into effect 12:01 a.m. on June 9, 2025.CNN reports that it includes exceptions for permanent residents, visa holders and those whose entry would serve US interests.The following countries have been fully restricted, with limited entry:\nAfghanistan\n\nRepublic of the Congo\nEquatorial Guinea\n\nThe following countries have been partially restricted, with limited entry:\n\nSierra Leone\n\nTurkmenistan\n\nThis story is developing and will be updated with additional information.","summary":"President Donald Trump issued a new proclamation Wednesday evening affecting travelers from 20 different countries.","url":"https://www.newsweek.com/trump-travel-ban-countries-list-2081172","image":"https://d.newsweek.com/en/full/2657081/donald-trump.jpg","video":null,"publish_date":"2025-06-05 00:40:55","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"US","sentiment":0.201},{"id":328209602,"title":"Trump signs proclamation banning travel from 12 countries - Reuters","text":"Jeff Mason is a White House Correspondent for Reuters. He has covered the presidencies of Barack Obama, Donald Trump and Joe Biden and the presidential campaigns of Biden, Trump, Obama, Hillary Clinton and John McCain. He served as president of the White House Correspondents’ Association in 2016-2017, leading the press corps in advocating for press freedom in the early days of the Trump administration. His and the WHCA's work was recognized with Deutsche Welle's \"Freedom of Speech Award.\" Jeff has asked pointed questions of domestic and foreign leaders, including Russian President Vladimir Putin and North Korea's Kim Jong Un. He is a winner of the WHCA's “Excellence in Presidential News Coverage Under Deadline Pressure\" award and co-winner of the Association for Business Journalists' \"Breaking News\" award. Jeff began his career in Frankfurt, Germany as a business reporter before being posted to Brussels, Belgium, where he covered the European Union. Jeff appears regularly on television and radio and teaches political journalism at Georgetown University. He is a graduate of Northwestern University's Medill School of Journalism and a former Fulbright scholar.","summary":"Trump signs proclamation banning travel from 12 countries  Reuters","url":"https://www.reuters.com/world/americas/trump-signs-proclamation-banning-travel-12-countries-cbs-news-reports-2025-06-04/","image":"https://www.reuters.com/resizer/v2/ZGLURKX3VJKENNQTD5NXWWZOGA.jpg?auth=3c3fdf91c37a10a200d173e141525472c06f14f082d01815d6ce2ad6ef1709e0&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-06-05 00:40:00","author":"Jeff Mason,Nandita Bose","authors":["Jeff Mason","Nandita Bose"],"language":"en","category":"politics","source_country":"gb","sentiment":0.814},{"id":328207110,"title":"Trump moves to block US entry for foreigners planning to study at Harvard University","text":"WASHINGTON (AP) — President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body.\n\nIn an executive order signed Wednesday, Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts.\n\n“I have determined that the entry of the class of foreign nationals described above is detrimental to the interests of the United States because, in my judgment, Harvard’s conduct has rendered it an unsuitable destination for foreign students and researchers,” Trump wrote in the order.\n\nIt’s a further escalation in the White House’s fight with the nation’s oldest and wealthiest university. A federal court in Boston blocked the Department of Homeland Security from barring international students at Harvard last week. Trump’s order invokes a different legal authority.\n\nIt stems from Harvard’s refusal to submit to a series of demands made by the federal government. It has escalated recently after the Department of Homeland Security said Harvard refused to provide records related to misconduct by foreign students.\n\nHarvard says it has complied with the request, but the government said the school’s response was insufficient.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt...","url":"https://wsvn.com/news/politics/trump-moves-to-block-us-entry-for-foreigners-planning-to-study-at-harvard-university/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/05/250529_Harvard_University_generic.jpg?quality=60&strip=color","video":null,"publish_date":"2025-06-05 00:38:48","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.722},{"id":328207102,"title":"Trump orders investigation of Biden’s use of an autopen, claiming White House cover-up","text":"By Matt Brown and Chris Megerian I Associated Press\n\nWASHINGTON — President Donald Trump on Wednesday ordered his administration to investigate former President Joe Biden’s use of an autopen to sign pardons and other documents, increasing the pressure on his predecessor as House Republicans also requested interviews with members of Biden’s inner circle.\n\nAn autopen is a mechanical device that is used to replicate a person’s authentic signature, and presidents have used them for decades. However, Trump has frequently suggested that some of Biden’s actions are invalid because his aides were usurping presidential authority to cover up what Trump claims is Biden’s cognitive decline.\n\n“This conspiracy marks one of the most dangerous and concerning scandals in American history,” Trump wrote in a memo. “The American public was purposefully shielded from discovering who wielded the executive power, all while Biden’s signature was deployed across thousands of documents to effect radical policy shifts.”\n\nTrump directed Attorney General Pam Bondi and White House Counsel David Warrington to handle the investigation.\n\nMeanwhile, House Oversight Chairman James Comer of Kentucky, a Republican, requested transcribed interviews with five Biden aides, alleging they had participated in a “cover-up” that amounted to “one of the greatest scandals in our nation’s history.”\n\n“These five former senior advisors were eyewitnesses to President Biden’s condition and operations within the Biden White House,” Comer said in a statement. “They must appear before the House Oversight Committee and provide truthful answers about President Biden’s cognitive state and who was calling the shots.”\n\nInterviews were requested with White House senior advisers Mike Donilon and Anita Dunn, former White House chief of staff Ron Klain, former deputy chief of staff Bruce Reed and Steve Ricchetti, a former counselor to the president.\n\nComer reiterated his call for Biden’s physician, Kevin O’Connor, and former senior White House aides Annie Tomasini, Anthony Bernal, Ashley Williams and Neera Tanden to appear before the committee. He warned subpoenas would be issued this week if they refuse to schedule voluntary interviews.\n\n“I think that people will start coming in the next two weeks,” Comer told reporters. He added that the committee would release a report with its findings, “and we’ll release the transcribed interviews, so it’ll be very transparent.”\n\nDemocrats have dismissed the effort as a distraction.\n\n“Chairman Comer had his big shot in the last Congress to impeach Joe Biden and it was, of course, a spectacular flop,” said Rep. Jamie Raskin, the Maryland Democrat who served as the ranking member on the oversight committee in the previous Congress. “And now he’s just living off of a spent dream. It’s over. And he should give up the whole thing.”\n\nRepublicans on the committee are eager to pursue the investigation.\n\n“The American people didn’t elect a bureaucracy to run the country,” said Rep. Brandon Gill, a freshman Republican from Texas. “I think that the American people deserve to know the truth and they want to know the truth of what happened.”\n\nThe Republican inquiry so far has focused on the final executive actions of Biden’s administration, which included the issuing of new federal rules and presidential pardons that they claim may be invalid.\n\nComer cited the book “Original Sin” by CNN’s Jake Tapper and Axios’ Alex Thompson, which details concerns and debates inside the White House and Democratic Party over Biden’s mental state and age.\n\nIn the book, Tapper and Thompson wrote, “Five people were running the country, and Joe Biden was at best a senior member of the board.”\n\nBiden and members of his family have vigorously denied the book’s claims.\n\n“This book is political fairy smut for the permanent, professional chattering class,” said Naomi Biden, the former president’s granddaughter.\n\nBiden withdrew from the presidential race last summer after a debate against Trump in which he appeared to lose his train of thought multiple times, muttered inaudible answers and misnamed different government programs.\n\nThe disastrous debate performance pushed questions about his age and mental acuity to the forefront, ultimately leading Biden to withdraw from the presidential race. He was replaced on the ticket by Kamala Harris, who lost the election to Trump.","summary":"The device, which is used to replicate a person’s authentic signature, has been used by presidents for decades.","url":"https://www.mercurynews.com/2025/06/04/trump-biden-investigation-autopen-use/","image":"https://www.mercurynews.com/wp-content/uploads/2025/04/Biden_94739.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-05 00:36:50","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.02},{"id":328207830,"title":"Trump moves to block US entry for foreigners planning to study at Harvard University","text":"By COLLIN BINKLEY, Associated Press\n\nWASHINGTON (AP) — President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body.\n\nIn an executive order signed Wednesday, Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts.\n\n“I have determined that the entry of the class of foreign nationals described above is detrimental to the interests of the United States because, in my judgment, Harvard’s conduct has rendered it an unsuitable destination for foreign students and researchers,” Trump wrote in the order.\n\nIt’s a further escalation in the White House’s fight with the nation’s oldest and wealthiest university. A federal court in Boston blocked the Department of Homeland Security from barring international students at Harvard last week. Trump’s order invokes a different legal authority.\n\nIt stems from Harvard’s refusal to submit to a series of demands made by the federal government. It has escalated recently after the Department of Homeland Security said Harvard refused to provide records related to misconduct by foreign students.\n\nHarvard says it has complied with the request, but the government said the school’s response was insufficient.\n\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus.","url":"https://www.ocregister.com/2025/06/04/trump-harvard-entry/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Education_Trump_Harvard_39731.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-05 00:32:02","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.549},{"id":328205338,"title":"Victor Davis Hanson: Is the Age of American Empire Over or Just Beginning?","text":"President Donald Trump returned to Washington in January with a mandate from the American people to end mass migration. That same month, however, the foreign-born population living within America’s borders hit a record high, in an echo of the Roman empire. Is it too late to save America from mass migration? Even if America is saved, will it be fundamentally changed in the process?\n\nAs a California farmer, Victor Davis Hanson faces the reality of this demographic change every day. As a historian and classicist, he knows all too well what happens to regimes and empires that fail to confront mass migration. This week, he joins “The Signal Sitdown” to discuss.\n\n“Everybody,” Hanson told The Daily Signal, “is bewildered why [former President] Joe Biden, or whoever was controlling him, did this.” \n\nHanson described the pressure to keep migrants streaming into the country as “a consortium of interests” that include corporations (which desire cheap labor), other nations (which benefit from remittances), the cartels, and liberal ideologues.\n\nWhatever the motivation, “it’s catastrophic,” Hanson said. January’s Current Population Survey from the Census Bureau found that America’s foreign-born population has surpassed 53 million. In percentage terms, that’s 15.8%, a full percentage point higher than the previous record set in 1890.\n\nHanson’s family has lived on a farm in central California since 1870. “Where I live in the Central Valley is kind of ground zero, where people come up for agriculture or hospitality industry and it’s changed my life markedly.”\n\nWhile the migrants of yesteryear might stay for a season, work on a construction site or in the fields, make some good money, then go back to their home country, today’s migrants are staying. “Where I live out in the country, if a person had a one-bedroom house or something, why not bring in Winnebagos or sheds,” Hanson said of the growing migrant population. “There may be 40 or 50 people living in a single-family zone residence.” Meanwhile, California citizens are punished by the regulatory environment for going about home improvements in the right way.\n\nThe end result is a governance structure that has two contradicting systems. \n\n“It’s very strange about California,” Hanson said. “It’s the most regulated state in the country and it’s the least regulated.” While businesses have fled the state due to overtaxation, authorities simultaneously allow “a huge black market economy,” created by migrants, to flourish.\n\n“It’s kind of disheartening when your family has been there since 1870 and you’re afraid to walk a quarter mile out of your house at night.”\n\nAmerica is not the only civilization that faced a crisis of this nature. “If you look at what I’d call [the] late republic, early imperial literature,” of Rome, Hanson explained, “you get the Italian agrarian mindset, protocol, morality, and it’s now globalized and it’s diluted.”\n\nDuring this early empire time period, there was “a lot of money being made in this global system of trade that Rome created. “\n\n“And one of the things that’s happened is Rome has now become from 300,000 [people] to over a million,” Hanson continued. But, “the number of people who are Italian or reflect that in the literature is considered dwindling, eroding, and you’ve got too many people from all over the world that are not on the same page.”\n\n”There’s much more wealth, there’s much more technology, there’s much more leisure,” Hanson said, but “there’s no moral restraint” and “there’s no republic anymore.”\n\n“It’s very similar to the United States,” Hanson added. “There was this kind of an agrarian American code that you see in movies of the 1930s and 40s and now we’re… powerful, wealthier, but people are less happy or they don’t seem to reflect what the Founders thought the country should be. It’s the same dichotomy.”\n\nAll this raises the question of whether the age of American empire is coming to an end or just beginning.\n\nHanson told The Daily Signal, “we’re in a transitional period.”\n\n“Our globalization is the modern equivalent of an empire,” Hanson explained. “There’s still a sense inside the United States that we’re still operating under Republican principles, but there’s a doubt that these next generations are going to be able to continue that” due to the lack of civic education and moral decay. “They’ve been brought up on globalism.”","summary":"President Donald Trump returned to Washington in January with a mandate from the American people to end mass migration. That same month, however, the foreign-born... Read More\n\n\nThe post Victor Davis Hanson: Is the Age of American Empire Over or Just Beginning? appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/04/victor-davis-hanson-is-age-american-empire-over-just-beginning/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/Untitled-design.png","video":null,"publish_date":"2025-06-05 00:30:57","author":"Bradley Devlin,Fellow Lawmaker","authors":["Bradley Devlin","Fellow Lawmaker"],"language":"en","source_country":"us","sentiment":-0.168},{"id":328210610,"title":"Trump Bans Visas For Foreign Students At Harvard","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-bans-visas-for-foreign-students-at-harvard-university-8590713\" on this server.\nReference #18.c4d5ce17.1749085837.286cd84e\nhttps://errors.edgesuite.net/18.c4d5ce17.1749085837.286cd84e","summary":"U.S. President Donald Trump signed a proclamation to restrict foreign student visas at Harvard University, the White House said on Wednesday, amid an escalating row with the academic institution.","url":"https://www.ndtv.com/world-news/donald-trump-bans-visas-for-foreign-students-at-harvard-university-8590713","image":null,"video":null,"publish_date":"2025-06-05 00:28:46","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":328207626,"title":"Donald Trump travel ban: President signs new order restricting US entry from 12 countries","text":"The West Australian\n\nCamera IconUS President Donald Trump has signed a new executive order banning travel to the United States for 12 countries. Credit: Al Drago/Bloomberg\n\nDonald Trump travel ban: President signs new order restricting US entry from 12 countries\n\nMax CorstorphanThe Nightly\n\nJune 5, 2025 8:28AM\n\nYour Local News\n\nShare to TwitterShare to FacebookShare to InstagramShare to YoutubeEmail UsGet Digital Edition","summary":"US President Donald Trump has signed a new executive order, banning travel to the United States for people from 12 countries in response to a recent terror attack.","url":"https://www.perthnow.com.au/politics/donald-trump/donald-trump-travel-ban-president-bans-travel-to-the-united-states-for-12-countries-c-18930541","image":"https://images.perthnow.com.au/publication/C-18930541/bb3c137f27a3e9939a90c5362321460fcc276caf-16x9-x0y209w4000h2250.jpg?imwidth=1200","video":null,"publish_date":"2025-06-05 00:28:40","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.112},{"id":328207280,"title":"India News | \"Surrender is in Dictionary of Congress; in Your DNA\": JP Nadda Slams Rahul Gandhi's Surrender\" Remark","text":"New Delhi [India], June 5 (ANI): BJP National President and Union Health Minister JP Nadda on Wednesday slammed Congress MP and Leader of the Opposition in Lok Sabha Rahul Gandhi, accusing him of insulting the Indian Army by terming the success of Operation Sindoor a \"surrender\", noting that 'surrender' was in the dictionary of Congress and in Rahul Gandhi's DNA.\nIn a series of posts on X, Nadda responded to Congress MP's \"Narender-Surrender\" jibe at Prime Minister Narendra Modi while addressing a convention of Congress workers in Madhya Pradesh and alleged that PM Modi had surrendered to US pressure for a ceasefire with Pakistan.\nAlso Read | COVID-19 Alert: Maharashtra Logs 105 Fresh COVID Cases, 3 Deaths.\nHe listed historical instances like the Shimla Agreement, the Indus Waters Treaty, and the 1962 war, alleging that Congress consistently capitulated, including to the Muslim League during India's independence.\n\"Rahul Gandhi, you may have surrendered; your party may have surrendered; your leaders may have surrendered because your history has been like this but India never surrenders. Surrender is in the dictionary of your party Congress; it is in your DNA. Rahul Gandhi, you should remember the tenure of your party's governments and how you 'surrendered' in history. You surrendered to terrorism, surrendered in Sharm-al-Shekh, surrendered at the table in Shimla after winning the 1971 war, surrendered in the Indus Water Treaty, surrendered Haji Pir Pass, surrendered 160 km area of Chhamb sector, surrendered in the 1962 war, surrendered in 1948 and even surrendered to the Muslim League at the time of independence of the country,\" Nadda stated.\nAlso Read | Operation Sindoor Outreach: Shashi Tharoor-Led Multi-Party Delegation Meets US Representatives, Congressmen in Washington DC.\nNadda further condemned the Congress leader's remark as treasonous and highlighted that even Pakistan did not dare to make such a claim.\n\"Rahul Gandhi's calling the unmatched valour and courage of the Indian Army a 'surrender' is not only unfortunate but also a grave insult to the Indian Army, the nation and 140 crore Indians. If any Pakistani had said this, we would have laughed at them, but after the way Operation Sindoor wreaked havoc in Pakistan, no one from the people of Pakistan, its army and even its Prime Minister dared to say this, but Rahul Gandhi is saying this! This is nothing less than treason,\" the BJP National President added.\nNadda also detailed the success of Operation Sindoor, noting the Indian Army's deep penetration into Pakistan, destruction of airbases and terrorist camps, and the killing of over 150 terrorists, as validated by senior army officers.\n\"The Indian Army penetrated 300 km into Pakistan and destroyed 11 of its airbases, demolished 9 terrorist bases, killed more than 150 terrorists. Pakistan is crying and telling the world that the Indian Army attacked 18 places in Pakistan and destroyed everything and Rahul Gandhi is talking about the surrender of the country! Rahul Gandhi should know that the success of \"Operation Sindoor\" was not announced by the government or any BJP spokesperson, but by senior officers of the Indian Army. \"Operation Sindoor\" is a proclamation of the bravery, courage and valour of the Indian Army. In reality, those whose policies have been of surrender cannot think of anything beyond this - why, isn't it so with Rahul Gandhi?\" he added.\nThis comes after Congress leader Rahul Gandhi attacked the BJP-led government on Tuesday over allegations of mediation by the United States in Operation Sindoor.\nHe alleged that Prime Minister Narendra Modi \"followed\" Donald Trump following a call by the US leader and that the then Prime Minister Indira Gandhi did not budge to the US in the 1971 war.\nAddressing a convention of Congress workers in Bhopal, LoP Rahul Gandhi said, \"Now, I understand RSS-BJP well. They run away out of fear if slight pressure is put on them. When Trump called Modiji- Modiji kya kar rahe ho, Narender-Surrender and with 'ji hazooor', Narenderji followed Trump. In the 1971 war, the Seventh Fleet (which came from the US), India Gandhi said I will do whatever I have to do. This is the difference. This is their character; all of them are like this. Since the Independence movement, they have had the habit of writing letters of surrender.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  BJP National President and Union Health Minister JP Nadda on Wednesday slammed Congress MP and Leader of the Opposition in Lok Sabha Rahul Gandhi, accusing him of insulting the Indian Army by terming the success of Operation Sindoor a &quot;surrender&quot;, noting that 'surrender' was in the dictionary of Congress and in Rahul Gandhi's DNA.","url":"https://www.latestly.com/agency-news/india-news-surrender-is-in-dictionary-of-congress-in-your-dna-jp-nadda-slams-rahul-gandhis-surrender-remark-6906399.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250604134154.jpg","video":null,"publish_date":"2025-06-05 00:26:33","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.3},{"id":328209680,"title":"Army leaders defend parade and border spending as Congress presses for answers","text":"Army leaders on Wednesday defended spending as much as $45 million to add a parade to the service's 250th birthday celebration on June 14 in Washington, saying it will help boost recruitment, as Congress members argued that the money could be better spent on troops' barracks or other priorities.Members of the House Armed Services Committee also said they are concerned that the Defense Department is shifting about $1 billion from a variety of accounts — including base housing — to cover the costs of shoring up the defense of the southern border.Spending for the parade has become a flashpoint since it comes at a time when the Trump administration is slashing funding for personnel and programs across the federal government, including the Defense Department.While the Army has long planned for a festival on the National Mall to celebrate its 250th birthday, the parade was just recently added. President Donald Trump has long wanted a military parade in the city, after seeing an elaborate one in France on Bastille Day during his first presidential term, and June 14 is also his birthday.RELATED STORY | Army plans for a potential parade on Trump's birthday call for 6,600 soldiers, AP learnsU.S. Rep. Salud Carbajal, D-Calif., questioned whether the additional cost of the parade was appropriate since all the military services are facing 8% budget cuts, and said perhaps it could be used to improve troops’ quality of life or warfighting capabilities. He prodded Army Secretary Daniel Driscoll on what he would prioritize if Congress wrote him a blank check for $45 million.Driscoll replied that he thinks the parade offers a chance to tell the public about the Army. “I believe very specifically that telling that story will directly lead to a recruiting boom and will fill up our pipeline for the coming years,\" he said.At the same time, he and Gen. Randy George, chief of staff of the Army, told lawmakers that the service has now met its recruiting goal for the year — with 61,000 recruits. Army officials have predicted for months that they would hit the target early after making a series of changes to recruiting programs, recruiters and policies over the past several years.That prompted Rep. Wesley Bell, D-Mo., to ask why the parade was needed for recruiting if it's already surging.Driscoll said the Army believes the parade “will empower an entire new generation of America’s youth to catch the spirit to serve their nation.”Rep. Derrick Van Orden, R-Wisc., defended the parade spending, saying “you cannot put a price tag on patriotism.”House members on both sides of the aisle pressed the Army about a recent request to shift money from across the budget to support the southern border. The biggest concern, they said, is that it takes money away from base housing, which has been plagued with persistent problems, including mold, rodents and raw sewage in barracks.Rep. Don Bacon, R-Neb., agreed the nation needs a strong border, but said lawmakers worked for the past year on a broad effort to address the housing problems. “I feel like a decision was made that undermined this whole effort that we spent the last year doing.,\" he said.Pressed on the issue by Carbajal, George acknowledged that redirecting the money has an impact on the barracks.“If we took $1 billion out of barracks, we would be able to fix less barracks,\" he agreed, but also said, ”“You have to make choices, congressman.\"","summary":"Army leaders on Wednesday defended spending as much as $45 million to add a parade to the service's 250th birthday celebration on June 14 in Washington.","url":"https://www.scrippsnews.com/us-news/military/army-leaders-defend-parade-and-border-spending-as-congress-presses-for-answers","image":"https://ewscripps.brightspotcdn.com/dims4/default/5151360/2147483647/strip/true/crop/7993x4196+0+374/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fa7%2F5f%2F41035de24206a02fbc84d0767235%2Fap25153612769396.jpg","video":null,"publish_date":"2025-06-05 00:24:04","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":0.067},{"id":328210488,"title":"Breaking: Trump announces new travel ban on visitors from 12 nations","text":"Donald Trump has signed a new proclamation to implement a ban on people from 12 countries travelling into the United States.\n\nThe countries include Afghanistan, Myanmar, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the travel ban — which takes effect on Monday, June 9 (2:01pm AEST Monday) — there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\nThe list of countries has come from an executive order Mr Trump issued on January 20 that required the departments of State and Homeland Security and the Director of National Intelligence to compile a report on \"hostile attitudes\" toward the US, and whether entry from certain countries represented a national security risk.\n\n\"President Trump is fulfilling his promise to protect Americans from dangerous foreign actors that want to come to our country and cause us harm,\" Abigail Jackson, a White House spokesperson, said on X.\n\nThe countries facing the total ban were found \"to be deficient with regards to screening and vetting and determined to pose a very high risk to the United States,\" according to a statement provided by the White House.\n\nThe president's proclamation also reveals US authorities will work to \"take all necessary and appropriate steps to encourage foreign governments to improve their information-sharing and identity-management protocols\".\n\nThat inclusion in the proclamation is aimed at encouraging governments of other countries to alert the US when they become aware of persons who pose a potential threat.\n\nThe proclamation says that exceptions to the order will only be afforded to lawful permanent residents of the US, valid passport and visa holders, athletes and members of athletic teams, or individuals that the US attorney-general or secretary of state determine would boost America's national interest.\n\nDuring his first term, Mr Trump issued an executive order in January 2017 banning travel to the US by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nTravellers from those nations were either barred from getting on their flights to the US or detained at American airports after they landed.\n\nThey included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the \"Muslim ban\" or the \"travel ban,\" was retooled amid legal challenges until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travellers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nMr Trump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias.\n\nThe president had previously called for an explicit ban on Muslims during his first campaign for the White House.","summary":"Donald Trump has signed a new proclamation to implement a ban on people from 12 countries travelling into the United States, in a bid to \"protect the national security\" of the nation.","url":"https://www.abc.net.au/news/2025-06-05/donald-trump-announces-new-travel-ban-against-12-countries/105379226","image":"https://live-production.wcms.abc-cdn.net.au/9eee2c24f8d9c3995d7e236e1e18e23c?impolicy=wcms_crop_resize&cropH=1991&cropW=3540&xPos=0&yPos=253&width=862&height=485","video":null,"publish_date":"2025-06-05 00:22:34","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":0.018},{"id":328206624,"title":"Trump Reinstates Full Travel Ban on 12 Nations, Including Afghanistan and Iran; Restrictions Added for 7 Others","text":"U.S. President Donald Trump, now 78, has announced a new full-entry travel ban on nationals from 12 countries, citing security risks, terrorism links, and poor cooperation with U.S. immigration enforcement. This latest move comes as Trump campaigns for a return to the White House, and includes a mix of Middle Eastern, African, and Asian nations, many of which were also targeted during his earlier presidency.\nAmong those fully banned from entering the United States are Afghanistan, Burma (Myanmar), Iran, and Libya. The decision was made public in a White House press release on Wednesday.\nFull Ban List Targets ‘Very High-Risk’ Nations\nAccording to the statement, the following 12 countries face complete restrictions:\nAfghanistan\nBurma (Myanmar)\nRepublic of the Congo\nEquatorial Guinea\nThese countries were marked as “very high risk” due to issues like terrorism ties, lack of proper identity screening, or poor cooperation with U.S. immigration enforcement. For example, Afghanistan is now governed by the Taliban, while Iran and Cuba were specifically called out for state-sponsored terrorism.\nPartial Restrictions on Seven Other Countries\nIn addition to the full bans, Trump’s order also imposes partial visa restrictions on nationals from the following seven countries:\nSierra Leone\nTurkmenistan\nThese restrictions mostly affect immigrant and nonimmigrant visa categories, such as B-1 (business), B-2 (tourism), B-1/B-2 (combination), F (student), M (vocational), and J (exchange visitor) visas.\nThe White House said these countries were targeted due to high visa overstay rates or insufficient cooperation on law enforcement matters. For example, Chad had a 49.54% overstay rate for B1/B2 visas, while Eritrea had a 55.43% overstay rate for student (F), vocational (M), and exchange visitor (J) visas.\nTrump Says Move Is About National Security\nTrump defended the decision while referencing his earlier controversial travel ban, calling it essential to keep “radical Islamic terrorists” out of the country. “We will restore the travel ban, some people call it the Trump travel ban, and keep the radical Islamic terrorists out of our country that was upheld by the Supreme Court,” Trump said.\nThe president emphasized that the travel ban had previously been approved by the Supreme Court, which ruled that it fell within the legal powers of the president and served a legitimate national security purpose.\nJustifications Include Terrorism, Illegal Migration, and Border Security\nThe White House said the ban was also prompted by concerns over illegal migration, especially from countries like Haiti, which saw a large influx of migrants during the Biden administration.\nIn addition, countries such as Iran, Cuba, and Afghanistan were pointed out for their political instability, terrorist affiliations, or lack of effective governance that could allow bad actors to enter the U.S. “This is about protecting American citizens,” a senior White House official said, adding that the administration had reviewed visa data, intelligence reports, and cooperation records before finalizing the list.\nA Return to Earlier Controversial Policies\nThis decision mirrors Trump’s original travel ban introduced during his first term, which was criticized for targeting Muslim-majority nations and sparking protests around the world. At the time, critics called it discriminatory and unconstitutional, though the Supreme Court ultimately upheld the policy, stating that it served national security interests.\nThe administration says this version is more data-driven and specific, citing visa overstay percentages, governmental cooperation levels, and homeland security assessments as the basis for the restrictions.\nALSO READ: Trump Administration To Mandate Social Media Screening For All Foreign Students, Puts New Student Visa Interviews On Hold","summary":"U.S. President Donald Trump, now 78, has announced a new full-entry travel ban on nationals from 12 countries, citing security risks, terrorism links, and poor cooperation with U.S. immigration enforcement.","url":"https://www.newsx.com/world/trump-reinstates-full-travel-ban-on-12-nations-including-afghanistan-and-iran-restrictions-added-for-7-others/","image":"https://www.newsx.com/wp-content/uploads/2025/05/ASHISH-WEBSITE-3-24.webp","video":null,"publish_date":"2025-06-05 00:21:40","author":"Srishti Mukherjee","authors":["Srishti Mukherjee"],"language":"en","category":"politics","source_country":"in","sentiment":0.158},{"id":328204486,"title":"Trump Bans Travel From 12 Countries","text":"President Donald Trump issued a travel ban barring people in 12 countries from visiting the U.S., attributing his proclamation to national security concerns and public safety.\n\nThe proclamation was made Wednesday evening. (Photo by Chip Somodevilla/Getty Images)\nGetty Images\n\nTrump’s proclamation fully restricts travel from the countries of Afghanistan, Myanmar, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nThis is a developing story. Check back for updates.\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"The proclamation fully or partially bans travel from countries in Africa, the Middle East and South America.","url":"https://www.forbes.com/sites/antoniopequenoiv/2025/06/04/trump-bans-travel-from-12-countries/","image":"https://imageio.forbes.com/specials-images/imageserve/6840e2e3b558b5cc3faeecaa/0x0.jpg?format=jpg&crop=3044,2027,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-05 00:21:37","author":"Antonio Pequeño IV,Chip Somodevilla,Forbes Staff","authors":["Antonio Pequeño IV","Chip Somodevilla","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.077},{"id":328210606,"title":"Trump Signs Order Banning Travel From 12 Countries: Report","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-signs-order-banning-travel-from-12-countries-report-8590672\" on this server.\nReference #18.c4d5ce17.1749085837.286cd838\nhttps://errors.edgesuite.net/18.c4d5ce17.1749085837.286cd838","summary":"U.S. President Donald Trump signed a proclamation banning travel from certain countries, CBS News reported on Wednesday, citing administration officials.","url":"https://www.ndtv.com/world-news/donald-trump-signs-order-banning-travel-from-12-countries-report-8590672","image":null,"video":null,"publish_date":"2025-06-05 00:19:29","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":328209954,"title":"Trump signs order banning citizens of 12 countries from entering the US","text":"Donald Trump has signed a proclamation banning travel from 12 countries and restricting travel from seven others, reviving and expanding the travel bans from his first term.\n\nThe nationals of Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen will be “fully” restricted from entering the US, according to the proclamation. Meanwhile, the entry of nationals of Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will be partially restricted.\n\nThe US president said that he “considered foreign policy, national security, and counterterrorism goals” in deciding the scope of the ban. Trump had cued up the ban in an executive order signed on 20 January, his first day back in the White House, instructing his administration to submit a list of candidates for a ban by 21 March.\n\nAdvocates have for months raised alarms that a blanket ban will once again tear families apart. The bans on travel from Haiti, Cuba, and Venezuela could be especially impactful in US communities with huge immigrant populations from those countries.\n\nHaving instituted a travel ban on Muslim countries early in his first term, Trump trailed his plans for a new ban during his election campaign against Kamala Harris last year.\n\n“I will ban refugee resettlement from terror-infested areas like the Gaza Strip, and we will seal our border and bring back the travel ban,” Trump said in September. “Remember the famous travel ban? We didn’t take people from certain areas of the world. We’re not taking them from infested countries.”\n\nHe was referring to the ban he imposed after taking office in January 2017, leading to chaos at airports as protesters and civil rights attorneys rushed to help affected travelers.\n\nTrump said the ban was needed to combat terrorist threats. It was blocked by federal courts on civil liberties grounds but the US supreme court, to which Trump would eventually appoint three hardline rightwing justices, allowed the ban to stand.\n\nThe supreme court said Trump’s ban did not target Muslims – despite the fact it originally targeted travelers from Chad, Iran, Libya, Somalia, Syria and Yemen, Muslim-majority countries. According to the court, the ban fell within the remit of a president’s national security powers. North Korea and Venezuela were also included.\n\nThe Council on American-Islamic Relations (Cair) said then: “The Muslim ban’s bigotry should have been as clear to the supreme court as it is to the Muslims demonized by it. Apparently, everyone but the supreme court can see the decision for what it is: an expression of animosity.”\n\nIn 2020, shortly before the Covid pandemic drastically reduced world travel, Eritrea, Kyrgyzstan, Nigeria, Myanmar, Tanzania and Sudan were added to the ban.\n\nIn 2021, that travel ban was among measures Joe Biden ended within hours of being sworn in as Trump’s White House successor.","summary":"Nationals from countries including Afghanistan, Haiti and Sudan ‘fully’ restricted as those of seven other countries partially restricted\n\n\nUS politics – follow live\n\nDonald Trump has signed a proclamation banning travel from 12 countries and restricting travel from seven others, reviving and expanding the travel bans from his first term.\n\nThe nationals of Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen will be “fully” restricted from entering the US, according to the proclamation. Meanwhile, the entry of nationals of Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will be partially restricted.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/jun/04/trump-proclamation-travel-ban","image":"https://i.guim.co.uk/img/media/4e53f5d12d65509892622fbb48981168e74ad482/484_0_4837_3870/master/4837.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-06-05 00:19:06","author":"Maanvi Singh,Martin Pengelly","authors":["Maanvi Singh","Martin Pengelly"],"language":"en","category":"politics","source_country":"gb","sentiment":0.066},{"id":328203878,"title":"Trump signs proclamation banning citizens from 12 countries from entering US","text":"Donald Trump has signed a proclamation banning travel from 12 countries and restricting travel from seven others, reviving and expanding the travel bans from his first term.\n\nThe nationals of Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen will be “fully” restricted from entering the US, according to the proclamation. Meanwhile, the entry of nationals of Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will be partially restricted.\n\nThe US president said that he “considered foreign policy, national security, and counterterrorism goals” in deciding the scope of the ban. Trump had cued up the ban in an executive order signed on 20 January, his first day back in the White House, instructing his administration to submit a list of candidates for a ban by 21 March.\n\nAdvocates have for months raised alarms that a blanket ban will once again tear families apart. The bans on travel from Haiti, Cuba, and Venezuela could be especially impactful in US communities with huge immigrant populations from those countries.\n\nHaving instituted a travel ban on Muslim countries early in his first term, Trump trailed his plans for a new ban during his election campaign against Kamala Harris last year.\n\n“I will ban refugee resettlement from terror-infested areas like the Gaza Strip, and we will seal our border and bring back the travel ban,” Trump said in September. “Remember the famous travel ban? We didn’t take people from certain areas of the world. We’re not taking them from infested countries.”\n\nHe was referring to the ban he imposed after taking office in January 2017, leading to chaos at airports as protesters and civil rights attorneys rushed to help affected travelers.\n\nTrump said the ban was needed to combat terrorist threats. It was blocked by federal courts on civil liberties grounds but the US supreme court, to which Trump would eventually appoint three hardline rightwing justices, allowed the ban to stand.\n\nThe supreme court said Trump’s ban did not target Muslims – despite the fact it originally targeted travelers from Chad, Iran, Libya, Somalia, Syria and Yemen, Muslim-majority countries. According to the court, the ban fell within the remit of a president’s national security powers. North Korea and Venezuela were also included.\n\nThe Council on American-Islamic Relations (Cair) said then: “The Muslim ban’s bigotry should have been as clear to the supreme court as it is to the Muslims demonized by it. Apparently, everyone but the supreme court can see the decision for what it is: an expression of animosity.”\n\nIn 2020, shortly before the Covid pandemic drastically reduced world travel, Eritrea, Kyrgyzstan, Nigeria, Myanmar, Tanzania and Sudan were added to the ban.\n\nIn 2021, that travel ban was among measures Joe Biden ended within hours of being sworn in as Trump’s White House successor.","url":"https://uk.news.yahoo.com/trump-signs-proclamation-banning-citizens-001906926.html","image":"https://media.zenfs.com/en/theguardian_763/fe64facd01b534bb88ac6fbdce3c5d6c","video":null,"publish_date":"2025-06-05 00:19:06","author":"Maanvi Singh In San Francisco And Martin Pengelly In Washington","authors":["Maanvi Singh In San Francisco And Martin Pengelly In Washington"],"language":"en","category":"politics","source_country":"gb","sentiment":0.066},{"id":328208224,"title":"Trump signs proclamation banning travel from 12 countries","text":"WASHINGTON - U.S. President Donald Trump signed a proclamation on Wednesday banning travel from certain countries citing national security concerns.The proclamation fully restricts and limits the entry of nationals from 12 countries: Afghanistan, Myanmar, Chad, Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries: Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela, will be partially restricted, the official said. The travel proclamation was first reported by CBS News.","summary":"The countries facing the total ban were \"determined to pose a very high risk to the United States,\" according to a White House statement.","url":"https://www.japantimes.co.jp/news/2025/06/05/world/politics/trump-banning-travel-12-countries/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/06/05/473422.jpg?v=3.1","video":null,"publish_date":"2025-06-05 00:17:00","author":"Jeff Mason,Nandita Bose,Web Master","authors":["Jeff Mason","Nandita Bose","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.15},{"id":328206628,"title":"Ukraine&#8217;s Deep-Strike Drone Attacks Expose Vulnerabilities in Russia’s Heartland: Satellite Images Reveal Widespread Destruction","text":"High-resolution satellite images have emerged showing the destruction caused by Ukraine’s bold drone assault on five key Russian air bases, carried out under “Operation Spider Web.” These images—captured more than 48 hours after the strikes due to heavy cloud cover—provide a rare glimpse into the scale of damage inflicted by Ukraine’s long-range drone operations deep inside Russian territory.\nThe satellite photos, now available from two of the five targeted airfields, show several aircraft destroyed on the ground, challenging Moscow’s assumption that these distant bases were out of reach.\nTHREAD: @Maxar has released several new high-resolution satellite images of the aftermath of Ukrainian drone strikes on Russia's Belaya and Olenya air bases.\nBelaya air base: Damage visible on three Tu-95 bombers\nLeft: 22 May\nRight: 4 June pic.twitter.com/BHU0mzPPQ6\n— Shayan Sardarizadeh (@Shayan86) June 4, 2025\nAir Bases Hit Thousands of Kilometres From Ukraine\nThe five targeted airfields include:\nBelaya Air Base in Irkutsk, Siberia\nOlenya Air Base in Murmansk, Arctic region\nIvanovo Severny Air Base in Ivanovo\nDyagilevo Air Base in Ryazan\nUkrainka Air Base in the Russian Far East\nThe closest base is over 500 kilometers from Ukraine, while the farthest one is nearly 8,000 kilometers away.\nDespite this vast distance, Ukraine managed to send explosive-laden drones to all five sites, with satellite imagery from Belaya and Olenya now confirming extensive damage.\nnew high-quality pre/post-attack sat imagery of the Russian air bases attacked by Ukrainian drones on Sunday; damage to aircraft clearly visible. Images 1-2: Belaya air base, May 22; Images 3-4: Belaya air base, June 4. 📸 @Maxar pic.twitter.com/sLEf0jxjX9\n— Mike Eckel (@Mike_Eckel) June 4, 2025\nBelaya Air Base: Bombers Burned to Ashes\nAt Belaya Air Base, located around 4,000 kilometers inside Russia, images taken on June 4 show wreckage of several strategic bombers, including the iconic Tupolev Tu-95 aircraft.\nParts of these bombers—including wings and fuselages—can be seen reduced to ashes, with debris flung almost 100 meters across the tarmac. One of the most striking images shows what appears to be a decoy plane painted on the tarmac, suggesting Russian attempts to mislead enemy drones.\nAnother image from Belaya shows four Tu-22 supersonic bombers still parked, while a fifth one lies completely destroyed. Some clean-up appears to have occurred in the past two days, with bits of burnt aircraft debris cleared away.\nThe Tu-22 bombers, originally designed to attack aircraft carriers and naval fleets, have recently been repurposed to strike ground targets, making their loss significant.\nAt least 10 bombers at Belaya appear to have been hit, though the exact count is unclear due to clean-up efforts.\nOlenya Air Base: Arctic Strikes Cause Massive Damage\nLocated in Russia’s Arctic Murmansk region, Olenya Air Base also suffered major damage. Satellite images reveal multiple aircraft destroyed, including bombers stationed side by side that now appear to be nothing more than scattered debris.\nThough it’s hard to identify the specific aircraft from the new images, pre-strike photos confirm that both Tu-22 and Tu-95 bombers were stationed at Olenya.\nIn fact, it was from this base that the first video of the Ukrainian drone strike emerged, showing smoke billowing from hit bombers. Drones had zeroed in on the aircraft, turning them into fireballs.\nMore Images Awaited From Other Bases\nHeavy cloud cover continues to block clear satellite views of the other three airbases: Ivanovo Severny, Dyagilevo, and Ukrainska. Once the weather clears, new satellite data is expected to reveal the extent of the damage at those locations as well.\nSo far, today’s images confirm at least 10 destroyed aircraft, but Ukrainian officials claim that the total number of destroyed jets is as high as 41. According to reports, the drones were secretly smuggled inside container trucks, in what Ukrainian officials are calling a “Trojan horse” style assault, before being remotely activated near their targets.\nRussia Caught Off Guard by Long-Range Attack\nThis drone attack has stunned Moscow, primarily because the targeted bases lie so far inside Russian territory, areas previously considered out of reach. Neither the U.S.-supplied ATACMS missiles nor the British-French Storm Shadow missiles have the range to strike targets at such distances.\nUkraine’s use of long-range drones for the attack signals a new phase in the war—one where traditional geographic safety zones may no longer apply.\nDespite this success, Russia still holds an overwhelming air superiority in the ongoing conflict. However, Kyiv’s morale has gotten a significant boost, while Russian military confidence has taken a visible hit.\nTrump Speaks with Putin After Airbase Strike\nAdding to the political drama, former U.S. President Donald Trump revealed that he had a lengthy phone call with Russian President Vladimir Putin after the drone strikes. “I just finished speaking, by telephone, with President Vladimir Putin, of Russia. The call lasted approximately one hour and 15 minutes,” Trump wrote on Truth Social, his social media platform. “We discussed the attack on Russia’s docked airplanes, by Ukraine, and also various other attacks that have been taking place by both sides. It was a good conversation, but not a conversation that will lead to immediate Peace. President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.”\nPutin’s warning signals possible escalation, though it remains to be seen how Moscow plans to respond.\nALSO READ: Trump Administration To Mandate Social Media Screening For All Foreign Students, Puts New Student Visa Interviews On Hold","summary":"High-resolution satellite images have emerged showing the destruction caused by Ukraine’s bold drone assault on five key Russian air bases, carried out under “Operation Spider Web.”","url":"https://www.newsx.com/world/ukraines-deep-strike-drone-attacks-expose-vulnerabilities-in-russias-heartland-satellite-images-reveal-widespread-destruction/","image":"https://www.newsx.com/wp-content/uploads/2025/06/russia-air-bases.webp","video":null,"publish_date":"2025-06-05 00:15:47","author":"Srishti Mukherjee","authors":["Srishti Mukherjee"],"language":"en","category":"politics","source_country":"in","sentiment":-0.132},{"id":328203876,"title":"Trump signs proclamation to restrict foreign student visas at Harvard","text":"HuffPost UKNew Reform UK MP Stuns The Commons With Outrageous Request In PMQsKeir Starmer told Sarah Pochin he would not \"follow her down that line\".\n\nHuffPost UKPutin's 'Blatant Disregard' For Russian Troops Unveiled As Moscow Approaches 'Grizzly' Milestone\"Russia has paid an extraordinary blood price\" for comparatively little land, according to a think tank.\n\n Why this ad?Go ad-free* \n\nThe TelegraphTrump rocked as China launches its latest economic weaponWhen or if Donald Trump gets on the phone with Xi Jinping, the tone between the two men is likely to be frosty.\n\nBirmingham LiveKeir Starmer issues message to pensioners who lost Winter Fuel PaymentsThe Government has announced a U-turn over the winter fuel allowance\n\nHuffPostFox News Star Taunts Trump Over His Claim About Volodymyr ZelenskyyThe prominent pundit for the conservative channel didn't forget what Trump said to the Ukrainian leader, and he zinged him for it.\n\n Why this ad?Go ad-free* \n\nHuffPost UKTop Putin Ally Delivers Major Blow To Trump's Peace Efforts With Ukraine AdmissionDmitry Medvedev also appeared to threaten revenge for Ukraine's latest drone strikes.\n\nBuzzFeedThe Internet Is Having A Field Day With The Timestamp On Trump's Latest China PostAs I always say, nothing good happens at that hour.\n\nHuffPostMusk Escalates Megabill Attacks, With Trump Reportedly ‘Furious’The president's former adviser suggests “we fire all politicians” supporting Trump's so-called Big Beautiful Bill.\n\n Why this ad?Go ad-free* \n\nThe IndependentTrump says Putin told him ‘very strongly’ he will ‘have to respond’ to Ukraine drone strikes in hour-long callTrump says he also discussed ongoing talks on Iran’s nuclear program with the Russian leader\n\nSnopesFact Check: Trump did not say Ukraine must compensate Russia for destroyed aircraftUkraine said its drones hit Russian aircraft on June 1, 2025.\n\nEvening StandardSecret Ukraine operation 'hits bridge linking Crimea to Russia with 1,100kg of explosives' in dawn attackThe vast bridge has come under repeated attack by Kyiv forces\n\n Why this ad?Go ad-free* \n\nHuffPost UKIs Nigel Farage About To Give Keir Starmer Another Bloody Nose At The Ballot Box?Reform UK believe they could beat Labour in a crunch by-election this week.\n\nThe HillOpinion - The Constitution strikes back against TrumpTrump cannot grasp that his fundamental problem is with the Constitution, not the judges. His executive orders are too much for some of his own judicial appointees.\n\nHuffPostJen Psaki Mocks Trump’s Vanishing Act With Brutal 2-Word Blast From The PastThe MSNBC host said the president has taken his longest break from the public eye since returning to office.\n\n Why this ad?Go ad-free* \n\nThe TelegraphUkraine strikes Putin’s prized spy planesUkraine has damaged at least two of Russia’s rare A-50 surveillance aircraft in its audacious drone attack on Vladimir Putin’s strategic bomber fleet, according to intelligence shared with The Telegraph.\n\nHuffPostJon Stewart Nails 1 Problem With 'New Crazy Thing' Trump Just Pulled 'Out Of His Ass'The \"Daily Show\" host mocked the president over his latest conspiracy theory.\n\nThe Daily BeastFlustered Don. Jr. Gets Cornered on Trump’s Shady Crypto SchemesA squirming Donald Trump Jr. tried to distance himself from his dad’s crypto deals after offering a half-hearted defense of the scheme Tuesday. The Trump family decided to go “all in” on crypto after banks began denying them loans, Trump Jr. told the hosts of CNBC’s Squawk Box on Tuesday. Last year, Don Jr. and his brother Eric launched a crypto company called World Liberty Financial, which in March launched a currency pegged to the U.S. dollar. Just days before his second inauguration, Presiden\n\n Why this ad?Go ad-free* \n\nYahoo Finance'A disgusting abomination': Elon Musk doubles down on his criticism of Trump's 'big, beautiful bill'Elon Musk offered his harshest rebuke yet of President Trump's signature 'big, beautiful' tax and spending bill advancing on Capitol Hill Tuesday, saying it is 'a disgusting abomination.'\n\nHuffPostTrump Official Predicts MAGA Crowd’s Sycophantic Moment During Army ParadeMonica Crowley said she’s “sure” it will happen.\n\nCNNAs Ukraine batters Russia with daring assaults, firebrand pro-Kremlin pundits rattle nuclear sabersHow will Moscow respond to the stunning Ukrainian drone strikes on its fleet of strategic aircraft?","url":"https://uk.news.yahoo.com/trump-signs-proclamation-restrict-foreign-001501180.html","image":"https://media.zenfs.com/en/theguardian_763/90b190add2fdd55d993853e30276167d","video":null,"publish_date":"2025-06-05 00:15:01","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.204},{"id":328206498,"title":"Trump announces travel ban affecting a dozen countries set to go into effect Monday","text":"President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United…","url":"https://japantoday.com/category/world/trump-announces-travel-ban-affecting-a-dozen-countries-set-to-go-into-effect-monday","image":"https://media.japantoday.com/img/store/70/a9/e431043449aa7715559b88016555a5a7bc53/download/_w1700.jpeg","video":null,"publish_date":"2025-06-05 00:13:51","author":"Chris Megerian,Japan Today Editor","authors":["Chris Megerian","Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.018},{"id":328211396,"title":"Trump signed proclamation to ban travel from 12 countries, restriction on 7 countries","text":"WASHINGTON — President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as business people, tourists and people visiting friends and family.\n\nThe order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House.","url":"https://chicago.suntimes.com/politics/2025/06/04/trump-signed-proclamation-to-ban-travel-from-12-countries-restriction-on-7-countries","image":"https://cst.brightspotcdn.com/dims4/default/15e4aa5/2147483647/strip/true/crop/1024x585+0+23/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F47%2F7541861df623c0b4e1bf81f82909%2Ftrump-","video":null,"publish_date":"2025-06-05 00:12:11","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.1},{"id":328202644,"title":"Sean Spicer Predicts Karine Jean-Pierre Is Still ‘Team Biden’ and New Book Will ‘Stick a Knife’ in White House Colleagues | Video","text":"Sean Spicer, former press secretary to Donald Trump, reacted with skepticism on Wednesday about Karine Jean-Pierre’s announcement that she is leaving the Democratic Party, considering it appears her upcoming book about Biden’s last days in the White House will side with the former president.\n\n“It sure sounds like she’s going to stick a knife in the people who pushed Biden out,” Spicer said on a new episode of “The Megyn Kelly Show.” “It sounds like she’s still Team Biden, and we’ll get a bunch of nonsense about how he could have [won the 2024 election].”\n\nSpicer cited publisher Hachette’s press release that “Independent: A Look Inside a Broken White House, Outside the Party Lines,” is about the “betrayal” of Democratic Party leaders who convinced Biden to step down from the 2024 race and back Vice President Kamala Harris instead.\n\nWatch the full segment below:\n\nKelly added, “Color me curious about her insider details — less interested in her definition of what it means to be independent.”\n\nThe one self-identified Democrat on Wednesday’s “Megyn Kelly” panel, Dan Turrentine, who co-hosts “Morning Meeting” with Spicer on the 2Way platform, echoed Kelly’s thoughts. \n\n“I’ll be curious about her angle,” Turrentine said. “She had real tension with people inside the White House who didn’t think she was qualified. There were concerns she struggled to respond without reading from the briefing book.”\n\nSpicer, who served as Trump’s press secretary for only a few months in 2017 before going on to “Dancing With the Stars,” argued that, “Jean-Pierre was the most epically unqualified person to hold that position.”\n\nHe added, “No one in America wants her political analysis.”\n\nJean-Pierre’s book follows CNN anchor Jake Tapper’s “Original Sin,” about the alleged cover-up over Biden’s cognitive decline. Spicer quipped, “The pitch was probably: ‘If Jake Tapper can sell a book, why can’t I be independent?\n\n“Independent: A Look Inside a Broken White House, Outside the Party Lines,” is scheduled to be released in October.","summary":"The former press secretary for President Trump tells Megyn Kelly that the book will likely present \"a bunch of nonsense\" about how Biden could have won in 2024\n\n\nThe post Sean Spicer Predicts Karine Jean-Pierre Is Still &#8216;Team Biden&#8217; and New Book Will &#8216;Stick a Knife&#8217; in White House Colleagues | Video appeared first on TheWrap.","url":"https://www.thewrap.com/sean-spicer-slams-karine-jean-pierre-independent-book-megyn-kelly/","image":"https://www.thewrap.com/wp-content/uploads/2023/09/karine-jean-pierre-GettyImages-1403300934.jpg","video":null,"publish_date":"2025-06-05 00:11:06","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","source_country":"US","sentiment":-0.311},{"id":328208732,"title":"Donald Trump signs travel BAN stopping people from 12 countries entering the US with restrictions to hit in days","text":"DONALD Trump has signed a sweeping new travel ban blocking people from a dozen countries from entering the US — with restrictions set to kick in within days.\n\nThe bombshell move, announced late Wednesday, resurrects the explosive “Muslim ban” policy from his first term and will take effect at 12.01am Monday.\n\nThe countries hit with a full ban include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the outright ban, heightened restrictions will be slapped on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in a proclamation.\n\nThe sweeping list stems from a January 20 executive order, in which Trump tasked the State Department, Homeland Security, and the Director of National Intelligence with flagging “hostile attitudes” and countries that pose a national security risk.\n\nThe crackdown mirrors Trump's highly controversial 2017 executive order, which initially barred citizens from seven majority-Muslim nations — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen — triggering chaos at airports and global backlash.\n\nDubbed the “Muslim ban”, it sparked scenes of confusion as travellers, including students and tourists, were blocked from boarding planes or detained after landing in the US.\n\nAfter legal challenges, the policy was retooled and upheld by the Supreme Court in 2018, with a version targeting Iran, Somalia, Yemen, Syria and Libya, alongside North Korea and Venezuelan officials.\n\nTrump has consistently defended the bans as vital to national security, despite critics accusing him of religious discrimination.\n\nThe latest move ramps up his hardline immigration stance as the Republican firebrand gears up for a second term — once again placing border control and national safety at the heart of his presidency.\n\nEarlier on Wednesday, Trump held an hour-long call with Vladimir Putin, revealing the Kremlin tyrant “will have to respond” to Ukraine’s devastating drone blitz on Russian airfields.\n\n“It was a good conversation, but not a conversation that will lead to immediate Peace,” Trump wrote on Truth Social.\n\n“President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.”\n\nThe warning came after Operation Spiderweb — a daring Ukrainian drone assault that wiped out 41 Russian warplanes across four strategic air bases, including nuclear-capable bombers.\n\nThe pair also discussed Iran’s nuclear programme, with Trump writing: “I stated to President Putin that Iran cannot have a nuclear weapon and, on this, I believe that we were in agreement.”\n\nHe added: “President Putin suggested that he will participate in the discussions with Iran and that he could, perhaps, be helpful in getting this brought to a rapid conclusion.”\n\nMore to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos.","summary":"","url":"https://www.thesun.ie/news/15320679/trump-travel-ban-us-dozen-countries-restrictions/","image":"https://www.thesun.ie/wp-content/uploads/sites/3/2025/06/newspress-collage-1y39p20h5-1749082074345.jpg?1749085824&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-06-05 00:09:04","author":"Juliana Cruz Lima","authors":["Juliana Cruz Lima"],"language":"en","category":"politics","source_country":"ie","sentiment":0.125},{"id":328203564,"title":"Donald Trump signs travel BAN stopping people from 12 countries entering the US with restrictions to hit in days","text":"DONALD Trump has signed a sweeping new travel ban blocking people from a dozen countries from entering the US — with restrictions set to kick in within days.\n\nThe bombshell move, announced late Wednesday, resurrects the explosive “Muslim ban” policy from his first term and will take effect at 12.01am Monday.\n\nThe countries hit with a full ban include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the outright ban, heightened restrictions will be slapped on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in a proclamation.\n\nThe sweeping list stems from a January 20 executive order, in which Trump tasked the State Department, Homeland Security, and the Director of National Intelligence with flagging “hostile attitudes” and countries that pose a national security risk.\n\nThe crackdown mirrors Trump's highly controversial 2017 executive order, which initially barred citizens from seven majority-Muslim nations — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen — triggering chaos at airports and global backlash.\n\nDubbed the “Muslim ban”, it sparked scenes of confusion as travellers, including students and tourists, were blocked from boarding planes or detained after landing in the US.\n\nAfter legal challenges, the policy was retooled and upheld by the Supreme Court in 2018, with a version targeting Iran, Somalia, Yemen, Syria and Libya, alongside North Korea and Venezuelan officials.\n\nTrump has consistently defended the bans as vital to national security, despite critics accusing him of religious discrimination.\n\nThe latest move ramps up his hardline immigration stance as the Republican firebrand gears up for a second term — once again placing border control and national safety at the heart of his presidency.\n\nEarlier on Wednesday, Trump held an hour-long call with Vladimir Putin, revealing the Kremlin tyrant “will have to respond” to Ukraine’s devastating drone blitz on Russian airfields.\n\n“It was a good conversation, but not a conversation that will lead to immediate Peace,” Trump wrote on Truth Social.\n\n“President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.”\n\nThe warning came after Operation Spiderweb — a daring Ukrainian drone assault that wiped out 41 Russian warplanes across four strategic air bases, including nuclear-capable bombers.\n\nThe pair also discussed Iran’s nuclear programme, with Trump writing: “I stated to President Putin that Iran cannot have a nuclear weapon and, on this, I believe that we were in agreement.”\n\nHe added: “President Putin suggested that he will participate in the discussions with Iran and that he could, perhaps, be helpful in getting this brought to a rapid conclusion.”\n\nMore to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos.","summary":"","url":"https://www.thesun.co.uk/news/35266401/trump-travel-ban-us-dozen-countries-restrictions/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/06/newspress-collage-1y39p20h5-1749082074345.jpg?1749085802&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-06-05 00:09:04","author":"Juliana Cruz Lima","authors":["Juliana Cruz Lima"],"language":"en","category":"politics","source_country":"gb","sentiment":0.125},{"id":328202080,"title":"Trump announces travel ban affecting a dozen countries set to go into effect Monday (World)","text":"President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House.","summary":"President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States. The countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti,...","url":"https://www.castanet.net/news/World/554433/Trump-announces-travel-ban-affecting-a-dozen-countries-set-to-go-into-effect-Monday","image":"https://www.castanet.net/content/2025/6/db90b94c3eabdedd413479591e886bf5d56923f207cc594b48315d2e77a37c60_p4210806.jpg","video":null,"publish_date":"2025-06-05 00:09:00","author":"Chris Megerian And,The Canadian Press","authors":["Chris Megerian And","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.1},{"id":328207258,"title":"World News | Trump Announces Travel Ban Affecting a Dozen Countries Set to Go into Effect Monday","text":"Washington, Jun 5 (AP) President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States. The countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. Also Read | Operation Sindoor Outreach: Shashi Tharoor-Led Multi-Party Delegation Meets US Representatives, Congressmen in Washington DC. In addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela. “I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation. Also Read | Nagpur Woman Sunita Jamgade, Who Crossed Into Pakistan for Love, Used Google Maps To Cross LoC: Report. The list results from a January 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk. During his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. It was one of the most chaotic and confusing moments of his young presidency. Travellers from those nations were either barred from getting on their flights to the US or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family. The order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018. The ban affected various categories of travellers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families. Trump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.","url":"https://www.latestly.com/agency-news/world-news-trump-announces-travel-ban-affecting-a-dozen-countries-set-to-go-into-effect-monday-6906382.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-05 00:08:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.123},{"id":328203884,"title":"US updates: Trump announces full travel ban for 12 countries","text":"US President Donal Trump slaps travel bans on a dozen countries Ban comes into affect at 12.01 a.m. on Monday\n\nHere is DW's roundup of news from the United States on Thursday, June 5, 2025:\n\nTrump bans citizens from 12 countries from entering US\n\nUS President Donald Trump has signed a proclamation banning all travel from certain countries.\n\nThe proclamation fully restricts and limits the entry of nationals from 12 countries: Afghanistan, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Myanmar, Somalia, Sudan and Yemen, the White House said.\n\nThe ban will take effect at 12:01 a.m. Monday Washington time, news agencies reported.\n\nVisitors to the United States from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will also face heightened restrictions.\n\n\"I must act to protect the national security and national interest of the United States and its people,\" Trump said in his proclamation.\n\nTrump's first term saw sweeping travel bans\n\nTrump also implemented several travel bans for certain countries during his first term as US president.\n\nHis first ban in 2017 targeted seven majority-Muslim countries for 90 days.\n\nLater bans included Myanmar, Eritrea, Iran, Kyrgyzstan, Libya, Nigeria, North Korea, Somalia, Sudan, Syria, Tanzania, Venezuela, and Yemen. These were lifted by former US President Joe Biden in 2021.\n\nWelcome to our coverage\n\nThe White House has announced a full travel ban for citizens of 12 countries, and increased travel restrictions on seven other countries.\n\nThe ban will effect at 12:01 a.m. on Monday.\n\nThis blog will keep you updated with these stories plus other news from the United States, along with DW analysis and reporting.","url":"https://uk.news.yahoo.com/us-updates-trump-announces-full-000800584.html","image":"https://s.yimg.com/ny/api/res/1.2/qepeYHu7inllTR3re5mO1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/deutsche_welle_articles_124/88cee51678bf31397d71813da2718ad9","video":null,"publish_date":"2025-06-05 00:08:00","author":"Kate Hairsine with Ap, Reuters, Afp, Dpa","authors":["Kate Hairsine with Ap, Reuters, Afp, Dpa"],"language":"en","category":"politics","source_country":"gb","sentiment":0.431},{"id":328201998,"title":"Pres. Trump announces travel ban affecting 12 countries set to go into effect Monday","text":"President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n\"I must act to protect the national security and national interest of the United States and its people,\" Trump said in his proclamation.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on \"hostile attitudes\" toward the U.S. and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries - Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the \"Muslim ban\" or the \"travel ban,\" was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House.","summary":"President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.","url":"https://abc7.com/post/president-donald-trump-announces-travel-ban-affecting-dozen-countries-set-go-effect-monday/16659611/","image":"https://cdn.abcotvs.com/dip/images/16278963_042925-kgo-ap-trump-img.jpg?w=1600","video":null,"publish_date":"2025-06-05 00:05:33","author":"Chris Megerian And Farnoush Amiri","authors":["Chris Megerian And Farnoush Amiri"],"language":"en","category":"politics","source_country":"US","sentiment":0.1},{"id":328206472,"title":"Heated exchange erupts over Cuomo’s ‘Defund the Police’ attacks","text":"Mayoral frontrunner Andrew Cuomo tried to make political bank during the heated Democratic mayoral primary Wednesday — by calling out his opponents’ past support for the “Defund the Police” movement.\n\nThe former governor claimed the eight other candidates onstage during the highly-anticipated WNBC, WNJU and Politico New York debate had called for less money to flow to police.\n\n“We wouldn’t need more police if we didn’t defund them in the first place,” Cuomo said.\n\nThe attack prompted the Rev. Michael Blake – who emerged as the debate’s breakout star in its first hour – to call out Cuomo for allegedly saying “defund the police” when he served as governor.\n\nBlake pushed Cuomo to admit he used those three words.\n\nThe “defund” attacks didn’t just come from Cuomo. \n\nQueens Assemblyman Zohran Mamdani, who is gaining Cuomo in the polls, was criticized by longshot candidate Whitney Tilson for past X post that called the NYPD “wicked & corrupt.” \n\nThe resurfaced post from 2020 is still live on Mamdani’s account. It responded to a ProPublica investigation about alleged abuses by the NYPD’s vice squad.\n\n“There is no negotiating with an institution this wicked & corrupt,” Mamdani had posted. \n\n“Defund it. Dismantle it. End the cycle of violence.”\n\nMamdani responded to the attacks by calling NYPD a critical part of public safety in the city and arguing rank-and-file cops don’t want to be handling mental health calls that other professionals can better handle.\n\nThe two top Democratic candidates — Cuomo and Mamdani — also battled over President Trump.\n\n“I am the last person on this stage that Mr. Trump wants to see as mayor,” Cuomo said when asked how he will deal with the president.\n\nTrump would cut through Mamdani “like a hot knife through butter” if the socialist is elected mayor, Cuomo argued.\n\nMoments later, Mamdani also sought to add that the Trump-foe feather to his cap.\n\n“I am Donald Trump’s worst nightmare, as a progressive Muslim immigrant who actually fights for the things that I believe in and the difference between myself and Andrew Cuomo,” he said.","summary":"Andrew Cuomo and Michael Blake sparred over the “Defund the Police” movement in a heated moment.","url":"https://nypost.com/2025/06/04/us-news/heated-exchange-erupts-over-cuomos-defund-the-police-attacks/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/former-new-york-governor-new-105456770_edd011.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/PVHUIZC6-RyIcpnTz.mp4","publish_date":"2025-06-05 00:05:32","author":"David Propper","authors":["David Propper"],"language":"en","source_country":"us","sentiment":-0.121},{"id":328211422,"title":"Trump announces travel ban affecting a dozen countries","text":"US President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 am Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n\"I must act to protect the national security and national interest of the United States and its people,\" Trump said in his proclamation.\n\nThe list results from a January 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on \"hostile attitudes\" toward the US and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order banning travel to the US by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his earlier presidency. Travellers from those nations were either barred from getting on their flights to the US or detained at US airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the \"Muslim ban\" or the \"travel ban,\" was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travellers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias.\n\nHowever, the president had called for an explicit ban on Muslims during his first campaign for the White House.","summary":"President Donald Trump is again banning people from countries his administration deems dangerous from coming to the US.","url":"https://thewest.com.au/politics/trump-announces-travel-ban-affecting-a-dozen-countries-c-18930343","image":"https://images.thewest.com.au/publication/C-18930343/da4e4e2999d1dfbb61c0a13d8e07d641cde266c7-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-06-05 00:05:25","author":"Chris Megerian,CHRIS MEGERIAN and FARNOUSH AMIRI","authors":["Chris Megerian","CHRIS MEGERIAN and FARNOUSH AMIRI"],"language":"en","category":"politics","source_country":"au","sentiment":0.065},{"id":328210642,"title":"Trump announces travel ban affecting a dozen countries set to go into effect Monday","text":"WASHINGTON (AP) — President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a...","url":"https://whdh.com/news/trump-announces-travel-ban-affecting-a-dozen-countries-set-to-go-into-effect-monday/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/04/trump_5accf0.jpg?quality=60&strip=color","video":null,"publish_date":"2025-06-05 00:05:05","author":"Associated Press,Michael Mahar","authors":["Associated Press","Michael Mahar"],"language":"en","category":"politics","source_country":"us","sentiment":0.016},{"id":328205500,"title":"Trump bans travel to US from several countries to block ‘dangerous foreign actors’","text":"President Donald Trump has signed a sweeping order blocking travel to the U.S. from nearly 20 countries identified as high-risk for terrorism, visa abuse and failure to share security information. The new travel restrictions — announced under Executive Order 14161 — apply to nationals from 12 countries, including Afghanistan, Iran, Somalia, Libya, and Yemen, all deemed \"very high risk\" due to terrorist activity, weak or hostile governments, and high visa overstay rates. TRUMP ADMIN MULLS NEW TRAVEL BAN, BUT NO DECISIONS MADE YET Seven more countries, including Venezuela, Cuba, and Laos, face partial restrictions. \"President Trump is fulfilling his promise to protect Americans from dangerous foreign actors that want to come to our country and cause us harm,\" said White House Deputy Press Secretary Abigail Jackson to Fox News Digital. She called the restrictions \"commonsense\" and targeted at countries that \"lack proper vetting, exhibit high visa overstay rates, or fail to share identity and threat information.\" TRUMP VISA POLICY ‘FAR MORE RESTRAINED’ THAN BIDEN POLICY TARGETING ISRAELIS THAT FLEW UNDER THE RADAR: EXPERT Afghanistan, for example, has a student visa overstay rate of 29.3% and is controlled by the Taliban, a designated global terrorist group. CLICK HERE TO GET THE FOX NEWS APP Iran remains a state sponsor of terrorism and has refused cooperation with U.S. authorities. Libya, Somalia, and Yemen all lack functioning governments capable of issuing secure documents.","summary":"President Donald Trump imposed travel restrictions to the US from several countries identified as high-risk due to terrorism, visa overstays, or lack of security cooperation.","url":"https://www.foxnews.com/politics/president-trump-bans-travel-us-from-several-countries-block-dangerous-foreign-actors","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/ap25054069841998.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-05 00:01:09","author":"Brooke Singman,Jasmine Baehr,Patrick Ward","authors":["Brooke Singman","Jasmine Baehr","Patrick Ward"],"language":"en","category":"politics","source_country":"us","sentiment":-0.145},{"id":328202290,"title":"Columbia's accreditation threatened over harassment of Jewish students","text":"June 4 (UPI) -- The U.S. Department of Education is threatening Columbia University's accreditation because the agency said the New York private school violated Title IX by not cracking down on harassment of Jewish students.\n\nThe federal department on Wednesday notified the nonprofit and private Middle States Commission on Higher Education that Columbia is in violation of federal antidiscrimination laws and fails to meet the standards for accreditation set by the commission.\n\nOn May 22, the Education Department's Office for Civil Rights and the Department of Health and Human Services' Office for Civil Rights \"determined that Columbia University acted with deliberate indifference toward the harassment of Jewish students, thereby violating Title VI of the Civil Rights Act of 1964.\"\n\nThe act prohibits recipients of federal funding from discriminating on the basis of race, color or national origin.\n\n\"Specifically, OCR and HHS OCR found that Columbia failed to meaningfully protect Jewish students against severe and pervasive harassment on Columbia's campus and consequently denied these students' equal access to educational opportunities to which they are entitled under the law,\" the release Wednesday said.\n\nIn a statement posted on its website: \"Columbia is aware of the concerns raised by the U.S. Department of Education's Office for Civil Rights today to our accreditor, the Middle States Commission on Higher Education, and we have addressed those concerns directly with Middle States. Columbia is deeply committed to combatting antisemitism on our campus. We take this issue seriously and are continuing to work with the federal government to address it.\"\n\nUnder federal law, private accreditors are required to notify any member institution about a federal noncompliance finding and establish a plan to come into compliance. An accreditor must take appropriate action against a member institution if they remain noncompliant.\n\n\"In light of OCR's determination, Columbia University no longer appears to meet the Commission's accreditation standards,\" the Education Department said.\n\nOn Feb. 3, OCR initiated a directed investigation of Columbia University on the harassment.\n\nWhen an institution does not meet accreditation standards, it may be placed on probation or issued a warning, according to the Middle States Commission.\n\nRawan Abbasi, assistant director for communications for the Middle States Commission on Higher Education, told NBCNews the accreditor is \"aware of the press release issued today by the United States Department of Education (USDE) regarding Columbia University and can confirm that we received a letter regarding this matter this afternoon.\n\nIn March, the Trump administration paused $400 million in federal funding, including for medical and scientific research, at Columbia.\n\nIn May, the school said it had agreed to the administration's demands regarding the harassment of Jewish students. The school said it was forced cut 180 staffers whose jobs were funded by the federal grants.\n\nDespite the Trump administration's actions, students protested the war like last year's encampments.\n\nOn May 7, two Columbia University Public Safety officers were injured after 100 pro-Palestinian protesters forced their way into the campus' library in \"actions that are outrageous,\" the university president said.\n\nAbout 22.8% of Columbia's 6,578 undergraduate students, or 1,500, are Jewish, according to Hillel International. Jewish graduate school enrollment is 15.9% of the 22,000 total.\n\n\"After Hamas' October 7, 2023, terror attack on Israel, Columbia University's leadership acted with deliberate indifference towards the harassment of Jewish students on its campus,\" Secretary of Education Linda McMahon said in the news release. \"This is not only immoral, but also unlawful. Accreditors have an enormous public responsibility as gatekeepers of federal student aid.\n\n\"They determine which institutions are eligible for federal student loans and Pell Grants. Just as the Department of Education has an obligation to uphold federal antidiscrimination law, university accreditors have an obligation to ensure member institutions abide by their standards.\n\nThe war in the Middle East began when Hamas invaded Israel, killing more than 1,200 people and taking hundreds more hostage. Israel retaliated on the Gaza Strip, and more than 54,000 Palestinians have died, according to the Hamas-run Gaza Health Ministry.\n\nMcMahan said she looked forward to the \"Commission keeping the Department fully informed of actions taken to ensure Columbia's compliance with accreditation standards, including compliance with federal civil rights laws.\"\n\nPresident Donald Trump signed an executive order in April, called Reforming Accreditation to Strengthen Higher Education, that the department \"has an obligation to promptly provide accreditors with any noncompliance findings related to member institutions.\"\n\nOther universities have told to comply school policy changes or risk losing federal funding after they were accused of tolerating antisemitism on campus or other violations.\n\nOn May 29, a federal judge blocked the Trump administration from its attempt to deny Harvard University's ability to admit international students. The Trump administration has paused $2.2 billion in funding and canceled remaining contracts for the school in Cambridge, Mass., after the private school rejected demands, including changes to its hiring practices and policies regarding \"viewpoint diversity\" on campus.","summary":"The U.S. Department of Education is threatening Columbia University's accreditation because the agency said the New York private school violated Title IX by not cracking down on harassment of Jewish students.","url":"https://www.upi.com/Top_News/US/2025/06/04/Trump-administration-threatens-Columbia-accreditation/9771749076737/","image":"https://cdnph.upi.com/ph/st/th/9771749076737/2025/upi/a45dc67f05927d7c592a559ce1ef54cf/v1.2/Columbias-accreditation-threatened-over-harassment-of-Jewish-students.jpg","video":null,"publish_date":"2025-06-04 23:58:43","author":"Allen Cone","authors":["Allen Cone"],"language":"en","category":"politics","source_country":"us","sentiment":-0.461},{"id":328203410,"title":"Putin will seek revenge for Ukraine drone attack, warns Trump","text":"Vladimir Putin has said he will have to respond to Ukraine's major drone attack on Russian airbases, US President Donald Trump has warned.\n\nSpeaking after a phone call with the Russian president, Trump said: \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.\"\n\nRussian officials declined to confirm this on Wednesday night, but Moscow had earlier said that military options were \"on the table\" for its response.\n\nTrump warned in a social media post that the phone call, which lasted more than an hour, would not \"lead to immediate peace\" between Russia and Ukraine.\n\nRussia's RIA Novosti, a state-owned news agency, said Putin told Trump that Ukraine has tried to \"disrupt\" the negotiations and that the government in Kyiv has \"essentially turned into a terrorist organisation\".\n\nThe two also \"exchanged views on the prospects for restoring cooperation between the countries, which has enormous potential,\" it said.\n\nThe conversation between the two leaders marks the first since Ukraine launched a surprise attack using smuggled drones to strike Russian airbases on 1 June, targeting what it said were nuclear-capable long-range bombers.\n\nTrump told Putin in the call that the US was not warned in advance of the attack, Russian presidential aide Yury Ushakov said.\n\nUkraine's Minister of Strategic Industries Yuriy Sak told Radio 4's World Tonight programme his country had hoped the US would respond to the \"incessant Russian missile and drone attacks\" with \"more sanctions and with more pressure\".\n\nLast week, Trump appeared to set a two-week deadline for Putin, threatening to change how the US is responding to Russia if he believed Putin was still \"tapping\" him along on peace efforts in Ukraine.\n\nThe comment was one of a string of critical remarks by Trump, who on 26 May said that Putin had gone \"absolutely crazy\" and was \"playing with fire\" after Russia escalated drone and missile attacks on cities in Ukraine, killing dozens of civilians.\n\nTrump made no mention of a deadline or his previous remarks in Wednesday's post on his Truth Social platform.\n\nIn a post on X, Ukrainian President Volodymyr Zelensky talked about the scale of Russian attacks on his country since Moscow's full-scale invasion in 2022.\n\n\"Many have spoken with Russia at various levels. But none of these talks have brought a reliable peace, or even stopped the war,\" Zelensky wrote.\n\n\"If the world reacts weakly to Putin's threats, he interprets it as a readiness to turn a blind eye to his actions,\" he added.\n\nOn Wednesday, a delegation of Ukrainian officials, including Deputy Prime Minister Yulia Svyrydenko and Presidential Office head Andriy Yermak were set to meet with US senators in Washington to discuss arms purchases and efforts to stop the fighting.\n\nIn a social media post, Yermak said that the delegation planned to discuss \"defence support and the situation on the battlefield\", sanctions against Russia and a previously signed reconstruction investment fund.\n\nThe post also comes just days after a second round of direct peace talks in Istanbul between the warring sides ended without a major breakthrough, although they agreed to swap more prisoners of war.\n\nUkrainian negotiators said Russia rejected an \"unconditional ceasefire\" - a key demand of Kyiv and its Western allies, including the US.\n\nThe Russian team said they had proposed multi-day ceasefires in \"certain areas\" of the frontline in Ukraine, although they gave no further details.\n\nTrump has previously - and repeatedly - said he believes the two sides are making progress, despite ongoing fighting on the frontline and aerial attacks carried out in both Russia and Ukraine.\n\nSeparately on Wednesday, Putin also had a call with the US-born Pope Leo XIV.\n\nThe Vatican confirmed that \"particular attention\" was paid to peace in the Ukraine war.\n\nIn Putin's call with Trump, the two leaders also discussed Iran. Trump said he believed the two \"were in agreement\" that \"Iran cannot have a nuclear weapon\".\n\nThe US reportedly proposed that Iran halt all production of enriched uranium, which can be used to make reactor fuel but also nuclear weapons, and instead rely on a regional consortium for supplies.\n\nIran has not yet responded to the plan presented at talks last Saturday.\n\nAccording to Trump, Putin \"suggested that he will participate in discussions with Iran and that he could, perhaps, help get this brought to a rapid conclusion\".\n\n\"It is my opinion that Iran has been slow walking their decision on this very important matter,\" Trump wrote. \"We will need a definitive answer in a very short period of time.\"\n\nIran's Supreme Leader Ayatollah Ali Khamanei has criticised the US proposal and said it will not stop enriching uranium.","summary":"Vladimir Putin has said he will have to respond to Ukraine's major drone attack on Russian airbases, US President Donald Trump has warned.","url":"https://www.myjoyonline.com/putin-will-seek-revenge-for-ukraine-drone-attack-warns-trump/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/03/Tump-and-Putin.jpg","video":null,"publish_date":"2025-06-04 23:58:00","author":"Abubakar Ibrahim,Bbc 58pm","authors":["Abubakar Ibrahim","Bbc 58pm"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.137},{"id":328200912,"title":"US Army defends military parade, wanted by Trump","text":"US Army leaders have defended spending as much as $US45 million ($A69 million) to add a parade to the service's 250th birthday celebration in Washington, saying it will help boost recruitment, as Congress members argue the money could be better spent on other priorities.\n\nSpending for the parade has become a flashpoint since it comes at a time when the Trump administration is slashing funding for personnel and programs across the federal government, including the Defense Department.\n\nMembers of the House Armed Services Committee also said they are concerned the Defense Department is shifting about $1 billion from a variety of accounts — including base housing — to cover the costs of shoring up the defence of the southern border.\n\nWhile the Army has long planned for a festival on the National Mall to celebrate its 250th birthday on June 14, the parade was just recently added.\n\nPresident Donald Trump has long wanted a military parade in the city, after seeing an elaborate one in France on Bastille Day during his first presidential term, and June 14 is also his birthday.\n\nUS Democrat Salud Carbajal, questioned whether the additional cost of the parade was appropriate since all the military services are facing 8 per cent budget cuts, and said perhaps it could be used to improve troops' quality of life or warfighting capabilities.\n\nArmy Secretary Daniel Driscoll replied that the parade offers a chance to tell the public about the Army. \"I believe very specifically that telling that story will directly lead to a recruiting boom and will fill up our pipeline for the coming years,\" he said.\n\nAt the same time, he and Gen. Randy George, chief of staff of the Army, told lawmakers the service has now met its recruiting goal for the year — with 61,000 recruits. Army officials have predicted for months that they would hit the target early after making a series of changes to recruiting programs, recruiters and policies over the past several years.\n\nThat prompted congress member Wesley Bell, to ask why the parade was needed for recruiting if it's already surging.\n\nHouse members on both sides of the aisle pressed the Army about a recent request to shift money from across the budget to support the southern border.\n\nThe biggest concern, they said, is that it takes money away from base housing, which has been plagued with persistent problems, including mould, rodents and raw sewage in barracks.","summary":"US President Donald Trump will get his wish for a big military parade, as Army leaders comes under pressure over its $45 million cost.","url":"https://thewest.com.au/politics/us-army-defends-military-parade-wanted-by-trump-c-18930248","image":"https://images.thewest.com.au/publication/C-18930248/d1ea2234d54d957bc18f0226eec747954e21470c-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-06-04 23:57:23","author":"LOLITA C BALDOR,Lolita C Baldorapthu","authors":["LOLITA C BALDOR","Lolita C Baldorapthu"],"language":"en","category":"politics","source_country":"au","sentiment":0.086},{"id":328210500,"title":"Musk vs Republicans leaves Trump to wonder if he's created a monster","text":"The anger is taking many forms on Elon Musk's X account.\n\nMultiple graphs illustrating the growing national debt.\n\nA meme showing a microscopic pair of scissors with the words: \"Republicans getting ready to reduce the size of government.\"\n\nEven a sword-wielding Uma Thurman from the movie Kill Bill. (Geddit?)\n\nIt all represents a stunning outburst over Donald Trump's \"big, beautiful bill\" just days after Musk's departure from his government cost-cutting gig.\n\nBut the tweet that Musk has chosen to pin to the top of his feed might be the one that most troubles Trump.\n\nIt's a repost of another X user's collection of reader comments from the Fox News website. It shows a lot of support for Musk among the network's MAGA-loving audience.\n\nOne article has attracted almost 8,000 comments at time of writing, and it takes a lot of scrolling to find many that don't back Musk. A lot of them purport to be from Trump supporters who have taken Musk's side of this argument.\n\nIt's by no means a perfect poll, but it could give Trump pause for thought.\n\nMusk's anger doesn't just manifest in tweets.\n\nHis time as Trump's \"first buddy\" earned him a massive MAGA following.\n\nHe now has sizeable influence over the Americans that Trump needs most: the Republican voters who didn't just put him back into power, but also handed him vital, and vulnerable, Republican majorities in both houses of Congress.\n\nWhy is Musk so mad?\n\nMusk justified his controversial work at DOGE with arguments about the need to bring down the national debt.\n\nHe often pointed to the fact the US pays more interest on its debt than it spends on defence.\n\nBut he lamented that he couldn't do more to deal with it.\n\nDOGE's cruelling and culling of government jobs and departments achieved about $US180 billion ($277 billion) in savings, according to its own estimates.\n\nThat would equate to 9 per cent of his early target of $US2 trillion. And those numbers are rubbery and widely viewed with scepticism.\n\nOutside fact-checks of DOGE's online \"wall of receipts\" resulted in reductions to its posted savings claims, and there are disputes over others that remain uncorrected.\n\nAnd a lot of the cuts could still be reversed by the courts, shrinking the savings figure further.\n\nMusk insists DOGE's ongoing work, in his absence, means the savings figure will continue to grow.\n\nBut he recently argued that DOGE was an advisory board rather than \"the dictators of the government\", so the savings achieved were \"proportionate to the support we get from Congress, and from the executive branch of the government in general\".\n\nNow Congress — at the behest of the executive, i.e. Trump — is considering legislating spending and tax cuts which would undermine all those money-saving efforts.\n\nThe most recent analysis, from the nonpartisan Congressional Budget Office, found the One Big Beautiful Bill Act would increase budget deficits by $US2.4 trillion over the next decade.\n\nIt would also increase the debt ceiling, allowing the US to borrow trillions of dollars more than it currently can.\n\nBig spending\n\nTrump's support for the bill — which is full of all sorts of MAGA priorities — has been absolute.\n\nHe's described it as \"arguably the most significant piece of legislation that will ever be signed in the history of our country\".\n\nHis demand that Republicans support it means some apparently did without even reading it.\n\nHard-right Republican and hardcore Trump fan Marjorie Taylor Greene admitted she didn't know what was in it when she voted for it, and voiced regret after discovering it would curb states' power to regulate AI.\n\n\"Full transparency,\" she said, \"I did not know about this section … I would have voted NO.\"\n\nSome of Trump's Republican foot soldiers have been running the line that Musk's anger is just business. House Speaker Mike Johnson suggested it was all about the bill's termination of tax breaks for buyers of electric vehicles.\n\nBut the angry noise on Musk's X platform has so far not been matched on Trump's Truth Social.\n\nAt time of writing, he's limited his online response to a somewhat cryptic repost of Musk's tweet announcing his departure from DOGE.\n\nHe knows a public brawl with Musk is what Democrats have been dreaming about.\n\nBut he also knows all about the power of money in politics.\n\nMusk, the world's richest man, sank hundreds of millions of dollars into getting Trump re-elected.\n\nHe's threatened in the past to fund challengers to sitting Republicans, including from within the party, if they displease him.\n\nHe recently said he was looking to rein in his political spending, but added: \"If I see a reason to do political spending in the future, I will do it.\"\n\nThe midterm elections are only 18 months away.\n\nAll members of the House of Representatives, and a third of the Senate, will face an election battle.\n\nTrump wants not only to retain the slim Republican majorities in the House and Senate but also to make sure those Republicans are cooperative with his MAGA agenda.\n\nMusk's been pumping up those who aren't — retweeting Republicans who are voting against the Big Beautiful Bill.\n\nHe could now see a reason to restart political spending, and try to get more of them into Congress and in Trump's way.\n\nAnd even if he doesn't dig into his billions, the Musk-Trump bromance helped build Musk's influence in the MAGA world. It's something Trump may come to regret.","summary":"The anger with Donald Trump's \"big, beautiful bill\" is taking many creative forms of Elon Musk's X account. It's a different story on Trump's Truth Social.","url":"https://www.abc.net.au/news/2025-06-05/elon-musk-donald-trump-big-beautiful-bill-analysis/105378866","image":"https://live-production.wcms.abc-cdn.net.au/3e3de15aaa8dc4be0ef58f329940d725?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=63&width=862&height=485","video":null,"publish_date":"2025-06-04 23:56:21","author":"Brad Ryan","authors":["Brad Ryan"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.122},{"id":328207112,"title":"Trump announces travel ban affecting a dozen countries set to go into effect Monday","text":"WASHINGTON (AP) — President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk.\n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018.\n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a...","url":"https://wsvn.com/news/politics/trump-announces-travel-ban-affecting-a-dozen-countries-set-to-go-into-effect-monday/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/05/052025-Trump-Golden-Dome.png","video":null,"publish_date":"2025-06-04 23:55:44","author":"Associated Press,Matthew Garcia","authors":["Associated Press","Matthew Garcia"],"language":"en","category":"politics","source_country":"us","sentiment":0.016},{"id":328208232,"title":"Trump announces travel ban affecting a dozen countries set to go into effect Monday - AP News","text":"WASHINGTON (AP) — President Donald Trump is resurrecting the travel ban policy from his first term, signing a proclamation Wednesday night preventing people from a dozen countries from entering the United States.\n\nThe countries include Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nIn addition to the ban, which takes effect at 12:01 a.m. Monday, there will be heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\n\n“I must act to protect the national security and national interest of the United States and its people,” Trump said in his proclamation.\n\nTen of the 19 countries under the bans and restrictions are in Africa, nine of those from majority Black African countries. Several of those, including Sierra Leone, Togo, and Equatorial Guinea, are not known for hosting armed groups that pose a major threat to the West.\n\nThe list results from a Jan. 20 executive order Trump issued requiring the departments of State and Homeland Security and the Director of National Intelligence to compile a report on “hostile attitudes” toward the U.S. and whether entry from certain countries represented a national security risk. \n\nDuring his first term, Trump issued an executive order in January 2017 banning travel to the U.S. by citizens of seven predominantly Muslim countries — Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. \n\nIt was one of the most chaotic and confusing moments of his young presidency. Travelers from those nations were either barred from getting on their flights to the U.S. or detained at U.S. airports after they landed. They included students and faculty as well as businesspeople, tourists and people visiting friends and family.\n\nThe order, often referred to as the “Muslim ban” or the “travel ban,” was retooled amid legal challenges, until a version was upheld by the Supreme Court in 2018. \n\nThe ban affected various categories of travelers and immigrants from Iran, Somalia, Yemen, Syria and Libya, plus North Koreans and some Venezuelan government officials and their families.\n\nTrump and others have defended the initial ban on national security grounds, arguing it was aimed at protecting the country and not founded on anti-Muslim bias. However, the president had called for an explicit ban on Muslims during his first campaign for the White House. \n\nFollow the AP’s coverage of President Donald Trump at https://apnews.com/hub/donald-trump.\n\nAmiri reported from the United Nations. Associated Press writer Ellen Knickmeyer contributed to this report.","summary":"Trump announces travel ban affecting a dozen countries set to go into effect Monday  AP News","url":"https://apnews.com/article/trump-travel-ban-adeaec442cb0f00f4f8a34d208118445","image":"https://dims.apnews.com/dims4/default/c3a24eb/2147483647/strip/true/crop/4228x2378+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F56%2F93656c591b5f21b0b81df4d87365%2F868792d3b05b4a26be43dc920cccd18d","video":null,"publish_date":"2025-06-04 23:55:00","author":"Chris Megerian,Farnoush Amiri","authors":["Chris Megerian","Farnoush Amiri"],"language":"en","category":"politics","source_country":"us","sentiment":0.086}]}