{"offset":0,"number":50,"available":5828,"news":[{"id":258138954,"title":"Trump declines to be interviewed for ’60 Minutes’ election special","text":"NEW YORK – CBS News said Tuesday that Republican presidential nominee Donald Trump has declined to participate in an interview with “60 Minutes” for its election special, which will go forward next Monday with Democratic opponent Kamala Harris alone. Television’s top-rated news program regularly invites the two presidential contenders for separate interviews that air back-to-back on a show near the election. This year, it is scheduled for Monday instead of its usual Sunday time slot. Asked for comment, the former president’s campaign spokesman Steven Cheung said, “Fake news,” adding that there were discussions but nothing was ever locked in. “60 Minutes” said Trump’s campaign had initially agreed to an interview before telling CBS that the former president would not appear. The network said its invitation to sit for an interview still stands, and correspondent Scott Pelley will explain Trump’s absence to viewers. Vice President Harris will appear in a pretaped interviewed with Bill Whitaker. There are currently no other scheduled opportunities for voters to compare the two candidates together. Harris and Trump previously debated on Sept. 10. Although Harris has accepted an invitation from CNN for a second debate later this month, Trump has not accepted.. The interview special is scheduled to air Monday instead of the usual “60 Minutes” time slot because CBS is showing the American Music Awards on Sunday. Cheung said “60 Minutes” insisted upon doing live fact-checking for the interview, “which is unprecedented.” CBS had no immediate comment on his claim. Trump’s interview with “60 Minutes” correspondent Lesley Stahl prior to the 2020 election proved contentious, with the former president ending the session early and his campaign posting an unedited transcript of the session. CBS News was hosting Tuesday’s vice presidential debate between Republican Ohio Sen. JD Vance and Tim Walz, Minnesota’s Democratic governor.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – CBS News said Tuesday that Republican presidential nominee Donald&#8230;\n\n\nThis Post: Trump declines to be interviewed for &#8217;60 Minutes&#8217; election special first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-declines-to-be-interviewed-for-60-minutes-election-special/","image":"https://internewscast.com/wp-content/uploads/2024/10/1727829995_rewrite-this-title-Trump-won039t-participate-in-interview-for-03960.jpg","video":null,"publish_date":"2024-10-02 00:47:32","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.11},{"id":258138942,"title":"Day in Photos: Dockworkers Strike, Centennial Moment, President-Elects","text":"A supporter of former president and Republican presidential nominee Donald Trump and his running mate Senator JD Vance drives past the CBS studios in New York ahead of the vice presidential debate on Oct. 1, 2024. Charly Triballeau/AFP via Getty Images Projectiles are intercepted by Israel above Tel Aviv on Oct. 1, 2024. Air raid sirens sounded in central Israel on Oct. 1, the country's military said, a day after its army launched ground operations into southern Lebanon targeting Hezbollah positions. Jack Guez/AFP via Getty Images New President of Mexico Claudia Sheinbaum applauds after her speech to the Congress as part of the presidential inauguration in Mexico City, Mexico, on Oct. 1, 2024. Manuel Velasquez/Getty Images A sign on the North Lawn of the White House wishes a “Happy Birthday” to former President Jimmy Carter as he turns 100 years old, in Washington on Oct. 1, 2024. Saul Loeb/AFP via Getty Images A coastguard's vehicle is parked next to a cordoned-off area at shore near Sizihwan in Kaohsiung, Taiwan, on Oct. 1, 2024. The super typhoon, Krathon, equivalent to a Category 4 Atlantic hurricane, is expected to hit the heavily-populated port city of Kaohsiung on Wednesday afternoon and then travel northwest across the island. Annabelle Chih/Getty Images Japan's newly elected Prime Minister Shigeru Ishiba (front center) poses for a group photograph with his cabinet members at the prime minister's official residence in Tokyo, Japan, on Oct. 1, 2024. Rodrigo Reyes Marin - Pool/Getty Images A man practices his slack lining as the sun sets in Tel Aviv, Israel, on Oct. 1, 2024. Leon Neal/Getty Images Rescue workers and firefighters surround a burnt-out bus that was carrying students and teachers on the outskirts of Bangkok, Thailand, on Oct. 1, 2024. A devastating fire tore through a Thai bus carrying 44 students and teachers on a school trip on Oct. 1, officials said, with up to 25 feared dead. Manan Vatsyayana/AFP via Getty Images A South Korean army Apache helicopter fires flares during a celebration to mark 76th South Korea Armed Forces Day ceremony in Seongnam, South Korea, on Oct. 1, 2024. Kim Hong-Ji - Pool/Getty Images Shamel Kelly (C) flanked by his attorneys Bernarda Villalona (L) and Harry Daniels (R) speaks during a news conference in New York's City Hall Park, on Oct. 1, 2024. Richard Drew/AP Photo Homes and vehicles that were damaged in a flash flood from Hurricane Helene lie on the side of a road near the Swannanoa River in Swannanoa, N.C., on Oct. 1, 2024. Mike Stewart/AP Photo Erica Dorsett, program director of the TaskForce Fore Ending Homelessness (L) speaks with a homeless man who goes by the name of CJ on the first day of a statute that took effect, making it illegal in Florida to sleep on sidewalks, in parks, on beaches, or in other public spaces—one of the country's strictest anti-homelessness laws, in Fort Lauderdale, Fla., on Oct. 1, 2024. Lynne Sladky/AP Photo Builders work on the dome roof of a new mosque near the town of Lipljan, Kosovo, on Oct. 1, 2024. Armend Nimani/AFP via Getty Images Voters line up to cast their ballots at a polling station during the third and final phase of voting for local assembly elections, in Bandipora, India, on Oct. 1, 2024. Tauseef Mustafa/AFP via Getty Images Workers stand next to the drifting Tara Polar Station before its launch, in Cherbourg, northwestern France, on Oct. 1, 2024. Lou Benoist/AFP via Getty Images Protesters carrying a large Nigerian flag run for safety after Nigerian policemen fire tear gas at demonstrators during the “Fearless In October” protest over bad governance in Abuja, Nigeria, on Oct. 1, 2024. Kola Sulaimon/AFP via Getty Images An Indian Air Force (IAF) personnel watches as the advanced light helicopters display team 'Sarang' performs during a rehearsal for the upcoming IAF Day celebrations, at the Marina beach in Chennai, India, on Oct. 1, 2024. R.Satish Babu/AFP via Getty Images Police personnel detain Tibetan protesters near the Chinese embassy during a demonstration in New Delhi, India, on Oct. 1, 2024. Sajjad Hussain/AFP via Getty Images A man stands in a landslide-affected village following heavy rains in Lalitpur district on the outskirts of Kathmandu, Nepal, on Oct. 1, 2024. Prakash Mathema/AFP via Getty Images Lagos State Security officers look on during an anti-government demonstration in Lagos, Nigeria, on Oct. 1, 2024. Olympia De Maismont/AFP via Getty Images A Ukrainian guard of honor stands near the graves of fallen Ukrainian soldiers at the Lychakiv cemetery on the national “Defenders Day” in Lviv on Oct. 1, 2024, amid the Russian invasion of Ukraine. Yuriy Dyachyshyn/AFP via Getty Images Outgoing NATO Secretary General Jens Stoltenberg (R) and incoming NATO Secretary General and former Dutch Prime Minister Mark Rutte (L) attend a handover ceremony, at NATO Headquarters in Brussels on Oct. 1, 2024. John Thys/AFP via Getty Images Pope Francis presides a penitential celebration at St Peter's Basilica in the Vatican on Oct. 1, 2024. Andreas Solaro/AFP via Getty Images WikiLeaks' founder Julian Assange is applauded after a parliamentary hearing at the Council of Europe in Strasbourg, France, on Oct. 1, 2024. Frederick Florin/AFP via Getty Images Afghan Kochi nomads with their donkeys walk along a street in Zhari district of Kandahar province, Afghanistan, on Oct. 1, 2024. Sanaullah Seiamsanaullah Seiam/AFP via Getty Images","summary":"A look into the world through the lens of photography.","url":"https://www.theepochtimes.com/article/day-in-photos-dockworkers-strike-centennial-moment-president-elects-5733209","image":"https://img.theepochtimes.com/assets/uploads/2024/10/01/id5733509-GettyImages-2175293229-OP-300x180.jpg","video":null,"publish_date":"2024-10-02 00:38:14","author":"Epoch Times Staff","authors":["Epoch Times Staff"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.289},{"id":258138400,"title":"Trump Backs Out of 60 Minutes Special, Harris Will Go On as Planned","text":"Ex-president Donald Trump has pulled out of the 60 Minutes primetime election special that’s been an American staple for over half a century, but VP Kamala Harris’ interview will air as planned on Monday, Oct. 7 at 8 p.m. ET/PT. 60 Minutes shared: A Programming Note: 60 Minutes is scheduled to air a primetime election special on a Monday edition of the broadcast on October 7 at 8 PM. For over half a century, 60 Minutes has invited the Democratic and Republican tickets to appear on our broadcast as Americans head to the polls. This year, both the Harris and Trump campaigns agreed to sit down with 60 Minutes. Vice President Harris will speak with correspondent Bill Whitaker. After initially accepting 60 Minutes’ request for an interview with Scott Pelley, former President Trump’s campaign has decided not to participate. Pelley will address this Monday evening. Our election special will broadcast the Harris interview on Monday as planned. Our original invitation to former President Donald Trump to be interviewed on 60 Minutes stands. Trump doesn’t like 60 Minutes after Lesley Stahl asked him reasonable questions in 2020, causing him to storm off. Trump is very used to getting to say things that directly contradict what he said in the previous sentence, and rarely is it clarified or even noticed as problematic. The legacy media has been criticizing Harris for not doing interviews with them, while Trump does not get equivalent critiques, which is odd for a man who pulled out of the third debate and has now fled 60 Minutes. An interview with Lesley Stahl and Scott Peley of 60 Minutes is too formidable for Trump. What does that say about Trump’s treatment by the legacy press? It suggests they aren’t formidable, or else he would not go there with information. The media will continue to talk about Vice President Kamala Harris‘ avoidance of interviews, while leaving out that what they mean is interviews *with them*. Apparently, they don’t trust local journalists or 60 Minutes or Dana Bash from CNN to do a good interview. Vice President Kamala Harris will be featured by “60 Minutes” on October 7, and Trump will be hiding somewhere.","summary":"Ex-president Donald Trump has pulled out of the 60 Minutes primetime election special that’s been an American staple for over half a century, but VP Kamala Harris’ interview will air as planned on Monday, Oct. 7 at 8 p.m. ET/PT. 60 Minutes shared: A Programming Note: 60 Minutes is scheduled to air a primetime election &#8230;\n\n\nThe post Trump Backs Out of 60 Minutes Special, Harris Will Go On as Planned appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/trump-backs-out-of-60-minutes-special-harris-will-go-on-as-planned/","image":"https://www.politicususa.com/wp-content/uploads/2024/07/Kamala-atlanta-trump-scaled.jpg","video":null,"publish_date":"2024-10-02 00:36:50","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.412},{"id":258138402,"title":"Tesla set to report Q3 deliveries ahead of robotaxi event","text":"Tesla is set to report third-quarter vehicle production and delivery numbers on Wednesday. Analysts are expecting Elon Musk‘s automaker to report about 463,310 deliveries, according to estimates compiled by FactSet StreetAccount. That would include about 435,900 of Tesla’s Model 3 sedans and Model Y SUVs. Tesla reported deliveries of 435,059 and production of 430,488 vehicles for the same period a year ago, before it was selling the Cybertruck. More recently, Tesla reported deliveries of 443,956 and production of 410,831 vehicles for the second quarter of 2024. If Tesla meets analysts’ expectations that would represent a 6.5% year-over-year increase for deliveries after declines in the first and second quarters of 2024. Deliveries are not defined in Tesla’s financial disclosures, but they are the closest approximation to units sold reported by the company. In the third quarter, as it did earlier this year, Tesla continued to offer a variety of incentives and financing plans to drive sales volumes, particularly in the largest market for EVs in the world, mainland China. Tesla hasn’t given specific guidance for the full year of deliveries in 2024, but the company has said it expects a lower delivery growth rate this year versus last. Wells Fargo, pointing to this lack of guidance, said in a note that it’s expecting 1.63 million full-year deliveries for Tesla and third-quarter deliveries at around 440,000, below consensus. Goldman Sachs last week said it expects Tesla deliveries and production “to come in-line with consensus, largely driven by the strength in the China market.” Goldman Sachs recommended buying call options ahead of the Wednesday report. Robotaxi day in focus Shares in the EV maker are up more than 20% over the past month, in anticipation that deliveries could improve year over year and sequentially in the third quarter, and ahead of the company’s robotaxi day on Oct. 10. Tesla plans to host investors and fans at its “We, Robot” marketing event at a Warner Bros. Discovery movie studio in Los Angeles. The automaker is expected to show off the design of a “dedicated robotaxi,” which Musk has referred to previously as the CyberCab. Tesla may also provide updates on its humanoid robotics project “Optimus” and other automotive and AI-driven products and services. Tesla EV sales and revenue fell in the first half of 2024, and the company still has yet to deliver a self-driving system that can function as a robotaxi without a human driver at the wheel ready to steer or brake at any time. Tesla also renamed its premium driver assistance option to Full Self-Driving Supervised, tacking on a disclaimer-style term at the end. Meanwhile, several rivals in the autonomous vehicle industry have begun producing robotaxis, and operating commercial robotaxi services. Rivals include Alphabet-owned Waymo in the U.S., and Pony.ai and Baidu in China. Amazon-owned Zoox is preparing a launch of a commercial robotaxi service in the U.S. as well. Tesla brand erosion Some customer interest in buying Tesla vehicles has been chilled by the brand’s strong association with Musk. The company’s favorability among both liberal and conservative consumers fell in July, according to CivicScience. Tesla favorability dropped with Democrats to 18% in July, down from 39% in January, and it declined among Republicans to 22%, down from 36% in January. Musk — who also leads SpaceX, X and xAI — has long shared provocative posts on social media, but in recent years, he’s become less filtered and more vociferous online about his right-wing political beliefs. In July, he publicly endorsed former President Donald Trump, and he frequently posts screeds on X concerning illegal immigration, election fraud, crime, violence and other flashpoint issues. He has shared political misinformation and deepfakes with his massive online following on X, according to reports by The Associated Press, CNN, NBC News, The New York Times and others. Before Musk acquired Twitter, now known as X, his feed focused more on Tesla and SpaceX, according to an analysis by The Washington Post. Among the posts Musk recently spread on X were false claims that Haitian immigrants in Springfield, Ohio, were eating people’s pets. The Springfield Police Division, Ohio Gov. Mike DeWine and other local groups have all said the claims were baseless. It remains to be seen whether left-leaning customers’ view of Musk will weigh on deliveries this year. Pew Research has found that Democrats have a much more favorable view of battery-electric vehicles and are more likely to buy them than Republicans in the U.S.","summary":"Tesla is set to report third-quarter vehicle production and delivery numbers on Wednesday.  Analysts are expecting Elon Musk&#8216;s automaker to report about 463,310 deliveries, according to estimates compiled by FactSet StreetAccount. That would include about 435,900 of Tesla&#8217;s Model 3 sedans and Model Y SUVs. Tesla reported deliveries of 435,059 and production of 430,488 vehicles &#8230;\n\n\nThe post Tesla set to report Q3 deliveries ahead of robotaxi event appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/tesla-set-to-report-q3-deliveries-ahead-of-robotaxi-event/","image":"https://image.cnbcfm.com/api/v1/image/108019066-17234624992024-08-12t094615z_332086202_rc276v8cznoi_rtrmadp_0_tesla-trump-musk.jpeg?v=1723462585&w=1920&h=1080","video":null,"publish_date":"2024-10-02 00:35:01","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.381},{"id":258138350,"title":"A man from Texas claims he broke a Taylor Swift-signed guitar he won at an auction for $4,000 as a prank.","text":"There were more splinters than teardrops left on a Taylor Swift-autographed guitar after a Texas man smashed it apart as “a joke” — after he paid thousands for it at auction, the man said Tuesday. Gary Estes, 67, says he paid $4,000 for the instrument at the Ellis County Wild Game Dinner in Waxahachie, an annual charity event that benefits agricultural-based education efforts for local youths. When he went to get the guitar, Estes took a hammer to it in a moment captured on video that has gone viral — but he insisted he has no will against Swift. “There was nothing malicious or anything about it,” Estes told NBC News on Tuesday. “It was just a joke at an auction that we had to raise money for kids, right? And that’s all it was. There was nothing mean about it, nothing bad about it. It was just a joke that they were making up on the stage, and we just followed through with a joke.” Auctioneer Craig Meier, a spokesperson for the event, said the guitar-smashing played well in the room.”It was a funny, light-hearted thing. I know maybe it seemed to be malicious, but everybody was laughing,” Meier said. “There were people there, at the time, who joked around that he’s mad because he doesn’t know how to play the guitar.” But after having talked to the man, Meier said it was an obvious political statement. “Taylor Swift, it became a political thing, and that was kind of the gist of it, just a light-hearted bit of a dig at Taylor for coming out politically and entertainers using their influence to influence politics,” Meier said. Swift endorsed Vice President Kamala Harris on Sept. 11, leading to bad blood with GOP nominee Donald Trump who sees her as an anti-hero. Trump carried Ellis County with 66.19% of the vote of the vote in 2020, while the winner, Joe Biden, and his VP pick, Harris, got 32.17%. Estes, who owns an electrical wiring business, said he’s a supporter of Trump and wasn’t pleased with Swift’s endorsement of Harris. “Yes, you can connect the dots there,” Estes said. The dinner and auction made about $250,000, Meier said. Auctioned items included weapons, big game hunting experiences, food and the “hot mama package” — a day of pampering at a day spa and a Smith & Wesson .380 that went for more than $4,000. Swift never owned or played the smashed guitar. Swift, like many other celebrities, regularly signs items that are distributed to charitable causes, said Meier, who procured the guitar in the summer. “At the end of the day, thank you, Taylor Swift,” Meier said. “Whether he hung your guitar on the wall or whether he hit it with a hammer, it really doesn’t make any difference. In the end of the day, the kids are the ones that are going to benefit from it. I don’t care if he set it on fire, put it in a shrine in his house, he paid $4,000 for it.” Representatives for Swift and the political group “Swifties for Kamala” — a grassroots organization not officially affiliated with her — could not immediately be reached for comment Tuesday. Swift is on a brief hiatus from her record-breaking Eras Tour, which is scheduled to end in December. The final show, as of now, is set for Dec. 8 at BC Place in Vancouver, British Columbia.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThere were more splinters than teardrops left on a Taylor Swift-autographed guitar&#8230;\n\n\nThis Post: A man from Texas claims he broke a Taylor Swift-signed guitar he won at an auction for $4,000 as a prank. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/a-man-from-texas-claims-he-broke-a-taylor-swift-signed-guitar-he-won-at-an-auction-for-4000-as-a-prank/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2023-07/230711-taylor-swift-al-1039-c64f78.jpg","video":null,"publish_date":"2024-10-02 00:31:28","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.018},{"id":258138506,"title":"Trump pulls out of ‘60 Minutes’ interview, four years after storming out of previous episode","text":"Donald Trump pulled out of an election season interview with CBS News’s 60 Minutes that was set to air Monday, with the Republican’s camp citing fact-checking provisions and a long-running dispute over the Hunter Biden laptop story as reasons why. 60 Minutes announced the cancellation over X/Twitter. “After initially accepting 60 Minutes’ request for an interview with Scott Pelley, former President Trump’s campaign has decided not to participate,” the show wrote in a statement. “Pelley will address this Monday evening.” The Trump campaign denied he was ever set to appear on the program, where Harris will also sit for an in-depth interview. “There were initial discussions, but nothing was ever scheduled or locked in,” Trump spokesman Steven Cheung wrote on X. “They also insisted on doing live fact checking, which is unprecedented.” The Trump campaign official also dismissed the program as a “relic of the past, unable to keep up with the times and changing media environment, instead turning into liberal, biased propaganda.” Trump, for his part, said he was skipping out on the 60 Minutes interview over the Hunter Biden laptop story, in which Republicans seized on damaging materials about Joe Biden’s son purportedly found on a laptop Hunter Biden supposedly left at a Delaware computer store. The FBI concluded the laptop in question belonged to Biden, who said the material linked to the computer may have been hacked or part of a Russian intel operation. Former intelligence officials claimed the information on the computer, which Trump lawyer Rudy Giuliani gave to the New York Post, was part of a Russia intelligence operation, though doubts have grown over whether this was the case in recent years. The revelations emerged in October 2020, weeks before the election, raising suspicions it was part of a politically-motivated “October surprize” designed to smear the Democrats. During a 2020 interview, which Trump later abruptly cut short, the Republican accused60 Minutes of refusing to cover the material purportedly found on the laptop, which contained damaging allegations about the Bidens. Anchor Leslie Stahl said the information found on the computer couldn’t be “verified” at the time. \"First I want to get an apology because last time I did an interview with them if you remember they challenged me on the computer,” Trump said during a press conference on Tuesday following news that he would not be doing the 60 Minutes interview next week. “They said the laptop from hell was from Russia. And I said it wasn’t from Russia, it was from Hutner, and I never got an apology.” “I’d love to do 60 minutes,” he added. “I do everything.” The former president was mocked for not appearing in the upcoming interview. “Afraid of the debate stage. Afraid of 60 minutes. And his campaign team - after the last three days of increasingly unhinged and unstable ranting at his rallies - is clearly afraid of exposing him beyond comfortable confines,” Harris senior adviser David Plouffe wrote on X. “We’ll surely hear more details about why Trump was too chicken to do the 60 Minutes debate, but he has been refusing any interview where he might bump into actual facts,” added reporter Marcy Wheeler. The Trump campaign has appeared to take issue with fact-checking in the past, including complaints about the moderators during the debate between Harris and Trump, and reports that the Republican inititally refused to sit for an interview with the National Association of Black Journalists convention over fact-checking.","summary":"Decision marks latest in fiery relationship with flagship news program","url":"https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-60-minutes-harris-b2622329.html","image":"https://static.independent.co.uk/2024/10/01/17/EEUU-ELECCIONES-TRUMP_86010.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/kyMBRuxo-4VHSaSK0.mp4","publish_date":"2024-10-02 00:29:31","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":-0.479},{"id":258138948,"title":"Vance has ‘proven to be smart pick’ as Trump’s running mate: Sarah Bedford","text":"While appearing on The Evening Edit, Bedford was asked how Vance might hold Harris’s running mate, Gov. Tim Walz (D-MN), accountable during Tuesday night’s debate. “I think Vance has done that really successfully so far,” Bedford said. “He’s been blanketing traditional media and nontraditional media alike, while Walz has been kept kind of in a bubble and running a really risk-free campaign just like Kamala Harris. “Vance has already successfully prosecuted that case for Donald Trump,” she continued. “I think he’s proven to be a smart pick by Trump for that reason. So, tonight I do think you can expect to see Vance really focus on the fact that he is running against incumbents who have failed.” Vance and Walz are set to face off in the vice presidential debate Tuesday night. It is expected to be the final debate for both the presidential and vice presidential candidates ahead of the Nov. 5 election. “I think it’s going to be an uphill battle for Tim Walz, frankly, because he is facing a tougher political landscape,” Bedford said. “The risk for him is that he reinforces this perception that he and Kamala Harris don’t stand for anything, that they don’t have any concrete beliefs, that they’ve shifted all of them for political expediency. And the fact that his personal biography has been riddled with misstatements really also reinforces that perception that they’re sort of a shape-shifting ticket on the Democratic side.” Bedford added that Vance’s risk is that he would come off as too aggressive when making his arguments throughout the debate. “Certainly, I think Walz has the toughest challenge,” Bedford said.","summary":"Washington Examiner investigations editor Sarah Bedford suggested that Sen. J.D. Vance (R-OH) has successfully argued across multiple media interviews that problems facing the nation and the world have happened on Vice President Kamala Harris’s watch, proving he was a “smart” vice presidential pick by former President Donald Trump. While appearing on The Evening Edit, Bedford [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3173484/vance-smart-pick-trump-running-mate-sarah-bedford/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/JD-Vance.-.webp","video":null,"publish_date":"2024-10-02 00:20:49","author":"Heather Hamilton","authors":["Heather Hamilton"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.17},{"id":258137610,"title":"“Guide to Watching the Vice-Presidential Debate Online: Where to Stream It?”","text":"A little over a month ahead of the 2024 presidential election, Vice Presidential candidates J.D. Vance and Tim Walz will have their own debate, and the rules will differ from the one that took place between Donald Trump and Kamala Harris on September 10. For the options of how to watch the matchup between the running mates, follow along below. When is the vice-presidential debate between Tim Walz and J.D. Vance? The vice-presidential debate will take place Tuesday, October 1 at 9 p.m. ET. Who is moderating the vice-presidential debate between J.D. Vance and Tim Walz? CBS Evening News anchor and managing editor Norah O’Donnell and Face the Nation moderator and chief foreign affairs correspondent Margaret Brennan will moderate the debate. Where can I watch the vice-presidential debate? Is it streaming? CBS News will host the broadcast of the debate. CBS News’ special coverage of the event will begin at 4 p.m. ET, with primetime coverage starting at 8 p.m. ET on CBS, CBS News 24/7 and Paramount+. In addition to airing on the CBS Television Network and CBS News 24/7, the debate will stream on Paramount+. RELATED: Kamala Harris Tells MSNBC “We Have To Raise Corporate Taxes,” Says Donald Trump “Not Very Serious” About Key Economic Issues Find other options to watch the vice-presidential debate below: ABC ABC News’ coverage of the debate will begin at 7 p.m. and last until 12 p.m. ET. Coverage will be available on ABC News Live, Disney+ and Hulu. ABC News will also simulcast the CBS News debate. BBC The BBC will air the simulcast of the CBS debate on the BBC News Channel and via livestream on BBC.com as well as on FAST/CTV in the U.S. C-SPAN C-SPAN will simulcast the Tuesday, October 1, 2024, CBS News Vice Presidential Debate between Sen. JD Vance and Gov. Tim Walz LIVE on C-SPAN, C-SPAN Radio, C-SPAN.org and on the C-SPAN NOW app. Coverage on C-SPAN Networks will begin at 8p.m. ET. Fox Fox’s programming will be available across Fox News Channel, Fox Business Network, Fox News Digital, Fox News Audio and Fox Nation. Coverage begins at 8 p.m. ET, and there will be coverage after the debate staring at 11 p.m. ET. Fox Business Network will simulcast the debate. MSNBC MSNBC’s coverage will begin at 7 p.m. ET, and MSNBC will air the debate hosted by CBS. Coverage following the debate will start at midnight ET and end at 2 a.m. ET. NBC News NBC News will air the debate live on NBC and NBC News Now. Pre-debate primetime coverage starts at 8 p.m. ET on NBC and NBC News Now. Special coverage will follow until 11 p.m. ET. NewsNation NewsNation will present special live coverage of the vice-presidential debate from 7 p.m.-midnight ET. The CBS debate will be simulcast from 9-10:30 p.m. ET. Spectrum News Spectrum News will simulcast the CBS debate, with coverage beginning at 8:45 p.m. ET. Coverage will air on Spectrum News’ networks and on Spectrum News+, available on the Spectrum News App on mobile, Xumo Stream Box, and Apple and Roku devices. What are the rules for the vice-presidential debate bewteen Tim Walz and J.D. Vance? Like with the presidential debate in September, there will be no audience for the vice-presidential debate. The debate will consist of 90 minutes to speak, with two four-minute breaks for each contestant. The only ones asking questions will be moderators O’Donnell and Brennan, who will be seated. Candidates will stand behind podiums with Gov. Walz on stage left/screen right and Sen. Vance on stage right/screen left. RELATED: CBS News’ JD Vance-Tim Walz Debate Will Feature Hot Mics Closing statements will take place within a two-minute time frame, and as of a coin toss September 26, Vance selected to go second with his closing statement. No props or pre-written notes will be allowed on stage, and no topics or questions will presented to candidates in advance. Each candidate will receive a pen, pad of paper and bottle of water, and campaign staff are not allowed to interact with either Walz or Vance during breaks. Candidates’ mics will not be muted, but CBS reserves the right to turn them off if needed. For each question the candidate gets asked, two minutes will be granted to answer, and the other candidate will get two minutes to respond. Then, each candidate gets one minute for further rebuttals. Candidates may get an additional minute each to continue a discussion at the discretion of the moderators.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA little over a month ahead of the 2024 presidential election, Vice&#8230;\n\n\nThis Post: &#8220;Guide to Watching the Vice-Presidential Debate Online: Where to Stream It?&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/guide-to-watching-the-vice-presidential-debate-online-where-to-stream-it/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-10-02 00:16:49","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.095},{"id":258137946,"title":"Dana Carvey discusses his surprise “Saturday Night Live” Joe Biden impression ","text":"Dana Carvey is spilling the beans on his Joe Biden impression. The Saturday Night Live alum, who returned to the show for the season 50 premiere on Saturday to play the president in a cold open, discussed his preparation for the part on his podcast Superfly. \"It's been top secret,\" Carvey said. \"I've kept it under wraps for weeks.\" Carvey said that the SNL producer Lorne Michaels asked him to play Biden after the Wayne's World star began cultivating an impression of the president on his other podcast Fly on the Wall. \"Like with George Bush senior, 'Not gonna do it,'\" Carvey said, recalling his impression of the 41st president from the '80s and early '90s. \"I tried to do that treatment to Biden,' and I did it on here with our YouTube clips,\" Carvey noted. Carvey's Biden took the stage in Studio 8H alongside Maya Rudolph's Kamala Harris, Jim Gaffigan's Tim Walz, Andy Samberg's Doug Emhoff, James Austin Johnson's Donald Trump, and Bowen Yang's J.D. Vance. The Master of Disguise star noted that he sought to fill a perceived void of Biden impressions. \"I didn't see it out there enough, a Biden impression,\" he said. \"A lot of brilliant Trumps, Shane [Gillis], James Austin Johnson. Biden is trickier.\" The current president has been played by a wide array of SNL cast members and guest stars, but the show has struggled to solidify one performer to play him consistently. Kevin Nealon first depicted then-Senator Biden in 1991, and Jason Sudeikis played him when he served as vice president during the Obama administration. Woody Harrelson, John Mulaney, and Sudeikis later played Biden throughout the Democratic primary prior to the 2020 presidential election, and Jim Carrey portrayed him once he secured the nomination. Cast members Mikey Day and Alex Moffat also portrayed Biden, and upon joining SNL in 2021, James Austin Johnson became the de facto Biden impersonator on the show. Casting Johnson as Biden presents a problem, however, when sketches also include Donald Trump, who he also regularly impersonates. Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more. Carvey said he wants to prioritize \"getting that high-energy part\" of Biden. \"That didn't come out til maybe 6 months into his first term where they asked him some question, he got kinda mad,\" he explained. \"'I can do whatever you want!' You know? That rhythm.\" Carvey also explained that he prioritizes comedy over political statements. \"The true north star is to try to make it funny and not really get it to be a political message, per se,\" he said. \"I didn't write it down or, you know, sharpen my pencil that he would say, 'I can't believe it's not butter!' with declarative intent,\" Carvey continued, referring to the unexpected conclusion of an incoherent stammering marathon that his Biden embarked on after attempting to say \"Build back better.\" The comedian said there were several phrases in the mix for the \"Build back better\" bit — including one from Carvey's podcast cohost David Spade. \"It was 'Pirates of the Caribbean,'\" he recalled. \"Then it was he would say, 'I can't believe it's not butter,' and then you gave me one, 'Bed, bath, and beyond!' which is a good one, too, because beyond is good with Biden,\" he told Spade. Carvey performed in SNL's cast from 1986 to 1993, and has returned to the show four times as a host (and even more times as a surprise guest). SNL will return Saturday, Oct. 2 with host stand-up comedian Nate Bargatze and musical guest Coldplay.","summary":"&#34;I&#39;ve kept it under wraps for weeks.&#34;","url":"https://ew.com/dana-carvey-discusses-his-surprise-snl-joe-biden-impression-8721678","image":"https://ew.com/thmb/AQyoqgjrHHPZzQpQIBT-1pRcfTc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/MayaRudolphandDanaCarveyonSNLseason50premiere-60453b0e06424d159c6cef37e159cd70.jpg","video":"https://content.jwplatform.com/videos/m5Id2QAJ-GQ0UtFMY.mp4","publish_date":"2024-10-02 00:16:32","author":"Wesley Stenzel","authors":["Wesley Stenzel"],"language":"en","source_country":"US","sentiment":0.377},{"id":258138060,"title":"Trump boosts bid after Helene","text":"Donald Trump is using the destruction of Hurricane Helene to boost his presidential bid against Kamala Harris, political analysts said on Tuesday, after the Republican candidate spread falsehoods about the federal response during a visit to a storm-hit city. Trump is leveraging the potential political danger of the hurricane to the presidential campaign of Democrat Harris, his 2024 White House rival, the analysts said. Trump visited the city of Valdosta in the battleground state of Georgia on Monday and falsely stated that Democratic President Joe Biden had been unresponsive to the hurricane’s destruction. Harris is also Biden’s vice president. Trump said he brought “truckloads of things” to Georgia, including oil, water and equipment, and that he partnered with evangelical Christian leader Franklin Graham’s relief organization to deliver them. Natural disasters have damaged U.S. administrations in the past and Trump is trying to tie Harris to this hurricane, which tore through the U.S. Southeast including the battleground states of Georgia and North Carolina, said Andrew Reeves, a professor at Washington University in St. Louis who has studied how natural disasters affect U.S. politics. Georgia and North Carolina will play a key role in the outcome of the Nov. 5 election between Trump and Harris. North Carolina’s hardest-hit area, Buncombe County, voted for Biden in 2020, while most of the other counties in the western part of the state went to Trump. Georgia’s Lowndes County, where Valdosta is located, voted for Trump in 2020. But even a few thousand votes in each state could decide which presidential candidate wins those states and potentially determine the outcome of the White House race. More than 3,500 federal workers are involved with response efforts in affected states, according to the White House. Analysts said it was abnormal for a presidential candidate who is not in office to visit a disaster area. Natural disasters, especially hurricanes, have shaped U.S. politics in recent years and could alter the course of the race this year as well, said Stuart Rothenberg, a nonpartisan political analyst. It is not the first time Trump has sought to use a disaster for political gain. While visiting the site of a toxic train derailment in Ohio in 2023, Trump criticized the Biden administration’s response as a “betrayal.” Presidents and presidential candidates usually do not visit a storm-hit region immediately because of fears they will distract from rescue efforts and drain resources from local law enforcement officials and emergency responders. Biden said he would visit North Carolina on Wednesday and Georgia and Florida soon after. He may also ask Congress to return to Washington for a special session to pass supplemental aid funding. Harris has also said she intends to visit the area soon. Leavitt declined to say how the funds will be spent. In 2019 a New York state judge ordered Trump to pay $2 million for misusing his namesake charitable foundation, resulting in funds being used to advance his 2016 presidential campaign. Trump defended the charity at the time, saying the foundation was an “incredibly effective philanthropy” that had made “some small technical violations.” The Harris campaign did not immediately respond to a request for comment on Tuesday. In Georgia, Trump falsely claimed that Brian Kemp, Georgia’s Republican governor, “was having a hard time” getting Biden on the phone. Kemp told reporters that Biden had called him the evening before and said he was grateful for the federal assistance Biden had offered. Biden said Trump had been lying. Reeves’ research has found that sitting presidents received a modest bump of half a percentage point when they approved disaster aid close to their reelection. During Trump’s 2017 visit to San Juan, Puerto Rico, after Hurricane Maria, the then-president threw rolls of paper towels into a crowd of local residents impacted by the storm. The move drew criticism from some local officials. While campaigning for reelection in 2012, President Barack Obama joined Republican Governor Chris Christie to tour parts of New Jersey that were affected by superstorm Sandy. Christie was at the time a top defender of Obama’s Republican rival, Mitt Romney. Republican President George W. Bush’s approval ratings fell after Hurricane Katrina devastated New Orleans in 2005 and never recovered.","summary":"Donald Trump is using the destruction of Hurricane Helene to boost his presidential bid against Kamala Harris, political analysts said on Tuesday, after the Republican candidate spread falsehoods about the federal response during a visit to a storm-hit city. Trump is leveraging the potential political danger of the hurricane to the presidential campaign of Democrat [&#8230;]","url":"https://www.fbcnews.com.fj/world/trump-boosts-bid-after-helene/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2024/10/WORLD-8.jpg","video":null,"publish_date":"2024-10-02 00:15:18","author":"Kamna Kumar,Reuters]","authors":["Kamna Kumar","Reuters]"],"language":"en","source_country":"fj","sentiment":0.119},{"id":258138132,"title":"Indian American business owners support Trump, feels Republican fund-raiser Jiten Agarwal","text":"Jiten Agarwal, a prominent Indian American business and community leader and CEO of QuantAi, a global data and AI company, is one of the hosts of a high-profile reception for Republican Presidential nominee and former President Donald Trump, later this week in Houston, Texas. Not surprisingly, the reception has a fund-raising component to it, with the US Presidential election, which remains too close to call between Democratic candidate and US Vice-President Kamala Harris and Trump, coming up next month. “The event is expected to raise over $5 million. There is a lot of support and contributions, for the event, from Americans; with only a few big Indian American donors including Swapnil Agarwal, CEO & managing partner Nitya Capital, Houston,” Agarwal, who had earlier hosted a fund-raiser for Republican vice-presidential nominee J.D. Vance, told the Times of India.“There is a lot of support for Republican Party within the Indian American community, especially among business owners and CEOs, of both small and large businesses. The establishment dislikes Trump and Trump voters dislike the establishment. Hence ‘support for Trump’ is tough ball game. Like mainstream American community, there are some conservatives within the Indian American community who are Trump’s staunch supporters, while other traditional conservatives do not like him at all. However, all agree that the Republicans are needed to win and govern the country now,” Agarwal said about his support for the Republican Presidential nominee.He feels that the upcoming US Presidential election is not about choosing the most likable person but about choosing between two vastly different ideologies and policy framework including US foreign policy in the current decade of conflicts. “Trump, during his past presidential tenure between 2016 and 2020, has proven that his administration can deliver on immigration, foreign policy, world peace, law and order, and domestic economy in an effective manner. There was no major conflict during the Trump administration, and America was on a path to prosperity until the pandemic hit in 2020,” Agarwal said. He added that the current situation, under the Biden/Harris administration, since 2020 in USA has been marked by chaos during withdrawal of troops from Afghanistan, handling of Russia-Ukraine war, Israel-Hamas conflict, high inflation, huge influx of illegal immigrants in US and bumps in US-India relations. “A weak foreign policy has emboldened America’s foes. Switching Biden for another progressive candidate, Kamala Harris, is not going to solve the problem. I always support capitalism and have almost no appreciation for the policies of liberals leaning towards the extreme Left, especially profligate spending that has produced the highest inflation in 40 years. Given the choice of the two Presidential candidates this year, we need to think about the country we want to leave to our next generations, before voting,” he said.Having worked closely with the campaign of Indian American Republican Presidential candidate and former South Carolina Governor Nikki Haley, before she dropped out of the race, Agarwal feels that her campaign did not resonate among the Indian community in the US. “I do not think that Haley dropping out has had any impact. It was not easy to gather support for her from the Indian American community as many did not consider her a visionary leader and a strong contender against Trump. She offered a good conservative alternative in my opinion, but there was nothing new she had to offer. People perceived her as an establishment candidate and perception plays an important role in politics. If she had been picked by Trump as a VP candidate, a much wider support for the Trump ticket, from the Indian American community, was likely,” he said.Though Agarwal has hosted an event in support of the Republican vice-presidential candidate, he has not interacted with Vance’s Indian American wife Usha Chilukuri Vance and feels that she is not actively involved in her husband’s campaign. “Vance spoke very highly about her during my personal interaction with him. He owes his success to his wife and appreciates the values Usha [Vance] represents having grown up in a Hindu household. J.D. Vance is highly impressed by Hinduism. He had a separate Hindu ceremony officiated by a Hindu priest, honouring his wife’s cultural heritage at his wedding. He talked about the shared principles that guide their family life despite their diverse religious backgrounds,” Agarwal said.","summary":"Jiten Agarwal, CEO of QuantAi, is hosting a significant reception for Donald Trump in Houston, aiming to raise over $5 million. He emphasized the polarized support for Trump within the Indian American community and critiqued the current administration's policies on foreign affairs and domestic issues.","url":"https://timesofindia.indiatimes.com/world/us/indian-american-business-owners-support-trump-feels-republican-fund-raiser-jiten-agarwal/articleshow/113865710.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-113865709/113865709.jpg","video":null,"publish_date":"2024-10-02 00:14:35","author":"Ishani Duttagupta","authors":["Ishani Duttagupta"],"language":"en","catgory":"politics","source_country":"in","sentiment":0.056},{"id":258138758,"title":"‘Jeopardy’ Champ Throws Final Clue Again, Dedicates Answer to His Wife","text":"[Warning: The below contains MAJOR spoilers for the October 1 episode of Jeopardy!] Jeopardy! champ Ryan Manton was either stumped by the final clue or intentionally didn’t answer it for the second game in a row in the Tuesday, October 1 episode. The returning champ found himself primed to win his second consecutive runaway game in a row, so his final answer didn’t really matter. Like in his first game, Manton dedicated his last answer to his wife, who was a contestant on the game show in Season 37. Manton is a systems administrator from Columbus, Ohio. He’s one-day champ with $22,178 winnings thanks to his runaway game on September 30. He was competing against Mike McComb, a project manager originally from Dearborn, Michigan; and Brooke Levine, a workforce manager from Old Bridge, New Jersey in the episode. Manton won all three Daily Doubles in his first game but didn’t have the same luck in his second. McComb found the first two Daily Doubles in the October 1 episode, but he answered both incorrectly, making it impossible for him to catch up to Manton’s high score later on in the match. Manton found the third Daily Double and answered correctly. By the time Final Jeopardy came around, Manton was already set for his second consecutive runaway victory so long as he didn’t bet too much money in the final round. (A runaway game is when the lead player’s score is more than double the score of the player in second place.) The category was “Sitcoms,” and the clue was, “The first British sitcom to win a Best Comedy Golden Globe, it was remade in a U.S. version that had almost 15 times as many episodes.” The answer was, “What is The Office?” McComb and Levine’s correct responses and bets weren’t enough to catch up with Manton, who dedicated his answer to his wife when writing, “I still love you, Lauren.” His Final Jeopardy answer during his first game was, “I love you, Lauren.” Manton only wagered $22. The final scores were Manton with $21,600, McComb with $10,000, and Levine with $1,200. Manton revealed his wife’s connection to Jeopardy! during his interview in the September 30 game. “My now wife, Lauren —my girlfriend at the time — was on Jeopardy! about three years ago,” he told Ken Jennings. “She was on your last guest hosting episode.” Lauren Menke competed in the February 19, 2021 episode back in Season 37. She finished in third place. Time will tell if her husband can pull off a third runaway game in a row on October 2. Jeopardy!, Weekdays, Check Your Local Listings More Headlines: ‘Jeopardy’ Champ Throws Final Clue Again, Dedicates Answer to His Wife‘Love Is Blind’ Season 7 Cast Talks Relationship Dealbreakers, Regrets & More (VIDEO)Donald Trump Backs Out of ’60 Minutes’ Interview at Last Minute‘Abbott Elementary’ Season 4: ABC Unveils Episode Titles Ahead of PremiereFrank Fritz: ‘American Pickers’ Stars Pay Tribute to Friend","summary":"Contestant shouted out his wife — a former 'Jeopardy!' player herself — in his final answer for the second night in a row.","url":"https://www.guampdn.com/lifestyle/entertainment/jeopardy-champ-throws-final-clue-again-dedicates-answer-to-his-wife/article_1bcf83bb-da22-54f4-a4cc-4d8d5bef907d.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/custom/image/d1d0565a-bcb2-11eb-8535-ab06d41ce483.jpg?resize=600%2C315","video":null,"publish_date":"2024-10-02 00:07:42","author":"Kelli Boyle,TV Insider","authors":["Kelli Boyle","TV Insider"],"language":"en","source_country":"GU","sentiment":0.045},{"id":258138318,"title":"JD Vance, Tim Walz square off in first, and likely last, vice presidential debate","text":"Republican Ohio Sen. JD Vance and Democratic Minnesota Gov. Tim Walz put their Middle America appeal to the test Tuesday night in what’s likely the final debate of the 2024 presidential election cycle. With barely a month to go until the Nov. 5 election, the candidates are out to show they’re fit to be a heartbeat away from the presidency — and to boost their respective running mates at the top of the ticket, GOP former President Donald Trump and Democratic Vice President Kamala Harris. The debate, which begins airing at 8 p.m. on CBS, comes hours after Iran launched missile attacks on Israel as tensions rise across the Middle East. That crisis is sure to provide debate fodder along with the vice presidential candidates’ respective military records. Vance, the best-selling author of “Hillbilly Elegy,” served in the U.S. Marine Corps, while Walz, a former high school teacher and football coach, served in the Army National Guard. Vance has attacked Walz over a 2018 campaign video in which the Minnesota governor referenced “weapons of war that I carried into war.” Neither man saw combat. CBS moderators Norah O’Donnell and Margaret Brennan are also likely to quiz the candidates on the war in Ukraine, a U.S. economy still reeling from inflation and the immigration crisis at the southern border — as well as Vance’s insistent false claims that Haitian immigrants have eaten pets in Springfield, Ohio. Most political prognosticators say vice presidential debates rarely impact election outcomes, but that could change in a year where most polls have put Trump and Harris in a statistical dead heat. Harris and Trump debated last month and haven’t agreed on a second on-stage matchup. Vance and Walz aren’t scheduled to square off again before the election either. Follow along here with the Sun-Times for updates throughout the debate.","url":"https://chicago.suntimes.com/elections/2024/10/01/vice-president-debate-walz-vance-november-presidential-election","image":"https://cst.brightspotcdn.com/dims4/default/b900f55/2147483647/strip/true/crop/10000x5708+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1c%2Fd0%2F086f1bb743bfa17f85b28fc85830%2F21747","video":null,"publish_date":"2024-10-02 00:06:40","author":"Mitchell Armentrout","authors":["Mitchell Armentrout"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.246},{"id":258138134,"title":"'Destabilizing, dangerous force in Middle East': What Kamala Harris said about Iran after missile attack on Israel","text":"Democratic presidential candidate and US Vice President Kamala Harris labeled Iran as a \"dangerous\" and \"destabilizing\" force in the Middle East on Tuesday while highlighting Washington's unwavering commitment to Israel’s security. Her remarks come just weeks before the US presidential election, where she faces off against Republican former President Donald Trump on November 5.The statement followed a dramatic escalation in the region, with Iran launching ballistic missiles at Israel in retaliation for Israel’s intensified military operations in Lebanon. The Israeli government and US officials pledged a strong response, though no injuries were reported from the attack, which Washington termed \"ineffective.\"\"I'm clear-eyed that Iran is a destabilizing, dangerous force in the Middle East,\" Harris said during a press briefing. \"I will always ensure that Israel has the ability to defend itself against Iran and Iran-backed terrorist militias.\"Harris voiced her full support for President Joe Biden’s directive authorizing the US military to assist in countering the missile threat. \"Initial indications are that Israel, with our assistance, was able to defeat this attack,\" she added, reiterating Washington’s resolve to safeguard its allies in the region.Iran's missile barrage, totaling at least 180 projectiles, marks the latest development in the decades-long confrontation between Israel and Iran. The hostility has steadily worsened, threatening to drag the entire Middle East into broader conflict. Alongside its operations in Gaza, Israel has escalated its military efforts in Lebanon, targeting Hezbollah militants backed by Tehran. The campaign has killed hundreds and displaced more than a million people, according to local reports.This regional tension was sparked by a devastating October 7 attack carried out by Palestinian Hamas militants in Gaza, which led to Israel’s ongoing military offensive. The war in Gaza has resulted in tens of thousands of deaths, with widespread displacement and severe humanitarian crises unfolding across the territory. Israel has faced growing international scrutiny, including allegations of genocide, which it vehemently denies.","summary":"Kamala Harris underscores Iran as a destabilizing Middle East force while vowing unyielding support for Israel's security. Her statements follow Iran’s ballistic missile attack on Israel, a response to Israel’s military actions in Lebanon. Tensions rise as international scrutiny grows over Israel’s actions in Gaza.","url":"https://timesofindia.indiatimes.com/world/us/destabilizing-dangerous-force-in-middle-east-what-kamala-harris-said-on-iran-after-missile-attack-on-israel/articleshow/113865672.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-113865673/113865673.jpg","video":null,"publish_date":"2024-10-02 00:05:21","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","catgory":"politics","source_country":"in","sentiment":-0.131},{"id":258137618,"title":"Trump backs out of a '60 Minutes' prime-time interview, CBS says","text":"This story first appeared in the NPR Network's live blog of the 2024 vice presidential debate between JD Vance and Tim Walz. For the latest on the campaign, head to NPR's Elections page. The CBS news program 60 Minutes announced on Tuesday that former President Donald Trump has backed out of an interview he had agreed to do as part of its prime-time election special next week. \"For over half a century, 60 Minutes has invited the Democratic and Republican tickets to appear on our broadcast as Americans head to the polls,\" the newsmagazine posted on X. \"This year, both the Harris and Trump campaigns agreed to sit down with 60 Minutes.\" It went on to say that \"after initially accepting 60 Minutes' request for an interview\" with Scott Pelley, Trump's campaign \"has decided not to participate.\" The election special will air Monday at 8 p.m. ET as planned, and include Vice President Harris' interview with correspondent Bill Whitaker. \"Our original invitation to former President Donald Trump to be interviewed on 60 Minutes stands,\" the statement added. Trump campaign spokesperson Steven Cheung responded shortly after on X, calling the program's version of events \"fake news.\" He said the show \"begged for an interview,\" and despite initial discussions, \"nothing was ever scheduled or locked in.\" \"They also insisted on doing live fact checking, which is unprecedented,\" Cheung added. Trump has run into trouble with 60 Minutes before, notably cutting short a 2020 interview with correspondent Lesley Stahl — and backing out of a second that had been previously scheduled — after becoming visibly frustrated with her \"tough\" line of questioning about the COVID-19 pandemic and other topics. The Harris campaign was quick to criticize Trump on Tuesday night. Senior adviser David Plouffe posted on X that the former president is \"afraid\" of the debate stage and of 60 Minutes. \"And his campaign team — after the last three days of increasingly unhinged and unstable ranting at his rallies — is clearly afraid of exposing him beyond comfortable confines,\" he wrote. He appeared to be referencing Trump's increasingly threatening and insulting rhetoric at rallies over the weekend, in which he described Harris as \"mentally impaired\" and said police should be allowed to be \"real rough\" on criminals for one hour to send a message. The prime-time special would have been one of voters' final chances to see Trump and Harris side-by-side before Election Day. While the Harris campaign has called for a second debate, Trump's team has not agreed to one. Tuesday night's debate between vice presidential candidates Tim Walz and JD Vance is the last one on the schedule.","summary":"60 Minutes announced on Tuesday that former President Donald Trump has backed out of an interview he had agreed to do as part of its prime-time election special next week.","url":"https://www.npr.org/2024/10/01/nx-s1-5135681/trump-60-minutes-jd-vance-tim-walz-debate-2024","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1600+0+0/resize/2400x1600!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F37%2Fb2%2Fbb192f184ef4bfa6940a5a28f4e3%2Fgettyimages-2175336276.jpg","video":null,"publish_date":"2024-10-02 00:04:56","author":"Rachel Treisman","authors":["Rachel Treisman"],"language":"en","source_country":"US","sentiment":-0.467},{"id":258137202,"title":"Donald Trump Regaining Strength in Swing State: Polls","text":"Former President Donald Trump has created some distance in his lead over Vice President Kamala Harris in Arizona, according to a survey released Tuesday.The latest poll from Emerson College Polling and RealClearWorld found that Trump leads in Arizona by 2.8 percentage points (50 percent to 47.2 percent), according to the responses of 920 likely voters on September 27 and September 28.The results are a good sign for Trump, who in mid-September polled much closer to Harris, leading 49 percent to 48 percent. That survey by Emerson College Polling was conducted in the days following Trump and Harris' first presidential debate on September 10, during which the vice president saw a boost in polling nationwide.Two other surveys conducted in late September also found the former president ahead in Arizona by a slim majority. In one by InsiderAdvantage, which was conducted on September 29 and September 30, Trump was up 49 percent to 48 percent. In another poll by AtlasIntel, performed from September 20 to September 25, the former president led Harris 50 percent to 49 percent.Trump had once enjoyed a much clearer lead in Arizona shortly after Harris entered the 2024 race in late July. According to polling from Emerson College/The Hill, in a survey on July 22 and July 23, the former president was up 49 percent to 44 percent. According to tracking from FiveThirtyEight, on August 1, Trump was leading Harris by 2.3 percentage points on average.The overall race for Arizona and its 11 electoral votes, however, remains tight. Per tracking from FiveThirtyEight, Trump is leading in the Grand Canyon State by 1.5 percentage points on average across statewide polls.But even the small lead is an improvement for Trump in recent weeks. On September 18, FiveThirtyEight found the candidates tied at 47.1 percent across state polling. On September 1, Harris was up by 0.1 points on average.FiveThirtyEight's election forecast puts Arizona in the \"toss-up\" category along with a handful of other key swing states: Georgia, Nevada, North Carolina, Pennsylvania and Wisconsin.Harris is favored to win Michigan, the seventh battleground contest on high watch, although FiveThirtyEight puts the state in the \"lean Democrat\" category, meaning the state of play could change in the final weeks of campaigning.Tracking from RealClearPolling (RCP) also gives Trump a lead in Arizona, finding the former president up 2.1 percentage points on average as of Tuesday. In comparison, per RCP's tracking, President Joe Biden was ahead by 3 percentage points on average October 1, 2020. Biden went on to win Arizona that election year by less than 11,000 votes.RCP also considers Arizona's race a \"toss-up,\" along with the other six swing states and Minnesota.Newsweek reached out to Trump and Harris' campaigns for comment on the Arizona race via email on Tuesday.","summary":"Trump has created some more distance in his lead against Vice President Kamala Harris in Arizona, although the state's race remains tight.","url":"https://www.newsweek.com/donald-trump-regaining-strength-swing-state-polls-1962347","image":"https://d.newsweek.com/en/full/2485141/donald-trump-regaining-strength-arizona.jpg","video":null,"publish_date":"2024-10-02 00:03:02","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.24},{"id":258137692,"title":"J.D. Vance and Tim Walz debate gears up as VP picks set to make cases for 2024 US election","text":"This live blog has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. Get faster notifications on the latest updates by downloading our app. US senator J.D. Vance of Ohio and Minnesota Governor Tim Walz – the running mates of former US president Donald Trump, the Republicans’ nominee, and US Vice-President Kamala Harris, the Democratic Party’s presidential nominee – will take the stage for a debate that could help produce a clear front-runner in what has proved a tight race, with election day little more than a month away. While Harris now leads Trump in The New York Times’s average of national polls, the race remains too close to call in the seven key battleground states of Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin. With US-China friction, American economic issues and escalating violence in the Middle East all likely to factor into the debate, it promises to be a compelling event – and you can follow the action right here. More from our coverage of the election - Vance vs Walz: US VP debate pits hillbilly energy against ‘Minnesota nice’ - Nato’s new chief plays down fears of a potential Trump election victory - US dockworkers strike, threatening economic disruption before presidential election - Harris vs. Trump: Asia counts the cost of climate in US presidential polls - Trump’s planned China tariff ‘damage’ could last through 2040 Reporting by Mark Magnier in New York and Igor Patrick and Khushboo Razdan in Washington","summary":"Hot-button domestic issues and Minnesota governor’s China experience likely to feature in lone scheduled debate between the running mates.","url":"https://www.scmp.com/news/china/diplomacy/article/3280735/jd-vance-and-tim-walz-debate-gears-vp-picks-set-make-cases-2024-us-election","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/10/02/2d19e301-f010-47ac-9cab-cbf4eafb19e7_376ac4d4.jpg","video":null,"publish_date":"2024-10-02 00:00:10","author":"Scmp Reporters","authors":["Scmp Reporters"],"language":"en","catgory":"politics","source_country":"cn","sentiment":0.106},{"id":258138946,"title":"WATCH LIVE: Vance and Walz face off in CBS vice presidential debate","text":"The debate, hosted by CBS News, will begin at 9 p.m. ET from the CBS Broadcast Center in New York and last until 10:30 p.m. It will be moderated by CBS anchors Norah O’Donnell and Margaret Brennan. There will be some significant differences in the rules that governed previous presidential debates this year for former President Donald Trump, Vice President Kamala Harris, and President Joe Biden. The network has said it will not fact-check the candidates and that there will be no muted microphones. However, CBS will fact-check the two men virtually. Similar to the September and June presidential debates, there will be no live audience.","summary":"Sen. J.D. Vance (R-OH) and Gov. Tim Walz (D-MN) are facing off for the sole vice presidential debate of the 2024 election cycle. The debate, hosted by CBS News, will begin at 9 p.m. ET from the CBS Broadcast Center in New York and last until 10:30 p.m. It will be moderated by CBS anchors [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3172717/watch-live-vance-walz-vice-presidential-debate/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Walz_Vance_1_2024.webp","video":null,"publish_date":"2024-10-02 00:00:00","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.097},{"id":258136914,"title":"He Was the Last Person to Debate JD Vance. Here's His Advice for Tim Walz.","text":"Former Ohio congressman Tim Ryan, who was JD Vance's last opponent in the closely watched 2022 Senate race, offered some advice to Tim Walz as he prepares to face Donald Trump's running mate in the vice presidential debate Tuesday.Speaking on Slate's \"What Next\" podcast, Ryan, a Democrat who lost the 2022 Ohio Senate race to Vance by six points, stressed that preparation and composure will be key for the Minnesota governor, given that Vance is known as a combative and skilled debater.Reflecting on his own experience, Ryan had a clear warning for Walz: underestimate your opponent at your own risk.\"JD Vance is the kind of person who will say whatever he needs to say to advance himself, with very little regard to the truth,\" Ryan said. Describing Vance's style as aggressive and tactical, Ryan emphasized that Walz must stay on message and not allow Vance to control the debate.\"You have to stay on point,\" Ryan added, advising Walz to focus on the issues important to voters and avoid being thrown off track by Vance's aggressive style. \"If you keep your cool and counterpunch hard, but in a way that's decent, I think most people will listen.\"Ryan also emphasized that Walz must be ready for Vance's ability to shift criticisms and steer the conversation to issues he prefers — a classic tactic of skilled debaters. He recounted a moment during the 2022 debate on abortion when Ryan and the moderators brought up the case of a 10-year-old Ohio girl who had to travel out of state for an abortion after being raped.Vance quickly shifted the discussion to immigration.\"The thing no one talks about with this abortion story is that the girl was raped by an illegal immigrant,\" Vance said, pointing out that the perpetrator of the rape was a Guatemalan man who entered the U.S. illegally.Reflecting on this tactic, Ryan said: \"It's frustrating to watch somebody do that, but it's also skillful. He's very good at getting back onto ground he's comfortable with.\" Ryan added that this was a recurring pattern in their debates. \"You have to bring it back,\" Ryan explained, emphasizing that it takes discipline and concentration not to get caught in Vance's pivots.\"He's much more skillful and disciplined than Trump in that regard.\"Yet, like Trump, Ryan said Vance is prone to overreact if you hit a nerve. For Ryan, that moment was the disjunction between Vance's apparent endorsement of the \"replacement theory,\" that immigrants threaten to replace white Americans, and the fact that his wife, Usha Vance, comes from a family of Indian immigrants.Still, Ryan said Vance is good at emotional appeals, recalling how he brought up his biracial children and immigrant in-laws during their debates as a way to avoid difficult questions on race.\"He knew throwing up that emotional family thing was gonna allow him to wiggle out of what he had said,\" according to Ryan. \"It's skillful, because it doesn't have anything to do with answering the question or telling the truth. It's about getting out of the hot spotlight.\"Despite Vance's history as an aggressive and tactical debater, Ryan believes that Walz, with the right approach, can come out on top.\"I think Tim Walz is a good contrast to JD Vance. There's an authenticity, a realness, and a likability there,\" Ryan said, noting that Walz's approachable, folksy demeanor could serve him well Tuesday night.He urged the governor to remain calm and avoid being drawn into the heated exchanges Vance is known for provoking.\"Walz needs to approach this in a very human way,\" Ryan said, particularly on sensitive issues like immigration—one of Vance's favorite topics, which roared back into the national spotlight after he and Trump falsely claimed that Haitian immigrants were eating pets in Springfield, Ohio.\"He's much more skilled than people give him credit for, and you have to be prepared for that,\" Ryan said of Vance. \"But with the right preparation, Walz can definitely turn this to his advantage.\"","summary":"Tim Ryan, who lost the 2022 Ohio Senate race to Vance, said Vance is to not to be underestimated on the debate stage.","url":"https://www.newsweek.com/tim-walz-jd-vance-tim-ryan-debate-1962352","image":"https://d.newsweek.com/en/full/2485142/jd-vance-debate.jpg","video":null,"publish_date":"2024-10-01 23:57:31","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","source_country":"US","sentiment":-0.151},{"id":258136742,"title":"Speaker Johnson outlines plan for Republicans as they strive to maintain control of the House.","text":"WASHINGTON – Speaker Mike Johnson laid out on Tuesday a policy agenda should Republicans take the majority next year that extends the tax cuts approved when Donald Trump was president, reduces the size of the federal workforce and gives parents more choice on where they can send their children to school. Johnson emphasized five main policy points during a speech at the New York Stock Exchange. He talked of extending and building on the Trump tax cuts, confronting China, boosting oil and gas production, expanding school choice and cutting the size and scope of the federal government. “The survival of the American dream depends upon our victory,” Johnson said. The speaker and House Republicans are fighting this election season to hold their narrow House majority, with just a handful of seats to spare. Republicans are hopeful that a Trump victory over Vice President Kamala Harris in the election will help propel them to majorities in the House and Senate, which would give them unified control of Washington for the first time since 2018 and the ability to enact a sweeping legislative agenda. Against the campaign backdrop, Johnson provided a bleak view of the economy under President Joe Biden, though the economy continues to grow at a solid pace, inflation is on the decline and the unemployment rate is still low by historical standards. He spoke to an audience of Wall Street investors, traders and others who have witnessed stock markets reach record highs in recent days. But Johnson said that as he has traveled the country, he’s meeting business owners on the verge of collapse because of high inflation, high taxes and over-regulation. And he said he’s met moms and dads who have resorted to donating plasma and setting up crowdfunding pages so that they didn’t lose their homes. “Our incredible people are hanging on right now in spite of so many unprecedented challenges, but many can’t afford to do it much longer,” Johnson said. The first policy priority he outlined was enhanced tax breaks, citing specifically immediate expensing for research and development costs. He also cited the need for a “strong” child tax credit, though he did not provide specific numbers. He said the Republican tax policies would “respect the dignity of work, and it doesn’t pay people more for staying out of the workforce.” Trump has laid out a series of tax cuts on the campaign trail, such as extending the expiring provisions of his 2017 overhaul, and not taxing tips and Social Security. Outside experts say the tax cuts proposed by Trump and Democratic nominee Kamala Harris would cause the debt to rise even faster the pace under current law. Doing more to confront China and rolling back environmental regulations are a common denominator for Republicans that Johnson embraced in his speech. On education, he said millions of Americans have the opportunity to send their children to a school that best fits their need, and “Republicans want to expand that choice so that every American has that opportunity.” Johnson also emphasized cutting the debt by cutting the size of the federal government, saying “we’re going to reduce the size of the federal workforce and root out a long list of non-essential jobs through the federal bureaucracy.” “It’s hard to roll back the entrenched bureaucracy and face the system that has produced the decline. It’s a difficult task, but it’s a task that can be achieved,” Johnson said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – Speaker Mike Johnson laid out on Tuesday a policy agenda&#8230;\n\n\nThis Post: Speaker Johnson outlines plan for Republicans as they strive to maintain control of the House. first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/speaker-johnson-outlines-plan-for-republicans-as-they-strive-to-maintain-control-of-the-house/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Speaker-Johnson-lays-out-agenda-for-Republicans.jpg","video":null,"publish_date":"2024-10-01 23:50:41","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.162},{"id":258136808,"title":"Number of Arizonans impacted by glitch threatening voting rights climbs to more than 200,000","text":"A data glitch in Arizona’s voter database has impacted voter registration information for roughly 218,000 people, or roughly one in every 20 voters in the state. A 20-year-old coding glitch in a state database erroneously marked voters as having provided proof of citizenship when registering to vote, when it was unclear whether they actually did. That error — discovered within weeks before Election Day, in a battleground state with more than 4 million voters — impacted roughly 79,000 Republicans, 61,000 Democrats, and 76,000 other voters, according to Arizona’s Democratic Secretary of State Adrian Fontes. The state’s Supreme Court will allow impacted voters to cast their ballots to avoid mass disenfranchisement with such a limited window for due process as Election Day nears. Monday’s discovery of a second tranche of impacted voters arrived a little over a week before early voting begins on October 9, and as Donald Trump and his Republican allies demand that all voters provide documented proof of citizenship, teeing up potential GOP challenges to election results in a state that was at the center of bogus election claims and conspiracy theories in 2020. “The reality is these registrants have met the same legal standard as every other American who registers to vote: swearing under penalty of perjury that they are US citizens,” Fontes said on Monday. “We can’t risk denying actual citizens the right to vote due to an error out of their control,” he added. “This issue is another example of why we need to fund elections, update systems and staff, and carry forward our proven tradition of safe, fair and secure elections.” But the disclosure is likely to continue to fuel baseless allegations about widespread noncitizen voting, despite election officials across the country attesting that it is exceedingly rare, with mechanisms in place to capture those votes and prosecute offenders. During a call about the issue last month, state officials feared that the incident would be weaponized by Republicans to cast doubt on the validity of elections in the state and provide election deniers a pretext to file more lawsuits challenging the outcomes. The glitch appeared to affect voters who were issued driver’s licenses before 1996, eight years before a controversial state law required voters to provide proof of citizenship to be able to participate in state elections. Like voters in other states, those voters still had to swear under penalty of perjury that they are voting-eligible citizens. But if those longtime Arizonans hadn’t updated their information since passage of the law, their proof of citizenship might not be on file. After last month’s initial discovery of 100,000 affected voters, which was discovered by the office of Maricopa County Recorder Stephen Richer, Arizona’s Supreme Court ruled that impacted voters will still be allowed to cast their full ballots for federal, state and local elections and ballot measures. “We are unwilling on these facts to disenfranchise voters en masse from participating in state contests,” Chief Justice Timmer wrote in a nine-page decision on September 20. “Doing so is not authorized by state law and would violate principles of due process.”","summary":"Democratic officials fear database error could give Republicans ammunition for bogus lawsuits to undermine election results","url":"https://www.independent.co.uk/news/world/americas/us-politics/arizona-citizenship-voting-rights-b2622321.html","image":"https://static.independent.co.uk/2024/10/02/00/977f43a2a3324cb1b6a9f5ee6207ba5b.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/4lKyQ9Hp-4VHSaSK0.mp4","publish_date":"2024-10-01 23:50:29","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","source_country":"gb","sentiment":-0.261},{"id":258136578,"title":"Skirting court’s race-quota ban, NY’s deceptive ‘abortion’ law and other commentary","text":"Higher ed: Skirting Court’s Race-Quota Ban The Supreme Court ban on “race-based affirmative action was expected to change elite universities’ demographics substantially,” yet “several top universities, including Harvard, Princeton, Yale, Penn, and Duke, have seen little to none of the expected shift in the racial composition,” reports Matthew Liley at City Journal. Universities “are either breaking the law,” or they misled the Supreme Court when “they declared race-neutral methods insufficient to achieve their diversity goals.” One way they may have maintained their racial demographics is via “diversity targets” — i.e., “awarding applicants bonus points based on socioeconomic factors.” Another, more sinister, possible reason: “Their admissions officers are ignoring the ruling” and still considering race by pushing “race-neutral admissions policies that are neutral in name only.” From the right: NY’s Deceptive ‘Abortion’ Law “New York state Democrats are using the political salience of abortion” to push woke madness, argues James Lynch at National Review. Proposal 1 — also known as the New York Equal Rights Amendment — would implement a “sweeping expansion of the state constitution’s equal-protection clause” via “vague and all-encompassing language” around race, national origin and gender. It “would allow progressive groups to pursue litigation to erode parental rights, permitting confused children to receive puberty blockers without parental consent and enabling males to play sports against women and girls.” It would also “defang efforts to enforce immigration law and could even be used to help illegal immigrants gain access to welfare benefits.” In other words, it would “codify the most extreme elements” of left-wing ideology into the state Constitution. Foreign desk: Israeli Left Cheers Hits on Hez “The Israeli left is as eager to obliterate Iran-sponsored terror as Prime Minister Benjamin Netanyahu is,” cheers Tunku Varadarajan at The Wall Street Journal. Take Gilad Kariv, who “founded the Knesset caucus for Renewing the Negotiations and Promoting the Two-State Solution.” He insists “the murderous events of Oct. 7 haven’t shaken his ‘long-term commitment’ to a two-state solution,” yet he “says his goal of a sovereign Palestinian entity should be understood as ‘the end state’ of a long and exacting political and security process.” In the long run, a two-state solution is “a necessary solution if we want to keep Israel as a Jewish and democratic state.” But “the elimination of [Hezbollah’s Hassan] Nasrallah” is “a necessary first step toward a future solution.” Media watch: ‘Biased’ Debate Hosts — Again The two moderators who were chosen for Tuesday’s debate between GOP veep pick J.D. Vance and the Dems’ Tim Walz have long been “heavily biased CBS broadcasters,” fumes The Washington Examiner’s Paul Bedard. “According to the latest study of media bias by Media Research Center’s watchdog outlet, ‘NewsBusters,’ 85% of CBS coverage has been pro-Walz and Vice President Kamala Harris, while 81%” has been critical of Vance and former President Donald Trump. Specifically, moderators — managing editor Norah O’Donnell and Face the Nation host Margaret Brennan — have a “long anti-Trump record,” the study, by Rich Noyes, found. “In a similar survey before the Trump-Harris debate, Noyes found that host ABC was biased in favor of Harris, and the post-debate criticism of the moderators proved that.” Libertarian: Subsidizing Hurricane Risk-Takers While FEMA is “helping survivors in flood-stricken regions,” its National Flood Insurance Program is “perversely” incentivizing Americans “to reside in these high-risk areas,” laments Reason’s Jack Nicastro. Without NFIP-subsidized insurance, rates would increase, becoming unaffordable for some homeowners. Yet, “unaffordability is a feature of insurance markets, not a bug. High insurance rates discourage risky behavior,” like living in flood zones. By contrast, “artificially lowering insurance rates deprives homeowners of the very information that indicates the risk of such devastation.” The solution: “Stop subsidizing NFIP and allow its more than 50 partnered insurance companies to set rates that fully reflect the risk of extreme weather events like Hurricane Helene.” — Compiled by The Post Editorial Board","summary":"Universities “are either breaking the law,” or they misled the Supreme Court when “they declared race-neutral methods insufficient to achieve their diversity goals.”","url":"https://nypost.com/2024/10/01/opinion/skirting-courts-race-quota-ban-nys-deceptive-abortion-law-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/2023-cambridge-massachusetts-u-s-89393946-e1727826529578.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-01 23:50:00","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.257},{"id":258136918,"title":"Legal experts support Trump in 11th Circuit Court","text":"In yet another almost-replay of the arguments made before the lower court in Donald Trump’s long-stalled-out Mar-a-Lago case, a group of law professors, legal scholars and a public interest law firm are asking the 11th Circuit Court of Appeals to let them file a brief as amici curiae (“friends of the court”) — on the defendant’s behalf. On Tuesday, South Texas College of Law Professor Josh Blackman and Florida lawyer Michael Adam Sasso argued that legal scholar and Professor Seth Barrett Tillman, former prosecutor Robert W. Ray, and the conservative Landmark Legal Foundation should be allowed their say as special counsel Jack Smith looks to reanimate the prosecution. In a motion for leave to file their brief, the attorneys say it is effectively their clients’ turn to catch the court’s ear — because two groups of pro-prosecution amici were allowed to file their own briefs late last month. And, they argue, this is not entirely unlike déjà vu: U.S. District Judge Aileen Cannon allowed all three groups to file briefs in the lower court case and she seriously considered each group during oral arguments. “These amici advanced arguments that supplemented the positions taken by the Special Counsel and the Defendants,” the motion reads. “The District Court’s order cited these three amici. Now, as this case continues on appeal, assistance from amici continues. The constitutional lawyers have already filed their brief. And the Ray-Tillman-Landmark Amici now seek leave to file a brief.” In their late September briefs, the pro-prosecution amici argued for the appellate court to reverse the dismissal of the Mar-a-Lago prosecution and for the case to be reassigned to another jurist. In July, after “careful study,” Cannon threw out the case by finding U.S. Attorney General Merrick Garland had unlawfully appointed Smith as special counsel. She favorably cited several sections of Justice Clarence Thomas’ concurrence in Trump’s Supreme Court immunity case. While Smith has not tried to have Cannon removed, the pro-prosecution amici cited several reasons related to the pace of the case and access to certain information in their effort. The pro-Trump amici, however, largely sidestep the issue of Judge Cannon continuing on the case one way or another — by arguing that the dismissal was properly decided. “The District Court correctly dismissed the indictment,” the pro-Trump amici argue in their 48-page Tuesday filing. The lone reference to the removal effort is in a footnote: Judge Cannon carefully parsed the historical record, and read it in a charitable manner toward Smith. This effort to reassign the case, which Smith wisely did not support, is as meritless as the “orchestrated campaign” of frivolous complaints filed against Judge Cannon. And that historical record, the brief argues, “is not spotty — it is near-empty” when it comes to outside lawyers hired as special counsels with the kind of power and authority that Smith currently claims. “Contrary to Smith’s incomplete account, this documentary record shows that during these six presidential administrations, Attorneys General retained outside lawyers as Special Counsels either: (1) to assist a U.S. Attorney with prosecutions, or (2) to assist the Attorney General with an investigation,” the filing reads. “In none of these matters did the Attorney General appoint an outside lawyer as a Special Counsel, and then delegate to him the powers now claimed by Smith: all of the powers of a Senate-confirmed U.S. Attorney.” And, the potential amici say, Cannon even gave Smith some leeway earlier on. This leeway, they say, was undeserved. In the proposed brief, the would-be amici — who the 11th Circuit has yet to approve — also spend substantial time going after Smith for relying on the landmark Supreme Court case of United States v. Nixon. In that case, the justices found that four particular statutes “vested in” the attorney general “the power to appoint subordinate officers to assist him in the discharge of his duties.” Those same statutes were later used by Garland to imbue Smith with prosecutorial power. In Cannon’s opinion, however, she dismissed that statement as “dicta” because, among other reasons, the case itself was not about “the Attorney General’s statutory appointment authority or the Appointments Clause more generally.” Trump’s attorneys have indicated they agree the language in Nixon was dicta. The pro-Trump amici also say the Nixon case should not have any bearing here — but distinguish their arguments somewhat. “Defendants’ attorneys seek only to show that United States v. Nixon’s contested language is dicta,” the motion for leave to file reads. “Ray-Tillman-Landmark, by contrast, seeks to establish that Nixon was a unique decision based on unique facts and a unique statutory and regulatory regime, which is not applicable in the instant litigation.” In the Nixon decision, the justices, “expressly and repeatedly described the circumstances giving rise to the conflict between Nixon and [Special Prosecutor Leon] Jaworski as unique,” the brief reads. The amici go on to cite at least four instances in which some permutation of the word “unique” is used to describe the situation between the president and the prosecutor in the Nixon case. “The clear implication is that the nexus of facts and operative law involving pre-Nixon Special Counsels, were, in fact, dissimilar, and that the Court’s analysis should not be extended to different facts concerning future Special Counsels,” the brief reads. “Nixon was the proverbial ticket good for one ride — or perhaps, one president.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: Donald Trump (AP Photo/Mike Stewart, File). Center: U.S. District Judge Aileen&#8230;\n\n\nThis Post: Legal experts support Trump in 11th Circuit Court first appeared on Internewscast Journal","url":"https://internewscast.com/crime/legal-experts-support-trump-in-11th-circuit-court/","image":"https://internewscast.com/wp-content/uploads/2024/10/Lawyers-law-professors-go-to-bat-for-Trump-in-11th.jpg","video":null,"publish_date":"2024-10-01 23:48:50","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.33},{"id":258138482,"title":"George Conway rips 'pathological liar' Trump for distorting Biden’s hurricane response","text":"At the end of September, Hurricane Helene inflicted major damage on the southeastern United States — from Florida to Georgia to the Carolinas. Widespread flooding, millions of power outages and more than 120 deaths were reported. 2024 GOP presidential nominee Donald Trump's response was to falsely claim that President Joe Biden and Vice President Kamala Harris neglected the victims — and that Georgia Gov. Brian Kemp was unable to reach Biden. But many of Trump's critics have been pushing back against that claim, including conservative attorney George Conway. During a panel discussion with MSNBC's Jen Psaki, the Never Trump conservative said of Trump, \"He only cares if a particular crisis can be used to manipulate the public. And that's why he's willing to tell lie after lie. I mean, he's a pathological liar. He doesn't have that shame gene that the rest of us have when we even make the slightest mistake, even accidentally.\" READ MORE:Former Trump homeland security advisor slams ex-president for 'politicizing' hurricane disaster Conway continued, \"He's just going to say whatever pops into his mind that he wants people to believe at any given moment.\" The attorney praised Vice President Kamala Harris' campaign for \"doing things to trigger\" Trump. On her MSNBC show, Psaki — who formerly served as White House press secretary in the Biden Administration — contrasted what Kemp said about Biden's response to Hurricane Helene with what Trump said. Trump, campaigning in Georgia, claimed, \"The federal government is not being responsive. They're having a very hard time getting the president on the phone.\" READ MORE: 'Totally out of luck': How Project 2025 would gut relief for Hurricane Helene victims But Kemp, a conservative Republican, told reporters, \"The president just called me yesterday afternoon. I missed him and called him right back, and he just said, 'Hey, what do you need?' And I told him, you know, 'We got what we need. We'll work through the federal process.' He offered that if there's other things we need, just to call him directly, which, I appreciate that.\" Trump's claims got a scathing response from Biden, who told reporters, \"Let me get this straight: I don't know why he does this, and the reason I get so angry about it — I don't care about what he says about me, I care what he communicates to the people that are in need. He implies that we're not doing everything possible. We are. We are.\" READ MORE: Why Georgia election board's latest change to voting procedures is so perilous","summary":"At the end of September, Hurricane Helene inflicted major damage on the southeastern United States — from Florida to Georgia to the Carolinas. Widespread flooding, millions of power outages and more than 120 deaths were reported.\n\n2024 GOP presidential nominee Donald Trump's response was to falsely claim that President Joe Biden and Vice President Kamala Harris neglected the victims — and that Georgia Gov. Brian Kemp was unable to reach Biden. But many of Trump's critics have been pushing back against that claim, including conservative attorney George Conway.\n\nDuring a panel discussion with MSNBC's Jen Psaki, the Never Trump conservative said of Trump, \"He only cares if a particular crisis can be used to manipulate the public. And that's why he's willing to tell lie after lie. I mean, he's a pathological liar. He doesn't have that shame gene that the rest of us have when we even make the slightest mistake, even accidentally.\"\n\nREAD MORE: Former Trump homeland security advisor slams ex-president for 'politiciz","url":"https://www.alternet.org/conway-trump-kemp-biden/","image":"https://www.alternet.org/media-library/image.png?id=34719395&width=1200&height=600&coordinates=0%2C38%2C0%2C39","video":null,"publish_date":"2024-10-01 23:45:18","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.643},{"id":258137736,"title":"Walz, Vance to spar in vice presidential debate","text":"Democrat Tim Walz and Republican JD Vance, U.S. politicians whose histories and rhetoric have amassed more headlines than many past No. 2 candidates, will go head to head today at the only vice presidential debate before the Nov. 5 election. Walz, 60, a liberal governor and former high school teacher, and Vance, 40, a bestselling author and conservative firebrand senator, will portray themselves as sons of America’s Midwestern heartland but polar opposites on the issues gripping the U.S. Walz has called his Republican opponents “weird,” and Vance came under fire for past comments disparaging some Democrats as “childless cat ladies.” Aides to the two men expect fireworks during the 90-minute debate at the CBS Broadcast Center in New York as they defend themselves and speak up for the candidates at the top of each ticket, Democratic Vice President Kamala Harris and Republican former President Donald Trump. Harris and Trump are expected to watch the televised debate, which begins at 9 p.m. (3 p.m. Hawaii time), and Trump said he would offer a play-by-play commentary of the event on social media. Harris was widely viewed as the winner of her sole debate with Trump on Sept. 10 in Philadelphia, which was watched by an estimated 67 million people. That square-off did little to change the trajectory of an extremely close election battle. While Harris has edged ahead in national polls of the electorate, most surveys show voters remain fairly evenly divided in the seven states that will decide the November election. Political analysts say vice presidential debates can be fiery but generally do not alter the outcome of an election. The main takeaway from the last V.P. debate, the 2020 encounter between then-Senator Harris and then-Vice President Mike Pence, was a fly that landed on Pence’s head unbeknownst to Pence himself. “I can’t think of any of them that seemed to have made a real difference in the election,” said presidential historian Thomas Alan Schwartz of Vanderbilt University. With no more debates planned, however, the stand-off will allow Walz and Vance to make closing arguments on behalf of their campaigns – just as early voting ramps up across the country. MUD-SLINGING Each will fling mud. Walz, who has sought to cultivate a homespun image as a former high school football coach, is expected to get Vance to defend his 2021 comments criticizing Harris and other Democrats as “a bunch of childless cat ladies who are miserable at their own lives.” Walz is also likely to go after Vance for spreading a fictional story of Haitian immigrants eating household pets in Springfield, Ohio, a false claim that Trump has repeated and that local officials say has drawn bomb threats. The Democrat will seek to introduce himself to U.S. voters who may not be familiar with him, while aiming to keep the conversation focused on Harris’ agenda, said a Walz adviser who asked to remain anonymous to discuss strategy. Trump advisers said Vance can be expected to try to force Walz to defend the Biden-Harris administration’s policies on immigration and the economy, as well his own handling of the riots in Minneapolis in 2020 after the death of George Floyd, a Black man, at the hands of a white policeman. Vance will also bring up questions about Walz’s military service, said Tom Behrends, a retired command sergeant major who joined a Trump campaign call about the debate. Republicans have accused Walz of exaggerating his final rank in the Army National Guard, where he served for 24 years. Walz has in the past described himself as a retired command sergeant major, one of the highest non-commissioned officer positions in the Army. While he achieved that rank, he did not meet the requirements to retire with that title. The Harris campaign says also Walz “misspoke” in 2018 during his gubernatorial campaign in Minnesota when he referred to “weapons of war, that I carried in war.” Walz was never deployed to a war zone. Vance is a former Marine who served as a military journalist. He was deployed to Iraq but never saw combat. Walz has been preparing for the debate with U.S. Transportation Secretary Pete Buttigieg, who has stood in for Vance. Buttigieg, a Midwesterner like Vance, has worn a red tie to mimic the Ohio senator’s attire. “It’s about the governor being the governor and staying true to who he is, not turning him into a slick debater like Vance,” the adviser said of the debate prep. Vance tapped Tom Emmer, a U.S. congressman from Minnesota, to stand in for Walz during mock debates, according to a source with direct knowledge of the matter. Despite Vance’s having written “Hillbilly Elegy,” a popular 2016 memoir, U.S. voters have a negative view of him, Reuters/Ipsos polling shows, with 51% of registered voters saying they view him unfavorably, compared with 39% who view him favorably. That’s a contrast with Walz, who 44% of registered voters view favorably, with 43% reporting an unfavorable view in the Sept. 20-23 poll.","summary":"Democrat Tim Walz and Republican JD Vance, U.S. politicians whose histories and rhetoric have amassed more headlines than many past No. 2 candidates, will go head to head today at the only vice presidential debate before the Nov. 5 election.","url":"https://www.staradvertiser.com/2024/10/01/breaking-news/walz-vance-to-spar-in-vice-presidential-debate/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241001_brk_deb01.jpg","video":null,"publish_date":"2024-10-01 23:45:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.148},{"id":258136462,"title":"I was traveling with Kamala Harris as the Iran-Israel news broke. This is what happened next","text":"It seems whenever I sign up for pool duty with Vice President Kamala Harris, chaos reigns in the Middle East — and today was no different. Back in May, I traveled aboard Air Force Two with the vice president to Detroit when Israeli Prime Minister Benjamin Netanyahu planned to invade Rafah. That same day, Hamas said it would agree to a ceasefire with Israel, but that quickly got binned. After waiting for ages in a van outside The Wright Museum in Detroit, Harris finally gave us a brief statement. For those not in the White House Press Corps, pool reporters are the designated journalists who agree to take a day off from their regular duties to follow around either the president, vice president or their spouses and send reports to the press corp, since we cannot all be around the principal constantly. It’s simultaneously dull work, comprising mostly sitting and waiting for the person you are following, and then transcribing whatever they say and emailing it to everyone — and occasionally exhilarating. Most importantly, it’s a way to be a good neighbor to our fellow reporters. I already knew Tuesday was going to be busy. It’s election season — the vice presidential debate between JD Vance and Tim Walz would be on Tuesday evening and I would be going over to Virginia to cover a debate watch party. Last night, I covered Montana’s Senate debate. Nonetheless, when I received a notification request to cover the vice president on Monday evening, I signed up, figuring it might be fun. Almost immediately, I regretted my decision. As I arrived at the White House gates, my credential didn’t work — because, as I learned, it had just expired — which meant I had to get a provisional pass and then scurry in the pouring rain to get into the van. Turns out that we didn’t need to rush, the vice president wasn’t going anywhere. Iran had launched a barrage of rockets into Israel, killing at least six people. Harris was in the situation room with President Joe Biden. Of course, us poolers (there’s ones for photo, video and print) were in the dark about this, sitting in the black van that usually follows the black SUV carrying the vice president. The photographers took out their cameras to snap people filing in and out of the West Wing since we were parked outside the Eisenhower Executive Office Building, where most administration employees work. At one point, Transportation Secretary Pete Buttigieg walked into the West Wing, likely to discuss the aftermath of Hurricane Helene and the destruction left in its wake in the Atlantic seaboard. Meanwhile, I got briefed that Harris would make her way to North Carolina and Georgia to survey the damage. Former president Donald Trump was raging on Truth Social about how the planet was on the brink of a third world war. All the while, we sat. And waited. Finally, the vice president stepped out of the West Wing and we were off. Soon, we arrived at the Josephine Butler Parks Center, a historic building also used for weddings, where she would was conducting an interview. The White House did not disclose with whom. Times like this make me feel almost useless since I had no scintillating details to give my colleagues, despite it being a crisis-fueled day for the vice president. Finally, Harris elected to give us a two-minute statement. “I condemn this attack unequivocally. I'm clear eyed, Iran is a destabilizing, dangerous force in the Middle East, and today's attack on Israel only further demonstrates that fact,” she said, confirming she was in the Situation Room with Biden and supported Biden’s decision to shoot down Iranian rockets. “ As I have said, I will always ensure Israel has the ability to defend itself against Iran and Iran backed terrorist militias,” she said. “My commitment to the security of Israel is unwavering.” All the while, I could not help but be reminded of how during Harris’ Democratic National Convention speech just after she got confirmed as the nominee, Harris said how she would “ensure America always has the strongest, most lethal fighting force in the world.” That comment caused her to receive some flack from the left flank in her party, alongside the fact that she has done little to differentiate herself from Biden’s unequivocal support for Israel. Previously the debate between Walz and Vance was seen as today’s main event, but after the Iranian attacks it’s likely to be treated as an afterthought. Nearly three hours after Harris spoke to us, the whole time spent sitting in the van waiting, we got word that our duty had finished. The vice president was off on Navy One, and I was back into the rain, ready to see who would succeed her.","summary":"Political reporter Eric Garcia gives an inside view of the unsexy work of being on pool duty during an action-filled day","url":"https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-israel-iran-news-live-b2622277.html","image":"https://static.independent.co.uk/2024/10/02/00/MixCollage-01-Oct-2024-07-39-PM-5551.jpg?width=1200","video":null,"publish_date":"2024-10-01 23:43:31","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","source_country":"gb","sentiment":0.016},{"id":258136448,"title":"Florida abortion rights campaigners launch ads to run during Vance-Walz debate","text":"Supporters of abortion rights in Florida will air ads during Tuesday night’s vice presidential debate featuring a mother who says her life would have been endangered by the state’s current ban. The “Yes on 4” campaign said Tuesday that the ads would run in major Florida media markets on the issue, which has become central to many voters ahead of the November election. Reproductive freedom advocates have been highlighting the consequences of Republicans’ efforts to halt abortions, and highlight how even bans with language aimed at protecting the lives of mothers often fail to do so. The ads feature a woman who needed to have an abortion and lifesaving-cancer treatments after a brain tumor diagnosis in 2022. Such a difficult situation would have been complicated by Florida’s six-week abortion ban today. In the ad, the woman identified as Caroline, says: “The doctors knew that if I did not end my pregnancy, I would lose my baby, I would lose my life, and my daughter would lose her mom. Florida has now banned abortion… even in cases like mine. Amendment Four is gonna protect women like me. In a statement, she added: “My abortion allowed me more time to be a mother to my daughter and a wife to my husband. If I were diagnosed today, Florida’s extreme abortion ban would force me to choose between my health and being there for my child. No one should have to make that choice.” Florida’s six-week abortion ban is one of the strictest in the nation and is enforced at a time before many women know they are pregnant. It came into effect this past May after the Supreme Court decision overturning Roe vs Wade in 2022, which had guaranteed the right to an abortion across the states. Florida’s six-week ban, like its 12-week predecessor, has exceptions for women whose lives are endangered by their pregnancies, but hospitals and medical providers have been hesitant to test such exceptions. Florida is one of several states with reproductive rights on the ballot this November. Amendment 4 would codify the right to an abortion at any point before fetal viability, and prevent laws in the state from restricting access before that point. It would also prevent laws from interfering with abortions after that point in the pregnancy if necessary to “protect the patient’s health”. Republican presidential candidate and Florida resident Donald Trump had come out against the state’s six-week abortion ban, saying it takes place too early in the pregnancy. However, he has also said that he does not support the campaign to pass Amendment 4 either. His running mate, JD Vance, supports a national abortion ban. Vance is likely to be questioned on his stance at tonight’s debate with Walz as well as a litany of comments he has made degrading women and Americans without children. The two vice presidential candidates, Minnesota Governor Tim Walz and Vance, are set for their only debate Tuesday night on CBS News. It will be moderated by Norah O’Donnell and Margaret Brennan. The program is set for 9pm Eastern Time in New York City.","summary":"The ads feature a woman who needed to have an abortion and lifesaving-cancer treatments after a brain tumor diagnosis in 2022","url":"https://www.independent.co.uk/news/world/americas/us-politics/walz-vance-debate-abortion-rights-b2622270.html","image":"https://static.independent.co.uk/2024/10/02/00/floridaamendment_ad_debate.jpg?width=1200","video":null,"publish_date":"2024-10-01 23:43:06","author":"John Bowden","authors":["John Bowden"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.208},{"id":258136118,"title":"Trump super PAC trolls Walz over China links with ‘Tiananmen Tim’ site hours before VP debate","text":"NEW YORK — A super PAC supporting former President Donald Trump launched a website hours before Tuesday’s vice presidential debate needling Minnesota Gov. Tim Walz for his links to China. The “Tiananmen Tim” website — created by Make America Great Again Inc. and shared exclusively with The Post — blasts the Democratic No. 2 for “putting China first [and] America last” as well as lying about being in Hong Kong while the Chinese Communist Party was brutally putting down pro-democracy protests at Beijing’s Tiananmen Square in 1989. Walz claimed at least three times between 2009 and 2019 that he was in East Asia at the height of the tumult, but two reports by a local paper in his home state of Nebraska place the future governor in the Cornhusker State until August of that year. Walz is the subject of a congressional investigation over his relationships with China and has profusely supported the Communist country in the past. The website notes that Walz has said he has visited China more than 30 times and even went on his honeymoon around the fifth anniversary of the Tiananmen Square crackdown. Walz’s China ties may come up in the debate against GOP rival Sen. JD Vance (R-Ohio), as Trump adviser Jason Miller posted about the Tiananmen Square revelation on X. “Tiananmen Tim! Funny they’re changing this now – we were planning on calling him out for this at the debate tomorrow night! Anything else you want to fess up to, Tim???” Miller wrote. The debate will be the first time Vance and Walz spar with each other face-to-face and will be the last time candidates on the 2024 tickets will debate before the Nov. 5 election. Both Trump and Harris have vowed to be tough on China if they take office as the US fights to retain its trade dominance. The MAGA Inc. site also notes that Walz has previously said he doesn’t necessarily support having an “adversarial relationship” with China and that he “recognizes that some in the Chinese Government advocate for a greater rule of law.” The Minnesota governor worked in China teaching English during his younger years and later set up a travel company called “Educational Travel Adventures,” that helped American students travel there. “It will be total malpractice if Tiananmen Tim’s China First, America Last record isn’t brought up during tonight’s debate. The most radical presidential ticket in US history is bought and paid for by the Chinese Communist Party,” MAGA Inc. spokesperson Kaelan Dorr told The Post. “The fact that Tim Walz’ questionable ties to the CCP aren’t disqualifying in Kamala’s eyes is indicative of the same poor judgement that has opened our borders, tanked our economy, and created chaos and destruction across our country.”","summary":"A super PAC supporting former President Donald Trump launched a website Tuesday trolling Minnesota Gov. Tim Walz for his deep rooted ties to China -- right before his face off in the vice presidential debate.","url":"https://nypost.com/2024/10/01/us-news/trump-super-pac-trolls-walz-over-china-links-with-tiananmen-tim-site-hours-before-vp-debate/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/trump-super-pac-trolls-tim-90834210.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/XLSjVyXu-RyIcpnTz.mp4","publish_date":"2024-10-01 23:37:55","author":"Diana Glebova","authors":["Diana Glebova"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.03},{"id":258138520,"title":"Quarter-Ending Window Dressing Lifts Our Quality Stocks","text":"The last week of September is typically characterized by quarter-end window dressing, as institutional managers try to make their portfolios look “extra pretty” by pruning out weak stocks and adding many of our fundamentally superior stocks. I should add that Micron Technology’s better-than-expected earnings announcement on Wednesday for its high-speed memory chips has re-ignited many AI-related stocks. As Hurricane Helene winds down, a new economic storm is forming, as the International Longshoreman Union and their 25,000 members walked off the job this week, which has effectively shut down three dozen U.S. ports, stopping most containers from being shipped to the U.S., and potentially disrupting holiday sales. Even if the strike lasts just two weeks, it could disrupt sales and supply chains for drugs and other essential products. In an attempt to bypass U.S. port operations, DP World, a Dubai-based global logistics company, is talking to Mexico about allowing their ports to take the added load, which would enable the company to handle cargo headed for the U.S., so if U.S. ports become congested or cannot comply with California’s strict green rules (to be zero carbon), shippers can divert their cargo to Mexico. Mexico is also building a railroad to transport containers to compete with the Panama Canal, which has suffered from a prolonged drought, creating long delays there. October is a seasonally strong month and November is even stronger. As the holidays approach, America gradually gets in a better mood and consumer spending tends to perk up. Here are the most important market news items and what this news means: - If the Longshoreman strike was not enough bad news, the ISM manufacturing report announced on Tuesday was horrific. Specifically, the ISM manufacturing PMI remained at 47.2 in September, which is the same as in August, but any reading below 50 signals a contraction. This is the 23rd month that the ISM manufacturing index has been below 50, with only one month that the index rose briefly above 50. The new export orders component plunged to 45.3 in September, down from 48.6 in August, and was especially disappointing. Only five of the 18 manufacturing industries that ISM surveyed reported an expansion in September, so the manufacturing recession persists. - In the wake of Microsoft convincing Constellation Energy to restart a nuclear reactor at Three Mile Island to produce electricity for its data centers, there are growing calls to increase nuclear energy. As an example, Peter Thiel’s Founders Fund is backing a nuclear energy start-up that would utilize low-enriched uranium, called Haleu. Nvidia founder, Jensen Huang said, “Nuclear is wonderful as one of the sources of energy, one of the sources of sustainable energy.” Huang added “It (nuclear) won’t be the only one. We’re going to need energy from all sources and balance the availability and the cost of energy as well as the sustainability over time.” In some parts of the world, there is insufficient electricity to build new data centers, so panic is starting to set in on how to double the electricity grid for AI demand and growing EV demand. - October is a seasonally strong month, but often starts slow and then picks up as third-quarter earnings announcements commence. As a result, I am expecting that the second half of October will be stronger than the first half. Investors are expected to be on high alert for an “October surprise,” such as an Iranian retaliatory attack on Israel or even another attempt on Donald Trump’s life for killing Iranian General Qasem Soleimani. - Typically, consumer confidence rises as the November Presidential election nears. The sudden drop in the Conference Board’s Consumer Confidence Index was abnormal but bodes well for Donald Trump since the economy and inflation are the top voter concerns. Interestingly, Amazon’s subsidiary, Whole Foods, asked its customers to quit calling it “Whole Pay Check!” Obviously, lingering inflation concerns and economic anxieties persist. - The Vice Presidential debate this week should be very entertaining. Although Vice Presidential debates tend to not change voters’ minds, there could still be a “breakout moment” that could sway a minority of voters. The boos that Tim Waltz received at the Minnesota/Michigan football game compared with the cheers that Donald Trump got at the Georgia/Alabama football game is a sign that voters have already made up their minds. Nonetheless, the goals of both JD Vance and Tim Waltz are to appear competent, and likable and sway undecided voters. - Eurostat reported on Tuesday that consumer inflation in the eurozone is now running at a 1.8% annual pace through September, down from a 2.2% annual pace through August, which is setting up the European Central Bank (ECB) for another key interest rate cut. ECB President Christine Lagarde has hinted that another key interest rate cut would likely be forthcoming. The next ECB meeting is October 17th. Interestingly, since the Bank of England has only cut key interest rates 0.25%, the British pound has appreciated against the U.S. dollar and other currencies. In summary, as the third-quarter earnings announcements commence, I expect that fundamentally superior stocks will benefit from wave after wave of earnings surprises. By early November, we should know who the next President will be (provided we do not have a contested election), and the Fed will cut key interest rates again. Consumer sentiment should improve with most of the economic and political uncertainty removed. As the holidays approach, consumers should be in a good mood, even if the Longshoreman strike disrupts holiday sales. This is why our stocks typically benefit from an “early January effect,” since Thanksgiving commences the holiday season and the happy time of year.","summary":"October is a seasonally strong month and November is even stronger. As the holidays approach, America gradually gets in a better mood.","url":"https://www.theepochtimes.com/business/quarter-ending-window-dressing-lifts-our-quality-stocks-5733556","image":"https://img.theepochtimes.com/assets/uploads/2023/06/29/id5363653-Micron-Technology-logo-300x180.jpg","video":null,"publish_date":"2024-10-01 23:37:48","author":"Louis Navellier","authors":["Louis Navellier"],"language":"en","source_country":"us","sentiment":-0.401},{"id":258135842,"title":"Antony Blinken mocked over essay touting the Harris-Biden admin’s foreign policy strategy published same day Iran attacks Israel","text":"Secretary of State Antony Blinken was ridiculed Tuesday over his magazine essay lauding the Harris-Biden administration’s foreign policy strategy that was published the same day Iran launched a barrage of ballistic missiles at Israel. “The Biden administration’s strategy has put the United States in a much stronger geopolitical position today than it was four years ago,” Blinken wrote in a piece for Foreign Affairs magazine, as tensions in the Middle East escalated. “We increased diplomatic pressure and strengthened the US military’s force posture to deter and constrain Tehran,” the 62-year-old top State Department official wrote in another section of the ill-timed essay, which went on to slam former President Donald Trump for exiting the Iran nuclear deal. “We demonstrated to Iran that there was a path back to a mutual return to compliance — if Iran was willing to take it — while maintaining a robust sanctions regime and our commitment that Iran will never be permitted to obtain a nuclear weapon,” Blinken said of the Harris-Biden administration’s policy toward the Islamic Republic. Blinken’s essay landed with a thud on social media. “Yikes,” Donald Trump Jr., wrote on X, sharing snippets of the secretary of state’s piece. “Has anything aged so bad so fast?” read a tweet from the Libs of TikTok X account. “Does anyone have worse political instincts or timing than this disastrous regime?” another social media user chimed in. Fox News contributor Joe Concha likened the glowing essay to “an end zone dance by Blinken” published “as the world burns.” The top US diplomat’s essay also dropped a day after Israel announced that it has begun ground incursions into neighboring Lebanon to root out Hezbollah terrorists. Blinken wrote that the Harris-Biden administration “has been working tirelessly with partners in the Middle East and beyond to end the conflict and suffering in Gaza, find a diplomatic solution that enables Israelis and Lebanese to live in safety on both sides of the border, manage the risk of a wider regional war, and work toward greater integration and normalization in the region, including between Israel and Saudi Arabia.” “These efforts are interdependent,” he argued. “Without an end to the war in Gaza and a time-bound, credible path to statehood that addresses the Palestinians’ legitimate aspirations and Israel’s security needs, normalization cannot move forward.” “But if these efforts succeed, normalization would join Israel to a regional security architecture, unlock economic opportunities across the region, and isolate Iran and its proxies,” Blinken added, noting that he saw “glimmer of such integration” in April, when Iran last launched a volley of drones and ballistic missiles toward Israel.","summary":"“The Biden administration’s strategy has put the United States in a much stronger geopolitical position today than it was four years ago,” Blinken wrote in a piece for Foreign Affairs magazine, as tensions in the Middle East escalated.","url":"https://nypost.com/2024/10/01/us-news/antony-blinken-mocked-over-essay-touting-the-harris-biden-administrations-foreign-policy-strategy-published-on-the-same-day-iran-attacks-israel/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/90837211.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/SCxVl0EN-RyIcpnTz.mp4","publish_date":"2024-10-01 23:33:48","author":"Victor Nava","authors":["Victor Nava"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.032},{"id":258138944,"title":"Live chat: Vance and Walz meet tonight for the vice presidential debate. Join our columnists","text":"JD Vance and Tim Walz meet Tuesday night in the first and only vice presidential debate of the 2024 campaign. Historically, the face-off between running mates hasn’t mattered in terms of the outcome in November. Nevertheless, vice presidential debates have yielded some of the most memorable political moments in recent history. For many, the evening will serve as an introduction to Ohio Sen. Vance and Minnesota Gov. Walz. In a recent survey by the Pew Research Center, roughly a quarter of those polled said they had never heard of the two men. Los Angeles Times columnists Lorraine Ali, Mark Z. Barabak, Anita Chabria and Doyle McManus will be watching the debate live, discussing the highlights and lowlights as they happen. How to watch the debate| Debate moderators| What to know 5:45 p.m.: Can JD Vance feign normalcy for 90 minutes? What will it take for Tim Walz to appear more folksy than he already does? Coveralls? A wrench in one hand, and a Farmer’s Almanac in the other? So many deep questions heading into tonight’s debate between the senator from Ohio and the Minnesota governor. The name of the game is appealing to working-class voters in the \"blue wall\" states of Pennsylvania, Michigan and Wisconsin (the rest of us are superfluous), but what that looks like depends on the candidate. Is it about demonizing immigrants or big business? Lamenting abortion bans or the high price of eggs and milk? Breaking news also presents challenges. Who will dare to go near the expanding war in the Middle East, where Israel just launched a ground invasion into Lebanon and Iran launched missiles toward Israel? Gaza has been a hot potato on the campaign trail, and this is a conflict that the winning party will inherit. And remember, this is a VP debate so the potential is high for it to be about as exciting as watching your dog sleep. Consider memorable outtakes of past VP debates: Former Wisconsin Rep. Paul Ryan nervously drinking copious amounts of water during his debate with VP incumbent Joe Biden in 2012 (see the \"SNL\" sketch), or the fly that lodged itself in former Vice President Mike Pence’s hair as he sparred with Harris in 2020 (see the \"SNL\" sketch). But with an incredibly tight election on the horizon, this could be the rare VP debate that makes an impact — or lends itself to another great \"SNL\" sketch. —Lorraine Ali 5:30 p.m.: In the battle of Midwestern dads, I think we’ll see each one try to steal a little mojo from the other. JD Vance will try to come across as amiable and reasonable (a ginormous stretch after his Springfield rants) while Tim Walz will try to go tougher and throw some not-so-pleasant-guy punches against Vance, and Donald Trump. How that switch lands with viewers will determine the winner. Do we like a bully who can play nice, or a nice guy who can take on a bully? I’ll let you figure out who is who. Along with the usual topics — immigration, abortion and the economy — current events, including Tuesday’s attack on Israel by Iran and the federal response to the devastation of Hurricane Helene, will likely pop up. But enough guessing, here we go. —Anita Chabria 5:20: p.m.: The most important thing to remember about a vice presidential debate is that the two candidates onstage aren’t really running against each other. They’re just surrogates (OK, super-surrogates). Their main job is to represent the candidates at the top of the tickets. That’s why Lloyd Bentsen’s “Jack Kennedy” line, while brilliant, didn’t affect the election of 1988. It’s why campaign insiders consider Joe Biden’s solid 2012 performance against Paul Ryan a model to emulate, even though it didn’t feature any memorable quips. Biden made a better case for his boss, then-President Barack Obama, than Obama had made in his lackluster first debate against Mitt Romney So Tim Walz’s main mission is to make the most effective case he can for a Harris presidency, and remind voters of everything they dislike about Donald Trump. JD Vance’s mission is to make the case for a Trump presidency and reinforce undecided voters’ doubts about Harris. I’d expect Vance to spend most of his time talking up Trump’s first-term economy and attacking both Harris and Vance as “dangerously liberal.” Polls suggest those have been the Trump campaign’s most effective messages to the few remaining undecided voters. And I’d expect Walz to deliver a folksy explanation of Harris’ economic plan and a middle-class attack on Trump’s economic proposals (tax cuts for corporations, high tariffs that would push prices up). Wild Card: Will Walz remind voters that Trump is 78 years old (in contrast to Harris’ youthful-by-current-standards 59), making it more possible that Vance, with his weird views on childless cat ladies, could end up in the Oval Office? —Doyle McManus 5:10 p.m.: Allow me to kick things off with some thoughts on what I'll be watching for, then you all can chime in. As noted, it’s virtually certain that nothing said or done at CBS News headquarters in New York will matter a whole lot once the studio lights fade. Recall, from 1988, Dan Quayle and the infamous “You’re no Jack Kennedy” rejoinder, which Democrat Lloyd Bentsen leveled after the youthful Quayle compared himself to the youthful president. The gibe blew Quayle off the debate stage; then, just a few weeks later, Republicans won the White House in a landslide. That said, it could be an interesting and, dare I say, entertaining evening — depending on your tastes in entertainment. Tim Walz and JD Vance share a Midwestern pedigree and that’s pretty much it. Walz is all avuncular, with his can-I-help-shovel-your-walk approachability and good cheer. His attacks — “They’re weird!” — tend to singe, not burn. Will he take a more aggressive tack tonight? Vance has certainly given him plenty to work with, whether it’s his denigrating remarks about “childless cat ladies” or the phony horror stories he’s conjured about supposedly pet-eating Haitian immigrants in Springfield, Ohio. Vance, who’s approached his understudy role with fists up and teeth bared, seems to have the tougher challenge of the two, making himself appear more likable while taking on Walz and, especially, Kamala Harris. But maybe Vance doesn’t care about his popularity with voters beyond the MAGA base. He may simply play to an audience of one, Donald Trump, who only has one mode and one method: attack, attack, attack. —Mark Z. Barabak","summary":"JD Vance and Tim Walz meet tonight for the vice presidential debate on CBS News. Join Times columnists for live updates.","url":"https://www.latimes.com/politics/story/2024-10-01/2024-vp-debate-vance-walz-live-chat-columnists","image":"https://ca-times.brightspotcdn.com/dims4/default/091abbf/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa8%2F67%2F1114e79443fea03af73600b34eed%2Felection-2024-debate","video":null,"publish_date":"2024-10-01 23:30:26","author":"Anita Chabria,Doyle McManus,Lorraine Ali,Mark Z. Barabak","authors":["Anita Chabria","Doyle McManus","Lorraine Ali","Mark Z. Barabak"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.27},{"id":258135672,"title":"Republican-Appointed Judge Questions Georgia's New 'Vague' Ballot Rule","text":"A Republican-appointed judge in Georgia has suggested that a new rule instituted by the state's election board may be too \"vague\" to stand.Georgia's State Election Board, which is controlled by three Republicans whom former President Donald Trump has praised as \"pit bulls,\" introduced a rule this year that allows it to conduct a \"reasonable inquiry\" before any election results are officially certified.Political experts have warned that the rule and others passed by the pro-Trump board could allow certification of the election to be delayed past a required deadline of November 12 in the event that Trump is defeated in Georgia by Vice President Kamala Harris on November 5.Fulton County Superior Court Judge Robert McBurney, an appointee of Republican former Georgia Governor Nathan Deal, held a hearing on Tuesday in a lawsuit over the rule brought by the Democratic National Committee, the Georgia Democratic Party and Democratic members from several county election boards.McBurney, who rankled Republicans on Monday by striking down Georgia's six-week abortion ban, said on Tuesday that the election board's \"reasonable inquiry\" rule \"on its face\" was \"vague and needs clarification,\" according to CNN.The judge also reportedly criticized the board for putting into place new election rules that \"seem to pop up every 20 minutes,\" such as a rule that recently required all ballots in Georgia to be hand-counted three times before votes are certified.Newsweek reached out for comment to Georgia's State Election Board via online contact form on Tuesday evening.Valdosta State University political science professor Bernard Tamas, co-chair of the Georgia chapter of the Scholars Strategy Network, previously told Newsweek that the \"reasonable inquiry\" rule was \"ill-defined at present and could potentially add confusion by creating further delays in the election process.\"\"They will likely stretch the capacities of the state's election officials and cause high levels of chaos,\" Tamas said.Jennifer McCoy, Regents political science professor at Georgia State University, had similar thoughts, telling Newsweek that the rule \"not only runs counter to\" the board's \"role established by state law but opens the door to Georgia failing to certify its elections and have its votes counted.\"\"If that extreme scenario were to occur, it would wreak havoc with the outcome and confidence in the entire national election,\" she said.Georgia, which Trump lost narrowly to President Joe Biden in 2020, is among at least seven battleground states expected to be critical in deciding the outcome of this year's presidential election.Trump continues to falsely claim that the 2020 election was \"stolen\" from him due to massive fraud in Georgia and other states that he lost, although no credible evidence to support his claims have ever surfaced.Democrats have also sued the Georgia election board over its new hand-counted ballots rule, which some have warned could expose results to human error, especially since the rule may have been put into place too late to properly train election workers.Republican Georgia Attorney General Chris Carr has said that the board's changes are \"very likely\" to exceed the panel's \"statutory authority,\" while GOP Secretary of State Brad Raffensperger has warned of delays caused by the changes creating \"a vacuum that leads to misinformation and disinformation.\"Harris campaign spokesperson Quentin Fulks told The New York Times on Monday that the campaign agrees \"with Georgia's Republican Attorney General and Secretary of State.\"","summary":"Georgia's State Election Board, controlled by Trump-backed Republicans, has established controversial election rules.","url":"https://www.newsweek.com/republican-appointed-judge-questions-georgias-new-vague-ballot-rule-1962323","image":"https://d.newsweek.com/en/full/2485134/georgia-election-board-rule-vague-republican-judge.jpg","video":null,"publish_date":"2024-10-01 23:30:07","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.249},{"id":258137708,"title":"“FEMA helps all people\": Agency responds to Trump claims that they aren't helping Republicans","text":"Since Hurricane Helene caused widespread devastation throughout the South, the Trump campaign and other conservatives have touted a lie that federal agencies are intentionally responding slowly to Republican-voting areas. In a fiery response, FEMA spokesperson Jaclyn Rothenberg slammed the idea that FEMA takes party affiliation into account. “FEMA helps all people before, during, and after disasters,” FEMA Spokesperson told MeidasTouch. “We help people regardless of background, across all of these states that need assistance. Our goal is to get assistance into the hands of people who need it most, regardless of their background, and that’s what we’ll continue to do.” The agency, which was accused of being burdened by “DEI regulations” by Fox host Laura Ingraham on Monday, has been the subject of an right-wing smear campaign alleging that their \"goal is to be woke.” Former President Donald Trump falsely claimed that the Biden admin was \"going out of their way to not help people in Republican areas” earlier this week. Trump also claimed that victims of the hurricane were “being treated horribly by Biden and Harris” because they were Republican voters. “The Biden-Harris team is also treating Republican areas — they get — not getting water. They’re not getting anything,” Trump told Fox Nation Kellyanne Conway on Monday. Rothenberg says this misinformation could get in the way of people seeking the relief they need. “When I hear the misinformation about FEMA only providing assistance to certain people, that’s really hard to hear because that’s absolutely not true,” Rothenberg said. “It’s really unfortunate that there’s misinformation because that discourages people from applying for assistance.” The spokesperson urged all those effected by Hurricane Helene to apply for assistance.","summary":"As Trump claims FEMA leaves Republican areas behind, the agency says misinformation discourages relief applications","url":"https://www.salon.com/2024/10/01/fema-helps-all-people-agency-responds-to-claims-that-they-arent-helping/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2024/10/gettyimages-1605860306_2.jpg ?>","video":null,"publish_date":"2024-10-01 23:29:07","author":"Griffin Eckstein","authors":["Griffin Eckstein"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.569},{"id":258135176,"title":"Vance, Walz set for US vice presidential candidate debate","text":"US vice presidential contenders J.D. Vance and Tim Walz face off in what could be an unusually important undercard debate Tuesday as they compete for decisive votes in America’s heartland just weeks before the election. The showdown between Walz, the Democratic Minnesota governor chosen by Kamala Harris, and Vance, the Republican senator from Ohio who is Donald Trump’s running mate, is likely to be the last of the 2024 campaign. Trump has refused a second debate with Vice President Harris, meaning this could be the final chance to see the two tickets go head to head. Vance, 40, and Walz, 60, each claim to be the true voice of the crucial Midwestern swing states—including Michigan and Wisconsin—that could decide an election that remains on a knife edge with five weeks to go. Both have been out of the spotlight lately, but Walz offered a brief message on X: “Looking forward to tonight.” History suggests vice presidential debates rarely move the dial much. However, Tuesday’s contest may have added significance in an election campaign that has seen Harris step in for US President Joe Biden unprecedentedly late in the game. The race has seen Vance and Trump use increasingly divisive rhetoric and even falsely accuse immigrants of eating people’s pets, meaning the debate is almost guaranteed to make for fiery television. “It will whet a lot of people’s appetites for November 5,” Thomas Whalen, an associate professor of social sciences at Boston University, told AFP. But the debate itself risked being overshadowed by Mideast tensions, after Iran launched ballistic missiles against Israel, which said it largely repelled the attack. Trump, visiting swing state Wisconsin on Tuesday, made zero mention of Vance or the VP debate in a rambling address. But he did insist that “if I were in charge, today’s attack on Israel never would have happened.” Should Harris and Walz win, he warned, “the world goes up in smoke.” Harris for her part, pledged her “unwavering” commitment to the security of Israel after Iran launched what she called “a reckless and brazen attack” on America’s ally. She said she “fully” supported Biden’s order for the US military to shoot down some of the missiles. The CBS clash also comes as several states dig out from enormous storm Helene, which has left at least 130 people dead and brought misery to thousands more. The devastation, and how to address such disasters, are likely to come up during the debate. – ‘High drama’ – Walz and Vance were each picked by their bosses to reach out to voters in the Midwestern battlegrounds where, thanks to the country’s idiosyncratic electoral college system, a few thousand votes could determine who wins the White House race. Both are military veterans with strong blue-collar credentials. Vance authored the Rust Belt memoir “Hillbilly Elegy” while Walz boasts a folksy persona as a former teacher and football coach. The similarities end there. The combative Vance shares Trump’s penchant for courting controversy, whether by smearing Democrats as “childless cat ladies” or by boosting false claims that Haitians living in an Ohio town ate residents’ pets. His goal will be to overcome polls that initially had him as one of the least popular VP nominees in history, after a series of previous comments on women and abortion were unearthed. “Vance has to be careful, because I think a trap has been laid for him,” said Whalen. The cheery Walz will be seeking to introduce himself to a public that barely knows him, after Harris’s swift rise to replace Biden as the Democratic nominee. He became a hit with Democrats for branding Vance and Trump “weird” and for his progressive politics, but that will be a target for Vance as he and Trump seek to paint Walz and Harris as “Marxists.” Vance “is going up against a moron, a total moron,” Trump said in an interview Monday on Fox Nation. Televised debates have already proved their ability to shock this year, with Biden forced to drop his reelection bid after a disastrous performance against Trump in June brought long-simmering concerns about his age to the fore. Whalen said few vice presidential debates have “had any appreciable difference” in the past, but Tuesday’s clash could produce “high drama” for viewers who love political theatre. AFP","summary":"US vice presidential contenders J.D. Vance and Tim Walz face off in what could be an unusually important undercard debate Tuesday as they compete for decisive votes in America&#8217;s heartland just weeks before the election. The showdown between Walz, the Democratic Minnesota governor chosen by Kamala Harris, and Vance, the Republican senator from Ohio who \n\n\n \n Read More","url":"https://punchng.com/vance-walz-set-for-us-vice-presidential-candidate-debate/","image":"https://cdn.punchng.com/wp-content/uploads/2017/02/14151745/1024px-USA_Flag_1992.jpg","video":null,"publish_date":"2024-10-01 23:20:36","author":"Agency Report","authors":["Agency Report"],"language":"en","catgory":"politics","source_country":"ng","sentiment":-0.133},{"id":258135054,"title":"Trump campaign denies it ever agreed to '60 Minutes' interview after CBS News claimed he backed out","text":"The Trump campaign is denying that it had ever formally accepted the invitation for former President Trump to sit for a \"60 Minutes\" interview after CBS News claimed he had backed out. \"60 Minutes is scheduled to air a primetime election special on a Monday edition of the broadcast on Oct. 7 at 8 p.m… This year, both the Harris and Trump campaigns agreed to sit down with 60 Minutes,\" CBS News said in a statement released Tuesday. \"Vice President Harris will speak with correspondent Bill Whitaker. After initially accepting 60 Minutes' request for an interview with Scott Pelley, former President Trump's campaign has decided not to participate. Pelley will address this Monday evening.\" But according to Trump campaign spokesman Steven Cheung, that was \"fake news.\" \"60 Minutes begged for an interview, even after they were caught lying about Hunter Biden’s laptop back in 2020,\" Cheung wrote on X. \"There were initial discussions, but nothing was ever scheduled or locked in.\" CBS NEWS CASTS LONG SHADOW OF ANTI-TRUMP BIAS AHEAD OF ITS VICE-PRESIDENTIAL DEBATE CBS News did not immediately respond to Fox News Digital's request for comment. Cheung was alluding to the testy exchange Trump had with veteran \"60 Minutes\" correspondent Lesley Stahl, who dismissed the Hunter Biden laptop scandal during their interview just days before the 2020 election. CBS TARRED AND FEATHERED FOR ADMITTING EXISTENCE OF HUNTER BIDEN'S LAPTOP TWO YEARS AFTER NEW YORK POST REPORT At the time, Trump insisted that then-candidate Joe Biden was \"in the midst of a scandal.\" \"He's not,\" Stahl gleefully replied. \"Of course he is, Lesley,\" Trump sternly doubled down. \"No, c'mon,\" Stahl continued to reject the president's claim, before lecturing him, \"This is '60 Minutes' and we can't put on things that we can't verify.\" CBS News eventually went on and verified the infamous laptop in 2022. CBS News stated that its election special will air Monday as planned, featuring only the Harris interview. \"Our original invitation to former President Donald Trump to be interviewed on 60 Minutes stands,\" CBS News added. CBS' ‘60 MINUTES’ ACCUSED OF EDITING EXCHANGE BETWEEN DESANTIS, REPORTER PUSHING ‘PAY FOR PLAY’ NARRATIVE CLICK HERE TO GET THE FOX NEWS APP The network's announcement comes just hours before it is set to host the vice-presidential debate between Sen. JD Vance, R-Ohio, and Democratic Minnesota Gov. Tim Walz. The \"60 Minutes\" special will mark Harris' third interview with a national news organization following her sit-down last week with MSNBC's Stephanie Ruhle and the one she did with CNN's Dana Bash alongside Walz.","summary":"The Trump campaign is disputing a statement released by CBS News claiming former President Trump backed out of a &quot;60 Minutes&quot; interview he initially agreed to, calling that &quot;fake news.&quot;","url":"https://www.foxnews.com/media/trump-campaign-denies-ever-agreed-60-minutes-interview-after-cbs-news-claimed-he-backed-out","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/Trump60Min.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-01 23:15:24","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.276},{"id":258135368,"title":"New York mag has hired a top law firm to investigate the Olivia Nuzzi-RFK Jr. relationship","text":"It may take a while for New York magazine to decide the fate of its star political reporter Olivia Nuzzi over a relationship she disclosed with Robert F. Kennedy Jr., the onetime presidential candidate. But the Vox Media publication has signaled it's not messing around in investigating the matter.New York editor in chief David Haskell told staff at an all-hands meeting on Tuesday that it hired the law firm Davis Wright Tremaine to head the third-party probe. The firm is known in media circles as a heavy hitter. Media companies have hired it in the past to ensure press access to the trials of Donald Trump, Harvey Weinstein, and Sam Bankman-Fried. The firm has also defended Big Tech companies like Meta and Amazon, as well as creators who sued to stop a TikTok ban.Two people who attended the New York all-hands meeting said Haskell only briefly mentioned the Nuzzi-RFK Jr. situation and didn't answer questions about it. The meeting was a regularly scheduled monthly gathering that had been rescheduled from last week.The scandal has had a series of twists and turns. This week, in court documents viewed by BI, Nuzzi accused her ex-fiancé, Politico reporter Ryan Lizza, of making threats of physical violence against her after they broke up and threatening to destroy her career by making personal information about her public. The court granted Nuzzi a temporary protection order. Lizza denied the claims in a statement to BI (Politico shares an owner with BI). CNN previously reported on the court documents.The Nuzzi-RFK Jr. story has thrown a national spotlight on New York mag and its parent company, Vox Media. It's an uncomfortable moment for the low-profile Haskell, who faces the possibility of losing his highest-profile political reporter in the midst of a presidential election. Nuzzi was put on leave in late September after her editors learned she'd had a relationship with Kennedy while reporting on the presidential race; news of the relationship was first broken by journalist Oliver Darcy in his newsletter, Status.In a note to readers, New York called it a \"violation of the magazine's standards around conflicts of interest and disclosures\" but also said an internal review of her published work found no inaccuracies or evidence of bias. Employees were instructed by Vox Media's general counsel Brian Leung to not discuss anything with Nuzzi or send any correspondence about the matter.New York mag insiders previously told BI that some in the newsroom had expressed sympathy for their colleague and friend while still condemning her reported actions. There have also been questions about whether her career can survive and why she wasn't fired on the spot, given her editors said she violated the magazine's standards, and demands for more transparency about NY mag's handling of the matter. Hiring Davis Wright Tremaine could be a signal Vox is building a rock-solid case to fire Nuzzi. On the other hand, should Vox decide to let her stay, it could have cover for doing so now that it's hired a high-profile law firm for the review.","summary":"New York mag has hired top media law firm Davis Wright Tremaine to investigate the Olivia Nuzzi-RFK Jr. matter.","url":"https://www.businessinsider.com/vox-new-york-mag-law-firm-olivia-nuzzi-rfk-jr-2024-10","image":"https://i.insider.com/66fc5a2c9e0c5c2eeee9c908?width=1136&format=jpeg","video":null,"publish_date":"2024-10-01 23:12:31","author":"Lucia Moses","authors":["Lucia Moses"],"language":"en","source_country":"US","sentiment":-0.23},{"id":258134796,"title":"Trump declines to take part in ’60 Minutes’ election special interview","text":"NEW YORK – CBS News said Tuesday that Republican presidential nominee Donald Trump has declined to participate in an interview with “60 Minutes” for its election special, which will go forward next Monday with Democratic opponent Kamala Harris alone. Television’s top-rated news program regularly invites the two presidential contenders for separate interviews that air back-to-back on a show near the election. This year, it is scheduled for Monday instead of its usual Sunday time slot. Asked for comment, the former president’s campaign spokesman Steven Cheung said, “Fake news,” adding that there were discussions but nothing was ever locked in. “60 Minutes” said Trump’s campaign had initially agreed to an interview before telling CBS that the former president would not appear. The network said its invitation to sit for an interview still stands, and correspondent Scott Pelley will explain Trump’s absence to viewers. Vice President Harris will appear in a pretaped interviewed with Bill Whitaker. There are currently no other scheduled opportunities for voters to compare the two candidates together. Harris and Trump previously debated on Sept. 10. Although Harris has accepted an invitation from CNN for a second debate later this month, Trump has not accepted.. The interview special is scheduled to air Monday instead of the usual “60 Minutes” time slot because CBS is showing the American Music Awards on Sunday. Trump’s interview with “60 Minutes” correspondent Lesley Stahl prior to the 2020 election proved contentious, with the former president ending the session early and his campaign posting an unedited transcript of the session. CBS News was hosting Tuesday’s vice presidential debate between Republican Ohio Sen. JD Vance and Tim Walz, Minnesota’s Democratic governor.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – CBS News said Tuesday that Republican presidential nominee Donald&#8230;\n\n\nThis Post: Trump declines to take part in &#8217;60 Minutes&#8217; election special interview first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-declines-to-take-part-in-60-minutes-election-special-interview/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Trump-won039t-participate-in-interview-for-03960.jpg","video":null,"publish_date":"2024-10-01 23:11:42","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.052},{"id":258136858,"title":"Trump’s Economic Message Is Slipping","text":"Donald Trump has long cast himself as Mr. Economy. The former president has claimed on the campaign trail that his last term saw “the best economy in the history of our country.” (He glosses over the economic crisis of 2020.) He has presented a slate of far-fetched ideas for how to bring down the cost of living and strengthen business. (See: “Drill, baby, drill”; his promises to impose massive tariffs; his idea to deport immigrants to open up more housing; and his suggestion that he himself wants to “have a say” in toggling interest rates, which he later walked back.) Until a few months ago, voters—who say that the economy is the biggest campaign issue on their minds—appeared to be buying his pitch. In polls, Americans overwhelmingly said that they trusted him more than President Joe Biden to handle the economy. But much has changed in recent months: Once Kamala Harris became her party’s nominee, she quickly distinguished her campaign’s economic message from Biden’s, a strategy that has resonated with some voters. Last month, the Federal Reserve lowered interest rates for the first time in more than four years, effectively signaling to Americans that inflation is over—and triggering a stream of positive news coverage to that effect. Voters’ perceptions of the economy writ large have proved stubborn, but the American public seems more and more willing to entertain the idea that Harris could be a better leader than Trump on the issue. Scarred by a period of high prices and inflation, Americans have been reluctant to accept the message—from Biden or from pundits—that the economy is good, actually, even though inflation cooled off significantly by 2023 and the unemployment rate has been near historic lows for much of the past three years. (Consumer sentiment has risen considerably since a mid-2022 nadir, but it’s still nowhere near pre-pandemic levels). Harris’s strategy so far has not focused on defending Biden’s record; instead, her campaign has attempted to differentiate her from the president—even as Trump has tried to present her as an extension of Biden’s legacy. “Whether or not Harris is ultimately saddled with Biden’s economic baggage may come down to who wins this narrative war,” my colleague Rogé Karma, who covers economics, told me. Harris has focused on acknowledging the high cost of living and offering paths to combat it—a departure from Biden, who spent the past year trying desperately to convince voters that the economy was strong, Rogé said. Harris’s approach (which Rogé has called “Bidenomics without Biden”) seems to be working so far: One poll found that she had a one-point lead over Trump on the economy in September, just three months after Biden was running 11 points behind Trump on the issue. Other polls also show Trump’s edge as the trusted economy candidate shrinking. “The economy as an issue has gone from being the winning issue for Trump to a virtual tie,” Rogé explained. Harris has gained on Trump, but this trend is not guaranteed to continue until November. One primary predictor of success for the incumbent party, Gabriel Lenz, a political-science professor at UC Berkeley, told me, is the growth of what economists call “real disposable income,” or Americans’ income after taxes and transfers—spending money, in other words. Right now, that metric is on the fence: “We’re not seeing that incomes are going up relative to inflation as much as they could be,” Lenz said. News stories can also shift voter perception in the final weeks of an election, even in our calcified political moment, Lenz argued. Historical precedent has been set for that: In 1992, for example, the economy was picking up before the election, but the fact that media coverage remained negative may have influenced the incumbent George H. W. Bush’s loss, Lenz suggested. (It didn’t help that Bill Clinton’s team did its best to tie Bush to that negative narrative: That election featured the infamous Clinton-campaign line “It’s the economy, stupid.”) The broad realities of the American economy haven’t meaningfully changed since Harris entered the race, and Americans don’t suddenly feel rosy about it. But the messenger has changed, and that may be enough to compel some voters in this final stretch. Because many Americans are so far distinguishing Harris from the Biden administration’s economic policy, she has been able to take advantage of good economic news in a way that Biden never quite could. Related: Here are four new stories from The Atlantic: Today’s News Dispatches Explore all of our newsletters here. Evening Read Hurricane Helene Created a 30-Foot Chasm of Earth on My Street By Chris Moody More From The Atlantic Culture Break Rewatch. The 2012 film Game Change (streaming on Max) knew exactly what was coming for American politics, James Parker writes. Debate. Malcolm Gladwell’s insistence on ignoring the web in his new book, Revenge of the Tipping Point, is an even bigger blind spot today than it was when The Tipping Point came out, Gal Beckerman argues. Stephanie Bai contributed to this newsletter. When you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic.","summary":"What was once his winning campaign issue is now a toss-up.","url":"https://www.theatlantic.com/newsletters/archive/2024/10/trumps-economic-message-is-slipping/680110/","image":"https://cdn.theatlantic.com/thumbor/QTaUp1tVFvwTfNeTBNLqDb0aqsk=/0x0:3374x1757/1200x625/media/img/mt/2024/10/GettyImages_2172680754/original.jpg","video":null,"publish_date":"2024-10-01 23:05:00","author":"Lora Kelley","authors":["Lora Kelley"],"language":"en","source_country":"US","sentiment":-0.292},{"id":258135112,"title":"Whoopi Gets Heated Over ‘Shazam!’ Star Zachary Levi’s Trump Endorsement","text":"Things got heated on The View Tuesday when Whoopi Goldberg took aim at actor Zachary Levi for comments he made during a Donald Trump campaign event in Michigan on Saturday. The comment that sparked Goldberg’s rant was one the “Shazam” star made about Hollywood being liberal. “Within my industry, as you can probably imagine, Hollywood is a very, very liberal town, and this very well could constitute career suicide,” Levi said of his support of Trump in a clip from the event shown on the talk show. “So, okay. That’s not necessarily true,” the Oscar winner said in response to Levi’s remarks. “From the beginning of Hollywood, it’s always been a very right-leaning town, but I know you don’t know much about the Hollywood history, so let me school you.” “We are, like America is, we’re mixed. We’re a mixed bunch, and sometimes it might seem like there’s more Democrats, and sometimes it seems like there’s more Republicans, but the truth of the matter is very few people seem to bite it because they’re Republican,” she continued. Goldberg went on to call Levi’s assertion “B.S.” and pointed to the careers of Jon Voight and Dennis Quaid, who are conservative and still working in Hollywood. Prior to Levi’s endorsement of Trump, the actor was vocal about his support of Robert F. Kennedy Jr.’s campaign for president and reiterated his devotion before welcoming RFK Jr. and Tulsi Gabbard onto the stage at the event. “And in a perfect world, whatever that would look like, perhaps I would have voted for Bobby. But we don’t live in a perfect world. In fact, we live in a very broken one, we live in a country that has been hijacked by a lot of people who want to take this place way off the cliff... Because I do believe, of the two choices that we have, and we only have two, Donald Trump, President Trump is the man that can get us there,” he told the crowd.","summary":"Marleen Moise/GettyThings got heated on The View Tuesday when Whoopi Goldberg took aim at actor Zachary Levi for comments he made during a Donald Trump campaign event in Michigan on Saturday.\n\nThe comment that sparked Goldberg’s rant was one the “Shazam” star made about Hollywood being liberal.\n\n“Within my industry, as you can probably imagine, Hollywood is a very, very liberal town, and this very well could constitute career suicide,” Levi said of his support of Trump in a clip from the event shown on the talk show.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/whoopi-gets-heated-over-shazam-star-zachary-levis-trump-endorsement","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3375,w_6000,x_0,y_489/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1727821927/GettyImages-2171242171_pmnmqz","video":null,"publish_date":"2024-10-01 23:03:36","author":"Clay Walker","authors":["Clay Walker"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.058},{"id":258134688,"title":"Trump won’t participate in interview for ’60 Minutes’ election special","text":"NEW YORK (AP) — CBS News said Tuesday that Republican presidential nominee Donald Trump has declined to participate in an interview with “60 Minutes” for its election special, which will go forward next Monday with Democratic opponent Kamala Harris alone. Television’s top-rated news program regularly invites the two presidential contenders for separate interviews that air back-to-back on a show near the election. This year, it is scheduled for Monday instead of its usual Sunday time slot. Asked for comment, the former president’s campaign spokesman Steven Cheung said, “Fake news,” adding that there were discussions but nothing was ever locked in. “60 Minutes” said Trump’s campaign had initially agreed to an interview before telling CBS that the former president would not appear. The network said its invitation to sit for an interview still stands, and correspondent Scott Pelley will explain Trump’s absence to viewers. Vice President Harris will appear in a pretaped interviewed with Bill Whitaker. There are currently no other scheduled opportunities for voters to compare the two candidates together. Harris and Trump previously debated on Sept. 10. Although Harris has accepted an invitation from CNN for a second debate later this month, Trump has not accepted.. The interview special is scheduled to air Monday instead of the usual “60 Minutes” time slot because CBS is showing the American Music Awards on Sunday. Trump’s interview with “60 Minutes” correspondent Lesley Stahl prior to the 2020 election proved contentious, with the former president ending the session early and his campaign posting an unedited transcript of the session. CBS News was hosting Tuesday’s vice presidential debate between Republican Ohio Sen. JD Vance and Tim Walz, Minnesota’s Democratic governor. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"NEW YORK (AP) — CBS News said Tuesday that Republican presidential nominee Donald Trump has declined to participate in an interview with “60 Minutes” for...","url":"https://wsvn.com/news/politics/trump-wont-participate-in-interview-for-60-minutes-election-special/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/082124-North-Carolina-Trump.png","video":null,"publish_date":"2024-10-01 23:01:49","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.046},{"id":258134434,"title":"Vance, Walz VP debate live updates: Trump, Harris veep candidates face off in New York","text":"Ohio Sen. J.D. Vance and Minnesota Gov. Tim Walz are facing off at the vice presidential debate tonight. Former President Donald Trump claimed Walz is a “complete moron,” but predicted the debate would be “rigged” against his running mate Tuesday. Walz has said he’s “nervous” to debate Vance. Meanwhile, the GOP veep candidate is striking a confident note telling The Post he doesn’t have to “prepare that much.” The debate will feature live mics, unlike the previous two presidential debates. Play along with The Post’s official drinking game and bingo card.","summary":"Follow the Vice Presidential debate with live coverage from The Post","url":"https://nypost.com/2024/10/01/us-news/vance-walz-vp-debate-live-updates-fact-checking-reactions-analysis/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/waltz-vance-debate.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/SCxVl0EN-RyIcpnTz.mp4","publish_date":"2024-10-01 23:00:49","author":"Caitlin Doornbos,David Spector,Diana Glebova,Josh Christenson,Ryan King,Samuel Chamberlain,Victor Nava","authors":["Caitlin Doornbos","David Spector","Diana Glebova","Josh Christenson","Ryan King","Samuel Chamberlain","Victor Nava"],"language":"en","source_country":"us","sentiment":0.246},{"id":258134090,"title":"Letters: Cell phone ban | Natural burials | Harden networks | Equitable economy | Fighting fentanyl","text":"Schools must prepare students for phone limit Re: “Schools must limit student smartphone use by 2026” (Page B2, Sept. 24). While I understand the controversy and skepticism with this new law, I strongly encourage parents to collectively support our schools and advocate for these restrictions. We must educate our children and teenagers on the responsibilities of smartphone use and the mental health dangers it imposes on them. Although awareness and usage limitations should start in the home, we have a social responsibility to protect the overall well-being of young students in our communities. This is an opportunity for parents to come together with their school administrations to curate a restriction plan that is feasible for both families and teachers. As stakeholders in our students’ education, we must understand the serious complications overexposure to smartphone devices and social media causes on our young people’s minds. I hope the school administrations will build education awareness for parents and students as the first step in their restriction plans. Michaela Gonzales San Jose Natural burials would preserve Coyote Valley Re: “Despite need cemetery opponents unite” (Page B1, Sept. 26). Why not make this proposed site a natural burial ground? The deceased is washed, wrapped in clean cloth and placed in the ground in a natural setting to return to the Earth as nature intended. A small plaque marks the grave. No embalming, no sealing the body in an air-tight casket so it can rot slowly, no vast lawn to water, mow and maintain, and no crematorium to pollute the air with noxious fumes from the furnace. Of course, this would mean no big bucks for the funeral industry, but this vast swath of land in the Coyote Valley would stay the same as it is today. Lona Ingraham Santa Clara Cellular firms must harden their networks Re: “Bay Area emergency services, businesses proceed as usual despite Verizon outage” (Page B4, Oct. 1). Again today we saw a critical infrastructure fail. My phone was dead from 8:00 a.m. to 3:00 p.m., meaning no 911 calls could be made. And I’m sure the economic impact, although not yet known, could be astronomical. But this is not what concerns me. What scares the hell out of me is what will happen when the next big earthquake happens and the towers fall and the power fails. This could mean that phone service could be off for weeks or months. But we have no idea what Verizon has done. Our phone and internet service providers need to be required to harden their infrastructure against the worst possible earthquake and fire scenarios. They need to be fully transparent. They need to test their networks before the big one. Jim Koren Cupertino Equitable economy key to homelessness fight Re: “California goes to war against campers and encampments” (Page A7, Sept. 27). Joe Mathews criticizes politicians for working to shut down homeless camps. Ironically, it is loud criticism in the press over the last several years, building to a crescendo during the election season, that has politicians desperate to get the problem out of sight. The catch-22: Nobody wants to deal with the filth and crime, yet nobody with a heart wants others to suffer due to the high cost of housing. Further, nobody wants to pay higher taxes to build and maintain low-cost public housing, nor wants such housing in their neighborhoods. We ordinary folks who work, pay taxes and have a place to live are not the problem here. Extreme wealth and high-level corporate salaries, along with resistance among the wealthy to paying their fair share of taxes for a healthy, humane society, have created this mess. Only a reordering of our economy toward greater equality will solve the problem. Will Beatty San Jose Citizens must demand end to fentanyl death toll More than 73,000 people died from fentanyl in 2022. In an age of AI, drones, detection gadgets and the greatest military in the world cannot stop this. I call upon every citizen of this great country to rise and demand that our federal and state governments stop this daily carnage. We must harness our military, technology, border policing, public health education, international diplomacy and abundant resources to make this our national priority. We must flood our legislators and businesspeople with letters and calls to act immediately. Ultimately, our national elections are at hand, and Kamala Harris and Donald Trump must address this crisis. The ball is in our court. Do something. Kohli Singh San Jose","summary":"Mercury News Letters to the Editor for Oct. 2, 2024","url":"https://www.mercurynews.com/2024/10/01/letters-1888/","image":"https://www.mercurynews.com/wp-content/uploads/2022/06/hypatia-h_cc500f0d662f1060e65ae3e1d57d35d9-h_3c0d3d6c0ec5c12f1a5794e01b72a824.jpg?w=1024","video":null,"publish_date":"2024-10-01 23:00:07","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.333},{"id":258134082,"title":"‘Nostradamus’ who correctly predicted nearly every election reveals if Harris or Trump will win","text":"Historian and American University professor Allan Lichtman has revealed his predicted winner of the 2024 presidential election (Photo by Pedro Ugarte / AFP) (Picture: Getty Images) A historian dubbed the Nostradamus of US presidential elections for correctly predicting almost every outcome over four decades has revealed whether Kamala Harris or Donald Trump will win the 2024 race. American University professor Allan Lichtman, 77, dished out his forecast for the November election last month, based on a model centering on 13 keys to the White House. Lichtman’s keys turn a blind eye to polls and pundits, which are closely followed indicators as the November election nears. Instead, his keys were developed from 120 years of presidential election results and are called based on answering true-false questions around the performance of party currently in the White House. His 13 keys are: Midterm gains, incumbency, primary contest, third party, short-term economy, long-term economy, policy change, social unrest, White House scandal, incumbent charisma, challenger charisma, foreign policy failure and foreign policy success. Early last month, Lichtman had Harris losing only three keys – midterm gains, incumbency and incumbent charisma. The foreign policy failure and foreign policy success keys appeared shaky, but even if Harris lost them, she would have five false keys instead of six, which would deem her as the loser. ‘Even if both foreign policy keys flipped false, that would mean that there were only five negative keys, which would not be enough for Donald Trump to regain the White House,’ Lichtman told The New York Times. Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.","summary":"A historian dubbed the Nostradamus of presidential elections for correctly predicting nearly every race over four decades revealed his pick.","url":"https://metro.co.uk/2024/10/01/nostradamus-us-election-predictions-harris-trump-win-21716995/","image":"https://metro.co.uk/wp-content/uploads/2024/10/SEI_220752419-2de5.jpg?quality=90&strip=all","video":null,"publish_date":"2024-10-01 22:59:29","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.208},{"id":258134764,"title":"Vance repeated false claims about Haitian immigrants eating pets ahead of debate","text":"Vance repeated false claims about Haitian immigrants eating pets ahead of debate Former President Donald Trump's running mate, Ohio Sen. JD Vance, amplified false claims that Haitian immigrants in Springfield, Ohio are eating pets. The issue will likely arise when he takes the debate stage on Tuesday night. CBS News immigration and politics reporter Camilo Montoya-Galvez has more.","summary":"Former President Donald Trump's running mate, Ohio Sen. JD Vance, amplified false claims that Haitian immigrants in Springfield, Ohio are eating pets. The issue will likely arise when he takes the debate stage on Tuesday night. CBS News immigration and politics reporter Camilo Montoya-Galvez has more.","url":"https://www.cbsnews.com/video/vance-repeats-false-claims-haitian-immigrants-ohio-eating-pets-pre-debate/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/01/0c83a437-ab32-4c33-b97d-12d36a7fad94/thumbnail/1200x630/68f262891c5f01275cdf28d4b164b519/cbsn-fusion-vance-doubles-down-false-claims-immigrants-eating-pets-pre-debate-thumbnail.jpg?v=fa529222a2be3543711","video":null,"publish_date":"2024-10-01 22:58:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.327},{"id":258135068,"title":"Cash floods Michigan Senate race to boost Republican Mike Rogers","text":"Rogers, former chairman of the House Intelligence Committee, has seen north of $30 million pledged from conservative super PACs in recent days to prop up his campaign on the airwaves in the final stretch of a close election that could determine Senate control. The Senate Leadership Fund, aligned with Senate Minority Leader Mitch McConnell (R-KY), and the Great Lakes Conservative Fund have launched ad campaigns worth more than $22 million and $8 million, respectively. Although Rogers and his campaign are barred from coordinating with the groups under campaign finance laws, the support will enable him to either keep pace with or surpass Democratic spending for Slotkin as voters prepare to head to the polls. 2024 VICE PRESIDENTIAL DEBATE: VANCE AND WALZ TO GO TOE-TO-TOE IN CBS CONTEST Ads aired by Democrats for Slotkin so far total $49 million, with at least another $20 million in reservations, per ad-tracking firm AdImpact. Republicans sit at $39 million aired for Rogers so far and another $21 million reserved, though it appeared not all of the latest pledged super PAC money had yet been reserved. The cash dump came on the heels of Slotkin privately sounding the alarm about Democrats’ prospects in the Great Lakes State, telling donors that Vice President Kamala Harris was “underwater” in Michigan based on Slotkin’s internal polling. The Slotkin campaign did not respond to a request for comment about her remarks or the influx of conservative ad money against her. The Slotkin campaign has reacted to the new support for Rogers by highlighting it in email fundraising pitches. One of them warned that “Republicans are throwing everything they can at Michigan.” Another said McConnell and other Republicans were trying to “buy this election for our opponent” and requested a $3 donation. The Rogers campaign celebrated her “underwater” comments as a “terrible, horrible, no good, very bad day.” However, Slotkin still appears to have a steady polling edge. Candidates will often amplify the competitiveness of their race as a way to motivate donors and voters, making it difficult to decipher their true level of concern. Slotkin leads Rogers, backed by former President Donald Trump, by an average of nearly 5 points in recent surveys. Internal Republican polls have shown the two are far closer and within the margin of error. The seat is held by longtime Sen. Debbie Stabenow (D-MI), who is retiring after nearly 30 years in Congress and a lifelong career in politics.","summary":"Tens of millions of dollars are streaming into Michigan’s battleground “toss-up” Senate race for Republican nominee Mike Rogers just weeks before Election Day as he takes on Rep. Elissa Slotkin (D-MI). Rogers, former chairman of the House Intelligence Committee, has seen north of $30 million pledged from conservative super PACs in recent days to prop [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3173303/cash-floods-michigan-senate-race-to-boost-republican-mike-rogers/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/campaign-money-floods-michigan-senate-race-mike-rogers.webp","video":null,"publish_date":"2024-10-01 22:56:26","author":"Ramsey Touchberry","authors":["Ramsey Touchberry"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.087},{"id":258137706,"title":"Nuzzi accuses ex-fiancé of tipping off employer about alleged RFK Jr. affair","text":"Olivia Nuzzi is accusing her ex-fiancé of blackmail and harassment after revelations about her personal affairs raised questions into her ethics. The New York magazine writer's alleged relationship with former independent presidential candidate Robert F. Kennedy Jr. was tabloid fodder in September. Now she claims claimed that former partner Ryan Lizza, the chief Washington correspondent for Politico, leaked the news of her affair. CNN reported on Tuesday that Nuzzi is taking her former beau to court, accusing him of hacking her personal devices, shopping stories of her affair around to news organizations, and tipping off New York magazine. In a D.C. court filing made this week, Lizza “explicitly threatened to make public personal information about me to destroy my life, career, and reputation—a threat he has since carried out.” Nuzzi also reportedly accused Lizza of making threats of violence against her to get the reporter “to assume his share of financial responsibility” in a joint book deal between the two. Lizza, who broke off his engagement with Nuzzi and announced that he would no longer cover stories related to Kennedy for Politico, denied the allegations on Tuesday. “I am saddened that my ex-fiancée would resort to making a series of false accusations against me as a way to divert attention from her own personal and professional failings,” Lizza said in a statement to CNN’s Brian Stelter. “ I emphatically deny these allegations and I will defend myself against them vigorously and successfully.\" Kennedy, who has dropped out of the 2024 presidential election and endorsed former President Donald Trump, has denied the affair.","summary":"Reporter Olivia Nuzzi, who reportedly had fling with RFK Jr., accuses Politico chief ex of blackmail","url":"https://www.salon.com/2024/10/01/nuzzi-accuses-ex-fianc-of-tipping-off-employer-about-alleged-rfk-jr-affair/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2024/10/nuzzi.jpg ?>","video":null,"publish_date":"2024-10-01 22:53:50","author":"Griffin Eckstein","authors":["Griffin Eckstein"],"language":"en","source_country":"US","sentiment":-0.104},{"id":258133958,"title":"Donald Trump Cancels Interview With ‘60 Minutes,’ Network Says","text":"Former President Donald Trump has pulled out of a scheduled interview with CBS News’ 60 Minutes, the network said in a statement on Tuesday. The Republican nominee previously accepted an invitation to participate in the long running newsmagazine’s election special, which was scheduled to air on Monday, Oct. 7, the statement said. “After initially accepting 60 Minutes’ request for an interview with Scott Pelley, former President Trump’s campaign has decided not to participate,” the network said. “Pelley will address this Monday evening.” The announcement was made hours before the network was scheduled to air the vice presidential debate between Ohio Sen. JD Vance and Minnesota Gov. Tim Walz. Trump campaign spokesperson Steven Cheung disputed the claims in a post on X, insisting that the network “begged for an interview” but “nothing was ever scheduled or locked in.” The campaign referred the Daily Beast to Cheung’s post when contacted for comment. The program’s interview with Democratic nominee Vice President Kamala Harris will air on Monday as planned, the network said. 60 Minutes said their invitation to the Republican nominee still stands. Trump previously sat down for an interview with the program before the 2020 presidential election, where he raged against the questions asked by host Lesley Stahl before abruptly walking out. “When you started with me, your first statement was: ‘are you ready for tough questions?’ That’s no way to talk,” Trump told the host before a producer warned them they were running out of interview time. “I think we have enough of an interview here,” Trump told an aide. “That’s enough. Let’s go.”","summary":"CBS Photo Archive/GettyFormer President Donald Trump has pulled out of a scheduled interview with CBS News’ 60 Minutes, the network said in a statement on Tuesday.\n\nThe Republican nominee previously accepted an invitation to participate in the long running newsmagazine’s election special, which was scheduled to air on Monday, Oct. 7, the statement said.\n\n“After initially accepting 60 Minutes’ request for an interview with Scott Pelley, former President Trump’s campaign has decided not to participate,” the network said. “Pelley will address this Monday evening.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/donald-trump-cancels-interview-with-60-minutes-network-says","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1080,w_1920,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1727822559/donald_trump_60_minutes_taocyk","video":null,"publish_date":"2024-10-01 22:52:20","author":"Zachary Folk","authors":["Zachary Folk"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.353},{"id":258133962,"title":"SNL bans Harris and Trump cameos this year not to run afoul of election laws","text":"Saturday Night Live premiered its 50th season over the weekend, but don’t expect any presidential candidates to make any cameos on the show this election season. “You can’t bring the actual people who are running on because of election laws and the equal time provisions,” executive producer Lorne Michaels told The Hollywood Reporter. “You can’t have the main candidates without having all the candidates, and there are lots of minor candidates that are only on the ballot in, like, three states and that becomes really complicated.” Still, the variety show isn’t totally done with its famous cameos, a tradition which included Donald Trump hosting an episode in 2015. “Everybody knows what we do, and I think we’re going to do it again. It’s what we’re supposed to be doing,” Michaels added in his interview with the magazine. “So, what’s interesting is if you say to the people that we just did that to, ‘Do you want to come on because we have a way to do it with you in it?’ They almost always say yes.” In the meantime, political comedy fans will have to do with the show’s presidential stand-ins. During the season premiere, Saturday Night Live called on a mix of legendary former cast members, current performers, and outside comedians to represent the 2024 field. Former castmate Maya Rudolph handled impersonating Harris, while current member James Austin Johnson reprised his role as Trump and Bowen Yang took on JD Vance. Dana Carvey, meanwhile, took the stage as Biden and comedian Jim Gaffigan played a rambunctious Tim Walz. The show’s impressions have a way of becoming entangled in the political zeitgeist. Most famously, Tina Fey’s portrayal of Republican VP hopeful Sarah Palin as a ditzy oddball became perhaps more well-known than the actual candidate. Other famous Saturday Night Live presidential impressions include Carvey’s version of George H.W. Bush, which so delighted the then-president that the two became friends offstage.","summary":"SNL boss Lorne Michaels hasn’t ruled out political cameos forever though","url":"https://www.independent.co.uk/news/world/americas/us-politics/saturday-night-live-trump-harris-b2622295.html","image":"https://static.independent.co.uk/2024/10/01/23/AP24274509157755.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/g9BJcaX3-4VHSaSK0.mp4","publish_date":"2024-10-01 22:51:52","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.316},{"id":258136720,"title":"Harris ad mocks Trump's 'biggest failures'—including JD Vance","text":"A new ad released ahead of Tuesday night’s vice presidential debate brands Donald Trump’s running mate, Ohio Sen. JD Vance, as possibly tops on Trump’s list of “biggest failures.” The ad recaps Trump’s most notorious business failures, including Trump Shuttle (his airline that went under), Trump University (his fraudulent educational venture that ended up in lawsuits), Trump Steaks (which disappeared from store shelves), and Truth Social (his faltering social media network). It ends with a recap of the negative reception Vance has faced since Trump announced him as his pick for VP. A selection of audio clips play over footage of Vance, with snippets like “They think he’s the worst,” “weird,” “twisted,” and “creepy authoritarian.” The ad ends with the awkward exchange between Vance and a donut shop employee that went viral, with the unimpressed worker responding “okay” when Vance introduced himself and announced he is running for vice president. The rollout of Vance’s candidacy has not gone well for the GOP, but on Tuesday Republicans released a video promoting him along with the hashtag #HillbillyEnergy, a reference to his memoir “Hillbilly Elegy.” The video has a lot of work to do, as Vance’s favorability ratings have been underwater since he made his debut alongside Trump. In an aggregate of polls, Vance’s unfavorable rating outpolls his favorable rating by 11 points. By comparison, Minnesota Gov. Tim Walz, Vice President Kamala Harris’ running mate, has a net positive favorable rating, with favorable ahead of unfavorable by 3.7 percentage points. Much of Vance’s problem can be attributed to resurfaced comments he has made over the years. He complained that the Democratic Party is run by “childless cat ladies” and said people who choose not to have children are “psychotic.” Vance also promoted the false claim that Haitian immigrants in Springfield, Ohio, were stealing and eating people’s pets, even after officials reportedly told him the story was not true. Walz has been more closely associated with championing the rights of women and the LGBTQ+ community. One of his signature achievements in his home state of Minnesota was signing legislation that made school meals free. The Harris campaign also released an ad slated to air as part of the campaign’s $370 million ad buy in multiple states. Titled “Concepts of a Plan,” the ad focuses on Trump’s failure to articulate a vision on reforming health care during his disastrous debate performance against Harris. When he was in the White House, Trump tried to repeal the Affordable Care Act, aka Obamacare, along with congressional Republicans. His allies behind the extremist government blueprint known as Project 2025 have also suggested ideas like cutting health care coverage and curtailing access to abortion care. In several speeches, Vance has suggested that a second Trump administration would seek to “deregulate” health care. Democrats have responded to the idea by accusing Trump and Vance of scheming to undermine protections for preexisting conditions that were put in place under the Obama administration. The Biden-Harris administration reversed course from Trump and sought to expand coverage for people under the federal health care law. Harris was similarly the key swing vote that led to passage of the Inflation Reduction Act, which capped insulin costs and allowed Medicare to negotiate on drug costs for millions of consumers.","summary":"A new ad released ahead of Tuesday night’s vice presidential debate brands Donald Trump’s running mate, Ohio Sen. JD Vance, as possibly tops on Trump’s list of “biggest failures.”\n\n\n\nxNEW AD: Donald Trump has had a lot of failures...\n\nBut JD Vance might just be his biggest. pic.twitter.com/xJwNBY3AZ4\n\n— Kamala HQ (@KamalaHQ) October 1, 2024\n\n\n\nThe ad recaps Trump’s most notorious business failures, including Trump Shuttle (his airline that went under), Trump University (his fraudulent educational venture that ended up in lawsuits), Trump Steaks (which disappeared from store shelves), and Truth Social (his faltering social media network).\n\n\n\nIt ends with a recap of the negative reception Vance has faced since Trump announced him as his pick for VP. A selection of audio clips play over footage of Vance, with snippets like “They think he’s the worst,” “weird,” “twisted,” and “creepy authoritarian.”","url":"https://www.dailykos.com/story/2024/10/1/2274073/-Harris-ad-mocks-Trump-s-biggest-failures-including-JD-Vance?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1351387/story_image/GettyImages-2161724894.jpg?1727809184","video":null,"publish_date":"2024-10-01 22:50:06","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.083},{"id":258133556,"title":"Watch Live: JD Vance and Tim Walz Face Off in VP Debate","text":"JD Vance and Tim Walz will meet on Tuesday night for their first, and possibly only, vice presidential debate. This could be the final opportunity for both campaigns to make their case before the election.The debate in New York, hosted by CBS News, will give Vance, a Republican senator from Ohio, and Walz, a two-term Democratic governor of Minnesota, the chance to introduce themselves, support their running mates, and attack the opposing ticket.While vice-presidential debates typically have little effect on election outcomes, Tuesday's debate could have a greater impact. It offers both campaigns a final opportunity to sway undecided voters and make a lasting impression through their vice-presidential candidates. This may also be the last debate of the race, as the Harris and Trump teams have not agreed on another meeting.Watch LiveThe debate will be broadcast live on CBS and simulcast across other major news networks. Watch the event on Newsweek right here:What Time Is the Vice Presidential Debate?The debate between Vice President Kamala Harris and former President Donald Trump's running mates will air at 9 p.m. ET on October 1.Where Is the Debate Being Filmed?The debate will take place at the CBS Broadcast Center in Midtown Manhattan. CBS anchor and managing editor Norah O'Donnell and chief foreign affairs correspondent Margaret Brennan will moderate.What Are the Rules of Tonight's Debate?There will be no opening statements or a live audience, similar to the Harris-Trump debate in Philadelphia. However, unlike that debate, candidates' microphones will stay on, with CBS reserving the right to mute them if necessary.Each candidate will have two minutes to answer questions, two minutes for a response and a potential one-minute rebuttal. Moderators may grant additional time if needed. Candidates will be timed using lights and countdown clocks.Only the moderators seated at the front will ask questions. Candidates will not receive questions or topics in advance, and campaign staff cannot interact with them during breaks. No props or pre-written notes are allowed. Each candidate will only have a pen, pad and water bottle.Walz will stand at the podium on stage left, with Vance on the right. Both candidates will remain behind their podiums for the entire 90-minute debate.JD Vance vs Tim Walz: Debate StylesAlthough Vance is relatively new to politics compared to his opponents, he has quickly established himself as a proficient debater. He is known for his aggressive tactics and his ability to turn criticisms to his advantage.In debates, including his 2022 encounter with Tim Ryan, Vance demonstrated a knack for keeping opponents off balance by reframing their attacks. Ryan called Vance \"skilled\" and highlighted Vance's tactical and strategic approach to debates during an appearance on Slate's What Next podcast.Vance has earned a reputation for shifting the narrative in his favor by reframing criticisms, a technique that Ryan experienced firsthand. Ryan acknowledged Vance's ability to \"say whatever he needs to say to advance himself,\" indicating a flexible and opportunistic approach to public discourse, regardless of the truthfulness of his statements.Since joining Trump, Vance has become a prominent \"attack dog\" for the Republican campaign, frequently targeting Democrats and defending Trump against criticism. This aggressive style is something he's likely to bring to the stage during Tuesday's debate.Speaking to reporters last week, Vance said he didn't \"have to prepare that much\" for the debate because he had \"well-developed views on public policy.\"On the other hand, Walz is less known for his debating prowess. While he has experience as a two-term governor, his debate performances tend to lean more on his approachable, folksy demeanor. Walz is quick to defuse tough questions, though he can struggle to keep his temper in check when pressed on his record.Critics have occasionally referred to his responses in debates and press appearances as \"word salad,\" suggesting his answers are unclear and don't always reach a clear point.Walz has been rigorously practicing with Transportation Secretary Pete Buttigieg standing in as Vance. Others helping in the preparations include Rob Friedlander and Zayn Siddique, who helped Harris prepare for her debate with Trump, along with other aides to Walz and the campaign.What's at Stake for JD Vance and Tim Walz?Historically, vice-presidential debates have had minimal impact on election outcomes, and the campaigns for both JD Vance and Tim Walz have been managing expectations ahead of their debate.Despite some memorable moments from past vice-presidential debates, research shows that vice-presidential candidates tend to have a limited effect on voter decisions.Still, the debate will offer viewers a glimpse into the competing strategies of the two campaigns, with each candidate aiming to bolster their ticket's chances of winning the White House. As running mates often act as the \"attack dogs\" in campaigns, Vance and Walz are expected to adopt this role, aggressively going after the opposing ticket.","summary":"JD Vance and Tim Walz will meet on Tuesday night for their first, and possibly only, vice presidential debate.","url":"https://www.newsweek.com/vice-presidential-debate-watch-live-jd-vance-tim-walz-1962307","image":"https://d.newsweek.com/en/full/2485078/jd-vance-tim-walz.jpg","video":null,"publish_date":"2024-10-01 22:49:25","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","source_country":"US","sentiment":-0.04}]}