{"offset":0,"number":50,"available":9546,"news":[{"id":261997390,"title":"Watch Live: Trump holds rally in Milwaukee, Wisconsin","text":"New York Post\n\n See All Videos \n\nWatch Live: Trump holds rally in Milwaukee, Wisconsin\n\nNovember 1, 2024 | 8:58pm\n\nFormer President Donald Trump is set to hold a campaign rally at Milwaukee's Fiserv Forum, the site of his nomination at the RNC in July.\n\nLive coverage is scheduled for 9pm ET.\n\n Share thison","summary":"Former President Donald Trump is set to hold a campaign rally at Milwaukee&#8217;s Fiserv Forum, the site of his nomination at the RNC in July. Live coverage is scheduled for 9pm ET.","url":"https://nypost.com/video/watch-live-trump-holds-rally-in-milwaukee-wisconsin/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/trump.png?w=1200","video":null,"publish_date":"2024-11-02 00:58:29","author":"New York Post Video","authors":["New York Post Video"],"language":"en","source_country":"us","sentiment":0.247},{"id":261997486,"title":"What the papers say – November 2","text":"Reaction to Labour’s Budget continues to dominate the national press at the start of the weekend.\n\nThe Times says thousands of GP practices and care homes could be forced to close due to tax increases.\n\nThe i reports the Tories have polled ahead of Labour in the wake of Wednesday’s Budget.\n\nElon Musk has called on the PM to “leave the farmers alone” amid Labour’s inheritance tax raid on farmers, according to The Telegraph.\n\nThe Daily Express says pensioners who were stripped of their winter fuel benefits plan for “drastic cutbacks” to food and hot water.\n\nElsewhere, the Daily Mail reports the King has withdrawn the Duke of York’s annual £1 million “living allowance”.\n\nThe Guardian says Donald Trump’s campaign appears to be preparing to challenge the US election result if he loses.\n\nThe Independent leads with calls for aid following deadly flash flooding in Valencia.\n\nAnd the Daily Star says experts have claimed aliens are hiding under the sea on one of Uranus’s moons.","summary":"A wide range of stories feature across Saturday’s front pages.","url":"https://www.standard.co.uk/news/uk/budget-times-labour-tories-the-times-b1191606.html","image":"https://static.standard.co.uk/2024/11/02/00/161332471fcd46c59193fc138691df2dY29udGVudHNlYXJjaGFwaSwxNzMwNTk1MTk5-2.33243394.jpg?width=1200","video":null,"publish_date":"2024-11-02 00:57:27","author":"Pa Reporter","authors":["Pa Reporter"],"language":"en","source_country":"GB","sentiment":0.034},{"id":261997392,"title":"Greg Gutfeld Says Harris Has ‘The Guy Who Plays Tony Stark,’  But Trump Has ‘The Real Tony Stark,’  Elon Musk | Video","text":"Greg Gutfeld’s reaction to the stars of “The Avengers” endorsing Kamala Harris for president? The Fox News anchor quipped on Friday that while Harris has the backing of “the guy who plays Tony Stark” — i.e., Robert Downey Jr. — GOP rival Donald Trump has “the real Tony Stark, as in Elon Musk.”\n\n“This is a great contrast between the real and the imaginary: You have fictional Avengers, paid actors, siding with Harris and then you have real Avengers siding with Trump,” Gutfeld asserted in the latest episode of “The Five.”\n\nHe went on to tick off a list of people supporting Trump: Musk, Robert F. Kennedy Jr., Vivek Ramaswamy and Tulsi Gabbard, whom he described as a “murderer’s row of bada–es.”\n\nWatch the panel discussion on Fox News’ “The Five” in the video above. \n\nGutfeld continued, “So, you can have your imposters because they’re not real.” \n\nJesse Watters then weighed in to say, “If [the cast of ‘The Avengers’] came out and endorsed Trump, I’d say, ‘This is great. This is going to move voters,’ but now they’re doing it with Kamala, so I’m just going to blow it off.”\n\nJeanine Pirro chimed in, “What makes actors think we give a damn about what they think?” She asked, “Did it do Hillary Clinton any good” that she was backed by celebs — including the film’s stars Downey, Mark Ruffalo, Don Cheadle and Scarlett Johansson — in 2016.\n\nJessica Tarlov, the lone liberal panelist on “The Five,” said that the value of actor endorsements is “you trot them out if you have them.”\n\nMeanwhile, Gutfeld insisted, “You guys don’t understand what I just said. The Republicans have the actual Avengers. These are just the imposters, come on people.”\n\nHe did not go on to elaborate on, say, which “real Avenger” RJK Jr. is — Thor? Hawkeye? Captain America? Hank Pym? — at least not in the clip shared to YouTube.","summary":"The Fox News host responds to Thursday's VP endorsement from the stars of \"The Avengers\"\n\n\nThe post Greg Gutfeld Says Harris Has &#8216;The Guy Who Plays Tony Stark,&#8217;  But Trump Has &#8216;The Real Tony Stark,&#8217;  Elon Musk | Video appeared first on TheWrap.","url":"https://www.thewrap.com/greg-gutfeld-avengers-harris-elon-musk-real-tony-stark/","image":"https://www.thewrap.com/wp-content/uploads/2024/11/rdj-elon-musk.jpg","video":null,"publish_date":"2024-11-02 00:54:33","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","source_country":"US","sentiment":0.081},{"id":261997072,"title":"Danica Patrick Takes Bold Stance on Taylor Swift's 'Surivival' Support of Kamala Harris","text":"Former NASCAR and IndyCar driver Danica Patrick has branded celebrity endorsement of Vice President Kamala Harris from the likes of Taylor Swift and Eminem as \"survival\" ahead of the 2024 Presidency campaign where Harris is going up against Donald Trump.Patrick shared her perspective in a reposted Instagram reel which discusses celebrity endorsement of the Vice President. The former driver simply commented:\"Watch it to the end. [Kamala's] support is not a passion, it is survival.\"The reel Patrick shared, originally from Lennie Moreno, claimed that many celebrities who have voiced support for Harris have yet to follow through with any of their public appearances and that their support is not authentic. Moreno questioned such actions, labeling them as \"non-organic.\"He also noted that actor Leonardo Di Caprio, who has supported Kamala Harris, has connections to controversial celebrity figures, such as Sean \"Diddy\" Combs.Patrick has openly supported Trump in the upcoming 2024 U.S. Presidential Election. However, she recently revealed that this is the first time she has voted. She explained, as previously reported by Newsweek Sports:\"I just want to say I've never voted before, but this time around, I have to vote. It's that important.\"The person that runs this country should ultimately be running it very much like a business. I can't really think of a better businessman than Donald Trump,\" Patrick said.\"A guy like that who has been in business as long as he has, he's gonna go into that room and he's gonna get stuff done. That's what we need, a president who is actually going to make changes happen.\"Patrick also made a speech at a Trump rally in Las Vegas.\"People didn't like that. People looked at me like I was some radical right-wing MAGA. MAGA has got this awful connotation to so many people and you know what? All it did was light a fire,\" she commented.\"I will not be judged to live in America, be a proud American, say 'I love America', and want to make America great again. I won't be judged for it. Instead of quieting down, I am gonna get louder!\"I was raised in a middle-class family. My parents love their garden; they still do. But my parents instilled really good values in me. Instilled values to dream really big, to be honest, and to work hard.\"Note: All opinions from Danica Patrick are her own.","summary":"Danica Patrick criticizes Taylor Swift's endorsement of Kamala Harris, questioning the authenticity of celebrity political support.","url":"https://www.newsweek.com/sports/racing/danica-patrick-takes-bold-stance-taylor-swifts-surivival-support-kamala-harris-1979025","image":"https://d.newsweek.com/en/full/2510586/danica-patrick.jpg","video":null,"publish_date":"2024-11-02 00:50:48","author":"Lydia Mee","authors":["Lydia Mee"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.073},{"id":261996898,"title":"Figures, Dobson make closing pitches to voters in Alabama congressional race","text":"MONTGOMERY, Ala. (AP) — The two candidates for Alabama’s 2nd Congressional District, which was redrawn by a federal court after a lengthy redistricting battle, made their final campaign pushes this week, seeking to drive turnout in the race that could play a role in the battle for control of the U.S. House of Representatives.\n\nThe once safe Republican seat was reshaped after a federal court ruled Alabama had illegally diluted the power of Black voters. The non-partisan Cook Political Report ranks the new district, where Black voters make up nearly 49% of the voting-age population, as “likely Democrat.” But both campaigns have said the seat is competitive.\n\nIn their closing messages, both candidates emphasized a push for voter turnout.\n\nStanding near a statue of Rosa Parks in downtown Montgomery, Shomari Figures, the Democratic nominee, on Thursday called the race an opportunity to build upon the progress of the civil rights movement. Figures, the son of a civil rights attorney and Alabama legislator, worked as a top aide to U.S. Attorney General Merrick Garland and as an aide in the Obama White House.\n\n“When you grow up in Mobile and in Alabama you learn very very early in life the role that the federal government has had to play in making the state do right by its people,” Figures said during a stop in Mobile.\n\nFigures has emphasized the need to work on longstanding problems with health care, infrastructure and education, often noting that Alabamians have among the lowest life expectancies in the nation.\n\n“We’re going to win this thing. But the goal is not to win. The goal is to do the work,” he said.\n\nFormer President Barack Obama recorded a message encouraging voters to support Figures. “America needs you to lead the charge for change once again,” Obama said in the message that also invoked the state’s civil rights history.\n\nU.S. House Minority Leader Hakeem Jeffries traveled to Alabama to support Figures as Democrats eye an opportunity to flip the Deep South seat.\n\nRepublican Caroleene Dobson has emphasized concerns about inflation and immigration, issues that she said are worries for families across the political spectrum. On Friday, she greeted the breakfast crowd at a popular Montgomery deli.\n\nThe race is about turnout, she told supporters. “I think now is an opportunity for the people of this district to really send a message to Washington. We don’t want more of the status quo.” Dobson said afterward.\n\nDobson, a real estate attorney, has repeatedly called Figures a “Washington insider.”\n\n“What’s consistent in every conversation that I have throughout the district is that we cannot sustain another four years of high prices and rising crime. And it’s not just that my opponent doesn’t have solutions to these problems, he helped put in place policies that have caused these problems,” Dobson said.\n\nThe Alabama Republican Party sent out a series of controversial mailers attempting to attack Figures. One about a Department of Justice clemency initiative had a large mug shot of a Black man arrested on a 2023 drug trafficking charge with text saying that Figures “supports releasing dangerous criminals.”\n\nFigures in a statement called the ads an attempt at “race-baiting.”\n\n“If the Republican party wanted to send out a mailer of a criminal, they should’ve put out a mailer with Donald Trump on it,” Figures added.\n\nAlabama Republican Party Chairman John Wahl defended the mailers, saying that “crime affects people of all backgrounds, and every victim deserves justice, regardless of race.”\n\nThe mailers were sent by the state party and not the Dobson campaign.\n\nDuring the Friday campaign stop, Charlie Trotman, a Montgomery real estate developer, told Dobson that she had his vote.\n\n“She is to me somebody I would be very proud to represent us. I think she is smart,” Trotman said.\n\nIn Mobile, Shalela Dowdy, one of the Black voters who challenged the state’s prior congressional map, called the election the “fight of our lives” but said that she is cautiously optimistic.\n\nDowdy, a graduate of the U.S. Military Academy at West Point, said she joined the litigation because the needs of Black communities were being ignored. She said the district is now drawn so the winner will have to be responsive to all communities, both Black and white.\n\n“It will provide them a seat at the table, to have a voice and not be forgotten about,” Dowdy said.\n\nAssociated Press writer Safiyah Riddle contributed to this report.","summary":"MONTGOMERY, Ala. (AP) — The two candidates for Alabama’s 2nd Congressional District, which was redrawn by a federal court after a lengthy redistricting battle, made their final campaign pushes this week, seeking to drive turnout in the race that could…","url":"https://www.thestar.com/news/world/united-states/figures-dobson-make-closing-pitches-to-voters-in-alabama-congressional-race/article_88554b98-5e29-5d2d-a2e1-74b6e17afa32.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/e/af/eaf5b0b5-5884-5974-99b3-6fc468f1705e/6725760d0e593.image.jpg?crop=1280%2C672%2C0%2C93&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2024-11-02 00:43:49","author":"By Kim Chandler The Associated Press,Wire Content","authors":["By Kim Chandler The Associated Press","Wire Content"],"language":"en","source_country":"CA","sentiment":-0.068},{"id":261996784,"title":"Kamala Harris' Indian aunt says U.S. vice president shaped by immigrant mom's values","text":"U.S. Vice President Kamala Harris' Indian aunt Sarala Gopalan believes her niece, the Democratic nominee for the Nov. 5 presidential election, was shaped by her late mother's self-reliance and sense of justice.\n\nHarris, the daughter of Indian and Jamaican immigrants, would become the first woman to serve as president of the United States if she defeats Republican nominee Donald Trump.\n\nGopalan, an 80-year-old retired doctor in Tamil Nadu state in southern India, said her older sister Shyamala Gopalan, who arrived in the United States to study medicine in 1958 and became a breast cancer researcher, was a major influence on Harris.\n\n\"My sister had definite views...In fact, way back when she went to the United States, nobody would dream that from a South Indian family, a girl of 18 or 19 would go to the USA to study,\" Gopalan told Kyodo News in her modest apartment in a suburb of the state capital Chennai late last month.\n\nShyamala, then a science major student in New Delhi, made the decision by herself to study abroad and applied for a scholarship, according to Gopalan.\n\n\"My sister got all that without any help,\" she said. \"She encouraged her daughters also to grow up in that way,\" Gopalan said about Harris and her sister Maya.\n\nHarris, 60, was born to Shyamala and Donald Harris, a Jamaican economist, whom Shyamala met when joining the civil rights movement.\n\nIn a speech at the Democratic National Convention in August when she formally accepted the party's nomination following President Joe Biden's withdrawal from the presidential race, Harris noted she had mostly been raised by her mother after her parents divorced when she was in elementary school.\n\n\"She taught us to never complain about injustice, but do something about it,\" Harris said in reference to her mother.\n\nGopalan said Shyamala never accepted injustice.\n\n\"She would tell them (her daughters) they must fight for the right and do the right things and look after people,\" Gopalan said.\n\nAfter Shyamala died in 2009 following colon cancer, Harris flew to Chennai to scatter her mother's ashes in the Bay of Bengal, together with Gopalan and other relatives.\n\nHarris respects her family members from India, Gopalan said, noting that she wrote about her Indian family among others in a picture book called \"Superheroes Are Everywhere\" about those who had influenced her.\n\n\"It's a nice concept where she tried to explain we can learn something from everyone around us,\" she said.\n\nIn early October this year, Gopalan contacted Harris.\n\n\"During the call, I told her, joking, that I'm losing my identity because everybody calls me Kamala's 'chitti' (meaning aunt in the Tamil language) and they don't know my real name. So she laughed and said 'Nothing to worry about',\" she said.\n\nWhen asked about her expectations for the presidential election, Gopalan only said she believes her niece is doing a great job in achieving a milestone in her life.\n\n\"If my health permits, and if she becomes president, I will go (to the inauguration ceremony), but it's not that I will not visit her if she doesn't become president. I will visit her. She's family,\" Gopalan said.\n\nRelated coverage","summary":"CHENNAI, India - U.S. Vice President Kamala Harris' Indian aunt Sarala Gopalan believes her niece, the Democratic nom...","url":"https://english.kyodonews.net/news/2024/11/54d53db14b08-us-vice-pres-harris-shaped-by-immigrant-moms-values-indian-aunt.html","image":"https://img.kyodonews.net/english/public/images/posts/720141bd02dcd3e61cede7f55e54d269/photo_l.jpg","video":null,"publish_date":"2024-11-02 00:42:34","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":-0.048},{"id":261996792,"title":"AI chatbots aren’t reliable for voting information, government officials warn","text":"With four days until the presidential election, U.S. government officials are cautioning against reliance on artificial intelligence chatbots for voting-related information.\n\nIn a consumer alert on Friday, the office of New York Attorney General Letitia James said it had tested “multiple AI-powered chatbots by posing sample questions about voting and found that they frequently provided inaccurate information in response.”\n\nElection Day in the U.S. is Tuesday, and Republican nominee Donald Trump and Democratic Vice President Kamala Harris are locked in a virtual dead heat.\n\n“New Yorkers who rely on chatbots, rather than official government sources, to answer their questions about voting, risk being misinformed and could even lose their opportunity to vote due to the inaccurate information,” James’ office said.\n\nIt’s a major year for political campaigns worldwide, with elections taking place that affect upward of 4 billion people in more than 40 countries. The rise of AI-generated content has led to serious election-related misinformation concerns.\n\nThe number of deepfakes has increased 900% year over year, according to data from Clarity, a machine learning firm. Some included videos that were created or paid for by Russians seeking to disrupt the U.S. elections, U.S. intelligence officials say.\n\nLawmakers are particularly concerns about misinformation in the age of generative AI, which took off in late 2022 with the launch of OpenAI’s ChatGPT. Large language models are still new and routinely spit out inaccurate and unreliable information.\n\n“Voters categorically should not look to AI chatbots for information about voting or the election — there are far too many concerns about accuracy and completeness,” Alexandra Reeve Givens, CEO of the Center for Democracy & Technology, told CNBC. “Study after study has shown examples of AI chatbots hallucinating information about polling locations, accessibility of voting and permissible ways to cast your vote.”\n\nIn a July study, the Center for Democracy & Technology found that in response to 77 different election-related queries, more than one-third of answers generated by AI chatbots included incorrect information. The study tested chatbots from Mistral, Google, OpenAI, Anthropic and Meta.\n\n“We agree with the NY Attorney General that voters should consult official channels to understand where, when, and how to vote,” an Anthropic spokesperson told CNBC. “For specific election and voting information, we direct users to authoritative sources as Claude is not trained frequently enough to provide real-time information about specific elections.”\n\nOpenAI said in a recent blog post that, “Starting on November 5th, people who ask ChatGPT about election results will see a message encouraging them to check news sources like the Associated Press⁠ and Reuters⁠, or their state or local election board for the most complete and up-to-date information.”\n\nIn a 54-page report published last month, OpenAI said that it’s disrupted “more than 20 operations and deceptive networks from around the world that attempted to use our models.” The threats ranged from AI-generated website articles to social media posts by fake accounts, the company wrote, though none of the election-related operations were able to attract “viral engagement.”\n\nAs of Nov. 1, Voting Rights Lab has tracked 129 bills in 43 state legislatures containing provisions intended to regulate the potential for AI to produce election disinformation.\n\nWATCH: More than a quarter of new code is now AI-generated","summary":"New York Attorney General Letitia James speaks during a press conference at the Office of the Attorney General in New York on February 16, 2024.  Timothy A. Clary &#124; AFP &#124; Getty Images With four days until the presidential election, U.S. government officials are cautioning against reliance on artificial intelligence chatbots for voting-related information. In &#8230;\n\n\nThe post AI chatbots aren&#8217;t reliable for voting information, government officials warn appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/ai-chatbots-arent-reliable-for-voting-information-government-officials-warn/","image":"https://image.cnbcfm.com/api/v1/image/107375134-1708124974098-gettyimages-2008851470-AFP_34JL8VL.jpeg?v=1708125026&w=1920&h=1080","video":null,"publish_date":"2024-11-02 00:39:06","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.279},{"id":261996932,"title":"Mideast conflict has some Democrats in Michigan turning away from Harris","text":"Ann Arbor, Michigan — Hind Omar is a Palestinian-American mother from Ann Arbor, Michigan. She and her husband Andrew are longtime Democrats who feel let down by the party and President Biden.\"We canvassed for Biden,\" Omar said. \"We showed up for Biden. And this experience during his administration under his watch has been a betrayal.\"Since the Oct. 7 attack by Hamas militants on Israel, which killed about 1,200 people, more than 43,000 Palestinians have been killed in Gaza by Israel's retaliatory assault, according to the Hamas-run Gaza Health Ministry, which does not differentiate between civilian and combatant casualties. Watching the ongoing war in Gaza has prompted Hind and her entire family to consider leaving the presidential box on the ballot blank. \"Where the Democratic Party used to be the soft place that we would land, it has now become the aggression against our community,\" Hind said. It's a major vulnerability for Vice President Kamala Harris, who has been criticized for a lack of outreach to the community. Her speech this week in Ann Arbor was interrupted by a group protesting the war. \"We all want this war to end as soon as possible and to get the hostages out,\" Harris told the crowd Monday. \"And I will do everything in my power to make it so.\"While the Biden administration has pushed for a cease-fire in the war, it has also maintained its steady support of Israel, and in August it approved $20 billion in arms sales for the Israeli military. In an interview with \"60 Minutes\" last month, Harris said that \"Israel has a right to defend itself,\" but added that \"far too many innocent Palestinians have been killed. This war has to end.\" Four years ago, President Biden won Michigan by just over 150,000 votes. Now, the over 200,000 largely disillusioned Arab and Muslim American voters in this battleground state could swing the election to former President Donald Trump, who has said Israel should \"finish what they started.\"Hind said she is not comfortable with the fact that an uncommitted vote could lead to a Trump victory because \"that administration will be staunchly worse for our community.\"However, she feels betrayed by the Biden administration. \"This level of betrayal, no one even saw it coming, and so that's what people are reconciling with right now,\" Hind said.Among those reconciling that is Joshua Feinstein, a Jewish American Democrat who has family in Lebanon, where the militant group Hezbollah is based. Israel and Hezbollah have been regularly engaged in rocket and missile attacks since last year, but the situation escalated in September, when Israel began launching strikes on Beirut, before beginning a limited ground incursion into Lebanon. \"I speak to them daily,\" an emotional Feinstein said of his family. \"They are being bombed.\"Israel's invasion of Lebanon has pushed Feinstein to vote for the Green Party's Jill Stein over Harris. \"I'm not voting to punish anyone,\" Feinstein said. \"I'm not making a protest. I'm saying my vote hasn't been earned.\" Now, this group of powerful voters are sending what they call a final message. \"You are not committed to us,\" Feinstein said. \"We will not be committed to you.\"","summary":"The Israel-Hamas war is a major vulnerability for Vice President Kamala Harris, who has been criticized for a lack of outreach to the Arab American community.","url":"https://www.cbsnews.com/news/mideast-conflict-has-some-democrats-in-michigan-turning-away-from-harris/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/02/106fa565-462f-4f35-8be3-4b9f165805ea/thumbnail/1200x630/7c82219aa60343fa41c972d67d2caae1/gettyimages-2182368968.jpg?v=379420b9063a2aadbcd559df18e2d1ae","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3308883_hls/master.m3u8","publish_date":"2024-11-02 00:36:00","author":"Shanelle Kaul","authors":["Shanelle Kaul"],"language":"en","category":"politics","source_country":"US","sentiment":-0.494},{"id":261996506,"title":"Here’s why we have an Electoral College and who’s in it","text":"Electoral conquest\n\nVoting is underway and Election Day is Tuesday, so here’s a primer on the fight to reach 270 votes in the Electoral College.\n\nCreating the Electoral College\n\nThe term “Electoral College” does not appear in the Constitution. Article 2 of the Constitution and the 12th Amendment refer to electors but not to an Electoral College.\n\nSince the Electoral College process is part of the original design of the Constitution, it would be necessary to pass a constitutional amendment to change this system.\n\nThe Electoral Count Act of 1887 came as a reaction to the presidential election of 1876, in which Democrat Samuel Tilden won the popular vote but lost the presidency to Republican Rutherford B. Hayes because of contested election results in three Southern states under the control of Reconstruction governments.\n\nCongress had no rules in place to deal with such a scenario, so it created an ad hoc commission to decide the presidency and then passed the 1887 law to avoid similar situations in the future.\n\nIf a state finalizes its results six days before the Electoral College vote, according to the Electoral Count Act, those results qualify for “safe harbor” status — meaning Congress must treat them as “conclusive” results, even if, for example, a state’s legislature sends in a competing set of results.\n\n2020 and 2024 differences\n\nThe Electoral College will meet Dec. 17 to cast the votes for president and vice president of the United States.\n\nThirteen states gained or lost electoral votes following the 2020 census: Texas gained two; Colorado, Florida, Montana, North Carolina and Oregon each gained one; and California, Illinois, Michigan, New York, Ohio, Pennsylvania and West Virginia each lost one.\n\nWho are the electors\n\nEach candidate running for president in your state has their own group of electors, known as a slate. The slates are generally chosen by the candidate’s political party in each state, but state laws vary on how the electors are selected and what their responsibilities are.\n\nThe electors meet in their respective state capitals on the Tuesday after the second Wednesday of December to cast their votes.\n\nYou can find an American Bar Association article on 700 proposals to reform the Electoral College here.\n\nHow close was 2020\n\nDemocrat Joe Biden won Pennsylvania by just 1.2 percentage points, Wisconsin by six-tenths of a percentage point, Arizona by about a third of a percentage point and Georgia by a quarter of a percentage point. In those states combined, Biden beat incumbent President Donald Trump by fewer than 125,000 votes out of 18.5 million cast.\n\nPast elections\n\nYear | Winner | Loser\n\n2016 | Donald Trump 306 | Hillary Clinton 227\n\n2012 | Barack Obama 332 | Mitt Romney 173\n\n2008 | Barack Obama 365 | John McCain 173\n\n2004 | G.W. Bush 286 | John Kerry 251\n\n2000 | G.W. Bush 271 | Al Gore 266\n\n1996 | Bill Clinton 379 | Bob Dole 159\n\n1992 | Bill Clinton 370 | G.H.W. Bush 168\n\n1988 | G.H.W. Bush 426 | Michael Dukakis 111\n\n1984 | Ronald Reagan 489 | Walter Mondale 13\n\n1980 | Ronald Reagan 297 | Jimmy Carter 240\n\nFive smallest margins\n\n(Since 1824)\n\nYear | State | Winning margin\n\n2000 | Florida | 0.009%\n\n1832 | Maryland | 0.0104\n\n1904 | Maryland | 0.0227\n\n1912 | California | 0.0257\n\n1892 | California | 0.0545\n\nHow long for results?\n\nYear | Winner | Days\n\n2000 | Bush 36 | (Gore concedes Dec. 13.)\n\n2004 | Bush | 1 day\n\n2008 | Obama | Election night\n\n2012 | Obama | Election night\n\n2016 | Trump | Election night\n\n2020 | Biden | 41 days (Nov. 3-Dec. 14, however Trump did not publicly concede until Jan. 7.)\n\nElectoral vote history\n\nHow much electoral clout each state has had and what party its electors voted for, organized by mostly Republican on top to mostly Democratic below.\n\nSources: The Associated Press, The Wall Street Journal, Pew Research Center, The National Archives, The Office of the Federal Register, Bipartisanpolicy.org, The Cook Political Report","summary":"You might be surprised at how many attempts to reform the Electoral College there has been.","url":"https://www.ocregister.com/2024/11/01/heres-why-we-have-an-electoral-college-and-whos-in-it/","image":"https://www.ocregister.com/wp-content/uploads/2024/11/electoral-top.jpg?w=1024","video":null,"publish_date":"2024-11-02 00:33:09","author":"Kurt Snibbe","authors":["Kurt Snibbe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.216},{"id":261996564,"title":"Paper headlines: King cuts off Andrew and tax blow for care homes","text":"A range of stories are on the front of Saturday’s front pages including one about King Charles who is pictured on the front of the Daily Mail next to his younger brother Prince Andrew. Quoting a new royal biography, the paper says the King has “severed” Andrew’s annual personal allowance – quoted as being around “£1m-a-year”. The Daily Telegraph reports that Elon Musk has attacked the Chancellor’s Budget announcement of an inheritance tax on farmers’ agricultural land. In a post on X the world’s richest man said, We should leave the farmers alone. The paper also reports the King has ordered Prince Andrew’s allowance be stopped. In other news, a photo in the Times – of an extraordinary, twisted mass of multiple ruined cars blocking a tunnel entrance in Valencia – brings home the devastating effect of the catastrophic floods in Spain. “Tories inch ahead in poll after Labour hit by Budget backlash,” the i newspaper’s headline says. The paper leads with research from a polling company which says the Conservatives have regained a poll lead over Labour for the first time in three years in the wake of the autumn Budget. With just days to go until Americans go to the polls for the 2024 US presidential election, the Guardian carries a special edition which has 33 of the most iconic images of presidents – including an iconic picture of Ronald Reagan kissing First Lady Nancy Reagan. The paper leads with a story that Republicans are laying the ground for rejecting the result of next week’s election in the event Donald Trump loses. Broadcaster Vanessa Feltz smiles on the front of the Daily Express as she tells of her “delight” with her new radio show. Elsewhere, the chancellor has been hit by fresh criticism after shock poll results revealed pensioners stripped of winter fuel cash plan “drastic cutbacks” to food and hot water, the tabloid reports. Paris Fury is on the front of the Daily Mirror as the paper says she has opened up about the heart-breaking miscarriage she endured ahead of husband Tyson Fury’s crucial world heavyweight boxing clash in Saudi Arabia against Oleksandr Usyk. Elsewhere, another boxing legend, Barry McGuigan, is on the front with his fist up as it is confirmed he will be entering the I’m A Celeb jungle. Finally, the Daily Star has a photo of Portugese manager Ruben Amorim after news emerged on Friday he had been appointed as Manchester United’s new head coach.","summary":"A range of stories are on the front of Saturday&#8217;s front pages including one about King Charles who is pictured on the front of the Daily Mail next to his younger brother Prince Andrew. Quoting a new royal biography, the paper says the King has &#8220;severed&#8221; Andrew&#8217;s annual personal allowance &#8211; quoted as being around &#8230;\n\n\nThe post Paper headlines: King cuts off Andrew and tax blow for care homes appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/paper-headlines-king-cuts-off-andrew-and-tax-blow-for-care-homes/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/2180/live/273e7620-98a7-11ef-82c3-45a801b7330b.png","video":null,"publish_date":"2024-11-02 00:33:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.289},{"id":261996804,"title":"Crucial Elections Are Approaching, At Home And Abroad","text":"HomeAnalysisCrucial Elections Are Approaching, At Home And Abroad\n\nCrucial Elections Are Approaching, At Home And Abroad\n\nRarely have two elections had such significance for India at home and the world at large\n\nK C SinghUpdated: Saturday, November 02, 2024, 04:16 AM IST\n\nRepresentative Image | Freepik\n\nNovember brings two crucial elections with consequences, at home and abroad. The result of the November 5 US presidential election will have local and global significance. Former president Donald Trump’s political polarisation of the US has degenerated to the point where he is directly threatening his political opponents and critics, even with the use of the US military. By comparison, during the 2016 election his repetitive chants of “jail her”, to target his opponent Hillary Clinton, were more ill-mannered rhetoric than a serious punitive threat. He left her alone after his win.\n\nHowever his electoral loss in the 2020 election and incitement of a mob on January 6, 2021 to invade the Capitol Hill, spells the danger he now presents to US democracy. His continuing refusal to accept defeat undermines a basic democratic principle i.e. orderly transfer of power. The current presidential election has many unprecedented elements. An incumbent president’s withdrawal and replacement by the vice president just four months before the poll is sui generis. In fact former president Donald Trump kept bemoaning the substitution as if he expected some referee to blow the whistle.\n\nHigh polarisation over the past many decades has reduced the US presidential election to really a race in six or seven “swing states” like Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania, and Wisconsin. Interestingly, Republicans launched election challenges in 2020-21 in some of these states. Arizona, bordering Mexico, brings into play two key themes: the Republican charge of Democrats mishandling immigration; and the Democrats alleging the denial of reproductive rights to women. Michigan puts Democrats on the defensive over inability or unwillingness to control Israel’s military action in Gaza, and now Lebanon, causing destruction and mayhem due to the indiscriminate bombing of civilian areas. Michigan has the country’s largest population of Arab-Americans. Vice President K Harris has tried to distance herself from President Biden’s indulgence of Israeli PM Benjamin Netanyahu. However, her tacit acceptance of Biden’s policy since October 7, when Hamas attacked Israel, makes complete detachment difficult without appearing opportunistic.\n\nHowever, VP Harris’ massive funds collection and a disciplined campaign enabled quick catchup with Trump. Trump’s indisciplined messaging and predilection for crude political jibes and half-truths kept him from capitalising the anti-incumbency of the Biden presidency. Just as the contest was evenly poised, Trump’s New York Rally at the Madison Square Garden, in a solidly pro-Democrat state, produced multiple blunders. A stand-up comedian called Puerto Rico a floating garbage dump. With more than 472,000 Puerto Ricans in Pennsylvania the faux pas may help Harris bag that crucial state.\n\nBaba Siddique Murder Case: 20 Days After Gunning Down NCP Leader, Key Accused Remain At Large\n\nMumbai: Santacruz Chembur Link Road Extension Set To Open In January 2025\n\nMumbai: BMC Targets Major Tax Defaulters With 3,564 Properties Valued At ₹2,237 Crore; No Auctions In 10 Years\n\nSalman Khan Residence Firing Case: Mumbai Police Prepares Extradition Dossier For Jailed Gangster Lawrence Bishnoi's Brother Anmol Bishnoi, Allegedly In Canada\n\nHowever, unlike Biden in 2020, Harris finds going tough in Georgia. In neighbouring North Carolina, which Trump won, matters look better for Democrats.\n\nAll told, with billionaires like Elon Musk forcefully supporting Trump the battle is not just racially polarised but economically too. If Trump wants to impale his critics and political foes, even Musk and other pro-Trump billionaires may face greater scrutiny if Trump loses.\n\nIn his Indian diaspora outreach, Trump promised to “protect Hindu Americans against the anti-religion agenda of the radical left”. He added he would “strengthen our great partnership with India and my good friend, Prime Minister Modi”. He was endorsing the Hindutva-based polarisation, which the Indian diaspora has undergone in the last decade. The Biden administration on the other hand, alongside Canada, is investigating an alleged Indian government-sponsored conspiracy to target US and Canadian citizens of Sikh faith.\n\nLater in November another crucial election is scheduled to decide who rules Maharashtra. The constitutional distortions created by the governments in Mumbai and Delhi and judicial inaction have left a vital state in limbo. The electoral outcome has national significance as a loss in Maharashtra will put the NDA government on the defensive right before the Bihar election.\n\nA win by the ruling dispensation in Maharashtra should steady the ruling NDA alliance nationally. BJP’s confident posturing since May, hardly justified by their Lok Sabha performance, can get a boost from a win in India’s financial capital. A loss can trigger doubts amongst BJP’s allies.\n\nInternationally, a Trump win should shift the US focus from the Pannun-Nijjar issue. As a transactional creature, he is likely to seek financial and commercial advantages. Vice President Kamala Harris instead may be more focused on protecting human rights and democratic principles. Joe Biden entered the White House promising to advance them but residual COVID-caused distractions and two wars upended his agenda. Ms Harris may resume that task with vigour. Her initial focus would be to control Israeli PM Netanyahu and enforce a West Asian ceasefire. Similarly she would signal to Russian president V Putin the US commitment to help Ukraine sustain its fightback until ceasefire and talks are mutually acceptable. A Trump presidency may produce a more idiosyncratic approach to these issues, with indeterminate outcomes.\n\nThus electoral results in the next four weeks can have historic consequences. Rarely have two elections had such significance for India at home and the world at large.\n\nKC Singh is former secretary, Ministry of External Affairs\n\nFollow us on\n\nRECENT STORIES\n\nGisele Pelicot: A Rare Kind Of Courage\n\nCrucial Elections Are Approaching, At Home And Abroad\n\nEditorial: We Need To Look Beyond The Diwali-Firecracker-AQI Axis\n\nThe Myth Of Absolutes In A World Of Contexts\n\nLegal Eagle: Justice Chandrachud Has Let Down The High Hopes Reposed In Him","summary":"","url":"https://www.freepressjournal.in/analysis/crucial-elections-are-approaching-at-home-and-abroad","image":"https://media.assettype.com/freepressjournal/2024-11-01/frzssrwu/flat-lay-elections-lettering-wooden-background23-2148265511.jpg","video":null,"publish_date":"2024-11-02 00:30:00","author":"K C Singh","authors":["K C Singh"],"language":"en","category":"politics","source_country":"in","sentiment":-0.174},{"id":261996356,"title":"Trump softens his overconfidence in Michigan","text":"“You gotta vote. Don’t believe the polls that we’re way up,” Trump admonished the crowd. “One gentleman — a great pollster, they say — he said we have a 97% chance of winning. I said, don’t believe it. Don’t believe it. I think he’s a Democrat because nothing matters except what happens on Tuesday when you think of it.”\n\n2024 ELECTIONS LIVE UPDATES: LATEST NEWS ON THE TRUMP-HARRIS PRESIDENTIAL RACE\n\n“So just pretend that we’re 1 point down. We’re not; we’re up,” Trump continued at the rally aimed at winning over union voters in Macomb County.\n\nThe former president’s warning not to get complacent is a notable difference from his campaign pollster’s recent memo touting his chances of winning. \n\n“President Trump’s position nationally and in every single Battleground State is SIGNIFICANTLY better today than it was 4 years ago,” wrote Tony Fabrizio citing RealClearPolitics data. “In fact, President Trump holds the lead in 5 of the 7 Battleground States that account for over 270 Electoral Votes.”\n\nRealClearPolitics’s poll average of the battleground states shows Trump leading Vice President Kamala Harris by 1 point, 48.5% to 47.5%. But it appears the campaign is attempting to avert any signs of hubris in the final days of the election cycle.\n\n“I point this out NOT to stoke overconfidence or complacency, but to illustrate just how close this election is and that victory is within our reach,” Fabrizio added. \n\nVoters who spoke to the Washington Examiner mostly signaled that they accept Trump’s confidence he can win but cited Hillary Clinton’s presidential campaign in 2016 as a reason why Trump is urging Republicans not to rely on polls. Clinton was polling about 5 points ahead of Trump in Michigan just days before the 2016 election and then lost the state.\n\n“If people get overconfident, people won’t go out and vote. They’ll say, ‘Well, we got it in the bag,'” said Roque Diegel, a 59-year-old retiree from Harrison Township. “Look what happened to Hillary Clinton. I remember watching her during the election day, and then all the Clinton people were all jumping up and down and happy. And then the numbers started coming in, and they’re looking at the screen … and the next thing you know, no balloons are dropping.”\n\nStill, all voters remained confident Trump will win Michigan, one of the blue wall battleground states that will help decide the next president.\n\n“I think he’s a confident guy. That’s who he is. Trump’s always been confident,” said Andrew W., a 29-year-old security employee from Dearborn who declined to give his last name. “I think he’s going to win Michigan. We’re going to turn the state red.” \n\nTrump’s warning of overconfidence is also a change in tone from a week ago when he boasted he’s “leading by a lot” in Michigan, Nevada, Pennsylvania, Wisconsin, and even states that are typically never in play.\n\nAt the Warren rally, Trump urged union autoworkers, some of whom took to the stage, that his campaign would better help their industry compared to the Harris campaign. But the national United Auto Workers union has endorsed the vice president and President Shawn Fain was participating in a get-out-the-vote rally with Reps. Alexandria Ocasio-Cortez (D-NY), Debbie Dingell (D-MI), and Rashida Tlaib (D-MI) in nearby Detroit at the same time as the Trump rally.\n\nTrump called Fain “that poor stupid fool that runs the union” as he denigrated electric vehicle mandates as a threat to union auto workers. \n\nTrump supporters at the rally remained adamant that union voters would tilt Republican.\n\n“Everyone loves the environment, I love the environment, but the Democrats got really radical with going against oil and gas and gas-powered cars that just started the rift,” said Craig Dailey, a 52-year-old sales employee from Grosse Pointe Park. “There’s clarity on the Republican side.” \n\nDailey cited the International Brotherhood of Teamsters union not endorsing Trump or Harris as an example of why labor will vote in large numbers for the GOP. \n\nEven voters who traveled from out of state also believed that Trump would win the Wolverine but they too cautioned against the GOP getting too confident.\n\nSabina T, a 38-year-old Air Force retiree who declined to give her last name, drove one and a half hours from Toledo, Ohio to hear Trump speak. “We’ve had that issue many times over the years,” Sabina said about the GOP feeling jubilant before an election. “Where I don’t feel well, I’m sick, oh, we’re behind or we’re ahead, so I don’t need to go vote. So it’s been very common.” \n\nAmy Chauvette, a 60-year-old UPS retiree from Sylvania, Ohio, also drove more than an hour to hear Trump speak in Warren but she supported his confidence in winning Michigan. “That’s one of the wonderful things about Donald J. Trump, I believe, is his confidence,” Chauvette said.","summary":"WARREN, Michigan — Former President Donald Trump appeared to be tamping down his campaign’s overconfidence that he will win the election during a Friday rally at Macomb Community College in Warren, Michigan, where he cautioned against reading the tea leaves of preelection data. &#8220;You gotta vote. Don&#8217;t believe the polls that we&#8217;re way up,&#8221; Trump [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3213133/trump-softens-overconfidence-michigan/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/Trump-at-Macomb-Community-College-in-Warren-Michigan.webp","video":null,"publish_date":"2024-11-02 00:21:42","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.345},{"id":261996080,"title":"Us Election Live Donald Trump And Kamala Harris Face Off In Battleground With Duelling Rallies","text":"Weekend Paper Delivery \n + Full Digital Access \n \n Features\n \n\n \n \n \n \n \n \n Weekend Paper Delivery \n + Full Digital Access \n \n Features\n \n \n \n \n $10/ WEEK \n \n \n \n \n \n\n \n\n \n \n \n $10/ WEEK \n \n ($40 min. cost) charged every 4 weeks.* \n \n \n ($40 min. cost) charged every 4 weeks.* \n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access + Weekend Paper Delivery $40 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Home Delivery is not available in all areas. Allow up to 5 days for home delivery to commence. Prices may be varied as per full Terms and Conditions. See www.advertiser.com.au/subscriptionterms for full details. \n \n \n \n \n \n \n \n \n\n No lock-in contract \n Unlimited articles on web & app \n Subscriber-exclusive news emails \n Enjoy games & puzzles \n A digital version of Today’s Paper \n Saturday and Sunday paper delivery* (Not available in all areas) \n \n\n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access + Weekend Paper Delivery $40 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Home Delivery is not available in all areas. Allow up to 5 days for home delivery to commence. Prices may be varied as per full Terms and Conditions. See www.advertiser.com.au/subscriptionterms for full details.","url":"https://www.adelaidenow.com.au/news/world/united-states/election/us-election-live-donald-trump-and-kamala-harris-face-off-in-battleground-with-duelling-rallies/live-coverage/e15b7436998ca7fb2f436f28c71138c8?expand_comments=true","image":"https://content.api.news/v3/images/bin/637e170e39f7d59a540406a3430bf8e0","video":null,"publish_date":"2024-11-02 00:20:33","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.405},{"id":261996066,"title":"Donald Trump V Kamala Harris How Us Election Will Affect Australia","text":"Weekend Paper Delivery \n + Full Digital Access \n \n Features\n \n\n \n \n \n \n \n \n Weekend Paper Delivery \n + Full Digital Access \n \n Features\n \n \n \n \n $10/ WEEK \n \n \n \n \n \n\n \n\n \n \n \n $10/ WEEK \n \n ($40 min. cost) charged every 4 weeks.* \n \n \n ($40 min. cost) charged every 4 weeks.* \n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access + Weekend Paper Delivery $40 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Home Delivery is not available in all areas. Allow up to 5 days for home delivery to commence. Prices may be varied as per full Terms and Conditions. See www.advertiser.com.au/subscriptionterms for full details. \n \n \n \n \n \n \n \n \n\n No lock-in contract \n Unlimited articles on web & app \n Subscriber-exclusive news emails \n Enjoy games & puzzles \n A digital version of Today’s Paper \n Saturday and Sunday paper delivery* (Not available in all areas) \n \n\n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access + Weekend Paper Delivery $40 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Home Delivery is not available in all areas. Allow up to 5 days for home delivery to commence. Prices may be varied as per full Terms and Conditions. See www.advertiser.com.au/subscriptionterms for full details.","url":"https://www.adelaidenow.com.au/news/world/united-states/election/donald-trump-v-kamala-harris-how-us-election-will-affect-australia/news-story/11a917026c58c9e14e81ce9ae5a5e446","image":"https://content.api.news/v3/images/bin/53124cf4e36b5e44cf5a9306117fec6b","video":null,"publish_date":"2024-11-02 00:20:33","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.405},{"id":261996044,"title":"Donald Trump V Kamala Harris How Us Election Will Affect Australia","text":"Weekend Paper Delivery \n + Full Digital Access \n \n Features\n \n\n \n \n \n \n \n \n Weekend Paper Delivery \n + Full Digital Access \n \n Features\n \n \n \n \n $10/ WEEK \n \n \n \n \n \n\n \n\n \n \n \n $10/ WEEK \n \n ($40 min. cost) charged every 4 weeks.* \n \n \n ($40 min. cost) charged every 4 weeks.* \n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access + Weekend Paper Delivery $40 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Home Delivery is not available in all areas. Allow up to 5 days for home delivery to commence. Prices may be varied as per full Terms and Conditions. See www.advertiser.com.au/subscriptionterms for full details. \n \n \n \n \n \n \n \n \n\n No lock-in contract \n Unlimited articles on web & app \n Subscriber-exclusive news emails \n Enjoy games & puzzles \n A digital version of Today’s Paper \n Saturday and Sunday paper delivery* (Not available in all areas) \n \n\n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access + Weekend Paper Delivery $40 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Home Delivery is not available in all areas. Allow up to 5 days for home delivery to commence. Prices may be varied as per full Terms and Conditions. See www.advertiser.com.au/subscriptionterms for full details.","url":"https://www.adelaidenow.com.au/news/world/united-states/election/donald-trump-v-kamala-harris-how-us-election-will-affect-australia/news-story/11a917026c58c9e14e81ce9ae5a5e446?expand_comments=true","image":"https://content.api.news/v3/images/bin/53124cf4e36b5e44cf5a9306117fec6b","video":null,"publish_date":"2024-11-02 00:20:33","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.405},{"id":261995766,"title":"Even liberals, Trump critics blast media's coverage of Liz Cheney comments: 'A bald-faced lie'","text":"The backlash the legacy media is facing over its coverage of former President Trump's recent comments about former Rep. Liz Cheney, R-Wyo., is going far beyond his supporters. At an event in Glendale, Arizona, Trump took a swipe at Cheney, who has been campaigning in support of Vice President Kamala Harris, for being a \"radical war hawk.\" \"I don’t blame [former Vice President Dick Cheney] for sticking with his daughter, but his daughter is a very dumb individual. Very dumb, she’s a radical war hawk. Let's put her with a rifle standing there with nine barrels shooting at her, OK? Let's see how she feels about it. You know, when the guns are trained on her face,\" Trump said. \"You know, they're all war hawks when they're sitting in Washington in the nice buildings saying ‘Oh gee well, let’s send 10,000 troops right into the mouth of the enemy.\" TRUMP CRITICISM OF LIZ CHENEY AS ‘RADICAL WAR HAWK’ FRAMED AS CALL FOR VIOLENCE BY ‘IRRESPONSIBLE’ MEDIA Several news organizations twisted Trump's comments to suggest he was calling for Cheney's \"execution.\" The New York Times ran the headline \"Trump attacks Liz Cheney using violent war imagery.\" The Washington Post published \"Trump suggests ‘war hawk’ Liz Cheney should have guns ‘trained to her face.’\" CNN's headline went even further, reading \"Trump says ‘war hawk’ Liz Cheney should be fired upon in escalation of violent rhetoric against his opponents.\" The Drudge Report went viral with its top of the page headline in bold red caps, \"TRUMP CALLS FOR CHENEY'S EXECUTION.\" FROM COVINGTON CATHOLIC TO BORDER WHIPS, LIBERAL MEDIA HAS RECENT HISTORY OF PEDDLING ‘CHEAP FAKES’ The sensational coverage happened on-air as well. \"Former President Donald Trump is escalating his violent rhetoric, suggesting one of his most prominent critics, the former Congresswoman Liz Cheney, should be fired upon,\" CNN anchor Kasie Hunt told viewers. Hunt's CNN colleague Jim Acosta grilled Rep Tim Burchett, R-Tenn., over Trump's comments, saying, \"When he says nine barrels shooting at her, that obviously evokes images of a firing squad. It evokes images of an execution, does it not?\" MSNBC's Jonathan Lemire called it \"the latest escalation of really dangerous, violent rhetoric,\" while former New Jersey Gov. Chris Christie told \"The View\" co-hosts it \"absolutely\" was a threat to Cheney. Not everyone is buying the narrative, however. And not just Trump's defenders. Critics of the former president across the political spectrum are calling out the media's coverage. \"Trump did NOT call for Liz Cheney to be executed,\" former GOP congressman and anti-Trump critic Joe Walsh reacted on X. \"Look, you know how I feel about Trump, and I’ve been out there every day for 2-3 months campaigning my ass off to help get @KamalaHarris elected, but this short clip is so deceptive. Trump is NOT calling for Liz Cheney to be executed in front of a firing line. He’s not. Listen to the entirety of what he said.\" \"He’s an utterly horrible human being who’s utterly unfit for office, but the truth should always matter. And the truth is that Trump is not calling for Liz Cheney to be executed,\" Walsh added. LIZ CHENEY BASHES TRUMP IN NEW KEY BATTLEGROUND HARRIS AD AS ELECTION HITS FINAL SPRINT \"Donald Trump did not call for the execution of Liz Cheney. That is a bald-faced lie,\" The Young Turks' Cenk Uygur wrote. \"He was making a point about how she is a chickenhawk. But also, Trump shouldn't talk about guns being ‘trained on her face,’ especially in a time where we're worried about political violence.\" \"This is a classic case of Trump saying something outrageous and the press bailing him out by being purposely misleading. You didn't have to lie about it for the comment to be totally irresponsible. And when you do, you lose all credibility and no one believes anything you say,\" Uygur continued. TV EXECUTIVE PANICS THAT TRUMP WINNING MEANS PRESS HAS NO INFLUENCE: ‘MAINSTREAM MEDIA IS DEAD’ \"I don’t support Donald Trump but I also don’t support journalists lying to their audiences, and when he says (paraphrased) 'these pro-war people wouldn’t be talking such a big game if they were on the front lines' it is actually not the same thing as saying they should be shot,\" The Free Press columnist Kat Rosenfield said. \"Folks, Trump didn't threaten to execute Liz Cheney,\" Vox correspondent Zack Beauchamp said. \"He actually was calling her a chickenhawk, something liberals said about her for ages. Look at the context — Trump is talking about giving her a weapon. Typically, people put in front of firing squads aren't armed. BIDEN'S ‘GARBAGE’ SHOT AT TRUMP SUPPORTERS DOWNPLAYED, DISMISSED, SPUN BY MEDIA: ‘COMES DOWN TO AN APOSTROPHE’ Political scientist Ian Bremmer blasted the Drudge Report's headline, saying, \"this is extraordinary irresponsibility, made worse only by the fact that it’s increasingly common across the political spectrum in the United States. \"The Trump ‘bloodbath’ comment and his latest on Liz Cheney have both been exaggerated and taken out of context all while the press imagines apostrophes to excuse Joe Biden. This is why trust in the press is collapsing and why Trump is on the verge of winning,\" conservative radio host Erick Erickson pointed out. \"The corporate media has completely given up on even pretending to maintain a tiny pretense of non-partisan neutrality,\" journalist Glenn Greenwald wrote. \"Compare this WashPost ‘news article’ about what Trump said to what he actually said. This is why, as Bezos told them, nobody trusts them: deservedly so.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Critics are piling on the distorted coverage of former President Trump&apos;s comments about former Rep. Liz Cheney, R-Wyo, suggesting he called for her &quot;execution.&quot;","url":"https://www.foxnews.com/media/liberals-trump-critics-blast-medias-coverage-liz-cheney-comments-bald-faced-lie","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/trumpcheney.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-02 00:18:34","author":"Joseph Wulfsohn,Kristine Parks","authors":["Joseph Wulfsohn","Kristine Parks"],"language":"en","category":"politics","source_country":"us","sentiment":-0.126},{"id":261996418,"title":"Supreme Court rules Pennsylvania may count back-up votes when mail ballots are rejected","text":"(CNN) — The US Supreme Court on Friday left in place a Pennsylvania court ruling that is expected to expand options for voters whose mail-in ballots are rejected for technical reasons to have their votes counted, in a defeat for Republicans in a critical battleground state.\n\nThere were no noted dissents.\n\nFor Pennsylvania voters who made a mistake in how they prepared their mail-in ballots, it could ensure they have a backup option to have a provisional ballot counted.\n\nIt’s unclear how many Pennsylvania voters will benefit because not every county notifies voters of defective mail ballots. But both sides in the appeal before the Supreme Court characterized the dispute as affecting potentially “thousands” of votes at a minimum.\n\nConservative Justice Samuel Alito wrote a brief statement – which was joined by Justices Clarence Thomas and Neil Gorsuch – essentially arguing that the court couldn’t give the Republicans who brought the appeal what they had sought even if it wanted to.\n\nThe case, Alito wrote, “is a matter of considerable importance.” But, he wrote, “even if we agreed with the applicants’ federal constitutional argument (a question on which I express no view at this time), we could not prevent the consequences they fear.”\n\nRepublicans had asked the Supreme Court in an emergency appeal this week to block a state court ruling that allowed provisional ballots to be counted in cases where voters failed to enclose them in “secrecy” sleeves before mailing them in.\n\nThough the case was technically limited to two voters in a single county, the Republican National Committee had framed the dispute as having much wider implications, asking the court to either pause the lower court’s ruling or, alternatively, to segregate the ballots at issue statewide.\n\nAri Savitzky, senior staff attorney at the ACLU’s Voting Rights Project, which had represented the voters, called the ruling a “win for democracy and the rule of law.” “The court rightly rejected this eleventh-hour attempt to discount the votes of Pennsylvanians and interfere in the state’s electoral process. The bottom line is that voters deserve to have their voices heard,” he said.\n\nThe RNC did not immediately respond to a request for comment.\n\nThe high court’s decision came on the heels of another order on Wednesday in which a conservative majority allowed Virginia to purge an estimated 1,600 voters from its registration rolls. Republicans said those registrants were self-identified noncitizens. Voting rights groups said at least some eligible US citizens were ensnared. The Virginia order drew sharp criticism from voting and immigrant rights groups in part because the court offered no explanation for its decision.\n\n‘Naked’ and other defective mail-in ballots\n\nThe initial lawsuit was focused on sleeveless, so-called “naked ballots.” But both the ACLU and the RNC suggested in their briefs that the case could affect other types of defective mail-in ballots, such as those missing required signatures and dates on the envelope.\n\nDifferent counties in Pennsylvania have different procedures for dealing with defective mail ballots, some more forgiving than others. That patchwork of rules makes it difficult to say with certainty how many ballots were at stake in the case. In its appeal, the RNC said the case could potentially affect “tens of thousands of votes in a state which many anticipate could be decisive.” In its response, the ACLU said “potentially thousands” of ballots were in play.\n\nFour years ago, President Joe Biden beat former President Donald Trump in Pennsylvania by more than 80,000 votes. Polls indicate that, this year, Trump and Vice President Kamala Harris are in a dead heat.\n\nThe suit was filed by two voters in Butler County who submitted mail-in ballots but failed to enclose those ballots in the secrecy sleeve before placing them in an outer mailing envelope. A machine scanner identified the problem and the voters received an automated message alerting them that their vote would not be counted.\n\nThe voters showed up at their precincts during the state’s primary election and attempted to cast provisional ballots but learned those votes would also not be counted. County election officials said state law barred them from voting because they had already submitted a mail-in ballot, even though that ballot was defective.\n\nPennsylvania’s top court sided with the voters, ruling that election officials were correct to toss the mail-in ballots but “erred in refusing to count” the provisional ballots. Pennsylvania law, the state’s high court ruled, requires provisional ballots “be counted if there were no other ballots attributable to the electors. There were none.”\n\nRepublicans told the US Supreme Court that Pennsylvania’s courts usurped power reserved to the state legislature by allowing voters to cast provisional ballots after their mail-in ballots were tossed out. That’s because state law bars election officials from counting a provisional ballot if a mail-in ballot is “timely received by a county board of elections.”\n\n“That,” Republicans told the Supreme Court, “should be the end of the case.”\n\nBut Democrats who intervened in the case, voting rights groups and state and county election officials said that reading of the law would lead to the “absurd” result that some residents could be blocked from casting a vote because of a technical error – despite the fact that the state had in a place a provisional ballot system that was intended to serve as a backup.\n\nJust under the surface of the Pennsylvania dispute were several broader legal fights dealing with when the Supreme Court can intervene in a state election fight – questions that could have nationwide implications.\n\nThe RNC had argued that Pennsylvania’s Supreme Court violated the so-called Purcell principle, which generally warns courts against getting involved in last-minute election disputes over state law. But the voting rights groups noted the Supreme Court had previously framed Purcell as a check on federal – not state – courts.\n\nAlso at issue was whether the Supreme Court had the power to review the case at all, given that it involved a state court reviewing state law. The RNC relied on an untested legal theory that the US Constitution gives state legislatures vast power to set election rules without oversight from state courts. The Supreme Court declined to take up that theory in a 2023 decision involving North Carolina’s redistricting, but it also didn’t close the door on reviewing state court decisions about state law if they “transgress the ordinary bounds of judicial review.”\n\nChief Justice John Roberts didn’t explain in his opinion in that case what those words mean. The RNC appeal appeared to be at least in part an effort to test the limits of the definition of “ordinary bounds.”\n\n(Copyright (c) 2024 CNN. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"(CNN) —&#160;The US Supreme Court on&#160;Friday left in place a Pennsylvania court ruling&#160;that is expected to expand options for voters whose mail-in ballots are rejected...","url":"https://whdh.com/news/supreme-court-rules-pennsylvania-may-count-back-up-votes-when-mail-ballots-are-rejected/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/11/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbTJ5cjZqbWUwMDAzM2I2bTdtdzIwNzZ2-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtMnlyNjZxejAwMW8yY3A1YjkxNzU1dTg.jpg?quality=60&strip=color","video":null,"publish_date":"2024-11-02 00:16:31","author":"Bailey Allen","authors":["Bailey Allen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.604},{"id":261996922,"title":"Top House Republicans seeking documents regarding Biden’s ‘garbage’ comment - The Associated Press","text":"WASHINGTON (AP) — Top House Republicans called on the White House to produce all documents and internal communications regarding President Joe Biden’s statement earlier this week in which he appeared to take a swipe at supporters of Donald Trump.\n\nWhite House press officials altered the official transcript of Biden’s statement, drawing objections from the federal workers who document such remarks for posterity, according to two U.S. government officials and an internal email obtained Thursday by The Associated Press.\n\nThe lawmakers said they question whether the decision to create “a false transcript and manipulate or alter the accurate transcript” produced for the National Archives and Records Administration was a violation of federal law.\n\nRep. James Comer, the Republican chair of the House Committee on Oversight and Accountability, and House Republican Conference Chairwoman Elise Stefanik demanded the White House produce the records. They’re also calling for the White House to make available for a briefing the top supervisor of the White House Stenography’s Office.\n\n“The White House cannot simply rewrite President Biden’s rhetoric,” Comer and Stefanik wrote. “...We are concerned with the latest reporting of the White House’s apparent political decision to protect the Biden-Harris Administration, instead of following longstanding and proper protocols.” \n\nBiden created an uproar earlier this week with his remarks to Latino activists responding to racist comments at a Trump rally made by the comedian Tony Hinchcliffe, who referred to the U.S. island territory of Puerto Rico as a “floating island of garbage.”\n\nBiden, according to a transcript prepared by the official White House stenographers, told the Latino group on a Tuesday evening video call, “The only garbage I see floating out there is his supporters — his — his demonization of Latinos is unconscionable, and it’s un-American.”\n\nThe transcript released by the White House press office, however, rendered the quote with an apostrophe, reading “supporter’s” rather than “supporters,” which aides said pointed to Biden criticizing Hinchcliffe, not the millions of Americans who are supporting Trump for president.","summary":"Top House Republicans seeking documents regarding Biden’s ‘garbage’ comment  The Associated Press","url":"https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-republicans-44c3bb08116c13eee5c4886f50502652","image":"https://dims.apnews.com/dims4/default/a45bf81/2147483647/strip/true/crop/5593x3146+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F86%2F7f29337aa9a1653f2d92f8487d53%2F94f68b4daf9f48e384b13dda10f88663","video":null,"publish_date":"2024-11-02 00:16:00","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.056},{"id":261995340,"title":"Tren de Aragua is driving Midtown crime — Joe & Kamala’s gift to NYC","text":"Nobody in New York City had heard of Tren de Aragua three years ago, but the now-notorious Venezuelan “asylum-seeker” gang is now a major plague on the city.\n\nThe Post’s review of NYPD crime data reveals that TdA perps have racked up 517 arrests citywide this year alone.\n\nSome 41 Tren TDA gangbangers accounted for 143 arrests — almost half of them in Midtown’s busiest retail neighborhoods.\n\nOf the 517 arrests of TdA, “junior mafia” Los Diablos de la 42 and related perps, a full 295, or 57%, centered in Midtown. \n\nThat includes such tourist destinations as Times Square, Rockefeller Center and Radio City Music Hall: All these felony charges of robbery, grand larceny, assault and car theft — each representing multiple crimes without an arrest — make for a wonderful “stay away” signal to the would-be visitors the city wants to come.\n\nAnd TDA crime radiates into outer borough communities, like Corona, where gang members are implicated in gun and drug sales (mainly the lethal fentanyl mix “pink cocaine”) plus sex trafficking.\n\nThe ‘bangers are far from the only criminals waved in through the Harris-Biden opened border, but they also have added impunity because the administration “can’t” deport Venezuelans . . . because accepts Venezuela’s “no” as a final answer. \n\nSince Harris can’t think of a thing Biden did wrong, all her talk about being “tough” won’t do a thing for New York or the gang’s other stomping grounds if she wins on Tuesday.\n\nIf the city’s ever to see relief from this menace — and future ones that will surely follow if Tren prospers — America needs to elect Donald Trump and J.D. Vance.","summary":"Nobody in New York City had heard of Tren de Aragua three years ago, but the now-notorious Venezuelan \"asylum-seeker\" gang is now a major plague on the city.","url":"https://nypost.com/2024/11/01/opinion/tren-de-aragua-is-driving-midtown-crime-joe-amp-kamalas-gift-to-nyc/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/TDAHE1.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-11-02 00:07:51","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":0.063},{"id":261995292,"title":"US election 2024: the key players","text":"US election 2024: the key players\n\nIn this three-part series on the 2024 US presidential election, the Post looks at the influences and policies of the two contenders, Vice-President Kamala Harris and former president Donald Trump, and the legacy of the departing president, Joe Biden.\n\n02 Nov, 2024","summary":"In this three-part series on the 2024 US presidential election, the Post looks at the influences and policies of the two contenders, Vice-President Kamala Harris and former president Donald Trump, and the legacy of the departing president, Joe Biden.","url":"https://www.scmp.com/news/us/us-elections/analysis/series/3284901/us-election-2024-key-players","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/2024/11/02/Biden_profiles.jpg","video":null,"publish_date":"2024-11-02 00:02:23","author":null,"language":"en","source_country":"cn","sentiment":-0.614},{"id":261995260,"title":"Kim Kardashian tutup akaun YouTube anak","text":"Bintang realiti Kim Kardashian didakwa terpaksa menutup akaun YouTube milik anak lelakinya selepas kanak-kanak itu memuat kandungan video berunsur politik.\n\nThe Daily Beast melaporkan Kim, 44, bertindak sedemikian susulan tindakan Saint West membuat perkongsian mengejek calon presiden Kamala Harris.\n\nMenurut sumber, akaun tersebut sudah tiada lagi dalam paparan laman berkenaan sejak beberapa hari lalu.\n\nMenerusi hantaran tersebut, Saint dikatakan berkongsi ilustrasi menunjukkan gambar Kamala dipijak dan disamakan dengan najis untuk tujuan jenaka.\n\nBagaimanapun, gurauan kanak-kanak berusia lapan tahun itu mengundang pelbagai reaksi dalam kalangan warganet.\n\nTidak kurang juga ada yang mengaitkan perbuatan Saint menggambarkan sokongan ayahnya, Kanye West terhadap lawan Kamala iaitu Donald Trump yang turut merebut jawatan presiden.\n\n“Kecil-kecil lagi dah pandai ambil tahu fasal politik!\n\n“Mesti ayah dia bangga tengok Saint mengejek Kamala,” komen warganet.\n\nSebelum ini, Kim mendedahkan ia bersetuju untuk membenarkan Saint membuka akaun YouTube sendiri sekiranya anaknya mematuhi beberapa syarat.\n\nAntaranya syarat ditetapkan adalah Saint dilarang merakam mahupun memuat naik maklumat keluarga serta harus mendapatkan kebenaran Kim sebelum berkongsi sebarang video. – Agensi","summary":"","url":"https://mediapermata.com.bn/kim-kardashian-tutup-akaun-youtube-anak/","image":"https://mediapermata.com.bn/wp-content/uploads/2024/11/P18-New-D-Yahoo_02112024.jpg","video":null,"publish_date":"2024-11-02 00:01:23","author":null,"language":"en","category":"politics","source_country":"bn","sentiment":0.082},{"id":261995296,"title":"Joe Biden leaves a mixed legacy on US-China affairs as he exits the world stage","text":"America is heading into a general election that has been unprecedented in terms of rhetoric, surprises and the potential to alter the founding principles of US democracy. In this three-part series, the Post looks at the legacy of the departing president, Joe Biden, and the influences and policies of the two contenders, former president Donald Trump and Vice-President Kamala Harris.\nDuring this year’s Nato summit in Washington, US President Joe Biden warned his Chinese counterpart Xi Jinping of a “price to pay” if Beijing continues aid to Moscow, after Nato labelled China a “decisive enabler” in Russia’s war against Ukraine.\nFor the third year in a row, Indo-Pacific nations took part in the transatlantic security alliance’s meeting, included US chip partners Japan and South Korea, and Five Eyes allies Australia and New Zealand.\nThe Nato gathering was just one of Biden’s efforts to bring more countries into coalitions that have underpinned US geopolitical strength for decades. Observers say they have inflicted some degree of competitive “pain” on Beijing, from economy and technology to defence, and helped to craft a more unified “China threat” narrative among allies.\nBut for all of the accolades and the implicit approval from Republicans, who have pushed the Democratic president to fortify some of these coalitions further, some analysts have also said that Biden’s China strategy lacked a clearly defined “end goal”.\n\nThat lack of clarity, they say, could undermine the alignment that he has worked so hard to build, particularly if Biden’s vice-president, Kamala Harris, loses the presidential election on Tuesday to former president Donald Trump.\n‘Bloc Confrontation’\nYun Sun, director of the China Programme at the Stimson Centre, a think tank in Washington, said Biden’s coalition-building in targeting China was particularly successful in the security arena, including getting Nato allies to label China as a “systemic challenge” and be more involved in Indo-Pacific military coordination.\nNato released its first Strategic Concept focused on the Indo-Pacific in 2022, outlining policies that included strengthening maritime cooperation with nations in the region to address China’s “growing assertiveness”.\nSince then, aircraft or vessels from Nato countries such as France, Germany and the Netherlands have been seen more often in the contested East and South China Seas and the Taiwan Strait.\nThe US and its allies have strengthened deterrence efforts against China’s military presence in the South China Sea, the site of dangerous close encounters between China and the Philippines amid competitive claims of sovereignty.\nLast year, Manila allowed US troops to use four additional military bases in the country, bringing total American access to nine bases.\n\nDuring his administration, Biden formed the Aukus coalition, with plans to base US and British submarines in Australia while helping it acquire nuclear-powered submarines. Beijing criticised the move, saying it created “bloc confrontation” and disrupted regional peace.\nBonnie Glaser, managing director of the German Marshall Fund’s Indo-Pacific programme in Washington, said the Biden administration made “progress in producing a more distributed and survivable force posture for US forces” by working with allies in the region while strengthening coordination to better respond to the Chinese military.\nOn Taiwan, Glaser said the Biden administration has bolstered deterrence through increasing arms sales and working with allies to improve Taiwan’s international status.\n“The Biden administration has … come up with some creative mechanisms to help bolster Taiwan’s capabilities as foreign military financing and presidential drawdown authority. These are new in the Biden administration,” she said.\nBeijing sees Taiwan as part of China to be reunited by force if necessary. Most countries, including the United States, do not recognise Taiwan as an independent state, which the Biden administration consistently stressed to Beijing in high-level meetings.\nBut Washington is opposed to any attempt to take Taiwan by force and is continuing arms sales to the island, including a US$80 million deal last year through the Foreign Military Financing programme – funding usually reserved for sovereign nations.\n\nZhang Baohui, an international relations professor who teaches American foreign policy at Hong Kong’s Lingnan University, credited the Biden administration with preventing conflicts with Beijing over Taiwan and the South China Sea.\n“Compared to the Trump administration, the Biden administration is more aware of the security dilemma or strategic mistrust between rival countries,” he said. “The administration truly understands the importance of the Taiwan issue to China, hence its consistent efforts to assure Beijing.”\nSun said the US narrative of China’s manufacturing “overcapacity” and its ties with Russia have affected Washington’s European allies.\n“China’s own position in the Ukraine war has successfully alienated European countries from China. That’s not necessarily a US policy. But I would say that US policy has played a main role in shaping that result, that European countries are more sceptical about China’s intention,” Sun said.\nChina’s relations with the European Union have become strained over Beijing’s close ties to Moscow and a “de-risking” policy to reduce trade dependence. The bloc joined the US in sanctioning more than a dozen Chinese companies accused of transferring dual-use goods that empowered Russia’s defence industrial base, as well as additional tariffs of up to 35 per cent on Chinese electric vehicles.\nThe EU tariffs are expected to have a considerable impact on Chinese EV exports to the continent, the product’s largest market, accounting for 38 per cent of its total exports last year, according to data from the China Passenger Car Association.\n“I would say that US policy under Biden has very successfully made China suffer the consequences and feel the pain,” Sun said.\n\nSun Chenghao, a visiting scholar at the Paul Tsai China Centre at Yale Law School, said the United States’ tech alliances against China have put immense pressure on Beijing’s technology development.\nThe US-China tech battle has intensified as Biden clamped down on Beijing’s access to advanced technologies that are key to its military development.\nThe administration pressed Congress to pass the Chips and Science Act, which became law in 2022, with a “small yard, high fence” policy to ban semiconductor exports to China’s hi-tech sector while imposing investment bans on AI and quantum computing.\nBiden has also encouraged allies to do the same, forming the Chip 4 Alliance with Japan, South Korea and Taiwan and the Minerals Security Partnership with 13 nations and the European Commission to block China from tech supply chains.\n“[The US] cannot cut off the industrial chain by itself. So that’s why it needs to unite its allies … if it successfully controls the chain with its allies, it will be a huge challenge for China,” said Sun Chenghao, who also leads the US-Europe programme at Tsinghua University’s Centre for International Security and Strategy.\n“Of course China can certainly invest a lot of money, for example, to find a way to localise all productions, but this process will be very long and the investment will be huge.”\nA ‘Managed Competition’?\nRyan Hass, director of the John L. Thornton China Centre at the Brookings Institution, said with strengthened alliances, “America is in a better competitive position in relation to China than when Biden entered office.”\n“The US-China relationship is more durable and functional now,” he said. “The Biden administration has pursued sustained, direct communication with China’s leaders to manage sources of stress in the relationship … This is a significant contrast to the dysfunctional state of the relationship when Biden entered office.”\n\nUS-China relations had gone through a turbulent period during Trump’s last year in office.\nApart from the continuing trade war over the US$300 billion worth of tariffs on a wide range of Chinese products, Trump repeatedly blamed China for the Covid-19 pandemic – calling it the “Chinese virus” – and of conducting espionage on American soil, which led to the shutdown of the Chinese consulate in Houston in 2020.\nBilateral ties continued in a downward spiral in the first two years of the Biden administration, from heated exchanges over human rights during the Alaska summit to former US House speaker Nancy Pelosi’s visit to Taiwan, which froze almost all communication channels between China and the US. And the downing of a Chinese spy balloon over US airspace in February 2023 further strained ties.\n“I think these two crises made the Biden administration realise that if China-US relations continue like this, it may mess up everything,” said Sun Chenghao.\nHe said Biden’s first two years of China policy had not proven to be very effective, with a lot of criticism of his administration’s inability to manage China-US relations.\n“So they realised that their China policy still needed to maintain a certain stability before competition … so in the second half of [the administration], the focus shifted to how to manage this competition and prevent it from getting out of control,” he said.\nAt last year’s summit in northern California, Xi and Biden agreed to manage tensions through a range of working groups from trade to the Indo-Pacific. Some constructive progress has been made in their anti-narcotics cooperation.\nHigh-level contacts are consistent and increasing, with the two leaders expected to meet again before Biden leaves office on January 20.\nBut Biden’s policy to “manage competition” with China is often attacked by Republicans as lacking an “end goal”, with some arguing that the US should instead seek complete “victory” over China.\n\nIn an October event discussing a paper on the topic compiled by the Centre for Strategic and International Studies (CSIS) think tank, Rick Waters, former deputy assistant secretary of state for China and Taiwan in the Biden administration, argued that the presidencies of both Trump and Biden struggled to define objectives in Washington’s China policy, which he said could undercut coalition-building efforts.\n“They contributed to subtle hedging behaviours among our allies to assume, if there’s no clear explanation of what our goal is, it must be regime change,” Waters said.\nHe suggested that US goals should be more clearly articulated in different domains of competition with China, instead of merely stating that Washington wanted a “steady state” in the relationship.\nIn the CSIS paper, Rush Doshi, former deputy senior director for China and Taiwan affairs at the National Security Council in the Biden administration, defended Biden’s strategy of using diplomacy to manage competition with China in order to avoid conflicts.\nHe agreed with Biden’s three pillars of China strategy released in 2022, which stressed the need to invest in America’s strength, align with allies to take on the “China challenge”, and to “powerfully compete” to blunt China’s “order-building efforts”.\n“US strategy should be anchored on a steady state that envisions terms of coexistence – however uneasy and fraught that may be – with the [People’s Republic of China] that are maximally favourable to the United States.”\n“None of this is inconsistent with diplomacy with China that seeks to manage competition, avoid escalation and enhance transnational cooperation – all of which contribute to a more competitive and sustainable US approach.”\n‘Mixed Effects’\nSun Chenghao agreed that the Biden administration did not have a clear end goal in its China strategy, which led to confusing policies and potentially dangerous miscalculations.\nHe added while Harris is expected to largely continue Biden’s China policy, Trump and his fellow China hawks would likely reverse Biden’s efforts at managing competition with Beijing, particularly the communication channels that have been built up.\n“If we don’t communicate, it will be more troublesome to let each other guess the intentions behind each other’s policies,” he said.\n“[China’s] perspective is that there must be boundaries in competition. For example, if you want to build a small yard with high fence, you have to tell us clearly about the boundaries, what areas can be excluded. … Now we don’t know what exactly is in your US national security ‘basket’.”\n\nPaul Triolo, who leads the China and technology policy sector at the Albright Stonebridge Group, an advisory firm based in Washington, said Biden’s “small yard, high fence” policy had backfired.\n“US allies continue to push back on the imposition of more controls that they feel do not have major national security gains but have significant economic impact,” Triolo said, citing Tokyo’s concerns over China’s retaliation and US export controls that included memory equipment, of which Japanese companies lead in manufacturing.\nHe added that increasing US pressure had also boosted China’s innovation.\nXi has made “new productive forces” – manufacturing and innovation of high technology – a priority.\nUnder the strategy, China has built up labour and capital resources to develop its tech industry and figure out ways to deal with US restrictions, while retaliating with export controls on minerals needed for chip manufacturing.\n“By massively incentivising Chinese domestic firms, US controls over the past two years in particular have meant Chinese companies are working together, innovating more and will become more globally competitive,” he said.\n“While Chinese firms cannot yet reproduce all of the ‘chokepoint’ technologies that are the target of the ‘small yard, high fence’ policy, they will continue to make gains, and will continue to take significant market share from foreign competitors.”\n\nScott Kennedy, senior adviser and trustee chair in Chinese business and economics at CSIS, said Biden’s trade moves against China, including additional tariffs and export controls, could have “mixed effects”.\nThe administration introduced a series of measures to strengthen US competitiveness in key sectors, including imposing a US$18 billion tariff on EVs and semiconductors and providing billions of federal subsidies to those industries.\n“Those tariffs and restrictions will provide protection for the American industry and give them an opportunity to continue to develop at home, but they will have zero effect on the continued progress of China’s own auto industry globally,” he said.\n“And in fact, what we’ll see, perhaps, is them expanding their investment and activities in the rest of the world. So we may see a more successful Chinese auto industry globally than we otherwise would have seen.”\nDespite significant progress in security cooperation in the Indo-Pacific, Glaser said the administration’s economic engagement with the region turned out to be “limited”.\n“The US has not put forward a sort of trade initiative that has been really appealing to the region. … It will be very difficult for the United States to provide market access going forward in any trade agreement, but it nevertheless remains one of the asks of many of our allies and partners,” she said.\nBiden did launch a trade initiative – the Indo-Pacific Economic Framework for Prosperity – with 13 nations in 2022, aiming to recommit the US to the region after Trump pulled the country out of the Trans-Pacific Partnership, who accused the free trade pact of taking advantage of the United States.\nNegotiations on how to implement the initiative have been slow. It did not eliminate any tariffs, prompting some Asean members to start losing interest. And if Trump wins the election, the future of the initiative itself will be dim.","summary":"Efforts at rebuilding global alliances have proved more successful than establishing an ‘end goal’ in Washington’s China strategy.","url":"https://www.scmp.com/news/china/article/3284899/joe-biden-leaves-mixed-legacy-us-china-affairs-he-exits-world-stage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/02/b79ccbfb-40a3-47da-8df7-53dd5de21a12_396cd932.jpg","video":null,"publish_date":"2024-11-02 00:01:07","author":"Kawala Xie","authors":["Kawala Xie"],"language":"en","category":"politics","source_country":"cn","sentiment":0.318},{"id":261994972,"title":"Media twists Trump’s words about Liz Cheney — and his point","text":"“TRUMP CALLS FOR CHENEY’S EXECUTION,” blared the Drudge Report, amplifying a completely phony outrage on Friday.\n\nThe Harris campaign and its media allies claimed to be shocked and appalled over Donald Trump’s words at a Thursday night hurricane-relief event in Arizona.\n\n“She’s a radical war hawk. Let’s put her with a rifle standing there with nine barrels shooting at her, OK?” he said. \n\n“Let’s see how she feels about it, you know, when the guns are trained on her face.\n\n“You know they’re all war hawks when they’re sitting in Washington in a nice building saying, ‘Oh gee, let’s send 10,000 troops right into the mouth of the enemy.’ “\n\nThat is: He was arguing that Liz Cheney, like her father, is quick to put other people in harm’s way in the service of the US. Trump presents himself as the most anti-war president since the flower children.\n\nOf course, Cheney, Team Harris and today’s left-leaning chattering class simply shared the tape without the second half of the statement, then waxed hysterical.\n\nThey even got Arizona’s (Democratic) attorney general to announce an investigation. \n\nAll just an effort to win the day’s “media cycle” in a week when bumbling Mark Cuban and Joe Biden kept handing victories to Team Trump: Just some simple editing and you finally have “confirmation” of the tired “threat to our democracy” theme.\n\nAnd this follows the Harris folks’ effort to milk the insult comic’s stupid line on Sunday for the following three days, until Biden lost them the “garbage” war.\n\nIf Kamala Harris and Tim Walz had ever come up with some substantial policies beyond “I can’t think of anything I’d do differently,” the campaign wouldn’t be reduced to mining off-hand Trump remarks for “gotcha” moments. \n\nHeck, Harris might even dare a three-hour sitdown with Joe Rogan.\n\nBut all they have are these little lies, plus the far bigger lie about Trump’s supposed secret plot to sign a national abortion ban that couldn’t pass either house of Congress even if Republicans have their best day ever next Tuesday. \n\nThey’ve collapsed from “vibes” and “joy” to distortions and fear. \n\nIt’s hard to believe the polls still show this to be a 50-50 race.\n\nThank God the campaign is nearly over, and America will be free of this particular nonsense until at least the next election season kicks off.","summary":"“TRUMP CALLS FOR CHENEY’S EXECUTION,” blared the Drudge Report, amplifying a completely phony outrage on Friday.","url":"https://nypost.com/2024/11/01/opinion/media-twists-trumps-words-about-liz-cheney-and-his-point/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/JT471.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-11-02 00:00:47","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.303},{"id":261995256,"title":"Kamala Harris Caught on Camera Spilling 'Family Secrets' to Gretchen Whitmer in Hot Mic Blunder","text":"Vice President Kamala Harris recently spilled some campaign secrets while chatting with Michigan Gov. Gretchen Whitmer in Kalamazoo, on Saturday, October 26. The Democratic nominee was grabbing a beer at the Trak Houz Bar and Grill. Cameras and microphones recorded their conversation as Harris admitted to Whitmer that the Harris-Walz campaign was struggling on one front— wooing male voters. \n\n\"We need to move ground among men,\" Harris told Whitmer as per the viral footage. As she said this, the realization of being recorded hit her and she exclaimed, \"Oh, we have microphones in here listening to everything. I didn’t realize that. Okay. So now you will tell us.\" Whitmer in response, asked, \"You will bleep my F words.\" \"We just told all the family secrets. S–t,\" Harris added, speaking with the media executives. \n\nMany on the internet, however, dubbed it as staged. An X user commented, \"Kamala is so fake. How would you miss these microphones? Totally not staged.\" Another chimed, \"By 'caught on a hot mic' you mean two bad actresses transparently failing at seeming surprised.\" As the comments poured in, a person opined, \"Shows her poor judgment...camera and mic all around her and she missed that?\" Reiterating the sentiment, another sarcastically penned, \"They are so believable and relatable!\" Meanwhile, a netizen slammed, \"They know they are losing with men...they are in a panic, but the irony is that every time she starts talking, more men start walking...\" A MAGA supporter added, \"This is a conversation you have when you are losing.\" Another echoed, \"They [men] won’t [support]. Their only political position is the murder of babies. Actual men don’t want that.\" \n\nAccording to a survey conducted by The New York Times & Sienna College from October 20-23, Donald Trump leads Harris by 55% while Harris only has a 41% support among male voters. However, it also shows that among the women voters, Harris is leading by 54% as compared to Trump’s 42%. To close the gap with male voters Harris launched an ad campaign targeting the American men.\n\nAccording to CNN, the new ads were aired during the broadcast of the Pittsburgh Steelers game on Monday Night Football. They were specially created for Milwaukee, Philadelphia, and Pittsburgh residents based on their culture and references to local sports teams. The ad video shows Republican nominee, Trump, using cuss words while talking about Philadelphia. In a snippet, he says, \"Bad things happen in Philadelphia,\" which is countered with pop culture references urging viewers to vote for Harris. Earlier another Harris ad campaign attempted to woo male voters by redefining the meaning of being a 'man.' The ad shows men from various walks of life advocating women's rights (like abortion) and taking pride in their masculinity.","summary":"&#34;Oh, we have microphones in here listening to everything. I didn’t realize that,&#34; Kamala Harris said after she spilled campaign details.","url":"https://www.inquisitr.com/kamala-harris-caught-on-camera-spilling-family-secrets-to-gretchen-whitmer-in-hot-mic-blunder","image":"https://dab57h0r8ahff.cloudfront.net/722308/uploads/0ac96730-96d0-11ef-b329-7fec477e782d_1200_630.jpeg","video":null,"publish_date":"2024-11-02 00:00:00","author":"INQUISITR,Tavishi","authors":["INQUISITR","Tavishi"],"language":"en","source_country":"US","sentiment":-0.442},{"id":261996030,"title":"Donald Trump boasts he has 97% chance of winning the election","text":"Republican presidential nominee and former President Donald Trump held a campaign rally at Macomb Community College in Warren, Michigan, with four days until Election Day (Picture: Reuters)\n\nFormer President Donald Trump said he has a 97% chance of winning the US election – despite polls overall showing he remains neck-and-neck with Vice President Kamala Harris.\n\nTrump spoke confidently about his likelihood of victory while making a campaign stop in Dearborn, Michigan, on Friday, with four days until Election Day. \n\n‘We have polls that came out just now. We’re doing very well in Michigan, we’re doing very well in Pennsylvania and we’re doing great in Arizona, eight or nine (percentage points) up, something like that,’ said Trump during his visit to a restaurant. \n\n‘And overall we’re going extremely well, somebody said a 97% chance of winning, you saw that? Ninety-seven percent.’\n\nTrump did not disclose the source of the statistic, and continued to say that ‘nobody’s going to vote for Kamala’. \n\nThe RealClearPolitics poll average on Friday had Trump leading Harris by just 0.3% – 48.4% to 48.1%. \n\nMeanwhile, the final survey by The Times and YouGov released on Friday showed Harris winning by a narrow margin. It forecast Harris winning the swing states of Michigan, Pennsylvania, Wisconsin and Nevada, and Trump getting North Carolina and Georgia, while Arizona was a toss-up.\n\nThe Trump campaign did not immediately respond to a request for comment from Metro. \n\nTrump on Friday night repeated the percentage at the start of his rally in Warren in the Great Lakes State. But he was more careful in framing it, to keep a sense of urgency to vote for him.\n\n‘We’re pretty far up. One gentleman, a great pollster, they said we have a 97% chance of winning,’ he told the crowd.\n\n‘I said I don’t believe it, don’t believe it. I think he’s a Democrat because nothing matters except what happens when you (vote).’\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"Polls overall show a neck-and-neck race between ex-President Donald Trump and Vice President Kamala Harris with four days until the election.","url":"https://metro.co.uk/2024/11/01/donald-trump-boasts-97-chance-winning-election-21912928/","image":"https://metro.co.uk/wp-content/uploads/2024/11/SEI_228012393-1af3.jpg?quality=90&strip=all","video":null,"publish_date":"2024-11-01 23:59:44","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.269},{"id":261995322,"title":"Over 150,000 veterans and military family members recruited to staff polling places for Election Day","text":"Veterans and military families are falling in by the thousands to staff polling places across the country, according to a veterans' coalition.Vet the Vote coalition recently announced that after its recruitment efforts, 163,000 veterans and military families will work on Election Day to help facilitate the vote.This number far exceeds the 63,500 veterans and military family members who were successfully recruited to work in polling places during the 2022 midterm elections, when the campaign was first launched. MAJORITY OF VETERANS POLLED SUPPORT RE-ELECTION OF DONALD TRUMP: 'WE WANT TRUMP BACK'According to the Election Assistance Commission (EAC), 917,694 poll workers worked during the 2016 election and a majority of jurisdictions polled reported that it was \"very difficult\" or \"somewhat difficult\" to obtain a sufficient number of poll workers.\"Vet the Vote is a national non-partisan, nonprofit campaign to recruit veterans and military family members to be the next generation of poll workers,\" reads their mission statement. The coalition represents 43 advocacy groups and other organizations. It has recently partnered with sponsors like NASCAR, the NFL and the NBA.BRIAN MAST: I’M A WOUNDED WARRIOR. I’VE SEEN DONALD TRUMP CARE FOR VETERANS. THAT’S WHY I’M VOTING FOR HIM\"Our community makes for a good workforce\" to take on the nuts and bolts of running one of the more than 132,000 polling stations expected to be recording votes next Tuesday, said Ellen Gustafson, a Navy spouse and co-founder of the Vet the Vote organization to Military.com.According to Gustafson, the especially charged political environment going into next Tuesday has posed a challenge uniquely suited to veterans and military families. \"Yeah, we sure are hearing about threats. There are people questioning the integrity of our elections,\" said Gustafson to Military.com, and \"that includes questioning the integrity of the poll workers who do the work. I think we are comfortable with the idea that sometimes situations are challenging and the first goal is to de-escalate.\"Most poll workers sign up for long days, with most starting out at 5:30 am. Over half of poll workers in 2016 according to the EAC were aged 60 or over.Election Day is Tuesday, Nov. 5. CLICK HERE TO GET THE FOX NEWS APPVet the Vote did not immediately respond to Fox News Digital's request for comment.","summary":"Vet the Vote has expanded its recruitment efforts nationwide among veterans and military families to staff polling places ahead of Election Day.","url":"https://www.foxnews.com/politics/over-150000-veterans-military-family-members-recruited-staff-polling-places-election-day","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/veteran-poll-workers.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-01 23:59:18","author":"Jasmine Baehr","authors":["Jasmine Baehr"],"language":"en","category":"politics","source_country":"us","sentiment":-0.09},{"id":261994922,"title":"NYC Mayor Eric Adams gets April 2025 trial date as his lawyers fight to get bribery charge tossed","text":"By JAKE OFFENHARTZ and MICHAEL R. SISAK\n\nNEW YORK (AP) — New York City Mayor Eric Adams’ federal corruption trial will begin next April, a judge ruled Friday, right in the thick of his promised reelection campaign.\n\nU.S. District Judge Dale E. Ho set the trial date as Adams returned to Manhattan federal court for a hearing on his bid to eliminate a key charge in the indictment that threatens his political future.\n\nHo said he’s confident the April 21, 2025, date will hold, “assuming nothing unexpected comes up.”\n\nAt the same time, prosecutors said they still haven’t been able to crack a potentially crucial piece of evidence: Adams’ personal cellphone. According to his indictment, Adams changed his password just before giving the phone to authorities, then claimed he forgot it.\n\nAdams’ lawyers are fighting to throw out a bribery charge, one of five counts against the first-term Democrat.\n\nThey argued the charge doesn’t meet the U.S. Supreme Court’s recently narrowed threshold for the crime and shouldn’t apply to Adams because it involves allegations dating to before he became mayor.\n\n“The prosecutor for the United States had trouble defining what the ‘quo’ is here,” Adams’ lawyer John Bash argued, referring a “quid pro quo,” a Latin phrase meaning “something for something.”\n\nProsecutors countered that Adams’ lawyers were splitting hairs because, they allege, Adams was taking bribes and exerting influence while holding a prior elected office and as he anticipated becoming mayor.\n\nHo said he would take the arguments “under advisement and attempt to rule shortly.”\n\nThe indictment, which also includes wire fraud and conspiracy charges, accuses Adams of accepting flight upgrades and other luxury travel perks valued at $100,000 along with illegal campaign contributions from a Turkish official and other foreign nationals looking to buy his influence.\n\nIn exchange, prosecutors say, Adams performed favors benefiting the Turkish government, including pressuring the fire department in 2021 to approve the opening of a consulate that it deemed unsafe.\n\nAdams held a different elected position at the time, Brooklyn borough president, but by then it was clear that he would become mayor.\n\nAdams has pleaded not guilty to the charges and vowed to remain in office as he mounts his legal defense.\n\nBash argued the alleged perks don’t meet the legal definition of bribery because they predate his time as mayor and have “nothing to do with his governmental position.”\n\nAdams’ lawyers contend prosecutors are seeking to criminalize “normal and perfectly lawful acts” that Adams undertook as Brooklyn borough president before he was elected mayor.\n\nUnder the law, prosecutors must show that Adams took bribes in exchange for using his official office to exert influence.\n\nAssistant U.S. Attorney Hagan Scotten argued that Adams knew he was “entering into a transactional relationship” with his Turkish benefactors and that his role as borough president “gets him in the room, as it were, with the fire commissioner.”\n\nHo wondered whether, rather than Adams’ job as borough president, it was Adams’ impending move to City Hall that gave him the power to pressure the fire department.\n\n“It seems a little weird when the jurisdictional connection here is that he was Brooklyn borough president but that his ability to exert pressure extends from something else,” Ho said.\n\nScotten stood firm, arguing that “if Margot Robbie gave him a call and was really persuasive,” the “Barbie” actor and producer still wouldn’t be able to influence the fire department without also holding an elected office.\n\n“He probably would’ve taken that call,” Ho quipped, prompting laughter in the courtroom.\n\nZeroing in on the incongruity of the law — campaign contributions are legal, but bribes are not — Bash argued that it would be perfectly fine for a public official to pressure a casino licensing board on behalf of a campaign donor.\n\n“A general agreement to help is not a federal crime,” Bash argued.\n\nAdams sat stoically for most of the two-hour hearing, but he perked up just before Ho set the trial date — nodding emphatically as another of his lawyers, Alex Spiro, warned that a trial overlapping with next June’s Democratic primary would be a “grave, grave democratic concern.”\n\nScotten said at a hearing last month that prosecutors are pursuing “several related investigations” and that it is “quite likely” they will seek a superseding indictment charging Adams with additional crimes. Scotten also said it is “likely” additional defendants will be charged.\n\nProsecutors disclosed Friday that they’ve searched through nearly two-dozen electronic devices seized in the investigation but still haven’t been able to access Adams’ cellphone and aren’t sure they will.\n\nLate Thursday, Ho rejected another defense attempt to chip away at the case, denying Adams’ request for a hearing on the mayor’s claims that the government has been leaking information about the investigation to the news media.\n\nThe judge ruled that Adams and his lawyers failed to substantiate those claims and, if any leaks occurred, that the government was to blame.\n\nIn court filings outlining their arguments, Adams’ lawyers said the years of flight upgrades and other perks the mayor received were at most “classic gratuities,” which a recent U.S. Supreme Court rulings found were not covered by the bribery statute if they were given for past acts, according to the filing.\n\n“It should be clear from the face of the indictment that there is nothing routine about a public official accepting over $100,000 in benefits from a foreign diplomat, which he took great pains to conceal — including by manufacturing fake paper trails to create the illusion of payment,” prosecutors wrote.\n\nSeveral of Adams’ closest aides — including his police commissioner, schools chancellor and multiple deputy mayors — have resigned in recent months after federal investigators executed coordinated searches of their homes in early September.\n\nAdams has maintained that he can continue to lead the city effectively while fighting the charges.\n\nBut his political future remains fraught and several opponents have announced plans to challenge him in next year’s mayoral primary.\n\nEarlier this week, Adams raised eyebrows after repeatedly declining to criticize former President Donald Trump, refusing to say when he last spoke with the Republican nominee or whether he was angling for a pardon should Trump win reelection.","summary":"The judge said he’s confident the April 21, 2025, date will hold, “assuming nothing unexpected comes up.”","url":"https://www.bostonherald.com/2024/11/01/nyc-mayor-eric-adams-trial-date-set/","image":"https://www.bostonherald.com/wp-content/uploads/2024/11/Election_2024-NYC_Mayor-Trump_20464.jpg?w=1024","video":null,"publish_date":"2024-11-01 23:54:38","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.168},{"id":261994888,"title":"NYC Mayor Eric Adams gets April 2025 trial date as his lawyers fight to get bribery charge tossed","text":"By JAKE OFFENHARTZ and MICHAEL R. SISAK\n\nNEW YORK (AP) — New York City Mayor Eric Adams’ federal corruption trial will begin next April, a judge ruled Friday, right in the thick of his promised reelection campaign.\n\nU.S. District Judge Dale E. Ho set the trial date as Adams returned to Manhattan federal court for a hearing on his bid to eliminate a key charge in the indictment that threatens his political future.\n\nHo said he’s confident the April 21, 2025, date will hold, “assuming nothing unexpected comes up.”\n\nAt the same time, prosecutors said they still haven’t been able to crack a potentially crucial piece of evidence: Adams’ personal cellphone. According to his indictment, Adams changed his password just before giving the phone to authorities, then claimed he forgot it.\n\nAdams’ lawyers are fighting to throw out a bribery charge, one of five counts against the first-term Democrat.\n\nThey argued the charge doesn’t meet the U.S. Supreme Court’s recently narrowed threshold for the crime and shouldn’t apply to Adams because it involves allegations dating to before he became mayor.\n\n“The prosecutor for the United States had trouble defining what the ‘quo’ is here,” Adams’ lawyer John Bash argued, referring a “quid pro quo,” a Latin phrase meaning “something for something.”\n\nProsecutors countered that Adams’ lawyers were splitting hairs because, they allege, Adams was taking bribes and exerting influence while holding a prior elected office and as he anticipated becoming mayor.\n\nHo said he would take the arguments “under advisement and attempt to rule shortly.”\n\nThe indictment, which also includes wire fraud and conspiracy charges, accuses Adams of accepting flight upgrades and other luxury travel perks valued at $100,000 along with illegal campaign contributions from a Turkish official and other foreign nationals looking to buy his influence.\n\nIn exchange, prosecutors say, Adams performed favors benefiting the Turkish government, including pressuring the fire department in 2021 to approve the opening of a consulate that it deemed unsafe.\n\nAdams held a different elected position at the time, Brooklyn borough president, but by then it was clear that he would become mayor.\n\nAdams has pleaded not guilty to the charges and vowed to remain in office as he mounts his legal defense.\n\nBash argued the alleged perks don’t meet the legal definition of bribery because they predate his time as mayor and have “nothing to do with his governmental position.”\n\nAdams’ lawyers contend prosecutors are seeking to criminalize “normal and perfectly lawful acts” that Adams undertook as Brooklyn borough president before he was elected mayor.\n\nUnder the law, prosecutors must show that Adams took bribes in exchange for using his official office to exert influence.\n\nAssistant U.S. Attorney Hagan Scotten argued that Adams knew he was “entering into a transactional relationship” with his Turkish benefactors and that his role as borough president “gets him in the room, as it were, with the fire commissioner.”\n\nHo wondered whether, rather than Adams’ job as borough president, it was Adams’ impending move to City Hall that gave him the power to pressure the fire department.\n\n“It seems a little weird when the jurisdictional connection here is that he was Brooklyn borough president but that his ability to exert pressure extends from something else,” Ho said.\n\nScotten stood firm, arguing that “if Margot Robbie gave him a call and was really persuasive,” the “Barbie” actor and producer still wouldn’t be able to influence the fire department without also holding an elected office.\n\n“He probably would’ve taken that call,” Ho quipped, prompting laughter in the courtroom.\n\nZeroing in on the incongruity of the law — campaign contributions are legal, but bribes are not — Bash argued that it would be perfectly fine for a public official to pressure a casino licensing board on behalf of a campaign donor.\n\n“A general agreement to help is not a federal crime,” Bash argued.\n\nAdams sat stoically for most of the two-hour hearing, but he perked up just before Ho set the trial date — nodding emphatically as another of his lawyers, Alex Spiro, warned that a trial overlapping with next June’s Democratic primary would be a “grave, grave democratic concern.”\n\nScotten said at a hearing last month that prosecutors are pursuing “several related investigations” and that it is “quite likely” they will seek a superseding indictment charging Adams with additional crimes. Scotten also said it is “likely” additional defendants will be charged.\n\nProsecutors disclosed Friday that they’ve searched through nearly two-dozen electronic devices seized in the investigation but still haven’t been able to access Adams’ cellphone and aren’t sure they will.\n\nLate Thursday, Ho rejected another defense attempt to chip away at the case, denying Adams’ request for a hearing on the mayor’s claims that the government has been leaking information about the investigation to the news media.\n\nThe judge ruled that Adams and his lawyers failed to substantiate those claims and, if any leaks occurred, that the government was to blame.\n\nIn court filings outlining their arguments, Adams’ lawyers said the years of flight upgrades and other perks the mayor received were at most “classic gratuities,” which a recent U.S. Supreme Court rulings found were not covered by the bribery statute if they were given for past acts, according to the filing.\n\nFederal prosecutors, meanwhile, responded that Adams actions were plainly criminal.\n\n“It should be clear from the face of the indictment that there is nothing routine about a public official accepting over $100,000 in benefits from a foreign diplomat, which he took great pains to conceal — including by manufacturing fake paper trails to create the illusion of payment,” prosecutors wrote.\n\nSeveral of Adams’ closest aides — including his police commissioner, schools chancellor and multiple deputy mayors — have resigned in recent months after federal investigators executed coordinated searches of their homes in early September.\n\nAdams has maintained that he can continue to lead the city effectively while fighting the charges.\n\nBut his political future remains fraught and several opponents have announced plans to challenge him in next year’s mayoral primary.\n\nEarlier this week, Adams raised eyebrows after repeatedly declining to criticize former President Donald Trump, refusing to say when he last spoke with the Republican nominee or whether he was angling for a pardon should Trump win reelection.","summary":"The judge said he’s confident the April 21, 2025, date will hold, “assuming nothing unexpected comes up.”","url":"https://www.twincities.com/2024/11/01/nyc-mayor-eric-adams-trial-date-set/","image":"https://www.twincities.com/wp-content/uploads/2024/11/Election_2024-NYC_Mayor-Trump_20464.jpg?w=1024","video":null,"publish_date":"2024-11-01 23:54:38","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.168},{"id":261995364,"title":"NYC Mayor Eric Adams gets April 2025 trial date as his lawyers fight to get bribery charge tossed","text":"By JAKE OFFENHARTZ and MICHAEL R. SISAK\n\nNEW YORK (AP) — New York City Mayor Eric Adams’ federal corruption trial will begin next April, a judge ruled Friday, right in the thick of his promised reelection campaign.\n\nU.S. District Judge Dale E. Ho set the trial date as Adams returned to Manhattan federal court for a hearing on his bid to eliminate a key charge in the indictment that threatens his political future.\n\nHo said he’s confident the April 21, 2025, date will hold, “assuming nothing unexpected comes up.”\n\nAt the same time, prosecutors said they still haven’t been able to crack a potentially crucial piece of evidence: Adams’ personal cellphone. According to his indictment, Adams changed his password just before giving the phone to authorities, then claimed he forgot it.\n\nAdams’ lawyers are fighting to throw out a bribery charge, one of five counts against the first-term Democrat.\n\nThey argued the charge doesn’t meet the U.S. Supreme Court’s recently narrowed threshold for the crime and shouldn’t apply to Adams because it involves allegations dating to before he became mayor.\n\n“The prosecutor for the United States had trouble defining what the ‘quo’ is here,” Adams’ lawyer John Bash argued, referring a “quid pro quo,” a Latin phrase meaning “something for something.”\n\nProsecutors countered that Adams’ lawyers were splitting hairs because, they allege, Adams was taking bribes and exerting influence while holding a prior elected office and as he anticipated becoming mayor.\n\nHo said he would take the arguments “under advisement and attempt to rule shortly.”\n\nThe indictment, which also includes wire fraud and conspiracy charges, accuses Adams of accepting flight upgrades and other luxury travel perks valued at $100,000 along with illegal campaign contributions from a Turkish official and other foreign nationals looking to buy his influence.\n\nIn exchange, prosecutors say, Adams performed favors benefiting the Turkish government, including pressuring the fire department in 2021 to approve the opening of a consulate that it deemed unsafe.\n\nAdams held a different elected position at the time, Brooklyn borough president, but by then it was clear that he would become mayor.\n\nAdams has pleaded not guilty to the charges and vowed to remain in office as he mounts his legal defense.\n\nBash argued the alleged perks don’t meet the legal definition of bribery because they predate his time as mayor and have “nothing to do with his governmental position.”\n\nAdams’ lawyers contend prosecutors are seeking to criminalize “normal and perfectly lawful acts” that Adams undertook as Brooklyn borough president before he was elected mayor.\n\nUnder the law, prosecutors must show that Adams took bribes in exchange for using his official office to exert influence.\n\nAssistant U.S. Attorney Hagan Scotten argued that Adams knew he was “entering into a transactional relationship” with his Turkish benefactors and that his role as borough president “gets him in the room, as it were, with the fire commissioner.”\n\nHo wondered whether, rather than Adams’ job as borough president, it was Adams’ impending move to City Hall that gave him the power to pressure the fire department.\n\n“It seems a little weird when the jurisdictional connection here is that he was Brooklyn borough president but that his ability to exert pressure extends from something else,” Ho said.\n\nScotten stood firm, arguing that “if Margot Robbie gave him a call and was really persuasive,” the “Barbie” actor and producer still wouldn’t be able to influence the fire department without also holding an elected office.\n\n“He probably would’ve taken that call,” Ho quipped, prompting laughter in the courtroom.\n\nZeroing in on the incongruity of the law — campaign contributions are legal, but bribes are not — Bash argued that it would be perfectly fine for a public official to pressure a casino licensing board on behalf of a campaign donor.\n\n“A general agreement to help is not a federal crime,” Bash argued.\n\nAdams sat stoically for most of the two-hour hearing, but he perked up just before Ho set the trial date — nodding emphatically as another of his lawyers, Alex Spiro, warned that a trial overlapping with next June’s Democratic primary would be a “grave, grave democratic concern.”\n\nScotten said at a hearing last month that prosecutors are pursuing “several related investigations” and that it is “quite likely” they will seek a superseding indictment charging Adams with additional crimes. Scotten also said it is “likely” additional defendants will be charged.\n\nProsecutors disclosed Friday that they’ve searched through nearly two-dozen electronic devices seized in the investigation but still haven’t been able to access Adams’ cellphone and aren’t sure they will.\n\nLate Thursday, Ho rejected another defense attempt to chip away at the case, denying Adams’ request for a hearing on the mayor’s claims that the government has been leaking information about the investigation to the news media.\n\nThe judge ruled that Adams and his lawyers failed to substantiate those claims and, if any leaks occurred, that the government was to blame.\n\nIn court filings outlining their arguments, Adams’ lawyers said the years of flight upgrades and other perks the mayor received were at most “classic gratuities,” which a recent U.S. Supreme Court rulings found were not covered by the bribery statute if they were given for past acts, according to the filing.\n\n“It should be clear from the face of the indictment that there is nothing routine about a public official accepting over $100,000 in benefits from a foreign diplomat, which he took great pains to conceal — including by manufacturing fake paper trails to create the illusion of payment,” prosecutors wrote.\n\nSeveral of Adams’ closest aides — including his police commissioner, schools chancellor and multiple deputy mayors — have resigned in recent months after federal investigators executed coordinated searches of their homes in early September.\n\nAdams has maintained that he can continue to lead the city effectively while fighting the charges.\n\nBut his political future remains fraught and several opponents have announced plans to challenge him in next year’s mayoral primary.\n\nEarlier this week, Adams raised eyebrows after repeatedly declining to criticize former President Donald Trump, refusing to say when he last spoke with the Republican nominee or whether he was angling for a pardon should Trump win reelection.","summary":"The judge said he’s confident the April 21, 2025, date will hold, “assuming nothing unexpected comes up.”","url":"https://www.sandiegouniontribune.com/2024/11/01/nyc-mayor-eric-adams-trial-date-set/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/11/Election_2024-NYC_Mayor-Trump_20464.jpg?w=1024","video":null,"publish_date":"2024-11-01 23:54:38","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.168},{"id":261995530,"title":"In an all-hands, Intel CEO addresses employee concerns about the US election and CHIPS Act funding","text":"Intel CEO Pat Gelsinger addressed an employee-submitted question about whether the upcoming US election would affect Intel's CHIPS and Science Act funding at an all-hands meeting on Friday.The US Commerce Department has awarded Intel, the largest recipient of the Act, $8.5 billion in grants and $11 billion in loans. The government said it will pay out grants based on how companies meet benchmarks.During the all-hands, Gelsinger responded that the bill was \"bipartisan,\" and the executive team reassured employees that Intel was a key part of the CHIPS Act as the only large-scale chip manufacturer in the US, according to an employee who listened to the meeting. The employee, whose identity Business Insider confirmed, asked to remain anonymous to discuss internal matters.Intel has privately invested billions in factory expansions in New Mexico, Arizona, Ohio, and Oregon. It has not yet received the CHIPS grants.Gelsinger publicly addressed this topic in a Thursday interview with Bloomberg after the third quarter earnings call.\"The CHIPS Act was a bipartisan act, and with that strong support from both sides of the aisle, we believe the importance of that in terms of industrial policy. The semiconductor is well-supported by Congress and both parties,\" Gelsinger said.He also addressed the delay of CHIPS Act funding distribution.\"We are disappointed by how long and how slow the dispensing of funds has been and it's well over two years at this point. I've invested 30 billion in capital and we've seen $0 of the grants at this point. So we do believe that that has been too slow, and we're somewhat frustrated by that,\" Gelsinger said in the Bloomberg interview.Policymakers recently in Washington, DC, have discussed whether Intel needs additional help beyond the CHIPS Act funding as a precautionary measure, as Intel's success is key to evolving American manufacturing policies, Semafor reported.Government leaders are also monitoring the CHIPS Act funding delays. Ohio governor Mike DeWine said Wednesday that he contacted the White House to ask it to speed up the distribution of funding from the CHIPS Act for its New Albany factory.The CHIPS Act was passed largely in a bipartisan fashion in 2022. Stephen Ezell, the vice president for global innovation policy at the Information Technology and Innovation Foundation and the director of its Center for Life Sciences Innovation, previously told BI he expects no \"considerable change\" in approach whether presidential candidates Kamala Harris or Donald Trump are elected.Besides the delay in receiving CHIPS Act funds, Intel has faced a series of setbacks to its business. The S&P Dow Jones Indices said Friday that Nvidia would replace Intel in the Dow Jones Industrial Average. This change indicates that Intel is no longer seen as a stable economic indicator.Intel's recent profitability was \"negatively impacted\" by cost reduction changes as the company is \"maniacally focused on improving fab productivity,\" Gelsinger said during its third-quarter earnings call.Amid a challenging financial adjustment, Intel is relying upon the success of its 18A chip. In the past, the company has faced customer losses and delays in its 14-nanometer and 10-nanometer chips due to yield issues.Intel plans to reduce spending with a cost-savings plan and has cut staff by 15%.Got a tip about Intel? Contact this reporter at hli@insider.com or use the secure messaging app Signal with the username hliwrites.99.","summary":"Intel CEO addresses employee concerns on US election impact on CHIPS Act funding, emphasizing bipartisan support.","url":"https://www.businessinsider.com/intel-chips-act-funding-all-hands-meeting-2024-11","image":"https://i.insider.com/66f2f378d17aa3c7b2b58cc7?width=1200&format=jpeg","video":null,"publish_date":"2024-11-01 23:54:30","author":"Helen Li","authors":["Helen Li"],"language":"en","source_country":"US","sentiment":-0.407},{"id":261994750,"title":"Pennsylvania voters with defective mail-in ballots can cast provisional votes in person, Supreme Court rules","text":"WASHINGTON — The Supreme Court on Friday handed a loss to Republicans by allowing Pennsylvania voters who sent mail-in ballots that were flagged as being potentially defective to submit a separate provisional in-person ballot.\n\nThe justices with no noted dissents rejected a Republican request to put on hold a Pennsylvania Supreme Court ruling from last week.\n\nJustice Samuel Alito, one of the court’s conservatives, wrote a brief statement saying that although it is an issue of “considerable importance” there were several reasons for the court to not get involved at this stage. His statement was joined by two other conservatives, Justice Clarence Thomas and Justice Neil Gorsuch.\n\nThe case, as Alito noted, arose from a dispute over two ballots submitted during the “long-completed” Democratic primary in Butler County this year. Although it is unclear exactly how many ballots the legal theory would affect if it applied to the general election, it could be several thousand and have major legal ramifications if any statewide contests are close in the key swing state.\n\nThe Supreme Court action does not definitively resolve the legal issue, which could yet return to the justices.\n\nMany of Pennsylvania’s counties, which administer elections, already allowed for voters to cast provisional ballots if their mail-in ballots lacked a secrecy envelope even before the recent state Supreme Court ruling. Some do not.\n\nMore litigation is possible in the coming days.\n\nThe state court had concluded that mail-in ballots that machines detect as lacking secondary “secrecy envelopes” required under Pennsylvania law are void, therefore allowing the voter to cast a provisional ballot, a finding that Republicans had argued against.\n\nSuch ballots automatically lead to voters being notified that there are problems with the ballots that can be remedied by voting in person.\n\nIn their filing at the Supreme Court, Republicans said that state law requires any ballots that do not meet the strict standards to be rejected and does not allow for voters to get a do-over. Under their interpretation of the law, that would include not just ballots lacking the secrecy sleeve, but also ballots that are not dated, not dated correctly or lack a signature.\n\nThe state, which was not sued and is not a defendant in the case, filed a friend-of-the-court brief at the Supreme Court urging the justices not to intervene, saying the ruling from the top state court did not institute a dramatic change.\n\nLawyers for the state wrote that Supreme Court intervention would only serve to prevent two votes in the Democratic primary from being counted months after the fact.\n\nThe litigation raises a legal question of interest to conservatives on the Supreme Court about whether the ruling from Pennsylvania’s high court unlawfully encroaches on the Legislature’s authority to set election rules under the U.S. Constitution.\n\nThe issue was the subject of a Supreme Court ruling last year that largely rejected the “independent state legislature” theory, which says legislatures have unfettered authority over elections, while leaving the door open to revisit the matter in future.\n\nRepublicans in the 2020 election repeatedly argued that Democratic officials and state courts inappropriately changed election rules, mostly to address health concerns raised by the Covid pandemic. Those cases provided fodder for then-President Donald Trump’s failed efforts to overturn his election loss. Trump in 2020 also frequently railed against the expanded use of mail-in voting.\n\nThe latest case arose when two Butler County voters, Faith Genser and Frank Matis, sent defective mail-in ballots in the primary election and were notified they would not be counted. They subsequently cast provisional ballots in person.\n\nThey filed a lawsuit after being told that the votes would not be counted. The Republican National Committee then intervened.\n\nGenser and Matis lost in a trial court, but an intermediate appeals court and the Pennsylvania Supreme Court ruled in their favor, prompting Republicans to appeal again to the U.S. Supreme Court.\n\nThe Republican National Committee and affiliated lawyers have filed a slew of lawsuits ahead of the 2024 general election in swing states, including Pennsylvania, with Trump among those fueling unfounded concerns of widespread election fraud.\n\nIn 2020, President Joe Biden won Pennsylvania by just over 80,000 votes.","summary":"WASHINGTON — The Supreme Court on Friday handed a loss to Republicans&#8230;","url":"https://internewscast.com/news/us/pennsylvania-voters-with-defective-mail-in-ballots-can-cast-provisional-votes-in-person-supreme-court-rules/","image":null,"video":null,"publish_date":"2024-11-01 23:53:09","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.579},{"id":261994672,"title":"‘Violent chaos’: Fears grow for US election","text":"All eyes are on social media platform X as fears grow next week’s US Presidential election could degenerate into violent chaos.\n\nEspecially because anyone who wants to can cash in on it.\n\nA BBC investigation has found many X (formerly Twitter) users who share and generate election misinformation are being paid thousands of dollars in revenue by the controversial billionaire Elon Musk’s company.\n\nAnd a Wall Street Journal study has revealed even brand new accounts with no declared political interests or leanings are being flooded by aggressively pro-Trump posts.\n\n“If that cringe, dingbat, zero-votes, airhead Kamala Harris is able to cheat enough to win the presidency the USA is over,” an anonymous user named “catturd2” pronounced. This somehow managed to appear in almost all 14 of the Journal’s freshly created accounts.\n\nThe revelations come as political analysts voice their concerns that new, sophisticated manipulation tactics are at play on social media for the 2024 election campaign.\n\nAnd it’s all about generating doubt.\n\nGenerative AI chatbots, generative AI images and generative AI footage.\n\nAnd social media algorithms are still as unusually eager to promote hostile, contentious and fake content to unwilling users as they were during the contentious 2019 election campaign.\n\n“Every day brings new examples of fake campaign-related pictures, videos, and narratives,” warns Brookings Institution analyst Darrell West. \n\n“So, we shouldn’t be surprised on election night if we see false narratives seeking to affect people’s belief about election integrity and the true winner of the race.”\n\nAlternate truths\n\n“In recent weeks, there have been false images of Kamala Harris in a swimming suit hugging convicted sex offender Jeffrey Epstein, an AI-generated video of a young man saying he was sexually abused by Tim Walz 30 years ago, a fraudulent Fordham transcript for Donald Trump claiming he had a barely passing 1.28 grade point average,” West reported.\n\nThen there are the conspiracy theories accusing Trump of staging his assassination attempts for sympathy and pronouncements that US hurricane disaster relief funding had been diverted to illegal immigrants.\n\nNone of the above was true. \n\nBut that didn’t stop the claims from spreading like wildfire across social media platforms.\n\nHowever, the Wall Street Journal study has found that, in the final sprint towards the November 5 polls, its posts paved the way for accusations of a rigged election result that have floated to the top.\n\n“They are getting ready to CHEAT!” Republican presidential candidate Donald Trump blared in a September 23 post on his Truth Social account – a company he owns.\n\nSimilarly, false claims boosted by Musk’s personal account on his X platform are gaining maximum exposure. But he’s also personally contributing to the fire hose of falsehoods: “Michigan has more registered voters than eligible citizens!? Is that true?” he posted while boosting an anonymous (but revenue-earning) political account. \n\nIt is. But not in the election-rigging manner Musk infers. The state is not allowed to remove inactive voters (through death, disability or migration) until after each election cycle.\n\nMusk went on to declare “this is crazy” in response to another anonymous – and demonstrably incorrect – allegation that not-for-profit organisations were “harvesting” hundreds of thousands of post-in ballots from among the homeless.\n\nHis company’s algorithms boosted both false claims to generate tens of millions of views.\n\nThe Institute for Strategic Dialogue (ISD) believes similar posts – many of which share fake images of 2024 voting ballots alongside passports of foreign countries (including the defunct Nazi Germany and Soviet Union) – are being boosted across X in the lead up to the election.\n\n“The claims appear to be part of an effort to mislead voters by playing on recent fearmongering about noncitizens casting ballots in the presidential election,” it reported. \n\n“These accounts appear co-ordinated, with the largest account referring to the network as ‘my group’ and many of the accounts posting identical language and images.”\n\nPriming chaos\n\n“In contested elections, candidates sometimes have political incentives to claim victory before there is independent and objective evidence of winning,” warned the Brookings Institution’s West.\n\n“There should be no victory speeches taken seriously by anyone until there is actual evidence of triumph because that simply would be an effort to claim the moral high ground for coming legal and political battles.”\n\nTurnout for the 2024 election is expected to be high. And that’s spurred attacks on the integrity of the US postal ballot and voter registration systems.\n\nAnd widespread expectation of rapid results means all sides will be deeply suspicious of any delay. And they’re being encouraged to take matters into their own hands.\n\n“If it turns out to be a very close election in 2024, as is expected right now, that uncertainty will spawn disinformation,” West added.\n\nA key example is likely to be Pennsylvania.\n\nIt’s one of the swing states that appears evenly tied in the polls.\n\nRepublicans generally vote on the day. More Democrats tend to vote via post.\n\nIn 2020, this long-observed trend appeared once again in real-time vote counting. \n\nNevertheless, some seized it as evidence of vote rigging. Investigations later found all claims to be without basis.\n\n“The risk in 2024 is that disinformation agents either from the United States and/or abroad will repeat those claims, and those accusations will sound believable to sceptical voters,” West warned.\n\n“Both sides will be watching vote casting and tabulations and filing legal claims based on their observations … It will be easy for either side to promote false narratives if the ballots take several days to process.”\n\nSuch narratives have already been appearing for several months.\n\n“These people are trying to get [illegals] to vote,” Trump said during the September presidential debate, an accusation levelled at Democrat hopeful Kamala Harris.\n\n“And that’s why they’re allowing them to come into our country.”\n\nRecent polls show some 88 per cent of Republican voters are concerned mass illegal voting will apply to the upcoming election. That’s despite recent law changes and multiple state and federal investigations.\n\nSo much so that one in five agreed to a survey question asking if Trump should “declare the results invalid and do whatever it takes to assume office” should he lose.\n\n‘I want to believe’\n\nAI-generated “bot” content has been tracked spreading in reach and number across X in particular for several years, added University of Sydney communications expert Dr Timothy Koskie. \n\nAnd it is targeting willing ears.\n\n“Research has indicated that many people will knowingly spread misinformation if it aligns with their views or paints them in a particular light,” he said. \n\n“While claims of ‘fake news’ might raise images of deeply invested conspiracy theorists, its spread and reception is often down to simple inattention or its presence on a preferred source.”\n\nAnd those who indulge in disinformation are being rewarded. Changes early in October to X payment policies mean the number of views of individual posts – not just exposure to display adverts – will earn users payment. Controversial election posts are both topical and being boosted by X’s algorithms.\n\n“Many social media sites allow users to make money from their posts or to share sponsored content,” the BBC report reads.\n\n“But they often have rules which allow them to demonetise or suspend profiles that post misinformation. X does not have guidelines on misinformation in the same way.”\n\nAnd the Wall Street Journal analysis of X’s social media content-boosting algorithms shows it has been primed to reward such content.\n\n“Less than a third of unique posts seen by the Journal’s accounts were political in nature. But X’s algorithm re-upped political posts so often that they accounted for about half of the total posts,” the report stated. \n\n“The majority of the political posts X served the bots were from conservative figures and pro-Trump accounts.”\n\nX has yet to respond to either the BBC or Journal reports.\n\nThe US Office of the Director of National Intelligence (ONI) has reported that foreign powers do not appear to be attacking the integrity of US voting systems, as they had in previous years. \n\nInstead, the focus of propagandists and hackers backed by hostile nations – including China, Iran and North Korea – was to “undermine trust in the integrity of the election and election processes, as well as to further exacerbate divisions among Americans”.\n\nThe July report specifically pointed the finger at Russia as the “predominant threat to US elections”. But it had been “working to better hide its hand” than it had in the 2016 campaign.\n\nJamie Seidel is a freelance writer | @JamieSeidel","summary":"All eyes are on social media as the US election looms, with experts warning the country could soon descend into devastating violence.","url":"https://www.news.com.au/technology/online/social/violent-chaos-fears-grow-for-us-election-as-disinformation-spreads-online/news-story/e9ab07a715dac5d2cc874ad7ace45ef3?from=rss-basic","image":"https://content.api.news/v3/images/bin/116809af73f413e17c5620a7743d4f57","video":null,"publish_date":"2024-11-01 23:52:33","author":"Jamie Seidel","authors":["Jamie Seidel"],"language":"en","category":"politics","source_country":"au","sentiment":-0.073},{"id":261995226,"title":"Fake videos from Russian propagandists aim to raise tensions ahead of Election Day","text":"In a video posted to X on Thursday, a man claiming to be a Haitian immigrant says he's already voted for Vice President Kamala Harris in Gwinnett County, Ga., and is headed to vote again in nearby Fulton County. Seated in what appears to be in a van next to another purported Haitian immigrant, he says they arrived in the U.S. six months ago and have already become American citizens.\n\nState and federal officials say the video was likely created by Russian propagandists trying to undermine confidence in the election.\n\n\"This is obviously fake and part of a disinformation effort. Likely it is a production of Russian troll farms,\" Georgia Secretary of State Brad Raffensperger said on Thursday. On Friday, federal officials weighed in, saying they also believe the video was \"manufactured\" by Russian influence actors.\n\n\"This Russian activity is part of Moscow's broader effort to raise unfounded questions about the integrity of the U.S. election and stoke divisions among Americans,\" the Office of the Director of National Intelligence, the FBI, and the Cybersecurity and Infrastructure Security Agency said in a joint statement.\n\nThe video is the latest hoax that researchers say matches the output of a Russian operation known as Storm-1516, which they say is pumping out a steady stream of phony material in the final days of voting. The operation is known for producing staged videos that it launders through online influencers and sham news outlets. It has been tied by Clemson University to the notorious Russian \"troll factory\" that targeted the 2016 presidential election.\n\nIn just the past two weeks, researchers at Clemson and Microsoft have linked Storm-1516 to a fake video purporting to show ballots marked for former President Donald Trump being destroyed in Pennsylvania and baseless accusations against Democratic vice presidential nominee Tim Walz. Federal officials also attributed those videos to Russia.\n\n\"Immediately I was suspicious of this [Georgia] video, just when I saw the style and production value,\" said Darren Linvill, co-director of Clemson University's Media Forensics Hub, which first identified the Storm-1516 operation last year.\n\nThe subject matter also matches the Russian tactic of amplifying existing divisive narratives to American voters, he said.\n\n\"This is connecting to existing stories that are being told about the Haitian community, about immigrants being used for voting,\" Linvill said. \"The Russians understand these schisms, and they use those schisms to spread their messages.\"\n\nThe account that Linvill identified as the first to share the video on X has since deleted it. In a direct message exchange with NPR, the person running the account wrote, \"I took it down because I wasn't sure if it was 100% accurate and I don't want to be liable for misinformation.\"\n\nIt's not clear exactly how the fake Georgia video reached this X account. The account told NPR it saw the video on Telegram, but did not respond to follow-up questions.\n\nThe video has continued to spread widely on social media, primarily X, spurring Raffensperger to call publicly on X owner Elon Musk and leaders of other platforms to take it down.\n\n\"X found these posts to be violative of our Civic Integrity Policy and we are taking action against the posts,\" a spokesperson for X said. Another X account that posted the Georgia video, which has also posted other content connected to Storm-1516, has been suspended.\n\nFacebook is putting labels on the video informing users that U.S. intelligence officials have said it was manufactured by Russian influence actors.\n\nThe IRA's successor \n\nIn 2016, Russian operatives working at the Internet Research Agency in St. Petersburg impersonated Americans and posed as news sources on social media to push false and misleading stories to U.S. voters.\n\nThe IRA was the creation of Yevgeny Prigozhin, the Russian oligarch and erstwhile confidant of Russian President Vladimir Putin, who died in 2023. In a recent report, Clemson identified connections between Storm-1516 and another group founded by Prigozhin in 2021 called the Russian Foundation to Battle Injustice.\n\n\"We believe this is IRA 2.0. It's the same people, it's the same network, it's the same old ownership,\" Linvill said.\n\nToday, Linvill says Storm-1516 has refined some of the IRA's methods. Its videos sometimes appear on websites disguised as news outlets, such as a site posing as a nonexistent San Francisco television station that shared a staged video accusing Harris of injuring someone in a 2011 hit-and-run. (There's no evidence the incident occurred.)\n\nSome sites sharing the operation's content are part of a network of websites masquerading as local U.S. news outlets that the misinformation-tracking company NewsGuard and the New York Times have reported are run by John Mark Dougan, a former deputy sheriff from Florida who now lives in Moscow. Dougan denies working for the Russian government. However, a European intelligence agency obtained documents showing he is working directly with Russian military intelligence, according to reporting by the Washington Post.\n\nLinvill says Storm-1516 is also now relying on real people, rather than bots or fake accounts, to spread their messages and videos.\n\nHe said that reflects both a change in Russian tactics and an environment in which many Americans are more receptive to claims of malfeasance amid Trump's ongoing attacks on election integrity.\n\n\"They've put effort into building the network. They put effort into making these connections with real humans,\" Linvill said. \"But it is also true that people are now primed for [that]. You can't separate these things. The Russians changed their tactics to conform to the changes in our reality.\"\n\nAs Election Day approaches, government officials are cautioning Americans to be on the alert for more Russian attempts to target confidence in the election.\n\n\"We are very concerned about how our foreign adversaries will specifically target after Election Day, in that period of time where election officials around the country are taking the incredibly important work of certifying the official results,\" a senior CISA official, who spoke to reporters on the condition of anonymity, said on Friday.\n\nLinvill says he's braced for a new fraudulent video every day. \"I'm sure they've got them queued up,\" he said.\n\nNPR's Miles Parks contributed reporting.","summary":"Intelligence officials says the video, which purported to show a Haitian immigrant claiming he had voted multiple times in Georgie, is the product of a Russian propaganda operation.","url":"https://www.npr.org/2024/11/01/nx-s1-5170334/russia-propaganda-georgia-video","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5956x3350+0+94/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb8%2F27%2F1b1313ff461fadfbfe8faf3502d0%2Fgettyimages-2181595421.jpg","video":null,"publish_date":"2024-11-01 23:48:59","author":"Shannon Bond","authors":["Shannon Bond"],"language":"en","category":"politics","source_country":"us","sentiment":-0.411},{"id":261994962,"title":"Supreme Court allows Pennsylvania to count contested provisional ballots, rejecting Republican plea","text":"PENNSYLVANIA -- The Supreme Court on Friday rejected an emergency appeal from Republicans that could have led to thousands of provisional ballots not being counted in Pennsylvania as the presidential campaigns vie in the final days before the election in the nation's biggest battleground state.\n\nThe justices left in place a state Supreme Court ruling that elections officials must count provisional ballots cast by voters whose mail-in ballots were rejected.\n\nThe ruling is a victory for voting-rights advocates, who had sought to force counties - primarily Republican-controlled counties - to let voters cast a provisional ballot on Election Day if they had realized that their mail-in ballot was to be rejected for various garden-variety errors.\n\nRELATED | Long lines, some confusion on final day for 'on demand' voting in Bucks County\n\nAs of Thursday, about 9,000 ballots out of more than 1.6 million returned have arrived at elections offices around Pennsylvania lacking a secrecy envelope, a signature or a date, according to state records.\n\nPennsylvania is the biggest presidential election battleground this year, with 19 electoral votes, and is expected to play an outsized role in deciding the election between Republican Donald Trump and Democrat Kamala Harris.\n\nIt was decided by tens of thousands of votes in 2016 when Trump won it and again in 2020 when Democrat Joe Biden won it.\n\nThe ruling comes as voters had their last chance Friday to apply for a mail-in ballot in a bellwether suburban Philadelphia county while a county clear across the state gave voters who didn't receive their ballot in the mail another chance to get one.\n\nA judge in Erie County, in Pennsylvania's northwestern corner, ruled Friday in a lawsuit brought by the Democratic Party that about 15,000 people who applied for a mail ballot but didn't receive it may go to the county elections office and get a replacement through Monday.\n\nThe deadline to apply for a mail-in ballot has passed in Pennsylvania. But the judge's ruling means that Erie County's elections office will be open every day through Monday for voters to go in, cancel the mail-in ballot they didn't receive in the mail, and get another one over the counter.\n\nIn suburban Philadelphia's Bucks County, a court set a deadline of 5 p.m. for voters there to apply for and receive a mail-in ballot.\n\nLines outside the county's elections office in Doylestown were long throughout the day - snaking down the sidewalk - with the process taking about two hours by Friday afternoon.\n\nNakesha McGuirk, 44, a Democrat from Bensalem, sized up the line and said: \"I did not expect the line to be this long. But I'm going to stick it out.\"\n\nShe faces a long work commute next week and worried about her ability to make it to the polls on Election Day. \"I figured that rather than run into the risk of not getting home in time to go and vote, that it would be better to just do it this way early,\" said McGuirk, a Harris supporter.\n\nRepublican voter Patrick Lonieski, a Trump supporter from Buckingham, also found it more convenient with his work schedule to vote Friday in a county he called \"pivotal\" to the outcome.\n\n\"I just want to make sure I get my ballot in and it's counted,\" said Lonieski, 62, who was joined by his 18-year-old son, voting for the first time.\n\nThe line steadily dwindled as 5 p.m. approached. One last straggler broke into a run to make it by the deadline as elections workers cheerfully counted down the seconds. \"Let's go! Hurry up! You can do it!\" a bystander yelled. People broke into applause as she walked through the door - just in time.\n\nA Bucks County judge had ordered the three-day extension in response to a Trump campaign lawsuit alleging that voters faced disenfranchisement when they were turned away by county application-processing offices that had struggled to keep up with demand, leading to frustration and anger among voters.","summary":"The justices left in place a state Supreme Court ruling that elections officials must count provisional ballots cast by voters whose mail-in ballots were rejected.","url":"https://abc7news.com/post/supreme-court-allows-pennsylvania-count-contested-provisional-ballots-rejecting-republican-plea/15498128/","image":"https://cdn.abcotvs.com/dip/images/15480049_102824-cc-ap-voting-generic-img.jpg?w=1600","video":null,"publish_date":"2024-11-01 23:46:27","author":"Mike Catalini And Michael Rubinkam","authors":["Mike Catalini And Michael Rubinkam"],"language":"en","source_country":"US","sentiment":-0.625},{"id":261994522,"title":"Trump makes 'peace on Earth' appeal to Arab-American voters in key battleground state","text":"Former President Donald Trump made a brief stop in the heavily Arab-American city of Dearborn, Michigan on Friday, in a continued effort to hold out an olive branch for the Islamic community in the battleground state. Visiting The Great Commoner coffee shop in Dearborn, Trump cast himself as an alternative to President Biden's handling of Israel's war in Gaza and Lebanon following the Hamas terrorist attack on Oct. 7. \"We have to get this whole thing over with,\" Trump said, speaking of the continuing conflict in the Middle East. \"We want to have peace. We want to have peace on earth.\" TRUMP, HARRIS HEAD TO BATTLEGROUND STATES OF MICHIGAN AND WISCONSIN Trump spoke confidently of winning the swing state of Michigan, saying that his campaign \"wants their votes.\" \"We have a great feeling for Lebanon and I know so many people from Lebanon, Lebanese people and the Muslim population, they're liking Trump, and they've had a good relationship with him,\" he said. \"This is it, this is where they are, Dearborn.\" \"We want their votes, and we're looking for their votes and I think we'll get their votes,\" he said. Trump’s visit is a continuation of his outreach to the Arab and Muslim community. His efforts have earned the endorsements of Bill Bazzi, the first Muslim and Arab American mayor of Dearborn Heights, and Amer Ghalib, the Yemeni American mayor of Hamtramck. WATCH: Residents in Dearborn, the home to one of the largest Muslim communities in the United States, previously shared with Fox News Digital their strong disappointment in the Biden-Harris administration's handling of the Israel-Gaza conflict. TRUMP CRITICISM OF LIZ CHENEY AS ‘RADICAL WAR HAWK’ FRAMED AS CALL FOR VIOLENCE BY ‘IRRESPONSIBLE’ MEDIA \"We are really disappointed in what happened in Gaza the last one year,\" Rezul, a registered Democrat, previously told Fox News Digital. He said that the Arab community is concerned about the Muslims \"dying in Gaza.\" \"So just as an American Muslim, I can't support and people like me can't support the current administration and Kamala,\" Shadi, a Trump supporter, said. The final push: This weekend, Trump and Vice President Kamala Harris will make a final push to convince undecided voters before Tuesday. Harris will have stops in Georgia, Michigan, North Carolina and Wisconsin before wrapping her campaign Monday in Pennsylvania. CLICK HERE TO GET THE FOX NEWS APP Trump will be traveling to Michigan, North Carolina, Wisconsin and Virginia. He'll end his campaign with stops Monday in North Carolina and Pennsylvania. Fox News Digital's Joshua Nelson contributed to this report.","summary":"Former President Trump made an appeal to Arab-American voters the battleground state of Michigan Friday, saying that he &quot;wants to have peace on Earth.&apos;","url":"https://www.foxnews.com/politics/trump-makes-peace-earth-appeal-arab-american-voters-key-battleground-state","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/trumpmichigan.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-01 23:44:31","author":"Sarah Rumpf-Whitten","authors":["Sarah Rumpf-Whitten"],"language":"en","category":"politics","source_country":"US","sentiment":-0.092},{"id":261994724,"title":"The Supreme Court decides not to toss out thousands of Pennsylvania ballots","text":"On Friday evening, the Supreme Court ruled it would leave in place a Pennsylvania Supreme Court decision that made it marginally easier for certain voters in the state to cast a ballot. The Republican Party had asked the justices to block that decision; doing so would have likely disenfranchised thousands of voters.\nBut that won’t happen. The Court’s decision in Republican National Committee v. Genser was unanimous, although Justice Samuel Alito wrote a statement indicating that he and Justices Clarence Thomas and Neil Gorsuch are only ruling against the GOP on narrow procedural grounds.\nThe problem at the heart of the case was that Pennsylvania law is unusually strict regarding how mailed ballots must be returned by voters. They must be stuffed in two envelopes, and if the inner envelope is missing, the ballot is void. The state supreme court decision at issue in Genser ruled that voters who cast such a voided ballot can still vote if they show up on Election Day and cast a provisional ballot.\nThe case was closely watched because the presidential race is expected to be close, and it is likely that several thousand voters will be impacted by this decision. Also, Democrats tend to vote by mail more often than Republicans. So, if the presidential election is indeed very close and it all comes down to Pennsylvania — and if mail-in ballots do favor Democrats this year — a victory for the GOP in Genser could have flipped the result and put Donald Trump back in the White House.\nA win for the GOP could have scrambled future elections, too. The GOP’s legal arguments relied on a radical theory known as the “Independent State Legislature” doctrine, which has been rejected many times by the Supreme Court, but which all but one of the Court’s Republican members have expressed sympathy toward in the past.\nIf you want a full explainer on this doctrine, you can read my preview of the Genser case here. But the important thing to know about it is that it takes power over elections away from state courts and places it in the hands of state legislatures, in a manner that could completely scramble how the US currently holds elections. A brief filed by an array of admirals, generals, and service secretaries warned that the doctrine “undermines election integrity and exacerbates both domestic and foreign threats to national security.”\nSo the Court was asked to play with some very dangerous magic in Genser and, to their credit, all nine justices refused this request.\nThe Genser decision should also give a small degree of comfort to Democrats, who’ve had good reason to wonder if this Court — which has a 6-3 Republican majority — can be trusted to referee a close election after its Trump immunity decision, in which the justices declared Trump was allowed to commit many crimes as president. At the very least, Genser is a sign that this Court won’t embrace literally any legal theory put forth by the Republican Party.","summary":"On Friday evening, the Supreme Court ruled it would leave in place a Pennsylvania Supreme Court decision that made it marginally easier for certain voters in the state to cast a ballot. The Republican Party had asked the justices to block that decision; doing so would have likely disenfranchised thousands of voters. But that won’t [&#8230;]","url":"https://www.vox.com/scotus/381997/supreme-court-republican-genser-pennsylvania-ballots","image":"https://platform.vox.com/wp-content/uploads/sites/2/2024/11/GettyImages-2180210811.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200","video":null,"publish_date":"2024-11-01 23:42:50","author":"Ian Millhiser","authors":["Ian Millhiser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.404},{"id":261994364,"title":"Steep decline in support from California Hispanics could signal deeper problems for Harris","text":"Only 57% of Hispanics across the Golden State backed Harris’s presidential campaign, according to a new poll conducted by the University of California, Berkeley’s Institute of Governmental Studies. The number marks a sharp downturn from the 75% of California Hispanics who supported President Joe Biden in 2020. \n\nThe same trend continues when looking at Asian Americans. The survey, which was co-sponsored by the Los Angeles Times and polled 4,341 Californians this month, found that 56% of the voting block backed Harris, down from 75% who supported Biden during his presidential campaign four years ago. Meanwhile, the vice president has seen Democratic support from black voters drop by 5 percentage points since the 2020 election. \n\nThe survey did find some good news for Harris, with data showing she has widened her margin of support among white voters by 7 percentage points since Biden’s 2020 presidential campaign. Still, when measuring support for the vice president’s campaign among all voters in the Golden State, she’s seen a decline of over 6 percentage points from Biden’s 2020 numbers. \n\nWhile California remains a solidly blue state, should Asian Americans and Hispanics be turning to former President Donald Trump in neighboring battleground states such as Arizona and Nevada, where even a few thousand votes could change the outcome of the election, the news could sound a death knell to Harris’s presidential ambitions. \n\nFormer President Donald Trump has often argued he’s seeing gains in support from California Hispanics, commenting on the matter this week at a North Carolina rally and most recently during a campaign stop in Henderson, Nevada. \n\nLamenting Gov. Gavin Newsom’s (D-CA) move to sign a bill banning voter ID requirements in the Golden State earlier this year, Trump said that if he had a “fair” vote count, “I would do great in California,” because “Hispanics like me.” \n\n“I’m glad that they love me. They should love me, and I love them,” Trump told Nevada supporters Thursday evening. “But I would do great if we had an honest [vote]. I always say, if God came down just for one day to be the vote counter … In other words, I would win in California.”\n\nUC Berkeley’s Institute of Governmental Studies also revealed that support for Trump among Hispanic men is particularly high, a trend which appears to be mirrored in nearby Arizona. \n\nA recent USA Today poll found that 51% of Arizona’s Hispanic male voters between 18 to 34 years old back Trump. It also found support for Harris from Latino voters overall had declined from Biden’s 2020 numbers.\n\n“You’re not seeing the same kind of strong support for the Democratic ticket among Latinos,” Mark DiCamillo, who oversaw the UC Berkeley’s Institute of Governmental Studies survey, told the Los Angeles Times. “That has implications for Arizona and maybe Nevada as well.”\n\nNevada and Arizona will be crucial for both presidential candidates to capture in order to pull off a victory come Election Day. Trump currently holds a slim edge over Harris in both battleground states, per an aggregate of polling from RealClearPolitics.","summary":"If Vice President Kamala Harris’s declining performance among traditionally Democratic voting blocs in California foreshadows trends in battleground states, her campaign could face unwelcome news come Election Day.&#160; Only 57% of Hispanics across the Golden State backed Harris’s presidential campaign, according to a new poll conducted by the University of California, Berkeley’s Institute of Governmental [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3213678/steep-decline-support-california-hispanics-problems-harris/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/Harris-CA-.webp","video":null,"publish_date":"2024-11-01 23:41:42","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","source_country":"US","sentiment":-0.089},{"id":261994000,"title":"Harris condemns Trump over \"violent rhetoric\" about Liz Cheney","text":"Harris condemns Trump over \"violent rhetoric\" about Liz Cheney\n Former President Donald Trump attacked former Rep. Liz Cheney, one of his most ardent critics, on Thursday as a \"war hawk\" and suggested she be sent into the line of fire. Vice President Kamala Harris lambasted Trump for his attack on Cheney and said his rhetoric targeting his political opponents has grown increasingly violent. Nancy Cordes has more.","summary":"Former President Donald Trump attacked former Rep. Liz Cheney, one of his most ardent critics, on Thursday as a \"war hawk\" and suggested she be sent into the line of fire. Vice President Kamala Harris lambasted Trump for his attack on Cheney and said his rhetoric targeting his political opponents has grown increasingly violent. Nancy Cordes has more.","url":"https://www.cbsnews.com/video/harris-condemns-trump-over-violent-rhetoric-about-liz-cheney/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/01/7e7de097-b35e-45de-b5c0-1329a05dcddf/thumbnail/1200x630/52c5e73f68418c30f4b888f763f9f4af/cordes.jpg?v=379420b9063a2aadbcd559df18e2d1ae","video":null,"publish_date":"2024-11-01 23:33:03","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.096},{"id":261997476,"title":"Figures, Dobson make closing pitches to voters in Alabama congressional race - The Associated Press","text":"MONTGOMERY, Ala. (AP) — The two candidates for Alabama’s 2nd Congressional District, which was redrawn by a federal court after a lengthy redistricting battle, made their final campaign pushes this week, seeking to drive turnout in the race that could play a role in the battle for control of the U.S. House of Representatives. \n\nThe once safe Republican seat was reshaped after a federal court ruled Alabama had illegally diluted the power of Black voters. The non-partisan Cook Political Report ranks the new district, where Black voters make up nearly 49% of the voting-age population, as “likely Democrat.” But both campaigns have said the seat is competitive. \n\nIn their closing messages, both candidates emphasized a push for voter turnout. \n\nStanding near a statue of Rosa Parks in downtown Montgomery, Shomari Figures, the Democratic nominee, on Thursday called the race an opportunity to build upon the progress of the civil rights movement. Figures, the son of a civil rights attorney and Alabama legislator, worked as a top aide to U.S. Attorney General Merrick Garland and as an aide in the Obama White House.\n\n“When you grow up in Mobile and in Alabama you learn very very early in life the role that the federal government has had to play in making the state do right by its people,” Figures said during a stop in Mobile.\n\nFigures has emphasized the need to work on longstanding problems with health care, infrastructure and education, often noting that Alabamians have among the lowest life expectancies in the nation. \n\n“We’re going to win this thing. But the goal is not to win. The goal is to do the work,” he said.\n\nFormer President Barack Obama recorded a message encouraging voters to support Figures. “America needs you to lead the charge for change once again,” Obama said in the message that also invoked the state’s civil rights history. \n\nU.S. House Minority Leader Hakeem Jeffries traveled to Alabama to support Figures as Democrats eye an opportunity to flip the Deep South seat. \n\nRepublican Caroleene Dobson has emphasized concerns about inflation and immigration, issues that she said are worries for families across the political spectrum. On Friday, she greeted the breakfast crowd at a popular Montgomery deli. \n\nThe race is about turnout, she told supporters. “I think now is an opportunity for the people of this district to really send a message to Washington. We don’t want more of the status quo.” Dobson said afterward.\n\nDobson, a real estate attorney, has repeatedly called Figures a “Washington insider.”\n\n“What’s consistent in every conversation that I have throughout the district is that we cannot sustain another four years of high prices and rising crime. And it’s not just that my opponent doesn’t have solutions to these problems, he helped put in place policies that have caused these problems,” Dobson said. \n\nThe Alabama Republican Party sent out a series of controversial mailers attempting to attack Figures. One about a Department of Justice clemency initiative had a large mug shot of a Black man arrested on a 2023 drug trafficking charge with text saying that Figures “supports releasing dangerous criminals.” \n\nFigures in a statement called the ads an attempt at “race-baiting.” \n\n“If the Republican party wanted to send out a mailer of a criminal, they should’ve put out a mailer with Donald Trump on it,” Figures added. \n\nAlabama Republican Party Chairman John Wahl defended the mailers, saying that “crime affects people of all backgrounds, and every victim deserves justice, regardless of race.” \n\nThe mailers were sent by the state party and not the Dobson campaign.\n\nDuring the Friday campaign stop, Charlie Trotman, a Montgomery real estate developer, told Dobson that she had his vote.\n\n“She is to me somebody I would be very proud to represent us. I think she is smart,” Trotman said.\n\nIn Mobile, Shalela Dowdy, one of the Black voters who challenged the state’s prior congressional map, called the election the “fight of our lives” but said that she is cautiously optimistic.\n\nDowdy, a graduate of the U.S. Military Academy at West Point, said she joined the litigation because the needs of Black communities were being ignored. She said the district is now drawn so the winner will have to be responsive to all communities, both Black and white.\n\n“It will provide them a seat at the table, to have a voice and not be forgotten about,” Dowdy said. \n\nAssociated Press writer Safiyah Riddle contributed to this report.","summary":"Figures, Dobson make closing pitches to voters in Alabama congressional race  The Associated Press","url":"https://apnews.com/article/alabama-2nd-congressional-district-race-7a10ce46176946b7f018d6c50b035704","image":"https://dims.apnews.com/dims4/default/904e6f4/2147483647/strip/true/crop/3030x1704+0+163/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F6a%2F2ff8fe707070583693e876976ac5%2Fab0c8ab7e7644725b07b2818ce04f917","video":null,"publish_date":"2024-11-01 23:33:00","author":"Kim Chandler","authors":["Kim Chandler"],"language":"en","source_country":"us","sentiment":-0.068},{"id":261993788,"title":"Johnson ‘profusely’ apologizes for saying House GOP could repeal CHIPS Act","text":"The comments came during a campaign stop in Syracuse, New York, during which the speaker was asked if Republicans would seek to overturn the bipartisan bill that has invested $54 billion into the semiconductor manufacturing industry. Johnson told reporters he “expect[s] we probably will” — a statement he quickly walked back amid backlash before Election Day. \n\n“As I have further explained and clarified, I fully support Micron coming to Central NY, and the CHIPS Act is not on the agenda for repeal,” Johnson said in a statement. “To the contrary, there could be legislation to further streamline and improve the primary purpose of the bill—to eliminate its costly regulations and Green New Deal requirements.”\n\nRep. Brandon Williams (R-NY), who was campaigning with the speaker at the time of the comments, said Johnson “misheard the question” and “profusely apologized” to the New York Republican in private shortly after the incident happened. \n\n“He clarified his comments on the spot and I trust local media to play his full comments on supporting repatriation of chips manufacturing to America,” Williams said in a statement. \n\nHowever, Democrats were quick to highlight the soundbite, releasing a statement shortly after accusing Johnson of planning to repeal CHIPS if Republicans maintain their slim majority. The Democratic National Committee also tied Johnson’s comments to Trump’s podcast interview with Joe Rogan last week, during which the former president railed on the CHIPS Act as being “so bad.” \n\n“He’s now admitting that a Republican-controlled Congress under Donald Trump and J.D. Vance would repeal billions in funding delivered by the Biden-Harris administration that is fueling jobs and innovation across the country,” DNC rapid response director Alex Floyd said in a statement. “Trump and MAGA Republicans’ closing argument attacking their fellow Americans while running on a dangerous, unpopular agenda makes clear our country can’t risk a second Trump term.”\n\nJohnson’s clarification on the CHIPS Act comes after the speaker similarly came under fire when he pledged to seek “massive reform” of Obamacare if Trump retakes the White House and Republicans keep their House majority. Democrats quickly seized on those comments, accusing the speaker of wanting to fully repeal Obamacare. \n\nJohnson later pushed back on that criticism, accusing Democrats of taking his words out of context when he actually meant “the opposite of that.”","summary":"House Speaker Mike Johnson (R-LA) went into cleanup mode as he sought to quickly clarify comments he made suggesting Republicans would consider repealing the CHIPS and Science Act if former President Donald Trump was reelected.&#160; The comments came during a campaign stop in Syracuse, New York, during which the speaker was asked if Republicans would [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3213718/mike-johnson-profusely-apologizes-chips-act-repeal/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Mike-Johnson-Trump_ii163.webp","video":null,"publish_date":"2024-11-01 23:27:24","author":"Cami Mondeaux","authors":["Cami Mondeaux"],"language":"en","category":"politics","source_country":"US","sentiment":-0.192},{"id":261994570,"title":"'Simulating a lynching': PA parade float condemned for 'vile' depiction of Harris in chains","text":"In Mount Pleasant, Pennsylvania — a small town of roughly 4,000 people an hour outside of Pittsburgh — officials are loudly speaking out against a recent Halloween parade float over its depiction of Vice President Kamala Harris.\n\nOn Friday, Pittsburgh NBC affiliate WPXI reported on the local outrage over the float, which was a golf cart-style vehicle surrounded by men in suits meant to resemble Secret Service agents, with someone wearing a mask of former President Donald Trump riding on top with a sniper rifle. But Mount Pleasant Mayor Diane Bailey said the most offensive part was how it portrayed Harris.\n\n\"The worst part of it was that there was either a rope or a chain attached to the back of the vehicle, and there was a woman who was to resemble Kamala Harris in handcuffs and chained to the back of the vehicle as though they were dragging her,\" Bailey told WPXI. \n\nREAD MORE: Has the Trump campaign 'stalled?' Experts debate\n\nParade attendee Josh Huff told the outlet that the float was \"probably not something I'd want at a children's parade,\" and that it looked like the float was \"simulating a lynching.\"\n\n\"Somebody in power had to say hey, yeah, that’s fine. That’s okay,\" Huff said.\n\nBailey told reporters she wasn't sure how the float was approved to be displayed, and that she was planning to speak with the borough manager and the city council president to get to the bottom of the issue. The parade was organized by the local volunteer fire department, which almost immediately condemned the float in a post to its official Facebook page on Thursday night.\n\n\"We, the members of the Mount Pleasant Volunteer Fire Department, want to take a moment to sincerely apologize for allowing the offensive participants to take part in the Mount Pleasant Annual Halloween Parade last evening. We do not share in the values represented by those participants, and we understand how it may have hurt or offended members of our community,\" the post read. \"We’re proud to have sponsored this parade for over 70 years and its goal has always been to support our community's children. We are committed to learning from this experience and ensuring that our future events celebrate the diversity and spirit of our community in a positive way.\"\n\nREAD MORE: Arizona's Attorney General is now investigating Trump's 'death threat' against Liz Cheney\n\nWestmoreland County Democratic Party chair Michelle Milan McFall called the float \"vile\" in an interview with NBC News. And Westmoreland County Republican Committee chair Bill Bretz said the local GOP organization doesn't support \"the simulation of political imprisonment or violence in any context.\"\n\n\"It’s heartbreaking. It’s concerning. And I think it’s also got an element of danger. Again, we’re living in this climate where people aren’t just thinking about hatred and feeling it in their guts and bones,\" McFall said. \"They’re acting on it. We have to take down the temperature.\"\n\nClick here to read WPXI's report in full, and click here to read NBC News' article. \n\nREAD MORE: 'Execution fantasy': CNN host debunks GOP spin on Trump's violent anti-Cheney rhetoric","summary":"In Mount Pleasant, Pennsylvania — a small town of roughly 4,000 people an hour outside of Pittsburgh — officials are loudly speaking out against a recent Halloween parade float over its depiction of Vice President Kamala Harris.\n\nOn Friday, Pittsburgh NBC affiliate WPXI reported on the local outrage over the float, which was a golf cart-style vehicle surrounded by men in suits meant to resemble Secret Service agents, with someone wearing a mask of former President Donald Trump riding on top with a sniper rifle. But Mount Pleasant Mayor Diane Bailey said the most offensive part was how it portrayed Harris.\n\n\"The worst part of it was that there was either a rope or a chain attached to the back of the vehicle, and there was a woman who was to resemble Kamala Harris in handcuffs and chained to the back of the vehicle as though they were dragging her,\" Bailey told WPXI. \n\nREAD MORE: Has the Trump campaign 'stalled?' Experts debate\n\nParade attendee Josh Huff told the outlet that the float was \"probably not somethin","url":"https://www.alternet.org/pennsylvania-harris-parade/","image":"https://www.alternet.org/media-library/image.png?id=54150085&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2024-11-01 23:25:39","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.393},{"id":261993868,"title":"Donald Trump gushes over 'great guy' Mohamed Al-Fayed' in resurfaced interview","text":"Donald Trump once claimed he had a \"great\" relationship with Mohamed Al-Fayed and described the alleged sexual predator as a \"fabulous\" man. \n\nThe former president and Republican presidential nominee praised the late billionaire and owner of Harrod's several times over the years, long before the Egyptian tycoon became the subject of more than 400 allegations of sexual harassment and rape. \n\nAl-Fayed was so well-respected by Trump, 78, that he was even invited to his wedding with Melania back in 2005. However, the friendship between the two businessmen began far earlier. In 1988, during an interview with Terry Wogan on the BBC, Trump couldn't speak highly enough of the tycoon.\n\nTrump, who was sat beside Ivana, his first wife, spoke about meeting Al-Fayed and his Finnish model wife, Heini Wathen-Fayed.\n\n\"This is a country that I find fascinating. We were with a man yesterday, Mohamed Al-Fayed - who owns Harrods - and he is a fabulous man. And his wife is just a wonderful lady and we spent a day and we walked through Harrods,\" Trump told Wogan.\n\n\"I mean, as an example, what a difference between this and when we last saw it five years ago the great job he's done with it.\"\n\nFellow guest comedian Barry Humphries, who was best known as his alter-ego Dame Edna Everage, then butts in, saying: \"Oh wonderful, wait 'til you see his home.\"\n\nTrump responds \"it's beautiful\", suggesting he had been there in the past. The MailOnline reports he visited Al-Fayed's home in 1983 and 1988.\n\nA total of 421 women have now come forward with allegations against Al Fayed, and lawyers have warned that will spark a flood of further complaints over the late Harrods tycoon’s behaviour. Former staff claim they were sexually abused or raped by Al Fayed, who owned the store from 1985 to 2010.\n\nJustice for Harrods Survivors said there were also allegations from Fulham FC and The Ritz in Paris, which he also controlled. \n\n Three alleged victims, Gemma, Lindsay and Jen, were at a London press -conference led by lawyer Dean Armstrong KC yesterday, who said the group had £1billion to fight cases.\n\nHe added: “The first letter of claim has been sent to Harrods. That is the beginning of the formal legal process. It’ll be followed today by another and it’ll be followed the day after by others, and it’ll be followed by hundreds more.\n\n“This is the clearest signal possible that it is time for Harrods, the Fayed estate and Fulham FC amongst others to understand that now is the time to do the right thing.”","summary":"Former US president Donald Trump couldn't speak highly enough of late billionaire Mohamed Al-Fayed - who is now the subject of more than 400 rape and sexual harassment allegations","url":"https://www.mirror.co.uk/news/us-news/donald-trump-gushes-over-great-34020683","image":"https://i2-prod.mirror.co.uk/incoming/article34020835.ece/ALTERNATES/s1200/0_trumpmain.jpg","video":null,"publish_date":"2024-11-01 23:25:14","author":"Ryan Fahey","authors":["Ryan Fahey"],"language":"en","category":"politics","source_country":"gb","sentiment":0.022},{"id":261995542,"title":"James Gray Sets Next Film ‘Paper Tiger’ Starring Adam Driver, Jeremy Strong, and Anne Hathaway","text":"Read Next: ‘Conclave’ Screenwriter Peter Straughan on That Wild Ending, and Why ‘The Goldfinch’ Movie Was ‘a Mistake from the Beginning’\n\nNewsletters\n\nAlerts & Newsletters\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\nWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nIndieWire is a part of Penske Media Corporation. © 2024 IndieWire Media, LLC. All Rights Reserved.\n\nJames Gray Sets Next Film ‘Paper Tiger’ Starring Adam Driver, Jeremy Strong, and Anne Hathaway\n\nThe director's ninth feature will begin shooting in early 2025.\n\nBy Brian Welk\n\nBrian Welk has joined IndieWire as Senior Business Reporter\n\nCourtesy of Brian Welk\n\nMore stories by Brian\n\nJames Gray Sets Next Film ‘Paper Tiger’ Starring Adam Driver, Jeremy Strong, and Anne Hathaway\n\nNobody Wants Their Cable Channels Anymore\n\nStudy Reveals Untapped Market of 40 Million People Who Will Pay for Indie Films on Streaming\n\nNovember 1, 2024 7:24 pm\n\nGetty Images for The Gotham Film\n\nShare on Facebook\n\nShare to Flipboard\n\nShare on LinkedIn\n\nSubmit to Reddit\n\nPost to Tumblr\n\nPrint This Page\n\nShare on WhatsApp\n\nJames Gray, the director of “Ad Astra,” has revealed his next film, an original screenplay and crime drama called “Paper Tiger.”\n\nGray’s latest film, his ninth feature, will star Adam Driver and will reunite him with his stars from 2022’s “Armageddon Time,” Jeremy Strong and Anne Hathaway.\n\n“Paper Tiger” is described as a tense and gritty story about two brothers pursuing the American Dream, only to become entangled in a scheme that turns out to be too good to be true. As they try to navigate their way through an ever-more dangerous world of corruption and violence, they find themselves and their family brutally terrorized by the Russian “Mafiya.”\n\nRelated Stories\n\nJeremy Strong: Opening ‘The Apprentice’ at the Height of Election Season Is ‘Chilling’\n\nDid a Trump-Supporting Financier Try to Catch and Kill ‘The Apprentice’?\n\nThe film is being launched to buyers at next week’s AFM, with CAA Media Finance handling U.S. rights and Vincent Maraval and Kim Fox’s The Veterans handling international sales. The worldwide rights to the film are available.\n\nPrincipal photography will begin on “Paper Tiger” in early 2025.\n\nLeone Film Group is fully financing the film, with Raffaella Leone producing alongside Rodrigo Teixeira under his RT Features banner.\n\nDriver was most recently seen in “Megalopolis” and recently completed production on Jim Jarmusch’s next film “Father, Mother, Sister, Brother.” He’s also acting on stage at the Lortel Theater in an Off-Broadway production called “Hold On to Me Darling.”\n\nStrong can be seen in “The Apprentice” as Roy Cohn alongside Sebastian Stan as a young Donald Trump. He’s currently in production on Scott Cooper’s “Deliver Me From Nowhere,” the Bruce Springsteen biopic starring Jeremy Allen White.\n\nHathaway starred in this year’s “The Idea of You” and is in post on David Lowery’s next film for A24, “Mother Mary,” as well as David Robert Mitchell’s “Flowervale Street” for Warner Bros. She’s also set to reprise her role in “The Princess Diaries 3” alongside Julie Andrews for Disney.\n\nGray’s feature debut was Little Odessa in 1994. He has since made seven other features including, “We Own the Night,” “Two Lovers,” and “The Lost City of Z.” Five of his films have competed for the Palme d’Or at the Cannes Film Festival.\n\nGray is represented by CAA and Jackoway Austen Tyerman Wertheimer Mandelbaum Morris Bernstein Trattner Auerbach Hynick Jaime LeVine Sample & Klein. Driver is repped by MWE and Sloane, Offer, Weber & Dern. Strong by WME, Suger23, and Hansen, Jacobson, Teller, Hoberman, Newman, Warren, Richman, Rush, Kaller, Gellman, Meigs & Fox. Hathaway is represented by CAA, Entertainment 360 and Sloane, Offer, Weber & Dern.\n\nDeadline first reported the news.\n\nDaily Headlines\n\nDaily Headlines covering Film, TV and more.\n\nMore from IndieWire\n\nStudy Reveals Untapped Market of 40 Million People Who Will Pay for Indie Films on Streaming\n\nMartha Stewart Wanted Snoop Dogg to Score Documentary ‘Martha’ and Not Have ‘Lousy Classical’ Music\n\nSaoirse Ronan Doesn’t ‘Feel Safe’ Going to Movie Theaters in America: ‘I’m Not Sure if Someone Is Going to Pull a Gun Out’\n\nThompson on Hollywood\n\nAs the Academy’s Museum Expands, It Cuts Library and Archives Staff\n\nThe Academy Collection Acquires Tarantino’s Handwritten ‘Pulp Fiction’ Script, Now Boasts 52 Million Items\n\n‘Squid Game’ Season 2 New Teaser: Player 456 Faces Off Against Front Man Once Again\n\nDaily Headlines\n\nDaily Headlines covering Film, TV and more.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\nWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nThe Best Movies of 2024 (So Far)\n\nThe Best TV Shows of 2024 (So Far)\n\n52 Must-See Movies to Watch This Fall Season\n\nMore From IndieWire\n\n25 Years Later, One of Bruce Willis’ Best Movies Gets the Release It Deserves\n\n‘Only Murders’ Season 4 Was a Self-Indulgent Blur\n\nMost Popular\n\nAnna Kendrick Says 'F--- You' to Director Who Dissed Her in Front of 100 Extras in Order to 'Embarrass Me and Gain Dominance': 'It Was Very Icky'\n\nSherry Lansing, Mayim Bialik, Debra Messing, Gene Simmons Among Signatories of Counter-Petition Opposing Boycott of Israeli Literary Institutions\n\nMontel Williams Addresses Rumored Kamala Harris \"Sex Tape\"\n\nThe Golden Bachelorette Joan Vassos May Have Accidentally Confirmed Her Winner With This Spoiler\n\nYou may also like\n\nBruce Springsteen Endorses Kamala Harris: ‘Donald Trump Is the Most Dangerous Candidate for President in My Lifetime’\n\nrollingstone\n\nMrBeast Announces Investigation Findings: Sexual Misconduct Allegations Are ‘Without Basis’\n\nCamila Morrone & Adam DiMarco In Talks For ‘Something Very Bad Is Going To Happen’ Netflix Series From Duffer Brothers & Haley Z. Boston\n\nTVLine Items: Jason Bateman Replaces Pedro Pascal in HBO Series, Jamie Foxx Special Sets Netflix Date and More\n\nMountain West Fills Hole With Legally-Embroiled Grand Canyon\n\nIndieWire is a part of Penske Media Corporation. © 2024 IndieWire Media, LLC. All Rights Reserved.","summary":"The director's ninth feature will begin shooting in early 2025.","url":"https://www.indiewire.com/news/breaking-news/james-gray-next-film-paper-tiger-adam-driver-jeremy-strong-anne-hathaway-1235062326/","image":"https://www.indiewire.com/wp-content/uploads/2022/12/GettyImages-1445282449.jpg","video":null,"publish_date":"2024-11-01 23:24:12","author":"Brian Welk","authors":["Brian Welk"],"language":"en","category":"politics","source_country":"US","sentiment":-0.003},{"id":261993468,"title":"Johnson Suggests Republicans May Repeal CHIPS Act—Then Quickly Walks Back Comment","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nHouse Speaker Mike Johnson, R-La., told reporters Friday he expects Republicans to try and repeal the CHIPS Act if GOP lawmakers take control of Congress and former President Donald Trump wins the presidency, later walking back the comment, which would have marked the most explicit a top Republican has been this election cycle about moving to repeal act that aims to strengthen the United States’ standing in the global semiconductor race.\n\nSpeaker of the House Mike Johnson, R-La., speaks to supporters of former President Donald Trump, at ... [+] a Trump Force 47 campaign office in Bethlehem, Pennsylvania, on Friday. (Photo by SAMUEL CORUM/AFP via Getty Images)\nAFP via Getty Images\n\nJohnson said “I expect that we probably will,” when asked if Republicans will attempt to repeal the act if Trump wins and Republicans have control of Congress following the election.\n\nRep. Brandon Williams, R-N.Y., spoke to reporters alongside Johnson and did not seem to share his opinion—though he did not answer whether he would vote to repeal or keep the act, he said he will remind Johnson “night and day how important the CHIPS Act is.”\n\nJohnson later said in a statement the CHIPS Act “is not on the agenda for repeal,” suggesting the bill could be modified to fall further in line with Republican policies.\n\nWilliams said he spoke with Johnson immediately after the Syracuse event and said the speaker told him he misheard the question and “apologized profusely.”\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\nWhat Is The Chips Act?\n\nThe CHIPS and Science Act was signed into law by President Joe Biden in 2022 and is designed to bring semiconductor chip manufacturing to the U.S. through more than $50 billion in funds allocated toward semiconductor research, development, manufacturing and workforce development. Semiconductor chips, which are largely manufactured in countries like Taiwan and South Korea, are used to produce devices across industries including computing, healthcare, energy and more. The act has run into obstacles as it provides money for companies to bring semiconductor manufacturing to the United States. Most notably, delays have hindered semiconductor factory construction in the U.S., as building such facilities is a complex process involving billions of dollars in machinery and can potentially cost more than the construction of a nuclear power plant, according to The New York Times.\n\nKey Background\n\nRepublicans have criticized provisions within the CHIPS Act related to climate research and national security. However, GOP lawmakers, who control the House by a slim margin, have not explicitly pushed back against the act as much as Johnson did Friday before he walked back his comment. Trump recently said during an episode of “The Joe Rogan Experience” podcast the CHIPS Act “is so bad,” criticizing the incentives given to foreign companies and saying he would instead implement tariffs on chips from Taiwan if elected. He accused Taiwan of stealing the U.S. chip business and leveraging it so it can gain U.S. protection from a potential Chinese invasion. Experts have warned tariffs would raise prices for consumers.\n\nFurther Reading\n\nWill Trump’s Tariffs Raise Prices? What To Know As Kamala Harris Slams Policy At Debate (Forbes)\n\nSam Altman Is Reportedly Raising Billions For Chip Manufacturing Factories—Here's Why That Matters (Forbes)\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nAntonio Pequeño IV\n\nEditorial Standards\n\nForbes Accolades","summary":"Former President Donald Trump has criticized the act designed to bolster the United States’ semiconductor supply chain and insisted tariffs would work better.","url":"https://www.forbes.com/sites/antoniopequenoiv/2024/11/01/johnson-suggests-republicans-may-repeal-chips-act-then-quickly-walks-back-comment/","image":"https://imageio.forbes.com/specials-images/imageserve/6725622ae0ae4bdfafd8fedf/0x0.jpg?format=jpg&crop=2588,1454,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-11-01 23:22:56","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.213},{"id":261993198,"title":"If Trump declares victory before votes are counted, ‘it will fail,’ Harris campaign says","text":"A senior official in the presidential campaign of Kamala Harris said Friday they “fully expect” Donald Trump to declare victory before all votes are counted on Election Day evening.\n\nBut “it won’t work,” the official told reporters.\n\n“He did this before. It failed,” said the official, who spoke on the condition of anonymity in a press call, according to NBC News. “If he does it again, it will fail.”\n\nThe official said Republican nominee Trump “lies all the time” and is already seeking “to sow doubt about a loss that he anticipates is coming” on Tuesday against Harris, the Democratic nominee and current vice president.\n\n“Meanwhile, we are focused on making sure that all of our voters have the information to get out and vote, and that they feel confident doing it safely and securely, and that they know that we’re going to protect that vote and that we are going to ensure that it counts, no matter what Trump and his campaign are doing,” the campaign official said.\n\nThe call came on the heels of baseless claims by Trump that there is large-scale “cheating” going on in voting in Pennsylvania, a key swing state in the election.","summary":"Former US President Republican presidential candidate Donald Trump arrives, more than 3 hours late, to a campaign rally in Traverse City, Michigan on October 25, 2024.  Jim Watson &#124; Afp &#124; Getty Images A senior official in the presidential campaign of Kamala Harris said Friday they &#8220;fully expect&#8221; Donald Trump to declare victory before all &#8230;\n\n\nThe post If Trump declares victory before votes are counted, &#8216;it will fail,&#8217; Harris campaign says appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/if-trump-declares-victory-before-votes-are-counted-it-will-fail-harris-campaign-says/","image":"https://image.cnbcfm.com/api/v1/image/108053331-1730071219528-gettyimages-2180311034-AFP_36KX7WE.jpeg?v=1730071250&w=1920&h=1080","video":null,"publish_date":"2024-11-01 23:21:06","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.561},{"id":261993164,"title":"Husband who went viral for leaving wife romantic note on mirror suspected of killing her","text":"A man who went viral for leaving an adorable message to his wife on a mirror has been accused of her murder. \n\nIn 2015, Timothy Murphy Johnson, 40, melted hearts online when his wife Molly shared a message he left on their bedroom mirror, titled: 'Reasons I love my wife. The list praised Molly for being his \"best friend\" and \"never quitting on herself or me.\"\n\nHowever, after Molly's death in 2017, initially believed to be a suicide by overdose, friends and family voiced suspicions to The Times about Murphy-Johnson's involvement, especially following his conviction for the kidnap and torture of a 16-year-old girl last year.\n\nProsecutors said Murphy-Johnson and his girlfriend Olivia Ashford Henn, 21, held the teenager captive for over six weeks in early June 2023, subjecting her to naked restraint, knife cuts, and forced drug overdoses, all recorded by Murphy-Johnson. With Murphy-Johnson now serving a life sentence, doubts are cast over the true nature of Molly's demise.\n\n Sources said despite the loving message he left for Molly on their mirror, she was reportedly trapped in a toxic marriage, frequently alleging Murphy-Johnson had assaulted, raped, and even threatened to kill her. She had confided in friends about being forced into prostitution by her husband and claimed in a legal document that he had threatened to end her life with a drug overdose, staging it as suicide, reports the Mirror US. \n\nA childhood friend of Molly's, Anna-Marie Anderson, said: \"I believe Tim either provided her with drugs or forced her to take them. She was brilliant, extremely educated on medication and drugs, and in my opinion, she would not go out that way.\"\n\nDuring the investigation, messages Molly sent to friends were uncovered, revealing her intentions to divorce Murphy-Johnson but also her fear of him, often sharing photos of her injuries. In one chilling text, she wrote: \"He (Murphy-Johnson) just offered me some drug that will kill me, so I can get it over with already... guess I'll just make it easier for us both.\"\n\nThe ill-fated couple initially connected on the dating website OK Cupid in 2012, leading Molly to ditch her plans for a master's degree to move to San Francisco with Murphy-Johnson when he secured a new job. Molly's father, Bob Gelman, said his daughter had twice called him to \"rescue her\" following the move, around the same time Murphy-Johnson proposed to her.\n\n\"Molly had to fork out for her own ring, which Tim kept. I suggested they hold off on tying the knot for at least a year considering their rocky relationship history. They eloped just a few months later,\" he revealed. Mr Gelman disclosed that despite their tumultuous past, Tim managed to woo Molly back repeatedly.\n\nAfter relocating to LA, he shared a disturbing detail: \"Molly was forced to leave her job due to the visible cuts and bruises on her body.\" During the investigation into her untimely death, Molly's friends uncovered explicit photos of her on adult sites such as Pornhub, where she was advertised as an 'escort' and tagged as a 'naughty nerd'. \n\nA mere seven months following the internet fame of Molly's mirror selfie, she filed for a restraining order against her spouse, claiming he \"threatened to kill me (and make it look like a suicide).\" In her legal documents, she alleged he \"physically assaulted me by kicking my back/stomach, punching my head/arms, pushing me down and stealing my purse, money and phone to prevent me getting away.\"\n\nThe narrative took a darker turn with reports of a beauty queen alleging Donald Trump 'jumped' her in his suite at New York's Plaza Hotel, and a shocking incident involving an Ohio grandmother who reportedly shot her infant granddaughter in the head and displayed 'no remorse'.\n\nThe tragic end came when Molly was found deceased in her bed on December 16, 2017. Adding to the tragedy, Mr Gelman stated that his son-in-law failed to inform him about Molly's passing; instead, he learned the devastating news from Molly's former boyfriend.\n\n\"Tim attempted to have her cremated immediately. I insisted on an autopsy,\" said Gelman to The Times. \"Eventually she was cremated, and Tim took all of her remains. I never received anything of her to bury.\"\n\nFriends were informed by Murphy-Johnson that his wife left a suicide note, yet the coroner's report made no mention of such a note.\n\nAdditionally, Molly's system contained less than half the fentanyl typically seen in suicide cases. While accusations suggest Molly may have been forced to use drugs during her marriage, the coroner announced, \"concern of emotional abuse and manipulation are outside the scope of what the coroner's department can evaluate.\"\n\nRelatives of Murphy-Johnson dismissed the allegations as \"baseless.\"\n\nAn anonymous relative said: \"Molly had a serious drug addiction to fentanyl, as well as depression and a history of suicide attempts. Tim saved her life on more than one occasion ... so I don't believe he killed her.\n\n\"To be frank they both thought the other was trying to kill them. It was chaos. It was a sad, toxic, mess, two people with deadly drug addictions and mental illness for one terrible relationship. He did love her very much and her death is what led to him descending into madness. I can't make excuses for anything Tim has done.\"","summary":"Timothy Murphy Johnson, 40, became an internet sensation in 2015 when his wife Molly posted a heartfelt note he had written for her on their bedroom mirror - now he's facing a murder accusation","url":"https://www.mirror.co.uk/news/us-news/husband-who-went-viral-leaving-34020751","image":"https://i2-prod.mirror.co.uk/news/us-news/article34020744.ece/ALTERNATES/s1200/1_couple.jpg","video":null,"publish_date":"2024-11-01 23:19:05","author":"Antony Clements-Thrower,Charlie Jones","authors":["Antony Clements-Thrower","Charlie Jones"],"language":"en","source_country":"gb","sentiment":-0.139},{"id":261992942,"title":"Supreme Court allows Pennsylvania to count contested provisional ballots, rejecting Republican plea","text":"The Supreme Court on Friday rejected an emergency appeal from Republicans that could have led to thousands of provisional ballots not being counted in Pennsylvania.\n\nThe justices left in place a state Supreme Court ruling that elections officials must count provisional ballots cast by voters whose mail-in ballots were rejected.\n\nAs of Thursday, about 9,000 ballots out of more than 1.6 million returned have arrived at elections offices around Pennsylvania lacking a secrecy envelope, a signature or a date, according to state records.\n\nPennsylvania is the biggest presidential election battleground this year, with 19 electoral votes. Former President Donald Trump won the state in 2016, then lost it in 2020.\n\ny a single point in 2016 before Biden widened the Democratic lead to five points in 2020.","summary":"The justices left in place a state Supreme Court ruling that elections officials must count provisional ballots cast by voters whose mail-in ballots were rejected.","url":"https://nypost.com/2024/11/01/us-news/supreme-court-allows-pennsylvania-to-count-contested-provisional-ballots-rejecting-republican-plea/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/2024-kamala-harris-clapped-back-92768436.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/g0sQGent-RyIcpnTz.mp4","publish_date":"2024-11-01 23:14:28","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.503},{"id":261994106,"title":"Democrats deploy disinformation in southwest suburban state House race","text":"As usual, plenty of false claims have been made during this state legislative election cycle.\n\nBut the campaign I keep going back to in my own mind is the battle in the 97th House District.\n\nThe race features freshman incumbent Rep. Harry Benton, D-Plainfield, a union ironworker and a former local elected official. The Republican challenger is Gabriella Shanahan, an executive assistant with the Illinois Policy Institute.\n\nOrganized labor is keen on this race because the Illinois Policy Institute is known for its anti-union crusades, and Benton is one of their own.\n\nThe 97th District had been held by the Republican Party before the 2021 remap, so the Republicans really want to win it back.\n\nBut the remap did a number on this district. Donald Trump lost the old district by 8 percentage points in 2020 and 3 points in 2016. Trump lost the precincts that make up the newly redrawn district by more than 10 points in 2020 and 6 points in 2016. Every statewide Democratic candidate has won the precincts in the new district going back to 2016 except one, appointed Republican Comptroller Leslie Munger won it by less than 4 points.\n\nThe freshman incumbent and the Democrats have been playing some games there, despite having a huge fundraising advantage of close to $2 million for Benton to $525,000 for the Republican Shanahan (including a $100,000 loan from herself on Nov. 1), as I write this four days before the election.\n\nAbout that grocery tax ... \n\nMy associate Isabel Miller reported a while back that Benton told WSPY Radio earlier this year he was “pretty happy to see that the grocery tax is going away,” after the governor proposed eliminating the tax during his State of the State message in February.\n\nSome of Benton’s campaign mailers even claimed that the incumbent “supported the elimination of the grocery tax.”\n\nBut when it came time to vote on eliminating the grocery tax, Benton didn’t vote either way.\n\nBenton told Isabel that some of his municipalities would lose lots of money since the 1% grocery tax was solely collected for local governments.\n\nBut when Isabel asked him why he was touting a position that he didn’t officially take, Benton said, “Since I didn’t vote on HB 3144, people wouldn’t have known my position. I wanted to let people know before anyone could misrepresent my position that while there were parts of that bill I didn’t agree with, I had spoken out about cutting taxes on groceries.”\n\nLast month, the Democrats ran a digital ad blasting Shanahan for accepting contributions from politicians who “voted to block funding for testing rape kits,” among other things.\n\nThat allegation was based on campaign contributions from Republican state legislators who voted against the state budget, which included funding for rape kit testing. Shanahan has indeed received money from several of those GOP members.\n\nHowever, wanna take a guess who also voted with those very same Republicans against the omnibus appropriations bill (Senate Bill 251)? If you said, “Rep. Harry Benton,” you win a prize.\n\nA person close to Benton said at the time that the freshman incumbent had no veto power over the House Democratic ads.\n\nWell, the incumbent’s personal campaign fund, Friends to Elect Harry Benton, then began running a Chicago broadcast TV ad that made the same exact hypocritical charge.\n\n“Gabby Shanahan won’t protect women,” Benton himself said in the voice-over. “She’s backed by extreme politicians who voted to block funding for testing rape kits.”\n\nIn other words, he was personally, with his own voice, blasting his opponent for taking money from Republican legislators who made the same exact “No” vote that he did on the budget.\n\nBenton also said this in the ad: “I voted against a new tax on retirement savings for our seniors.” No bill number was flashed on the screen as a reference, and I have no idea what the heck he was talking about.\n\nThe almost comically lopsided imbalance in campaign money this year means that Democratic candidates can basically say whatever the heck they want without any sort of consequence. And the collapse of local news media in the state means that almost nobody in the district will ever hear about this and the incumbent won’t be called to account.\n\nThe Democrats know all this, of course, which is why they do it.\n\nRich Miller also publishes Capitol Fax, a daily political newsletter, and CapitolFax.com.\n\nSend letters to letters@suntimes.com\n\nGet Opinions content delivered to your inbox. Sign up for our weekly newsletter here.","url":"https://chicago.suntimes.com/columnists/2024/11/01/democrats-harry-benton-deploy-disinformation-97th-house-district-race-southwest-suburbs-rich-miller","image":"https://cst.brightspotcdn.com/dims4/default/0b35b32/2147483647/strip/true/crop/2458x1403+24+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F35%2Fcb%2Fc9e67044425ba8acf8dcd50f5834%2F2020e","video":null,"publish_date":"2024-11-01 23:09:25","author":"Rich Miller","authors":["Rich Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.523},{"id":261992606,"title":"Improving Lives of Workers and Reducing Living Expenses are Key Concerns for Half of Voters in the Upcoming Election","text":"More than half of Americans believe that the top priority for the new president should be to reduce the cost of living, according to an exclusive poll by The U.S. Sun.\n\nVoters were asked what the one thing was that the next president could do to make working people’s lives better.\n\nOf the respondents, just over half (52%) said that the most important action would be to lower the cost of living.\n\nMoney worries were top on the minds of Americans in The U.S. Sun’s polling.\n\nThe second top priority for voters with just under a quarter of votes (23%), was lowering inflation rates.\n\nThe poll revealed that 9% of respondents prioritized reducing taxes, while 5% thought lowering interest rates on things like auto and home loans was crucial. Additionally, 4% of participants mentioned that making commuting or travel more affordable was essential.\n\n3% had a different priority to improve working people’s lives, while 5% there was nothing in particular the president could do that would help.\n\nAmong respondents, there were some generational divides.\n\nInterestingly, 58% of individuals belonging to Generation X (born between 1965 and 1980) indicated that lowering the cost of living was the most important thing the new president could do to enhance the lives of working people, surpassing all other age groups.\n\nSimilar numbers were found among Baby Boomers – with 57% of those born between 1946 and 1964 prioritizing lowering the cost of living.\n\nAn equal percentage of those born before 1945 (57%) wanted the next president to lower the cost of living.\n\nThat figure was lowest for Gen Z, with a comparatively small 37% of those born between 1997 and 2006 having “Lower the cost of living” as the top priority.\n\nWhile among millennials – those born between 1981 and 1996 – lowering the cost of living was the most important task of the next president for 37% of voters.\n\n54% of female respondents, contrasted with 45% of male respondents, had lowering the cost of living as their top priority.\n\nAnd among the regions, 55% of those in the Southeast had the lowering the cost of living as their number-one issue, compared to 46% in the Northeast.\n\nBetween party alliances, the voters were similarly split on their top priorities – with 54% of Democrats, 50% of Republicans, and 51% of independents and third-party supporters putting lowering the cost of living as the key challenge facing Americans.\n\nBoth Kamala Harris and Donald Trump have highlighted the cost of living in this year’s election campaign.\n\nOn Thursday, Trump announced he would create a new Cabinet position and issue an executive order to reduce the cost of living on his first day in charge if reelected.\n\n“On day one, I will sign an executive order directing every federal agency to immediately remove every single burdensome regulation driving up the cost of goods,” the Republican told a rally in Albuquerque, New Mexico.\n\nHe also hit out at the “many regulations” he said “hurt” the US.\n\nTrump said the new Cabinet position would be tasked with “doing everything in the federal government’s power to reduce the cost of living.”\n\nNo candidates for the potential role have been named.\n\nFor her part, Harris told NBC News she would also be prioritizing bringing down the cost of living immediately if elected.\n\n“My first priority, which will be probably a package of bills, is about bringing down the cost of living,” she said.\n\n“It’s about housing. It’s about child care. It’s about what we need to do to deal with grocery prices.”\n\nThe vice president has also said she would continue Joe Biden’s pledge not to raise taxes on anyone making under $400,000 a year.\n\nShe is also proposing additional tax hikes for the wealthiest Americans, with the long-term capital gains tax rate increasing from 20% to 28% for those earning $1 million or more.\n\nShe has also expressed support for a billionaire minimum tax, impacting those whose net worth is more than $100 million – less than 1% of taxpayers.\n\nTrump has called for the lowering of corporate taxes to 15% for certain companies.\n\nHarris also proposed a plan to lower prices by introducing America’s first-ever national price-gouging ban on food and groceries.\n\nSimilar price-gouging bans already exist in 37 states including Florida and Texas.\n\nTrump has claimed he would bring down prices by boosting oil and gas production, vowing to allow companies in America to “Drill, baby, drill.”","summary":"More than half of Americans believe that the top priority for the&#8230;","url":"https://internewscast.com/news/improving-lives-of-workers-and-reducing-living-expenses-are-key-concerns-for-half-of-voters-in-the-upcoming-election/","image":"https://www.the-sun.com/wp-content/uploads/sites/6/2024/11/Election_2024_Trump_11733-7fdd3jpg-JS945552909.jpg?strip=all&w=960","video":null,"publish_date":"2024-11-01 23:09:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.18},{"id":261993356,"title":"Harris calls Trump's remark about Liz Cheney \"disqualifying\"","text":"Harris calls Trump's remark about Liz Cheney \"disqualifying\"\n Former President Donald Trump is facing criticism for his comments Thursday night about former Republican Rep. Liz Cheney. He said, \"Let's put her with a rifle standing there with nine barrels shooting at her.\" Vice President Kamala Harris slammed Trump for the remarks and called him unqualified to be president. CBS News' Major Garrett and Zak Hudak have the latest on the 2024 presidential race.","summary":"Former President Donald Trump is facing criticism for his comments Thursday night about former Republican Rep. Liz Cheney. He said, \"Let's put her with a rifle standing there with nine barrels shooting at her.\" Vice President Kamala Harris slammed Trump for the remarks and called him unqualified to be president. CBS News' Major Garrett and Zak Hudak have the latest on the 2024 presidential race.","url":"https://www.cbsnews.com/video/harris-calls-trump-remark-about-liz-cheney-disqualifying/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/01/3bec2c53-b80b-43b3-8517-03f6f33bf710/thumbnail/1200x630/54befacc022b8317d1e6628efa29c24a/cbsn-fusion-harris-calls-trump-remark-about-liz-cheney-disqualifying-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2","video":null,"publish_date":"2024-11-01 23:08:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.001}]}