{"offset":0,"number":50,"available":10086,"news":[{"id":326293772,"title":"Elon Musk Came To Washington Wielding A Chain Saw. He Leaves Behind Upheaval and Unmet Expectations","text":"WASHINGTON: Elon Musk arrived in the nation's capital with the chain saw-wielding swagger of a tech titan who had never met a problem he couldn’t solve with lots of money, long hours or a well-calibrated algorithm. President Donald Trump was delighted to have the world’s richest person — and a top campaign donor — working in his administration, talking about how he was “a smart guy” who “really cares for our country.” Musk was suddenly everywhere — holding forth in Cabinet meetings while wearing a “tech support” shirt and black MAGA hat, hoisting his young son on his shoulders in the Oval Office, flying aboard Air Force One, sleeping in the White House. Democrats described the billionaire entrepreneur as Trump’s “co-president,” and senior officials bristled at his imperial approach to overhauling the federal government. After establishing Tesla as a premier electric automaker, building rockets at SpaceX and reshaping the social media landscape by buying Twitter, Musk was confident that he could bend Washington to his vision. Now that’s over. Musk said this week that he’s leaving his job as a senior adviser, an announcement that came after he revealed his plan to curtail political donations and he criticized the centerpiece of Trump's legislative agenda. It’s a quiet exit after a turbulent entrance, and he's trailed by upheaval and unmet expectations. Thousands of people were indiscriminately laid off or pushed out — hundreds of whom had to be rehired — and some federal agencies were eviscerated. But no one has been prosecuted for the fraud that Musk and Trump said was widespread within the government. Musk reduced his target for cutting spending from $2 trillion to $1 trillion to $150 billion, and even that goal may not be reached. In Silicon Valley, where Musk got his start as a founder of PayPal, his kind of promises are known as vaporware — a product that sounds extraordinary yet never gets shipped to market. Trump said Thursday on his Truth Social platform that he would hold a press conference Friday with Musk. “This will be his last day, but not really, because he will, always, be with us, helping all the way,” Trump added. “Elon is terrific!” Musk's position was always designed to be temporary, and he had previously announced his intention to dedicate more of his time to his companies. But he also told reporters last month that he was willing to work part-time for Trump “indefinitely, as long as the president wants me to do it.” Musk got a seat at Trump's table and put $250 million behind his campaign It was clear that Musk wouldn’t be the typical kind of presidential adviser around the time that he showed the world his belly button. Racing on stage at a campaign rally one month before the election, he jumped for joy next to Trump, his T-shirt rising to expose his midriff. Musk had already sold Trump on his idea for a Department of Government Efficiency while also putting at least $250 million behind his candidacy. The plan called for a task force to hunt for waste, fraud and abuse, a timeworn idea with a new twist. Instead of putting together a blue-ribbon panel of government experts, Trump would give his top donor a desk in the White House and what appeared to be carte blanche to make changes. Musk deployed software engineers who burrowed into sensitive databases, troubling career officials who sometimes chose to resign rather than go along. Trump brushed off concerns about Musk’s lack of experience in public service or conflicts of interest from his billions of dollars in federal contracts. Their unlikely partnership had the potential for a generational impact on American politics and government. While Musk dictated orders for government departments from his perch in the White House, he was poised to use his wealth to enforce loyalty to the president. His language was that of catastrophism. Excessive spending was a crisis that could only be solved by drastic measures, Musk claimed, and “if we don’t do this, America will go bankrupt.” But even though he talked about his work in existential terms, he treated the White House like a playground. He brought his children to a meeting with the Indian prime minister. He let the president turn the driveway into a makeshift Tesla showroom to help boost sales. He installed an oversized screen in his office that he occasionally used to play video games. Sometimes, Trump invited Musk to sleep over in the Lincoln Bedroom. “We’ll be on Air Force One, Marine One, and he’ll be like, ‘do you want to stay over?’” Musk told reporters. The president made sure he got some caramel...","summary":"Musk did not give federal workers the benefit of the doubt From the beginning, Musk treated federal workers with contempt. At best, they were inefficient; at worst, they were committing fraud","url":"https://www.deccanchronicle.com/world/americas/elon-musk-came-to-washington-wielding-a-chain-saw-he-leaves-behind-upheaval-and-unmet-expectations-1882217","image":"https://www.deccanchronicle.com/h-upload/2025/05/30/1922774-musk.webp","video":null,"publish_date":"2025-05-30 01:09:30","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.008},{"id":326293176,"title":"Trump gives Harvard 30 days to contest end of int’l student enrolment","text":"BOSTON: The Trump administration on Thursday backed away from plans to immediately revoke Harvard University’s ability to enroll international students and would instead give it 30 days to contest those plans through a lengthier administrative process.\n\nThe US Department of Homeland Security sent Harvard a notice of intent on Wednesday to withdraw the school’s certification under a federal program to enroll non-US students.\n\nThe Justice Department filed the notice in court ahead of a hearing before US District Judge Allison Burroughs in Boston over whether to extend a temporary order blocking President Donald Trump’s administration from revoking the Ivy League school’s right to host international students.\n\nCiting the potential for Harvard and its students to be harmed if the administration reverted to its earlier plans, Burroughs at that hearing said she planned to issue a broad preliminary injunction preserving the status quo while the newly announced administrative process plays out.\n\nHarvard had argued that the revocation violated its free speech and due process rights under the US Constitution. In addition, Harvard contended that the revocation failed to comply with DHS regulations. The regulations required providing at least 30 days to challenge the agency’s allegations and giving Harvard an opportunity to pursue an administrative appeal.\n\nHarvard has said losing that right would affect about one quarter of its student body and devastate the school. It has denied Trump administration charges of alleged bias against conservatives, fostering antisemitism on campus and coordinating with the Chinese Communist Party.\n\nThe Homeland Security Department said it sent Harvard the notice after school officials indicated an intent to comply with requirements of the federal Student and Exchange Visitor Program, which allows Harvard to enroll non-US students. “We continue to reject Harvard’s repeated pattern of endangering its students and spreading American hate—it must change its ways to be eligible to receive generous benefits from the American people,” Homeland Security Secretary Kristi Noem said in a statement.","summary":"BOSTON: The Trump administration on Thursday backed away from plans to immediately revoke Harvard University’s ability to enroll international students and would instead give it 30 days to contest those plans through a lengthier administrative process.\n\n\n\nThe US Department of Homeland Security sent Harvard a notice of intent on Wednesday to withdraw the school’s certification under a federal program to enroll non-US students.\n\n\n\nThe Justice Department filed the notice in court ahead of a hearing before US District Judge Allison Burroughs in Boston over whether to extend a temporary order blocking President Donald Trump’s administration from revoking the Ivy League school’s right to host international students.\n\n\n\nCiting the potential for Harvard and its students to be harmed if the administration reverted to its earlier plans, Burroughs at that hearing said she planned to issue a broad preliminary injunction preserving the status quo while the newly announced administrative process plays out.\n\n\n\nHarvard had a","url":"https://www.brecorder.com/news/40365353/trump-gives-harvard-30-days-to-contest-end-of-intl-student-enrolment","image":"https://i.brecorder.com/large/2025/05/6838ff2ad84f9.jpg","video":null,"publish_date":"2025-05-30 01:03:48","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.156},{"id":326293224,"title":"Trump summons Powell, tells him he’s making a mistake on rates","text":"WASHINGTON: US President Donald Trump called Federal Reserve Chair Jerome Powell to the White House on Thursday for their first face-to-face meeting since he took office in January and told the central bank chief he was making a “mistake” by not lowering interest rates. \n\nBoth the White House and Fed confirmed the two met at the president’s invitation, renewing a fractious relationship in which Trump has repeatedly berated Powell for not cutting rates as the president desires. “Chair Powell did not discuss his expectations for monetary policy,” the Fed said in a statement after the meeting, “except to stress that the path of policy will depend entirely on incoming economic information and what that means for the outlook.” \n\nHe told Trump that he and his colleagues at the Fed “will set monetary policy, as required by law, to support maximum employment and stable prices and will make those decisions based solely on careful, objective, and non-political analysis,” the statement said. White House spokeswoman Karoline Leavitt said she and the president had seen the Fed’s statement and that it was correct. \n\nHowever, she added, “the President did say that he believes the Fed chair is making a mistake by not lowering interest rates, which is putting us at an economic disadvantage to China and other countries.”","summary":"WASHINGTON: US President Donald Trump called Federal Reserve Chair Jerome Powell to the White House on Thursday for their first face-to-face meeting since he took office in January and told the central bank chief he was making a “mistake” by not lowering interest rates. \n\n\n\nBoth the White House and Fed confirmed the two met at the president’s invitation, renewing a fractious relationship in which Trump has repeatedly berated Powell for not cutting rates as the president desires. “Chair Powell did not discuss his expectations for monetary policy,” the Fed said in a statement after the meeting, “except to stress that the path of policy will depend entirely on incoming economic information and what that means for the outlook.” \n\n\n\nHe told Trump that he and his colleagues at the Fed “will set monetary policy, as required by law, to support maximum employment and stable prices and will make those decisions based solely on careful, objective, and non-political analysis,” the statement said. White House spokeswoman ","url":"https://www.brecorder.com/news/40365410/trump-summons-powell-tells-him-hes-making-a-mistake-on-rates","image":"https://i.brecorder.com/large/2025/05/6838eeadb32a7.jpg","video":null,"publish_date":"2025-05-30 01:03:48","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.062},{"id":326293222,"title":"US says it will start revoking visas for Chinese students","text":"WASHINGTON: US Secretary of State Marco Rubio announced on Wednesday the United States will start “aggressively” revoking visas of Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields.\n\nIf applied to a broad segment of the hundreds of thousands of Chinese university students in the United States, the move could disrupt a major source of income for American schools and a crucial pipeline of talent for US technology companies.\n\nPresident Donald Trump’s administration has sought to ramp up deportations and revoke student visas as part of wide-ranging efforts to fulfill its hardline immigration agenda.In a statement, Rubio said the State Department will also revise visa criteria to enhance scrutiny of all future visa applications from China and Hong Kong.","summary":"WASHINGTON: US Secretary of State Marco Rubio announced on Wednesday the United States will start “aggressively” revoking visas of Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields.\n\n\n\nIf applied to a broad segment of the hundreds of thousands of Chinese university students in the United States, the move could disrupt a major source of income for American schools and a crucial pipeline of talent for US technology companies.\n\n\n\nPresident Donald Trump’s administration has sought to ramp up deportations and revoke student visas as part of wide-ranging efforts to fulfill its hardline immigration agenda.In a statement, Rubio said the State Department will also revise visa criteria to enhance scrutiny of all future visa applications from China and Hong Kong.","url":"https://www.brecorder.com/news/40365354/us-says-it-will-start-revoking-visas-for-chinese-students","image":"https://i.brecorder.com/large/2025/05/6838fe8bc8fca.jpg","video":null,"publish_date":"2025-05-30 01:03:48","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.206},{"id":326293184,"title":"Appeals court reinstates Trump’s tariffs","text":"NEW YORK: A federal appeals court on Thursday reinstated the most sweeping of President Donald Trump’s tariffs, a day after a trade court had ruled Trump had exceeded his authority in imposing the duties and had ordered an immediate block on them. \n\nThe United States Court of Appeals for the Federal Circuit in Washington’s order provided no opinion or reasoning but directed the plaintiffs in the case to respond by June 5 and the administration by June 9. \n\nWednesday’s surprise ruling by the US Court of International Trade had threatened to kill or at least delay the imposition of Trump’s “Liberation Day” tariffs on most US trading partners, as well as import levies on goods from Canada, Mexico and China related to his accusation that the three countries were facilitating the flow of fentanyl into the US.","summary":"NEW YORK: A federal appeals court on Thursday reinstated the most sweeping of President Donald Trump’s tariffs, a day after a trade court had ruled Trump had exceeded his authority in imposing the duties and had ordered an immediate block on them. \n\n\n\nThe United States Court of Appeals for the Federal Circuit in Washington’s order provided no opinion or reasoning but directed the plaintiffs in the case to respond by June 5 and the administration by June 9. \n\n\n\nWednesday’s surprise ruling by the US Court of International Trade had threatened to kill or at least delay the imposition of Trump’s “Liberation Day” tariffs on most US trading partners, as well as import levies on goods from Canada, Mexico and China related to his accusation that the three countries were facilitating the flow of fentanyl into the US.","url":"https://www.brecorder.com/news/40365411/appeals-court-reinstates-trumps-tariffs","image":"https://i.brecorder.com/large/2025/05/6838ed02d0420.jpg","video":null,"publish_date":"2025-05-30 01:03:48","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.288},{"id":326292098,"title":"Russian commander behind Mariupol strikes that claimed 8,000 lives is killed in 'suicide attack'","text":"A retired Russian commander behind the Mariupol strikes that claimed 8,000 Ukrainian lives has been killed by a 'suicide bomber' on the southern city of Stavropol. \n\nZaur Gurtsiev, 34, who had received several medals for participating in Russia's bloody attacks on the Ukrainian port city of Mariupol, was killed alongside another identified man in a blast on Thursday, Russia's Investigative Committee said. \n\nThe unnamed man is said to have approached Gurtsiev just before the explosion. \n\nRussia's Investigative Committee, which probes serious crimes, said the bodies of two men with multiple injuries had been discovered on Thursday outside a multi-storey building and that criminal cases investigating murder and the illegal possession of explosives had been opened. \n\nVideo footage published on social media showed two men standing close to some parked cars and a bench when a bright light filled the screen and the footage cut out.\n\nRussian authorities have now opened a criminal case following the death of the two men. \n\nThey did not say what caused the explosion, but did not rule out the possibility of Ukraine's involvement. \n\nLocal reports have also suggested that it was a suicide blast attack, possibly involving a grenade.\n\nGurtsiev was due to be appointed to Stavropol's regional administration.\n\nStavropol Region Governor Vladimir Vladimirov and other officials offered their condolences to Gurtsiev and his family.\n\nGurtsiev's death comes following a string of attacks on high-profile Russian servicemen. \n\nIn December, the head of the Russian military's biological and chemical weapons unit Lt. General Igor Kirillov was killed along with his deputy in an explosion in Moscow. \n\nLast month, an explosive device in Moscow killed senior Russian General-Lieutenant Yaroslav Moskalik. \n\nThe attack also comes as Ukrainian President Volodymyr Zelensky said on Thursday that Russia was engaging in 'yet another deception' by failing to hand over its peace settlement proposal ahead of a potential meeting between Moscow and Kyiv.\n\n'Even the so-called 'memorandum' they promised and seemingly prepared for more than a week has still not been seen by anyone,' Zelensky said in his nightly video address. \n\n'Ukraine has not received it. Our partners have not received it. Even Turkey, which hosted the first meeting, has not received the new agenda.\n\n'Despite promises to the contrary, first and foremost to the the United States of America, to President (Donald) Trump: Yet another Russian deception.'\n\nRussian Foreign Minister Sergei Lavrov said on Wednesday that Moscow had drafted a memorandum outlining a settlement position in the three-year-old conflict in Ukraine.\n\nHe suggested a second round of direct talks take place on Monday, again in the Turkish city of Istanbul.\n\nTurkish President Tayyip Erdogan, who has maintained good ties with both sides, told reporters that Russia's invitaation for more talks had heightened Ankara's hopes for peace.\n\n'The road to a resolution goes through more dialogue, more diplomacy. We are using all our diplomatic power and potential for peace,' Erdogan's office quoted him as saying.\n\nIn Washington, the White House said Trump, who has been pressing both sides to move towards an agreement, hoped the proposed meeting in Istanbul would go ahead.\n\nKremlin spokesman Dmitry Peskov said on Thursday that Moscow had received no reply from Kyiv on whether it would attend negotiations on Monday in Istanbul .\n\nRussia, Zelensky said in his address, was 'doing everything to make the meetings hollow' and Ukraine's partners needed to intensify pressure on Moscow.\n\nUkrainian Foreign Ministry spokesperson Heorhii Tykhyi said that without being able to review Russia's memorandum, Kyiv would conclude 'it is likely filled with unrealistic ultimatums, and they are afraid of revealing that they are stalling the peace process'.\n\nWhen asked to comment on Ukrainian Foreign Minister Andrii Sybiha's suggestion that Russia should immediately hand over the memorandum, Peskov dismissed the idea as 'non-constructive'.\n\nIt also comes as Russian forces have taken four border villages in Ukraine's northeastern Sumy region, days after Putin said he had ordered troops to establish a buffer zone along the border.\n\nSumy borders Russia’s Kursk region, where a surprise Ukrainian incursion last year captured a pocket of land in the first occupation of Russian territory since World War II. \n\nThe long border is vulnerable to Ukrainian incursions, Putin said, and creating a buffer zone could help Russia prevent further cross-border attacks there.\n\nMeanwhile, a Russian bombing campaign that had escalated in recent days slowed overnight, with far fewer Russian drones targeting Ukrainian towns and cities.\n\nMoscow’s invasion has shown no signs of stopping despite months of intense U.S.-led efforts to secure a ceasefire and get traction for peace talks. \n\nSince Russian and Ukrainian delegations met in Turkey on May 16 for their first direct talks in three years, a large prisoner exchange has been the only tangible outcome, but negotiations have brought no significant breakthrough.","summary":"Zaur Gurtsiev, 34, was killed alongside another identified man in a blast on Thursday, Russia's Investigative Committee said.","url":"https://www.dailymail.co.uk/news/article-14763411/Russian-commander-Mariupol-killed-suicide-attack.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/01/98880191-0-image-m-18_1748564810238.jpg","video":null,"publish_date":"2025-05-30 00:57:59","author":"Editor,Sabrina Penty","authors":["Editor","Sabrina Penty"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.083},{"id":326291814,"title":"World News | White House Vows Supreme Court Fight over Trump Tariff Ruling","text":"By Reena Bhardwaj Washington, DC [US], May 30 (ANI): The Trump administration has threatened to escalate its tariffs dispute to the Supreme Court after a court ruling overturned many of the president's new import duties. The administration is demanding that the decision be suspended\nAlso Read | Swiss Glacier Collapse: Search Suspended for Missing Man in Glacier Collapse That Destroyed 90% of Alpine Village in Switzerland (Watch Videos).\nWhite House Press Secretary Karine Leavitt declared, \"We will win this battle in court\", in a press briefing and said the administration is working to \"tackle rogue judges.\"\nWhen asked why other countries would continue trade negotiations amid the legal uncertainty, she said the U.S. trade ambassador had heard from countries that morning confirming their intention to continue working with the United States.\nAlso Read | Earthquake in Pakistan: Quake of Magnitude 4.4 on Richter Scale Hits Country, No Casualties Reported.\nDuring a Thursday briefing, Leavitt also informed reporters that U.S. President Donald Trump and Japanese Prime Minister Shigeru Ishiba spoke by phone on Thursday, exchanging views on tariff-related issues.\nThe press secretary added that members of the president's cabinet--Secretary Lutnick, Secretary Bessent, and Ambassador Jamieson Greer--have been in contact with their counterparts worldwide to signal that the United States remains committed to negotiations.\n\"Countries around the world have faith in the negotiator in chief, President Donald J. Trump. And they also probably see how ridiculous this ruling is, and they understand the administration is going to win,\" Leavitt said. \"And we intend to win. We already filed an emergency appeal, and we expect to fight this battle all the way to the Supreme Court,\" the press secretary asserted. White House lawyers petitioned the Court of Appeals for the Federal Circuit on Thursday to halt Wednesday's decision from taking effect. The move followed a second court ruling that found President Trump had exceeded his authority in implementing the tariffs.\nThe rulings represent significant victories for small businesses and states that have mounted legal challenges to the measures, striking at policies central to Trump's economic and foreign policy agenda.\nLeavitt also criticised the court's tariff ruling as an example of \"judicial overreach.\" She argued that Trump's tariffs were introduced to address U.S. trade deficits with other nations and described the taxes as \"legally sound\" and \"long overdue.\"past.\" Meanwhile, a US team is scheduled to visit India on June 5-6 for the next round of negotiations on a Bilateral Trade Agreement (BTA) between the two countries.\nThe India-US trade deal would mark a significant milestone in economic relations between the two big economies, potentially opening new avenues for bilateral commerce and investment.\nAdditionally, Ray Vickery, Former United States Assistant Secretary of Commerce for Trade Development, said that the trade agreement between India and the US can't happen with Washington's \"bullying approach.\" \"In Trump, 1.0, there was a negotiation that came close to getting a freer trade, not a free trade arrangement between the United States and India. One hopes that that would happen, but it's not going to happen with this bullying approach, which the Trump administration has indicated,\" Ray Vickery told ANI.\nPresident Donald Trump has made repeated claims that the US mediated the cessation of hostilities between India and Pakistan and offered them \"a lot of trade.\" However, India has emphasised that the two nations' militaries negotiated directly and resolved the conflict through an agreement and understanding for a cessation of fire and military action.\nThe cessation of hostilities was agreed upon following a call from Pakistan's Director General of Military Operations (DGMO) to his Indian counterpart, Lieutenant General Rajiv Ghai, after India destroyed nine terror infrastructure sites in Pakistan and Pakistan occupied Jammu and Kashmir under Operation Sindoor. Additionally, Vikrey said that the Trump administration has a \"misunderstanding\" regarding trade deficits, due to whichthe US is determined to impose tariffs on other countries. \"The Trump administration has a misunderstanding in regard to trade deficits. Trade deficits are not necessarily something imposed just by unfair trade practices by another country, but they have to do with the United States' own saving and spending habits, he said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Trump administration has threatened to escalate its tariffs dispute to the Supreme Court after a court ruling overturned many of the president's new import duties, demanding the decision be suspended.","url":"https://www.latestly.com/agency-news/world-news-white-house-vows-supreme-court-fight-over-trump-tariff-ruling-6892324.html","image":"https://st1.latestly.com/wp-content/uploads/2025/05/ANI-20250529230903.jpg","video":null,"publish_date":"2025-05-30 00:42:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.04},{"id":326291772,"title":"Washington’s Spending Party Continues As Elon Musk Bids Farewell To Swamp","text":"Elon Musk’s time as head of the Department of Government Efficiency (DOGE) is drawing to a close, but the national debt and runaway spending remain virtually unchanged despite the incessant media coverage of the cost-cutting effort.\n\nThe Tesla CEO’s departure wraps up a government stint marked by mass layoffs and a flood of legal battles over DOGE’s various moves to cut down the federal bureaucracy. Musk entered the role with bold ambitions of slashing as much as $2 trillion in federal waste, but as he prepares to step back from the Trump administration, only a small fraction of those cuts have materialized.\n\nPresident Donald Trump brought Musk on board as a “special government employee” shortly after taking office in January, tasking the billionaire with eliminating unnecessary federal spending. As a “special government employee,” Musk was limited to 130 working days per year for the administration, with his appointment set to expire around May 30. (RELATED: How A ‘Nonpartisan’ Government Budget Office May Be Misleading Lawmakers On Spending As GOP Megabill Looms Large)\n\n As my scheduled time as a Special Government Employee comes to an end, I would like to thank President @realDonaldTrump for the opportunity to reduce wasteful spending. The @DOGE mission will only strengthen over time as it becomes a way of life throughout the government. — Elon Musk (@elonmusk) May 29, 2025 \n\nIn the months following his appointment to DOGE, Musk faced declining sales of his Tesla vehicles as well as a surge in acts of vandalism against his products by consumers outraged by his efforts to dramatically reduce government.\n\nDespite the personal costs incurred by his work for the Trump administration, DOGE produced roughly $175 billion in savings, at least according to its own estimates. However, the DOGE figure has been disputed as being overstated due to accounting errors or incorrect assumptions; the American Enterprise Institute has calculated that the actual savings are likely closer to $10 billion.\n\nFor context, the federal government spent $6.1 trillion in fiscal year 2023 while running a $1.7 trillion deficit, according to the Congressional Budget Office.\n\nSome observers, such as Competitive Enterprise Institute senior economist Ryan Young, say that while Musk and DOGE had “good intentions” to root out government waste, they underestimated the challenge of making large structural changes.\n\n“[DOGE] got the order of operations wrong,” Young told the Daily Caller News Foundation. “They went after slashing payroll first and agency responsibility second. That’s not the way to do things. Now, we have regulations and agency responsibilities that are still in full effect, and you don’t have people to administer them.”\n\nFurthermore, Young noted that although DOGE initiated the cuts to staffing and entire departments, like the U.S. Agency for International Development (USAID), entitlement programs such as Social Security and Medicaid — which represent the vast majority of the federal government’s spending — remained relatively unscathed.\n\n“If DOGE was going to do one thing, it should have been entitlement reform. But President Trump took that off the table almost right away,” Young said.\n\nSetting aside disputes over the true extent of DOGE’s savings, the House recently passed its version of the GOP reconciliation bill, and some forecasters have estimated the package will add trillions to the budget deficit. The bill has drawn criticism from many Republican members of Congress, and even Musk himself, for probably failing to reduce the size of government.\n\n“I was disappointed to see the massive spending bill, frankly, which increases the deficit, not just decreases it, and undermines the work that the DOGE team is doing,” Musk said to CBS News in an interview airing Sunday. “I think a bill can be big, or it can be beautiful, but I don’t know if it can be both.”\n\nDespite the modest cuts to federal spending, not everybody believes DOGE was a failure.\n\n“The true purpose is to eliminate wasteful spending, but [DOGE] was never intended to do that in just the short amount of time Elon Musk would be there,” Stewart Whitson, director of federal affairs at the Foundation for Government Accountability, told the DCNF. “The plan was for Musk to get the plan off the ground under the leadership of President Trump and use the reach he has on social media to bring wasteful spending to the attention of American citizens.”\n\nTo that end, Musk wrote on X that the “DOGE mission will only strengthen over time” and become “a way of life throughout government.” The White House has communicated the same message.\n\nDespite largely negative media coverage and mixed public opinion on both DOGE and Elon Musk, a recent Cato Institute survey found that Americans think the federal government wastes more money today than a decade prior and overwhelmingly believe there is considerable waste, fraud and abuse.\n\nWhitson also emphasized that DOGE’s savings are not “pocket change,” and that the cuts were important to Americans for their dollar value and because they terminated funding for what he described as “destructive” initiatives, such as so-called “diversity, equity and inclusion” (DEI) programs.\n\nHowever, Congressional action will be required to ensure these changes are permanent and prevent future administrations from reversing them. The White House is expected to send Congress a $9.4 billion rescissions package to codify some of the DOGE cuts, which Speaker Mike Johnson said Wednesday he is “eager and ready to act on.”\n\nFor the GOP, there may be a silver lining to be found in voter turnout in the upcoming midterms, according to Jon McHenry, a Republican pollster with North Star Opinion Research\n\n“The big problem Republicans face for next year is getting their base to turn out,” McHenry said. “DOGE certainly alienated some democrats, but they were already alienated. What it does do is tell the base that we are trying to do what you sent us here to do. And it also gives Republicans next year the ability to say, ‘We tried to do it at the executive level. We couldn’t. We need more Republicans in Congress to get these things passed.’”\n\nThough Musk is stepping away from government matters to focus on his multiple businesses, DOGE is expected to continue operating until July 4, 2026.\n\nThe White House did not respond to the Daily Caller News Foundation’s request for comment, while a representative from DOGE could not be reached.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'DOGE got the order of operations wrong'","url":"https://dailycaller.com/2025/05/29/washingtons-spending-party-elon-musk-bids-farewell-swamp/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/GettyImages-2216312549-scaled-e1748548532244.jpg","video":null,"publish_date":"2025-05-30 00:38:49","author":"Melissa O'rourke","authors":["Melissa O'rourke"],"language":"en","category":"politics","source_country":"us","sentiment":-0.241},{"id":326289056,"title":"'Stop playing this game': Michael Steele unleashes on 'stupid' Trump White House press sec","text":"On Thursday, White House press secretary Karoline Leavitt gave the official response from President Donald Trump's administration to a court decision halting the vast bulk of his tariffs from going into effect, which questioned the legitimacy of federal judges to weigh in on his policies.\n\n\"Three judges of the U.S. Court of International Trade disagreed and brazenly abused their judicial power to usurp the authority of President Trump to stop him from carrying out the mandate that the American people gave him,\" Leavitt said during her Thursday briefing. \"The courts should have no role here. There is a troubling and dangerous trend of unelected judges inserting themselves into the presidential decision making process. These judges are threatening to undermine the credibility of the United States on the world stage.\"\n\nAfter hearing her remarks, MSNBC host and former Republican National Committee chairman Michael Steele erupted on Leavitt's \"stupid\" response to the court decision and urged his colleagues in the media to not \"gloss over\" her comments.\n\nREAD MORE: 'Not sure how to process it': Whitmer accuses Trump of lying to her face\n\n\"This goes to the heart of the problem we have right now in the country. That rhetoric is baloney, and she knows it,\" Steele said. \"But she's performing for the guy behind the Resolute Desk who wants to hear this. He needs that justification for the action he's taken. And when he gets pushback, his response is, 'oh, you're the bad actor. You're the one who's undermining this system.' He's the one who's undermining the system!\"\n\n\"And I think we need to be clear about that and stop playing this game and taking the crap that comes out of this administration behind that podium every day, undermining our judicial system,\" Steele continued. \"It is the last front we have against what they're doing. And I think we just need to be clear about that and not sit back, as we do in Washington, and pitty-pat around the crazy, because she's got the White House podium in front of her and the logo behind her. That doesn't justify anything that we see happening right now.\"\n\nWhile both the Court of International Trade and the U.S. District Court for the District of Columbia ruled Trump's use of the International Economic Emergency Powers Act of 1977 to impose tariffs to be unconstitutional, the D.C. Circuit Court of Appeals reinstated the tariffs on Thursday. The circuit didn't issue an opinion on the tariffs, but only ruled that they could remain in place while litigation played out.\n\nWatch the full segment below, or by clicking this link.\n\nREAD MORE: (Opinion) today marks the beginning of the end of Donald Trump's bonkers 2nd regime\n\n- YouTubewww.youtube.com","summary":"On Thursday, White House press secretary Karoline Leavitt gave the official response from President Donald Trump's administration to a court decision halting the vast bulk of his tariffs from going into effect, which questioned the legitimacy of federal judges to weigh in on his policies.\n\n\"Three judges of the U.S. Court of International Trade disagreed and brazenly abused their judicial power to usurp the authority of President Trump to stop him from carrying out the mandate that the American people gave him,\" Leavitt said during her Thursday briefing. \"The courts should have no role here. There is a troubling and dangerous trend of unelected judges inserting themselves into the presidential decision making process. These judges are threatening to undermine the credibility of the United States on the world stage.\"\n\nAfter hearing her remarks, MSNBC host and former Republican National Committee chairman Michael Steele erupted on Leavitt's \"stupid\" response to the court decision and urged his colleagues in the ","url":"https://www.alternet.org/michael-steele-karoline-leavitt/","image":"https://www.alternet.org/media-library/image.png?id=60342029&width=1200&height=600&coordinates=0%2C101%2C0%2C102","video":null,"publish_date":"2025-05-30 00:37:08","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.147},{"id":326289964,"title":"MSNBC Weighs Risk of Goading Trump With TACO Memes, Says Political Career Was Sparked by Obama Roast | Video","text":"MSNBC thinks the fact that people have to assess the real risk of goading President Donald Trump points to the bizarro world America is living in right now.\n\nOn Thursday, in the wake of the new TACO (Trump Always Chickens Out) trade memes flooding the internet, host Nicole Wallace asked if goading the president with more jokes was worth it. “The Economist’s” Charlotte Howard pointed to Barack Obama’s roast of Trump pushing him to run for office in the first place before wondering why everyone is treating the president like a “senile uncle.”\n\n“In 2011 Barack Obama gives this brilliant roast of Donald Trump at the White House Correspondents Dinner after Trump had been going after him with the birther movement,” Howard said explaining how at the time Obama completely eviscerated him. “You see Donald Trump in the moment boiling over and the reporting on it was that that was a really pivotal moment there that galvanized him to run for president. He does detest being mocked, though he certainly likes mocking other people. So, that risk is real.”\n\nShe continued: “I think the fact that we’re even having this conversation points to the bizarro world that we’re in in Trump two […] Where we’re thinking about ‘what if we make fun of Trump and then he’ll respond in this way’ and the chaos that will be unleashed could be damaging for America’s standing in the world and in the American economy. The fact that we’re having that conversation points to this weird environment in which some people seem to be treating Trump like a senile uncle who needs to be appeased.”\n\n“You see Congress, and the people around Trump, continuing to try to placate him, trying to play into his worst instincts in a way that’s counterproductive,” Howard concluded. “I think the question is, ‘When will they grow a spine in Congress?’ When some people might stand up to him. What would be the set of events that would trigger Congress behaving like grown-ups and not trying to just pledge fealty to the the president?”\n\nThe TACO meme came after many wondered if the president was “chicken” for constantly backing off his many high tariffs when the market dropped. The president was asked about the term by a reporter Wednesday and was visibly annoyed by being labeled a chicken.\n\n“You call that chickening out? It’s called negotiation,” Trump said before adding that the question was “nasty.”\n\nWatch the full MSNBC video above.","summary":"\"Some people seem to be treating Trump like a senile uncle who needs to be appeased,\" Charlotte Howard says\n\n\nThe post MSNBC Weighs Risk of Goading Trump With TACO Memes, Says Political Career Was Sparked by Obama Roast | Video appeared first on TheWrap.","url":"https://www.thewrap.com/msnbc-weighs-donald-trump-taco-memes-risk/","image":"https://www.thewrap.com/wp-content/uploads/2025/04/Donald-Trump-4-24-25.jpg","video":null,"publish_date":"2025-05-30 00:36:49","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.25},{"id":326292078,"title":"Musk aiming to send uncrewed Starship to Mars by end of 2026","text":"LOS ANGELES :Two days after the latest in a string of test-flight setbacks for his big new Mars spacecraft, Starship, Elon Musk said on Thursday he foresees the futuristic vehicle making its first uncrewed voyage to the red planet at the end of next year.\n\nMusk presented a detailed Starship development timeline in a video posted online by his Los Angeles area-based rocket company, SpaceX, a day after departing the administration of U.S. President Donald Trump as head of a tumultuous campaign to slash government bureaucracy.\n\nThe billionaire entrepreneur had said earlier that he was planning to scale back his role in government to focus greater attention on his various businesses, including SpaceX and electric car and battery maker Tesla Inc.\n\nMusk acknowledged that his latest timeline for reaching Mars hinged on whether Starship can accomplish a number of challenging technical feats during its flight-test development, particularly a post-launch refueling maneuver in Earth orbit.\n\nThe end of 2026 would coincide with a slim window that occurs once every two years when Mars and Earth align around the sun for the closest trip between the two planets, which would take seven to nine months to transit by spacecraft.\n\nMusk gave his company a 50-50 chance of meeting that deadline. If Starship were not ready by that time, SpaceX would wait another two years before trying again, Musk suggested in the video.\n\nThe first flight to Mars would carry a simulated crew consisting of one or more robots of the Tesla-built humanoid Optimus design, with the first human crews following in the second or third landings.\n\nNASA is currently aiming to return humans to the surface of the moon aboard Starship as early as 2027 - more than 50 years after its last manned lunar landings of the Apollo era - as a stepping stone toward ultimately launching astronauts to Mars sometime in the 2030s.\n\nMusk, who has advocated for a more Mars-focused human spaceflight program, has previously said he was aiming to send an unmanned SpaceX vehicle to the red planet as early as 2018 and was targeting 2024 to launch a first crewed mission there.\n\nThe SpaceX founder was scheduled to deliver a live webcast presentation billed as \"The Road to Making Life Multiplanetary\" from the company's Starbase, Texas, launch site on Tuesday night, following a ninth test flight of Starship that evening.\n\nBut the speech was canceled without notice after Starship spun out of control and disintegrated in a fireball about 30 minutes after launch and roughly halfway through its flight path without achieving some of its most important test goals.\n\nTwo preceding test flights in January and March failed in more spectacular fashion, with the spacecraft blowing to pieces on ascent moments after liftoff, raining debris over parts of the Caribbean and forcing scores of commercial jetliners to change course as a precaution.\n\nMusk shrugged off the latest mishap on Tuesday with a brief post on X, saying it produced a lot of \"good data to review\" and promising a faster launch \"cadence\" for the next several test flights.","summary":"","url":"https://www.channelnewsasia.com/business/musk-aiming-send-uncrewed-starship-mars-end-2026-5159551","image":"https://dam.mediacorp.sg/image/upload/s--_PY_Qapq--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-05-30t003640z_1_lynxnpel4t00s_rtroptp_3_milken-conference.jpg?itok=","video":null,"publish_date":"2025-05-30 00:36:40","author":null,"language":"en","source_country":"sg","sentiment":-0.262},{"id":326290326,"title":"China’s market leaders in tech, energy sectors are focus of investors: JPMorgan","text":"Global investors are increasingly turning to China’s global market leaders in the technology and energy sectors to diversify their investment portfolios amid heightened geopolitical tensions and uncertain economic outlook, according to JPMorgan.\nFunds were not only targeting established firms in industries like car manufacturing, robotics and renewable energy but also capturing opportunities in China’s innovative capabilities as market volatility spikes, said Kwang Kam Shing, Hong Kong CEO and chair for North Asia at the US’ biggest bank.\n“They are a group of very well informed and sophisticated investors,” Kwang said. “Aside from just talking about the technology, there were discussions on how the supportive business ecosystem in China has effectively nurtured and developed this group of entrepreneurs and innovators.”\nKwang said this in an interview on Friday at the two-day JPMorgan Global China Summit in Shanghai, which drew more than 2,800 executives, regulatory officials and institutional funds from more than 30 countries. Many top mainland-listed firms were seeking a listing in Hong Kong to widen their investor base, bankers said.\n\nSome of China’s biggest companies hold commanding leads in global markets. Electric-vehicle (EV) maker BYD has toppled Tesla in sales, while Contemporary Amperex Technology controls more than 38 per cent of the market for EV batteries. DeepSeek’s breakthroughs in large-language models sparked a trillion-dollar global rout in Nvidia and US tech stocks in January.\nGlobal investors’ enthusiasm for those companies aligns with Beijing’s efforts to bolster high-productivity sectors to combat an economic slowdown, Kwang said.\nThe MSCI China Index, which tracks 700-odd stocks listed at home and abroad, has jumped 13.7 per cent or US$305 billion in market value year to date. A 15 per cent correction between April 3 and April 7 when US President Donald Trump announced his so-called reciprocal tariffs was not enough to dent strong buying interest.\nHong Kong and mainland stocks regained the attention of global investors after Beijing and Washington agreed on a 90-day tariff reduction in Geneva on May 12, under which China reduced its levies on US imports to 10 per cent, while the US cut its “reciprocal” tariffs to 30 per cent.\n\n“Anything that helps to de-escalate is positive, and it will be well received by the market,” Kwang said. “But that remains the uncertainty that is on everybody’s mind.”\nSince the tentative tariff truce, the Hang Seng Index has risen nearly 3.1 per cent. Despite this week’s wobble, the benchmark’s 17.5 per cent advance so far this year has outpaced the 0.7 per cent gain in the S&P 500 and 3.7 per cent increase in the MSCI World Index, according to Bloomberg data.\nChina’s “high-productivity sectors are growing fast, which offers prospects of raising overall economic productivity as these sectors become larger,” Moody’s Ratings said in a statement on Monday as it affirmed China’s A1 sovereign rating. “Recent trends indicate an improving quality of growth, bolstering economic resilience.”\nMainland investors have bought US$3.9 billion of Hong Kong stocks this month, taking the cumulative buying this year to a record US$82 billion, according to JPMorgan.\nNet allocation by global hedge funds to Chinese stocks stood at 8 per cent, versus 6.5 per cent in December, Goldman Sachs said in a report on May 23.\nAnu Aiyengar, JPMorgan’s global co-head of mergers and acquisitions, said uncertainty would create opportunities since clients need professional advice on how to navigate hard markets in challenging times.\n“Based on the fact that we are touching companies everywhere, we have a bird’s eye view of what is happening that we can help people with,” she said.","summary":"Global investors are increasingly turning to China’s global market leaders in the technology and energy sectors to diversify their investment portfolios amid heightened geopolitical tensions and uncertain economic outlook, according to JPMorgan.\nFunds were not only targeting established firms in industries like car manufacturing, robotics and renewable energy but also capturing opportunities in China’s innovative capabilities as market volatility spikes, said Kwang Kam Shing, Hong Kong CEO and...","url":"https://www.scmp.com/business/china-business/article/3312022/chinas-world-beaters-tech-energy-sectors-are-focus-investors-jpmorgan-says","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/05/27/4aa3c8d1-b3f9-4031-8627-72e872759891_2c818e77.jpg","video":null,"publish_date":"2025-05-30 00:30:07","author":"Daniel Ren","authors":["Daniel Ren"],"language":"en","category":"business","source_country":"cn","sentiment":-0.072},{"id":326293510,"title":"Israel accepts US Gaza ceasefire proposal, Hamas says it will review it","text":"Israel has accepted a new US proposal for a temporary ceasefire with Hamas, according to White House officials. \n\nUS President Donald Trump's special envoy, Steve Witkoff, expressed optimism this week about brokering an agreement to halt the Israel-Hamas war and return more of the hostages captured in the attack that ignited it.\n\nWhite House press secretary Karoline Leavitt told reporters on Thursday, local time, Israel had \"backed and supported\" the new proposal.\n\nHamas officials gave the Israeli-approved draft a cool response, but said they wanted to study the proposal more closely before giving a formal answer.\n\n\"The Zionist response, in essence, means perpetuating the occupation and continuing the killing and famine,\" Bassem Naim, a top Hamas official, told The Associated Press. \n\nHe said it \"does not respond to any of our people's demands, foremost among which is stopping the war and famine\".\n\nNonetheless, Mr Naim said the group would study the proposal \"with all national responsibility\".\n\nHamas had previously said it had agreed with Mr Witkoff on a \"general framework\" of an agreement that would lead to a lasting ceasefire, a full Israeli withdrawal from Gaza, an influx of aid, and a transfer of power from the militant group to a politically independent committee of Palestinians.\n\nHere's what we know about the emerging negotiations that aim to bring about an extended truce in the war in exchange for hostages that remain in captivity.\n\nWhat do Israel and Hamas want?\n\nIsraeli Prime Minister Benjamin Netanyahu has refused to end the war until all the hostages are released and Hamas is either destroyed or disarmed and sent into exile. \n\nHe has said Israel will control Gaza indefinitely and facilitate what he refers to as the voluntary emigration of much of its population.\n\nPalestinians and most of the international community have rejected plans to resettle Gaza's population, a move experts say would likely violate international law.\n\nHamas has said it would only release the remaining hostages in return for more Palestinian prisoners, a lasting ceasefire and a full Israeli withdrawal. \n\nIt has offered to give up power to a committee of politically independent Palestinians that could oversee reconstruction.\n\nHamas is still holding 58 hostages. Around a third are believed to be alive, though many fear they are in grave danger the longer the war goes on. \n\nThousands of Palestinians have been killed since Israel renewed its air strikes and ground operations after ending a ceasefire in March.\n\nThe dispute over whether there should be a temporary ceasefire to release more hostages — as Israel has called for — or a permanent one — as Hamas wants — has bedevilled talks brokered by the US, Egypt and Qatar for more than a year and a half, and there is no indication it has been resolved.\n\nWhat is the latest ceasefire proposal?\n\nMr Witkoff has not publicised his latest proposal, but a Hamas official and an Egyptian official independently confirmed some of the details. \n\nSpeaking on condition of anonymity to discuss the sensitive talks, they said it called for a 60-day pause in fighting, guarantees of serious negotiations leading to a long-term truce and assurances that Israel would not resume hostilities after the release of hostages, as it did in March. \n\nIsraeli forces would pull back to the positions they held during the ceasefire Israel ended that month. \n\nHamas would release 10 living hostages and a number of bodies during the 60-day pause in exchange for more than 1,100 Palestinians imprisoned by Israel, including 100 serving long sentences after being convicted of deadly attacks. \n\nEach day, hundreds of trucks carrying food and humanitarian aid would be allowed to enter Gaza, where experts say a nearly three-month Israeli blockade — slightly eased in recent days — has pushed the population to the brink of famine. \n\nWhy is it so hard to end the war?\n\nHamas-led militants stormed southern Israel on October 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251 hostages. More than half the hostages have been released in ceasefires or other deals. Israel has rescued eight and recovered dozens of bodies.\n\nIsrael's ensuing military campaign has killed more than 54,000 Palestinians, mostly women and children, according to the Gaza Health Ministry, which does not say how many of the dead were civilians or combatants.\n\nThe offensive has destroyed vast areas of Gaza and displaced about 90 per cent of its population of roughly 2 million Palestinians, with hundreds of thousands living in squalid tent camps and unused schools.\n\nHamas has been vastly depleted militarily and lost nearly all of its top leaders in Gaza. It most likely fears that releasing all the hostages without securing a permanent ceasefire would allow Israel to launch an even more devastating campaign to ultimately destroy the group.\n\nIsrael fears that a lasting ceasefire and withdrawal now would leave Hamas with significant influence in Gaza, even if it surrenders formal power. With time, Hamas might be able to rebuild its military might and eventually launch more October 7-style attacks.\n\nMr Netanyahu also faces political constraints: His far-right coalition partners have threatened to bring down his government if he ends the war too soon. That would leave him more vulnerable to prosecution on longstanding corruption charges and to investigations into the failures surrounding the October 7 attack.\n\nA broader resolution to the decades-old Israeli-Palestinian conflict appears more distant than ever.\n\nThe Palestinians are weak and divided, and Israel's current government — the most nationalist and religious in its history — is opposed to Palestinian demands for a state in Gaza, the West Bank and East Jerusalem, territories Israel occupied in the 1967 Mideast war.\n\nThe last serious peace talks broke down more than 15 years ago.","summary":"Hamas gives the Israeli-approved draft a cool response, but says it wants to study the proposal more closely before giving a formal answer.","url":"https://www.abc.net.au/news/2025-05-30/hamas-says-new-israel-ceasefire-proposal-does-not-meet-demands/105356742","image":"https://live-production.wcms.abc-cdn.net.au/c79eb6ad32338573c07943a300ab39c4?impolicy=wcms_crop_resize&cropH=2311&cropW=4108&xPos=0&yPos=214&width=862&height=485","video":null,"publish_date":"2025-05-30 00:29:13","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.433},{"id":326291092,"title":"‘People are terrified’: ICE agents stake out courthouses in Southern California to detain undocumented immigrants","text":"His papers fell to the ground. His girlfriend fell to her knees and broke down in tears. Five federal immigration agents surrounded 25-year-old Richard Urdaneta Pulido after he walked out of immigration court in downtown Los Angeles last week and arrested him.\n\nHis girlfriend, who is not being named to protect her safety, yelled “Richard!” as agents took Pulido down a set of elevators not open to the public.\n\nLast week, federal immigration agents across the country began arresting people, whose cases had just been dismissed, after they walked out of immigration courtrooms.\n\n“People are terrified… The Trump administration intentionally or unintentionally, I suspect it’s intentionally, is creating a climate of fear among people who are trying to follow the rules, and that’s just disgusting and outrageous,” said Niels Frenzen, co-director with USC’s immigration clinic.\n\nOn Friday, May 23, ICE agents detained at least four people after they walked out of immigration courtrooms in downtown Los Angeles, including Pulido, according to Lindsay Toczylowski, president, CEO and co-founder of Immigrant Defenders, a California law firm that provides legal services to immigrant communities.\n\nA reporter for the Southern California News Group, who was at the courthouse, witnessed federal agents detaining one person.\n\nThe effect of the Trump administration’s approach to targeted immigration enforcement also was felt this week in Orange County. According to immigration advocates, more than 10 people, including children, were detained by plainclothes ICE agents outside the immigration courthouse in Santa Ana this week.\n\n“Secretary (Kristi) Noem is reversing Biden’s catch and release policy that allowed millions of unvetted illegal aliens to be let loose on American streets. This Administration is once again implementing the rule of law,” said a DHS spokesperson in a statement.\n\nPulido traveled from Venezuela and entered the United States legally through the CBP One app, his girlfriend said, months before President Donald Trump shut it down. Almost immediately after Trump took office for his second term, the earlier version of the app stopped allowing migrants to apply for asylum. Tens of thousands of appointments were canceled.\n\nIt was later converted to a self-deportation app renamed CBP Home.\n\nPulido’s girlfriend said he fled death threats in Venezuela. She also said his brother was killed in front of him and their mother. He intended to apply for asylum but didn’t understand what was happening in court when Judge Peter Kim moved to dismiss his case.\n\nHis girlfriend said he was afraid to go to court on Friday, but that he wanted to go through the legal immigration process.\n\n“We never thought they were going to arrest him,” his girlfriend said.\n\nDepartment of Homeland Security lawyer Carolyn Marie Thompkins said the government was looking to dismiss his case in order to pursue Pulido’s expedited removal. Pulido tried to push back and told Kim that he believes he “can contribute a lot to this country” and that he’s looking for a better life for himself and his children. Pulido was not represented by a lawyer.\n\nKim responded by saying those are “not grounds to oppose the dismissal.” And his case was dismissed.\n\nAs Pulido was walking out of the courtroom, two federal agents in plainclothes followed him into the hallway. They, along with the three other agents in plainclothes waiting outside, surrounded Pulido and arrested him.\n\nPulido later was transferred to an ICE detention center in Tacoma, Washington.\n\n“It’s not normal that ICE agents would be in the courtroom about to arrest people,” said Toczylowski. She said in her 15 years of practicing in immigration court, she’s never seen such tactics.\n\nShe said this will make people afraid to come to court. “We are punishing the people who are following the rules, who are doing what the government asked them to do.”\n\n“[Immigration judges] have a duty to help unrepresented respondents to understand what is happening in those proceedings. And in this case, I would say the immigration judge did not do that. They did not explain it and it’s why ICE is targeting people who are unrepresented, because people who are represented would know all of their appellate rights.”\n\nFrenzen also said the immigration courtroom arrests are unprecedented, and that it’s a new move by the Trump administration to aid in its plan for mass deportations.\n\n“Clearly there is communication going on between the ICE lawyers and the ICE agents who are going to court,” he said.\n\nFrenzen said DHS is now going after people using the expedited removal process, “which basically eliminates the rights that a person would have if they were in front of an immigration judge because [DHS] can go after more people that way and deport them more quickly.” It can be used against people unauthorized to be in the U.S. who have been in the country for less than two years.\n\nSince the creation of the 1996 Illegal Immigration Reform and Immigration Responsibility Act, expedited removal has never been used on such a systematic scale, according to Frenzen. Expedited removal has typically been used by federal immigration agents along the border.\n\nThe expanded use of expedited removal is being challenged in court.\n\nSandra De Anda, an organizer with the Orange County Rapid Response Network, said she witnessed a father get taken away from his wife and 4-year-old daughter on Wednesday afternoon at the Santa Ana immigration courthouse. She said ICE officers behaved “aggressively” towards the family, including the child.\n\nThe OCRRN organization, which has been active since Trump’s first presidency in 2017, has also not seen tactics like this before, said organizers.\n\nDe Anda said the four to five individuals detained Wednesday were asylum seekers whose cases were dismissed by a judge and didn’t have an attorney.\n\nA man and a woman, identified by volunteers as ICE agents, were spotted leaving the courthouse parking lot in a blue SUV with no license plate on Wednesday. Both individuals were dressed in plainclothes and wore black face masks without any visible identification.\n\nWhen asked to provide a comment, the woman said, “No, thank you,” and the pair drove off.\n\nOCRRN said plainclothes ICE agents were handing off detainees on-site at the courthouse to detention officers for transport. The individuals wore tactical gear with a patch that read ‘Detention G4S Officer Private Security’.G4S is a private security company owned by Allied Universal.\n\nDuties of their detention officers include include “armed transportation services, escorting detainees to and from transport vehicles, and monitoring detainees in your custody,” according to the GS4 website.\n\nAt the courthouse, a 33-year-old woman from Venezuela appeared distressed as she spoke to an OCRRN organizer. Earlier in the afternoon, she said plainclothes ICE agents grabbed her partner and took him into custody. She said in Spanish that she thinks agents didn’t take her because she was with her 7-month-old daughter. The two had been living in the U.S. for a little less than two years and are residents of Hemet.\n\nThe couple did not have an attorney\n\n“It is unlawful under the Immigration and Nationality Act for ICE officers to make arrests of individuals unless those ICE officers believe there is a likelihood that that person is likely to flee before a warrant can be obtained,” Frenzen said.\n\n“You have people who are going to court, pursuant to court orders, you have people whose addresses are registered with the court. That is overwhelming evidence that people are not trying to flee, they are following the rules.”","summary":"Immigration advocates say over 10 people, including children, were detained by plainclothes ICE agents outside the immigration courthouse in Santa Ana this week.","url":"https://www.ocregister.com/2025/05/29/ice-agents-staking-out-courthouses-in-southern-california-to-detain-undocumented-immigrants/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/LDN-L-IMMIG-COURT-0529-2.jpg?w=960&h=993","video":null,"publish_date":"2025-05-30 00:28:13","author":"Mona Darwish,Ryanne Mena","authors":["Mona Darwish","Ryanne Mena"],"language":"en","category":"politics","source_country":"US","sentiment":-0.216},{"id":326292404,"title":"White House opens doors to Anna Wintour despite Melania Trump feud","text":"Donald Trump has opened the White House to Anna Wintour despite her long-running feud with his wife Melania.\n\nThe Vogue editor-in-chief met Susie Wiles, Mr Trump’s chief of staff, in Washington DC on Thursday to discuss tariff relief for the fashion industry.\n\nHowever, there is tension between Wintour and Mrs Trump because Vogue never featured her on its cover during her time as first lady, unlike several of her predecessors.\n\nShe did, though, appear on the magazine’s front page in Feb 2005 when it covered her marriage to Mr Trump.\n\nAt her meeting with Ms Wiles, Wintour claimed that fashion was “already one of the most heavily tariffed industries in the US”, and argued further duties would place it at a “disproportionate advantage”.\n\nIt is unclear whether the first lady was at the White House during Wintour’s visit, but by and large her stays in Washington DC have been brief in favour of her homes at Trump Tower in New York or Mar-a-Lago in Palm Beach, Florida.\n\nAccording to Amy Odell, a biographer of Wintour, Vogue made two attempts to photograph Mrs Trump during her husband’s first term, but she refused both because it would not guarantee her a spot on the cover.\n\nWhen Wintour visited Mr Trump in New York in 2016 following his first election win, Mrs Trump is said to have been so “offended” that she was not informed beforehand that she “didn’t even say hello”.\n\nMrs Trump, a former model, apparently believed she was resented by figures at the magazine, according to a book by her former confidant Stephanie Winston Wolkoff.\n\n“I don’t give a f--- about Vogue or any other magazine. They would never put me on the cover. All these people are so mad,” she is reported to have said.\n\nWhen Mrs Trump’s official portrait was released in January, Vogue ran an opinion column declaring she looked “more like a freelance magician than a public servant”.\n\nJill Biden, Mrs Trump’s immediate predecessor as first lady, was featured on the front of the magazine last year during the presidential race, and in 2021 with the caption: “A first lady for all of us”.\n\nMichelle Obama made the cover twice – in 2009, shortly after Barack Obama’s inauguration, and in 2016 as they prepared to leave the White House – while Hillary Clinton appeared in 1999.\n\nFirst ladies Nancy Reagan and Laura Bush, both of them married to Republican presidents, were featured on the inside pages of Vogue but never on the front.","url":"https://uk.news.yahoo.com/white-house-opens-doors-anna-001624881.html","image":"https://s.yimg.com/ny/api/res/1.2/xyQ6H2J5f8hxUr7y85XiHg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_telegraph_818/1768804bf525decc70d75ccd48a7a162","video":null,"publish_date":"2025-05-30 00:16:24","author":"Benedict Smith","authors":["Benedict Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.245},{"id":326292240,"title":"Toll hike, rideshare fees, other new taxes threatening mass transit overhaul","text":"SPRINGFIELD — State lawmakers are on track toward overhauling the governance of mass transit across the Chicago area, but a lengthy list of proposed new taxes could derail efforts to stave off the fiscal cliff facing the CTA, Metra and Pace.\n\nDemocratic legislators on Thursday were mostly on board with the proposal to replace the Regional Transportation Authority with a strengthened new body known as the Northern Illinois Transit Authority, overseeing bus and rail service In Chicago, Cook County and the collar counties.\n\nBut as with so many issues in the state Capitol in a difficult budget year, the biggest question still nagged at Democratic leaders in the waning hours of the spring legislative session: who pays for it?\n\nState Sen. Ram Villivalam, D-Chicago, offered up a list of revenue options that he said reflected the “shared sacrifice” needed to maintain and improve service at the agencies collectively facing a $770 million shortfall next year.\n\nThat includes a 50-cent tollway surcharge, a redirection of a portion of suburban sales taxes to the new transit authority, an electric vehicle charging fee, a real estate transfer tax and a 10% tax on rideshares in the region. Interest earnings from the state road fund would also go toward transit projects.\n\n“This was never going to be easy, accomplishing the goal of a safe, reliable, accessible, integrated public transit system across our region, essentially changing completely the model that was set up 40 years ago,” Villivalam said.\n\nLabor leaders and suburban officials slammed many of the revenue proposals.\n\n“This is punitive to taxpayers in DuPage County,” State Sen. Suzy Glowiak Hilton, D-Oakbrook Terrace, said. “I don’t see this as an equitable sacrifice.”\n\nIllinois AFL-CIO President Tim Drea said, “Illinoisans deserve better and want a sustainable solution — not one that kicks the can down the road and sets our state up for a future fiscal crisis.”\n\nDuPage County Board Chair Deb Conroy said the plan “steals $72 million dollars in DuPage tax revenue, imposes a local real estate transfer tax with no oversight from the county and taxes suburban commuters.”\n\nThere was less pushback against the overall governing structure of the proposed NITA — as in, “need a ride?” — which would set fares, allow for easier transfers and assume capital planning responsibilities.\n\nThe governor, Chicago mayor and Cook County board president would each appoint five members of the 20-person board, with one each named by the board chairs of DuPage, Kane, Lake, McHenry and Will counties.\n\nLawmakers, transit officials, labor leaders and more have been grappling for three years with how to save a transit system still struggling to return to pre-COVID-19 ridership numbers as federal pandemic relief dollars dry up at the end of this year. But persistent service issues and customer dissatisfaction have prompted the mantra of “no funding without reform.”\n\nState Sen. Don DeWitte, R-St. Charles, derided it as a bailout for Chicago and Mayor Brandon Johnson.\n\n“Chicago and Cook County get the majority of the board votes; the suburbs are outvoted on just about everything, fares, service cuts, tax increases,” DeWitte said. “That’s not reform, that’s a takeover.”\n\nVillivalam acknowledged the revenue ideas would need to be amended for any hope of passing a bill by midnight Saturday, when the legislative session concludes.\n\nA separate bill introduced Wednesday by state Rep. Eva-Dina Delgado, D-Chicago, mirrors Villivalam’s measure in terms of establishing the NITA, but doesn’t address funding.\n\nSome legislators told the Sun-Times they’d be OK with approving Delgado’s bill, and then coming back to Springfield later this summer to hammer out the funding. Lawmakers have already been told to be ready to return to the Capitol in the event of surprise federal funding cuts under President Donald Trump’s administration.\n\nBut transit and labor leaders said they need certainty on funding now to avoid massive layoffs and deep service cuts when federal dollars expire at the end of the year.\n\n“There are times where it takes a crisis for us to act,” said Villivalam, who estimated 3,000 transit workers could be laid off this summer without a funding solution.\n\nDemocratic Gov. JB Pritzker hasn’t weighed in on the transit funding options, but said on Wednesday he’s against imposing taxes that are “broad-based and that would have a negative impact on working families” when it comes to the full state budget that lawmakers must approve by Saturday.\n\nBudget negotiations were still inching forward Thursday behind closed doors under the annual statehouse habit of pushing spending talks to the very end of the legislative clock. With two days to go before the end of session, super-majority Democrats had not revealed a full spending proposal.\n\n“We are running every single scenario to make sure that we land in a place that is palatable to all of us,” said state Rep. Kam Buckner, a Chicago Democrat and House budgeteer.","url":"https://chicago.suntimes.com/springfield/2025/05/29/transit-bill-springfield-taxes-tolls","image":"https://cst.brightspotcdn.com/dims4/default/23df266/2147483647/strip/true/crop/3000x1713+0+287/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fbc%2Fe7%2F66941a334c8c9f16d09214a2c5e4%2Fpurp","video":null,"publish_date":"2025-05-30 00:13:26","author":"George Wiebe,Mitchell Armentrout","authors":["George Wiebe","Mitchell Armentrout"],"language":"en","source_country":"us","sentiment":-0.248},{"id":326292396,"title":"Trump news at a glance: tariffs reinstated, for now, after rollercoaster of court decisions","text":"President Trump’s tariffs remain in place, at least for now, after an appeals court ruled that his administration can continue to collect import fees.\n\nThe latest ruling came just a day after a separate court ruled that Trump had overstepped his power, a judgment that his administration has pushed back against.\n\nWhite House spokesperson Karoline Leavitt said on Thursday that America cannot function when diplomatic or trade negotiations are “railroaded by activist judges”.\n\nHere are the key stories at a glance:\n\nTrump wins breathing space after major blow to tariff policy\n\nThe Trump administration is racing to halt a major blow to the president’s sweeping tariffs after a US court ruled they “exceed any authority granted to the president.”\n\nA US trade court ruled the US president’s tariffs regime was illegal on Wednesday in a dramatic twist that could block Trump’s controversial global trade policy.\n\nOn Thursday, an appeals court agreed to a temporary pause in the decision pending an appeal hearing. The Trump administration is expected to take the case to the supreme court if it loses.\n\nTrump allies rail against court’s tariff ruling\n\nRepublicans and close allies of Donald Trump are railing against a federal judicial panel that blocked a wide swath of the US president’s tariffs Wednesday night, including those against China.\n\nSome attempted to frame the decision as part of a broader fight between the Trump administration and US justice system. Trump has frequently complained about legal decisions that don’t go his way, attacking judges on social media in ways that have alarmed civic society experts.\n\nTariffs derailed by law firm that received money from Trump backers\n\nDonald Trump’s tariff policy was derailed by a libertarian public interest law firm that has received money from some of his richest backers.\n\nThe Liberty Justice Center filed a lawsuit against the US president’s “reciprocal” tariffs on behalf of five small businesses, which it said were harmed by the policy.\n\nPrevious backers of the firm include billionaires Robert Mercer and Richard Uihlein, who were also financial backers of Trump’s presidential campaigns.\n\nChina condemns US decision to revoke student visas\n\nChina has lodged a formal protest over the US declaration that it will “aggressively” revoke the visas of Chinese students, with the foreign ministry saying it had objected to the announcement made a day earlier by Marco Rubio.\n\nFed asserts independence from Trump over interest rates\n\nThe Federal Reserve issued a rare, strongly worded statement on Thursday after chair Jerome Powell spoke with Donald Trump at the White House on Thursday morning, holding firm on the central bank’s independence amid pressure from Trump to lower interest rates.\n\nThe three-paragraph statement emphasized the Fed’s independent, non-partisan role in setting monetary policy based on economic data.\n\n“Chair Powell did not discuss his expectations for monetary policy, except to stress that the path of policy will depend entirely on incoming economic information and what that means for the outlook,” the statement read.\n\nTrump violating right to life with anti-environment orders, youth lawsuit says\n\nTwenty two young Americans have filed a new lawsuit against the Trump administration over its anti-environment executive orders. By intentionally boosting oil and gas production and stymying carbon-free energy, federal officials are violating their constitutional rights to life and liberty, alleges the lawsuit, filed on Thursday.\n\nImmigration agents get quota to arrest 3,000 people a day\n\nThe Trump administration has set aggressive new goals in its anti-immigration agenda, demanding that federal agents arrest 3,000 people a day – or more than a million in a year.\n\nThe new target, tripling arrest figures from earlier this year, was delivered to Immigration and Customs Enforcement (Ice) leaders by Stephen Miller, the White House deputy chief of staff, and Kristi Noem, the Department of Homeland Security (DHS) secretary, in a strained meeting last week.\n\nWhat else happened today:\n\nRobert F Kennedy Jr’s flagship health commission report contains citations to studies that do not exist, according to an investigation by the US publication Notus.Top House Democrat Jamie Raskin has demanded Donald Trump reveal a list of who attended his private dinner last week for major investors in his meme coin, as questions swirl about the deep and secretive connections between the Trump administration and the cryptocurrency industry.\n\nCatching up? Here’s what happened on 28 May 2025.","url":"https://uk.news.yahoo.com/trump-news-glance-tariffs-reinstated-001301739.html","image":"https://media.zenfs.com/en/theguardian_763/deb8d730ac40a6d14a540b5455f067d9","video":null,"publish_date":"2025-05-30 00:13:01","author":null,"language":"en","source_country":"gb","sentiment":0.007},{"id":326285592,"title":"Alex Brummer: At last, the global economy can breathe a sigh of relief now the US trade court has blocked Donald Trump's much-touted tariffs. But the White House bloodbath has just begun","text":"Back in April, I was in Washington for the prestigious World Bank Group/IMF Spring Meetings and attended a basketball game with an old friend.\n\nHe runs one of America's most prominent lobbying and communications groups. Like many of his countrymen, he was deeply worried about how Donald Trump's tariffs on world trade had been wreaking havoc since being imposed on so-called 'Liberation Day' that month.\n\nHe confidently told me that, sooner or later, federal courts would strike down the President's punitive levies on foreign imports. If Trump wanted to push through his radical economic upheaval, he would have to pass legislation through Congress.\n\nThe question on everyone's lips wasn't if the judiciary would act – but when. Now we know. Late on Wednesday, the US Court of International Trade blocked Trump's sweeping tariffs, ruling that he had overstepped his authority with his audacious use of emergency powers to force them through.\n\nThen, last night the tariffs were reinstated by the federal appeals court – for now. But this will do little to calm nerves.\n\nFor weeks since April 2, volatility has whipsawed the world's financial systems, sounding alarm bells for US businesses.\n\nFirst, the President imposed swingeing duties on Canada, Mexico and China in part over their perceived failure to halt illegal immigration and smuggling of the drug fentanyl. Then he unveiled brutal 'reciprocal' tariffs on virtually every other trading partner – from the almost uninhabited Marshall Islands in the Pacific to Britain and the EU.\n\nFollowing this week's sensational court rulings, the markets have been offered some much-needed relief. But business leaders remain paralysed by uncertainty and confusion, unsure of what will happen next.\n\nThe grim truth is that the trade war is far from over and the chaos is certain to continue – or worsen.\n\nThe White House has already pledged to appeal the court's decision, taking aim at 'unelected judges [deciding] how to properly address a national emergency'. The panic in the administration is palpable as a once-resilient economy risks being plunged into fresh crisis. The bloated budget deficit and soaring national debt recently provoked leading agencies to downgrade America's 'AAA' credit score – the highest possible – to 'AA1' last week.\n\nThe dollar is plummeting on foreign exchange markets and the Treasury bond market risks a Liz Truss-style meltdown.\n\nSo what happens next?\n\nTrump billed his tariffs as the US's economic salvation. They were meant to raise $600 billion a year, helping to pay for his 'big, beautiful' tax-cut bill passed by Congress a week ago. Now the courts have blown a hole into his rosy forecasts – and the only certainty is that Trump will throw a grenade right back.\n\nHe may have won a temporary reprieve with the tariffs being reinstated on appeal last night, but if that ruling is later successfully challenged, America could face a fresh constitutional crisis as a President careless of the rule of law seeks ever-more autocratic powers to effect his goals.\n\nHalting the tariffs may not bring about the certainty markets crave. Instead, it could presage a further bloodbath in asset prices – and a new firestorm in the White House.","summary":"For weeks since April 2, volatility has whipsawed the world's financial systems, sounding alarm bells for US businesses.","url":"https://www.dailymail.co.uk/money/article-14762663/Alex-Brummer-trade-US-tariffs-White-House-bloodbath.html","image":"https://i.dailymail.co.uk/1s/2025/05/29/20/98874319-0-image-a-23_1748545714971.jpg","video":null,"publish_date":"2025-05-30 00:10:47","author":"Alex Brummer,Editor","authors":["Alex Brummer","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.213},{"id":326290852,"title":"Todd Chrisley smiles in first public outing since Trump pardon","text":"Todd Chrisley looked happy as he went on his first public outing on Thursday following his release from prison. The 56-year-old was seen heading into a Nordstrom in Nashville with his family, including his daughter, Savannah, who had fought for her parents' release. The \"Chrisley Knows Best\" star, along with his wife Julie, received a full pardon from President Donald Trump this week following their 2022 conviction on fraud and tax evasion charges. Trump announced the pardon on Tuesday.","summary":"After a pardon from President Trump, Todd Chrisley stepped out in Nashville post-prison release, following his conviction for fraud and tax evasion.","url":"https://www.foxnews.com/entertainment/todd-chrisley-smiles-first-public-outing-since-trump-pardon","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/todd-chrisley-knows-best-pardoned-trump_005.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-30 00:10:30","author":"Brie Stimson","authors":["Brie Stimson"],"language":"en","category":"politics","source_country":"us","sentiment":0.489},{"id":326292402,"title":"Top DOGE officials are already fleeing as Musk leaves government","text":"Top officials at the Department of Government Efficiency are set to leave their roles following the departure of DOGE head Elon Musk.\n\nThree officials – adviser Steve Davis, adviser and spokesperson Katie Miller, and attorney James Burnham – are leaving the administration, a White House official told The Hill. \n\nDavis served in a leadership role at DOGE and has worked with Musk at several of his companies, including the Boring Company, SpaceX, and X, the social media platform formerly known as Twitter.\n\nServing as DOGE’s “chief operating officer,” Davis spoke to Fox News in March, calling the work an “inspiring mission” that was “worth doing.”\n\nDavis also appeared at a briefing alongside Musk at the White House with a small group of reporters, when Musk spoke about DOGE’s work and its future. \n\nMiller is the wife of Deputy Chief of Staff for Policy Stephen Miller and was also part of the first Trump administration. She was named to the DOGE advisory board in December.\n\nBurnham was DOGE’s general counsel. He’s also the president and founder of Vallecity Capital LLC and earlier served as a Supreme Court clerk for Justice Neil Gorsuch.\n\nOn Wednesday night, Musk took to X to share his gratitude to President Donald Trump.\n\n“As my scheduled time as a Special Government Employee comes to an end, I would like to thank President @realDonaldTrump for the opportunity to reduce wasteful spending,” he said. “The @DOGE mission will only strengthen over time as it becomes a way of life throughout the government.”\n\nYet Musk earlier this week courted controversy as he slammed the large spending package put forward by Trump and congressional Republicans, which passed the House last week, and is currently expected to massively balloon the debt to $4 trillion even amid huge cuts in public services.\n\n“I was, like, disappointed to see the massive spending bill, frankly, which increases the budget deficit, not just decrease it, and undermines the work that the DOGE team is doing,” the billionaire told CBS.\n\nBoth Musk and the other top officials at DOGE were limited by a 130-day restriction on their status as Special Government Employees. Musk has said that he will return full-time to his companies.\n\nMusk is stepping down just after a former DOGE associate has said that he was removed after an interview in which he spoke about his work was published earlier this month.\n\nEngineer and tech startup founder Sahil Lavingia wrote in a personal blog post that he “got the boot” from DOGE the day after Fast Company published an interview with him. In the interview, he discussed finding fewer inefficiencies than he had expected. He was assigned as the senior adviser to the chief of staff at the Department of Veterans Affairs, Government Executive noted. \n\n“I would say the culture shock is mostly a lot of meetings, not a lot of decisions,” Lavingia told Fast Company. The outlet noted that Lavingia noticed that there were plenty of mission-driven people working in the government.\n\n“But honestly, it’s kind of fine — because the government works. It’s not as inefficient as I was expecting, to be honest. I was hoping for more easy wins,” he said.\n\nFiscal conservatives, meanwhile, are frustrated that the spending cuts put forward by DOGE aren’t being codified, and worried about Trump’s spending plan boosting expenditures.\n\n“To see Republicans in Congress cast aside any meaningful spending reductions ... is demoralizing and represents a betrayal of the voters who elected them,” Florida Governor Ron DeSantis wrote on X.\n\nRepublican Georgia Rep. Marjorie Taylor Greene wrote on Wednesday: “Personally I want to pass DOGE cuts every single week until the bloated out of control government is reigned back in. As a country, we cannot survive our national debt and honestly, we may be past the point of return. We should be aggressively attacking our debt and aggressively, cutting all waste fraud, and abuse and unnecessary programs.”","url":"https://uk.news.yahoo.com/top-doge-officials-already-fleeing-001023339.html","image":"https://media.zenfs.com/en/the_independent_577/f8972d53dfc1baa88388b2614d02a628","video":"","publish_date":"2025-05-30 00:10:23","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.085},{"id":326290860,"title":"California families of girl athletes speak out as state changes championship rules amid transgender drama","text":"EXCLUSIVE: The California high school track and field state championship is shaping up to be one of the most unprecedented high school sports events in recent history. Amid a national controversy involving a trans athlete competing in the girls' category, the California Interscholastic Federation (CIF) announced a series of sweeping rule changes in the days leading up to the event to accommodate female competitors. But now multiple families of girls who have already been displaced by a trans athlete at previous meets have spoken out against the federation, expressing dissatisfaction with the changes. On Tuesday, the CIF announced it would expand the size of the championship competition pool and inviting \"biological female\" athletes who missed out on making the title meet by one spot due to a trans athlete finishing ahead of them in last week's qualifying round. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Then on Wednesday, the federation announced it would also recognize female athletes on the medal podium if a girl who misses out on a medal finish does so because they came behind a trans athlete. Crean Lutheran track and field star Reese Hogan finished in second place to trans athlete AB Hernandez of Jurupa Valley High School in the triple jump at the Southern Sectional final on May 17. Then, on the medal podium, after Hernandez stepped off, Hogan stepped up to the first-place spot for a photo-op to a roaring applause. The stunt went viral as Hogan was praised by women's sports rights activists as a heroine. But CIF's latest rule changes won't be giving Hogan the first-place medal for that event. Hogan's family provided a statement from her to Fox News Digital that read, \"The recent CIF rule changes clearly acknowledge a misstep on their part. However, what they've proposed falls short of what we truly need for all girls across all sports. I placed second in CIF, and I know that if I hadn't been competing against a boy, I would have claimed the top spot on the podium.\" \"Unfortunately, we can't revisit that moment to rectify this injustice. This issue transcends a single meet, sport, or individual; it’s fundamentally about the rights of all females to compete fairly among themselves. We deserve that opportunity, and we will continue to advocate for it.\" Hogan has previously told Fox News Digital she finds the situation involving Hernandez \"sad.\" \"It's just kind of sad just watching. He's obviously a really talented athlete, we've all seen him jump and stuff, and I wish him the best of luck, but in a boys' division,\" Hogan previously told Fox News Digital about competing against the athlete. \"It's pretty obvious the certain advantages that he has, and it's obviously just sad as a woman to watch that.\" Meanwhile, the family of Hogan's Crean Lutheran teammate, Olivia Viola, also isn't satisfied with the rule changes. \"While we are grateful that a few female athletes will regain their ability to compete at states and females will earn their rightful titles at this weekends competition, unfortunately CIFs trial program doesn’t actually fix anything. Women are still being forced to compete against biological males. The title IX civil rights of our daughters, sisters, friends and teammates are still being violated,\" Viola's family said in a statement to Fox News Digital. \"Unfortunately, with each step our state leaders take, comes the realization that California really has no intention of protecting our girls in the ways that are necessary. The pilot program essentially admits that allowing biological males to compete in the female category was a mistake. Now it’s time for full course correction. There is a fundamental truth here that must be upheld. Separating competitive athletics into two XX-XY gender categories must be a non-negotiable.\" TEEN GIRLS OPEN UP ON TRANS-ATHLETE SCANDAL THAT TURNED THEIR HIGH SCHOOL INTO CULTURE WAR BATTLEGROUND President Donald Trump weighed in on the situation when he sent a Truth Social post on Tuesday morning, warning the state and Gov. Gavin Newsom of potential funding cuts and orders to local authorities to prevent a trans athlete from competing in the girls' category on Saturday. The first rule change came just hours after Trump's post. The Department of Justice announced it would launch an investigation into the CIF and California Attorney General Rob Bonta over the state's law that allows biologically male trans athletes to compete with girls and women on Wednesday. The second rule change took place shortly after that announcement. On Tuesday, the family of another girls' track star who has been displaced by Hernandez in the track and field postseason, Katie McGuinness of La Canada High School, told Fox News Digital they are grateful for Trump's intervention. \"We are grateful that President Trump is fighting for female athletes and giving them a fair shot to compete on a level playing field. CIF's ‘solution’ to this situation, which allows additional girls to compete at the state championship who otherwise didn't qualify because the transgender athlete took their spot, isn't good enough – it's still an unfair competition and an injustice to the girls competing,\" the family said in a statement. \"Allowing biological males to compete in women’s sports is unfair, unjust and defies common sense,\" the family added. CLICK HERE TO GET THE FOX NEWS APP Katie previously spoke out against CIF for allowing the situation to get this far in an interview on Fox News' \"America Reports\" last week. \"I have nothing against this athlete as a person, and I have nothing against the trans community,\" McGuinness said. \"My message today is really specifically to CIF and for them to act quickly and in a timely manner because this is a really time-sensitive issue.\" Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Families of California girls&apos; high school track athletes have spoken out against the CIF for its recent rule changes amid an ongoing trans athlete controversy.","url":"https://www.foxnews.com/sports/california-families-girl-athletes-speak-out-state-changes-championship-amid-rules-transgender-drama","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/gettyimages-2217150636.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-30 00:09:13","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":0.002},{"id":326291674,"title":"Top EU and Chinese semiconductor manufacturers meet in Beijing","text":"More than 40 representatives from Chinese and European Union (EU) semiconductor enterprises met in Beijing on Tuesday, along with representatives from China’s Ministry of Commerce (Mofcom), the China Semiconductor Industry Association, and the European Union Chamber of Commerce.\n\nThe aim was to deepen collaboration between the two regions across the semiconductor supply chain, strengthening its resilience in the face of the US’s ever-increasing tech restrictions on China, the South China Morning Post reports.\n\nIn recent days, Washington has suspended the sale of even more technologies to China – including those related to semiconductors, Reuters reported. These are just the latest in a long series of restrictive policies limiting China’s access to equipment and materials that would advance its AI sector.\n\nIn a statement issued on Tuesday, Mofcom noted that “the security and stability of the global semiconductor production and supply chain are facing serious challenges.” It also said that Beijing “resolutely [rejected] unilateralism and bullying practices” – a reference to the policies of US President Donald Trump.\n\n[See more: China now leads the world in semiconductor research, a new report says]\n\nAccording to Mofcom, attendees at Tuesday’s meeting – which was hosted by the central government – pledged to safeguard the security and stability of the global semiconductor supply chain, and agreed that more cooperation between China and Europe would benefit both sides.\n\nThe meeting took place two weeks after the US government agreed to back down from its tariff war on China by substantially reducing the sky-high tariffs it had imposed on Chinese imports for a period of 90 days. Beijing then agreed to lower the tariffs that it had imposed on US goods in response to Washington’s levies.\n\nHowever, the New York Times described tensions between the two countries as having shifted towards “supply chain warfare” – with the US imposing more tech curbs and China protectively restricting US access to certain critical minerals.","summary":"Tuesday’s meeting aimed to increase Sino-European cooperation across the global semiconductor supply chain as the US ramped up its tech curbs on China\n\n\nThe post Top EU and Chinese semiconductor manufacturers meet in Beijing appeared first on Macao News.","url":"https://macaonews.org/news/greater-china/china-eu-semiconductors/","image":"https://macaonews.org/wp-content/uploads/2025/05/EU-China-Semiconductor.jpg","video":null,"publish_date":"2025-05-30 00:08:25","author":"Staff Reporter","authors":["Staff Reporter"],"language":"en","source_country":"mo","sentiment":0.235},{"id":326292398,"title":"Ukraine awaits Russia's truce terms, talks 'barely' alive","text":"A senior UN official on Thursday said there was little hope that the negotiations between Russia and Ukraine would produce a deal to halt fighting between the two sides.\n\n\"The massive wave of attacks over the weekend is a stark warning of how quickly this war can reach new destructive levels. Further escalation would not only aggravate the devastating toll on civilians but also endanger the already challenging peace efforts,\" UN Under-Secretary-General for Political Affairs Rosemary DiCarlo told the Security Council on Thursday.\n\n\"According to Ukrainian officials, with 355 drones, Monday's attack was the largest drone attack on Ukraine since the start of Russia's full-scale invasion,\" she said, adding: \"This topped the previous record from the night before.\"\n\nThe UN official noted that the \"cautious hope\" she expressed a month ago has diminished in the face of recent developments.\n\n\"The hope that the parties will be able to sit down and negotiate is still alive, but just barely,\" she added.\n\nTalks and ceasefire demands\n\nBut both sides failed to reach an agreement on a ceasefire.\n\nMoscow, which said it is impossible to achieve a truce before certain conditions are met, suggested a second round of direct talks take place on Monday.\n\nThe Kremlin said Thursday that it was awaiting Kyiv's response to its proposal for holding a fresh round of talks.\n\nRussian Foreign Minister Sergei Lavrov said this week that Moscow had drafted a memorandum outlining its terms for settling the Ukraine war.\n\nBut Ukraine said Moscow has not yet shared its proposal.\n\nAfter the May 16 talks, Kyiv accused Russia of outlining unrealistic demands, including calls to cede territory that is still under Ukrainian control.\n\nRussia launched its full-scale invasion of Ukraine in February 2022.\n\nThe war has resulted in tens of thousands of deaths and the destruction of large parts of eastern and southern Ukraine.\n\nRussian forces have moved forward on the battlefield while pushing peace demands that include Ukraine abandoning its NATO ambitions and giving up around a fifth of its land.\n\nZelenskyy says Russia engaging in 'yet another deception'\n\nUkrainian President Volodymyr Zelenskyy on Thursday slammed Russia, saying that it was engaging in \"yet another deception\" by failing to hand over its peace settlement proposal ahead of a potential meeting between Moscow and Kyiv.\n\n\"Even the so-called 'memorandum' they promised and seemingly prepared for more than a week has still not been seen by anyone,\" Zelenskyy said in his nightly video address.\n\n\"Ukraine has not received it. Our partners have not received it. Even Turkey, which hosted the first meeting, has not received the new agenda,\" he added. \"Despite promises to the contrary, first and foremost to the United States of America, to President (Donald) Trump: Yet another Russian deception.\"\n\nZelenskyy urged Ukraine's allies to intensify pressure on Moscow.\n\nWhat did the US say?\n\nTurkish President Recep Tayyip Erdogan told reporters that Russia's invitation for more talks had heightened Ankara's hopes for peace.\n\nErdogan, who is hosting the talks, has maintained good ties with both sides.\n\n\"The road to a resolution goes through more dialogue, more diplomacy. We are using all our diplomatic power and potential for peace,\" Erdogan's office quoted him as saying.\n\nThe United States, meanwhile, said prolonging the war was not in anyone's best interest and that its proposal for a ceasefire in Ukraine was \"Russia's best possible outcome\" and President Vladimir Putin should take the deal.\n\n\"We want to work with Russia, including on this peace initiative and an economic package. There is no military solution to this conflict,\" Acting Deputy US Ambassador John Kelley told the UN Security Council.\n\n\"The deal on offer now is Russia's best possible outcome. President Putin should take the deal,\" he added.\n\n\"If Russia makes the wrong decision to continue this catastrophic war, the United States will have to consider stepping back from our negotiation efforts to end this conflict,\" Kelley stressed. \"Additional sanctions on Russia are still on the table.\"\n\nEdited by: Sean Sinico","url":"https://uk.news.yahoo.com/ukraine-awaits-russias-truce-terms-000300070.html","image":"https://s.yimg.com/ny/api/res/1.2/fnqf331Z2hT_nCUbJdCHDA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/deutsche_welle_articles_124/ac49a31686647d80fba242531935f16e","video":null,"publish_date":"2025-05-30 00:03:00","author":"Srinivas Mazumdaru with Afp, Reuters","authors":["Srinivas Mazumdaru with Afp, Reuters"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.354},{"id":326288038,"title":"iPhone exports to US trump last year numbers by 76%","text":"Apple’s vendors shipped 2.9 million iPhones to the United States from India in April, according to market research firm Omdia, a 76% surge year-on-year, as the American tech firm persisted with its plan to meet domestic demand from the South Asian nation despite President Donald Trump’s mounting pressure to switch to manufacturing locally. Similar numbers are expected in May, following the company’s move to shift production out of China to reduce its overreliance on a single production base. In April, China suffered a commensurate 76% fall in iPhone exports to the US, at 900,000 units, from 3.7 million a year ago, Omdia said. Market tracker Counterpoint Research said its initial estimates peg iPhone exports from India to the US in April to be around 2.9-3 million. The April numbers were, however, lower than in March, when the Cupertino-based company raced to meet the April 2 deadline when the US imposed steep retaliatory tariffs on countries with which it had a trade deficit, with China the hardest hit. Industry executives said that Apple’s shift toward India was accelerating and that the lower export volume in April was in line with the weak shipments usually seen in the April-June period, ahead of the launch of new models in the September quarter. 121498176Tariff ThreatApple has to contend with President Trump’s threat this week of imposing a 25% tariff on iPhones sold in the US that are not made locally. However, producing iPhones in the US is likely to increase sticker prices substantially, with some experts estimating the Pro models to cost well over $3,000 apiece, from $1,119 now, on account of higher labour cost and complex logistics in sourcing the necessary components. “In terms of profitability, it’s way better for Apple to take the hit of a 25% tariff on iPhones sold in the US market than to move iPhone assembly lines back to the US,” said Ming-Chi Kuo, Apple analyst at TF Securities, Hong Kong.CAPACITY EXPANSION Last week, Apple’s manufacturing partner Foxconn (Hon Hai) announced a fresh $1.5 billion investment in expanding its Chennai facility in a bid to strengthen capacity. The manufacturer has also constructed a new facility in Karnataka which will start shipping iPhones from June. Similarly, Tata Electronics, the company’s second largest vendor for making iPhones in India, is expanding capacity at its Hosur facility for both enclosures and full-scale iPhone assembly. It has also acquired the majority stake in Pegatron’s facility, which is Apple’s third supplier in India. Some say India’s manufacturing capacity is unlikely to scale up fast enough to fully meet the US demand for Apple.According to Omdia, the US market requires about 20 million iPhones per quarter, but India is expected to meet only about 80% of that demand by 2026.PARTIAL SHIFT LIKELYIn the first quarter of 2025, India accounted for 21% of global iPhone shipments, with projections suggesting an increase in its share to 25-26% by the end of the year. The constraint India faces is not technical, but that of scale, as per analysts. With Apple now making even the high-end Pro and Pro Max models in India, much of the workforce training is complete, said Omdia.“A full transition of US-bound iPhone production to India within a year remains unlikely. A partial shift is more feasible, though it still requires substantial investment in infrastructure and continued reliance on China for key components,” said Sanyam Chaurasia, analyst at Canalys (now part of Omdia). Apple is navigating a complex balancing act among its three most critical markets — China, US and India – not just as customer bases, but as an integral part of its global supply and production network, experts said. “China remains deeply entrenched in Apple’s manufacturing ecosystem, home to over 200 key suppliers. Shifting assembly to the US is not a logical move. It would mean attempting to relocate a tightly interwoven supply chain,” said Chaurasia. Meanwhile, India has rapidly evolved from a secondary hub to a central pillar of global tech manufacturing, underscored by the sharp increase in iPhone exports from India, he said.","summary":"Apple significantly increased iPhone exports from India to the US, surging 76% year-on-year in April, while exports from China sharply declined. This shift reflects Apple's strategy to diversify production amid trade tensions and reduce reliance on China. Despite potential tariffs, manufacturing in the US remains less profitable for Apple, leading to continued investment in Indian production capacity.","url":"https://economictimes.indiatimes.com/news/international/business/iphone-exports-to-us-trump-last-year-numbers-by-76/articleshow/121498158.cms","image":"https://img.etimg.com/thumb/msid-121498203,resizemode-4,width-1200,height-900,imgsize-37022,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-30 00:00:00","author":"Subhrojit Mallick","authors":["Subhrojit Mallick"],"language":"en","category":"politics","source_country":"in","sentiment":-0.404},{"id":326289058,"title":"'It's raining tacos': Gavin Newsom joins in on mocking Trump with viral nickname","text":"Democratic governors and attorneys general quickly embraced Thursday’s two court decisions against President Donald Trump's sweeping global tariffs as validation of their concerns over the economic impact of escalating prices on everyday goods, Politico reported Thursday. \n\nOn Wednesday, the U.S. Court of International Trade in New York invalidated Trump’s tariffs, ruling that he lacked the legal authority under the emergency economic powers he referenced when issuing four executive orders earlier this year. \n\nThis decision dealt a significant setback to Trump’s broader strategy of using tariffs as a bargaining tool in international trade negotiations. The following morning, a second federal court — this time a D.C. District Court — delivered a similar verdict, ordering the suspension of tariff collections in a case brought by two toy companies. The tariffs are temporarily back in place after a Thursday ruling by the D.C. Court of Appeals, which issued a stay while litigation plays out.\n\nREAD MORE: 'Self-involved and utterly humorless': Inside Vance's 'quest to inherit MAGA' from Trump \n\nCalifornia Gov. Gavin Newsom (D), whose state was one of over 14 that filed lawsuits challenging the tariffs, was particularly pleased. \n\nDuring a MeidasTouch podcast Thursday, he said: “It’s raining tacos today,\" seemingly alluding to the TACO acronym coined by Wall Street investors to describe the volatility surrounding Trump’s shifting tariff policies. \n\nThe term — short for “Trump always chickens out” — has reportedly irritated the president.\n\n\"Mr. President,\" a reporter said, \"Wall Street analysts have coined a new term called the 'Taco Trade.' They're saying Trump always chickens out on your tariff threats, and that's why markets are higher this week. What's your response to that?\"\n\nREAD MORE: Top Trump policy is now 'dust' because he's 'terrible at getting things done': analysis \n\nIn response to the question, Trump explained his China policy and then proceeded to attack the reporter over the question.\n\n\"Don't ever say what you said. That's a nasty question,\" the president said. \n\n\"For me, that's the nastiest question.\"\n\nColorado Governor Jared Polis (D) also expressed great satisfaction. Speaking to Politico, he emphasized that among the various legal challenges Democrats have launched against Trump’s actions, the dispute over tariffs is “the most substantial for our economy, for our prosperity.”\n\nMeanwhile, the U.S. Court of Appeals for the Federal Circuit issued an emergency order Thursday afternoon pausing a decision made just a day earlier by the U.S. Court of International Trade.\n\nThe decision does not block the order for the entire appeal, which is why the Democrats are hopeful that Trump will remain unable to implement the tariff policy.","summary":"Democratic governors and attorneys general quickly embraced Thursday’s two court decisions against President Donald Trump's sweeping global tariffs as validation of their concerns over the economic impact of escalating prices on everyday goods, Politico reported Thursday. \n\nOn Wednesday, the U.S. Court of International Trade in New York invalidated Trump’s tariffs, ruling that he lacked the legal authority under the emergency economic powers he referenced when issuing four executive orders earlier this year. \n\nThis decision dealt a significant setback to Trump’s broader strategy of using tariffs as a bargaining tool in international trade negotiations. The following morning, a second federal court — this time a D.C. District Court — delivered a similar verdict, ordering the suspension of tariff collections in a case brought by two toy companies. The tariffs are temporarily back in place after a Thursday ruling by the D.C. Court of Appeals, which issued a stay while litigation plays out.\n\nREAD MORE: 'Self-invo","url":"https://www.alternet.org/trump-newsom-economy/","image":"https://www.alternet.org/media-library/image.jpg?id=60342018&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-05-29 23:59:29","author":"Ailia Zehra","authors":["Ailia Zehra"],"language":"en","category":"politics","source_country":"us","sentiment":-0.334},{"id":326288876,"title":"Man 'threatened to shoot Donald Trump in the head' after President deported his family","text":"A man has been arrested after he reportedly threatened to assassinate President Donald Trump as retribution for his family's deportation. The suspect, identified as 54 year old Mexican national Ramon Morales Reyes, is said to have penned a letter to an ICE officer on Wednesday May 21. In the alarming letter, Reyes allegedly vowed to \"self-deport\" following his plan to shoot President Trump \"in the head\" during one of his public gatherings, according to officials. Reyes is currently being held in ICE detention at a Wisconsin jail, awaiting the outcome of his removal proceedings, as per the Department of Homeland Security (DHS). READ MORE: Man arrested more than three decades after mum's sudden disappearance The handwritten letter contained the words: \"We are tired of this president messing with us Mexicans. We have done more for this country than you white people.\" It went on to say: \"You have been deporting my family, and I think it is time Donald J. Trump gets what he has coming to him.\" Furthermore, Reyes purportedly declared his intention to \"self-deport\" back to Mexico. In the letter he went on to say: \"But not before I use my 30-yard 6 to shoot your precious president in the head.\" Kristi Noem, the U.S. Secretary of Homeland Security, condemned the threats and called for the media and politicians to moderate their language in light of \"repeated attempts on President Trump's life.\" Noem praised the ICE officers for their role in apprehending the \"Thanks to our ICE officers, this illegal alien who threatened to assassinate President Trump is behind bars,\"reports the Mirror US . \"This threat comes not even a year after President Trump was shot in Butler, Pennsylvania, and less than two weeks after former FBI Director Comey called for the President's assassination...I will continue to take all measures necessary to ensure the protection of President Trump.\" DHS revealed that Reyes had a criminal history and had illegally entered the U.S. on multiple occasions over several years. \"His criminal record includes arrests for felony hit and run, criminal damage to property, and disorderly conduct with a domestic abuse modifier,\" DHS stated. It comes after Trump was prevented from imposing sweeping tariffs on imports by the federal trade court yesterday. The court has enforced an emergency-powers law after at least seven lawsuits argued the US President, 78, has exceeded his authority. They claimed Mr Trump has left the US trade policy dependent on his whims and unleashed economic chaos with his gung-ho tariffs. And the ruling from a three-judge panel at the Court of International Trade in New York City reads: \"The Worldwide and Retaliatory Tariff Orders exceed any authority granted to the President by IEEPA to regulate importation by means of tariffs.\"","summary":"Ramon Morales Reyes, 54, was arrested after he allegedly sent a letter to the U.S. government in which he threatened to assassinate President Donald Trump for deporting his family","url":"https://www.mirror.co.uk/news/us-news/man-threatened-shoot-donald-trump-35309329","image":"https://i2-prod.mirror.co.uk/article35309333.ece/ALTERNATES/s1200b/2_Trump-Tariffs-Court-25149679563599.jpg","video":null,"publish_date":"2025-05-29 23:53:40","author":"Housnia Shams,Paige Ingram","authors":["Housnia Shams","Paige Ingram"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.368},{"id":326285128,"title":"Federal appellate court temporarily reinstates tariffs","text":"May 29 (UPI) -- The U.S. Court of Appeals for the Federal Circuit on Thursday temporarily reinstated President Donald Trump's tariffs while the court sorts out arguments over their legality.\n\nThe appellate court temporarily granted the Trump administration's stay motion, which reinstated the tariffs in a four-page ruling made Thursday afternoon.\n\nAttorneys with the Department of Justice argued the stay is needed to prevent \"immediate irreparable harm to United States foreign policy and national security,\" ABC News reported.\n\n\"It is critical for the country's national security and the president's conduct of ongoing, delicate diplomatic efforts that the court stay its judgment,\" the DOJ filing says.\n\n\"The harm to the conduct of foreign affairs from the relief ordered by the court could not be greater,\" the attorneys argued.\n\nTariffs give the president leverage while negotiating trade agreements with other nations, the DOJ said.\n\nEliminating the tariffs would endanger existing trade deals and make the nation vulnerable to nations whose leaders would be emboldened by the court order, the DOJ argued.\n\n\"It is not for unelected judges to decide how to properly address a national emergency,\" White House spokesman Kush Desai told media.\n\nThe Trump administration will use \"every lever of executive power to address this crisis\" of trade deficits with other nations, Desai added.\n\nThe appellate court also granted the administration's motion to combine two separate lawsuits filed by business entities and 12 states that are challenging Trump's ability to impose tariffs without congressional approval.\n\nThe stay temporarily blocks an earlier ruling by the U.S. Court of International Trade, which ruled against theTrump administration and permanently enjoined \"certain executive orders imposing various tariffs.\"\n\nThe Washington, D.C.-based appellate court ordered all parties in the combined case to respond to the Trump administration's stay motion no later than June 5.\n\nThe Trump administration also has until June 9 to respond to the motion to combine the two federal cases.\n\nA three-judge panel in the New York-based federal Court of International Trade on Wednesday ruled the Trump administration's tariffs were \"contrary to law\" and ended them.\n\nThe judges said the International Emergency Economic Powers Act does not grant unlimited powers to the president to impose tariffs.\n\nTrump announced the tariffs during an April 2 \"Liberation Day\" event at the White House.","summary":"The U.S. Court of Appeals for the Federal Circuit on Thursday temporarily reinstated President Donald Trump's tariffs while the court sorts out arguments over their legality.","url":"https://www.upi.com/Top_News/US/2025/05/29/trump-tariffs-reinstated/2271748561491/","image":"https://cdnph.upi.com/ph/st/th/2271748561491/2025/upi/0f568b9fbeb34739c9bab6b1db11da57/v1.2/Federal-appellate-court-temporarily-reinstates-tariffs.jpg","video":null,"publish_date":"2025-05-29 23:51:16","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"US","sentiment":0.003},{"id":326292178,"title":"Nhật Bản đề xuất tăng mua chip của Mỹ","text":"Bộ trưởng Tài chính Mỹ nêu lợi thế của người đi trước trong đàm phán thương mại \n\n Theo hãng thông tấn Yonhap, Bộ trưởng Tài chính Scott Bessent cho biết Mỹ sẽ tham gia đàm phán thương mại với Hàn Quốc vào tuần tới và nhấn mạnh \"lợi thế của người đi trước\" trong đàm phán với nước này. \n\n Bộ trưởng Tài chính Mỹ Scott Bessent. Ảnh: USA Today/TTXVN \n\n Phát biểu trên của ông Scott Bessent được đưa ra trong bối cảnh nhiều quốc gia đang nỗ lực đạt được thỏa thuận thương mại phù hợp với Mỹ nhằm giảm thiểu tác động của chính sách thuế quan của Tổng thống Donald Trump đối với nền kinh tế của mình. \n\n Trong cuộc phỏng vấn với Bloomberg ngày 14/4, ông Bessent đã đề cập đến các kế hoạch đàm phán sắp tới với Hàn Quốc và Nhật Bản. Đầu tháng này, Tổng thống Trump đã áp đặt thuế quan đối ứng ở mức cao đối với hai đồng minh của mình ở Đông Bắc Á cũng như hàng chục quốc gia khác trên toàn cầu nhưng sau đó đã tạm hoãn áp dụng trong 90 ngày. \n\n \"Chúng tôi đã có Việt Nam vào tuần trước. Chúng tôi có Nhật Bản vào thứ tư ... Hàn Quốc vào tuần tới. Vì vậy, mọi việc sẽ diễn ra nhanh chóng\", ông Bessent thông báo. \n\n Bộ trưởng Tài chính Mỹ nhấn mạnh rằng sẽ có lợi thế cho \"người đi trước\", trong bối cảnh Thủ tướng Nhật Bản Shigeru Ishiba tuyên bố trước Quốc hội vào ngày 14/4 (theo giờ Tokyo) rằng Nhật Bản sẽ không chấp nhận nhượng bộ chỉ để nhanh chóng kết thúc các cuộc đàm phán thuế quan với Mỹ. \n\n \"Tôi nghĩ sẽ có lợi cho các đồng minh của chúng ta, đặc biệt là lợi thế của người đi trước. Thông thường, người đầu tiên đưa ra thỏa thuận sẽ có được thỏa thuận tốt nhất\", ông cho biết. \n\n Khi được hỏi quốc gia nào sẽ là quốc gia đầu tiên đạt được thỏa thuận, ông Bessent trả lời: \"Đó là sự lựa chọn của họ\". \n\n Trả lời câu hỏi liệu có một vài quốc gia mà Bộ trưởng Tài chính Mỹ kỳ vọng sẽ đạt được thỏa thuận trước khi thời hạn 90 ngày tạm dừng áp thuế đối ứng kết thúc hay không, ông cho biết có thể sẽ có nhiều quốc gia. \n\n Ông cũng cho biết đó có thể chưa phải là văn bản thỏa thuận thương mại chính thức, nhưng các bên sẽ đạt được một thỏa thuận về nguyên tắc và có thể tiến bước từ đó. \n\n Những phát biểu của ông Bessent làm dấy lên đồn đoán của giới truyền thông rằng do hạn chế về thời gian và hậu cần, chính quyền Tổng thống Trump có thể sẽ cố gắng đàm phán các thỏa thuận tạm thời hoặc các cam kết bằng văn bản về thương mại công bằng và có đi có lại, vốn không phải là các thỏa thuận thương mại đầy đủ. \n\n Trong khi đó, tờ The Wall Street Journal đưa tin ông Bessent đang ưu tiên Hàn Quốc, Anh, Australia, Ấn Độ và Nhật Bản là những \"mục tiêu hàng đầu\" của ông cho các thỏa thuận thương mại mới. Trích dẫn nguồn tin thân cận, tờ báo này cho biết những quốc gia đó nằm trong danh sách ưu tiên của ông và ông đã liên lạc với các quan chức từ các đối tác thương mại đó. \n\n Trang News.az ngày 13/4 dẫn lời ông Kevin Hassett, người đứng đầu Hội đồng Kinh tế quốc gia Mỹ, số lượng các nước bày tỏ mong muốn đàm phán về thuế quan với Mỹ đã lên tới con số 130 quốc gia.","summary":"Nhật Bản đã đề xuất nhập khẩu sản phẩm bán dẫn của Mỹ với trị giá lên tới 1.000 tỉ yên (6,94 tỉ USD) trong khuôn khổ các cuộc đàm phán thuế quan với Washington, theo tờ Asahi Shimbun ngày 28.5 dẫn nguồn thạo tin.","url":"https://vietgiaitri.com/nhat-ban-de-xuat-tang-mua-chip-cua-my-20250530i7453042/","image":"https://t.vietgiaitri.com/2025/5/10/nhat-ban-de-xuat-tang-mua-chip-cua-my-600x432-5c0-7453042.webp","video":null,"publish_date":"2025-05-29 23:51:06","author":"Trí Đỗ","authors":["Trí Đỗ"],"language":"en","category":"politics","source_country":"vn","sentiment":-1},{"id":326292546,"title":"Chinese students find themselves caught in the US-China crossfire – again","text":"Xiao Chen turned up at the US Consulate in Shanghai on Thursday morning, hours after Washington announced that it would \"aggressively\" revoke the visas of Chinese students.\n\nThe 22-year-old had a visa appointment: she was headed to Michigan in the autumn to study communications.\n\nAfter a \"pleasant\" conversation, she was told her application had been rejected. She was not given a reason.\n\n\"I feel like a drifting duckweed tossed in wind and storm,\" she said, using a common Chinese expression used to describe feeling both uncertain and helpless.\n\nShe had been hopeful because she already had the acceptance letter. And she thought she had narrowly escaped the bombshells in recent days.\n\nFirst, Donald Trump's administration moved to end Harvard University's ability to enrol international students, a move that has since been blocked in court. And then it said it had stopped visa appointments for all foreign students.\n\nBut now, Chen is ready for plan B. \"If I can't get the visa eventually, I'll probably take a gap year. Then I'll wait to see if things will get better next year.\"\n\nA valid visa may still not be enough, she adds, because students with visas could be \"stopped at the airport and deported\".\n\n\"It's bad for every Chinese student. The only difference is how bad.\"\n\nIt has been a bleak week for international students in the US - and perhaps even harder for the 280,000 or so Chinese students who would have noticed that their country has been singled out.\n\nHomeland Security Secretary Kristi Noem accused Harvard of \"coordinating with the Chinese Communist Party\".\n\nSecretary of State Marco Rubio said that the move against Chinese students in the US would include \"those with connections to the Chinese Communist Party or studying in critical fields\".\n\nThat could hit a wide swathe of them, given membership of the Communist Party is common among officials, entrepreneurs, business people and even artists and celebrities in China.\n\nBeijing has called it a \"politically motivated and discriminatory action\", and its foreign ministry has lodged a formal protest.\n\nThere was a time when China sent the highest number of foreign students to American campuses. But those numbers slipped as the relationship between the two countries soured.\n\nA more powerful and increasingly assertive Beijing is now clashing with Washington for supremacy in just about everything, from trade to tech.\n\nTrump's first term had already spelled trouble for Chinese students. He signed an order in 2020 barring Chinese students and researchers with ties to Beijing's military from obtaining US visas.\n\nThat order remained in place during President Joe Biden's term. Washington never clarified what constitutes \"ties\" to the military, so many students had their visas revoked or were turned away at US borders, sometimes without a proper explanation.\n\nOne of them, who did not wish to be named, said his visa was cancelled by Customs and Border Protection (CBP) when he landed in Boston in August 2023.\n\nHe had been accepted into a post-doctoral program at Harvard University. He was going to study regenerative medicine with a focus on breast cancer and had done his master's degree from a military-affiliated research institution in China.\n\nHe said he was not a member of the Communist Party and his research had nothing to do with the military.\n\n\"They asked me what the relationship was between my research and China's defence affairs,\" he told the BBC then. \"I said, how could breast cancer have anything to do with national defence? If you know, please tell me.\"\n\nHe believes he never stood a chance because the officials had already made up their minds. He recalled one of them asking: \"Did Xi Jinping buy your suitcase for you?\"\n\nWhat was surprising, or even shocking then, slowly turned normal as more and more Chinese students struggled to secure visas or admissions to study science and technology in US universities.\n\nMr Cao, a psychology major whose research involves neuroscience, has spent the past school year applying for PhD programs in the US.\n\nHe had graduated from top-tier universities - credentials that could send him to an Ivy League school. But of the more than 10 universities he applied to, only one extended an offer.\n\nTrump's cuts to biomedical research didn't help, but the mistrust surrounding Chinese researchers was also a factor. Allegations and rumours of espionage, especially in sensitive subjects, have loomed over Chinese nationals at US universities in recent years, even derailing some careers.\n\n\"One of the professors even told me, 'We rarely give offers to Chinese students these days, so I cannot give you an interview,\" Mr Cao told the BBC in February.\n\n\"I feel like I am just a grain of sand under the wheel of time. There is nothing I can do.\"\n\nFor those who did graduate from US colleges, returning home to China has not been easy either.\n\nThey used to be lauded as a bridge to the rest of the world. Now, they find that their once-coveted degrees don't draw the same reaction.\n\nChen Jian, who did not want to use his real name, said he quickly realised that his undergraduate degree from a US college had become an obstacle.\n\nWhen he first came back in 2020, he interned at a state-owned bank and asked a supervisor if there was a chance to stay on.\n\nThe supervisor didn't say it outright, but Chen got the message: \"Employees should have local degrees. People like me (with overseas degrees) won't even get a response.\"\n\nHe later realised that \"there really weren't any colleagues with overseas undergraduate background in the department\".\n\nHe returned to the US and earned his master's degree at Johns Hopkins University, and now works at the Chinese tech giant Baidu.\n\nHowever, despite holding a degree from a prestigious American university, Mr Chen does not feel he has an edge due to the stiff competition from Chinese graduates.\n\nWhat also has not helped is the suspicion around foreign graduates. Beijing has ramped up warnings of foreign spies, telling civilians to be on the lookout for suspicious figures.\n\nIn April, prominent Chinese businesswoman Dong Mingzhu told shareholders in a closed-door meeting that her company, home appliance maker Gree Electric, will \"never\" recruit Chinese people educated overseas \"because among them are spies\".\n\n\"I don't know who is and who isn't,\" Ms Dong said, in comments that were leaked and went viral online.\n\nDays later, the CIA released promotional videos encouraging Chinese officials dissatisfied with the government to become spies and provide classified information. \"Your destiny is in your own hands,\" the video said.\n\nThe suspicion of foreigners as the US and China pull further away from each other is a surprising turn for many Chinese people who remember growing up in a very different country.\n\nZhang Ni, who also did not want to use her real name, says she was \"very shocked\" by Ms Dong's remarks.\n\nThe 24-year-old is a recent journalism graduate from Columbia University in New York. She says she \"doesn't care about working at Gree\", but what surprised her was the shift in attitudes.\n\nThat so many Chinese companies \"don't like anything that might be associated with the international\" is a huge contrast from what Ms Zhang grew up with - a childhood \"filled with [conversations centred on] the Olympics and World Expo\".\n\n\"Whenever we saw foreigners, my mom would push me to go talk to them to practice my English,\" she says.\n\nThat willingness to exchange ideas and learn from the outside world appears to be waning in China, according to many.\n\nAnd America, once a place that drew so many young Chinese people, is no longer that welcoming.\n\nLooking back, Ms Zhang can't help but recall a joke her friend made at a farewell dinner before she left for the US.\n\nThen, a flippant comment, it now sums up the fear in both Washington and Beijing: \"Don't become a spy.\"","summary":"Xiao Chen turned up at the US Consulate in Shanghai on Thursday morning, hours after Washington announced that it would \"aggressively\" revoke the visas of Chinese students.","url":"https://www.myjoyonline.com/chinese-students-find-themselves-caught-in-the-us-china-crossfire-again/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/05/image-1542.png","video":null,"publish_date":"2025-05-29 23:48:00","author":"Abubakar Ibrahim,Ms Dong","authors":["Abubakar Ibrahim","Ms Dong"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.45},{"id":326285040,"title":"The State Department is looking to revoke some Chinese student visas. How many in the Bay Area are at risk?","text":"Secretary of State Marco Rubio’s announcement this week that the U.S. will begin revoking the visas of some Chinese university students studying in the U.S. puts at risk the education of some 270,000 foreign scholars across the county and more than 51,000 in California.\n\nStudents from China are the second-most numerous among foreign students studying at U.S. colleges, behind the more than 331,000 from India, making up roughly a quarter of all international higher education students in the country, according to the most-recent available data for the 2023-2024 academic year from the Institute of International Education.\n\nAnd at 36%, Chinese students make up the largest share from overseas studying in California.\n\nThe news that the administration would begin “aggressively” revoking the visas of Chinese students left students in Beijing who lined up outside the U.S. Embassy seeking student visas feeling anxious and helpless.\n\n“What now? Something new every day?” said Li Kunze, 18, who had just successfully applied for a visa to study as an undergraduate. He had not heard the news until he left the embassy. “I don’t even know if they can give me this visa that I just got.”\n\nBecause it was too late to apply elsewhere for his undergraduate years, Li, who plans to study applied mathematics, said he “can only brace myself,” but that “in the future, if I can avoid going to the United States to study, I will.”\n\n“They make people too scared,” Li said.\n\nThe scene outside the embassy in Beijing captured the complicated feelings many Chinese students have toward studying in the United States. Hundreds of thousands still go each year, lured by the promise of a world-class education, and for many, a deep admiration for America’s professed values of openness and diversity. But they must reckon with the fact that many in the United States may not share that admiration.\n\nA spokesperson for China’s foreign ministry said that the United States was “using ideology and national security as an excuse” to harm Chinese students.\n\n“This politically discriminatory practice by the U.S. side exposes the lie of the so-called ‘freedom and openness’ that the U.S. has always advertised,” the spokeswoman, Mao Ning said, adding that China had communicated its displeasure to the Americans.\n\nEven before Rubio’s announcement that the United States would begin revoking student visas, “including those with ties to the Communist Party of China or those studying in critical fields,” Chinese students and their families were uncertain about their prospects for studying in the U.S.. Two days earlier, Rubio had ordered a pause on new interviews for student and exchange visas.\n\nIn 2020, during his first term, President Donald Trump issued a proclamation banning students from certain Chinese universities from graduate study in the United States, saying those universities had ties to China’s military. The parameters of that proclamation, which remains in effect, were vague, but it has been used mostly to deny visas to those in fields such as the physical sciences, engineering and computer science, according to researchers.\n\nBut the effect of the earlier measure was relatively limited, resulting in the revocations or denials of about 3,000 visas between 2020 and 2021, according to U.S. government data.\n\nChinese students were by far the most populous group of international students in the United States until the 2023-24 school year, with many of those students, especially at the graduate level, in STEM fields. Though the number of Chinese students has begun to decline in recent years, amid heightened U.S.-China geopolitical tensions, interest has remained strong.\n\nIndia sent 331,602 international students to pursue higher education in the U.S. in 2023-2024, a 23% increase from the prior year. China sent 277,398 students that year, a 4% decline, but remained the top country for undergraduates, 87,551, and for “non-degree” students, 5,517, who enroll in exchange, post-doctorate and visiting scholar programs.\n\nChina sent 51,131 students to California in 2023-2024, leading the 28,172 from India. 6,761 from South Korea, 5,071 from Taiwan and 3,803 from Canada. The total number of international students in those five countries accounts for more than two-thirds of the total international students in the state.\n\nIn the Fall 2024 term, the University of California enrolled about 17,800 Chinese students, including 3,627 from UC Davis, 3,492 from UC San Diego, 2,925 from UC Irvine, 2,281 from UC Berkeley and 2,208 from UCLA.\n\nThe California State University system had 750 Chinese students, including 136 at San José State, the most in the system, followed by 83 at San Francisco State, 71 at San Diego State, 66 at CSU Northridge and 61 at Cal Poly Pomona.\n\nThe New York Times contributed to this report.","summary":"California has more than 51,000 Chinese students.","url":"https://www.mercurynews.com/2025/05/29/the-state-department-is-looking-to-revoke-some-chinese-student-visas-how-many-in-the-bay-area-are-at-risk/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/AP24002670323030.jpg?w=1024&h=695","video":null,"publish_date":"2025-05-29 23:47:36","author":"Jovi Dai","authors":["Jovi Dai"],"language":"en","category":"politics","source_country":"us","sentiment":-0.206},{"id":326282170,"title":"How the West is helping Russia to fund its war on Ukraine","text":"\"[These countries] know that sanctioning countries are willing to accept this. This is a loophole. It's entirely legal. Everyone's aware of it, but nobody is doing much to actually tackle it in a big way,\" says Vaibhav Raghunandan, an analyst at CREA.\n\nCampaigners and experts argue that Western governments have the tools and means available to stem the flow of oil and gas revenue into the Kremlin's coffers. \n\nAccording to former Russian deputy energy minister Vladimir Milov, who is now a diehard opponent of Vladimir Putin, sanctions imposed on trade in Russian hydrocarbons should be better enforced - particularly the oil price cap adopted by the G7 group of nations, which Mr Milov says \"is not working\".\n\nHe is fearful, though, that the US government shake-up launched by President Donald Trump will hamper agencies such as the US Treasury or the Office of Foreign Assets Control (OFAC), which are key for sanctions enforcement.\n\nAnother avenue is continued pressure on Russia's \"shadow fleet\" of tankers involved in dodging the sanctions.\n\n\"That is a complex surgery operation. You need to periodically release batches of new sanctioned vessels, shell companies, traders, insurers etc. every several weeks,\" Mr Milov says. According to him, this is an area where Western governments have been much more effective, particularly with the introduction of new sanctions by Joe Biden's outgoing administration in January 2025.\n\nMai says that banning Russian LNG exports to Europe and closing the refining loophole in Western jurisdictions would be \"important steps in finishing the decoupling of the West from Russian hydrocarbons\".\n\nAccording to Mr Raghunandan from CREA, it would be relatively easy for the EU to give up Russian LNG imports.\n\n\"Fifty percent of their LNG exports are directed towards the European Union, and only 5% of the EU's total [LNG] gas consumption in 2024 was from Russia. So if the EU decides to completely cut off Russian gas, it's going to hurt Russia way more then it's going to hurt consumers in the European Union,\" he told the BBC.","url":"https://www.bbc.com/news/articles/cdxk454kxz8o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/d3a8/live/d351c870-3bbf-11f0-a3f8-3983078865f2.jpg","video":null,"publish_date":"2025-05-29 23:42:38","author":"Vitaly Shevchenko","authors":["Vitaly Shevchenko"],"language":"en","category":"politics","source_country":"gb","sentiment":0.083},{"id":326283940,"title":"Julie Chrisley Reveals Stunning Prison Transformation Following Trump Pardon","text":"Julie Chrisley appeared vastly different from her polished reality TV persona as she revealed a striking new look shortly after being pardoned by President Trump and released from prison.\n\nJulie, 52, who was released alongside her husband Todd on Wednesday, was nearly unrecognizable with her brown and gray hair as she left a butcher shop in Nashville during her initial hours of freedom on Thursday.\n\nThe former star of Chrisley Knows Best, renowned for her carefully styled blonde hair, was seen smiling in a picture first captured by Fox News Digital. She was later photographed reuniting with her husband Todd in an Instagram post shared by her daughter Savannah.\n\nJulie and Todd, 56, who starred in Chrisley Knows Best and several spin-offs, were found guilty of defrauding banks out of $30 million in 2022.\n\nJulie had been serving her seven-year prison sentence in Kentucky, while Todd, 56, was serving his 12-year sentence in Florida. \n\nFrom A-list scandals and red carpet mishaps to exclusive pictures and viral moments, subscribe to the DailyMail’s new Showbiz newsletter to stay in the loop. \n\nEarly Wednesday evening, Todd was released from Federal Prison Camp Pensacola while Julie was set free from FMC Lexington, according to Fox5.\n\nThe pair’s elated daughter Savannah, 27, spoke to the press outside his Florida prison after campaigning for years for their release.\n\nWhile dressed in bright pink ‘MAGA Barbie’ attire, she lauded President Trump, who personally called her on Tuesday to inform her of his decision to give her parents ‘a full, unconditional pardon.’\n\nAfter a nearly three-week jury trial, Todd and Julie were convicted in June 2022 of conspiring to defraud banks in the Atlanta, Georgia area out of more than $30 million in personal loans by submitting false documents.\n\nThey were also found guilty of wire fraud and tax evasion, obscuring their earnings while showcasing a luxurious lifestyle with expensive cars and designer clothes.\n\nWearing a hot pink MAGA hat, Savannah said she is ‘so grateful that I’m going to leave here with my dad’ after an ‘insane’ three years of her trying to get him and Julie freed.\n\nShe confirmed that her brother Grayson Chrisley would be the one picking up their mother from her Kentucky prison facility.\n\n‘President Trump signed the pardons at around 3pm this afternoon and it’s all due to President Trump, Alice Johnson, Ed Martin, all of them,’ she told the crowd.\n\n‘They have truly just shown up and looked at [Todd and Julie’s] case with a fine-tooth comb and they’ve seen the corruption.’\n\nAfter her call with Trump, Savannah said she arrived at her dad’s prison in Pensacola at 2 in the morning on Wednesday and has been waiting there since.\n\n‘I have not gone to sleep. I did not bring any clothes with me. I did not bring a toothbrush with me. I brought absolutely nothing with me,’ she revealed with a laugh. \n\n‘I’m just a daughter that wants to take my dad home with me.’\n\nWhen asked what Todd and Julie’s reactions were to Trump’s pardon, Savannah said that he was initially in total disbelief.\n\n‘They didn’t believe it. [The pardon] literally came out of nowhere. As I said before, I was walking into the grocery store when I got the call from the president,’ she explained.\n\n‘I was just in such shock and such awe that the president himself called me and took the time to let me know that my family’s coming back together.’\n\nSavannah said that her and Trump’s entire correspondence was captured ‘on video’ and that he had called to let her know that he was ‘reuniting [her] family.’\n\nShe also said that Trump and her younger brother Grayson Chrisley, 19, spoke briefly ‘about the University of Alabama where President Trump just gave the commencement speech.’\n\nGrayson is currently a sophomore at the university located in Tuscaloosa.\n\n‘So, it was absolutely amazing. It truly was just a human to human interaction and yes, he is our president but he’s also a person with a heart and who loves people well,’ Savannah gushed.\n\n‘Over the last 24 hours, I’ve gotten so much love and so much hate. And I’ve had people say, ‘Hmmm, I wonder what she had to do to get this pardon?’ I didn’t have to do anything.\n\n‘I didn’t have to do anything other than stand firm in my beliefs and my convictions and fight for my parents and fight for what was right.’\n\nSavannah went on to declare that President Trump has given all of the American people ‘hope and a brighter future’ since stepping into office — not just her family.\n\n‘People like to say [Trump’s] for the wealthy, for people who have campaigned for him [but] he has truly given everyone a chance at a better life and for that I will forever be grateful.’ \n\nSavannah confirmed that her and her family, including Todd and Julie, will soon be returning to TV with a new reality show.\n\n‘We have a new show coming out on Lifetime and it will document all of these things and we’re excited.’\n\nAccording to TMZ, production has already started on the Chrisley’s new show and a camera crew followed both Savannah and Grayson as they traveled to pick up their parents from prison.\n\nThe couple’s shock release, according to production sources, is set to be a major storyline on the show and that Todd and Julie’s respective releases were captured on camera.\n\nHowever, the sources claimed that Trump’s unexpected phone call to Savannah on Tuesday was not captured by Lifetimes’ camera crew.\n\nThe original plan for the family’s new show was to feature cameos from Todd and Julia via prison phone calls while much of the storyline would center on how Savannah and her older brother Chase Chrisley are holding down the family while their parents are locked away. \n\nSavannah concluded Wednesday’s press conference by shouting out both ‘God and President Trump’ again for bringing her family back together. \n\nHours later, Savannah shared a photo of herself outside her dad’s prison to Instagram with a lengthy caption about ‘fighting for her family.’\n\n‘This is from the press conference outside my father’s prison today… That smile on my face? I haven’t seen it in years. It’s the smile of a daughter who refused to give up. A woman who cried in silence, broke down in court bathrooms, and kept showing up even when the world told her to sit down,’ the star penned to her 2.9million followers.\n\nShe continued: Behind that smile is exhaustion. Trauma. A million sleepless nights. But also… fire. Conviction. Faith.\n\n‘I’m the product of a pissed off daughter and a relentless woman. And trust me when I say…there is nothing more dangerous than a woman fighting for her family.’\n\nSavannah offered more thanks to President Trump and his administration while commending herself for keeping her ‘promise’ to her parents to ‘bring them home.’ \n\n‘I stood by my parents and vowed that I would get them home… I kept that promise. By the grace of God, the courage of President Trump, the compassion of Alice Johnson, the integrity of Ed Martin, and the strength of the Trump administration—we did the impossible,’ she wrote.\n\n‘This fight was never just about us. It’s about every family torn apart by injustice. Every parent, every child, every person who’s been silenced or shattered by a system that too often forgets the humanity behind the headlines.\n\n‘Let this be your reminder: Keep fighting. Cry if you need to. Break down if you must. But don’t you dare stop believing. Your voice matters. Your story matters. And when women rise, mountains move.’\n\nTo conclude her post, Savannah teased that ‘we’re just getting started.’ She included the hashtags ‘#Freedom #JusticeForAll #Pardoned #Trump2025 #FaithOverFear.’\n\nLater, she uploaded a brief video to her Instagram Story revealing that she had thrown up on the ride back home to Nashville with dad Todd.\n\nTodd could be heard laughing in the background as his daughter held a plastic bag under her chin.\n\n‘Guys I puked the whole way,’ said Savannah, while still wearing her pink MAGA cap.\n\nWhile Savannah didn’t pan the camera to show him, Todd continued to laugh offscreen as he remarked he could ‘smell’ her vomit.\n\nAfter Savannah told him to just ‘spray perfume’ in the car, Todd quipped: ‘I didn’t have to deal with this in prison!’\n\nWhite House aide Margo Martin revealed the pardon on Tuesday by posting video of the president on the phone with Savannah, captioning the post: ‘Trump Knows Best!’ a play on the couple’s breakout reality TV show title. \n\nWhile pushing for a pardon for her parents over the last two and a half years, Savannah has become a fixture in MAGAworld.\n\nShe attended the 2024 Republican National Convention and the 2024 Conservative Political Action Conference – both events where Trump was the headliner and aides and allies were everywhere.\n\nShe appeared on the sidelines of last month’s White House Correspondents’ Dinner.\n\nThe effort paid off when Savannah received the call from the Oval Office on Tuesday.\n\n‘That’s a terrible thing, that’s a terrible thing,’ Trump told Savannah over the phone. ‘But it’s a great thing because your parents are going to be free and clean and I hope we can do it by tomorrow, is that OK?’\n\nJulie was supposed to serve time at the Federal Medical Center in Lexington, Kentucky until January 2028.\n\nTodd’s prison sentence kept him locked away at FPC Pensacola until April 2032, according to the Palm Beach Post.\n\n‘I don’t know them, but them give my regards,’ Trump also said. ‘Wish them a good life.’\n\nSavannah can be heard on the phone thanking the president and telling him her brother Grayson was on the line too.\n\nGrayson piped up, ‘Mr. President, I just want to say thank you for bringing my parents back.’\n\n‘Yeah, well, they were given a pretty harsh treatment from what I’m hearing,’ Trump said.\n\nSavannah revealed more details about her call with Trump while appearing on NewsNation’s On Balance with Leland Vittert on Tuesday.\n\nShe said that Trump told her how he believed her parents were ‘treated unfairly’ and that he ‘wanted to give them a full pardon.’\n\n‘He was like, you know, ‘You guys don’t look like terrorists to me.’ His exact words, which was pretty funny,’ she added.\n\nSavannah first reacted to the pardon news via Instagram on Tuesday in a lengthy clip after a video snippet of their call was shared by White House aide Margo Martin.\n\n‘President Trump didn’t just commute their sentences, he gave them a full, unconditional pardon. So for that I am forever grateful. Thank you, President Trump,’ she told fans. \n\nSavannah then vowed to ‘stand next to [Trump] and [his] administration and to stand up to the corruption and to continue fighting for the men and women that are in prison.\n\n‘I will repay your kindness to every person that I meet, so thank God for a president like Donald J. Trump,’ she said.\n\nThe Chrisleys’ attorney, Alex Little, said Trump’s pardon ‘corrects a deep injustice and restores two devoted parents to their family and community’.\n\n‘President Trump recognized what we’ve argued from the beginning: Todd and Julie were targeted because of their conservative values and high profile,’ Little said in a statement.\n\n‘Their prosecution was tainted by multiple constitutional violations and political bias.’\n\nLittle’s statement added: ‘Todd and Julie’s case is exactly why the pardon power exists. Thanks to President Trump, the Chrisley family can now begin healing and rebuilding their lives.’\n\nHowever, the couple’s shock pardon was met with intense backlash online, with many proclaiming there is ‘no justice anymore.’ \n\nOn Reddit, one simply wrote: ‘What a world this is?’ \n\n‘You can scam millions, evade taxes, and still walk free, just smile for the cameras and wait for a pardon,’ another said.\n\nEchoing a similar sentiment, a third added: ‘There is no justice anymore.’\n\n‘It’s great that they defrauded a bank out of millions of dollars and lied on their taxes and now they will have no consequences!’ another continued.\n\n‘Reality TV grifters have to stick together!’ joked a sixth.\n\nAnother asked: ‘How do Republicans/MAGA justify this and sleep at night knowing they are supporting the pardoning of fraudsters?’\n\nFellow reality television star Joe Exotic was also among those who were angered by the pardon.\n\nJoe is currently serving a 21-year sentence at FMC Forth Worth Federal Medical Center in Texas for conspiracy to commit murder-for hire.\n\nHe has been fighting for a pardon for the past five years.\n\nHe shared a screenshot of a PEOPLE article announcing the Chrisleys’ pardon on Tuesday with the caption: ‘This officially shows the Justice system is still two sided. You are either rich and connected or your poor and being trafficked by the system.’\n\nSpeaking exclusively to DailyMail.com, he said: ‘I have never been more disappointed in my life that President Trump is pardoning all of these people that have actually committed crimes and yet he leaves me here.’\n\nHe added: ‘I sit here innocent with two forms of cancer and can’t get his attention.’\n\nHowever, Joe publicly congratulated the Chrisley family on Wednesday as he left a comment on Savannah’s latest Instagram post.\n\n‘Congratulations. Hope I am next. But we have to expose the inside of here,’ he wrote.\n\nAlong with Todd and Julie Chrisley, Trump also used his pardoning power on several other individuals this week.\n\nOn Wednesday, former New York City congressman Michael Grimm had his 2014 tax fraud conviction forgiven.\n\nGrimm, who represented Staten Island, served seven months in jail and carried out 200 hours of community service for the offense.\n\nHe won reelection in 2014 despite being under indictment for underreporting wages and revenue at a restaurant he ran. However, he resigned the following year after pleading guilty.\n\nGrimm, who notoriously threatened to throw a reporter off a balcony during the 2014 State of the Union, was previously accused of having sex in the bathroom of a bar after spending more than 15 minutes locked away with a female friend.\n\nLast year he was paralyzed from the chest down when he was thrown off a horse during a polo tournament.\n\nFormer NYC Council Member, Vincent Ignizio, started a GoFundMe for Grimm, asking for $2.5million in donations to pay for treatment to help him ‘walk again.’\n\nThe president also pardoned a labor union leader who pleaded guilty to failing to report gifts from an advertising firm.\n\nJames Callahan, of Lindenhurst, New York, was general president of the International Union of Operating Engineers when he accepted – but failed to properly report – receiving at least $315,000 in tickets to sporting events and concerts and other amenities from a company that the union used to place ads.\n\nU.S. District Judge Ana Reyes was scheduled to sentence Callahan on Wednesday. On Tuesday, however, Callahan’s attorneys notified the court of Trump’s ‘full and unconditional’ pardon and asked for the sentencing hearing to be vacated.\n\nEarlier this month, prosecutors had recommended a prison sentence of six months for Callahan, calling him ‘one of the most powerful union leaders in the country.’\n\nThey said Callahan’s salary and other compensation topped $500,000 annually. Now retired and living in Florida, he has a net worth of more than $5 million, according to prosecutors.\n\nMeanwhile, ex-Chicago gang leader Larry Hoover has had his sentence commuted.\n\nHoover has been serving multiple life sentences for murder and running a criminal enterprise.\n\nHe made his first court appearance in decades in September in an effort to win early release, reported the Chicago Tribune.\n\nHoover was already serving a 200-year state sentence for the murder of a rival when he was indicted in federal court in 1995.\n\nHe was charged with continuing to oversee his murderous drug gang from prison and was convicted in 1997 then sentencing to life in prison.\n\nTrump also said Wednesday that he’s considering pardons for the men who plotted to kidnap Michigan Gov. Gretchen Whitmer.\n\n‘I’m going to look at it. I will take a look at it. It’s been brought to my attention,’ he said in the Oval Office on Wednesday. ‘I did watch the trial. It looked to me like somewhat of a railroad job, I’ll be honest with you.’\n\n‘It looked to me like some people said some stupid things. You know, they were drinking, and I think they said stupid things,’ he added.\n\nTrump claimed there was bipartisan support for the pardon.\n\n‘A lot of people are asking me that question from both sides actually,’ he said. ‘A lot of people think they got railroaded. A lot of people think they got railroaded.’\n\nIn 2020, during Trump’s first term, federal prosecutors charged six people with conspiring to kidnap Whitmer.\n\nOn Monday, Trump pardoned a former Virginia sheriff who was to serve time for a cash-for-badges scheme.\n\nThe sheriff, Scott Jenkins, had been a Trump supporter, visiting the White House during the president’s first term and was utilized as a surrogate in Virginia on the campaign trail.\n\n‘This Sheriff is a victim of an overzealous Biden Department of Justice, and doesn’t deserve to spend a single day in jail,’ Trump posted to Truth Social Monday afternoon.\n\nLate last month, Trump pardoned Paul Walczak, who pointed out that his mother had raised millions for the Trump campaigns on his pardon application.\n\nWalczak pleaded guilty of tax crimes days before the 2024 election and filed a pardon application shortly after inauguration.","summary":"Internewscast Journal\n\nInternewscast\n\n\nJulie Chrisley appeared vastly different from her polished reality TV persona as&#8230;\n\n\nThis Post: Julie Chrisley Reveals Stunning Prison Transformation Following Trump Pardon first appeared on Internewscast Journal","url":"https://internewscast.com/news/julie-chrisley-reveals-stunning-prison-transformation-following-trump-pardon/","image":"https://internewscast.com/wp-content/uploads/2025/05/Julie-Chrisley-debuts-dramatic-jail-makeover-after-Trump-pardon.jpg","video":null,"publish_date":"2025-05-29 23:40:39","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.003},{"id":326292462,"title":"Here's what impressed us most about Costco's earnings beat in a tariff-filled world","text":"Costco on Thursday returned to its old ways of delivering earnings beats. Despite concerns about a tariff-driven hit to margins, the retailer's better-than-expected results showed it is prepared to handle whatever challenges it may face. Total revenue in its third quarter of fiscal year 2025 increased 8% year over year to $63.2 billion, topping Wall Street expectations of $63.19 billion, according to estimates compiled by LSEG. Earnings per share (EPS) in the 12 weeks ended May 11 came in at $4.28, beating the consensus of $4.24, LSEG data showed. Shares of Costco were slightly lower in extended trading Thursday, along with U.S. equity futures more generally. Bottom line Costco turned it around this quarter after a surprising EPS miss the last time it reported. Because Costco reports its sales on a monthly basis, its topline figures are pretty well understood by the market when it comes time to report. What isn't known is profitability metrics. That's why we were pleased to see both Costco's gross margin and operating margin top Wall Street expectations, rising 41 basis points and 25 basis points, respectively, on an annual basis. A basis point is equal to 0.01 percentage point. Costco doesn't rely on raising prices to boost profits. It's the company's philosophy to only raise prices as a last resort. Instead, it focuses on keeping prices low, delivering greater value to its members, and driving higher sales volumes while efficiently managing costs—making its strong results even more impressive. Why we own it Costco is the best-run retailer in the world, with a business model focused on offering its members a relatively small universe of products at hard-to-beat prices. Costco has succeeded for decades, but the high inflation of recent years has made the company's value-focused ethos really shine. Competitors: BJ's Wholesale , Walmart , fellow Club holding Amazon Last buy: June 15, 2020 Initiation date: Jan. 27, 2020 One analyst remarked on the earnings call that the company has increased its operating margin — also referred to as earnings before interest and taxes (EBIT) margin — on a year-over-year basis for the eighth or ninth quarter in a row. By our count, it is eight — with its February 2023 quarter being the last time operating margin contracted compared with the year-ago period. Regardless, the analyst's overarching point holds true: That's an impressive streak for a retailer obsessed with providing customers value like Costco. We were even more impressed by how Costco improved its margins during a period when many retailers scrambled to figure out how to navigate President Donald Trump's higher tariffs on goods entering the U.S.. This is where Costco's size, global scale and limited product offerings really shines. The company said it rerouted goods sourced from countries with high tariff rates to non-U.S. markets, . And for the U.S., it pulled forward items it had planned for the summer and increased locally produced goods to reduce tariff impact. If other retailers are out of stock early this summer because they could not afford to pay the tariff, it means more opportunities for Costco to gain share. Another way Costco is mitigating the impact of tariffs is by moving more sourcing for its in-house Kirkland Signature products into the countries or regions where the item is sold. Notably, sales of Kirkland Signature items outpaced Costco's overall sales growth in the quarter. As we highlighted in a feature story in March , Kirkland Signature products tend to carry a higher margin than branded items, and the label's overall popularity has been key to Costco's success. Costco's quarter had a lot to like from it. The consistent sales growth, slow but steady margin improvement, and the ability to navigate tariffs are as good, if not better, than any retailer. That's why the stock is up about 10% year to date, outpacing Walmart's 7% rise and the flat S & P 500. However, we are reiterating our 2 rating, meaning we'll wait for a pullback before buying more. Our only hesitation here is the stock's lofty price-to-earnings valuation. We are reiterating our price target of $1,100 a share. Quarterly commentary Total comparable sales, an important retail industry metric, increased 5.7% in the quarter and 8% on an adjusted basis, which strips out changes from gasoline prices and foreign exchange. By category, both fresh and non-foods comp sales increased in the high-single digits. Some outperforming non-food categories were gold and jewelry, majors (large ticket items), toys, housewares, and home furnishing. As mentioned, gross margins improved 41 basis points versus the year-ago period to 11.25%, exceeding expectations of 10.92%. Core merchandise was the largest driver of the year-over-year gross margin improvement. It increased by 36 basis points, driven higher sales in its fresh department and declines in some key commodity and ingredient costs, such as dairy, butter, and eggs. Costco's food and sundries category margin — home to dry groceries, items in coolers and freezers, and liquor, among others — also saw margin improvements in the quarter. There was a 30 basis point improvement from Costco's ancillary and other businesses, which include pharmacy, food courts, and travel. Gas and e-commerce were the main drivers of the increase. Costco saw a slight margin headwind related to a one-time vacation accrual impact from a new employee agreement effective in March. LIFO (last in, first out) accounting also had a negative impact on gross margins. The company said it is calculated by comparing the net landed cost of inventory at the beginning of the fiscal year with the net landed cost of inventory on hand at the end of the current period. In this way, LIFO accounting can be a headwind to margins when prices are rising. Costco has been warning that renewal rates could have a little more variability to them relative to company history due to a couple of factors. One is an increase in digital sign-ups, which tend to renew at a lower rate. The second is store openings in Asia, which usually have outsized membership sign-ups at first but have a lower renewal rate. That played out in the quarter, with the worldwide rate and the U.S. and Canada rate declining to 90.2% and 92.7%, respectively, from 90.5% and 93% in the prior quarter. The company said the primary driver of the decline was from a Groupon promotion in the fall of 2023. Although digital sign-ups renewal at a lower rate, the company will gladly take the new members every day, especially because digital tends to skew toward younger members. The direction of total paid membership continued to move in the right direction, increasing to 79.6 million at the end of the quarter, up 6.8% year over year, and up from 78.4 million in the prior quarter. To be sure, that still missed Wall Street expectations by about 100,000. We are hardly concerned about the decline in renewal rates or the paid membership miss. Costco's comparable traffic — which measures the number of customers shopping in its warehouses — increased 5.2% year over year, a figure that is the envy of all retail. Costco estimates it will end the fiscal year with 914 stores, 24 more than at the end of fiscal 2024 but one less store than it anticipated three months ago. (Jim Cramer's Charitable Trust is long COST. See here for a full list of the stocks.) As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade. THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY , TOGETHER WITH OUR DISCLAIMER . NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB. NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED.","summary":"After a surprising earnings miss last time around, Costco delivered on Thursday night.","url":"https://www.cnbc.com/2025/05/29/heres-what-impressed-us-most-about-costcos-earnings-beat-in-a-tariff-filled-world.html","image":"https://image.cnbcfm.com/api/v1/image/108148679-1747837476184-gettyimages-2209908672-img_6058.jpeg?v=1747837528","video":null,"publish_date":"2025-05-29 23:40:14","author":"Jeff Marks","authors":["Jeff Marks"],"language":"en","source_country":"us","sentiment":-0.037},{"id":326291296,"title":"Automotive expert lauds Trump's steel deal as 'boost' to US economy","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics May 29, 2025 04:34 \n\n Automotive expert lauds Trump's steel deal as 'boost' to US economy \n Automotive expert Lauren Fix details what President Donald Trump's steel deal means for the automotive industry on 'The Bottom Line.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSWHAT TO WATCHSHOWSTHE BOTTOM LINE | LATEST EPISODESV-VIDEOSAUTO","summary":"Automotive expert Lauren Fix details what President Donald Trump&apos;s steel deal means for the automotive industry on &apos;The Bottom Line.&apos;","url":"https://www.foxbusiness.com/video/6373630589112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/df7d35b8-78e7-4fc3-af46-b4eb6c9b9e04/ce7253af-c041-4be1-9c74-1910774b4148/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-29 23:35:49","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.346},{"id":326281794,"title":"ICE gets staggering new mission that will leave illegal migrants terrified","text":"President Donald Trump has set immigration enforcement officials a lofty new target of conducting 3,000 arrests every single day in an ambitious effort to ramp up his deportation agenda. \n\nWhite House Deputy Chief of Staff Stephen Miller said the new goal is only temporary and the number of daily arrests expected under the Trump administration will continue to rise.\n\n'Under President Trump's leadership, we are looking to set a goal of a minimum of 3,000 arrests for ICE every day,' Miller told Fox News' Sean Hannity.\n\nTrump's border czar Tom Homan backed the ambitious new benchmark on Thursday morning, insisting: 'We've gotta increase these arrests and removals.'\n\n'The numbers are good, but I'm not satisfied. I haven't been satisfied all year long.'\n\nDuring Trump's first 100 days back in office, ICE officials arrested 66,463 illegal immigrants.\n\nMore than 65,000 illegal immigrants were deported.\n\nSome 17,000 deportees had criminal convictions or charges ranging from driving under the influence to assault or weapons offenses. \n\nICE has boasted removing gang members, murderers and child rapists. \n\nBut the administration has faced significant pushback and legal hurdles with challenges to the legality of some of the deportation schemes, particularly those which saw foreign aliens sent to a notorious Salvadoran prison under the wartime Illegal Aliens Act.\n\nOther migrants have been banished to third party nations with little to no legal pathway to challenge their deportations.\n\nICE deported 17,200 people in April alone - roughly 4,000 more than the number conducted in April 2024, under former president Joe Biden.\n\nEven if the lofty new target of 3,000 people a day is reached, it is still a far cry from Trump's campaign promise to rid America of up to 20million illegal immigrants. \n\nHe vowed to carry out 'the largest domestic deportation operation in American history.'\n\nThere have been reports for months that Trump has been unsatisfied with the progress of agents on the ground, who have discovered that tracking down illegal migrants - particularly criminals - is more difficult and a slower process than they initially expected. \n\nAcross the United States in immigration courts from New York to Seattle last week, Homeland Security officials began ramping up enforcement actions and carrying out mass arrests in an effort to boost their numbers.\n\nThree US immigration officials said government attorneys were given the order to start dismissing cases when they showed up for work Monday, knowing full well that federal agents would then have a free hand to arrest those same individuals as soon as they stepped out of the courtroom. All spoke on condition of anonymity because they feared losing their jobs. \n\nThis meant that when migrants arrived in court to plead their immigration cases, prosecutors would instead dismiss the case and a judge would rule the client was free to leave.\n\nOnce exiting the courtroom, ICE agents would be outside, waiting to arrest them.\n\nThe latest effort includes people who have no criminal records, migrants with no legal representation and people who are seeking asylum, according to reports received by the American Immigration Lawyers Association.","summary":"White House Deputy Chief of Staff Stephen Miller said the new goal is only temporary and the number of daily arrests expected under the Trump administration will continue to rise.","url":"https://www.dailymail.co.uk/news/article-14763297/ice-illegal-migrant-arrest-quota-3000-trump-plan.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/00/98879999-0-image-a-298_1748561139919.jpg","video":null,"publish_date":"2025-05-29 23:35:43","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.044},{"id":326282534,"title":"Wrongful death lawsuit says Big Oil contributed to heat wave and woman’s death","text":"By ALEXA ST. JOHN\n\nIn one of the nation’s first wrongful-death claims seeking to hold the fossil fuel industry accountable for its role in the changing climate, a Washington state woman is suing seven oil and gas companies, saying they contributed to an extraordinarily hot day that led to her mother’s fatal hyperthermia.\n\nThe lawsuit filed in state court this week says the companies knew that their products have altered the climate, including contributing to a 2021 heat wave in the Pacific Northwest that killed 65-year-old Juliana Leon, and that they failed to warn the public of such risks.\n\nOn June 28, 2021, an unusual heat wave culminated in a 108-degrees Fahrenheit day — the hottest ever recorded in the state, according to the filing. Leon had just driven 100 miles from home for an appointment, and she rolled down her windows on the way back because her car’s air conditioning wasn’t working.\n\nLeon pulled over and parked her car in a residential area, according to the lawsuit. She was found unconscious behind the wheel when a bystander called for help. Despite medical interventions, Leon died.\n\nThe filing names Exxon Mobil, Chevron, Shell, BP, ConocoPhillips, Phillips 66 and BP subsidiary Olympic Pipeline Company. ConocoPhillips, BP and Shell declined to comment when reached by The Associated Press. The other companies did not respond to requests for comment.\n\n“Defendants knew that their fossil fuel products were already altering the earth’s atmosphere,” when Juliana was born, Thursday’s filing said. “By 1968, Defendants understood that the fossil fuel-dependent economy they were creating and perpetuating would intensify those atmospheric changes, resulting in more frequent and destructive weather disasters and foreseeable loss of human life.”\n\nThe filing adds: “The extreme heat that killed Julie was directly linked to fossil fuel-driven alteration of the climate.”\n\nThe lawsuit accuses the companies of hiding, downplaying and misrepresenting the risks of climate change caused by humans burning oil and gas and obstructing research.\n\nInternational climate researchers said in a peer-reviewed analysis that the 2021 “heat dome” was “virtually impossible without human-caused climate change.”\n\nScientists have broadly attributed the record-breaking, more frequent, longer-lasting and increasingly deadly heat waves around the world to climate change that they say is a result of burning fossil fuels. Oil and gas are fossil fuels that, when burned, emit planet-warming greenhouse gas emissions, such as carbon dioxide.\n\n“We’ve seen a really advanced scientific understanding about this specific effects that climate change can cause in individual extreme weather events,” said Korey Silverman-Roati, a senior fellow at the Columbia Law School’s Sabin Center for Climate Change Law. “Scientists today are a lot more confident in saying that but for climate change, this would not have happened.”\n\nSilverman-Roati said the specificity of the case could clarify for people the consequences of climate change and the potential consequences of company behavior.\n\nThe lawsuit was first reported by The New York Times.\n\n“Big Oil companies have known for decades that their products would cause catastrophic climate disasters that would become more deadly and destructive if they didn’t change their business model,” said Richard Wiles, president of the Center for Climate Integrity, said in a statement on the case. “But instead of warning the public and taking steps to save lives, Big Oil lied and deliberately accelerated the problem.”\n\nUnprecedented action\n\nStates and cities have long gone after fossil fuel industry stakeholders for contributing to the planet’s warming. Recently, Hawaii and Michigan announced plans for legal action against fossil fuel companies for harms caused by climate change, though the states have been met by counter lawsuits from the U.S. Justice Department.\n\nThe current administration has been quick to disregard climate change and related jargon. Under President Donald Trump, the U.S. withdrew from the Paris climate agreement, again; the National Oceanic and Atmospheric Administration — an agency whose weather forecasting and research workforce has been gutted — will no longer track the cost of weather disasters fueled by climate change; and the Environmental Protection Agency has been called on to a rewrite its long-standing findings that determined planet-warming greenhouse gases endanger public health and welfare.\n\nMeanwhile, the federal government has ramped up support for oil and gas production in the name of an “American energy dominance” agenda, and it rolled back a host of other efforts and projects to address climate change.\n\nAround the world, other climate cases are being watched closely as potentially setting unique precedent in the effort to hold major polluters accountable. A German court ruled this week against a Peruvian farmer who claimed an energy company’s greenhouse gas emissions fueled global warming and put his home at risk.\n\nStill, a case that looks to argue these companies should be held liable for an individual’s death is rare. Misti Leon is seeking unspecified monetary damages.\n\n“Looking ahead, it’s hard to imagine this will be an isolated incident,” said Don Braman, associate professor at George Washington University Law School. “We’re facing an escalating climate crisis. It’s a sobering thought that this year, the hottest on record, will almost certainly be one of the coolest we’ll experience for the foreseeable future.\n\n“It is predictable or — to use a legal term, foreseeable — that the loss of life from these climate-fueled disasters will likely accelerate as climate chaos intensifies,” he added. “At the heart of all this is the argument about the culpability of fossil fuel companies, and it rests on a large and growing body of evidence that these companies have understood the dangers of their products for decades.”\n\nAlexa St. John is an Associated Press climate reporter. Follow her on X: @alexa_stjohn. Reach her at ast.john@ap.org.\n\nRead more of AP’s climate coverage at http://www.apnews.com/climate-and-environment\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"The lawsuit says a 2021 heat wave in the Pacific Northwest killed Juliana Leon.","url":"https://www.ocregister.com/2025/05/29/climate-wrongful-death-lawsuit/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/Climate_Wrongful_Death_Lawsuit_12256-1.jpg?w=960&h=720","video":null,"publish_date":"2025-05-29 23:33:59","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.28},{"id":326281482,"title":"Trump's pardons include array of white-collar criminals","text":"Washington — President Trump this week has issued pardons and commutations for several convicted fraudsters, the latest in a series of pardons for white-collar criminals in his second term, claiming in many cases that they were unfairly targeted for being his supporters. Here are some of the people Mr. Trump has used his clemency power on: Reality TV stars Todd and Julie ChrisleyMr. Trump said on May 27 that he would pardon reality TV stars Todd and Julie Chrisley, who were imprisoned after being sentenced in 2022 on bank fraud and tax evasion charges.The couple, who starred on \"Chrisley Knows Best,\" submitted false financial statements to obtain more than $30 million in personal loans, which they spent on luxury cars, designer clothes, real estate and travel, the Justice Department said. The couple also concealed their income from the IRS to avoid paying nearly $500,000 in delinquent taxes, while also failing to file tax returns and pay taxes from 2013 through 2016. The couple pleaded not guilty.In a video posted by a White House aide, Mr. Trump can be heard speaking with the Chrisleys' children, saying \"your parents are going to be free and clean. I hope we can do it by tomorrow.\" The couple's daughter, Savannah, had been seeking a pardon for her parents, and has compared their case to the president's legal troubles.Michael Grimm The White House said on May 28 that Mr. Trump had pardoned former Rep. Michael Grimm of New York, who had pleaded guilty in 2014 to tax fraud and related charges. Prosecutors alleged he underreported wages and revenue to the government, and that he filed false tax documents at a restaurant he owned before serving in Congress. Despite the indictment, Grimm was reelected in 2014, although he pleaded guilty one month later and resigned in January 2015. He served eight months in prison. Grimm attempted a comeback run in 2018, but lost the GOP primary for his Staten Island and southern Brooklyn district. Grimm last year was paralyzed from the chest down after being thrown from a horse while playing polo. Former Virginia sheriff Scott Jenkins On May 26, the president said he was pardoning a former Virginia sheriff, Scott Jenkins, who was sentenced to prison in March on fraud and bribery charges. Jenkins took $75,000 worth of bribes, federal prosecutors said, giving badges to eight untrained and unvetted individuals from whom he had allegedly accepted cash and campaign contributions. Jenkins pleaded not guilty, and denied any connection between taking payments and issuing badges at trial.Mr. Trump said in a post on Truth Social that Jenkins, a longstanding supporter of the president's, \"is a victim of an overzealous Biden Department of Justice, and doesn't deserve to spend a single day in jail.\"\"He is a wonderful person, who was persecuted by the Radical Left 'monsters,' and 'left for dead,'\" Mr. Trump added. Ex-Hunter Biden business partner Devon ArcherDevon Archer, a former business partner of Hunter Biden, was convicted in 2018 for his connection to a scheme to fraudulently issue more than $60 million of tribal bonds to the business arm of a South Dakota-based Native American tribe. He was sentenced to a year and a day in prison. Archer — who pleaded not guilty — appealed his case, taking it all the way to the Supreme Court, which in 2024 refused to hear his attempt to overturn his conviction. As Mr. Trump prepared to sign the pardon, Trump staff secretary Will Scharf said \"the tone and tenor\" of the case against Archer \"changed dramatically after he began to cooperate with congressional investigators and serve as a witness against Hunter Biden and the Biden family.\" \"Many people have asked me to do this,\" Mr. Trump said before signing the pardon. \"I think he was treated very unfairly. And I looked at the record, studied the records, and he was. He was a victim of a crime, as far as I'm concerned. So we're going to undo that.\" Hunter Biden associate Jason GalanisJason Galanis was sentenced in 2020 to over a decade of prison time for his alleged involvement in several fraud schemes, including the same one as Archer involving Native American tribal bonds. Mr. Trump commuted his sentence to time served. Galanis pleaded guilty.Like Archer, Galanis testified in a House GOP-led investigation into Hunter Biden, describing himself as a former business partner of the then-president's son. Galanis said he, Biden and Archer hoped to make \"billions,\" including by trading on Hunter Biden's family name. The younger Biden called Galanis a liar, and told House investigators he could only recall meeting Galanis \"10 years ago for 30 minutes.\"Former Illinois Gov. Rod BlagojevichFormer Illinois Gov. Rod Blagojevich received a full pardon from Mr. Trump in February, after the president had commuted his sentence at the end of his first term, in February 2020. He was sentenced to 14 years in prison in December 2011 on 18 corruption charges, among them, an attempt to sell Barack Obama's U.S. Senate seat after he won the White House in 2008. Blagojevich and Mr. Trump have known each other for decades. Long before he ran for president, Mr. Trump donated to the former Illinois governor's campaigns, and Blagojevich at one point was also a contestant on NBC's \"Celebrity Apprentice\" in March and April 2010, while he was fighting the corruption charges. He was \"fired\" by Mr. Trump after about four weeks on the show. Trump even asked the other contestants, \"Who thinks Rod is guilty?\"Blagojevich pleaded not guilty and has long insisted he is innocent.Nevada state lawmaker Michelle FioreMr. Trump also pardoned Michelle Fiore, a former city councilwoman and Nevada state lawmaker, in April. Fiore was accused of using money meant for a statue honoring police officers killed in the line of duty for her own personal expenses and was found guilty in October on wire fraud charges. She pleaded not guilty to the charges. Former Tennessee state Sen. Brian KelseyIn March, the president pardoned former Tennessee state Sen. Brian Kelsey, shortly after he had begun serving jail time for a campaign finance scheme. The Republican had pleaded guilty in 2022 to charges concerning his attempt to funnel campaign money from his state seat to a federal race for Congress, before trying to reverse the plea.\"God used Donald Trump to save me from the weaponized Biden DOJ,\" Kelsey said in a post on X. Electric truck entrepreneur Trevor MiltonEarlier this year, Mr. Trump pardoned Nikola founder Trevor Milton, who was convicted of securities fraud and wire fraud for lying to investors in his electric truck company. Prosecutors allege Milton boosted the company's share price by heavily exaggerating its successes, including by falsely claiming Nikola had built a \"fully functioning\" prototype of an electric truck and posting misleading videos that made it look like the prototype could drive under its own power. He was charged in 2021, a year after some of the allegations were first raised by short-selling firm Hindenburg Research.Milton — who denied wrongdoing — was sentenced to four years in prison. But the president pardoned him in March, claiming he was targeted for being a Trump supporter. Milton had donated hundreds of thousands to a pro-Trump group in 2024.Ozy founder Carlos WatsonThe president commuted the prison sentence of Carlos Watson, who founded the digital media company Ozy, and was sentenced to almost a decade in prison for conspiracy to commit securities fraud and wire fraud. Watson and his coworkers allegedly raised millions from investors by misrepresenting Ozy's finances. At one point, an Ozy employee allegedly impersonated a YouTube executive on a call with Goldman Sachs, aiming to convince the bank to invest in Ozy by talking up the success of its YouTube channel — an infamous story documented in a New York Times column. Mr. Trump commuted Watson's sentence to time served, shortly before he reported to prison.Watson pleaded not guilty, and maintained his innocence at trial.Paul WalczakIn April, Mr. Trump pardoned Paul Walczak, who had been sentenced earlier that month to 18 months in prison for failing to pay over $10 million in taxes related to nursing homes he controlled. According to the Justice Department, Walczak — who pleaded guilty — was \"not compliant with his tax obligations and instead used the withheld taxes to enrich himself.\" White House spokesperson Harrison Fields said in a statement that Walczak is an \"entrepreneur targeted by the Biden administration over his family's conservative politics.\" Walczak's mother, Elizabeth Fago, is a donor to Mr. Trump and visited the White House at least twice in Mr. Trump's first term. According to The New York Times, Fago attended a $1 million a plate fundraiser for Mr. Trump shortly before Walczak was pardoned. Jeremy HutchinsonMr. Trump pardoned former Arkansas state Sen. Jeremy Hutchinson, who had been convicted on bribery and tax charges, on May 29. Hutchinson — the nephew of former Arkansas Gov. Asa Hutchinson — pleaded guilty in two different bribery cases in 2019, acknowledging in court papers that he took payments from an orthodontic specialist and a healthcare charity and used his position as a lawmaker to back their interests. He also pleaded guilty to tax charges, Hutchinson was sentenced to a total of eight years in prison.Other cases droppedOutside of clemency, the Trump administration has moved to drop charges against a handful of others in recent months. The Justice Department moved to toss out charges against Republican former Rep. Jeff Fortenberry, who had been convicted of lying to the FBI. And in February, the Justice Department told federal prosecutors in New York to drop their corruption case against New York Mayor Eric Adams.","summary":"President Trump has handed out pardons to convicted fraudsters who he argued have been unfairly targeted, including a number of his supporters.","url":"https://www.cbsnews.com/news/trumps-pardons-fraudsters-white-collar-criminals/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/29/f5589221-1fbe-4361-ae53-6a5cdd63994e/thumbnail/1200x630g2/7c725036575fdd295951149996055aeb/gettyimages-2216576207.jpg?v=15603985a4508c8e7bc83d8e4e73c5d0","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3790283_hls/master.m3u8","publish_date":"2025-05-29 23:31:27","author":"Caitlin Yilek,Caroline Linton,Joe Walsh,Kaia Hubbard,Kathryn Watson,Melissa Quinn","authors":["Caitlin Yilek","Caroline Linton","Joe Walsh","Kaia Hubbard","Kathryn Watson","Melissa Quinn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.369},{"id":326283044,"title":"Israel umum penempatan baharu di Tebing Barat walaupun berdepan ancaman sekatan","text":"RAMALLAH: Israel meluluskan 22 penempatan Yahudi baharu di Tebing Barat yang diduduki, langkah yang dijangka menambah ketegangan dengan sekutu-sekutu tertentu yang sebelum ini mengancam akan mengenakan sekatan ke atas tindakan sedemikian.\n\nMenteri Kewangannya Israel, Bezalel Smotrich, seorang tokoh ultra-nasionalis yang menyokong kedaulatan penuh Israel ke atas Tebing Barat, menulis di platform X semalam, berkata penempatan itu akan dibina di utara Tebing Barat tanpa memperincikan lokasi spesifik.\n\nMedia Israel memetik kenyataan Kementerian Pertahanan bahawa penempatan baharu itu termasuk pengiktirafan sah terhadap 'pos-pos haram' sedia ada serta pembinaan penempatan baharu.\n\nJurucakap kepada Menteri Pertahanan Israel, Israel Katz setakat ini tidak memberikan sebarang maklum balas apabila diminta mengulas mengenai pengumuman itu.\n\nPihak Berkuasa Palestin yang disokong Barat dan mempunyai kuasa terhad di Tebing Barat, bersama kumpulan pejuang Hamas yang berpangkalan di Gaza, mengecam keputusan Israel itu.\n\nJurucakap kepada Presiden Palestin, Mahmoud Abbas, Nabil Abu Rudeineh menyifatkan keputusan itu sebagai 'tindakan provokatif yang berbahaya' dan menuduh Israel terus menyeret rantau itu ke dalam 'kitaran keganasan dan ketidakstabilan'. \n\n\"Kerajaan pelampau Israel ini sedang berusaha sedaya upaya menghalang penubuhan negara Palestin yang merdeka,\" katanya kepada Reuters sambil menggesa campur tangan segera daripada pentadbiran Presiden Amerika Syarikat (AS), Donald Trump.\n\nBagi rakyat Palestin, peluasan penempatan haram Yahudi dianggap sebagai halangan utama kepada usaha menubuhkan negara Palestin merdeka yang merangkumi Gaza, Tebing Barat dan Baitulmaqdis Timur yang diduduki.\n\nBilangan negara Eropah yang menggesa Israel menamatkan perang di Gaza semakin bertambah. Pada masa sama, Britain, Perancis dan Kanada pada bulan ini turut memberi amaran kepada Israel mereka mungkin mengenakan sekatan bersasar sekiranya Israel meneruskan peluasan penempatan Yahudi di Tebing Barat.\n\nMenteri Britain bagi Asia Barat, Hamish Falconer mengecam kelulusan penempatan baharu oleh Israel, sambil menyifatkannya sebagai 'halangan sengaja terhadap penubuhan negara Palestin'.\n\n\"Penempatan haram bertentangan dengan undang-undang antarabangsa, menggagalkan penyelesaian dua negara, dan tidak menjamin keselamatan Israel,\" katanya di platform X.\n\nMajoriti masyarakat antarabangsa menganggap penempatan Israel sebagai haram di sisi undang-undang antarabangsa, namun Israel menganggap penempatan itu sah dari sudut undang-undang domestiknya. \n\nManakala beberapa 'pos haram' pula tidak sah secara rasmi tetapi sering kali dibiarkan dan ada yang akhirnya disahkan secara rasmi.\n\nB'Tselem, sebuah pertubuhan hak asasi manusia terkemuka di Israel, menuduh kerajaan sayap kanan Israel memajukan agenda 'ketuanan Yahudi menerusi rampasan tanah Palestin dan pembersihan etnik di Tebing Barat'.\n\nDalam satu kenyataan, B'Tselem turut mengecam masyarakat antarabangsa kerana \"'membiarkan jenayah Israel terus berlaku'.\n\nSebaliknya, keputusan Israel itu dipuji oleh Yisrael Ganz, pengerusi Majlis Yesha yang mewakili penempatan Yahudi dan mempunyai hubungan rapat dengan Perdana Menteri Benjamin Netanyahu. \n\nGanz menyifatkan langkah itu sebagai tindak balas terhadap usaha Pihak Berkuasa Palestin menubuhkan sebuah negara.\n\n\"Keputusan bersejarah ini memberi mesej yang jelas, kita bukan sahaja berada di sini untuk kekal, tetapi untuk menubuhkan Negara Israel bagi semua penduduknya serta memperkukuh keselamatannya,\" katanya.\n\nKira-kira 700,000 peneroka Israel kini tinggal di antara 2.7 juta rakyat Palestin di Tebing Barat dan Baitulmaqdis Timur, kawasan yang ditawan Israel daripada Jordan semasa perang 1967.","summary":"RAMALLAH: Israel meluluskan 22 penempatan Yahudi baharu di Tebing Barat yang diduduki, langkah yang dijangka menambah ketegangan dengan sekutu-sekutu tertentu yang sebelum ini mengancam akan mengenakan sekatan ke atas tindakan sedemikian.","url":"https://www.bharian.com.my/dunia/asia/2025/05/1402358/israel-umum-penempatan-baharu-di-tebing-barat-walaupun-berdepan-ancaman","image":"https://assets.bharian.com.my/images/articles/BH29ISRAELA-O_BHfield_image_listing_featured.var_1748561421.jpg","video":null,"publish_date":"2025-05-29 23:30:34","author":null,"language":"en","source_country":"my","sentiment":-1},{"id":326287906,"title":"Hong Kong leader pledges ‘full support’ to local universities to attract overseas students amid US crackdown","text":"Hong Kong Chief Executive John Lee has pledged “full support” to the city’s universities to attract foreign students following US President Donald Trump’s move to restrict international enrolment.\n\n“Hong Kong will provide full support to our universities, giving [affected students] the best assistance if they wish to come to Hong Kong,” Lee told lawmakers in Cantonese during a question-and-answer session in the Legislative Council (LegCo) on Thursday.\n\nHis remarks come after the US State Department vowed on Wednesday to “aggressively” expel Chinese students and increase scrutiny of future applications from China and Hong Kong. US Secretary of State Marco Rubio on Tuesday ordered a pause in student visa processing until further notice and planned to expand social media vetting. \n\nThe Trump administration also attempted last week to ban Harvard University from enrolling foreign nationals. A US judge temporarily blocked the move, calling it unlawful.\n\nLee said on Thursday that he felt “encouraged” by local universities’ offers of streamlined admission into their programmes for those affected by Trump’s policy. \n\nThe Hong Kong University of Science and Technology (HKUST) and the Hong Kong Polytechnic University (PolyU) are among the higher education institutions in the city that have openly appealed to international students in the US.\n\nLee also said he could further review the quota for international student intake at local universities if needed, after already doubling the limit to 40 per cent last year.\n\n“I notice that the intake quota can still absorb a lot of students who are facing unfair treatment. I will review the quota if needed,” he said.\n\nHe added that the US policy against foreign students provided Hong Kong with an opportunity to bring in talent.\n\nHong Kong currently offers 30,000 places for international students at its eight publicly funded universities.\n\nEarlier this week, Lee said the city would open its universities to more international students facing “discriminatory and unfair treatment” by the US. \n\nThe city’s education minister Christine Choi last week urged local universities to welcome “outstanding students from all over the world.”\n\n‘Burning urgency’\n\nAt the LegCo meeting, Lee also agreed with lawmaker Lau Kwok-fan’s suggestion to expedite the establishment of a university town as part of the Northern Metropolis development plan.\n\nLee said he felt “a burning urgency” to speed up the development of the Northern Metropolis, which will encompass about a third of Hong Kong’s territory in the vast area neighbouring mainland China’s Shenzhen.\n\nLau, from pro-establishment political party the Democratic Alliance for the Betterment and Progress of Hong Kong (DAB), also suggested that the government establish a statutory body to oversee the development plan and draft special legislation that preempts any legal matters in the course of the development. \n\nLee said the government would consider Lau’s ideas.\n\nThe Northern Metropolis, which is set to transform 30,000 hectares of land along the border, will house 2.5 million people and create 500,000 jobs, according to the government.\n\nBut villagers who have been living there for decades said their lives would be uprooted by the project, while green groups warned that the development would threaten and damage wetland areas that are home to endangered wildlife.\n\nLast month, the High Court threw out a legal challenge mounted by activists against the San Tin Technopole, a planned tech zone that would be the centre of the Northern Metropolis project.\n\nSupport HKFP | Policies & Ethics | Error/typo? | Contact Us | Newsletter | Transparency & Annual Report | Apps\n\nHelp safeguard press freedom & keep HKFP free for all readers by supporting our team","summary":"Hong Kong Chief Executive John Lee has pledged “full support” to the city’s universities to attract foreign students following US President Donald Trump’s move to restrict international enrolment. “Hong Kong will provide full support to our universities, giving [affected students] the best assistance if they wish to come to Hong Kong,” Lee told lawmakers in [&#8230;]","url":"https://hongkongfp.com/2025/05/30/hong-kong-leader-pledges-full-support-to-local-universities-to-attract-overseas-students-amid-us-crackdown/","image":"https://hongkongfp.com/wp-content/uploads/2025/05/RENAME-before-upload-Article-Basic-Full-logo-32.jpg","video":null,"publish_date":"2025-05-29 23:30:00","author":"Hans Tse","authors":["Hans Tse"],"language":"en","category":"politics","source_country":"hk","sentiment":0.092},{"id":326284650,"title":"Bessent says it was ‘highly inappropriate’ for courts to block Trump tariffs after Senate ‘chose not to’","text":"“It seems highly inappropriate for the judiciary to wade in here when the Senate had the opportunity to override the president and didn’t,” Bessent told Fox News, adding that the president should set the country’s trade agenda. “Anything the courts do to get in the way harms the American people in terms of trade and tariff revenue.”\n\nBessent: It seems highly inappropriate for the judiciary to wade in here when the senate had the opportunity to override the president and didn’t.. anything the courts do to get in the way harms the American people in terms of trade and tariff revenue pic.twitter.com/oH16uEadQ1— Acyn (@Acyn) May 29, 2025\n\nA Democratic Senate resolution to vote down the tariffs last month failed 49-49, with Sens. Mitch McConnell (R-KY) and Sheldon Whitehouse (D-RI) not present for the vote. Both would’ve likely voted in the affirmative.\n\nA different resolution aimed at halting tariffs toward Canada passed 51-48 with Sens. Susan Collins (R-ME), Lisa Murkowski (R-AK), Rand Paul (R-KY), and McConnell voting in favor.\n\nCollins said the close vote “demonstrates that there is unease with the president’s plan.”\n\n“It’s partially the president’s plan is still evolving, but many of us are hearing from employers back home about the impact of the tariffs in a negative way,” she said.\n\nSenate Democrats have been highly critical of Trump’s tariffs, which they would’ve voted against had they acquired the majority in 2024. Sen. Elizabeth Warren (D-MA) said the tariffs “are pushing our economy off a cliff.”\n\n“The only thing Donald Trump’s tariffs have succeeded in is raising the odds of recession and sending markets into a tailspin,” Senate Minority Leader Chuck Schumer (D-NY) said. “Today, they have to choose — stick with Trump or stand with your states.”\n\nTrump had enacted universal tariffs on nearly every U.S. trading partner, with especially high tariffs on China that have since been paused. They were said to likely raise consumer prices across the board.\n\nTRACKING WHAT DOGE IS DOING ACROSS THE FEDERAL GOVERNMENTThe White House expects to prevail in court over the tariffs.\n\n“We will hear, within the next day or two, at a minimum, from the United States Trade Representative on how we will respond to all of this. We will respond forcefully, and we think we have a very good case with respect to this,” top trade adviser Peter Navarro said.","summary":"Treasury Secretary Scott Bessent believes it was &#8220;highly inappropriate&#8221; for the courts to block President Donald Trump&#8217;s &#8220;Liberation Day&#8221; tariffs when the Republican-led Senate didn&#8217;t. The U.S. Court of International Trade blocked Trump&#8217;s tariffs on Wednesday, saying he didn&#8217;t have the authority to impose them using the International Emergency Economic Powers Act. They have been [&#8230;]","url":"https://www.washingtonexaminer.com/policy/economy/3426151/scott-bessent-highly-inappropriate-courts-block-trump-tariffs/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/bessent-courts-inappropriate.webp","video":null,"publish_date":"2025-05-29 23:26:41","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"us","sentiment":-0.204},{"id":326281994,"title":"Trump and Xi Jinping May Have a Call Amid 'Stalled' Talks: Scott Bessent","text":"Treasury Secretary Scott Bessent said Thursday that trade talks with China are \"a bit stalled,\" and that President Donald Trump and Chinese leader Xi Jinping may need to speak soon.Speaking on Fox News' Special Report with Bret Baier, Bessent said in part, \"I think that given the magnitude of the talks, given the complexity, this is going to require both leaders to weigh in with each other. They have a very good relationship, and I am confident the Chinese will come to the table when President Trump makes his preferences known.\"This is developing news and will be updated as more information is available.","summary":"The U.S.-China trade war is at a standstill as tariffs, tech restrictions and political tensions strain global economic ties.","url":"https://www.newsweek.com/trump-xi-jinping-may-have-call-amid-stalled-talks-scott-bessent-2078772","image":"https://d.newsweek.com/en/full/2653831/trump-bessent-lutnick.jpg","video":null,"publish_date":"2025-05-29 23:23:44","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","source_country":"US","sentiment":0.308},{"id":326282494,"title":"Trump is down but not out in court battle over Harvard's foreign student visas","text":"A federal judge upheld a court order blocking President Donald Trump from stripping Harvard University of its ability to sponsor international student visas. U.S. District Judge Allison D. Burroughs on Thursday extended her earlier restraining order, which blocks the Trump administration from revoking Harvard’s certification under the Student and Exchange Visitor Program, or SEVP. That certification allows colleges to sponsor international students for U.S. visas during their enrollment. Burroughs, an Obama appointee, said she would preserve the status quo while both sides confer and submit either a joint proposed preliminary injunction order or individual proposed orders. But the update from the court is not a loss for the Trump administration — at least not yet. TRUMP NOMINATES FORMER DEFENSE ATTORNEY EMIL BOVE FOR FEDERAL APPEALS COURT VACANCY At issue is whether the Trump administration has grounds to revoke Harvard's SEVP certification. Trump officials have accused Harvard University of \"fostering violence, antisemitism, and coordinating with the Chinese Communist Party on its campus,\" according to a statement from DHS Secretary Kristi Noem. Legal experts told Fox News Digital that foreign students have far fewer protections than U.S. citizens, which puts Harvard at the government's mercy as long as the Trump administration satisfies certain procedural requirements. Experts noted that the SEVP program falls squarely under the authority of DHS and ICE, giving the Trump administration broad discretion to certify, extend or revoke a university’s participation based on the conduct of its foreign student visa holders. STATE DEPARTMENT NOW SCRUTINIZING ALL VISA HOLDERS ASSOCIATED WITH HARVARD While U.S. citizens have First Amendment protected free speech rights, the same is not true for foreign students studying in the U.S., whose status is sponsored by their university. The intersection \"of First Amendment [issues] with immigration law, at least to this extent, has really become a new thing under this administration,\" Robert Shibley, the special counsel for campus advocacy at the Foundation for Individual Rights and Expression, told Fox News Digital. \"Part of the complication here is that the government does have so much more leeway on foreign policy issues,\" Shibley said. \"However, I think in this case, there's a pretty clear process laid out in the regulations for stripping a school of its ability to get foreign students to attend on visas — and simply demanding a certain amount of information from the school and stripping them immediately, which is what they originally said, not the process.\" Shortly after court adjourned Thursday, the Trump administration gave Harvard 30 days to submit evidence and argue why its SEVP certification should not be revoked. It’s unclear whether that alone satisfies procedural requirements under the Administrative Procedure Act. The court must also consider what type of conduct foreign student visa holders are engaged in and whether these student visa holders are \"systemically\" engaged in serial violations of immigration law or are acting in support of foreign terrorist organizations, alleged foreign terrorist organizations or foreign totalitarian governments. \"That gives DHS stake to investigate and reevaluate on an off-cycle basis, the SEVP certification and eligibility,\" said Aram Gavoor, an associate dean at George Washington University Law School and a former Justice Department attorney. In this case, he said, DHS would have \"significant authorities to authorize, regulate, certify and, if necessary, decertify, the Student and Exchange Visitor Program.\" TRUMP ADMIN WORKING TO FLY BACK GUATEMALAN MIGRANT ERRONEOUSLY DEPORTED FROM US \"And, in a number of circumstances, the ability of a university to operate its own educational institution with what it teaches and how it teaches that can — in certain circumstances — come into tension with the authority of the U.S. government to regulate immigration in the context of student exchange visitors,\" Gavoor added. Lawyers for Harvard told the court that, if enacted, the revocation of its SEVP program would affect roughly 7,000 international students at the school at the undergraduate and post-graduate level, causing irreparable harm. They also claimed the action was a breach of administrative procedure, which requires the administration to grant a certain period of notice before revoking their SEVP credentials. \"The revocation continues a series of government actions to retaliate against Harvard for our refusal to surrender our academic independence,\" Harvard University President Alan Garber said Friday in a letter to the Harvard community. In the short term, the uncertainty could lead foreign students in the visa program to flee Harvard, seeking transfers to other universities that are not targeted by the Trump administration, experts told Fox News. Student visa holders are given roughly 180 days after their status is revoked to leave the country or risk violating the law, making the case of utmost importance for thousands of students. Legal experts noted the court is wading into largely uncharted territory. Asked how it might play out, many scholars pointed to a lack of precedent and offered no clear answer. \"As with many things that Trump does, the answer is unclear, because it hasn't been done before,\" Josh Blackman, a law professor at South Texas College of Law, said. \"No president has tried to do this before, so I don't think there's a clear precedent on the answer. \"What I'll say is this: Trump has basically accused Harvard of being a front for terrorism and emboldening terrorism,\" he added. \"And I think what they're trying to do is determine if this institution can basically exist.\" This was echoed by Gavoor, who said things need to play out between the Trump administration and Harvard before the court can properly decide if the government followed the law. \"I think Harvard does need to comply with the off-cycle review of DHS's SEVP certification,\" Gavoor said. CLICK HERE TO GET THE FOX NEWS APP At the same time, he said, even if the Trump administration loses on the merits of this case, \"there's a point to be argued that it may have won as a function of policy,\" he said. \"That's because it simply creates a chilling effect for students who would otherwise be attending or apply to Harvard University to be less inclined to do so or [causes them] to make alternative plans for their education In the U.S.\"","summary":"Trump’s push to strip Harvard of its student visa authority faces legal roadblocks as a judge intervenes and experts warn of fallout for 7,000 international students and beyond.","url":"https://www.foxnews.com/politics/court-preserves-status-quo-harvard-visa-certification-amid-accusations-fostering-unrest-ties-china","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/harvard-protester-hands-off-harvard-sign-1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-29 23:22:45","author":"Breanne Deppisch","authors":["Breanne Deppisch"],"language":"en","category":"politics","source_country":"us","sentiment":0.063},{"id":326279504,"title":"US Appeals Court Suspends Ruling Blocking Tariffs","text":"Washington, May 30 (QNA) - A US federal appeals court decided reinstated today the tariffs imposed by US President Donald Trump, just one day after a trade court had ruled to block those tariffs with immediate effect.\n\nThe federal appeals court suspended the earlier ruling by the trade court while it considers the motion's papers. The Trump administration had told the court it would seek emergency relief from the Supreme Court on Friday if the tariff ruling was not put on pause.\n\nYesterday, the US Court of International Trade had issued a ruling to suspend the tariffs with immediate effect, arguing that the president had overstepped his authority in imposing them. (QNA)","summary":"Washington, May 30 (QNA) - A US federal appeals court decided reinstated today the tariffs imposed by US President Donald Trump, just one day after a trade court had ruled to block those tariffs with immediate effect.","url":"https://qna.org.qa/en/news/news-details?id=us-appeals-court-suspends-ruling-blocking-tariffs&date=30/05/2025","image":"https://cdn.qna.org.qa/media/xh5lhys5/qna-us-court-10-4-2025.jpg?width=1200&height=900&v=1dbd0fd5875a590","video":null,"publish_date":"2025-05-29 23:21:46","author":"Us President Donald","authors":["Us President Donald"],"language":"en","category":"politics","source_country":"qa","sentiment":0.14},{"id":326282074,"title":"Mike Johnson sent Musk a 'long text message' begging him to reconsider criticism of bill","text":"After Tesla and SpaceX CEO Elon Musk publicly spoke out against President Donald Trump's \"One Big Beautiful Bill Act,\" House Speaker Mike Johnson (R-La.) rushed to defend the embattled legislation to the South African centibillionaire.\n\nPolitico reported Thursday that Johnson engaged directly with Musk in response to the tech CEO's comments on CBS Sunday Morning. The show published a snippet of an upcoming interview between correspondent David Pogue and Musk set to air June 1, in which Musk said the multitrillion-dollar spending bill was \"disappointing and \"undermines the work\" his Department of Government Efficiency (DOGE) was doing to reduce federal spending.\n\n\"I think a bill can be big, it can be beautiful, but I don't know if it could be both,\" Musk said, while laughing.\n\nREAD MORE: 'Extremely challenging circumstances': Chief Justice Roberts faces a 'serious test'\n\nDuring an interview with Fox News, Johnson admitted that he reached out privately to Musk to defend the bill. However, the speaker notably didn't delve into the particulars of what he said to Musk, or whether he got a response.\n\n\"I sent my good friend Elon a long text message explaining it can be big and beautiful,\" Johnson said.\n\nJohnson's remarks come as the bill — which cuts funding for Medicaid and Medicare by hundreds of billions of dollars to pay for a 10-year extension of tax cuts overwhelmingly skewed in favor of the rich – faces an uncertain future in the Republican-controlled U.S. Senate. Sen. Ron Johnson (R-Wisc.) has slammed the bill over its cost, and has said he refuses to support a bill that would increase the deficit. The nonpartisan Congressional Budget Office (CBO) projecting it would add more than $3 trillion to the federal deficit over the next decade, but Johnson doubted the CBO's findings.\n\n“We believe we’re gonna get the economy going and this is going to be deficit reducing at the end of the day,” Johnson said. “It matters how you do the math.”\n\nREAD MORE: 'Not sure how to process it': Whitmer accuses Trump of lying to her face\n\nClick here to read Politico's full report.","summary":"After Tesla and SpaceX CEO Elon Musk publicly spoke out against President Donald Trump's \"One Big Beautiful Bill Act,\" House Speaker Mike Johnson (R-La.) rushed to defend the embattled legislation to the South African centibillionaire.\n\nPolitico reported Thursday that Johnson engaged directly with Musk in response to the tech CEO's comments on CBS Sunday Morning. The show published a snippet of an upcoming interview between correspondent David Pogue and Musk set to air June 1, in which Musk said the multitrillion-dollar spending bill was \"disappointing and \"undermines the work\" his Department of Government Efficiency (DOGE) was doing to reduce federal spending.\n\n\"I think a bill can be big, it can be beautiful, but I don't know if it could be both,\" Musk said, while laughing.\n\nREAD MORE: 'Extremely challenging circumstances': Chief Justice Roberts faces a 'serious test'\n\nDuring an interview with Fox News, Johnson admitted that he reached out privately to Musk to defend the bill. However, the speaker notably di","url":"https://www.alternet.org/mike-johnson-text-message/","image":"https://www.alternet.org/media-library/image.jpg?id=60341977&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-05-29 23:19:41","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"US","sentiment":-0.176},{"id":326286416,"title":"The world is closing down","text":"Straws in the wind: recently I ran across a post by the CEO of a nationwide professional association in Canada. People like him are used to hopping across the US border for various meetings several times a month, but he was remarking on what people had been talking about at the association’s recent annual conference in a big Canadian city.\n\nWhat his post said was: “Consensus here is that it’s risky to travel to [USA flag emoji] but if you have to go, bring a burner phone. Have a plan in case you get detained. Watch what you say. Who you meet.” And I thought “Yeah. Me, too.”\n\nI’m a journalist so I will still go to the US if I absolutely have to, but not for pleasure, not for paid lectures and things—and yes, please, on the burner phone.\n\nBack when I started out in this trade, half the world was off-limits, especially for freelance journalists.\n\nThe Cold War reached a second peak in the early ’80s and you couldn’t go to the Soviet Union unless you had a big media organisation negotiating for you. Even then it took months for a visa, and you were followed everywhere.\n\nThe Communist-ruled “satellite” countries in Eastern Europe were a little easier, and China was letting tourists in to some parts of the country (but not stray journalists). Albania, North Korea and Iran were completely closed, and most of South-East Asia and much of Central and South America were ruled by military dictators who ran death squads.\n\nThen non-violent democratic revolutions began all over the “Third World”, the Communist regimes of Eastern Europe collapsed, and the old Soviet Union itself followed suit. Soon almost the whole world opened up.\n\nIt was a nice ride while it lasted, but then the whole process went into reverse.\n\nYou won’t feel the effects much if you travel as a tourist or even do business abroad, but journalists (including foreign journalists) are the canaries in the coalmine on this and I’m certainly feeling the change. The number of countries I won’t go to anymore is growing every year.\n\nIt started, weirdly enough, with Turkey, a place I thought I knew well. I’ve lived there, I speak the language (or at least I used to), and I even thought President Recep Tayyip Erdogan was a welcome change from a militantly secular government that ignored the rights of the pious half of the population.\n\nThen the editor of the newspaper that ran this column in Turkey was jailed, the publisher went into exile, and the new regime turned the paper into a government propaganda outlet. I know there’s a fat file on me somewhere in Ankara and I’ve seen the inside of a Turkish jail (as a visitor), so I don’t go there anymore. Twenty years now.\n\nNext was Russia, where I had been practically commuting in the early ’90s. Vladimir Putin was elected in 1999 and it was still all right for a while, but by 2005 he was killing opposition leaders and I started reporting from afar.\n\nNote, by the way, that these changes were happening after more or less free elections—although they tended to be the last fair elections.\n\nThen came a round of non-violent pro-democracy uprisings in the Middle East, most of them drowned in blood. That set off a whole cluster of civil wars, and the whole region became very hard to work in. It still is.\n\nNext was China, where they arrested, tried and jailed two random Canadian businessmen in 2018, really as hostages to exchange for a Chinese citizen in Canada whom they wanted back.\n\nIt wasn’t aimed specifically at journalists and the victims were freed after a thousand days in prison, but I and many other people took it as a signal to do your Chinese business from afar.\n\nHowever, I never thought that I would be adding the United States to the list.\n\nEven during Donald Trump’s first term, foreign journalists were no more at risk of arbitrary imprisonment than the average American citizen, and nobody followed you around or listened to your phone calls. (Well, no more than they listen to everybody else’s calls.)\n\nNow, quite suddenly, the United States has become just another great power where foreigners watch what they say, try to minimise contacts with official bodies, or just stay away. The thought even occurs that, as in so many other cases, there will still be elections but we will know the outcome in advance.\n\nIt sounds almost hysterical to talk like this and many non-journalist travellers won’t even notice it, but the world is closing down again.\n\nI have no idea if and when it will reopen.\n\n—Author Gwynne Dyer is an international journalist based in London.","summary":"Straws in the wind: recently I ran across a post by the CEO of a nationwide professional association in Canada. People like him are used to hopping across the US border for various meetings several times a month, but he…","url":"https://trinidadexpress.com/opinion/columnists/the-world-is-closing-down/article_f8a9798c-5f10-432e-a3c5-7d43632da3c1.html","image":"https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/8/75/875eba2e-2653-11e8-bfd3-6732d476ec07/5aa718029bace.image.jpg?crop=768%2C403%2C0%2C54","video":null,"publish_date":"2025-05-29 23:19:00","author":"Gwynne Dyer","authors":["Gwynne Dyer"],"language":"en","source_country":"es","sentiment":-0.208},{"id":326282052,"title":"Donald Trump’s latest pardons raise eyebrows: From jailed politicians to reality TV stars","text":"Washington: A governor who resigned amid a corruption scandal and served two stints in federal prison. A New York Republican who resigned from Congress after a tax fraud conviction and who made headlines for threatening to throw a reporter off a Capitol balcony over a question he didn't like. Reality TV stars convicted of cheating banks and evading taxes.\nAll were unlikely beneficiaries this week of pardons, with US President Donald Trump flexing his executive power to bestow clemency on political allies, prominent public figures and others convicted of defrauding the public.\nThe moves not only take aim at criminal cases once touted as just by the Justice Department, but also come amid a continuing Trump administration erosion of public integrity guardrails, including the firing of the department's pardon attorney and the near-dismantling of a prosecution unit established to hold public officials accountable for abusing public trust.\n\"He is using pardons to essentially override the verdicts of juries, to set aside the sentences that have been imposed by judges and to accomplish political objectives,” said Liz Oyer, who was fired in March as the pardon attorney after she says she refused to endorse a recommendation to restore the gun rights of actor Mel Gibson, a Trump supporter.\n“That is very damaging and destructive to our system of justice.”\nTo be sure, other presidents have courted controversy with their clemency decisions.\nPresident Gerald Ford famously pardoned his predecessor, Richard Nixon, and Bill Clinton pardoned fugitive financier Marc Rich just hours before the Democratic president left office.\nMore recently, Joe Biden pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family.\nBut the pardons announced Wednesday are part of a pattern of clemency grants that began in Trump's first term and has continued in the current one in which bold-face names, prominent supporters and defendants whose causes are championed by friends time and again have an edge on ordinary citizens who lack connections to the White House.\nIn 2020, for instance, he pardoned allies convicted in the Russia election interference investigation that shadowed his first term as well as his son-in-law's father, Charles Kushner, who was later named ambassador to France.\nOn his first day back in office, he pardoned, commuted the prison sentences or vowed to dismiss the cases of all of the 1,500-plus people charged with crimes in the January 6, 2021, US Capitol riot, using his clemency powers to undo the massive prosecution of the unprecedented assault on the seat of American democracy.\nTwice indicted by the Justice Department, and entangled in criminal investigations in the White House and in his post-presidency life, Trump has long conveyed public suspicion about prosecutorial power and found common cause with politicians -- including on the other side of the aisle -- he sees as having been mistreated like he believes he was.\nIn February, for instance, the Republican president pardoned former Democratic Illinois governor Rod Blagojevich after having earlier commuted his 14-year sentence on political corruption charges.\nBlagojevich, he said, “was set up by a lot of bad people, some of the same people I had to deal with\".\nThe most recent pardon beneficiaries include former GOP New York Republican Michael Grimm, who pleaded guilty in 2014 to underreporting wages and revenue at a restaurant he ran in Manhattan.\nThe former Marine and FBI agent resigned from Congress the following year and served eight months in prison. Grimm tried to reenter politics in 2018 but lost a primary for his old district.\nOthers include former Republican Connecticut governor John Rowland, whose once-promising political career was cut short by an investigation into gifts and favours from state contractors.\nRowland was convicted and imprisoned a second time for conspiring to hide his work on political campaigns and was sentenced to 30 months in federal prison.\nThe White House also announced pardons for rap artiste NBA YoungBoy on gun-related charges and TV stars Todd and Julie Chrisley, famous for \"Chrisley Knows Best\", a reality show that followed their family and extravagant lifestyle that prosecutors said was boosted by bank fraud and hiding earnings from tax authorities.\nThe couple was convicted in 2022 of conspiring to defraud banks out of more than USD 30 million in loans by submitting false documents.\nThe latest pardons unfold as Trump has departed from the norms and protocols of the clemency process and as the Justice Department has signalled a tweaked approach to public corruption and white-collar fraud.\nIn place of Oyer, the fired pardon attorney, the administration installed Ed Martin, a Trump loyalist who briefly served as interim US attorney in Washington.\nHe has already pledged to scrutinise pardons that Joe Biden issued on his way out of the White House and has said he would take a “hard look\" at two men who are serving long prison terms for leading a conspiracy to kidnap Democratic Michigan Governor Gretchen Whitmer.","summary":"Donald Trump has granted pardons to a controversial list of individuals, including convicted politicians and reality TV stars, drawing criticism for politicizing clemency. The move follows firings, DOJ shakeups, and signals a departure from traditional justice system checks","url":"https://telanganatoday.com/donald-trumps-latest-pardons-raise-eyebrows-from-jailed-politicians-to-reality-tv-stars","image":"https://media.telanganatoday.com/wp-content/uploads/2025/03/Trump-4.jpg","video":null,"publish_date":"2025-05-29 23:17:59","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.107},{"id":326287766,"title":"US Backs Next Round of Istanbul Meeting, Calls For ‘Constructive Good-Faith Dialogue’","text":"The United States on Thursday backed fresh calls to hold a second round of peace talks between Russia and Ukraine in Istanbul next week in order to exchange written proposals to end the war.\n\n“It is my understanding, and it is our hope that Russia and Ukraine will engage in direct talks and negotiations next week in Istanbul, and we believe that meeting is going to take place” White House spokesperson Karoline Leavitt told reporters adding, “that is a meeting the [US] president [Donald Trump] encouraged and urged for these two sides to come together and negotiate directly.”\n\n“Hopefully, next week, we’ll move the ball forward,” Leavitt went on to add. \n\nAs Kyiv Post reported earlier, Moscow said on Wednesday that it had offered to hold a second round of talks with Ukraine in Istanbul on June 2, where it wants to present a so-called “memorandum” outlining its conditions for a long-term peace settlement. \n\nKyiv, in response, requested a copy of the memorandum in advance to ensure Moscow’s seriousness, a proposal that the Kremlin dismissed.\n\nRussian autocrat Vladimir Putin famously dodged the first round of Istanbul talks on May 16, which he himself had proposed, and instead sent low-level delegates to the discussion table. Ukrainian officials remain skeptical as they view Moscow’s proposals as a way to placate the Western leader amid their growing frustration with Putin. Trump said on Tuesday that the Russian president was “playing with fire.”\n\nUkrainian President Volodymyr Zelensky also echoed Kyiv’s skepticism on Thursday saying that Russia was “doing everything it can” to prolong the war and disrupt the negotiations. \n\nBack in Washington, Trump officials said Thursday that they had reiterated to Moscow their calls for constructive good-faith dialog as “the only way” to end the war. State Department spokesperson Tammy Bruce told a daily briefing on Thursday that Secretary Marco Rubio has conveyed Trump’s position on “good faith talks” during a phone call with his Russian counterpart Sergey Lavrov.\n\nKyiv Post has learned from diplomatic sources that the Wednesday call between Rubio and Lavrov was initiated by the latter to congratulate the top US diplomat on his birthday.\n\nBruce told reporters that Rubio took the initiative during the call to welcome the exchange of a thousand for a thousand prisoners between Russia and Ukraine last weekend, which “was arranged while we were in Istanbul” as she put it referring to May 16 talks. \n\nWhen asked by Kyiv Post whether Washington believed that good-faith dialogue could continue alongside the military offensive, Bruce said “we’re going to find that out.” \n\n“I think the President [Trump] has judged Putin, based on the nature of what was clearly extremely frustrating to him regarding the killing of civilians while talks are going on for a ceasefire. And that’s a judgment that’s going to come from the leaders of this country – the leaders, frankly, of the free world – of whether or not that’s possible, and we’re going to have to take that moment by moment in this case,” she concluded. Yet it remains unclear whether the US still plans to send its own representatives to the next phase of Istanbul talks.\n\n“I’m not going to go into that. I have nothing to preview for you on that,” Bruce told Kyiv Post’s reporter when asked whether the US would be a part of the upcoming meeting.","summary":"When asked by Kyiv Post whether Washington believed that good-faith dialogue could continue alongside military offensive, the State Department spokesperson said, “We’re going to find that out.”","url":"https://www.kyivpost.com/post/53624","image":"https://static.kyivpost.com/storage/2025/05/30/20089f96431de39153250ee4f7a41854.png?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-05-29 23:16:52","author":"Alex Raufoglu","authors":["Alex Raufoglu"],"language":"en","source_country":"ua","sentiment":-0.176},{"id":326279558,"title":"Trump's latest pardons benefit array of political allies, public figures","text":"Washington, May 30 (AP) A governor who resigned amid a corruption scandal and served two stints in federal prison. A New York Republican who resigned from Congress after a tax fraud conviction and who made headlines for threatening to throw a reporter off a Capitol balcony over a question he didn’t like. Reality TV stars convicted of cheating banks and evading taxes.\nAll were unlikely beneficiaries this week of pardons, with US President Donald Trump flexing his executive power to bestow clemency on political allies, prominent public figures and others convicted of defrauding the public.\nThe moves not only take aim at criminal cases once touted as just by the Justice Department, but also come amid a continuing Trump administration erosion of public integrity guardrails, including the firing of the department’s pardon attorney and the near-dismantling of a prosecution unit established to hold public officials accountable for abusing public trust.\n“He is using pardons to essentially override the verdicts of juries, to set aside the sentences that have been imposed by judges and to accomplish political objectives,” said Liz Oyer, who was fired in March as the pardon attorney after she says she refused to endorse a recommendation to restore the gun rights of actor Mel Gibson, a Trump supporter.\n“That is very damaging and destructive to our system of justice.” To be sure, other presidents have courted controversy with their clemency decisions.\nPresident Gerald Ford famously pardoned his predecessor, Richard Nixon, and Bill Clinton pardoned fugitive financier Marc Rich just hours before the Democratic president left office.\nMore recently, Joe Biden pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family.\nBut the pardons announced Wednesday are part of a pattern of clemency grants that began in Trump’s first term and has continued in the current one in which bold-face names, prominent supporters and defendants whose causes are championed by friends time and again have an edge on ordinary citizens who lack connections to the White House.\nIn 2020, for instance, he pardoned allies convicted in the Russia election interference investigation that shadowed his first term as well as his son-in-law’s father, Charles Kushner, who was later named ambassador to France.\nOn his first day back in office, he pardoned, commuted the prison sentences or vowed to dismiss the cases of all of the 1,500-plus people charged with crimes in the January 6, 2021, US Capitol riot, using his clemency powers to undo the massive prosecution of the unprecedented assault on the seat of American democracy.\nTwice indicted by the Justice Department, and entangled in criminal investigations in the White House and in his post-presidency life, Trump has long conveyed public suspicion about prosecutorial power and found common cause with politicians — including on the other side of the aisle — he sees as having been mistreated like he believes he was.\nIn February, for instance, the Republican president pardoned former Democratic Illinois governor Rod Blagojevich after having earlier commuted his 14-year sentence on political corruption charges.\nBlagojevich, he said, “was set up by a lot of bad people, some of the same people I had to deal with”.\nThe most recent pardon beneficiaries include former GOP New York Republican Michael Grimm, who pleaded guilty in 2014 to underreporting wages and revenue at a restaurant he ran in Manhattan.\nThe former Marine and FBI agent resigned from Congress the following year and served eight months in prison. Grimm tried to reenter politics in 2018 but lost a primary for his old district.\nOthers include former Republican Connecticut governor John Rowland, whose once-promising political career was cut short by an investigation into gifts and favours from state contractors.\nRowland was convicted and imprisoned a second time for conspiring to hide his work on political campaigns and was sentenced to 30 months in federal prison.\nThe White House also announced pardons for rap artiste NBA YoungBoy on gun-related charges and TV stars Todd and Julie Chrisley, famous for “Chrisley Knows Best”, a reality show that followed their family and extravagant lifestyle that prosecutors said was boosted by bank fraud and hiding earnings from tax authorities.\nThe couple was convicted in 2022 of conspiring to defraud banks out of more than USD 30 million in loans by submitting false documents.\nThe latest pardons unfold as Trump has departed from the norms and protocols of the clemency process and as the Justice Department has signalled a tweaked approach to public corruption and white-collar fraud.\nIn place of Oyer, the fired pardon attorney, the administration installed Ed Martin, a Trump loyalist who briefly served as interim US attorney in Washington.\nHe has already pledged to scrutinise pardons that Joe Biden issued on his way out of the White House and has said he would take a “hard look” at two men who are serving long prison terms for leading a conspiracy to kidnap Democratic Michigan Governor Gretchen Whitmer. (AP) ARI","url":"https://www.news18.com/agency-feeds/trumps-latest-pardons-benefit-array-of-political-allies-public-figures-9359015.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-05-29 23:15:02","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.128},{"id":326281196,"title":"Ishiba and Trump talk tariffs in second phone call this month","text":"Prime Minister Shigeru Ishiba exchanged views with U.S. President Donald Trump on tariffs, foreign affairs and security during a phone call Thursday night.This was their second call this month, following the one from last Friday.Ishiba described his 25-minute call with Trump as “a very meaningful conversation” in which further cooperation between the two countries across a wide range of fields was discussed.","summary":"Ishiba described his 25-minute call with Trump as “a very meaningful conversation” that allowed them to deepen their \"mutual understanding.\"","url":"https://www.japantimes.co.jp/business/2025/05/30/economy/ishiba-trump-call/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/05/30/472252.jpg?v=3.1","video":null,"publish_date":"2025-05-29 23:15:00","author":"Francis Tang,Web Master","authors":["Francis Tang","Web Master"],"language":"en","source_country":"JP","sentiment":0.074},{"id":326281326,"title":"Riley Gaines issues challenge to ex-ESPN host after he slammed 'MAGA stooge' over trans athlete fight","text":"Riley Gaines issues challenge to ex-ESPN host after he slammed 'MAGA stooge' over trans athlete fight\n\nREAD MORE: Kai Trump's stance on women's sport revealed\n\nBy ISABEL BALDWIN\n\nPublished: 00:05 BST, 30 May 2025 | Updated: 00:14 BST, 30 May 2025\n\nConservative activist Riley Gaines has challenged former ESPN host Keith Olbermann to a race after he hit out at her for her support of Donald Trump. \n\nGaines tied for fifth place with University of Pennsylvania swimmer Lia Thomas, a biological male, in 2022 while swimming for the University of Kentucky in the 200-yard NCAA freestyle championship. \n\nThe 25-year-old has since been outspoken against transgender athletes competing in women's sport, haling the president for his 'Keeping Men Out of Women's Sport' executive order earlier this year. \n\nThis week, Olbermann, the ex-host of both MSNBC's 'Countdown with Keith Olbermann' and ESPN's 'SportsCenter,' took aim at the former collegiate swimmer over her campaigning. \n\nOlbermann responded to a Fox News clip of Education Secretary Linda McMahon claiming that Gaines 'would have clearly won' her race if Gaines didn't have to compete against transgender athlete Thomas.\n\n'[Riley Gaines] finished 85th in the Olympic Trials,' Olbermann posted on X. 'She finished tied for 5th in the only race including a transgendered athlete. If there had been none she MIGHT have finished tied for 4th, or had 5th place to herself.' \n\nGaines, a 12-time NCAA All-American, fired back at the sports commentator, noting she 'placed 85th at Olympic trials when I was 15/16.'\n\nConservative activist Riley Gaines has challenged former ESPN host Keith Olbermann to a race\n\nIn 2022, Gaines tied for fifth with transgender swimmer Lia Thomas (pictured left)\n\n'I was one of the youngest there,' Gaines explained. 'And I placed 5th *in the nation* in a sport measured in .01s of a second without going a best. Would you say the 5th best college football player is objectively bad at their sport?\n\n'No. You’re just a misogynistic pig & an old, deranged man with a terminal case of TDS who can’t hold down a job.' \n\nShe went on to challenge Olbermann to back up his criticism by taking her on in a race for charity, Gaines told Fox Digital. \n\nShe said that the event would be a 200-yard freestyle at a location of Olbermann's choice sometime before August 31 with proceeds going to a charity of the winner's choosing.\n\nOlbermann appeared to accept the challenge, branding the competition a 'brilliant idea.'\n\n'A 66-year old man with an arthritic left knee and chronic stress fractures in the right foot... Somebody you could finally beat!' he taunted in response to the challenge.\n\nThe heated online tiff comes after Gaines joined many in expressing outrage over a transgender athlete competing in girls' high school track and field in California.\n\nAB Hernandez of Jurupa Valley, a biological male, won the women's long jump and triple jump at the California Interscholastic Federation Southern Section Masters Meet last week.\n\nReese Hogan of Crean Lutheran High School, one of the opponents defeated by Hernandez, took the podium following the official ceremony.\n\nThe 25-year-old has been outspoken against trans athletes competing in women's sport \n\nAB Hernandez of Jurupa Valley is making waves in track and field in contentious fashion \n\nLast week one of Hernandez's beaten opponents waited to take her spot at the top of a podium \n\nRiley Gaines recalls 'humiliating' experience of sharing locker room with trans athlete\n\nThe moment took off online, and earned praise from Gaines. In March, Hernandez drew backlash online after winning a triple jump event by three feet.\n\nIn response to the backlash, Trump blasted California governor Gavin Newsom , who he called ‘Newscum,’ and called a transgender athlete's sporting domination in the state ‘not fair and totally demeaning to women and girls.’\n\n‘Please be advised that large scale federal funding will be held back, maybe permanently,’ Trump threatened on his Truth Social site.\n\nThen, without citing a specific legal basis, Trump wrote that ‘I am ordering local authorities, if necessary, to not allow the transitioned person to compete in the State Finals. This is a totally ridiculous situation!!!’\n\nGaines has been vocal in her opposition to allowing trans athletes to compete in women's sport and has dedicated the past two years to campaigning on the issue.\n\nShe was invited to Trump's address to Congress in March when the president turned his focus to keeping trans athletes out of women's sports.\n\nThe subject had been a big driving force in his election last November and Trump elected to highlight the story of Payton McNabb, a former high school volleyball player who was left with brain damage after being spiked in the face by a trans opponent, during his speech.\n\nTrump had previously surrounded himself with female athletes and activists, including Gaines, at the White House a month earlier to sign an executive order barring trans participation in women's sports.\n\nThe order uses Title IX, a law against sex discrimination in taxpayer-funded education programs, to ban transgender girls and women from participating in female school sports activities.\n\nShare or comment on this article:\nRiley Gaines issues challenge to ex-ESPN host after he slammed 'MAGA stooge' over trans athlete fight\n\nAdd comment","summary":"Riley Gaines has been outspoken against transgender athletes competing in women's sport, haling the president for his 'Keeping Men Out of Women's Sport' executive order.","url":"https://www.dailymail.co.uk/sport/othersports/article-14763247/Riley-Gaines-challenge-keith-olbermann-trans-athlete.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/00/98879383-0-image-m-20_1748559702596.jpg","video":null,"publish_date":"2025-05-29 23:14:50","author":"Editor,Isabel Baldwin","authors":["Editor","Isabel Baldwin"],"language":"en","source_country":"gb","sentiment":-0.167}]}