{"offset":0,"number":50,"available":6202,"news":[{"id":258702782,"title":"Biden sends more troops to North Carolina for continued Hurricane Helene response","text":"President Biden approved the mobilization of another 500 active-duty troops to North Carolina to assist in the recovery efforts after the deadly and devastating Hurricane Helene.\n\n“With a total of 1,500 troops now supplementing a robust on-the-ground effort – including more than 6,100 National Guardsmen and more than 7,000 Federal personnel – the Biden-Harris Administration is mobilizing all relevant resources to support families as they begin their road to rebuilding,” the White House said in a statement Sunday.\n\nMr. Biden previously announced that the federal government would cover “100%” of costs for debris removal and emergency protective measures in North Carolina for six months. The Biden administration has also released more than $137 million in federal funds – including $100 million in transportation funds for North Carolina to begin rebuilding damaged roads and bridges.\n\nMore than 800 people unable to return home are staying in lodging provided through FEMA, and 22 shelters are still housing nearly 1,000 people as mobile feeding operations continue to help survivors.\n\n“My Administration is sparing no resource to support families as they begin their road to rebuilding,” Biden said. “We will continue working hand-in-hand with local and state leaders – regardless of political party and no matter how long it takes.”\n\nEarlier Sunday, North Carolina Sen. Thom Tills called for more resources to bolster the relief effort and likened the damage to Hurricane Katrina’s mark on Louisiana in 2005.\n\n“The scope of this storm is more like Katrina,” he told CBS News’ Margaret Brennan on “Face the Nation with Margaret Brennan”. “It may look like a flood to the outside observer, but again, this is a landmass roughly the size of the state of Massachusetts, with damage distributed throughout. We have to get maximum resources on the ground immediately to finish rescue operations.”\n\nMr. Biden, Vice President Kamala Harris and former President Donald Trump have all traveled to some of the impacted regions. \n\nHurricane Helene caused catastrophic damage from Florida into the Appalachian mountains and killed more than 225 people across multiple states. That number includes 114 killed in North Carolina alone.\n\nThe White House said Mr. Biden has also been briefed on Hurricane Milton, which is forecast to make landfall in Florida’s Tampa Bay area as a major storm on Wednesday.\n\nU.S. disaster relief chief blasts false claims about Helene response\n\nDeanne Criswell, who leads the Federal Emergency Management Agency, said on Sunday that the recent false claims and conspiracy theories about the federal response to the storm are “demoralizing” aid workers.\n\n“It’s frankly ridiculous, and just plain false. This kind of rhetoric is not helpful to people,” she said. “It’s really a shame that we’re putting politics ahead of helping people, and that’s what we’re here to do. We have had the complete support of the state,” she said, referring to North Carolina.\n\nRepublicans, led by Trump, have helped foster a frenzy of misinformation over the past week among the communities most devastated by Helene, promoting a number of false claims, including that Washington is intentionally withholding aid to people in Republican areas.\n\nTrump accused FEMA of spending all its money to help immigrants who are in the United States illegally, while other critics assert that the government spends too much on Israel, Ukraine and other foreign countries.\n\nTillis, a Republican, on Sunday rejected that claim, telling “Face the Nation with Margaret Brennan” that resources being used on immigration is “not yet … affecting the flow of resources to western North Carolina.”\n\nTillis said the stream of misinformation about relief efforts in North Carolina is a “distraction.”\n\n“I believe that we have to stay focused on rescue operations, recovery operations, clearing operations, and we don’t need any of these distractions on the ground,” Tillis said. “It’s at the expense of hard-working first responders and people that are just trying to recover their lives.”\n\nMr. Biden said in a statement Sunday that his administration “will continue working hand-in-hand with local and state leaders –- regardless of political party and no matter how long it takes.”","summary":"President Biden approved the mobilization of another 500 active-duty troops to North Carolina to assist in the recovery efforts after the deadly and devastating Hurricane Helene. &#8220;With a total of 1,500 troops now supplementing a robust on-the-ground effort – including more than 6,100 National Guardsmen and more than 7,000 Federal personnel – the Biden-Harris Administration &#8230;\n\n\nThe post Biden sends more troops to North Carolina for continued Hurricane Helene response appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/biden-sends-more-troops-to-north-carolina-for-continued-hurricane-helene-response/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/06/86dc5682-fed8-4856-9df5-f72f4a9a60b3/thumbnail/1200x630/0bc53609239657f92e8551d36b43f380/ap24276625450365.jpg?v=0736ad3ef1e9ddfe1218648fe91d6c9b","video":null,"publish_date":"2024-10-07 00:05:11","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","source_country":"us","sentiment":-0.266},{"id":258702418,"title":"Trump Reiterates He Wants to Be a ‘Dictator’ for ‘One Day’ at Wisconsin Rally","text":"Donald Trump held a rally for the second time in as many days, this time in Juneau, Wisconsin, on Sunday following his return to Butler, Pennsylvania, on Saturday. It was his fourth event in Wisconsin in eight days, signifying the swing state’s importance as we inch closer to Election Day.\n\n Trump didn’t venture far from his typical tropes on Sunday: he fear-mongered about migrants (“the horrible people that we’re allowing into our country that are destroying our country,” he claimed of migrants, saying the issue was the most important of this election); claimed that if he loses, the U.S. is over (“If we lose this election, this country’s finished,” he claimed); kept up his obsession with crowd sizes; and he also inexplicably decided to revisit his unhinged admission that he wants to be dictator for one day.\n\n “So I have to be careful with this,” Trump said. “I said once about a month ago, you only have to vote this one time, and after that, everything would be good,” he claimed on Sunday. What he appeared to be referring to was his statement in July, when he claimed during a Florida event summit that if he was elected for a second time, “you don’t have to vote again. We’ll have it fixed so good, you’re not gonna have to vote.”\n\n “And the fake news said, ‘See, he wants to be a dictator and take over the country.’ No, no, that’s not what I said,” he said Sunday, in an apparent attempt to tamp down concerns that he wants to be a dictator. “We got to fix the country. Got to make sure, and then the country will be great, and we’re going to have, hopefully, some great person, whether it’s J.D. or somebody else.”\n\n However, Trump then brought up Sean Hannity asking about his seeming aspirations to be a dictator, and explained it thusly: “’You don’t want to be a dictator, do you?’” he said Hannity asked him. “I said, ‘Sean, I only want to be a dictator for one day, and I’m going to close the borders and drill, baby drill. But after that, I never want to be a dictator.’”\n\n The former president claimed the media had wrongfully clipped short his comments about wanting to be a dictator, to remove the distinction that he only wants to be a dictator for one day. “The fake news took that answer and they said, ‘Sean, I want to be a dictator.’ Clip. Cut,” he said, adding: “These are the worst people.”\n\n So… nothing to worry about, then. Relatedly, Trump also recently fantasized about giving police one “really violent day” to crack down on retail crime.\n\n Wisconsin is an important battleground state in the presidential election and typically sees tight races, but Republicans have only taken the state once in the last four decades, which was when Hillary Clinton ignored the state and Trump won it in 2016.\n\n Trump will appear next in Scranton, Pennsylvania, for a pair of events on Wednesday. His running mate J.D. Vance will deliver remarks in Detroit on Tuesday.","summary":"It’s the GOP presidential nominee’s fourth event in Wisconsin in eight days","url":"https://www.rollingstone.com/politics/politics-news/trump-reiterates-dictator-for-one-day-wisconsin-rally-1235127435/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/DonaldTrump-1.jpg","video":null,"publish_date":"2024-10-06 23:43:39","author":"Althea Legaspi","authors":["Althea Legaspi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.486},{"id":258702660,"title":"Adam Schiff says Trump has ‘more reason’ to challenge election results in 2024","text":"Trump has claimed numerous times since leaving the White House that he did not lose the 2020 presidential election against then-presidential candidate Joe Biden, with Schiff predicting a similar response from Trump should he lose the 2024 election against Vice President Kamala Harris. Ahead of the election next month, the former president has been in several legal battles while on the campaign trail, which Schiff referenced when predicting Trump’s potential objection to the 2024 election results.\n\n“He has more reason to contest it than he did before, not because of any flaw in the election, but because Donald Trump believes, and perhaps with reason, that if he doesn’t succeed at the ballot box, he may be going to jail,” Schiff said on NBC’s Meet the Press. “So he’s going to challenge the results, and we saw tragically what happened when he did that four years earlier. And what’s more, we see him laying the same foundation to fraudulently challenge the results once again, putting up the same big lies that he put out four years earlier.”\n\nSchiff was one of many Democrats who called on Biden to suspend his reelection campaign following the first presidential debate and also suggested Harris could win “overwhelmingly” against Trump. When asked if he still believes this to be the case, he argued Harris can still claim victory, though the race is currently “scary close.”\n\nEarlier this month, a key filing from special counsel Jack Smith was unsealed by U.S. District Judge Tanya Chutkan, in which prosecutors claim that Trump responded “so what” when he was told then-Vice President Mike Pence was in danger on Jan. 6, 2021. Schiff argued the timing of this filing’s unsealing was appropriate about a month ahead of the 2024 election, as the Supreme Court dragged its feet on deciding whether former presidents have any immunity.\n\nSchiff was then pushed on why he supports the timing of Smith’s filing getting unsealed when he was previously critical of FBI Director James Comey for reopening the investigation into presidential candidate Hillary Clinton’s emails shortly before the 2016 election. The California congressman defended his stance, as Comey “unilaterally” deciding to investigate Clinton was “a very different circumstance” compared to Smith’s filing getting unsealed.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nLegal analyst Jonathan Turley cautioned that the timing of this filing could “backfire” on the case’s prosecutors. He also said Smith’s briefing was an attempt to make “his closing election argument to voters because he knows that the 2024 election will be the largest jury verdict in history.” \n\nTrump argued on Thursday that the federal charges related to his alleged efforts to interfere with the 2020 election should be dismissed, citing the Supreme Court’s ruling on Jan. 6 rioter Joseph Fischer. The rioter’s conviction under an obstruction statute was overturned by the Supreme Court, with Trump’s legal team arguing the same statute is misapplied in Smith’s federal case against the former president.","summary":"Rep. Adam Schiff (D-CA) argued that former President Donald Trump has “more reason” to challenge the results of this election cycle than in 2020, specifically due to how the former president faces potential jail time. Trump has claimed numerous times since leaving the White House that he did not lose the 2020 presidential election against [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3178935/schiff-trump-more-reason-to-challenge-election-results-2024/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Schiff-scaled.webp","video":null,"publish_date":"2024-10-06 23:43:23","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.386},{"id":258702370,"title":"Trump rallies at site of failed assassination, vows to ‘never quit’","text":"In a much-hyped return to the site of an assassination attempt, Republican presidential candidate Donald Trump on Saturday told supporters he would never be silenced. At the rally in Butler, Pennsylvania, Trump lashed out at his opponents, calling them “the enemy within” while billionaire Elon Musk told the crowd a Trump win was necessary to “preserve democracy in America”.\n\nDonald Trump defiantly returned Saturday to the site of a campaign rally where an assassin’s bullet almost killed him in July, questioning whether his opponents were responsible and declaring he would “never quit.”\n\n“Exactly 12 weeks ago this evening, on this very ground, a cold-blooded assassin aimed to silence me,” the Republican candidate told tens of thousands of supporters after taking the stage behind bulletproof glass.\n\nCalling the gunman a “vicious monster,” Trump vowed he would “never quit… never bend… never break” to cheers of “fight, fight, fight” from the crowd.\n\nTrump’s much-hyped return to Butler, Pennsylvania, came exactly one month before the November 5 presidential election, the outcome of which President Joe Biden suggested on Friday might not be peaceful.\n\nTrump lashed out at his political opponents, calling them the “enemy within” who had pushed to indict him and “who knows, maybe even tried to kill me.”\n\n“I wasn’t supposed to make it,” he said ominously.\n\nSecurity was noticeably tighter than Trump’s July rally, with sniper squads atop surrounding buildings, and a surveillance drone deployed overhead.\n\n“There’s a lot going on that’s unnerving,” said Heather Hughes, 43, who had traveled from New Castle in must-win Pennsylvania.\n\n“Do I think he’s safe? No, I think there’s going to be another attempt. But I think he’s going to make it through.”\n\nAfter the assassination attempt, pictures of Trump — with a blood-streaked face, pumping his fist and shouting “fight, fight, fight” — became defining images of the campaign.\n\nOn Saturday, many Trump supporters wore shirts emblazoned with the iconography, and some sported ear coverings recalling the bandage the former president wore after the shooting.\n\nBillionaire Elon Musk joined Trump on stage, stressing the tight margins that will likely decide the election in battleground states like Pennsylvania and encouraging voter registration.\n\nTrump “must win to preserve democracy in America,” said Musk, echoing the alarmist messaging he frequently pushes to his 200 million followers on his X platform.\n\nRace upended\n\nMuch has changed since Trump’s last visit to Butler, when he was riding high in polls after crushing Biden in a TV debate.\n\nBarely a week after the failed assassination bid, the presidential race was turned on its head when Biden dropped out and was replaced as the Democratic nominee by Vice President Kamala Harris.\n\nHarris has clawed back the poll deficit — reversing it in some states — and the seismic events in Butler that had threatened to unleash chaos were largely overtaken.\n\nTrump’s rally appeared aimed at recovering the momentum as a bruising campaign enters its final phase.\n\nHarris, who Trump called incompetent, was in North Carolina Saturday meeting first responders and people hit by Hurricane Helene, which killed at least 220 as it ripped through the southeast.\n\nThe emergency response is “an example of the best we can do when we bring resources together at the federal, state and local level and tap into the kind of collegiality that produces results,” she told officials at a briefing.\n\nTrump has criticized the federal response, alleging without evidence that the Biden-Harris administration wrongly redirected relief funds to migrants.","summary":"In a much-hyped return to the site of an assassination attempt, Republican presidential candidate Donald Trump on Saturday told supporters he would never be silenced. At the rally in Butler, Pennsylvania, Trump lashed out at his opponents, calling them “the enemy within” while billionaire Elon Musk told the crowd a Trump win was necessary to [&#8230;]","url":"https://dailytimes.com.pk/1232425/trump-rallies-at-site-of-failed-assassination-vows-to-never-quit/","image":"https://dailytimes.com.pk/assets/uploads/2024/10/Lead-3.jpg","video":null,"publish_date":"2024-10-06 23:41:45","author":"Sajid Salamat,Vice President Kamala","authors":["Sajid Salamat","Vice President Kamala"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.093},{"id":258702038,"title":"Taylor Swift declines reality show to maintain privacy in friendships.","text":"Back in the day, pop icon Taylor Swift would commonly be surrounded by a glamorous group of friends. The 34-year-old singer was commonly seen with several celebrities by her side, and her girl gang would often be seen celebrating holidays and special occasions at a soiree thrown by Swift, herself.\n\nIn the last several years, the “The Last Great American Dynasty” singer has largely been seen with her pals while supporting her football superstar boyfriend, Travis Kelce, in the VIP suites of his football games.\n\nThere is the occasional exception, such as when she was spotted strutting down the street with the HAIM sisters, following her split with actor and beau of six years, Joe Alwyn.\n\nArticle continues below advertisement\n\nSwift has also been spotted having the occasional dinner with longtime friend and record producer, Jack Antonoff. Why does it seem like fans can count the “loml” songstress’ friendship outings on one hand?\n\nArticle continues below advertisement\n\nBeing one of the biggest superstars in the world comes with great responsibility. Swift has her blockbuster ‘Eras Tour’ to think about, she’s seemingly always crafting new music, and of course, she has her private life with her football guy.\n\nWith her packed schedule, witnessing the “Maroon” singer out in public is a rare occasion. So much so that the reception to Swift’s emergence can get out of hand, such as last Summer’s pandemonium at Antonoff and now-wife Margaret Qualley‘s wedding rehearsal dinner.\n\nOnlookers swarmed the rehearsal dinner’s location with many filming Swift as she left the restaurant. Footage of her exit later made it to social media, as The Blast previously reported.\n\nArticle continues below advertisement\n\nThe “Peter” singer reportedly had a “visible reaction” to the chaos going on around her but remained composed and smiling for and endless stream of cameras.\n\nAs a result, Swifties pleaded for the singer to be allowed privacy on social media. The conversation would later inspire the X hashtag, “leave her alone.”\n\nOne particular Swiftie had this to say regarding the public’s response to the “Exile” singer:\n\nArticle continues below advertisement\n\n“Every single person there taking pictures, swarming the restaurant, and peeking inside aren’t fans. It’s disgusting and a huge invasion of privacy. She was at her best friends f**ing wedding. LEAVE HER ALONE. She deserves it. Stop being an insecure person that you have to get out your phone just for the attention or go to a restaurant and swarm it forcing her to leave. It’s so rude and just because she is a star doesn’t mean she doesn’t deserve privacy. She deserves every second of it. I can’t even believe this happened and all these ‘fans’ should reflect on their life and how they conduct themselves. I love you Taylor and you absolutely shouldn’t have had to leave Jacks wedding because of these people,” one Swiftie wrote in the comments of an Instagram photo.\n\nArticle continues below advertisement\n\nMore than a year after the aforementioned incident at Antonoff’s wedding, the singer is seemingly doing all she can to make sure her friendships are staying private, even if it means saying ‘no.’\n\nThe twosome’s friendship has recently been brought up in connection with reality television; reports surrounding a TV plot about the women behind the Kansas City Chiefs previously questioned whether the blossoming buddies would be involved, and the answer could disappoint some Bravo fans.\n\nBravo reality series may be a good way for reality TV devotees to get the inside scoop on their favorite reality stars’ topsy-turvy friendships but don’t count on Swift to bring cameras into her private moments with her pals.\n\nFollowing the reports suggesting that both Mahomes and the “Florida!!!” singer could be involved in the previously filmed Bravo plot, it has been revealed that both women are keeping themselves away from the cameras.\n\nAccording to People, a source said, “Taylor and Brittany are not part of the show at all, and will not even be filmed.” The insider also shared the “False God” singer’s reasoning for distancing herself from the project.\n\n“Taylor especially is very protective of what little private life she has left,” they added.\n\nArticle continues below advertisement\n\nSwift’s protectiveness for her friendships could be reflected in the source’s next tidbit of news.\n\n“She enjoys all the ladies she has met, but she will not be a part of Bravo’s storyline,” the source continued.\n\nAs one of the most followed (and arguably most scrutinized) celebrities in the world, it would make sense if Swift would like to keep the public away from her friendships in order to minimize the negative chatter.\n\nAn X user noted, “I do find it disappointing that Taylor can’t drop Brittany. Like, why is she so loyal to this friendship of ten months.”\n\nArticle continues below advertisement\n\nAnother chimed in, “Taylor Swift, an assault victim, is endorsing a sexual predator for president by being with Brittany. Taylor Swift is endorsing racism, transphobia, and bigotry. Actions speak louder than words and she has just endorsed Donald Trump for president,” Swift later publicly endorsed Vice President Kamala Harris and Minnesota Governor Tim Walz in the 2024 Presidential election.\n\nUnrest over Swift’s endorsement of a candidate in the 2024 Presidential election was later put to rest.\n\nBoth Harris and Walz publicly acknowledged and thanked the “Only The Young” singer for her endorsement. The current Vice President called out Swift’s “Courage” for her public declaration, and Governer Walz did as well, as previously reported by The Blast.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBack in the day, pop icon Taylor Swift would commonly be surrounded&#8230;\n\n\nThis Post: Taylor Swift declines reality show to maintain privacy in friendships. first appeared on Internewscast Journal","url":"https://internewscast.com/entertainment/taylor-swift-declines-reality-show-to-maintain-privacy-in-friendships/","image":"https://theblast.prod.media.wordpress.mattersmedia.io/brand-img/123/0x0/2024/09/11104527/taylor-swift-brittany-mahomes-scaled.jpg?","video":null,"publish_date":"2024-10-06 23:37:08","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.306},{"id":258702036,"title":"“Key Allegations Revealed in Jack Smith’s Recent Court Filing Against Donald Trump in Alleged 2020 Election Fraud”","text":"Special Counsel Jack Smith submitted a new filing against Donald Trump on Wednesday as part of his allegedly fraudulent activity in the 2020 election. \n\nThe case against Trump – who resided in the White House between 2017 and 2021 – accuses him of conspiring to overturn his 2020 election defeat to Joe Biden.\n\nProsecutors allege that he pressured officials to reverse the results and knowingly spread lies about election fraud while using the events of 6 January 2021 – when a riot occurred in the Capitol – in an attempt to stay in power. \n\nTrump has responded by repeating false claims that the 2020 vote was ‘rigged’, while suggesting that the timing of the filing’s release was designed to hurt his 2024 presidential campaign.\n\nFollowing the filing, MailOnline takes a look at some of the key claims that emerged from the evidence given by Smith. \n\nTrump planned to stay in power no matter what \n\nSmith described a number of conversations which claim that the then-President knew his claims of election fraud were not genuine\n\nHe also gave evidence that Trump’s sole objective was to stay in power, which included the quote: ‘ [It doesn’t matter if you won or lost you have to fight like hell!’\n\nIt was heard that one witness was aware of a private conversation that the former President had with his family aboard Marine One – the helicopter used by US presidents in which to travel – when he made the remark. \n\nTrump showed no concern for VP Mike Pence’s safety \n\nThe filing also points to Trump’s apparent lack of concern for the safety of his Vice President, Mike Pence. \n\nTuring the Capitol riots, which took place on January 6 2021, after an aide told him of that Pence had been forced to flee to a safe location, Trump said ‘So what?’ \n\nDespite the gravity of the situation at the time, Trump was claimed to be nonplussed by the events unfolding around him. \n\nFormer President was alone with his phone in the White House dining room while Capitol was breached\n\nAnother claim from the hearing that accuses Trump of not doing enough to stem the chaos is that he was said to have been sat alone in the White House dining room. \n\nIt is said that he was in the dining room ‘where he used his phone to review Twitter and watched television’ of the chaos that ensued in the Capitol. \n\nThis claim is backed up by forensic evidence collected by the FBI, which mapped out his iPhone and described Trump being on his phone ‘throughout the afternoon of January 6’ across various ‘news and social media applications.’\n\nTrump campaign employee said ‘make them riot’ \n\nThe filing also details the actions of an unidentified Trump campaign employee who was said to have been enthused by the potential for a riot to occur in Michigan prior to the Capitol riots on January 6 2021. \n\nThe employee was described by prosecutors as a co-conspirator and was allegedly seeking to ‘create chaos’ at a polling center in Detroit – after it became apparent that a batch of election returns favorable to Biden was legitimate. \n\n‘Find a reason it isn’t,’ the alleged co-conspirator said to a colleague, prosecutors wrote. \n\nWhen the colleague said an outbreak of violence appeared imminent, the campaign employee replied: ‘Make them riot’ and ‘Do it!!!’\n\nTrump willingly ‘spread lies of election fraud’ \n\nA further bombshell claim to have emerged from Smith’s filing is that Trump is alleged to have fired his attorneys after the 2020 election because his replacement would willingly ‘spread knowingly false claims of election fraud’. \n\nProsecutors claim that Trump fired his previous attorney after the 2020 election – on November 13 2020, after the lawyer and Trump’s staff told him he had a ‘slim chance’ of winning the election. \n\nIn response, Trump fired his attorney and hired an unnamed co-conspirator – believed to be Rudy Giuliani – to head up his legal team. \n\nSmith also claimed that Trump only hired Giuliani because he ‘was willing to falsely claim victory’.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSpecial Counsel Jack Smith submitted a new filing against Donald Trump on Wednesday as&#8230;\n\n\nThis Post: &#8220;Key Allegations Revealed in Jack Smith&#8217;s Recent Court Filing Against Donald Trump in Alleged 2020 Election Fraud&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/politics/key-allegations-revealed-in-jack-smiths-recent-court-filing-against-donald-trump-in-alleged-2020-election-fraud/","image":"https://i.dailymail.co.uk/1s/2024/10/03/13/90411213-13920339-image-a-28_1727957365044.jpg","video":null,"publish_date":"2024-10-06 23:35:04","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.213},{"id":258701924,"title":"Donald Trump didn't want this film released before the US election. Here's why","text":"Around the time Ali Abassi was first offered Donald Trump biopic The Apprentice in 2018, the Iranian-born Danish director couldn't actually enter the US due to Trump's infamous travel ban.\n\nAfter jumping through numerous hoops, Abassi was granted entry… temporarily.\n\n\"I thought it was quite funny having gone through all this, and I was saying, 'If I leave the country, I can't get in again',\" Abassi told The Screen Show's Jason Di Rosso.\n\n\"So maybe I can do this on Zoom. The first feature directed from Zoom.\"\n\nThe Apprentice is the semi-biographical story of Donald Trump's ascension through New York's real estate scene in the 80s, and his relationship with lawyer/mentor Roy Cohn. Since its premiere at Cannes in May, it has been a lightning rod for controversy.\n\nWith an election looming, Team Trump has called the film everything from \"pure fiction\" to \"election interference\", even going as far as to threaten a defamation lawsuit.\n\nBut after a months-long struggle to find distribution, The Apprentice will hit cinemas worldwide this week.\n\nHere's what you need to know.\n\nWhat is The Apprentice about?\n\nDespite being named for the reality show that made Trump a Hollywood name, The Apprentice picks up in the early 80s when Donald (Sebastian Stan) was trying to break into the NYC real estate market.\n\nThe film chronicles Trump's relationship with the controversial Cohn (Jeremy Strong), who would eventually become the younger businessman's mentor.\n\nWhile the film has stirred up controversy in the political world, Abassi refutes the assumption that his film is a Trump hit piece.\n\n\"When I actually read the script, I realised that this is a script that's trying to understand Donald Trump as a human being,\" he says.\n\n\"[It's] trying to understand him as an ambitious young guy: his ascent; his way up in New York real estate; and how he became the person he is through that very formative relationship with Roy Cohn.\"\n\nWho was Roy Cohn?\n\nRoy Cohn was a US lawyer and staunch anti-communist who rose to notoriety in the early 50s as a US prosecutor during the trial of Julius and Ethel Rosenberg, who were found guilty of spying on the US for the Soviet Union and executed.\n\nHe then became chief counsel to Republican senator Joseph McCarthy, with both men becoming main players in the \"Lavender Scare\" — pushing gay people out of their government jobs under the guise of protecting the US from communism.\n\nIn 1953, Cohn and McCarthy were accused of pressuring the US Army to give preferential treatment to a former aide of McCarthy and friend of Cohn, David Schine. During the televised inquiry hearings, it was implied that Cohn and Schine had engaged in a romantic relationship, which both parties denied.\n\nFollowing the hearings, Cohn returned to New York to practise law, representing high-profile clients such as Rupert Murdoch, then-Archbishop of New York Francis Spellman, Mob figures Carmine Galante and Tony \"Fat Tony\" Salerno.\n\nHow are Ray Cohn and Donald Trump connected?\n\nIn 1973, Cohn represented a 27-year-old Donald Trump and his father, Fred.\n\nThe Trumps had caught heat from the US Government for allegedly refusing to rent to tenants of colour in 39 of the 14,000 New York apartments their company owned.\n\nCalling the accusations \"irresponsible and baseless\", Cohn and Trump turned around and filed a $US100 million (roughly $US700 million today) countersuit against the US government.\n\nIt was another two years before Trump reached an agreement with the US government to \"not discriminate against blacks, Puerto Ricans and other minorities\". Trump Management made sure to clarify that the agreement was not an admission of guilt.\n\nTrump and Cohn remained extremely close throughout the late 1970s and early 80s, with Cohn saying that Trump was his \"best friend\" whom he called \"15-20 times a day\".\n\nAbassi says he sought to show the closeness of Trump and Cohn's relationship in The Apprentice.\n\n\"I definitely think that there was some sexual tension in the beginning because Trump would fit Roy's type perfectly. His type was young, tall, blond, Aryan-looking guys,\" Abassi says.\n\n\"But I also think that Roy probably saw his relentlessness and his willingness. As they say, when the student is ready, a teacher appears. I think that was the case with these guys.\"\n\nBy 1986, Cohn's questionable legal practises had caught up with him — he was disbarred by a New York court for, among other things, forcing a dying client to appoint himself executor of his estate.\n\nJust weeks later, Cohn died from AIDS-related complications at 59 years old. He vehemently denied rumours of his homosexuality right up until his death, insisting that liver cancer was the illness causing his demise.\n\n\"Roy Cohn was not gay,\" fellow close friend Roger Stone said in a 2008 New Yorker profile.\n\n\"He was a man who liked having sex with men. Gays were weak, effeminate. He always seemed to have these young blond boys around. It just wasn't discussed.\"\n\nWhy did Donald Trump try to stop the film being released?\n\nAside from closely detailing Trump's relationship with Cohn, The Apprentice includes a scene that features Trump raping his then-wife Ivanka (Maria Bakalova), something she accused him of in her early 1990s divorce deposition.\n\nShe later clarified that she didn't mean it literally, but rather that she felt violated by Trump.\n\nScenes such as this, as well as Abassi's desire to release the film before the November 5 US presidential election, quickly caught the ire of Team Trump.\n\nDays after The Apprentice premiered at the Cannes Film Festival, Trump campaign spokesperson Steven Cheung released a statement saying they intended to file a lawsuit to stop the film from being released.\n\n\"This garbage is pure fiction which sensationalises lies that have been long debunked,\" Cheung said.\n\nThe threatened lawsuit never materialised but the threats saw the film struggle for months to find a US distributor, despite landing eager distributors in the UK and Australia.\n\nAt the end of August, it was announced that independent studio Briarcliff Entertainment had picked up the film for US and Canadian release on October 11.\n\nIn response, Cheung said the film's release was \"election interference by Hollywood elites right before November\" and that it \"belongs in a dumpster fire\".\n\nAbassi has consistently defended his film; he even offered to screen it privately for Trump, saying he might not hate it as much as he thinks.\n\n\"This is a very classic story of master and protégé, you can also call it a Frankenstein story,\" he says.\n\n\"But it's not really dependent on and it's not really about the person who was in the White House.\"\n\nWhat are reviews saying?\n\nThe Apprentice enjoyed a warm reception out of Cannes, with critics in particular praising the key performances from Stan and Strong.\n\n\"Strong does a magnetic impersonation of Roy Cohn, who turned bullying into a form of cutthroat vaudeville (and a new way to practise law), putting his scoundrel soul right out there, busting chops and balls with his misanthropic, Jewish-outsider, locker-room wit. He's not just cutting, he's nasty,\" Variety's Owen Gleiberman said.\n\n\"The most chilling effect of The Apprentice: the way it makes even a duplicitous manipulator and big-time hypocrite like Roy Cohn seem, at least in the end, believably sympathetic,\" Time's Stephanie Zacharek agreed.\n\n\"Strong is terrific at capturing Cohn's deadpan sharpness.\"\n\nBut not all critics had praise for the film; The Guardian's Peter Bradshaw gave it two stars, calling it a “lenient TV movie”.\n\n\"The Apprentice worryingly moves us back to the old Donald, the joke Donald who had a cameo in Home Alone 2 and of course his own hit TV show, the joke that is now beyond unfunny. It feels obtuse and irrelevant.\"","summary":"The Apprentice tells the story of Donald Trump and late mentor Roy Cohn as the former US president climbed to the top of the real estate ladder in 1980s New York City.","url":"https://www.abc.net.au/news/2024-10-07/donald-trump-the-apprentice-ali-abassi-roy-cohn/104432618","image":"https://live-production.wcms.abc-cdn.net.au/8ccbb198aba80336c85fe3f59b5c4d6e?impolicy=wcms_crop_resize&cropH=1823&cropW=3240&xPos=0&yPos=169&width=862&height=485","video":null,"publish_date":"2024-10-06 23:33:00","author":"Velvet Winter","authors":["Velvet Winter"],"language":"en","category":"politics","source_country":"AU","sentiment":0.021},{"id":258701884,"title":"Could NZ foreign policy be Trumped? Why the government will be hoping Kamala Harris wins the US election","text":"Getty Images\n\nOne of the political ironies of the race for the White House is that the foreign policy interests of New Zealand’s centre-right government are probably best served by Democratic candidate Kamala Harris winning.\n\nSince the end of World War II, all New Zealand governments have supported multilateralism and an international rules-based order enshrined in the institutions of the United Nations.\n\nThe relationship with the United States has reflected that, and tends to outlast the periodic fluctuations associated with changes in government and policy in Wellington or Washington.\n\nNew Zealand’s current National-led coalition inherited close relations with the US, too. American visitor numbers were second only to Australians last year. The US is our third largest export market. And the two countries remain strategically linked within the Five Eyes intelligence sharing arrangement.\n\nNevertheless, one of the key foreign policy goals of the coalition is to strengthen alignment with traditional allies such as the US. Given the very different worldviews of Kamala Harris and Donald Trump, the November 5 election will have a large bearing on how successful any push for closer relations with the US can be.\n\nCloser relations in the balance\n\nOn the one hand, Republican candidate Trump is opposed to multilateral institutions, unless they explicitly serve US national interests. And he wants to reverse the impact of globalisation by constraining immigration, free trade and global governance.\n\nNationalist slogans like “America First” promise a return to a so-called golden era of patriotism and sovereignty: a top-down world where the greatest power of all is unencumbered and free to assert its dominance.\n\nOn the other hand, Harris would seem to support a more traditional US foreign policy agenda. This recognises the importance of international institutions and alliances in a world where “isolation is not insulation”.\n\nWhoever occupies the White House next, then, is likely to have a significant impact on New Zealand foreign policy.\n\nIsolation and dominance: Trump plays the immigration card at Republican National Convention in July 18.\n\nGetty Images\n\nPower plays and the Pacific\n\nFirst, Trump’s belief in an international system run by great powers would seem to be a recipe for depriving smaller states like New Zealand of a voice on international issues that affect them.\n\nSecond, New Zealand’s regional focus on ties with Pacific Island nations – underpinned by close people-to-people links and a significant proportion of the country’s overseas development aid programme – is more likely to be complemented by a Harris foreign policy.\n\nOutgoing president Joe Biden reversed decades of US neglect of much of the Pacific, which had played to the advantage of other external powers – notably China.\n\nThe Biden team launched the annual US-Pacific Islands Summit in 2022. And Kamala Harris played an active role in delivering US$800 million in development and climate assistance to Pacific Island nations in 2022-23.\n\nWhether Trump will maintain this enhanced diplomatic and economic engagement in the Pacific (and elsewhere) is questionable. Similarly, after Biden rejoined the Paris Climate Accord, Trump will probably quit it for a second time.\n\nKamala Harris hosts Ukraine’s Volodymyr Zelenskyy at the White House in September.\n\nGetty Images\n\nAUKUS and Ukraine\n\nThird, the New Zealand government faces the delicate task of navigating relations with an increasingly assertive China – the country’s biggest trade partner – while pursuing its goal of moving closer to the US.\n\nSince March 2023, successive New Zealand governments have been considering joining an arrangement to share advanced defence technologies under pillar two of the AUKUS security partnership that aims to deter a rising China in the Indo-Pacific region.\n\nIt remains to be seen how China would react if New Zealand did join. But Trump’s insistence on US primacy in any multilateral agreement could make it more difficult for the government to win domestic support for pillar two membership.\n\nEven outside the AUKUS debate, Trump is more likely to insist allies spend more on defence than they did traditionally.\n\nFourth, New Zealand has a big stake in the failure of Russia’s attempted annexation of Ukraine. Wellington’s interests are clearly more in line with Harris’ pledge to maintain support for Ukraine to restore its territorial integrity.\n\nTrump’s promise to end the war within 24 hours, on the other hand, could probably only be achieved by giving Vladimir Putin what he wants.\n\nThe Middle East and the UN\n\nFinally, there do not seem to be substantive policy differences between Trump and Harris on the catastrophic situation in Gaza, and increasingly Lebanon.\n\nThere remains a slim possibility a Harris administration might recognise unconditional support for the Israeli government of Benjamin Netanyahu is not sustainable for a superpower whose foreign policy is supposed to be driven by universal values and respect for international law.\n\nBut this would be near impossible for Trump. Indeed, he would probably provide Netanyahu with even greater support.\n\nOverall, the foreign policy interests of the National-led coalition seem to align more with a Harris presidency than one led by Trump.\n\nBut even if Harris wins, the alignment of interests will not be perfect. US exceptionalism – an informal ideology that claims the nation is a political exemplar for the rest of the world – and Washington’s veto power in the UN security Council are likely to remain constraining factors on the New Zealand-US relationship.\n\nThe authors do not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and have disclosed no relevant affiliations beyond their academic appointment.","summary":"The government’s push for closer relations with the US could be undone by a Trump victory in November.","url":"https://nation.lk/online/could-nz-foreign-policy-be-trumped-why-the-government-will-be-hoping-kamala-harris-wins-the-us-election-279381.html","image":"https://images.theconversation.com/files/623717/original/file-20241005-15-xjz2mq.jpg?ixlib=rb-4.1.0&rect=40%2C24%2C5351%2C3564&q=45&auto=format&w=496&fit=clip","video":null,"publish_date":"2024-10-06 23:30:24","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":0.222},{"id":258701722,"title":"S&P 500’s $8 trillion rally will be tested by tricky earnings season","text":"The S&P 500 Index has soared roughly 20% in 2024, adding more than $8 trillion to its market capitalization. The gains have largely been driven by expectations of easing monetary policy and resilient profit outlooks. \n\nBut the tide may be turning as analysts slice their expectations for third-quarter results. Companies in the S&P 500 are expected to report a 4.7% increase in quarterly earnings from a year ago, according to data compiled by Bloomberg Intelligence. That’s down from projections of 7.9% on July 12, and it would represent the weakest increase in four quarters, BI data show.\n\n“The earnings season will be more important than normal this time,” said Adam Parker, founder of Trivariate Research. “We need concrete data from corporates.“ \n\nIn particular, investors are eager to see if companies are postponing spending, if demand has slowed, and if customers are behaving differently due to geopolitical risk and macro uncertainty, Parker said. “It is exactly because there is a lot going on in the world that corporate earnings and guidance will particularly matter now,” he said.\n\nReports from major companies start arriving this week, with results from Delta Air Lines Inc. due Thursday and JPMorgan Chase & Co. and Wells Fargo & Co. scheduled for Friday. \n\n“Earnings seasons are typically positive for equities,” said Binky Chadha, chief US equity and global Strategist at Deutsche Bank Securities Inc. “But the strong rally and above-average positioning going in (to this earnings season) argue for a muted market reaction.”\n\nObstacles Abound \n\nThe obstacles facing investors right now are no secret. The US presidential election is just a month away with Democrat Kamala Harris and Republican Donald Trump in a tight, fierce race. The Federal Reserve has just started lowering interest rates, and while there’s optimism about an economic soft-landing, questions remain about how fast central bankers will reduce borrowing costs. And a deepening conflict in the Middle East is raising concerns about inflation heating up again, with the price of West Texas Intermediate oil rising 9% last week, the biggest weekly gain March 2023. \n\nRead more: Mideast War Risk Puts Spotlight on Iran’s Quiet Oil Comeback\n\n“The bottom line is that revisions and guidance are weak, indicating lingering concerns about the economy and reflecting some election year seasonality,” said Dennis DeBusschere of 22V Research. “That is helping set up reporting season as another uncertainty clearing event.”\n\nPlus, to make matters more challenging, big institutional investors have little buying power at the moment and seasonal market trends are soft.\n\nPositioning in trend-following systematic funds is now skewed to the downside, and options market positioning shows traders may not be ready to buy any dips. Commodity trading advisers, or CTAs, are expected to sell US stocks even if the market stays flat in the next month, according to data from Goldman Sachs Group Inc. And volatility control funds, which buy stocks when volatility drops, no longer have room to add exposure.\n\nHistory appears to side with the pessimists, too. Since 1945, when the S&P 500 gained 20% through the first nine months of the year, it posted a down October 70% of the time, data compiled by Bespoke Investment Research show. The index gained 21% this year through September.\n\nBar Lowered\n\nStill, there’s reason for optimism, specifically a lowered bar for earnings projections that leaves companies more room to beat expectations.\n\n“Estimates got a little bit too optimistic, and now they’re pulling back to more realistic levels,” said Ellen Hazen, chief market strategist at F.L.Putnam Investment Management. “It will definitely be easier to beat earnings because estimates are lower now.” \n\nIn fact, there’s plenty of data suggesting that US companies remain fundamentally resilient. A strengthening earnings cycle should continue to offset stubbornly weak economic signals, tipping the scales for equities in a positive direction, according to Bloomberg Intelligence. Even struggling small-cap stocks, which have lagged their large-cap peers this year, are expected to see improving margins, BI’s Michael Casper wrote.\n\nFriday’s jobs report, which showed the unemployment rate unexpectedly declined, quelled some concerns about a soft labor market. \n\nAnother factor is the Fed’s easing cycle, which has historically been a boon for US equities. Since 1971, the S&P 500 has posted an annualized return of 15% during periods in which the central bank cut rates, data compiled by Bloomberg Intelligence show. \n\nThose gains have been even stronger when rate-cutting cycles hit in non-recessionary periods. In those cases, large caps posted an averaged annualized return of 25% compared with 11% when there was a recession, while small caps gained 20% in non-recessionary periods compared with 17% when there was a recession.\n\n“Unless earnings are a major disappointment, I think the Fed will be a bigger influence over markets between now and year-end simply because earnings have been pretty consistent,” said Tom Essaye, founder and president of Sevens Report Research. “Investors expect that to continue.”","summary":"Companies in the S&#038;P 500 are expected to report a 4.7% increase in quarterly earnings from a year ago, the weakest increase in four quarters.","url":"https://fortune.com/2024/10/06/earnings-season-preview-q3-reports-sp500-stock-market-outlook/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/10/GettyImages-2176503298-e1728255630649.jpg","video":null,"publish_date":"2024-10-06 23:08:42","author":"Bloomberg,Esha Dey,Natalia Kniazhevich","authors":["Bloomberg","Esha Dey","Natalia Kniazhevich"],"language":"en","source_country":"US","sentiment":-0.011},{"id":258700232,"title":"Kamala Harris tells Call Her Daddy podcast what her mom taught her about ‘agency and autonomy’","text":"Kamala Harris attributed everything she knows about “agency” to her mom during her October 6 interview with popular podcast Call Her Daddy. \n\nThe vice president and Democratic presidential nominee joined podcast host Alex Cooper in Washington DC for an unfiltered interview where they talked about her upbringing as well as sexual assault, abortion rights, and criticisms against her.\n\nHarris discussed her childhood growing up with two divorced parents and being primarily raised by her mom, Shyamala Gopalan Harris. When asked by Cooper what “values” her mom “instilled” in her, she said she learned the importance of expressing her emotions. \n\n“My mother definitely impressed upon us the importance of being able to express how we were feeling,” Harris told Cooper.\n\n“And a lot of it, I think, was her teaching us that we had agency, and so, that things don’t just happen to you,” she said. “So, think about how you’re feeling, not just as a way to dump, but also as a way to kind of figure out where you are in a moment and center yourself.” \n\nThe former prosecutor explained how when she was in her late teens and early twenties, her mom wouldn’t accept that her problems weren’t in some way self-inflicted. \n\nShe noted: “I’m telling you, every time I came home with a problem, if I came home with a problem, the first thing that my mother would do is she would look at me ... My mother, the first thing (she would say), ‘What did you do.’”\n\nHarris believed other parents would coddle their children. This wasn’t the case in her household. \n\n“But here’s the thing that I realized, she was actually teaching me, ‘Think about where you had agency in that moment and think about what you had the choice to do or not do,’” she explained. \n\nShe said she learned how to “take charge of a moment.” \n\nHarris said she quickly learned that you can’t control every situation.\n\n“But don’t just let things happen to you without thinking about, ‘What can I do in this moment?’” she said.\n\nThe other lesson Harris’ mom taught her is not to do anything “half-a**ed.”\n\nWhen thinking about how she’s implemented her mother’s lessons in her political career, Harris said she focused on her desire to “protect the most vulnerable” and anyone who has had their “power” taken away from them. \n\nCooper also brought up comment from Arkansas Governor Sarah Huckabee Sanders, who said during a rally for Donald Trump that “doesn’t have anything keeping her humble” because she doesn’t have her own biological children.\n\nHarris is the stepmother to her husband Doug Emhoff’s two children, Ella and Cole.\n\n“There are a whole lot of women out here who, one, are not aspiring to be humble,” Harris said.\n\n“A whole lot of women out here who have a lot of love in their life, family in their life, and children in their life,” she said. “And I think it’s really important for women to lift each other up.” \n\nCall Her Daddy is streaming on Spotify.","summary":"Kamala Harris sat down with Alex Cooper for October 6 episode","url":"https://www.independent.co.uk/life-style/kamala-harris-call-her-daddy-podcast-b2624787.html","image":"https://static.independent.co.uk/2024/10/06/22/MixCollage-06-Oct-2024-05-46-PM-9769.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/FtjiLM5E-4VHSaSK0.mp4","publish_date":"2024-10-06 23:03:01","author":"Kaleigh Werner","authors":["Kaleigh Werner"],"language":"en","source_country":"gb","sentiment":0.09},{"id":258700398,"title":"Trump’s new Balmedie golf course to open next summer","text":"Trump International Scotland has announced its new Aberdeenshire golf course will open next year.\n\nThe new championship course is designed to complement the existing Balmedie Trump International Golf Links to create ‘The Greatest 36 Holes in Golf”.\n\nNamed in honour of his mother Mary, the MacLeod Course will sit adjacent to the first course which opened for play in 2012.\n\nIn a promotional video for the course uploaded last year, Donald Trump predicted that it will host “many, many championships” once opened.\n\nDue to open in the summer of 2025, bosses have billed the course “the most environmentally-friendly and sustainable ever built.”\n\nThe new course promises to weave together the largest sand dunes in Scotland alongside Balmedie’s heather and wetlands, with views over the North Sea.\n\nAmerican presidential nominee, Trump, has already invited golf legends John Daly and Paul McGinley to view the course last summer.\n\nNew Aberdeenshire course is ‘unlike anything else’\n\nSarah Malone, Executive Vice President of Trump International Scotland, who also oversaw the project, claims the course will be “one of the great wonders in golf”.\n\nShe said: “Since breaking ground with President Trump and Eric Trump last spring, we have made extraordinary progress.\n\n“This course is unlike any other links course ever built and is exceeding every expectation.”\n\nInvestment into the north-east ‘great to see’\n\nLegends Tour ambassador and Irish professional golfer Paul McGinley was invited to view the course last summer.\n\nHe said: “I had the pleasure of viewing the new site at Trump during construction whilst playing the Staysure PGA Championship at Trump International in the summer.\n\n“I have no doubt that the addition of this new golf course will provide not just a great golfing exam but also an aesthetic one with views of the North Sea from most holes.\n\nGolf legend John Daly added: “Trump Aberdeen’s new course is one of the most spectacular links courses you are ever going to find in the world.\n\n“It’s beautiful. I had the opportunity to see it first hand this year and can’t wait to return and play it.”\n\nRead more: Trump at Menie: The untold tales of intrigue, threats of violence and destroyed friendships","summary":"New images show coastal views and water features on the 18-hole development.","url":"https://www.pressandjournal.co.uk/fp/news/aberdeen-aberdeenshire/6598019/trump-new-aberdeenshire-golf-course/","image":"https://www.pressandjournal.co.uk/wp-content/uploads/sites/2/2024/10/Jon-Daly-nmo766n1-e1728223503929.jpg","video":null,"publish_date":"2024-10-06 23:01:30","author":"Graham Fleming","authors":["Graham Fleming"],"language":"en","category":"politics","source_country":"gb","sentiment":0.321},{"id":258700484,"title":"Trump’s new Scottish golf course to open next summer","text":"Former US president Donald Trump’s new links golf course in Aberdeenshire will open next summer, with bosses claiming the site will complement the existing course to offer the greatest 36 holes in golf.\n\nTrump International said the new championship links will be “one of the most environmentally-friendly and sustainable courses ever built”, with views across the North Sea.\n\nMr Trump and his son Eric broke ground last spring at the site, which is designed to accompany the existing world-ranked championship links at Trump International near Balmedie, north of Aberdeen.\n\nTrump International said more than 10 hectares of vegetation has been translocated across the largest sand dunes in Scotland, allowing indigenous plants to thrive and expand, while one million sprigs of native marram grass have been planted and six tonnes of marram seeds harvested.\n\nSarah Malone, executive vice-president at Trump International, hailed “extraordinary progress” at the site.\n\nShe said: “This course is unlike any other links course ever built and is exceeding every expectation. There are very few great stretches of developable links land in the world as good as this.\n\n“A truly remarkable, world-class team of architects, engineers, environmental scientists and industry specialists have been working tirelessly in the background, etching out every square inch of this phenomenal piece of land to create one of the great wonders in the world of golf.”\n\nTrump International said new wildlife habitats emerged within the wetlands areas, sand dunes, and heathlands, and most materials – other than drainage and irrigation pipework – were sourced on site to reduce the carbon footprint.\n\nAn “innovative environmentally-friendly freshwater and drainage system” has been engineered from wetlands and ponds to provide irrigation.\n\nGolfer Paul McGinley said: “I had the pleasure of viewing the new site at Trump during construction whilst playing the Staysure PGA Championship at Trump International in the summer.\n\n“I have no doubt that the addition of this new golf course will provide not just a great golfing exam, but also an aesthetic one with views of the North Sea from most holes.”\n\nClare Barber, principal director of project engineers Fairhurst, said: “Given the outstanding ecological and geomorphological setting of the site, our priority has been to provide engineering solutions which do not just meet the minimum standards, but enhance the natural landscape, with a particular focus on the water environment and biodiversity.\n\n“Working with academic experts in the field, we have achieved engineering and course morphology designs which not only respect but complement the existing landform, taking account of ongoing natural processes.”\n\nPrincipal golf contractor Esie O’Mahoney, of Golflink Evolve, said: “Over my 30 years’ experience in the industry, this is by far the most environmentally-friendly and sustainable golf project we have ever worked on.\n\n“This course has been built with the utmost respect for the environment. We have harvested and sourced almost all of the materials from the land itself and developed an energy efficient and environmentally sustainable water system that supports both championship courses for the future.”\n\nRobert Maxfield, chief executive of the Professional Golfers’ Association, said: “This could be one of the last great modern links to be built in Scotland.\n\n“This course is an absolute gift to the game of golf, and I am pleased the course will be accessible and open to all.”","summary":"Trump International said the links course in Aberdeenshire will be ‘unlike any other’.","url":"https://www.standard.co.uk/news/politics/trump-international-eric-trump-aberdeenshire-scottish-paul-mcginley-b1186229.html","image":"https://static.standard.co.uk/2024/10/07/00/22ad095169113258d1d681ee3f91d27bY29udGVudHNlYXJjaGFwaSwxNzI4MTM5NTY3-2.77042359.jpg?width=1200","video":null,"publish_date":"2024-10-06 23:01:00","author":"Sarah Ward","authors":["Sarah Ward"],"language":"en","category":"politics","source_country":"GB","sentiment":0.276},{"id":258700388,"title":"Trump Suggests Mandatory Voting in Rambling Wisconsin Rally Speech","text":"During the middle of yet another rambling rant about how the 2020 election had been stolen from him, Donald Trump claimed on Sunday that one path to a victory over Kamala Harris is to make voting mandatory in battleground states.\n\n“The only way to avoid this miserable thing for America is if Wisconsin and the entire Midwest turn and, I mean, turn out in record numbers,” the former president told rally goers in Juneau, Wisconsin.\n\n“We need a mandate in the vote, and we’re going to get it,” he said. At one point during the rally, Trump mused that the 2024 election will be the “greatest political victory in American history”—for him, of course.","summary":"Getty Images/ReutersDuring the middle of yet another rambling rant about how the 2020 election had been stolen from him, Donald Trump claimed on Sunday that one path to a victory over Kamala Harris is to make voting mandatory in...","url":"https://nation.lk/online/trump-suggests-mandatory-voting-in-rambling-wisconsin-rally-speech-279379.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-10-06 23:00:03","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":-0.564},{"id":258700818,"title":"Trump returns to site of assassination attempt in Pennsylvania","text":"BUTLER, Pennsylvania >> Republican presidential candidate Donald Trump on Saturday will return to the rural Pennsylvania site where he was nearly assassinated for a rally in the critical battleground state exactly one month before the Nov. 5 election.\n\nTrump ally Elon Musk, the CEO of Tesla and owner of social media platform X, will attend the rally. It will be the first time Musk has appeared at a Trump campaign event since endorsing the former president after the July 13 assassination attempt.\n\nTrump narrowly escaped being shot in the head in Butler by a bullet that whizzed by and left his right ear bleeding, a near-miss that exposed serious gaps in security for the former president and led to heightened protection measures for his subsequent outdoor rallies.\n\nIn mid-morning, a large crowd was lined up to gain access to the event site at the local fairgrounds, and many were chanting the “fight, fight, fight” slogan that Trump used to rally his followers moments after he was shot.\n\nTrailers were lined up around the site as a protective measure, blocking the view, for example, from the building where the shooter had opened fire.\n\nIt was the first of two attempts on Trump’s life. On Sept. 15, a gunman hid undetected for nearly 12 hours at Trump’s golf course in West Palm Beach, Florida, with plans to kill him, prosecutors have said, but was thwarted by a U.S. Secret Service agent patrolling the course ahead of Trump.\n\nRepublican officials hope Trump’s return to Butler will generate more support among his hard-core followers and drive up turnout for him in Pennsylvania, a state that he and his Democratic opponent, Vice President Kamala Harris, see as crucial to winning on Nov. 5.\n\n“I’m going back to Butler because I feel I have an obligation to go back to Butler,” Trump told the NewsNation cable news network earlier this week. “We never finished what we were supposed to do.”\n\nTrump also will be joined at the rally by his vice presidential running mate, Senator JD Vance, and the family of firefighter Corey Comperatore, who was fatally shot during the attempt on Trump’s life.\n\nAnother attendee of the July rally, Shane Chesher, 37, said he would return on Saturday for what he expects will be an emotional event.\n\nChesher said he witnessed the assassination attempt from a seat on the stage behind Trump and is still processing what happened.\n\n“Honestly, I don’t know that I understand still to this day what we experienced that day,” Chesher said in an interview.\n\nReturning to the site, he said, “will be spiritual, and I think it will be very emotional, good and bad.”\n\nThe Butler shooting led to widespread criticism of the U.S. Secret Service and the resignation of its director.\n\nCritics raised concerns about how the 20-year-old suspect, Thomas Matthew Crooks, who was subsequently shot to death by Secret Service agents, was able to access a nearby rooftop with a direct line of sight to where Trump was speaking.\n\nA Secret Service probe found communication gaps and a lack of diligence ahead of the shooting. In its aftermath, the agency approved extra security measures for Trump, including using bulletproof glass to shield him at outdoor rallies.\n\nSecret Service spokesperson Anthony Guglielmi said in a statement before Saturday’s rally that there had been “comprehensive changes and enhancements to our communications capabilities, resourcing and protective operations.”\n\nTrump credits turning his head to read a chart on a big video as having saved his life. With blood dripping down his face, he raised a fist and shouted “fight” to his supporters, a vivid image from that day. He wore a white bandage on his wounded ear for days after the shooting.","summary":"BUTLER, Pennsylvania >> Republican presidential candidate Donald Trump on Saturday will return to the rural Pennsylvania site where he was nearly assassinated for a rally in the critical battleground state exactly one month before the Nov. 5 election.","url":"https://www.staradvertiser.com/2024/10/06/breaking-news/trump-returns-to-site-of-assassination-attempt-in-pennsylvania-2/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_2024-10-06T010255Z_1144346610_RC2NEAABJUUT_RTRMADP_3_USA-ELECTION-TRUMP.JPG","video":null,"publish_date":"2024-10-06 23:00:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":-0.265},{"id":258702840,"title":"Hurricane Milton is growing stronger as it blows toward Florida’s Tampa Bay region","text":"FORT LAUDERDALE, Fla. (AP) — Hurricane Milton quickly intensified Sunday and is on track to become a major hurricane with the Tampa Bay area in its sights, putting Florida on edge and triggering evacuation orders along a coast still reeling from Helene’s devastation.\n\nWhile forecast models vary, the most likely path suggests Milton could make landfall Wednesday in the Tampa Bay area and remain a hurricane as it moves across central Florida into the Atlantic Ocean, forecasters said. That would largely spare other southeastern states ravaged by Hurricane Helene, which caused catastrophic damage from Florida into the Appalachian Mountains and a death toll that rose Sunday to at least 130 people.\n\nFlorida Gov. Ron DeSantis said Sunday that it’s clear that Florida is going to be hit hard by Milton — “I don’t think there’s any scenario where we don’t have major impacts at this point.”\n\nHurricane Milton was centered about 815 miles (1,310 kilometers) west-southwest of Tampa on Sunday afternoon, with maximum sustained winds of 80 mph (130 kmh), the National Hurricane Center said.\n\n“You have time to prepare — all day today, all day Monday, probably all day Tuesday to be sure your hurricane preparedness plan is in place,” the governor said. “If you’re on that west coast of Florida, barrier islands, just assume you’ll be asked to leave.”\n\nIn Pinellas County, home to St. Petersburg, officials issued voluntary evacuation orders for people along the barrier island beaches and mobile home parks. Mandatory evacuations are likely to follow.\n\nWith Milton achieving hurricane status, this is the first time the Atlantic has had three simultaneous hurricanes after September, said Colorado State University hurricane scientist Phil Klotzbach. There have been four simultaneous hurricanes in August and September.\n\nThe St. Petersburg-Tampa Bay area is still cleaning up extensive damage from Helene. Twelve people perished as storm surge swamped the coast, with the worst damage along the narrow, 20-mile (32-kilometer) string of barrier islands that stretch from St. Petersburg to Clearwater.\n\nDeSantis expanded his state of emergency declaration Sunday to 51 of the state’s 67 counties — home to more than 90% of the state’s nearly 23 million residents. The state’s Panhandle, which continues to recover from other recent storms, is expected to be mostly spared.\n\nFloridians should prepare for more power outages and disruption, making sure they have a week’s worth of food and water and are ready to hit the road, Desantis said. The Federal Emergency Management Agency, meanwhile, coordinated with the governor and briefed President Joe Biden Sunday on how it has staged lifesaving resources.\n\n“We are preparing … for the largest evacuation that we have seen, most likely since 2017, Hurricane Irma,” said Kevin Guthrie, executive director of the Florida Division of Emergency Management.\n\nThe state has prepared emergency fuel sources and electric vehicle charging stations along evacuation routes, and “identified every possible location that can possibly house someone along those routes,” Guthrie said. People who live in homes built after Florida strengthened its codes in 2004, who don’t depend on constant electricity and who aren’t in evacuation zones, should probably avoid the roads, he said.\n\nAll classes and school activities in St. Petersburg’s Pinellas County preemptively closed Monday through Wednesday as Milton approached, and officials in Tampa opened all city garages free of charge to residents hoping to protect their cars from floodwaters, including electric vehicles.\n\nAs many as 4,000 National Guard troops are helping state crews to remove debris, DeSantis said, and he directed that Florida crews dispatched to North Carolina in Helene’s aftermath return to the state to prepare for Milton.\n\n“All available state assets … are being marshaled to help remove debris,” DeSantis said. “We’re going 24-7.”\n\nAir search and rescue teams on Saturday found 39 more storm survivors who were still stranded in western North Carolina, state Gov. Roy Cooper’s office said. So far, almost 6,600 people have been rescued, evacuated or assisted by search-and-rescue teams since the storm hit, the office said.\n\nFEMA Administrator Deanne Criswell defended her agency’s response to the hurricane’s destruction after Republicans’ false claims, amplified by former President Donald Trump, created a frenzy of misinformation across devastated communities.\n\n“This kind of rhetoric is not helpful to people and it’s really a shame we’re putting politics ahead of helping people,” Criswell told ABC’s George Stephanopoulos, adding that it’s created fear and mistrust among residents against the thousands of FEMA employees and volunteers on the ground across the southeast.\n\nCriswell said the agency is already preparing for Milton.\n\n“We’re working with the state there to understand what their requirements are going to be, so we can have those in place before it makes landfall,” she said.\n\nFederal disaster assistance for survivors has surpassed $137 million since Helene struck more than a week ago, one of the largest mobilizations of personnel and resources in recent history, FEMA said Sunday.\n\nSome 1,500 active-duty troops, more than 6,100 National Guardsmen and nearly 7,000 federal workers have been deployed, shipping more than 14.9 million meals, 13.9 million liters of water, 157 generators and 505,000 tarps, along with approving more than $30 million in housing and other types of assistance for over 27,000 households, according to FEMA, the White House and the Department of Defense.\n\nMore than 800 people unable to return home are staying in lodging provided through FEMA, and 22 shelters are still housing nearly 1,000 people as mobile feeding operations continue to help survivors. The response to Helene won’t let up during Milton and its aftermath, because FEMA has the capacity to address multiple disasters simultaneously, the agency said.\n\n“My Administration is sparing no resource to support families as they begin their road to rebuilding,” Biden said. “We will continue working hand-in-hand with local and state leaders – regardless of political party and no matter how long it takes.”\n\nThe hurricane center said Mexico’s Yucatan Peninsula, the Florida Peninsula, the Florida Keys and the northwestern Bahamas should monitor the system’s progress. Heavy rainfall was expected Sunday ahead of the storm itself and will likely then combine with Milton’s rainfall to flood waterways and streets in Florida, where forecasters said up to a foot (30 centimeters) of rain could fall in places through Wednesday night.\n\nMeanwhile in the open Atlantic, Hurricane Kirk diminished to a Category 2 hurricane on Sunday, with top winds of 105 mph (165 kph), sending large swells and “life-threatening surf and rip current conditions” to Bermuda and northward along the U.S. and Canadian coasts, the center said. Hurricane Leslie was also moving over the Atlantic Ocean, well away from land, with top winds of 85 mph (140 kph).\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"FORT LAUDERDALE, Fla. (AP) — Hurricane Milton quickly intensified Sunday and is on track to become a major hurricane with the Tampa Bay area in...","url":"https://whdh.com/news/hurricane-milton-is-growing-stronger-as-it-blows-toward-floridas-tampa-bay-region/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/10/milton_1390a5.jpg?quality=60&strip=color","video":"https://bcbolt446c5271-a.akamaihd.net/media/v1/pmp4/static/clear/4744899807001/24398d03-e404-4413-80d9-53d22900f6bf/3f3b0e31-381c-4c86-9bd4-ff0bb82250ae/main.mp4?akamai_token=exp=1728278071~acl=/media/v1/pmp4/static/clear/4744899807001/24398d03-e404-4413-","publish_date":"2024-10-06 22:54:45","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","source_country":"us","sentiment":0.064},{"id":258700010,"title":"Kamala Harris on 'Call Her Daddy' Podcast: 5 Takeaways From Interview","text":"In a highly anticipated appearance on the popular Call Her Daddy podcast, Vice President and Democratic presidential nominee Kamala Harris engaged in a candid conversation with host Alex Cooper.The episode, released on Sunday, covered a wide range of topics, from reproductive rights to personal attacks.Here are five key takeaways from the interview:Unwavering Stance on Abortion RightsHarris discussed the current state of abortion access in America.\"One out of three women in our country are in states with abortion bans,\" she stated and described the challenges faced by women in these states, particularly mothers.Harris added: \"Imagine she is in a state with an abortion ban and she's a mom. So she is going to have to figure out one, God help her if she has affordable childcare, God help her if she has paid leave, and then she is going to have to go to the airport, stand in a TSA line, sit on a plane next to a perfect stranger, to go to a city where she has never been, to receive the care she needs.\"The vice president emphasized that reproductive health clinics provide essential services beyond abortions. \"Do you know what those clinics also do? They do paps, they do breast cancer screenings, they do HIV testing, and they are having to close in many places with these bans,\" she noted.Harris also addressed claims about late-term abortions from former President Donald Trump, the GOP presidential nominee, calling them \"a bold face lie\" and \"outrageously inaccurate.\"\"That is not happening anywhere in the United States. It's so insulting to suggest that that would be happening and that women would be doing that,\" the vice president said.Newsweek has contacted Trump spokesperson Steven Cheung via email on Sunday for comment.Highlighting her commitment to reproductive rights, Harris stated, \"I was the first vice president or president to ever in office go to a reproductive health center, ever.\"On the changing perspectives regarding abortion, Harris noted, \"What I'm finding as I travel, people who before two years ago, before Roe V. Wade was overturned, people who felt very strong about that they are anti-abortion, anti-abortion, are now seeing what is happening and saying, 'hm, I didn't intend for all of this to happen.'\"She concluded by emphasizing the importance of personal choice in health care decisions: \"You don't have to abandon your faith or deeply held beliefs to agree, the government shouldn't be telling her what to do. If she chooses, she'll talk to her priest, her pastor, her rabbi, her imam, but not the government telling you what to do and that's what is so outrageous about it.\"Her Choice of Being Childless and Responding to That \"Humble\" CommentHarris responded to Arkansas GOP Governor Sarah Huckabee Sanders' comments that the vice president \"doesn't have anything keeping her humble\" because she doesn't have children.Harris responded: \"I feel sorry for her and I'm going to tell you why because I don't think she understands that there are a whole lot of women out here who one, are not aspiring to be humble, two, a whole lot of women out here, who have a lot of love in their life, family in their life, and children in their life and I think it's very important for women to lift each other up.\"Harris later discussed her own family situation, \"I have two beautiful children, Cole and Ella, who call me Mamala. We have a very modern family.\"She also elaborated on her approach to blended families: \"My husband's ex-wife is a friend of mine and also I'm a child of divorced parents and when I started dating Doug, my husband, I was very thoughtful and sensitive to making sure that until I knew that our relationship was something that was going to be real, I didn't want to form a relationship with the kids and then walk away from that relationship.\"Student Loan Forgiveness and Economic IssuesHarris acknowledged the financial obstacles facing young Americans, particularly in housing and family planning.\"We are fighting and I'm going to continue to fight for student debt relief,\" she stated, adding that the administration has already forgiven student loan debt for millions of people \"including doubling the amount of student loan forgiveness for public servants like nurses and teachers and firefighters.\"On housing affordability, Harris explained: \"Part of my plan is to work with home builders in the private sector to create tax incentives to build by the end of my first term 3 million more housing units.\"The vice president also proposed \"$25,000 down payment assistance for first-time home buyers\" and tax credits for middle-class families, including \"a $6,000 tax cut for the first year of their child's life.\"On Sexual Abuse and Making America Safer for WomenHarris emphasized the importance of open dialogue about sexual abuse.\"Part of the issue is that people don't talk about it. I don't mean the survivors of it; I mean nobody does. And the more that we let anything exist in the shadows, the more likely it is that people are suffering and suffering silently, and we need to talk about it,\" she stated.She added: \"Child sexual assault is something that affects far more people than the public discourse about it acknowledges and the more we talk about it, the more we will address it and deal with it, the more we will be equipped to deal with it, in terms of schools, in terms of society at large and to not stigmatize it.\"Harris also addressed economic factors in abusive situations, saying, \"When a woman and particularly if she has children, if she is economically reliant on her abuser, she is less likely to leave, because most women will endure whatever personal, physical pain they must in order to make sure their kids have a roof over their head or food.\"The vice president also responded to Trump's claims about protecting women at a September campaign event. The former president cast himself as a \"protector\" of women, saying in the battleground state of Pennsylvania that he will save all women from \"fear\" and \"loneliness\" so they will no longer have to think about abortion.Harris responds, \"So he, who, when he was president, hand selected three members of the United States Supreme Court with the intention that they would undo the protections of Roe V. Wade and they did just as he intended and there are now 20 states with Trump abortion bans, including bans that make no exceptions for rape or incest, which we just discussed, which means that you're telling a survivor of a crime with a violation of their body, they don't have a right to make a decision about what happens to their body next, which is immoral.\"On \"Cat Ladies\" and Personal Attacks From the RightWhen asked about various attacks on her character from political opponents, including Trump's running mate Ohio Senator JD Vance's comments about \"childless cat ladies,\" Harris remained resolute. \"I think it's really important not to let other people define you. And usually, those people who will attempt to do it don't know you,\" she stated.Addressing these comments directly, Harris said, \"I just think it's mean and mean spirited. And I think that most Americans want leaders who understand that the measure of their strength is not based on who you beat down, the real measure of the strength of a leader is based on who you lift up.\"Newsweek has also contacted Harris' campaign via email on Sunday for comment.","summary":"Harris called Trump's abortion claims \"a bold face lie,\" addressed the \"cat lady\" remarks, and discussed reproductive rights.","url":"https://www.newsweek.com/call-me-daddy-kamala-harris-alex-cooper-podcast-takeaways-1964663","image":"https://d.newsweek.com/en/full/2488632/kamala-harris-alex-cooper.jpg","video":null,"publish_date":"2024-10-06 22:54:21","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"sports","source_country":"US","sentiment":-0.023},{"id":258699842,"title":"Trump on the stump, Harris hits airwaves in razor-edge US election","text":"With just one month left in a deadlocked US presidential election, Donald Trump urged supporters on Sunday in battleground Wisconsin to get out the vote as Kamala Harris kicked off a week-long media interview blitz with a focus on reproductive rights.\nPolls have the Republican and Democrat candidates neck and neck, fuelling a high-cost, high-intensity scramble for each and every wavering voter in the seven key states that are likely to decide the outcome on November 5.\nTrump lost Wisconsin in 2020 and this was his fourth visit in eight days. Harris was there earlier this week, holding a rally in Ripon, birthplace of the Republican Party, where she appealed to moderate and disgruntled conservatives.\n“I’m only asking you to do one thing,” Trump told the crowd in the town of Juneau. “Just go out and vote.”\nTrump also repeated false allegations that the Biden-Harris administration had redirected relief funds for areas devastated by Hurricane Helene and spent it on migrant programmes.\nHarris, he said, is “someone who steals your wealth and abandons your family when the floodwaters rise”.\n\nHarris has faced criticism for seemingly avoiding one-on-one interviews with national media since she took over as the Democratic nominee, and Trump hammered away at this on Sunday.\n“She doesn’t do interviews because she can’t answer the questions. She can’t answer anything,” he said.\nIn her bid to reach key voters, the vice-president is taking to the airwaves in the coming week with a host of television, radio and podcast appearances.\nHarris began her media flurry with an appearance on Sunday on the podcast Call Her Daddy – one of the most popular programmes on Spotify – that focuses on advice and issues affecting women.\nShe addressed reproductive rights – which Democrats view as a major vote winner among undecided voters, especially women.\n\nAt one point Harris was asked how she felt when she heard Trump, in their presidential debate last month, say that some Democratic states allow the “execution” of babies after birth.\nIn an impassioned reply, Harris denounced that as “a boldfaced lie”, something “outrageously inaccurate” and “insulting to women”.\n“This guy,” she added, “is full of lies.”\nAsked how she was feeling with just a month to go before the election, the vice-president replied, “nervous” – then jokingly mentioned what she called an adage: “there are only two ways to run: without an opponent or scared.”\n\nTrump’s visit to Wisconsin came on the back of a theatrical campaign return on Saturday to the same venue in Butler, Pennsylvania where he narrowly avoided a would-be assassin’s bullet in July.\nThe former president campaign’s team had hoped to recapture the momentum he enjoyed at that time -riding high in the polls before US President Joe Biden upended the race by withdrawing and being replaced by Harris.\nIn a long, often rambling speech delivered from behind bulletproof glass, Trump suggested his political opponents may have been behind the failed assassination bid.\n“Those who want to stop us … have slandered me, impeached me, indicted me, tried to throw me off the ballot, and who knows, maybe even tried to kill me,” he told tens of thousands of supporters who had gathered for the event.\nThe gunman, who was shot dead, was a registered Republican and investigators have found no motive – and no political link – to his attempt on the former president’s life.\nHarris spent Saturday in North Carolina, meeting relief workers and residents in one of the areas most impacted by Helene, which left a trail of destruction across half a dozen states and more than 220 people dead.\nLater in the week, she will also be a guest on ABC’s The View, as well as The Howard Stern Show and The Late Show with Stephen Colbert – all of which are seen as generally sympathetic to the Harris campaign.\nAnd former president Barack Obama will add his star power by stumping for Harris in key swing states from Thursday right through until election day, the campaign says.","summary":"Trump urged supporters in battleground Wisconsin to get out the vote as Harris kicked off media blitz with podcast on reproductive rights.","url":"https://www.scmp.com/news/world/united-states-canada/article/3281302/trump-stump-harris-hits-airwaves-razor-edge-us-election","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/10/07/622bdbb2-4e5f-4931-a8cd-c1c7f0f11c33_4dc346a9.jpg","video":null,"publish_date":"2024-10-06 22:51:05","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.154},{"id":258699276,"title":"Cheryl Hines and RFK Jr. Spotted Together for 1st Time Since Scandal","text":"Cheryl Hines and her husband, Robert F. Kennedy Jr., stepped out in public for the first time since news broke of his alleged affair.\n\nIn photos obtained by Page Six, the pair were photographed on Saturday, October 5, after grabbing Starbucks in Malibu, California.\n\nFor the outing, Hines, 59, wore a black T-shirt, jeans and white sneakers. She seemingly did not have a wedding ring on her left ring finger.\n\nThe excursion came weeks after New York Magazine announced they placed correspondent Olivia Nuzzi on leave after she allegedly failed to disclose a relationship with a subject.\n\n“She is currently on leave from the magazine, and the magazine is conducting a more thorough third-party review. We regret this violation of our readers’ trust,” the magazine’s statement read.\n\nWhile the outlet did not publicly name Kennedy, 70, CNN and The New York Times reported that the subject was him. In a statement to The Times, Nuzzi denied having a physical relationship with Kennedy.\n\n“I did not directly report on the subject nor use them as a source. The relationship was never physical but should have been disclosed to prevent the appearance of a conflict,” Nuzzi said in her statement. “I deeply regret not doing so immediately and apologize to those I’ve disappointed, especially my colleagues at New York.”\n\nKennedy, for his part, has denied the correspondence. “Mr. Kennedy only met Olivia Nuzzi once in his life for an interview she requested, which yielded a hit piece,” his spokesperson told NBC News in a September statement.\n\nAmid the scandal, a source told Us Weekly that Hines was more bothered by her husband’s decision to back former President Donald Trump than his alleged personal relationship.\n\n“Cheryl wasn’t so upset about the alleged affair, but more about how her husband’s involvement with Trump will affect her in Hollywood,” the insider said. “[RFK Jr.’s] political outspokenness has garnered a lot of polarizing attention. She’s worried that it will hinder her work opportunities, given her long career.”\n\nA representative for Hines declined Us‘ request for comment.\n\nHines and Kennedy tied the knot in 2014. Hines was previously married to Paul Young for eight years before their divorce in 2010. The pair share daughter Catherine, 20.\n\nHines was previously married to Emily Black from 1982 to 1994, with whom he shares son Bobby III, 40, and daughter Kathleen, 36. He exchanged vows with late Mary Richardson in 1994 and welcomed kids Conor, 30, Kyra, 29, Finn, 26, and Aidan, 23. They separated in 2010.","summary":"Cheryl Hines and RJK Jon Kopaloff/Getty Images Cheryl Hines and her husband, Robert F. Kennedy Jr., stepped out in public for the first time since news broke of his alleged affair. In photos obtained by Page Six, the pair were photographed on Saturday, October 5, after grabbing Starbucks in Malibu, California. For the outing, Hines, &#8230;\n\n\nThe post Cheryl Hines and RFK Jr. Spotted Together for 1st Time Since Scandal appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/entertainment/celebrity-news/cheryl-hines-and-rfk-jr-spotted-together-for-1st-time-since-scandal/","image":"https://www.usmagazine.com/wp-content/uploads/2024/10/Cheryl-Hines-and-RJK-Spotted-Together-for-1st-Time-Since-Scandal.jpg?crop=0px,37px,1455px,764px&resize=1200,630&quality=86&strip=all","video":null,"publish_date":"2024-10-06 22:41:03","author":"Ashleigh Durden","authors":["Ashleigh Durden"],"language":"en","source_country":"us","sentiment":0.038},{"id":258699196,"title":"Liberals Criticize Elon Musk for Donald Trump Rally Appearance","text":"Elon Musk has been mercilessly mocked for jubilantly leaping on stage at a Donald Trump rally and declaring he was ‘Dark MAGA’.\n\nThe Tesla and SpaceX boss was at the Butler Farm Show grounds in Pennsylvania, where Trump survived an assassination attempt three months ago.\n\nMusk donned a black MAGA hat, in contrast to the usual red, and quipped ‘I’m not just MAGA, I’m Dark MAGA’ as he spoke to the crowd.\n\nFans of the former president loved his cameo but those on the other side mocked his awkward excitement and expressed fears for democracy, as he owns Twitter. \n\n‘Dark MAGA… More like #DorkMAGA,’ one wrote.\n\nAnother sarcastically told Musk: ‘Congrats on turning yourself into a global dweeb meme on your own platform, with #DorkMAGA trending.’\n\n‘Anyone else think trump looked embarrassed by Elon’s Dark MAGA performance?’ a third wrote, with a photo of Trump looking unimpressed next to him.\n\nAnother mocked Musk’s estrangement from most of his children, particularly his transgender daughter Vivian Jenna Wilson.\n\n‘The irony of this pasty white incel calling himself “Dark MAGA”. Go spend time with your kids Elon. Oh wait, they hate you,’ they wrote.\n\nBut others didn’t find Musk’s appearance funny, as they feared he would use his ownership of Twitter to help Trump be a dictator.\n\n‘Here we go, folks. The beloved fascist owner of this site jumped around on stage yesterday with the orange creep proclaiming he is “Dark MAGA.” A stage full of derangement… mad dogs,’ one wrote.\n\nAnother added: I just can’t joke about Elon going full on, dark MAGA, fascist; so don’t ask me to “make fun” of him. He is DANGEROUS as F**K! \n\n‘Elon, like Trump, will destroy this country to fulfill his own utterly selfish needs. Period. That’s nothing to joke about folks.’\n\nA third noted Musk appeared to be ‘auditioning for a role in a dystopian political thriller’ while turning the rally into a ‘Mars landing celebration’.\n\nMusk has long aspired to fund a human colony on Mars through SpaceX.\n\nOther Twitter users were more focused on a post by Musk’s mother Maye Musk encouraging Trump fans to ’10 fake names, go to 10 polling booths and vote 10 times’.\n\n‘Just when you thought the ‘Dark MAGA’ thing could not possibly get any more threatening and sinister, Elon Musk’s mom, Maye Musk… encourages MAGA fascist supporters of the loathsome piece of s**t to commit the federal crime of voter fraud,’ one wrote.\n\nAnother segment of critics claimed Musk appeared desperate to suck up to Trump, and his support for the former president was bad for Tesla’s business.\n\n‘Dark MAGA: The utter desperation in Elon Musk’s voice is palpable. He knows the likelihood of getting millions of dollars in tax cuts is diminishing,’ one wrote.\n\n‘Anybody who thinks the greed-driven billionaire is not all in on a Trump dictatorship — listen to this.’\n\nAnother noted: ‘Surely the board of Tesla can see how this is terrible for the company? Left-wingers are far more likely to buy electric cars.’\n\nMusk, during his speech, claimed if Americans didn’t vote for Trump, November 5 would be ‘the last election. That’s my prediction’.\n\n‘He sounds very desperate, and high AF,’ one viewer said of Musk’s claim.\n\nDark MAGA first emerged in 2022 as a meme among Trump supporters, calling for his return to the presidency at all costs – even dictatorship.\n\nThey argued Trump was justified in being authoritarian once he retook power was justified, and often shared dystopian images juxtaposed with Trump slogans. \n\nOthers saw less sinister meanings in his Dark MAGA quip, such as his hat being black, or him alluding to the Joe Biden ‘Dark Brandon’ meme.\n\n‘Elon’s big stroke of genius (Dark Maga) is just another meme he stole. This time from the Biden social media team. Dude’s literally the most unoriginal person alive,’ one wrote.\n\nAfter leaping up and down, Musk told the huge crowd: ‘America is the home of the brave and the true test of someone’s character is how they behave under fire.\n\n‘We had one president who couldn’t climb a flight of stairs and another who was fist-pumping after getting shot! FIGHT, FIGHT, FIGHT!\n\nMusk urged supporters to vote, and register to vote, and to get others to ‘vote right now’.\n\n‘I’m being repetitive for a reason,’ he said. ‘Honestly you want to be a pest. Fight, fight, fight! Vote, vote, vote!’\n\nMusk’s appearance at Trump’s rally in Butler was the first time he has taken the stage at a political rally. \n\nThe billionaire was inspired to endorse Trump publicly after the failed assassination attempt of the former president at Butler on July 13. \n\nAs the two men were on stage Trump praised Musk for donating Starlink systems to victims of hurricane Helene, joking he did not understand what the space satellite internet system was.\n\n‘I didn’t know what the hell Starlink was,’ Trump admitted.\n\nThe crowds shouted ‘Elon! Elon! Elon!’ In response\n\nBefore Musk’s arrival Trump paid tribute to Corey Comperatore, the man who was shot and killed when gunman Thomas Crooks opened fire on July 13.\n\nAfter Trump called for a moment of silence, opera singer Christopher Macchio sang ‘Ave Maria’ and a bell rung at the same time that gunfire began three months ago. \n\nThe widow of Comperatore and their children also returned to the rally, seated with members of the Trump family.\n\nTrump also paid tribute to two other men who were injured in the attack.\n\nOne had returned to the rally, Trump revealed, but one was in the hospital being treated.\n\nAt one point, the former president had to pause the rally after a woman fainted.\n\nSupporter shouted ‘We love Trump!’ and sang the National Anthem for about four minutes as she was attended to.\n\nAlthough the temperature in Butler is only in the high 60s, rallygoers have frequently collapsed at political rallies due to heatstroke this election season.\n\nEarlier, as Trump took the stage he said: ‘A very big thank you, we love Pennsylvania. And, as I was saying…’\n\nHe had displayed on two big screens a chart on immigration that was there when he was shot.\n\nTrump said: ‘I return to Butler to deliver a simple message. We are going to make America great again, we are going to win the election. And to all Americans, together, in just one month we are going to usher in a new golden age.\n\nHe added: ‘For 16 seconds, time stopped as this vicious monster unleashed pure evil. That villain did not succeed.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nElon Musk has been mercilessly mocked for jubilantly leaping on stage at&#8230;\n\n\nThis Post: Liberals Criticize Elon Musk for Donald Trump Rally Appearance first appeared on Internewscast Journal","url":"https://internewscast.com/celeb/celeb-news/liberals-criticize-elon-musk-for-donald-trump-rally-appearance/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Elon-Musk-hating-liberals-suffer-Dark-MAGA-meltdown.jpg","video":null,"publish_date":"2024-10-06 22:39:23","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.25},{"id":258698824,"title":"Elon Musk Joins Donald Trump On Stage At Butler Rally","text":"You might have been detected and blocked as a crawler bot!\r\n News Corp Australia uses software that manages crawler bot traffic on our websites. If you receive this message and are not a crawler bot (and are just a reader or subscriber), please try these steps first:\r\n\r\n Temporarily disable any AdBlockers / pop-up blockers / script blockers you have enabled\r\n Add this site in to the allowed list for any AdBlockers / pop-up blockers / script blockers you have enabled\r\n Ensure your browser supports JavaScript (this can be done via accessing https://www.whatismybrowser.com/detect/is-javascript-enabled in your browser)\r\n Ensure you are using the latest version of your web browser\r\n\r\n\r\nIf you still need to be unlocked as a reader, subscriber or crawler bot, please e-mail us at accessissues@news.com.au and provide the IP address and reference number shown here along with why you require access. \r\n\r\n\r\n\r\n\r\nYour IP address is: 105.109.122.219 | Your reference number is: 0.2c508c4f.1728253905.3c02bf0b\r\n\r\n\r\n\r\n\r\nNews Corp Australia.","url":"https://www.heraldsun.com.au/news/national/elon-musk-joins-donald-trump-on-stage-at-butler-rally/video/d89f7920c743a278a790155c82ceefae","image":null,"video":null,"publish_date":"2024-10-06 22:30:36","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.673},{"id":258698794,"title":"Kim Jong Un attempts display of power after threatening to nuke South Korea 'without hesistation'","text":"Tyrant Kim Jong Un has put on a show of North Korea's military power - days after sending a chilling message to neighbours in the south about his willingness to use nukes. \n\nThe country's official news agency showed the dictator inspecting live artillery firing by graduates of its top military academy. Kim watched cadets from O Jin U Artillery Academy in action at a secret location. During the drill he spoke again about his country’s willingness to use all available weaponry, including nuclear weapons, should he feel North Korea's sovereignty is threatened.\n\nState media, KCNA, reported on Sunday that the dictator stressed the importance of 'constantly training the guerrilla war tactics to wipe out the enemies through rapid mobile and surprise operations'. It comes just two days after Kim threatened to use nuclear weapons and destroy South Korea permanently and 'without hesitation' if provoked. \n\n\"If such a situation comes, the permanent existence of Seoul and the Republic of Korea would be impossible,\" Kim said, using South Korea's official name. There have been heightened tensions in recent weeks over the North's recent disclosure of a nuclear facility and missile testing. Last week, South Korea staged its own military parade where it showcased its bunker-busting 'monster' missile, fighter jets and American bombers.\n\nSouth Korean President Yoon Suk Yeol said the day that North Korea tries to use nuclear weapons would be the end of the Kim government because Kim would face \"the resolute and overwhelming response\" of the South Korean-US alliance.\n\nThe latest images of Kim issued by state media, show him clad in his familiar leather jacket. Kim said it was Seoul and Washington who were 'destroying regional security and peace', KCNA reported, while branding South Korea's leader 'an abnormal man'.\n\nSince 2022, Kim has repeatedly threatened to use nuclear weapons pre-emptively. But many foreign experts say it's still unlikely that he would use his nuclear arms first because his military is outmatched by the US and its allied forces. In July, South Korea and the US signed a deal on integrating forces to better deal with North Korea's advancing nuclear program. \n\nThough South Korea has no nuclear weapons, the US stations tens of thousands of troops in the country. Its presence has remained since the Korean war ended in 1953 without a peace treaty.\n\nYoon is set to embark on a three-nation diplomacy trip that includes a stop in Laos for summits with Southeast Asian and other world leaders. He'll emphasise that North Korea's nuclear disarmament is essential to regional peace.\n\n\"At the upcoming ASEAN-related summits, I will stress the importance of denuclearisation of North Korea, which is a prerequisite for realising a free, peaceful and prosperous Indo-Pacific region,\" Yoon said.\n\n'This will serve to send a clear message that the international community will never condone North Korea's reckless actions,\" reports the Mail.\n\nAnimosities between the Koreas are at the worst point in years with Kim's provocative run of missile tests and the South Korean-US military exercises intensifying in a cycle of tit-for-tat. All communication channels and exchange programs between the rivals remain stalled since 2019, when a broader US-North Korea diplomacy on ending the North's nuclear programme collapsed.\n\nIn January, Kim called for rewriting North Korea's constitution to eliminate the idea of a peaceful unification between the war-divided countries and to cement the South as an \"invariable principal enemy.\"\n\nObservers think North Korea's parliament will constitutionally declare a hostile \"two-state\" system on the Korean Peninsula to formally reject reconciliation with South Korea and codify new national borders.\n\nMany foreign experts say North Korea eventually hopes to use an expanded nuclear arsenal as leverage to win outside concessions like sanctions relief, after a new US president is elected. Both North and South Korea will be paying keen attention to the outcome of the next US elections.\n\nKim likely thinks a win by Republican candidate Donald Trump would increase his chances to get what he wants rather than Democratic candidate Kamala Harris, says observers. But Yoon said the alliance is 'ironclad' regardless of the outcome.\n\nSince late May, North Korea has launched thousands of rubbish-carrying balloons toward South Korea, prompting South Korea to resume anti-Pyongyang propaganda loudspeaker broadcasts at border areas.","summary":"The dictator of North Korea has been showing off the country's military arsenal and speaking again about his willingness to use nuclear weapons if threatened","url":"https://www.mirror.co.uk/news/world-news/kim-jong-un-attempts-display-33833082","image":"https://i2-prod.mirror.co.uk/incoming/article33833154.ece/ALTERNATES/s1200/2_NKOREA-POLITICS-MILITARY.jpg","video":null,"publish_date":"2024-10-06 22:21:42","author":"Paul Greaves","authors":["Paul Greaves"],"language":"en","source_country":"GB","sentiment":0.094},{"id":258700076,"title":"How important is Wisconsin? Trump’s now visited 4 times in 8 days","text":"JUNEAU, Wis. — Donald Trump on Sunday visited Wisconsin for the fourth time in eight days as his campaign showers attention on a pivotal state where Republicans fret about his ability to match Democrats’ enthusiasm and turnout machine.\n\n“They say that Wisconsin is probably the toughest of the swing states to win,” Trump said in his opening remarks at an airplane hangar in a rural Juneau where the overflow crowd spilled out on to the tarmac. “I don’t think so.”\n\nVoters in Wisconsin are already casting absentee ballots and in-person early voting begins Oct. 22. Trump stood on stage for nearly two hours, touching the third rail of Wisconsin politics by overlapping with a Green Bay Packers game, drawing derision from Democrats. But that didn’t stop thousands of people from sticking with Trump as he urged supporters to begin to vote by mail and early, when the time comes, so they turn out “in record numbers.”\n\n“If we win Wisconsin, we win the presidency,” Trump said.\n\nWisconsin is perennially tight in presidential elections but has gone for the Republicans just once in the past 40 years, when Trump won the state in 2016. A win in November could make it impossible for Democratic nominee Kamala Harris to take the White House.\n\n“In the political chatter class, they’re worried,” said Brandon Scholz, a retired Republican strategist and longtime political observer in Wisconsin who voted for Trump in 2020 but said he is not voting for Trump or Harris this year. “I think Republicans are right to be concerned.”\n\nTrump won the state in 2016 over Democrat Hillary Clinton by fewer than 23,000 votes and lost to Democrat Joe Biden in 2020 by just under 21,000 votes.\n\nOn Tuesday, Trump made his first-ever visit to Dane County, home to the liberal capital city of Madison, in an effort to turn out the Republican vote even in the state’s Democratic strongholds. Dane is Wisconsin’s second most-populous and fastest-growing county; Biden received more than 75% of the vote four years ago.\n\n“To win statewide you’ve got to have a 72-county strategy,” former Gov. Scott Walker, a Republican, said at that event.\n\nJuneau is a a town of 2,000 about 50 miles north of Madison in Dodge County, which Trump won in 2020 with 65% of the vote.\n\nEarly arrivals filled the hangar, far exceeding the available seating. One large banner behind the bleachers inside said “Vote Early.”\n\n“Make sure we turn out because guess what, I’ve been to Madison,” said U.S. Rep. Scott Fitzgerald, who is from Juneau, at the event. “I’ve been to liberal Madison and they’re going to show up. We need to do the same thing because we are the firewall to keep this country independent and free.”\n\nJack Yuds, chairman of the county Republican Party, said support for Trump is stronger in this part of the state than it was in 2016 or 2020.\n\n“I can’t keep signs in,” Yuds said. “They want everything he’s got. If it says Trump on it, you can sell it.”\n\nTrump’s campaign and outside groups supporting his candidacy have outspent Harris and her allies on advertising in Wisconsin, $35 million to $31 million, from when she became a candidate on July 23 through Oct. 1, according to the media-tracking firm AdImpact.\n\nHarris and outside groups supporting her candidacy had more advertising time reserved in Wisconsin from Oct. 1 through Nov. 5, more than $25 million compared with $20 million for Trump and his allies.\n\nThe Harris campaign has 50 offices across 43 counties with more than 250 staff members in Wisconsin, said her spokesperson Timothy White. The Trump campaign said it has 40 offices in the state and dozens of staffers.\n\nHarris rallied supporters in Madison in September at an event that drew more than 10,000 people. On Thursday, she made an appeal to moderate and disgruntled conservatives by holding an event in Ripon, the birthplace of the Republican Party, along with former U.S. Rep. Liz Cheney of Wyoming, one of Trump’s most prominent Republican antagonists.\n\nHarris and Trump are focusing on Wisconsin, Michigan and Pennsylvania, the “blue wall” states that went for Trump in 2016 and flipped to Biden in the next election.\n\nWhile Trump’s campaign is bullish on its chances in Pennsylvania as well as the Sunbelt states, Wisconsin is seen as more of a challenge.\n\n“Wisconsin, tough state,” said Trump campaign senior adviser Chris LaCivita, who worked on Republican Sen. Ron Johnson’s winning reelection campaign in 2022.\n\n“I mean, look, that’s going to be a very tight — very, very tight, all the way to the end. But where we are organizationally now, comparative to where we were organizationally four years ago, I mean, it’s completely different,” LaCivita said.\n\nHe also cited Michigan as more of a challenge. “But again, these are states that Biden won and carried and so they’re going to be brawls all the way until the end and we’re not ceding any of that ground.”\n\nThe candidates are about even in Wisconsin, based on a series of polls that have shown little movement since Biden dropped out in late July. Those same polls also show high enthusiasm among both parties.\n\nMark Graul, who ran then-President George W. Bush’s 2004 campaign in Wisconsin, said the number of campaign visits speaks to Wisconsin’s decisive election role.\n\nThe key for both sides, he said, is persuading infrequent voters to turn out.\n\n“Much more important, in my opinion, than rallies,” Graul said.\n\nMark Seelman, from Watertown, said the energy and size of the crowd sends a message that Trump is strong in Wisconsin.\n\n“Everybody’s into it,” he said during Trump’s speech. “It’s time for a change.”\n\nGomez Licon reported from Fort Lauderdale, Florida. Associated Press writers Thomas Beaumont in Des Moines, Iowa, and Jill Colvin in Butler, Pennsylvania, contributed to this report.","summary":"Wisconsin is perennially tight in presidential elections but has gone for the Republicans just once in the past 40 years.","url":"https://www.twincities.com/2024/10/06/how-important-is-wisconsin-trumps-now-visited-4-times-in-8-days/","image":"https://www.twincities.com/wp-content/uploads/2024/10/AP24280722717925.jpg?w=1024","video":null,"publish_date":"2024-10-06 22:20:15","author":"Adriana Gomez Licon,Scott Bauer","authors":["Adriana Gomez Licon","Scott Bauer"],"language":"en","source_country":"us","sentiment":-0.106},{"id":258700242,"title":"FEMA Faces Challenges Responding to Hurricane Helene Amid Misinformation and Logistical Hurdles","text":"The Federal Emergency Management Agency (FEMA) is facing logistical hurdles and combating misinformation as it responds to Hurricane Helene, which struck about a week ago. The agency has dispatched over 1,500 personnel and millions of meals and liters of water to the hardest-hit communities in North Carolina, but reaching remote areas remains a challenge.As of Friday, FEMA reported shipping more than 11.5 million meals, 12.6 million liters of water, 400,000 tarps, and 150 generators to the affected region, as reported by The Washington Post. This response mirrors the agency's efforts during Hurricane Ian in 2022, when nearly 2,000 personnel were deployed to Florida and the Southeast.Additionally, around 6,700 National Guard members from 16 states, along with roughly 1,000 active-duty troops, are engaged in relief operations. However, the vast disaster area spanning six southeastern states complicates coordination. Federal officials are working alongside state and local agencies, facing significant misinformation that hampers their mission. The storm has claimed at least 221 lives across the affected states.While some political leaders, including North Carolina Senator Thom Tillis, have praised FEMA's response, local residents express frustration over the lack of assistance. Josh Paul, founder of the nonprofit Anchor Ridge, stated, \"Nobody has come for us,\" highlighting the delays in federal aid reaching western North Carolina.FEMA is at the center of debates surrounding the federal response to the hurricane, exacerbated by misinformation circulating on social media. False claims suggest that the agency has depleted its disaster response funds and that hurricane victims can only receive $750 in federal assistance. This narrative has been amplified by right-wing influencers on platforms like X (formerly Twitter), complicating the public's understanding of FEMA's efforts.Disaster expert Samantha Montano remarked on the prevalence of misinformation during crises, emphasizing the need for accurate information. \"After Helene, it is really difficult to find good and accurate information,\" she noted.Former President Donald Trump recently suggested, without evidence, that FEMA had diverted disaster funds to assist undocumented immigrants, a claim that originated from the group America First Legal, led by Stephen Miller. White House spokesman Andrew Bates refuted this assertion, stating that certain Republican leaders are using Hurricane Helene to mislead the public.FEMA faces its own funding challenges as the hurricane season approaches its end in November. Secretary of Homeland Security Alejandro Mayorkas indicated that the agency may not have sufficient funds to last through the season. President Biden mentioned the possibility of calling Congress back for an emergency session to secure additional disaster relief funding.","summary":"The Federal Emergency Management Agency faces misinformation and logistical challenges in responding to the second deadliest hurricane to hit the U.S. mainland","url":"https://www.ibtimes.com/fema-hurricane-helene-logistical-hurdles-3745727","image":"https://d.ibtimes.com/en/full/4552079/person-walks-past-wreckage-debris-left-hurricane-helene-when-it-roared-through-north-carolina.jpg","video":null,"publish_date":"2024-10-06 22:19:09","author":"Michelly Teixeira","authors":["Michelly Teixeira"],"language":"en","source_country":"US","sentiment":0.138},{"id":258700884,"title":"WATCH: Kamala Harris Melts Down After Teleprompter Malfunctions at Rally","text":"Vice President Kamala Harris appeared to have no idea what to say when her teleprompter seemingly stopped working near the beginning of her speech at a Michigan campaign rally, with the video going viral on social media.\n\nDuring her Friday event in Flint, Harris kept repeating that it was “32 days” until the election as she cackled:\n\n“So 32 days… 32 days… Okay. We got some business to do. We got some business to do… All right,” the Democrat said. “32 days… and we know we will do it, and, and this is gonna be a very tight race until the very end.” \n\n“She had absolutely no idea what to do or say,” former President Donald Trump’s War Room said on X. “Humiliating.”\n\nPolitical strategist Greg Price said the vice president “turned into a floundering mess until [the teleprompter] came back on”:\n\n“You can literally tell the moment it happened lmfao,” he added.\n\nCartoonist Rob Larrikin parodied the hilarious gaffe, comparing Harris’s speech pattern to that of a drug user","summary":"Vice President Kamala Harris appeared to have no idea what to say when her teleprompter seemingly stopped working near the beginning of her speech at a Michigan campaign rally, with the video going viral on social media.\n\n\nThe post WATCH: Kamala Harris Melts Down After Teleprompter Malfunctions at Rally appeared first on Breitbart.","url":"https://www.breitbart.com/2024-election/2024/10/06/watch-kamala-harris-melts-down-after-teleprompter-malfunctions-at-rally/","image":"https://media.breitbart.com/media/2024/10/AP24278816183566-640x335.jpg","video":null,"publish_date":"2024-10-06 22:19:00","author":"Olivia Rondeau","authors":["Olivia Rondeau"],"language":"en","source_country":"us","sentiment":-0.194},{"id":258699268,"title":"Fetterman contends economy is improving ahead of ‘very close’ 2024 election","text":"The economy is a major factor among voters, with one poll from last month showing 71% of recipients rating the condition of the economy only fair or poor. In response to this polling data, Fetterman contended the election in his home state is going to be “very competitive,” but cited the improvements the economy has experienced recently under President Joe Biden and Vice President Kamala Harris.\n\n“And another fact is that the American economy is the world’s envy,” Fetterman said on Fox News Sunday with Shannon Bream. “And now 250,000 new jobs and inflation has been put in check and things continue to get better and better on that, and it’s going to be very, very close.”\n\nFetterman added that he has been visiting “red counties” to support Harris’s presidential bid, as both Democrats and former President Donald Trump realize that “Pennsylvania picks the president.” He also predicted that Harris “will prevail” in this election “just like Joe Biden did in 2020.”\n\nFetterman recently cautioned his party not to underestimate Trump’s influence in Pennsylvania, as the former president has “a special kind of place” in the state. Prior to becoming a senator, Fetterman was a campaign surrogate for Hillary Clinton in 2016 and said last month he saw warning signs that Trump had winning margins of support in the state, which he eventually won in the 2016 election.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nTrump held a campaign rally in Butler, Pennsylvania, on Saturday, the same area where the first assassination attempt against him took place in July. The former president was accompanied by X owner and billionaire businessman Elon Musk, who told the Washington Examiner that the “destiny” of the country is on the line in this election.\n\nA recent poll surveying 1,000 likely voters found that Trump and Harris are in a dead heat for Pennsylvania, with both garnering 48% support against a margin of error of 3 percentage points. The same poll found that Sen. Bob Casey (D-PA) is leading his opponent, Republican candidate Dave McCormick, by 2%.","summary":"Sen. John Fetterman (D-PA) dismissed polling indicating the U.S. economy is not doing well ahead of the 2024 presidential election, arguing the country’s economy is “the world’s envy.” The economy is a major factor among voters, with one poll from last month showing 71% of recipients rating the condition of the economy only fair or [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3178923/fetterman-economy-improving-ahead-of-election/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Fetterman-2024-scaled.webp","video":null,"publish_date":"2024-10-06 22:16:38","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","source_country":"US","sentiment":-0.343},{"id":258699768,"title":"Victory for No 10 'boys' club' as Keir Starmer replaces Sue Gray with his campaign supremo Morgan McSweeney","text":"Sir Keir Starmer has replaced Sue Gray with his campaign supremo in what is being seen as a victory for the ‘boys’ club’ within No 10.\n\nWithin minutes of the announcement of Ms Gray’s departure, the Prime Minister appointed Morgan McSweeney as his new chief of staff, sealing his victory in a bitter internal power struggle with the former civil servant.\n\nThe 47-year-old Irishman has already been credited with transforming the Labour Party into an election-winning machine after the Corbyn era.\n\nHaving been director of centrist think-tank Labour Together, he ran Sir Keir’s successful leadership campaign in 2020 before becoming director of campaigns as he plotted the party’s rise to power this year.\n\nHe was initially appointed head of -political strategy in Downing Street in July but soon clashed with Ms Gray, who was meant to have been delivering the programme for government.\n\nThere were numerous briefings that he was at the head of a ‘boys’ club’ inside No 10, along with Cabinet Office minister Pat McFadden, with Ms Gray on the other side. Amid jostling for position between the sides, it was even reported that she had moved Mr McSweeney’s desk further away from the PM’s office.\n\nThen Ms Gray hit the headlines after it emerged that she was being paid more than Sir Keir and stayed away from Labour conference, although she joined him on important trips to see Joe Biden in -Washington DC and Donald Trump in New York.\n\nAnd last night one senior figure told the Mail, as the Partygate inquisitor was ousted: ‘The lads have clearly won this round.’\n\nFormer Shadow Chancellor John McDonnell also accused ‘the boys’ in No 10 of caring more about -getting rid of Ms Gray than dealing with more -important matters facing the world.\n\nHe wrote online: ‘We’re facing the -potential of a war setting the Middle East alight, already -thousands are being killed in Lebanon, and what is the focus of the boys around Keir Starmer’s office, carving up Sue Gray and grabbing her job and salary. Words fail me.’\n\nMr McSweeney, whose wife Imogen Walker is a newly elected Labour MP in Scotland, has been given two female assistants.\n\nVidhya Alakeson and Jill -Cuthbertson were both -promoted from roles in No 10 to become deputy chiefs of staff.\n\nAnother senior woman in Downing Street, director of the policy unit, Nin Pandit, was also given a powerful new civil service role, that of principal private -secretary to the PM.\n\nIt had been thought that the recruitment process had been held up by tussles between Ms Gray and others in No 10 over who should get the job, as she reportedly favoured a former colleague.\n\nMs Pandit worked for many years in the NHS and will be joined in Downing Street by a -former director of communications of NHS England.\n\nJames Lyons will lead a new ‘strategic communications team’ following concern that No 10 had been too slow to react to -damaging stories including the rows over freebies and influential donor Lord Alli, as well as the briefings against Ms Gray.\n\nSir Keir said: ‘I’m really pleased to be able to bring in such -talented and experienced -individuals into my team. This shows my absolute determination to deliver the change the country voted for.’\n\nMs Gray now becomes the Prime Minister’s ‘envoy for the regions and nations’, and is expected to take a pay cut from her former salary of £170,000. \n\nShe said in a statement: ‘It has been an honour to take on the role of chief of staff, and to play my part in the delivery of a Labour government.\n\n‘Throughout my career my first interest has always been public service. However, in recent weeks it has become clear to me that intense commentary around my position risked becoming a -distraction to the Government’s vital work of change.\n\n‘It is for that reason I have -chosen to stand aside, and I look forward to continuing to support the Prime Minister in my new role.’\n\nTory MP Saqib Bhatti said: ‘Morgan McSweeney wins the battle against Sue Gray. It was clear he and his allies have been briefing against her since day one.\n\n‘It’s unlikely to be the end of the matter and does not bode well for stability at the top of government.’","summary":"Mr McSweeney, 47, credited with transforming the Labour Party into an election-winning machine after the Corbyn era, has sealed his victory in a bitter power struggle with Ms Gray (pictured).","url":"https://www.dailymail.co.uk/news/article-13930745/Keir-Starmer-replaces-Sue-Gray-campaign-supremo-Morgan-McSweeney.html","image":"https://i.dailymail.co.uk/1s/2024/10/06/21/90527853-0-image-m-52_1728246463966.jpg","video":null,"publish_date":"2024-10-06 22:16:27","author":"Editor,Martin Beckford Policy","authors":["Editor","Martin Beckford Policy"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.032},{"id":258697746,"title":"Harris attacks Trump abortion record in sex-positive podcast ‘Call Her Daddy’ interview","text":"Vice President Kamala Harris was all business in an interview on the sex-positive “Call Her Daddy” podcast that aired Sunday.\n\nHarris, the Democratic presidential nominee, spent the bulk of the roughly 40-minute conversation litigating her case against Donald Trump, blasting the Republican nominee’s track record on abortion and women’s rights.\n\n“There are now 20 states with Trump abortion bans,” Harris told “Call her Daddy” host Alex Cooper. “This is the same guy that said women should be punished for having abortions.”\n\nIn 2022, three Supreme Court justices whom Trump nominated during his presidency were part of a majority that overturned Roe v. Wade, the Supreme Court decision that for a half-century had said there was a federal right to abortion. The decision allowed individual states to restrict or permit abortions as they saw fit.\n\nThe “Call Her Daddy” podcast is largely popular with young women, a voter base Harris already polls strongly with.\n\nBut the podcast does not typically broach political topics, Cooper noted.\n\n“I am so aware I have a very mixed audience when it comes to politics, so please hear me when I say my goal today is not to change your political affiliation,” Cooper said on the podcast before she began interviewing Harris.","summary":"Vice President Kamala Harris sits for an interview with Alex Cooper on the &#8220;Call Her Daddy&#8221; podcast. Call Her Daddy Vice President Kamala Harris was all business in an interview on the sex-positive &#8220;Call Her Daddy&#8221; podcast that aired Sunday. Harris, the Democratic presidential nominee, spent the bulk of the roughly 40-minute conversation litigating her &#8230;\n\n\nThe post Harris attacks Trump abortion record in sex-positive podcast &#8216;Call Her Daddy&#8217; interview appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/harris-attacks-trump-abortion-record-in-sex-positive-podcast-call-her-daddy-interview/","image":"https://image.cnbcfm.com/api/v1/image/107409067-1714591721981-gettyimages-2151008548-jr025523_ferdn5sx.jpeg?v=1714591896&w=1920&h=1080","video":null,"publish_date":"2024-10-06 22:16:02","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.121},{"id":258697524,"title":"'Still No FEMA, Still No Military': Volunteers Blast Helene Response on CNN","text":"During a CNN interview on Sunday afternoon, volunteer pilots and relief organizers criticized the federal government's response to Hurricane Helene, saying there's \"still no FEMA [Federal Emergency Management Agency], still no military\" in North Carolina, which was ravaged by the storm late last month.Hurricane Helene made landfall on Florida's Big Bend region on September 26 as a Category 4 hurricane and then tore through the Southeast region of the United States. It hit parts of Western North Carolina particularly hard, washing away roads, destroying homes, and leaving millions without power.According to the Associated Press, 227 people have died across six states as a result of the storm, with the number expected to rise as relief efforts continue, making it the deadliest hurricane to hit the U.S. mainland since Hurricane Katrina in 2005.On Sunday, directors of two major volunteer relief groups, Operation Airdrop and Operation Helo, somberly described the realities on the ground to CNN host Omar Jimenez.Operation Airdrop chairman Doug Jackson struggled to explain the destruction he saw in the region, \"Their homes are gone. What they have around them is all they have left in this world. It's absolutely devastating for them. It's hard to describe, never seen anything like it.\"The volunteer group uses planes and pilots to deliver life-saving supplies to people in need in more remote and inaccessible locations. Jackson said the operation \"had flown 673 flights, delivered over 400,000 pounds by air, and 700,000 pounds by truck, for a total of almost 1.2 million pounds of supplies out of one airport.\"Limited by fixed-wing planes at the Concord-Padgett airport outside of Charlotte, North Carolina, Jackson said he spoke with his friend Matt McSwain, who quickly co-founded Operation Helo to deploy helicopters to hard-to-reach areas. Operation Helo is based out of Hickory Regional Airport in Western North Carolina.McSwain said Operation Helo has \"forged over 400 LZs [helicopter landing zones] over the mountains into the remote locations,\" adding that the operation is \"flying over 400 missions per day, we have over 90 helicopters registered.\"During the interview, McSwain called out the federal government, explaining that when the operation began, \"there was no military presence, there was no military help, there was no FEMA, there was no nothing.\"He continued that today, nearly a week-and-a-half after the hurricane hit, there's \"still no FEMA, still no military, still no nothing, we're begging—this is day eight, nine now.\"Newsweek has reached out to FEMA for comment via email on Sunday afternoon.\"We're tired,\" he added. \"But if we go home, mama and papa won't get their medicine, and they die. So that's why were still forging on.\"McSwain continued: \"We're doing the best we can to keep these people alive,\" pleading that the volunteer groups \"need the military here, we want to go home, we want to turn this over to an operation, we want some help, we need some help, I don't know what else to do to get it.\"Behind McSwain was a map with various nodes showing the location of helicopters, landing zones, and the region's topography. Pointing to the map, he said, \"We are integrated with the military, they are watching what we're doing, but for some reason, they won't show up.\"On Sunday afternoon, Pentagon press secretary Major General Pat Ryder said nearly 1,000 soldiers \"have been mobilized to support the residents and affected counties devastated by Hurricane Helene in Western North Carolina. These soldiers are closely working with FEMA to provide commodity distribution to local jurisdictions designated by FEMA, in close coordination with North Carolina officials.\"The federal government's response to Helene has come under scrutiny by many, including political opponents and supporters, who say the disaster relief organization isn't doing enough to support Americans in need.On Wednesday, Vice President Kamala Harris, the Democratic presidential nominee, announced that FEMA workers were going door-to-door in affected areas to provide residents with immediate relief money worth $750. The $750 is part of a larger effort to provide aid to those impacted by the hurricane.\"FEMA is also providing tens of thousands more dollars for folks to help them be able to deal with home repair, to be able to cover a deductible when and if they have insurance, and also hotel costs,\" Harris said at the time.Scrutiny about FEMA spending has increased in recent weeks after FEMA spent money on assisting communities across the country dealing with an influx of migrants through its Shelter and Services Program (SSP). The program had a budget of $640 million for the 2024 Fiscal Year, which ended on September 30.Former President Donald Trump, the GOP's presidential nominee, has criticized the SSP, which helps local governments and nonprofits support migrants. However, FEMA and the Department of Homeland Security (DHS) have denied that any FEMA disaster relief funds have gone to the program.\"The Shelter and Services Program (SSP) is a completely separate, appropriated grant program that was authorized and funded by Congress and is not associated in any way with FEMA's disaster-related authorities or funding streams,\" a DHS spokesperson previously told Newsweek.Claims have been surfacing that FEMA doesn't have enough money to assist those in need after Helene, however FEMA has publicly rebuked these rumors, writing on its website, \"FEMA's Disaster Relief Fund has enough funding to support Hurricane Helene efforts and FEMA has what it needs for immediate response and recovery efforts.\"Homeland Security Secretary Alejandro Mayorkas told reporters Wednesday that while the agency can address immediate needs, \"FEMA does not have the funds to make it through the season.\"","summary":"Hurricane Helene made landfall last month as a Category 4 hurricane and then tore through the Southeast region of the U.S.","url":"https://www.newsweek.com/volunteer-aid-pilot-groups-blast-fema-military-helene-recovery-1964646","image":"https://d.newsweek.com/en/full/2488619/hurricane-helene.jpg","video":null,"publish_date":"2024-10-06 22:10:31","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","category":"politics","source_country":"US","sentiment":-0.211},{"id":258700762,"title":"Harris, Trump barrel down campaign trail with weeks until election","text":"Oct. 6 (UPI) -- With just several weeks until Election Day, Kamala Harris and Donald Trump scrambled along the campaign trail, Trump holding a rally Sunday in Wisconsin and Harris going after the former president on a podcast.\n\nSaturday, Trump returned to the fateful site where he barely escaped assassination earlier this year in Butler Pa. accompanied by tech billionaire Elon Musk, who encouraged people to register to vote. This time, Trump was behind bullet proof glass.\n\n\"Exactly 12 weeks ago this evening, on this very ground, a cold-blooded assassin aimed to silence me and to silence the greatest movement,\" Trump said to the crowd.\n\nDuring an episode of a podcast released Sunday, Call Her Daddy, Harris criticized Trump for portraying himself as a protector of women and reminded voters that Trump was largely responsible for overturning Roe V. Wade during his term, appointing ultra conservative, anti-abortion judges to the U.S. Supreme Court.\n\nCall Her Daddy is among the most popular podcasts on streaming platforms. It kicks of what is scheduled to be a busy week of media campaigning for Harris, who has largely avoided interviews with serious journalism organizations, and will continue to do so, instead planning to do appear on shows with Howard Stern, Steven Colbert, and the hosts of the left leaning program \"The View,\" in addition to sitting down with Alex Cooper, host of Call Her Daddy.\n\nHarris is also scheduled to appear on CBS's 60 Minutes program alone after Trump declined an invitation to participate in the same episode of the program.\n\nFollowing speeches by his running mate, Ohio Sen J.D. Vance, his son Eric Trump, RNC co-chairwoman and daughter-in-law Lara Trump, the former president told the partisan crowd Saturday in Butler, Pa. that Americans deserve a president who isn't beholden to special interests while taking his typical personal pot shots at his rival.\n\nHe also blamed President Joe Biden and Harris for the shooting in Butler, as well as another one at his golf course in Florida.\n\n\"Their rhetoric is causing me to be shot at,\" Trump alleged.\n\nBoth shooters had been either registered Republicans or were involved in supporting Trump and some of his unsubstantiated rhetoric at one point in time.\n\nPolls show that the race has tightened substantially and is likely to come down to several crucial battleground states, including Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin, that could ultimately decide the election.","summary":"With just several weeks until Election Day, Kamala Harris and Donald Trump scrambled along the campaign trail, Trump holding a rally Sunday in Wisconsin and Harris going after the former president on a podcast.","url":"https://www.upi.com/Top_News/US/2024/10/06/harris-trump-hit-campaign-trail-with-weeks-left/1991728251419/","image":"https://cdnph.upi.com/ph/st/th/1991728251419/2024/upi/c7edbad3578990bc681e12a805594550/v1.2/Harris-Trump-barrel-down-campaign-trail-with-weeks-until-election.jpg","video":null,"publish_date":"2024-10-06 22:09:10","author":"Mark Moran","authors":["Mark Moran"],"language":"en","category":"politics","source_country":"US","sentiment":-0.091},{"id":258698256,"title":"Harris talks abortion rights on Call Her Daddy podcast while bashing Trump’s ‘protector’ of women claim – live","text":"Kamala Harris’s interview on Call Her Daddy with Alex Cooper aired on Sunday. The host, whose podcast targets a diverse set of audiences, and the vice-president discussed issues revolving around abortion, reproductive healthcare, housing and student debt relief.\n\nDonald Trump delivered his roughly two-hour speech at a rally in Juneau, Wisconsin. The former president was standing behind barriers of bulletproof glass, which is now a standard US Secret Service practice at outdoor rallies.\n\nArizona senator Mark Kelly criticized Elon Musk during an interview on CNN’s State of the Union for supporting Donald Trump at a rally in Pennsylvania this weekend.\n\nPresident Joe Biden ordered 500 more troops to assist with Hurricane Helene relief efforts. The troops will move into western North Carolina and assist with the response and recovery efforts after the deadly and devastating Hurricane Helene.\n\nTim Walz said during his appearance on Fox News this morning that Donald Trump’s agenda would destroy the US economy, while he supported Kamala Harris’s plan to lower costs and stimulate job growth.","summary":"Vice-president’s podcast interview with Alex Cooper drops as part of media blitz as Trump wraps Wisconsin rally\n\nDuring an interview on CNN’s State of the Union, Arizona senator Mark Kelly criticized Elon Musk for supporting Donald Trump.\n\nOn Saturday, Musk joined Trump at a rally in Butler, Pennsylvania, and made the baseless claim that if Trump’s supporters fail to turn out, “this will be the last election”.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/live/2024/oct/06/kamala-harris-donald-trump-melania-joe-biden-latest-us-politics","image":"https://i.guim.co.uk/img/media/35df0d35fa380dd52eb246f758378d8a66496bac/0_71_4252_2552/master/4252.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2","video":null,"publish_date":"2024-10-06 22:05:35","author":"Coral Murphy Marcos,David Smith,Ed Pilkington","authors":["Coral Murphy Marcos","David Smith","Ed Pilkington"],"language":"en","category":"politics","source_country":"gb","sentiment":0.184},{"id":258697376,"title":"‘Never quit’: Trump rallies at site of failed assassination","text":"AFP – Former United States (US) Donald Trump defiantly returned Saturday to the site of a campaign rally where an assassin’s bullet almost killed him in July, questioning whether his opponents were responsible and declaring he would “never quit”. \n\n“Exactly 12 weeks ago this evening, on this very ground, a cold-blooded assassin aimed to silence me,” the Republican candidate told tens of thousands of supporters after taking the stage behind bulletproof glass. \n\nCalling the gunman a “vicious monster,” Trump vowed he would “never quit… never bend… never break” to cheers of “fight, fight, fight” from the crowd. \n\nTrump’s much-hyped return to Butler, Pennsylvania, came exactly one month before the November 5 presidential election, the outcome of which US President Joe Biden suggested on Friday might not be peaceful. \n\nTrump lashed out at his political opponents, calling them the “enemy within” who had pushed to indict him and “who knows, maybe even tried to kill me”. \n\n“I wasn’t supposed to make it,” he said ominously. \n\nSecurity was noticeably tighter than Trump’s July rally, with sniper squads atop surrounding buildings, and a surveillance drone deployed overhead. “There’s a lot going on that’s unnerving,” said Heather Hughes, 43, who had travelled from New Castle in must-win Pennsylvania. \n\n“Do I think he’s safe? No, I think there’s going to be another attempt. But I think he’s going to make it through.” \n\nAfter the assassination attempt, pictures of Trump – with a blood-streaked face, pumping his fist and shouting “fight, fight, fight” – became defining images of the campaign. \n\nOn Saturday, many Trump supporters wore shirts emblazoned with the iconography, and some sported ear coverings recalling the bandage the former president wore after the shooting. \n\nBillionaire Elon Musk joined Trump on stage, stressing the tight margins that will likely decide the election in battleground states like Pennsylvania and encouraging voter registration. \n\nTrump “must win to preserve democracy in America,” said Musk, echoing the alarmist messaging he frequently pushes to his 200 million followers on his X platform. \n\nMuch has changed since Trump’s last visit to Butler, when he was riding high in polls after crushing Biden in a television debate. \n\nBarely a week after the failed assassination bid, the presidential race was turned on its head when Biden dropped out and was replaced as the Democratic nominee by Vice President Kamala Harris. \n\nHarris has clawed back the poll deficit – reversing it in some states – and the seismic events in Butler that had threatened to unleash chaos were largely overtaken. \n\nTrump’s rally appeared aimed at recovering the momentum as a bruising campaign enters its final phase. \n\nHarris, who Trump called incompetent, was in North Carolina Saturday meeting first responders and people hit by Hurricane Helene, which killed at least 220 as it ripped through the southeast.","summary":"","url":"https://borneobulletin.com.bn/never-quit-trump-rallies-at-site-of-failed-assassination/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/10/page-12-a_07102024.jpg","video":null,"publish_date":"2024-10-06 22:03:45","author":null,"language":"en","category":"politics","source_country":"bn","sentiment":-0.112},{"id":258697766,"title":"'Ridiculous ploy': Lara Trump slams 165-page brief in father-in-law Donald Trump's election case","text":"Republican National Committee co-chair Lara Trump has termed the recent filing of a 165-page brief by federal prosecutors in her father-in-law Donald Trump’s election fraud case a \"ridiculous ploy,\" suggesting it aims to influence voters just weeks ahead of the election. During an appearance on CNN’s Talk show 'State of the Union', she expressed concern over the timing of the brief, which seeks to convince US District Judge Tanya Chutkan that Trump's alleged actions following the 2020 election were personal, rather than official, and thus justifiable for indictment, as reported by Newsweek.The brief was partly unsealed on Wednesday, detailing accusations against Trump, who faces four felony counts in connection with efforts to overturn President Joe Biden’s election victory, culminating in the January 6, 2021, Capitol riot. Trump has pleaded not guilty to all charges, asserting that the prosecution is politically motivated.Lara Trump echoed that the former president will \"of course\" accept the election's results \"if he feels that this is a free, fair and transparent election.\"One revelation from the filing was a conversation between Trump and an unnamed White House aide during the Capitol riot. The aide informed Trump that then-vice president Mike Pence had to be evacuated due to potential danger, to which Trump reportedly responded, \"So what?\" Lara Trump was questioned by host Dana Bash about this alleged reaction and condemned the overall narrative surrounding January 6 as exaggerated and politically charged.\"The January 6 situation has been amplified to a level that I don't think is almost believable to so many people right now,\" she said, adding that the timing of the allegations suggests Democrats lack confidence in vice president Kamala Harris as a candidate.Legal experts have described the evidence presented against Trump as \"pretty damning,\" with additional allegations revealing a Trump campaign staffer allegedly encouraging unrest during the vote count in Detroit. Furthermore, Trump is accused of telling family members aboard Marine One that \"it doesn't matter if you won or lost the election. You still have to fight like hell,\" a statement reportedly overheard by a White House staff member willing to testify.Trump has dismissed the allegations as a \"hit job\" and continued to maintain that the 2020 election was stolen, insisting he would only accept the results of the 2024 election if it is \"free, fair, and transparent.\" Meanwhile, his federal trial is set to proceed after the November elections, with Trump required to respond to Smith's filing by November 7.","summary":"Lara Trump criticizes the timing of a federal prosecutors' brief in Donald Trump's election fraud case, calling it a 'ploy' to sway voters. The 165-page brief highlights accusations that Trump's actions post-2020 election were personal, not official. Trump has pleaded not guilty, maintaining the investigation is politically motivated while expressing his demand for a fair and transparent 2024 election.","url":"https://timesofindia.indiatimes.com/world/us/ridiculous-ploy-lara-trump-slams-165-page-brief-in-father-in-law-donald-trumps-election-case/articleshow/113993943.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-113994233/113994233.jpg","video":null,"publish_date":"2024-10-06 22:01:41","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.307},{"id":258696690,"title":"Wisconsin: Trump has visited 4 times in 8 days – What does this mean?","text":"MADISON, Wis. – Donald Trump on Sunday visited Wisconsin for the fourth time in eight days as his campaign showers attention on a pivotal state where Republicans fret about his ability to match Democrats’ enthusiasm and turnout machine.\n\n“They say that Wisconsin is probably the toughest of the swing states to win,” Trump said in his opening remarks at an airplane hangar in a rural Juneau where the overflow crowd spilled out on to the tarmac. “I don’t think so.”\n\nVoters in Wisconsin are already casting absentee ballots and in-person early voting begins Oct. 22. Trump stood on stage for nearly two hours, touching the third rail of Wisconsin politics by overlapping with a Green Bay Packers game, drawing derision from Democrats. But that didn’t stop thousands of people from sticking with Trump as he urged supporters to begin to vote by mail and early, when the time comes, so they turn out “in record numbers.”\n\n“If we win Wisconsin, we win the presidency,” Trump said.\n\nWisconsin is perennially tight in presidential elections but has gone for the Republicans just once in the past 40 years, when Trump won the state in 2016. A win in November could make it impossible for Democratic nominee Kamala Harris to take the White House.\n\n“In the political chatter class, they’re worried,” said Brandon Scholz, a retired Republican strategist and longtime political observer in Wisconsin who voted for Trump in 2020 but said he is not voting for Trump or Harris this year. “I think Republicans are right to be concerned.”\n\nTrump won the state in 2016 over Democrat Hillary Clinton by fewer than 23,000 votes and lost to Democrat Joe Biden in 2020 by just under 21,000 votes.\n\nOn Tuesday, Trump made his first-ever visit to Dane County, home to the liberal capital city of Madison, in an effort to turn out the Republican vote even in the state’s Democratic strongholds. Dane is Wisconsin’s second most-populous and fastest-growing county; Biden received more than 75% of the vote four years ago.\n\n“To win statewide you’ve got to have a 72-county strategy,” former Gov. Scott Walker, a Republican, said at that event.\n\nJuneau is a a town of 2,000 about 50 miles north of Madison in Dodge County, which Trump won in 2020 with 65% of the vote.\n\nEarly arrivals filled the hangar, far exceeding the available seating. One large banner behind the bleachers inside said “Vote Early.”\n\n“Make sure we turn out because guess what, I’ve been to Madison,” said U.S. Rep. Scott Fitzgerald, who is from Juneau, at the event. “I’ve been to liberal Madison and they’re going to show up. We need to do the same thing because we are the firewall to keep this country independent and free.”\n\nJack Yuds, chairman of the county Republican Party, said support for Trump is stronger in this part of the state than it was in 2016 or 2020.\n\n“I can’t keep signs in,” Yuds said. “They want everything he’s got. If it says Trump on it, you can sell it.”\n\nTrump’s campaign and outside groups supporting his candidacy have outspent Harris and her allies on advertising in Wisconsin, $35 million to $31 million, from when she became a candidate on July 23 through Oct. 1, according to the media-tracking firm AdImpact.\n\nHarris and outside groups supporting her candidacy had more advertising time reserved in Wisconsin from Oct. 1 through Nov. 5, more than $25 million compared with $20 million for Trump and his allies.\n\nThe Harris campaign has 50 offices across 43 counties with more than 250 staff members in Wisconsin, said her spokesperson Timothy White. The Trump campaign said it has 40 offices in the state and dozens of staffers.\n\nHarris rallied supporters in Madison in September at an event that drew more than 10,000 people. On Thursday, she made an appeal to moderate and disgruntled conservatives by holding an event in Ripon, the birthplace of the Republican Party, along with former U.S. Rep. Liz Cheney of Wyoming, one of Trump’s most prominent Republican antagonists.\n\nHarris and Trump are focusing on Wisconsin, Michigan and Pennsylvania, the “blue wall” states that went for Trump in 2016 and flipped to Biden in the next election.\n\nWhile Trump’s campaign is bullish on its chances in Pennsylvania as well as the Sunbelt states, Wisconsin is seen as more of a challenge.\n\n“Wisconsin, tough state,” said Trump campaign senior adviser Chris LaCivita, who worked on Republican Sen. Ron Johnson’s winning reelection campaign in 2022.\n\n“I mean, look, that’s going to be a very tight — very, very tight, all the way to the end. But where we are organizationally now, comparative to where we were organizationally four years ago, I mean, it’s completely different,” LaCivita said.\n\nHe also cited Michigan as more of a challenge. “But again, these are states that Biden won and carried and so they’re going to be brawls all the way until the end and we’re not ceding any of that ground.”\n\nThe candidates are about even in Wisconsin, based on a series of polls that have shown little movement since Biden dropped out in late July. Those same polls also show high enthusiasm among both parties.\n\nMark Graul, who ran then-President George W. Bush’s 2004 campaign in Wisconsin, said the number of campaign visits speaks to Wisconsin’s decisive election role.\n\nThe key for both sides, he said, is persuading infrequent voters to turn out.\n\n“Much more important, in my opinion, than rallies,” Graul said.\n\nMark Seelman, from Watertown, said the energy and size of the crowd sends a message that Trump is strong in Wisconsin.\n\n“Everybody’s into it,” he said during Trump’s speech. “It’s time for a change.”\n\nGomez Licon reported from Fort Lauderdale, Florida. Associated Press writers Thomas Beaumont in Des Moines, Iowa, and Jill Colvin in Butler, Pennsylvania, contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMADISON, Wis. – Donald Trump on Sunday visited Wisconsin for the fourth&#8230;\n\n\nThis Post: Wisconsin: Trump has visited 4 times in 8 days &#8211; What does this mean? first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/wisconsin-trump-has-visited-4-times-in-8-days-what-does-this-mean/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-How-important-is-Wisconsin-Trump039s-now-visited.jpg","video":null,"publish_date":"2024-10-06 21:56:42","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.106},{"id":258696946,"title":"Donald Trump Calls Out Gun Owners, Evangelical Christian Voters","text":"Former President Donald Trump called on gun owners and evangelical Christians to vote for him in this year's election during a campaign rally in Juneau, Wisconsin, on Sunday, citing low voter turnout among those demographics.Gun control remains one of the most contentious issues in American politics, but it has taken a backseat this election cycle, with voters' primarily concerned with the economy, immigration and abortion.However, in response to several gun violence incidents across the country, such as the Apalachee High School shooting in Winder, Georgia, on September 4, when a student allegedly killed four people, including two of his classmates, gun safety made headlines on the campaign trail as both Trump, the GOP nominee, and Vice President Kamala Harris, the Democratic nominee, aim to address guns and gun violence.During his rally in Wisconsin, a battleground state, Trump called on gun owners on Sunday to go out and vote, citing that despite his endorsement from the National Rifle Association (NRA) he received back in May, gun owners don't \"vote much.\"\"You know you have a lot of people out there that don't vote, that love us, but don't vote. You know who doesn't vote much? Rifle owners. We are Second Amendment people; the NRA gave us complete and total endorsement. And during that...they did tell me that people who own guns and rifles don't vote relatively, a very small percentage, like 15 percent,\" the former president said. \"If you would vote nobody would beat us.\"Newsweek could not independently verify that number and reached out to the NRA via email for comment.While gun ownership does fall along partisan lines, gun owners typically lean towards voting Republican as the Democratic Party has generally supported more gun control measures as opposed to the GOP.A study published in Social Science Quarterly in 2017, examined the connection between gun ownership and vote choice. Using information from the General Social Survey—which gathers data on American society to monitor and explain trends in attitudes and behaviors—every four years from 1972 to 2012, University of Kansas researchers found that gun owners and non-owners select candidates based in part on their commitment to firearms and exposure to gun culture. According to the data, since the Richard Nixon-era of the 1970s, possessing a firearm has increased the likelihood of voting for Republican candidates.Trump also called on evangelical Christians to go out and vote, \"I'll tell you another one that don't vote, I love these people, evangelical Christians. The Christian community doesn't vote as much as they should; they go to church. So now what we are going to do is go to church and we are to get out and vote...If they did vote, we couldn't lose an election.\"Newsweek has also reached out to Trump's campaign via email for comment.This comes as evangelical Christians are a key voter bloc for Republicans, whose support for culturally right-wing policies like opposition to legal abortion and LGBTQ+ rights have long drawn socially conservative, highly religious voters. High turnout among white evangelical voters would be key to a Trump victory in November, but his relationship with the bloc has faced some tension, as his positions on some of these social issues have at times been less rigid than those of other conservatives.According to a poll from Lifeway Research, Trump's support among Christian pastors has changed since 2020 with 61 percent of evangelical pastors who responded to the poll said they plan to vote for Trump, compared to 68 percent in a poll conducted in September 2020.The survey was conducted among 1,003 Protestant pastors from August 8 to September 3. The earlier polling of 1,000 Protestant pastors was held from September 2 to October 1, 2020. In 2020, the poll found Trump with a 32-point lead over President Joe Biden (53 to 21 percent) while the current poll shows the former president with a 26-point lead over Harris (50 to 24 percent).Sunday's campaign rally comes after Trump returned to Butler, Pennsylvania, on Saturday to complete the speech that was cut short following the assassination attempt on his life on July 13 at the Butler Farm Show.Trump has consistently defended gun rights and is expected to be the keynote speaker at the NRA's \"Defend the 2nd\" event in Savannah, Georgia, on October 22.Harris has also recently made headlines as she spoke about being a gun owner herself, hoping to appeal to moderate and even right-leaning voters who may be wary of a second Trump term but still have reservations about the Democrats' positions on issues like gun control.Harris revealed her personal gun ownership to the surprise of many viewers, during the September 10 debate with Trump and gave more details in her first solo TV interview of the election cycle with Oprah Winfrey last month.\"I'm in favor of the Second Amendment, and I'm in favor of assault weapons bans, universal background checks, and red flag laws,\" Harris said at the \"Unite for America\" event. \"These are just common sense.\"","summary":"Citing low voter turnout among those demographics, Trump urged them on Sunday to vote for him in this year's election.","url":"https://www.newsweek.com/donald-trump-calls-out-gun-owners-evangelical-christian-voters-1964623","image":"https://d.newsweek.com/en/full/2488613/donald-trump.jpg","video":null,"publish_date":"2024-10-06 21:56:37","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.041},{"id":258696452,"title":"Harris talks about combating abuse, makes no mention of accusations against husband during interview on sex podcast","text":"Vice President Kamala Harris spoke of strategies to curtail sexual and other types of domestic violence during an interview on a wildly popular podcast Sunday, but the accusations against her husband that surfaced last week never came up.\n\nIn Sunday’s episode of “Call Her Daddy,” Harris, 59, passionately recalled how she began her career as a prosecutor inspired to take on domestic abusers, but host Alex Cooper, 30, declined to press the veep on the thorny topic of her husband allegedly drunkenly hitting an ex-girlfriend, avoiding the issue altogether.\n\n“The first thing that I would say to anyone going through it is tell someone that you trust. Don’t, don’t quietly suffer. You have done nothing wrong,” Harris said about advice she would give to victims of domestic violence. \n\n“Often, the abuser will tell her that if she tells then something worse will happen, and that is usually wrong. And know that there are people that want you to be safe.”\n\nWhile hearkening back to her efforts to combat abuse as San Francisco district attorney and California attorney general, Harris reiterated the harrowing situation that first inspired her to become a prosecutor. \n\nOne of her best friends in high school, Wanda Kagan, had told Harris she was being abused by her stepfather. That motivated Harris to want to defend others who were suffering from similar terror.\n\n“We have to talk about it. Child sexual assault is something that far more people than the public discourse about it acknowledges,” Harris said while emphasizing the need to “not stigmatize it.”\n\n“Abuse of anyone is something we should all take seriously, as opposed to saying it’s not our business. It’s something that we have to agree should not happen.”\n\nKey to making the US a safer country for women is economics, Harris argued. \n\n“When a woman, and in particular if she has children, if she is economically reliant on her abuser, she’s less likely to leave,” she said. “Most women will endure whatever personal, physical pain they must in order to make sure their kids have a roof over their head or food.”\n\nLeft unmentioned during the interview were the shocking accusations against second gentleman Doug Emhoff from three friends of one of his ex-girlfriends, who claimed he became intoxicated and slapped her back in May 2012, as reported by the Daily Mail. \n\nHis reps later gave a flat denial to those accusations.\n\n“This report is untrue,” an Emhoff spokesperson later told Semafor, adding that “any suggestion that he would or ever hit a woman is false.”\n\nBack in August, Emhoff fessed up to having an affair during his first marriage, after the outlet reported that he cheated on her and got the nanny pregnant. \n\nAt times on the campaign trail, Harris has dubbed her rival, former President Donald Trump a “predator.” The GOP presidential nominee has faced a number of sexual misconduct allegations, all of which he has denied.\n\nTrump was found liable by a jury for defamation and sexual abuse against writer E. Jean Carroll. The 78-year-old is appealing that verdict. \n\nDuring her podcast appearance, Harris laced into Trump for appointing the Supreme Court justices who overturned Roe v. Wade, ripping him for telling women, “I will be your protector.”\n\nShe also bristled when asked about Trump’s suggestion that she supports abortion “right up until birth, and even after birth.”\n\n“That is so outrageously inaccurate, and it’s so insulting to suggest that would be happening and that women would be doing that. It’s not happening anywhere,” she said. “This guy is full of lies.”\n\nHarris has often demurred when asked about the limitations she would enact on abortion, claiming that she would merely restore the policy first established in Roe v. Wade. Prior to the 2022 Dobbs v. Jackson Women’s Health Organization decision, Supreme Court precedent technically did not set gestational limits and instead deferred to the states and Congress. \n\nAt the moment, there are just over half a dozen states and Washington, DC, that do not impose gestational limitations on abortion, according to Axios. \n\nFewer than 1% of abortions took place in the US during or after 21 weeks of gestation back in 2021, according to data from the US Centers for Disease Control and Prevention. Pro-life activists argue that data on late-term abortions is incomplete. \n\nKilling babies after birth is illegal, but Trump appears to be referencing “comfort care” that abortion doctors sometimes administer to a baby that survives a botched abortion procedure — which is generally thought to be rare. \n\nIn the early 2000s, Congress passed the Born-Alive Infants Protection Act to provide protections for fetuses and babies that survive abortions. Trump has blasted Democrats for scuttling efforts to strengthen those laws during his first term. \n\nHarris also addressed GOP vice presidential hopeful JD Vance’s swipe at “childless cat ladies,” which she called “mean and mean-spirited” as well as Arkansas Gov. Sarah Huckabee Sanders’ diss at her for not having biological children. \n\n“[There are] a whole lot of women out here who have a lot of love in their life, family in their life and children in their life. And I think it’s really important for women to lift each other up,” she rebutted. \n\n“Call Her Daddy” was the second-best performing podcast on Spotify last year behind Joe Rogan’s podcast and topped the charts among women.\n\nThe podcast is known for featuring discussions about sex and advice for women.","summary":"Vice President Kamala Harris spoke of strategies to curtail sexual and other types of domestic violence during an interview on the wildly popular podcast \"Call Her Daddy\" which dropped Sunday.","url":"https://nypost.com/2024/10/06/us-news/kamala-harris-talks-about-combating-abuse-makes-no-mention-of-accusations-against-husband-during-interview-on-sex-podcast/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/2024-charlotte-north-carolina-harris-91149339.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-06 21:53:51","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.314},{"id":258695908,"title":"Elon Musk’s photo from Trump’s rally has the internet in hysterics: ‘The greatest jumper’","text":"Social media users jumped online to capture Elon Musk’s big on-stage moment at former president Donald Trump’s rally on Saturday.\n\nOn October 5, the the world’s wealthiest man joined the former president in Butler, Pennsylvania, the site of his attempted assassination this past July, to show his support for the Republican presidential nominee one month before Election Day.\n\nAt the rally, Trump welcomed the owner of X, formerly known as Twitter, identifying him as the man who “saved free speech” and a “rocket builder.” Musk approached Trump in a black “Make America Great Again” baseball cap and a “Occupy Mars” T-shirt, admitting he was “dark MAGA,” a nod to the far-right meme. \n\nThe SpaceX owner appeared to jump with joy, waving his hand back and forth at the crowd around him. Immediately, social media users leaped to their accounts to troll the businessman as “the greatest jumper of all time.”\n\nClips of Musk airborne were published next to pictures of chipmunks and scenes from The Simpsons on X, the platform purchased by Musk for $44b billion in 2022. \n\n“I don’t know if this will make sense to anyone but Elon jumps like a homeschool kid,” one X user wrote alongside footage of Musk jumping behind Trump. \n\nAnother said: “Elon Musk Decided to Jump at Trump’s Election Rally — and Immediately Became a Meme Hero.” \n\nOne internet sleuth remembered a scene from Friends where Ross jumps up and down with Rachel and Pheobe when he believes he found a new apartment. Ross, played by David Schwimmer, is seen flailing his arms and screaming in a high-pitched tone.\n\nOthers added #dorkmaga to their caption next to Musk in the air on stage. \n\n“I was there, @elonmusk jumped higher than anybody’s ever seen. Some people were saying he’s the greatest jumper of our generation. Higher than Abraham Lincoln,” one user wrote.\n\n“Elon Musk providing Donald Trump the rare opportunity of not being the most ridiculous, embarrassing person in a picture,” wrote another.\n\n“Why does Elon Musk jump like a Roblox character LMAO,” another questioned, referencing the popular online video game. \n\nOn Threads, one user inserted screenshots of Musk jumping in iconic movie scenes from Titanic, Dirty Dancing, and Joker. Musk’s body was pasted next to Mario and Luigi and the Giganotosaurus from Jurassic Park. \n\n“I think this election is the most important election of our lifetime. This is no ordinary election,” Musk said at the rally. “President Trump must win to preserve the Constitution. He must win to preserve democracy in America. This is a must win situation, must win.”","summary":"‘Why does Elon Musk jump like a Roblox character LMAO’","url":"https://www.independent.co.uk/life-style/elon-musk-trump-rally-jump-memes-b2624770.html","image":"https://static.independent.co.uk/2024/10/05/23/SEI224588298.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/wCzFEj0w-4VHSaSK0.mp4","publish_date":"2024-10-06 21:41:41","author":"Kaleigh Werner","authors":["Kaleigh Werner"],"language":"en","source_country":"gb","sentiment":0.324},{"id":258697276,"title":"Voters in North Carolina and Georgia have bigger problems than politics","text":"Brad Farrington pulls over to grab a case of water bottles being passed out in Vilas, a small rural community tucked away in the Blue Ridge Mountains. He’s on his way to help a friend who lost much of what he owned when Hurricane Helene blew through last weekend.\n\nHis friend, like countless others across western North Carolina, is starting over, which explains why Farrington isn’t thinking too much about politics or the White House race between Republican Donald Trump and Democrat Kamala Harris right now.\n\n“I don’t believe people’s hope is in either people that are being elected,” he said.\n\nFarrington pauses, then gestures toward a dozen volunteers loading water and other necessities into cars and trucks.\n\n“I believe we’re finding a lot more hope within folks like this,” he said.\n\nIn the election’s final weeks, people in North Carolina and Georgia, influential swing states, are dealing with more immediate concerns: widespread storm damage. If that weren’t enough, voters in Watauga County, a ticket-splitting Appalachian county that has become more Democratic in recent years, must contend with politicians laying blame while offering support as they campaign in a race that could be decided by any small shift.\n\nLarge uprooted trees litter the sides of roads, sometimes blocking driveways. Some homes in Vilas are inaccessible after bridges collapsed and roads crumbled. More populous areas like Boone, home of Appalachian State University, saw major flooding.\n\nResidents wonder where are missing friends and relatives, is there enough food and water to last until new supplies arrive and how will they rebuild.\n\nThe focus is on survival, not politics — and may remain that way for weeks.\n\nTrump and Harris have visited North Carolina and Georgia five times since the storm hit. Trump was in North Carolina on Friday, and Harris was there the next day.\n\nAfter Trump went to Valdosta, Georgia, on Monday, 20-year-old Fermin Herrera said the former president clinched his vote with his display of caring, not out of any frustration with how President Joe Biden and Harris, the vice president, are handling the federal disaster response. Herrera already leaned toward voting for Trump.\n\n“I feel like everybody’s kind doing what they can,” he said. “All the locals are appreciating the help that’s coming.”\n\nTrump, who has his own mixed record on natural disaster response, attacked Biden and Harris for what he said was a slow response to Helene’s destruction. Trump accused the Democrats of “going out of their way to not help people in Republican areas” and said there wasn’t enough Federal Emergency Management Agency money because it was spent on illegal immigrants. There is no evidence to support either claim.\n\n“I’m not thinking about voters right now,” Trump insisted after a meeting with Gov. Brian Kemp, R-Ga., on Friday. “I’m thinking about lives.”\n\nBiden pushed back hard, saying he is “committed to being president for all of America” and has not ordered aid to be distributed based on party lines. The White House cited statements from the Republican governors of Georgia, South Carolina and Tennessee expressing satisfaction with the federal government’s response.\n\nCriticism so soon after a natural disaster is “inappropriate,” especially when factoring in the daunting logistical problems in western North Carolina, said Gavin Smith, a North Carolina State University professor who specializes in disaster recovery. He said the perilous terrain from compromised roads and bridges and the widespread lack of power and cellphone service make disaster response in the region particularly challenging.\n\nDemocratic Gov. Roy Cooper has made several stops in western North Carolina, including Watauga County and surrounding areas, and Biden viewed the extensive damage via an aerial tour.\n\nIn Watauga County, Jessica Dixon was scraping muck and broken furniture off the ground with a shovel, then dumping it in the bucket of a humming excavator. The 29-year-old stood in a home she bought two years ago. It’s now gutted after a rush of water forced Dixon, her boyfriend and their two dogs to flee to safety.\n\nWithout flood insurance, Dixon is not sure what will happen over the next month. She said she filled out a FEMA application but hasn’t checked her email since. She had given the presidential election some thought before Helene, but now she’s preoccupied with cleaning her home.\n\n“It wouldn’t change my views on anything,” said Dixon, who was planning to vote for Harris.\n\nThe presidential election isn’t top of mind for 47-year-old Bobby Cordell, either. He’s trying to get help to neighbors in western Watauga County, which has become inaccessible in some parts.\n\nHis home near Beech Mountain is one of those places, he said, after a bridge washed away. Cordell rescued his aunt from a mudslide, then traveled to Boone and has been staying in Appalachian State’s Holmes Convocation Center, which now serves as a Red Cross emergency shelter.\n\nHe’s trying to send disaster relief back where he lives by contacting officials, including from FEMA. That conversation, he said, “went very well.”\n\nAccepting help isn’t easy for people in the mountains, he said, because they’re used to taking care of themselves.\n\nNow, though, the people who are trapped “need everything they can get.”\n\nOver the past week of volunteering at Skateworld, where Farrington stopped for water, it’s become harder for Nancy Crawford to smile. She’s helped serve more than 1,000 people, she said, but the emotional toll has started to settle in for “a lot of us that normally are tough.”\n\nThat burden added to the weight she was already feeling about the election, which she said was “scary to begin with.” Crawford, a registered Republican, said she plans to vote for Harris. As a Latina of Mexican descent, she thinks Trump’s immigration policies would have harmful effects on her community.\n\nThe storm, she said, likely won’t change her vote but has made one thing evident.\n\n“It doesn’t matter what party you are, we all need help,” she said.\n\nJan Wellborn had a similar thought as she made her way around the Watauga High School gym collecting supplies to bring to coworkers in need. A 69-year-old bus driver for the school district, she said the outpouring of support she’s seen from the community has been a “godsend.”\n\nShe takes solace from the county’s ability to pull together. The election matters, she said, but helping people make their way through a harrowing time matters more.\n\n“The election, it should be important,” Wellborn said. “But right now we need to focus on getting everybody in the county taken care of.”\n\nAssociated Press writer Russ Bynum in Savannah, Georgia, contributed to this report.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Brad Farrington pulls over to grab a case of water bottles being passed out in Vilas, a small rural community tucked away in the Blue Ridge Mountains. He’s…","url":"https://japantoday.com/category/world/voters-in-north-carolina-and-georgia-have-bigger-problems-than-politics.-helene-changed-everything","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/ef/02/152be880bbc1c7a46d6d5d145f726055ed4a/download/_w1700.jpg","video":null,"publish_date":"2024-10-06 21:40:43","author":"Japan Today Editor,Makiya Seminera","authors":["Japan Today Editor","Makiya Seminera"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.379},{"id":258697258,"title":"Hurricane Milton igrowing stronger as it blows toward Florida's Tampa Bay region","text":"People across Florida were given notice Sunday that Hurricane Milton is intensifying rapidly and will likely be a major hurricane before slamming midweek into the storm-ravaged Gulf Coast.\n\nWhile forecast models vary widely, the most likely path suggests Milton could make landfall Wednesday in the Tampa Bay area and remain a hurricane as it moves across central Florida into the Atlantic Ocean, forecasters said. That would largely spare other southeastern states ravaged by Hurricane Helene, which caused catastrophic damage from Florida into the Appalachian mountains and a death toll that rose Sunday to 230 people.\n\nFlorida Gov. Ron DeSantis said Sunday that while it remains to be seen just where Milton will strike, it's clear that Florida is going to be hit hard — “I don't think there's any scenario where we don't have major impacts at this point.”\n\nHurricane Milton was centered about 815 miles (1,310 kilometers) west-southwest of Tampa, Sunday afternoon, with maximum sustained winds of 80 mph (130 kmh), the National Hurricane Center said.\n\n“You have time to prepare — all day today, all day Monday, probably all day Tuesday to be sure your hurricane preparedness plan is in place,” the governor said. “If you’re on that west coast of Florida, barrier islands, just assume you’ll be asked to leave.”\n\nWith Milton achieving hurricane status, this is is the first time the Atlantic has had three simultaneous hurricanes after September, said Colorado State University hurricane scientist Phil Klotzbach. There have been four simultaneous hurricanes in August and September.\n\nThe St. Petersburg-Tampa Bay area is still cleaning up extensive damage from Helene and its powerful storm surge. Twelve people perished as Helene swamped the coast, with the worst damage along the narrow, 20-mile (32-kilometer) string of barrier islands that stretch from St. Petersburg to Clearwater. \n\nDeSantis expanded his state of emergency declaration Sunday to 51 counties, and said Floridians should prepare for more power outages and disruption, making sure they have a week's worth of food and water and are ready to hit the road. The Federal Emergency Management Agency, meanwhile, coordinated with the governor and briefed President Joe Biden Sunday on how it has staged lifesaving resources.\n\n“I highly encourage you to evacuate” if you're in an evacuation zone, said Kevin Guthrie, executive director of the Florida Division of Emergency Management. “We are preparing ... for the largest evacuation that we have seen, most likely since 2017, Hurricane Irma. ”\n\nThe state has prepared emergency fuel sources and EV charging stations along evacuation routes, and “identified every possible location that can possibly house someone along those routes,” Guthrie said. People who live in homes built after Florida strengthened its codes in 2004, who don't depend on constant electricity and who aren't in evacuation zones, should probably avoid the roads, he said.\n\nAll classes and school activities in St. Petersburg's Pinellas County preemptively closed Monday through Wednesday as Milton approached, and the Tampa opened city garages for free so people could park their cars safe from the next floodwaters. \n\nAs many as 4,000 National Guard troops are helping state crews to remove debris, DeSantis said, and he directed that Florida crews dispatched to North Carolina in Helene's aftermath return to the state to prepare for Milton.\n\n“All available state assets ... are being marshaled to help remove debris,” DeSantis said. “We're going 24-7 ... it's all hands on deck.\"\n\nFEMA Administrator Deanne Criswell defended her agency's response to Hurricane's destruction after Republicans’ false claims, amplified by former President Donald Trump, created a frenzy of misinformation across devastated communities.\n\n“This kind of rhetoric is not helpful to people and it’s really a shame we’re putting politics ahead of helping people,” Criswell told ABC’s George Stephanopoulos. It's created fear and mistrust among residents against the thousands of FEMA employees and volunteers on the ground across the southeast, she said. \n\nDespite this, Criswell said the agency is already preparing for Milton, well before it's clear exactly where it will move across the Florida peninsula this week. “We’re working with the state there to understand what their requirements are going to be, so we can have those in place before it makes landfall,” she said.\n\nFederal disaster assistance has surpassed $137 million since Helene struck more than a week ago, one of the largest mobilizations of personnel and resources in recent history, FEMA said Sunday.\n\nSome 1,500 active-duty troops, more than 6,100 National Guardsmen and nearly 7,000 federal workers have been deployed, shipping more than 14.9 million meals, 13.9 million liters of water, 157 generators and 505,000 tarps, along with approving more than $30 million in housing and other types of assistance for over 27,000 households, according to FEMA, the White House and the Department of Defense. \n\nMore than 800 people unable to return home are staying in lodging provided through FEMA, and 22 shelters are still housing nearly 1,000 people as mobile feeding operations continue to help survivors. The response to Helene won't let up during Milton and its aftermath, because FEMA has th capacity to address multiple disasters simultaneously, the agency said.\n\n“My Administration is sparing no resource to support families as they begin their road to rebuilding,” Biden said. “We will continue working hand-in-hand with local and state leaders – regardless of political party and no matter how long it takes.”\n\nThe hurricane center said Mexico’s Yucatan peninsula, the Florida Peninsula, the Florida Keys and the northwestern Bahamas should monitor the system’s progress. Heavy rainfall was expected Sunday ahead of the storm itself, and will likely then combine with Milton's rainfall to flood waterways and streets in Florida, where forecasters said up to a foot (30 centimeters) of rain could fall in places through Wednesday night.\n\nMeanwhile in the open Atlantic, Hurricane Kirk diminished to a Category 2 hurricane on Sunday, with top winds of 105 mph (165 kph), sending large swells and “life-threatening surf and rip current conditions” to Bermuda and northward along the U.S. and Canadian coasts, the center said. Hurricane Leslie was also moving over the Atlantic Ocean, well away from land, with top winds of 85 mph (140 kph).\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"People across Florida were given notice Sunday that Hurricane Milton is intensifying rapidly and will likely be a major hurricane before slamming midweek into the storm-ravaged Gulf Coast.…","url":"https://japantoday.com/category/world/tropical-storm-milton-could-hit-florida-as-a-major-hurricane-midweek","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/f6/bd/89feac7383d9c7a59d8fb828759777d93a5f/download/_w1700.jpg","video":null,"publish_date":"2024-10-06 21:40:35","author":"Japan Today Editor,National Oceanic","authors":["Japan Today Editor","National Oceanic"],"language":"en","source_country":"jp","sentiment":-0.02},{"id":258697272,"title":"Walz says he'll 'own up' when he misspeaks as Democratic ticket steps up media interviews","text":"Nearly a week after verbal stumbles in the only vice presidential debate, Democrat Tim Walz used his debut campaign appearance on a Sunday news show to try to fend off criticism of his stand on abortion rights and “own up” to past misstatements.\n\nThe interview on “Fox News Sunday” reflected a broader media blitz by presidential nominee Kamala Harris and her running mate as the Democrats seek to garner public attention in the final 30 days of the campaign against Republicans Donald Trump and JD Vance.\n\nHarris has taped an interview with CBS' “60 Minutes\" that will air Monday night. She is booked Tuesday on Howard Stern's satellite radio show, ABC's “The View” and “The Late Show\" with Stephen Colbert on CBS. Her interview on the podcast “Call Her Daddy\" is scheduled to be released later Sunday. Walz will be on Jimmy Kimmel's ABC show on Monday.\n\nWalz's Fox appearance also touched on the turmoil in the Middle East, with anchor Shannon Bream pressing the Minnesota governor on whether Israel has a right to preemptively attack Iran's nuclear and oil facilities in response to Tehran's firing of missiles against Israel. It was a question that Walz did not fully answer during his debate this past week with Vance, an Ohio senator.\n\nWalz said Sunday that “specific operations will be dealt with at the time” and he spoke of ”consequences for what they do.\" \n\nHe said Israel has a right to defend itself and that Harris worked with Israel this past week to repel the Iranian attack. President Joe Biden said last week he would not support an Israeli strike on sites related to Tehran’s nuclear program.\n\nWalz defended a law that he signed as governor to ensure abortion protections, saying it \"puts the decision with the woman and her health care providers.” \n\nTrump has said he would not sign a national abortion ban into law, and during the interview Sunday, Walz was asked whether he was calling that “a flat-out lie.”\n\n“Yes ... of course,” Walz said.\n\nOn the economy, Walz said Harris' proposals would make life more affordable for the middle class by helping with the construction of 3 million new homes and expanding tax credits for parents. He said tariffs floated by Trump could increase costs by an estimated $4,000 a year on a typical family.\n\nWalz also faced questions in the interview about misstatements pertaining to his military service, drunken driving arrest, infertility treatment for his family and claims to have been in Hong Kong before the 1989 Tiananmen Square massacre in China.\n\n“I will own up when I misspeak,” Walz said. “I will own up when I make a mistake.”\n\nHe said he believes voters are more concerned by the fact that Vance could not acknowledge during their debate that Trump lost the 2020 election to Biden and that there could be restrictions on the infertility treatment of intrauterine insemination that his wife, Gwen, received.\n\n“I think they’re probably far more concerned with that than my wife and I used IUI to have our child and that Donald Trump would restrict that,\" Walz said. \"So I think folks know who I am.”\n\nBream noted that Trump has come out in support of fertility treatments, even as he has said that abortion questions should be decided by states.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Nearly a week after verbal stumbles in the only vice presidential debate, Democrat Tim Walz used his debut campaign appearance on a Sunday news show to try to…","url":"https://japantoday.com/category/world/walz-says-he%27ll-%27own-up%27-when-he-misspeaks-as-the-democratic-ticket-steps-up-media-interviews","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/a0/6e/7a1db36d3b4afa124123925134ea6916aa6a/download/_w1700.jpg","video":null,"publish_date":"2024-10-06 21:40:19","author":"Japan Today Editor,Josh Boak","authors":["Japan Today Editor","Josh Boak"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.135},{"id":258697260,"title":"How important is Wisconsin? Trump's now visited 4 times in 8 days","text":"Donald Trump on Sunday visited Wisconsin for the fourth time in eight days as his campaign showers attention on a pivotal state where Republicans fret about his ability to match Democrats’ enthusiasm and turnout machine.\n\n“They say that Wisconsin is probably the toughest of the swing states to win,\" Trump said in his opening remarks at an airplane hangar in a rural Juneau where the overflow crowd spilled out on to the tarmac. \"I don’t think so.”\n\nVoters in Wisconsin are already casting absentee ballots and in-person early voting begins Oct 22. Trump encouraged supporters to vote by mail and early, when the time comes, so they turn out “in record numbers.”\n\nWisconsin is perennially tight in presidential elections but has gone for the Republicans just once in the past 40 years, when Trump won the state in 2016. A win in November could make it impossible for Democratic nominee Kamala Harris to take the White House.\n\n“In the political chatter class, they’re worried,” said Brandon Scholz, a retired Republican strategist and longtime political observer in Wisconsin who voted for Trump in 2020 but said he is not voting for Trump or Harris this year. “I think Republicans are right to be concerned.”\n\nTrump won the state in 2016 over Democrat Hillary Clinton by fewer than 23,000 votes and lost to Democrat Joe Biden in 2020 by just under 21,000 votes.\n\nOn Tuesday, Trump made his first-ever visit to Dane County, home to the liberal capital city of Madison, in an effort to turn out the Republican vote even in the state's Democratic strongholds. Dane is Wisconsin’s second most-populous and fastest-growing county; Biden received more than 75% of the vote four years ago.\n\n“To win statewide you’ve got to have a 72-county strategy,” former Gov Scott Walker, a Republican, said at that event.\n\nJuneau is a a town of 2,000 about 50 miles north of Madison in Dodge County, which Trump won in 2020 with 65% of the vote.\n\nEarly arrivals filled the hangar, far exceeding the available seating. One large banner behind the bleachers inside said “Vote Early.”\n\n“Make sure we turn out because guess what, I’ve been to Madison,” said U.S. Rep. Scott Fitzgerald, who is from Juneau, at the event. “I’ve been to liberal Madison and they’re going to show up. We need to do the same thing because we are the firewall to keep this country independent and free.”\n\nJack Yuds, chairman of the county Republican Party, said support for Trump is stronger in this part of the state than it was in 2016 or 2020.\n\n“I can’t keep signs in,” Yuds said. “They want everything he’s got. If it says Trump on it, you can sell it.”\n\nTrump’s campaign and outside groups supporting his candidacy have outspent Harris and her allies on advertising in Wisconsin, $35 million to $31 million, since she became a candidate on July 23, according to the media-tracking firm AdImpact.\n\nHarris and outside groups supporting her candidacy had more advertising time reserved in Wisconsin from Oct. 1 through Nov. 5, more than $25 million compared with $20 million for Trump and his allies.\n\nThe Harris campaign has 50 offices across 43 counties with more than 250 staff in Wisconsin, said her spokesperson Timothy White. The Trump campaign said it has 40 offices in the state and dozens of staff.\n\nHarris rallied supporters in Madison in September at an event that drew more than 10,000 people. On Thursday, she made an appeal to moderate and disgruntled conservatives by holding an event in Ripon, the birthplace of the Republican Party, along with former U.S. Rep. Liz Cheney of Wyoming, one of Trump’s most prominent Republican antagonists.\n\nHarris and Trump are focusing on Wisconsin, Michigan and Pennsylvania, the “blue wall” states that went for Trump in 2016 and flipped to Biden in the next election.\n\nWhile Trump’s campaign is bullish on its chances in Pennsylvania as well as Sunbelt states, Wisconsin is seen as more of a challenge.\n\n“Wisconsin, tough state,” said Trump campaign senior adviser Chris LaCivita, who worked on Republican Sen. Ron Johnson’s winning reelection campaign in 2022.\n\n“I mean, look, that’s going to be a very tight — very, very tight, all the way to the end. But where we are organizationally now, comparative to where we were organizationally four years ago, I mean, it’s completely different,” LaCivita said.\n\nHe also cited Michigan as more of a challenge. “But again, these are states that Biden won and carried and so they’re going to be brawls all the way until the end and we’re not ceding any of that ground.”\n\nThe candidates are about even in Wisconsin, based on a series of polls that have shown little movement since Biden dropped out in late July. Those same polls also show high enthusiasm among both parties.\n\nMark Graul, who ran then-President George W. Bush’s 2004 campaign in Wisconsin, said the number of campaign visits speaks to Wisconsin’s decisive election role.\n\nThe key for both sides, he said, is persuading infrequent voters to turn out.\n\n“Much more important, in my opinion, than rallies,” Graul said.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Donald Trump on Sunday visited Wisconsin for the fourth time in eight days as his campaign showers attention on a pivotal state where Republicans fret about his ability…","url":"https://japantoday.com/category/world/trump-ramps-up-his-campaign-in-wisconsin-where-a-republican-win-could-knock-out-democrats","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/8e/dc/e6517f6242ce6b6808342dfde02d48b67418/download/_w1700.jpg","video":null,"publish_date":"2024-10-06 21:39:55","author":"Japan Today Editor,Scott Bauer","authors":["Japan Today Editor","Scott Bauer"],"language":"en","source_country":"jp","sentiment":-0.063},{"id":258697792,"title":"Harris’ border visit and economy speech capture attention as warning signs emerge for campaign","text":"Kamala Harris’ visit to the border and speech outlining her economic vision captured the attention of a sizable share of Americans as September came to a close, according to new findings from The Breakthrough, a polling project that tracks how the public is following election news. But some emerging trends in the data hint at warning signs for the vice president’s campaign.\n\nThe share of Americans hearing anything at all about Harris has dropped each week since her presidential debate with former President Donald Trump in early September, and during that same time, the tone Americans use in describing what they’ve heard about her has grown more negative, reaching the lowest point of her campaign in the latest results.\n\nLooking at what people say they have heard, read or seen about Harris, “lie” has emerged as a persistent top word that some Americans associate with her. In the latest data, it was the fourth-most mentioned word after “border,” “polls” and “campaign.” It ranked sixth in the previous week’s data and second the week of the ABC News presidential debate, after ranking no higher than 12th in earlier rounds of the survey and no higher than 20th prior to the Democratic convention in August.\n\nThe survey, conducted September 27-30 by SSRS and Verasight for research teams from CNN, Georgetown University and the University of Michigan, measures what Americans say they have recently heard, read or seen about Harris and Trump.\n\nThe share of Americans mentioning words such as “lie” or “liar” when asked what they’ve heard about Harris remains quite small — just 6% in the latest data, compared with 15% who mentioned something related to immigration, for example — but it has grown over time, rising from 3% or less prior to the Democratic convention to peak at 9% shortly after the debate.\n\n“Kamala says nothing,” wrote one respondent included in the latest survey. “She uses a bunch of words that make no sense. She says she will close the border, but that is a lie to get elected. Everything she promises are lies.”\n\nThe broader focus on immigration (mentioned by 15% in relation to Harris) and the economy (mentioned by 13%) in the latest data marks a notable shift in responses about Harris, following her campaign’s efforts to focus attention on the two topics with a visit to the southern border in Arizona and an economic policy speech in Pittsburgh. It marks the first time in the survey that multiple policy-related topics have landed in the top five for Harris, and the most recent data saw by far the most mentions for immigration-related words in relation to her campaign since she entered the race in late July.\n\n“I have watched her speeches and appreciated her articulate explanation of her policies and positions on various things,” another respondent wrote. “Her concern for all and ability to concretely point to solutions to problems is a sharp contrast to Donald Trump.”\n\nOn Trump’s side, the assassination attempts against him remain prominent in the public’s attention, while immigration has faded a bit and his meeting last month with Ukrainian President Volodymyr Zelensky garnered attention.\n\n“He met with Zelensky and was not very enthusiastic about helping Ukraine,” one respondent wrote.\n\nResponses calling the former president a liar are also persistently near the top of his list. About 8% in the latest data use the word “lie” or “liar” in relation to Trump. That figure has frequently been in the high single digits as a share of topics about Trump since the start of the survey in June, dipping below that at times, including around the first assassination attempt against the former president and the Republican National Convention.\n\nAlthough responses about Harris are generally still less negative in tone than those about Trump, there has been a notable decline in overall sentiment in the Harris responses, while Trump’s numbers have rebounded slightly following a post-debate drop. For Harris, the negative shift is apparent across parties, with sentiments expressed by Democrats, Republicans and independents all tilting slightly more negative in the new data than in the week prior. For Trump, though, sentiment has held steady among Republicans, while shifting slightly less negative than the previous survey among independents and Democrats.\n\nThe latest poll found that just under two-thirds of Americans (64%) reported seeing, reading or hearing something about Harris, compared with 68% who said the same about Trump. It marks the fourth straight week in which more people reported hearing about Trump than they did about Harris, and it’s a notable drop from the previous week in the shares saying they’d heard about each candidate (Trump down 7 points, Harris down 5).\n\nThe overall level of attention to the presidential candidates now is lower than it was at this point in previous cycles, though that may be a side effect of debate timing. In 2020, for example, more than 8 in 10 Americans reported having heard news about Trump and Joe Biden in the same week of that campaign, but there was a presidential debate held on September 29. In 2016, there was a mid-September dip in attention ahead of that year’s first debate between Trump and Hillary Clinton, held on September 26.\n\n“It has been relatively quiet this week,” one respondent to the latest survey wrote when asked about Trump. “I haven’t heard of anything.”\n\nCNN’s Ariel Edwards-Levy contributed to this report.\n\nFor more CNN news and newsletters create an account at CNN.com","url":"https://www.yahoo.com/news/harris-border-visit-economy-speech-190038239.html","image":"https://media.zenfs.com/en/cnn_articles_875/922f0da9e1a007c077f07593cd34c87e","video":null,"publish_date":"2024-10-06 21:39:34","author":"Jennifer Agiesta","authors":["Jennifer Agiesta"],"language":"en","category":"politics","source_country":"us","sentiment":0.158},{"id":258695828,"title":"Post-debate polls say JD Vance was the clear winner, but Tim Walz still viewed favorably","text":"The consensus among surveyed voters asked who won the debate between the Republican and Democratic vice presidential candidates is that Ohio’s U.S. Senator JD Vance out performed Minnesota Gov. Tim Walz.\n\nThough Walz continues to enjoy a higher level of likability than Vance, the younger politician made a better show of presenting himself to voters when the pair met on October 1, according to a survey of likely voters released by Data for Progress.\n\n“When voters who watched or read about the debate are asked who won, 48% say Vance and 46% say Walz. Among Independents, 47% say Vance and 44% say Walz,” pollsters wrote. “While a plurality of voters think Vance won the recent vice presidential debate, voters still have a more favorable opinion of Walz than Vance overall.”\n\nAccording to the poll, despite Vance’s better performance, more voters say they like Walz when compared to Ohio’s junior senator. Pollsters say that after the vice presidential debate, Walz held a favorability rating of +6 — that’s 44% favorable, 38% unfavorable — while that Vance remains underwater at -6 — or 40% favorable, 46% unfavorable.\n\n“Similarly, (Vice President Kamala) Harris’ rating is +2, while (former President Donald) Trump’s is -12. President Joe Biden sits at -10,” pollsters wrote.\n\nThe survey also shows that voters were not happy with Vance’s answer when he was asked whether or not Trump lost the 2020 election. Vance said he was focused on the future election, not rehashing the contests of the past and did not address the question.\n\nTrump lost the 2020 election to Biden in the electoral college 306 to 232, with 270 needed to win. Biden also took the popular vote and broke a record doing so after winning 81,283,098 votes, or 51.3 percent of the ballots cast, compared to Trump who earned 74,222,958 votes, or 46.8 percent of the votes cast. Biden was the first presidential candidate in history to hold the support of more than 80 million voters.\n\nWalz called Vance’s refusal to respond to what should have been a fairly straightforward question “a damning non-answer,” and most voters are apparently apprehensive about his dodge.\n\n“Voters were informed that, at the vice presidential debate, Vance refused to say whether he thinks Trump lost the 2020 election and whether he would contest the 2024 vote if Harris wins next month. When asked if they are concerned about this, a majority of voters (54%), including majorities of Democrats (81%) and Independents (52%) and more than a quarter of Republicans (28%), say they are concerned, while 46% say they are not concerned,” pollsters wrote.\n\nAccording to Trump’s campaign, Walz “destroyed the great state of Minnesota with his far-left lunacy — and now, he’s joining forces with Kamala Harris to unleash that destruction on the rest of the country.”\n\nThe Harris-Walz campaign, meanwhile, said that Vance can’t answer the 2020 question because Trump can’t get over the loss.\n\n“Donald Trump can’t lead our country forward because he refuses to let go of the past. He can’t improve your family’s life because he is obsessed with himself. That’s why, instead of offering any real solutions, the closing message from Trump and his running mate to battleground voters is a lie to undermine our democracy,” a campaign spokesperson said in a statement.\n\nThe vice presidential debate does not seem to have had much impact on the overall general election horse race, where polling still finds the ticket-topping candidates in an all-but-tied contest.\n\nThe Data for Progress poll, which leans left, found that voters “Harris over Trump by 3 points in a head-to-head race.”\n\nRMG Research, where pollster Scott Rasmussen does his work, showed in a poll conducted on behalf of Napolitan News that the pair are running even.\n\n“This is the first time the candidates have been tied in our national polling since mid-August. Since then, Harris has consistently maintained a very modest lead. Last week, Harris had a two point edge. Harris leads by five among women while Trump has a six point advantage among men,” those pollsters wrote.\n\nEven without “leaners,” Harris and Trump remain tied, RMG found.\n\n“On the initial ask this week– the number without leaners– the candidates were tied at 48%,” they wrote.\n\nThis result is important, because if the pair were to go into the November 5th general election with their numbers still in lockstep, chances are better than not that Trump retakes the White House, according to RMG Research.\n\n“A tie in the popular vote would likely lead to an Electoral College victory for Trump. A two-point popular vote victory by Harris would make the Electoral College race a toss-up,” they wrote.\n\nTrump leads in the most important battlegrounds, according to the conservative-leaning pollster.\n\n“Polling released yesterday showed Trump leading by four in Florida. Other recent Napolitan News surveys have shown close races in Pennsylvania, Wisconsin, and Michigan. Trump has significant leads in Ohio and Montana,” they wrote.","summary":"Though Walz continues to enjoy a higher level of likability than Vance, the younger politician made a better show of presenting himself to voters when the pair met on October 1, according to a survey of likely voters released by Data for Progress.","url":"https://www.bostonherald.com/2024/10/06/post-debate-polls-say-jd-vance-was-the-clear-winner-but-tim-walz-still-viewed-favorably/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/Election_2024_Debate_76850.jpg?w=1024","video":null,"publish_date":"2024-10-06 21:39:28","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","source_country":"US","sentiment":0.041},{"id":258700888,"title":"Democrat Chris Murphy Wonders If Netanyahu Wants War to Influence U.S. Election","text":"Sen. Chris Murphy (D-CT) wondered openly on CNN last week whether Israeli Prime Minister Benjamin Netanyahu was trying to influence the U.S. election by continuing to fight a war against Iran and Iranian-backed terrorist groups.\n\nThe Hill reported:\n\nSen. Chris Murphy (D-Conn.) says he’s worried Israeli Prime Minister Benjamin Netanyahu may be trying to influence the U.S. presidential election by showing little interest in striking a peace deal with Hamas and instead escalating the threat of a broader war in the Middle East by aggressively confronting Hezbollah in Lebanon.\n\n“I certainly worry that Prime Minister Netanyahu is watching the American election as he makes decisions about his military campaigns in the north and in Gaza,” Murphy told CNN’s Erin Burnett.\n“I hope this is not true, but it is certainly a possibility that the Israeli government is not going to sign any diplomatic agreement prior to the American election as a means, potentially, to try to influence the result,” Murphy said, alluding to the deep divisions among the Democratic Party over the war in Gaza.\n\nMurphy’s concerns were echoed by a White House reporter at Friday’s briefing with President Joe Biden, who asked him if Netanyahu was trying to influence the election. Biden responded:\n\nNo administration has helped Israel more than I have. None. None. None. And I think Bibi should remember that.\nAnd whether he’s trying to influence the election, I don’t know, but I’m not counting on that.\n\nIsrael was targeted by nearly 200 ballistic missiles from Iran last week, and Israeli soldiers are uncovering massive troves of weapons in Lebanon, near the border, which were to have been used to carry out an October 7-style attack on northern Israel.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.","summary":"Sen. Chris Murphy (D-CT) wondered openly on CNN last week whether Israeli Prime Minister Benjamin Netanyahu was trying to influence the U.S. election by continuing to fight a war against Iran and Iranian-backed terrorist groups.\n\n\nThe post Democrat Chris Murphy Wonders If Netanyahu Wants War to Influence U.S. Election appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/10/06/democrat-chris-murphy-wonders-if-netanyahu-wants-war-to-influence-u-s-election/","image":"https://media.breitbart.com/media/2024/09/Chris-Murphy-640x335.jpg","video":null,"publish_date":"2024-10-06 21:38:03","author":"Joel B. Pollak","authors":["Joel B. Pollak"],"language":"en","category":"politics","source_country":"us","sentiment":0.138},{"id":258700844,"title":"Harris attacks Trump abortion record in sex-positive podcast 'Call Her Daddy' interview","text":"Vice President Kamala Harris was all business in an interview on the sex-positive \"Call Her Daddy\" podcast that aired Sunday.\n\nHarris, the Democratic presidential nominee, spent the bulk of the roughly 40-minute conversation litigating her case against Donald Trump, blasting the Republican nominee's track record on abortion and women's rights.\n\n\"There are now 20 states with Trump abortion bans,\" Harris told \"Call her Daddy\" host Alex Cooper. \"This is the same guy that said women should be punished for having abortions.\"\n\nIn 2022, three Supreme Court justices whom Trump nominated during his presidency were part of a majority that overturned Roe v. Wade, the Supreme Court decision that for a half-century had said there was a federal right to abortion. The decision allowed individual states to restrict or permit abortions as they saw fit.\n\nThe \"Call Her Daddy\" podcast is largely popular with young women, a voter base Harris already polls strongly with.\n\nBut the podcast does not typically broach political topics, Cooper noted.\n\n\"I am so aware I have a very mixed audience when it comes to politics, so please hear me when I say my goal today is not to change your political affiliation,\" Cooper said on the podcast before she began interviewing Harris.","summary":"Vice President Kamala Harris' appearance on \"Call Her Daddy\" is part of a larger media storm in an attempt to elbow Donald Trump out of the news cycle.","url":"https://www.cnbc.com/2024/10/06/harris-trump-abortion-election-sex-podcast-call-her-daddy.html","image":"https://image.cnbcfm.com/api/v1/image/107409067-1714591721981-gettyimages-2151008548-jr025523_ferdn5sx.jpeg?v=1714591896","video":null,"publish_date":"2024-10-06 21:32:30","author":"Rebecca Picciotto","authors":["Rebecca Picciotto"],"language":"en","source_country":"US","sentiment":0.121},{"id":258696122,"title":"Kamala Harris Wows Hollywood with Media Appearances on TV Shows and Talk Radio","text":"Hollywood-controlled media are rolling out the red carpet for Kamala Harris this week, welcoming the Democrat presidential candidate to a range of friendly media appearances as part of a planned offensive to enhance her likeability in the final stretch of the election cycle.\n\nKamala Harris is set to appear on ABC’s The View, where hosts including Joy Behar and Whoopi Goldberg have regularly sung her praises; CBS’ late-night show with Stephen Colbert, another ally; and Howard Stern, who recently called Trump supporters “stupid.”\n\nThe aforementioned shows are all known for their soft-ball questions when it comes to Democrat politicians, seldom going beyond amiable chit-chat and mutual admiration.\n\nThe sudden blitz of media appearances — one could hardly call them interviews — comes after Kamala Harris spent the better part of the last three months avoiding hard questions about policy and her record when it comes to sky-high consumer prices, unprecedented levels of illegal immigration, and the many other failures of her administration.\n\nTo date, she still hasn’t held a live press conference — something former President Donald Trump regularly does, unafraid to take questions from a hostile news media.\n\nHarris will sit down with ABC’s The View on Tuesday morning, followed in the afternoon by SiriusXM’s The Howard Stern Show, her campaign said. Also on Tuesday, she will sit down with Stephen Colbert for his late-night show.\n\nShe will sit down with Spanish-language Univision on Thursday.\n\nOn Monday, she is set to appear with another friendly outlet CBS News’ 60 Minutes, which lied to its viewers in 2020 about the origins of Hunter Biden’s laptop.\n\nKamala Harris’ media parade comes as she faces scathing criticism for her administration’s botched response to the devastation left by Hurricane Helene. This weekend, she announced $157 million in humanitarian aid to civilians in Lebanon, after allocating just $750 for the immediate needs of individual Hurricane Helene victims.","summary":"Internewscast Journal\n\nInternewscast\n\n\nHollywood-controlled media are rolling out the red carpet for Kamala Harris this&#8230;\n\n\nThis Post: Kamala Harris Wows Hollywood with Media Appearances on TV Shows and Talk Radio first appeared on Internewscast Journal","url":"https://internewscast.com/news/kamala-harris-wows-hollywood-with-media-appearances-on-tv-shows-and-talk-radio/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Kamala-Harris-Sets-Hollywood-Media-Charm-Offensive.jpg","video":null,"publish_date":"2024-10-06 21:30:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.211},{"id":258696114,"title":"On-air disagreement between CNN panelist and GOP Byron Donalds regarding Trump","text":"A CNN panelist attacked a prominent Florida Republican in a vicious on-air spat after he claimed crime has gone up under President Joe Biden and Vice President Kamala Harris . The shouting match between Democratic strategist Keith Boykin and Rep. Byron Donalds, R-Fla., occurred during a discussion about Donald Trump and his policies.\n\nCNN Host Abby Phillips facilitated the talk on Trump claiming at a rally, seemingly during an unscripted moment, he could solve shoplifting quickly if he let the police have ‘one rough hour.’ The speech led many to suggest what Trump is proposing is the plot of the movie series The Purge.\n\n‘Is he suggesting that cops can do whatever they want for a day and that will actually solve the problem?’ Phillips says in disbelief after playing the clip of Trump. Byron then snaps back saying ‘No, he’s not’ and says that crime in the U.S. has gone up. The pressure before the explosion was building.\n\n‘Even the clip you just played was five seconds out of, for Donald Trump, an hour speech. I think a lot of times people say, ‘Oh well, he said this.’ For five seconds? Yes, he says things that are unscripted. He goes off the cuff. He’s not serious, there’s no policy behind that,’ Donalds said. The Floridian continued: ‘Donald Trump said a comment for five seconds. That’s not setting policy, that’s revealing the angst of the American people.’ But the Democrat immediately pushed back.\n\n‘Donald Trump has a history of saying inflammatory things. It’s not just those five seconds, congressman, and you know that,’ Boykin said. The strategist spoke about Trump’s role in January 6, arguing how he has a history of fiery rhetoric.\n\nHowever Donalds countered saying Trump has been the one who has been the target of partisan discourse, noting how he was targeted by assassins twice. ‘Are we going to talk about the rhetoric directed at Donald Trump? Because we do realize he’s been tried to kill twice now,’ Donalds said. ‘The reality in America is that crime is massively up,’ the Republican pressed on.\n\nBoykin grew incensed, shouting that Donalds is a liar. ‘Crime is not massively up!’ ‘That’s a lie! You’re lying! You’re lying!’ the Democrat loudly claimed. The strategist then aimed his ire at Phillips for letting Donalds challenge him.\n\n‘Abby, why do you let this man lie on national television like this? That’s not right. You’re a liar, congressman.’ Boykins said. Phillips then quieted down both guests, regained control of the program and showed statistics from the Justice Department showing that crime in major categories like murder and rape have fallen.\n\nWant more stories like this from the Daily Mail? Visit our profile page and hit the follow button above for more of the news you need.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA CNN panelist attacked a prominent Florida Republican in a vicious on-air&#8230;\n\n\nThis Post: On-air disagreement between CNN panelist and GOP Byron Donalds regarding Trump first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/on-air-disagreement-between-cnn-panelist-and-gop-byron-donalds-regarding-trump/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-CNN-panelist-gets-in-on-air-spat-with.jpg","video":null,"publish_date":"2024-10-06 21:29:15","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.501},{"id":258698146,"title":"Here's the biggest news you missed this weekend","text":"A year on from Oct. 7, little hope for peace and a multifront conflict Monday marks a year since Hamas attacked Israel on October 7, kidnapping 251 people and killing up to 1,200 in an incursion that has taken the region to the brink of an all-out war. Israel’s subsequent military assault on Gaza has killed nearly 42,000 Palestinians, according to Gaza's health ministry, while a conflict between Israel and Hezbollah in Lebanon has left around 1,800 dead and driven 1.2 million from their homes. After a year of fighting, experts fear there is little framework for a lasting peace in Gaza, and the possibility of an uncontained conflict between Israel and Iran has inched closer. “There’s no endgame — it’s starting to feel like a forever war,” said Frank Lowenstein, special envoy for Israeli-Palestinian negotiations under President Barack Obama. The priority now is “not just about ending the war in Gaza, even temporarily, it’s also avoiding a war in Lebanon that I think we’re really concerned is going to spin out of control.” Some in Israel are also uneasy about where the situation could head. “If we are dragged into a large confrontation in the north with the Iran-Shiite axis,” said Yoram Schweitzer, the IDF’s former head of international counterterrorism, then “what we have seen in Gaza will look like children’s games.” Follow our live coverage here. Storm-battered Florida declares another emergency as Hurricane Milton approaches Tropical Storm Milton rapidly intensified into a Category 1 hurricane Sunday with its path aimed at Florida, less than two weeks after Hurricane Helene made landfall in the state. Gov. Ron DeSantis said in a briefing that Milton is expected to make landfall in Hillsborough or Pinellas county Wednesday evening. Since 1850, only two storms that originated in the Gulf’s Bay of Campeche have struck Florida. If Milton follows its current path, it would be the third. You can track Milton’s path through the Gulf of Mexico here. Trump strikes a defiant tone as he returns to site of assassination attempt Former President Donald Trump campaigned in Butler, Pennsylvania, on Saturday, returning to the city where a would-be assassin fired on him during a July rally. Trump held a moment of silence for Corey Comperatore, a rallygoer who was killed in the shooting. Billionaire Elon Musk joined Trump onstage, jumping up and down for the crowd and describing himself as “not just MAGA, I’m dark MAGA.” Ever since that assassination attempt, the Secret Service has been under serious scrutiny. A dozen current and former agents told NBC News that an increased workload and a lack of sufficient staffing have brought the Secret Service to “a breaking point” and “a state of crisis.” “The U.S. Secret Service is killing their people, and worse, they are supposed to have a zero-fail protective mission on zero rest/sleep,” said one former agent. “I love my agency, but they are setting themselves up for another incident.” Meet the Press Rep. Adam Schiff on Sunday echoed President Joe Biden’s remarks last week that the upcoming election would be “free and fair,” but maybe not “peaceful.” “If it is close, if Donald Trump loses again, as I expect that he will, he will contest it,” Schiff told “Meet the Press” moderator Kristen Welker. “He has more reason to contest it than he did before, not because of any flaw in the election, but because Donald Trump believes, and perhaps with reason, that if he doesn’t succeed at the ballot box, he may be going to jail. So he’s going to challenge the results.” Schiff pointed to the Jan. 6, 2021, riot at the Capitol as an example of the violence that unfolded in the wake of Trump’s baseless claims that the 2020 election was stolen from him. He added that he expects Harris to win the election but that “it is still scary close” and that larger-than-expected margins could stem the threat of violence related to the election result. You can watch the full interview here. Politics in brief Presidential promotions: With just weeks before the election, Trump has taken to promoting items and businesses that aren’t connected to his campaign, from a new cryptocurrency platform to NFT trading cards. Judicial vacancies: The next president is on track to enter office with the fewest number of vacant federal judgeships to fill in more than three decades, the culmination of both parties putting a high priority on confirming their preferred judges while in charge. Shadow of Notre Dame: A conservative Catholic law school that counts Justice Amy Coney Barrett among its former faculty has a growing influence over the Supreme Court. It is increasingly successful at placing students and professors in prestigious clerkships. Abortion rights ally: Former first lady Melania Trump on Sunday said her husband knew her position on abortion since the day they met. “I want to decide what I want to do with my body. I think I don’t want government in my personal business,” she said in a Fox News interview that aired Sunday. Records could help thousands prove they were poisoned at Camp Lejeune Leo Case survived the Battle of Iwo Jima and risked his life to save his crew during a clash in the South Pacific — only to die of multiple cancers at 58. In a quest to prove that he was sickened at Camp Lejeune, the Marine Corps training facility in North Carolina, his granddaughter amassed an archive of records that she said could help thousands of other veterans and their loved ones bolster their challenging water contamination cases. Up to 1 million people who lived or worked at Camp Lejeune from August 1953 to December 1987 may have been exposed to a drinking water supply contaminated with chemicals that have been linked to severe health problems, federal health officials said. ‘Microtrends’ make shopping a nightmare It’s trendy one day, passé the next. With the mill of TikTok aesthetics and microtrends constantly churning, shoppers feel disoriented and exhausted trying to keep up with the latest fashion. The fear of being “cheugy” in last month’s viral item gives many pause before they even start dressing. Marketing on apps like TikTok and Instagram has changed the landscape of fashion, experts say, making clothing more instantaneously accessible and trends gigantic but fleeting. “It has people lost,” one personal stylist says. 'Sunday Night Football' The Minnesota Vikings are still undefeated after a 23-17 win over the New York Jets in London.The Cleveland Browns fell to 1-4 against the Washington Commanders after another dispiriting performance by quarterback Deshaun Watson.Commanders punter Tress Way is one of the best in the NFL at his position. But thanks to a historically good offense, he’s barely had to run onto the field this season. In case you missed it Over 1 million acres of California have burned so far this year, and nearly half were the result of blazes allegedly set by arsonists, according to fire authorities and an NBC News review of state incident data.Video showed flames coming from underneath a Frontier plane that made a hard landing in Las Vegas after reports of smoke in the cockpit Saturday, officials said.Preservationists and community leaders are fighting to save one of the oldest and last remaining Japanese-owned farms in California, which is set to be demolished to pave the way for urban housing.Mickey Guyton has been a trailblazer in country music for years. Now, with artists like Beyoncé and Shaboozey making strides in the predominantly white industry, she’s happy to see a “country music renaissance happening.”Rabbis embrace Adam Brody’s “hot rabbi” in Neflix’s “Nobody Wants This,” but not its portrayal of Jewish women.Internet personality Jack Doherty crashed his $200,000 McLaren during a livestream this weekend after appearing to look at his phone while driving in the rain.","summary":"Israel carried out a new round of strikes on a Hezbollah stronghold in Beirut. Florida prepares for Hurricane Milton two weeks after Hurricane Helene.","url":"https://www.nbcnews.com/news/weekend-rundown-oct-6-rcna174139","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241005-Biltmore-ch-1217-dcdcd8.jpg","video":null,"publish_date":"2024-10-06 21:24:25","author":"Adrianne Morales,Josh Feldman,Nick Duffy","authors":["Adrianne Morales","Josh Feldman","Nick Duffy"],"language":"en","source_country":"us","sentiment":-0.321},{"id":258696170,"title":"How JD Vance could set himself up to be Trump's GOP successor","text":"Ohio Sen. JD Vance and Minnesota Gov. Tim Walz stepped onto the brightest stage of their careers during their unusually civil vice-presidential debate last week.The face-off largely went as expected: Vance sought to carry the banner for former President Donald Trump and conservatism, while Walz zeroed in on issues of importance to Democrats, seeking to boost Vice President Kamala Harris.But while Walz attacked Trump right out of the gate, Vance took a more balanced approach: He promoted the former president's brand of conservatism, but he also discussed his own philosophy.Immediately after the debate, CNN political analyst and former Trump administration aide Alyssa Farah Griffin remarked on Vance's ability to communicate with Trump's supporters while also calling him a \"chameleon\" who sought to make inroads with more voters.\"I don't know that this moves the needle, but I do think it solidifies his place as the MAGA heir apparent,\" she said in a post-debate analysis.Here's a look at some of the recent steps Vance has taken to solidify his GOP credentials ahead of a potential 2028 campaign.Trump has defined the Republican Party for nearly a decade, with the June 2015 campaign launch of his 2016 presidential campaign setting into motion a broad rebrand of the GOP.Republicans like Florida Gov. Ron DeSantis and former UN ambassador Nikki Haley earlier this year sought to articulate their own visions for what a post-Trump GOP could look like during their unsuccessful presidential campaigns.But Trump easily secured his third presidential nomination, reflecting the longstanding appeal that he has with many conservatives.But what will happen to the party in 2028, whether or not Trump wins in November? Who will take up the party's mantle? Right now it looks like it could be Vance.Vance has enjoyed a national profile since publishing \"Hillbilly Elegy\" in 2016. He expanded that profile when he was elected to the Senate in 2022.But Trump's decision to tap Vance as his running mate took the senator's young political career to heights that have surpassed many of the more experienced Republicans on Capitol Hill — including onetime presidential candidates like South Carolina Sen. Tim Scott and Texas Sen. Ted Cruz.For a party that could face an identity crisis after Trump no longer dominates it, Vance is someone who could offer a transition, appealing to both moderate Republicans and Trump's \"MAGA\" base.During the debate, Vance showed that he could walk that line. He brushed aside questions about the 2020 presidential election results and the events of January 6, 2021, largely following the lead of other prominent pro-Trump Republicans. It showed that despite Vance's efforts to take on a more congenial persona, there'd still be plenty of pro-Trump signals of support.Mike Nellis, a former Harris senior advisor and \"White Dudes for Harris\" organizer, told Business Insider after the debate that Vance leaned into the Trump political brand in a way that would appeal to conservative decision-makers, who will have to envision a GOP universe where the ex-president isn't the top figure.\"What he did do was articulate MAGA policies in a much more articulate and thoughtful way than what you hear from Donald Trump,\" he said. \"And there is value to that, but there's value to that amongst a very small class of people, many of whom are positioning Vance to be the future of the MAGA movement.\"Of course, 2028 is a long way off, and Republicans remain focused on Trump's reelection campaign, as Vance's spokesperson, William Martin, made clear in a statement.\"The only thing Senator Vance is thinking about is making sure we put President Donald J. Trump back in the White House,\"he said. \"If we come up short this November, what happens in 2028 won't matter because this country will be beyond saving.\"","summary":"Vance has embraced Trump's MAGA political brand. But during last week's debate, he seemed on a mission to raise his own standing ahead of 2028.","url":"https://www.businessinsider.com/jd-vance-trump-gop-future-vice-presidential-debate-2024-10","image":"https://i.insider.com/66fd97cf7de5c8fd4834c276?width=1136&format=jpeg","video":null,"publish_date":"2024-10-06 21:23:33","author":"John L. Dorman,Katherine Tangalakis-Lippert","authors":["John L. Dorman","Katherine Tangalakis-Lippert"],"language":"en","category":"politics","source_country":"US","sentiment":0.285},{"id":258695370,"title":"The best memes of Elon Musk jumping at Trump's Butler rally","text":"Elon Musk, the billionaire CEO of Tesla and SpaceX, drew significant attention on Saturday at his first Donald Trump rally in Butler, Pennsylvania, aligning himself with the former president as the 2024 election looms. Dressed in a black \"Make America Great Again\" cap and an \"Occupy Mars\" shirt, Musk energized the crowd by declaring himself \"Dark MAGA\" and warning, \"This will be the last election if Trump doesn’t win.\" His spirited entrance, highlighted by a dramatic jump onto the stage, quickly went viral, sparking a flurry of memes on social media, especially on X.Here are some of the best memes and jokes:— Marmel (@Marmel) — IamHappyToast (@IamHappyToast) — SethAbramson (@SethAbramson) — joncoopertweets (@joncoopertweets) — JahnZilch (@JahnZilch) — DrTemperTantrum (@DrTemperTantrum) — benjpalmer (@benjpalmer) — davidviola (@davidviola) — RadioFreeTom (@RadioFreeTom) — DoctorLFC (@DoctorLFC) Elon Musk, the CEO of Tesla, SpaceX, and X (formerly Twitter), publicly endorsed Donald Trump on the same day as an assassination attempt against the former president, sharing a video of Trump raising his fist on his official X account with the caption, “I fully endorse President Trump and hope for his rapid recovery.” Throughout the election cycle, Musk has remained a steadfast supporter, even establishing a super PAC dedicated to boosting Trump’s campaign through intensive voter outreach efforts in the critical final months. This admiration appears to be reciprocated, as Trump has expressed intentions to appoint Musk to a task force focused on implementing significant cuts to government spending should he return to the White House.","summary":"Elon Musk made headlines by appearing at Donald Trump's rally in Butler, Pennsylvania. Sporting a 'MAGA' cap and 'Occupy Mars' shirt, Musk dubbed himself 'Dark MAGA' and stressed the importance of Trump's victory in the 2024 election. He has established a super PAC to support Trump and shared a video endorsing the former president amidst an assassination attempt.","url":"https://timesofindia.indiatimes.com/world/us/the-best-memes-of-elon-musk-jumping-at-trumps-butler-rally/articleshow/113993775.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-113993821/113993821.jpg","video":null,"publish_date":"2024-10-06 21:22:19","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.029},{"id":258697038,"title":"Harris refuses to call Netanyahu an ‘ally’","text":"US Vice President Kamala Harris has refused to say whether she considers Israeli Prime Minister Benjamin Netanyahu a “close ally,” after the latter ignored her administration’s calls for a ceasefire in Lebanon. In a ‘60 Minutes’ interview set to air on CBS News on Sunday night, Harris was asked how the US can supply Israel with billions of dollars’ worth of military aid, while seemingly exercising “no sway” over Netanyahu. After a rambling answer in which she claimed that the US has pushed Netanyahu closer to ending his ongoing war in Gaza and Lebanon, Harris was asked again whether the US has “a real close ally in Prime Minister Netanyahu?” “I think, with all due respect, the better question is do we have an important alliance between the American people and the Israeli people,” she responded. “And the answer to that question is yes.” \n\nEver since she replaced President Joe Biden as the Democratic presidential candidate in July, Harris’ position on Israel has come under fire from both pro-Israeli and pro-Palestinian factions within the party. Apparently attempting to placate both sides, Harris declared her support for an independent Palestinian state at the Democratic National Convention in August, before immediately promising that she would continue to supply Israel with arms and ammunition. Netanyahu, who is widely believed to favor Donald Trump in the upcoming US presidential election, has spoken to and met with Biden and Harris on multiple occasions since he declared war on Hamas last October. Following these conversations, Biden and Harris have both claimed that the Israeli leader is moving toward a ceasefire, only for Netanyahu to return to Israel and promise to continue waging war. Most recently, Netanyahu agreed to a ceasefire proposal drawn up by the US and France, before backing out at the last moment and ordering the assassination of Hezbollah leader Hassan Nasrallah in Beirut, American and other Western officials claimed last month. Two days later, he again defied American calls for de-escalation by sending ground troops into Lebanon, and on Tuesday he vowed to make Iran “pay for” a missile attack on Israel, despite US officials urging him to avoid any steps that may trigger a wider regional war. “Whether he’s trying to influence the election, I don’t know,” Biden told reporters on Friday. Biden followed this comment with a reminder to the Israeli leader. “No administration has helped Israel more than I have. None, none, none,” he said. “And I think [Netanyahu] should remember that.”","summary":"Vice President Kamala Harris has said that the US’ loyalties lie with the Israeli people rather than their leader \nRead Full Article at RT.com","url":"https://www.rt.com/news/605331-kamala-harris-israel-netanyahu/","image":"https://mf.b37mrtl.ru/files/2024.10/article/6702f12185f54033de615727.jpg","video":null,"publish_date":"2024-10-06 21:20:30","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.123}]}