{"offset":0,"number":50,"available":10828,"news":[{"id":388535008,"title":"Trump Official Pulls $5.5 Million in SBA Funds From Minnesota","text":"The Trump administration is halting $5.5 million in annual funding to Minnesota over allegations that individuals and businesses in the state committed fraud with government loans, according to a social media post from the US Small Business Administration.The move is the latest in a series of examples of the federal government withholding funds from states and cities led by Democrats. The announcement comes as Republicans ramp up investigations into alleged fraud in Minnesota, including some groups that received COVID-era emergency loans. President Donald Trump and his administration recently have focused attention on the cases of alleged fraud, criticizing Minnesota Governor Tim Walz, claiming he mishandled the administration of government funds. Trump last month announced he was revoking temporary protected status for Somali refugees living in the state, citing accusations Somalis were involved in fraud. SBA Administrator Kelly Loeffler announced she would halt $5.5 million in small business funding going to the state “pending further review” in a post on X on Tuesday.“With dozens of investigations underway, the conclusion is unavoidable: Minnesota cannot be trusted to administer federal tax dollars,” she said in the post, which didn’t provide further details on what funds would be halted.Claire Lancaster, a spokesperson for Walz, blasted the Trump administration for seeking to blame the Minnesota governor rather than addressing weaknesses in federal programs.“While the Governor has been fighting fraud, the Trump administration has spent the past month sending dozens of letters, statements, and social media posts filled with threats to withhold funding and investigate the state,” Lancaster said in a statement. She said the alleged frauds “exposed failures within federal systems” that “are administered and overseen by the federal government and which have nothing to do with the Walz Administration.”The House Small Business Committee on Tuesday sent a letter to Loeffler requesting information about federal pandemic relief funds flowing to entities in Minnesota connected to the fraud scandal.The Minnesota nonprofit Feeding Our Future was at the center of the largest pandemic relief fraud charged in US history, according to the Justice Department. Dozens of individuals have been charged in connection with that case as of November.Loeffler and the SBA did not immediately respond to requests for comment.©2025 Bloomberg L.P.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/companies/news/trump-official-pulls-5-5-million-in-sba-funds-from-minnesota-11766517903434.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/company_2_1733465085102_1733465089141.png","video":null,"publish_date":"2025-12-24 19:25:02","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.251},{"id":388535002,"title":"New Epstein files include FBI record alleging rape involving Trump, based on unverified tip","text":"One of the newly released documents linked to the Jeffrey Epstein case includes an FBI case file dated October 2020 that contains an allegation of rape involving Donald Trump, who was not president at that time. The allegation appears in a tip submitted to the FBI on October 27, 2020, just a week before that year’s presidential election.The document, identified as EFTA00020517, does not name the alleged victim or the source of the allegation, as identifying details have been redacted.Account from Limousine driverAccording to the FBI record, the tipster relayed a conversation with a limousine driver who claimed to have chauffeured Trump in Dallas in 1995. The driver reportedly described a “very concerning” phone call Trump made while being driven to an airport.The document states that Trump “continuously stated the name ‘Jeffrey’ while on the phone, and made references to ‘abusing some girl’,” according to the driver’s account.Allegation of rape cited in fileThe FBI document further references statements attributed to another unnamed individual, whose identity has been redacted. According to the file, that person alleged:“Donald J. Trump had raped her along with Jeffrey Epstein.”Another quoted line in the document reads: “He raped me,” referring to Trump.The file adds that the unnamed individual claimed: “Some girl with a funny name took me into a fancy hotel or building, that’s how it happened.”Unverified claims, redacted sourcesThe document does not indicate whether the allegations were corroborated or investigated further. All names, locations, and identifying details remain redacted, and the FBI record does not establish the credibility of the claims.New Epstein files reference Trump’s travel on financier’s private jetThe FBI file is part of a broader release of thousands of records related to Epstein and his associates.A new batch of files released on Tuesday (December 23) by the US government in connection with the late convicted sex offender Jeffrey Epstein includes multiple references to President Donald Trump, according to the documents. The release consists of roughly 8,000 files, including hundreds of video and audio recordings.Among the newly released records is a January 2020 note from New York federal prosecutors investigating Epstein’s longtime associate Ghislaine Maxwell. The note states that Trump had traveled on Epstein’s private jet more frequently than previously reported.“Records we received yesterday reflect that Donald Trump traveled on Epstein's private jet many more times than previously has been reported (or that we were aware),” the prosecutors wrote.Ongoing scrutiny of Epstein’s networkThe release has renewed public attention on Epstein’s ties to powerful figures. Epstein died in federal custody in August 2019, with his death officially ruled a suicide.","url":"https://www.livemint.com/news/us-news/new-epstein-files-include-fbi-record-alleging-rape-involving-trump-based-on-unverified-tip-11766516379954.html","image":"https://www.livemint.com/lm-img/img/2025/12/23/1600x900/logo/TRUMP-ACCOUNTS-17_1764727488489_1764727498795_1766517501502.jpg","video":null,"publish_date":"2025-12-24 19:19:32","author":"Ravi Hari","authors":["Ravi Hari"],"language":"en","category":"politics","source_country":"in","sentiment":-0.455},{"id":388575586,"title":"US Supreme Court Refuses Deployment Of National Guard In Chicago","text":"The United States Supreme Court on Tuesday (local time) refused to deploy the National Guard in Chicago, over the objection of Illinois officials, amid doubts about the viability of such deployments in other cities, the New York Times reported.The preliminary order barred the Trump administration from directing a state-based military force to the Chicago area, where an immigration enforcement drive had triggered arrests and confrontations between residents and federal authorities.The court declined to grant the president wide-ranging discretion to deploy the military in American cities.The New York Times reported that at this stage in the case, the court said the Trump administration had not shown that the statute at issue permits the president to federalise the Guard in the exercise of inherent authority to protect federal personnel and property in Illinois.Three conservative justices, Clarence Thomas, Samuel A Alito Jr., and Neil M Gorsuch, dissented.Donald Trump had earlier ordered the National Guard to Portland, Los Angeles, and Washington, D.C.Federal law allows the president to federalise the National Guard without the permission of state officials in certain circumstances, including in cases of rebellion or danger of a rebellion against the government or when law enforcement cannot execute US law.An appeals court in Washington had allowed troops to remain in the US capital while litigation continues, citing the citys unique status as a federal district.Meanwhile, the Pentagon decided in November to withdraw several out-of-state soldiers from Illinois and Oregon, while keeping local troops activated.This comes in the backdrop of street protests against the National Guard and incidents of violence in Washington, including a targeted attack on November 26 in which two National Guard personnel were assaulted, leaving one dead and another critically injured.","url":"https://zeenews.india.com/world/us-supreme-court-refuses-deployment-of-national-guard-in-chicago-2999460.html","image":"https://english.cdn.zeenews.com/sites/default/files/2025/12/24/1882244-article-gallery.jpg?im=Resize=(1200,900)","video":null,"publish_date":"2025-12-24 01:10:18","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.28},{"id":388576144,"title":"'Fake' note about Trump in Epstein files, Justice Department says","text":"The US government says newly released documents from the Epstein files contain \"untrue and sensationalist\" claims about Donald Trump.\n\nThe Department of Justice (DOJ) has published almost 30,000 new documents after failing to meet a deadline for the release of all the files last week.\n\nThe US president is mentioned multiple times in the new release.\n\nBut in a series of tweets, the DOJ cast doubt on some of the documents, including what it called a \"fake\" note from Jeffrey Epstein that mentioned Mr Trump.\n\nMany individuals have been named in the documents, which does not necessarily imply wrongdoing.\n\nSome politicians and officials had for years opposed the mass release of the files for this very reason: because the documents could include informant tips and other information that is difficult to verify.\n\nMr Trump's relationship with Epstein has long been scrutinised. His chief of staff, Susie Wiles, conceded in an interview published last week that he was in the files.\n\nThousands more documents are expected to be released in the coming weeks. It is unclear whether the president will continue to feature in them.\n\nHere is some of the stand-out material from the files so far, and what we've been told about what's real and what's not.\n\nClaim against Trump\n\nWhen it released the files, the Department of Justice said they contained \"untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election\".\n\nThat appears to be a reference to a document about a phone call received by the FBI in October that year.\n\nThe caller, a former limousine driver, said he had driven Mr Trump to Dallas airport in 1995, according to a record of the call.\n\nRedactions in the document make some details unclear. But it appears the limousine driver told the FBI that, four years after he drove Mr Trump to the airport, he had a conversation with a woman about it.\n\nHe told the woman he had overheard Mr Trump speaking on his mobile phone during the trip.\n\nThe call record says:\n\n\"[Redacted name] reported some of [the] things President Trump had spoken about during the ride while on his cell phone were very concerning.\"[Redacted] reported he was 'a few seconds from pulling him out of the car and hurting him due to some of [the] things he was saying' as caller choose not to.\"[Redacted] noted Trump continuously stated the name 'Jeffrey' while on the phone, and made references to 'abusing some girl'.\"\n\nAccording to the account given to the FBI, the woman turned \"stone cold\" as she was hearing about Mr Trump. She then said that Mr Trump and Epstein had raped her:\n\n\"[Redacted] said 'what' as [redacted] replied 'Donald J Trump had raped her along with Jeffrey Epstein'.\"[Redacted] noted some girl with a funny name 'took me into a fancy hotel or building, that's how it happened'.\"\n\nThe FBI report does not say what action, if any, was taken to follow up on the call. But there is nothing to suggest investigators suspected Mr Trump of wrongdoing or found any evidence to support the claim.\n\nThe Department of Justice said:\n\n\"To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponised against President Trump already.\"Nevertheless, out of our commitment to the law and transparency, the DOJ is releasing these documents with the legally required protections for Epstein's victims.\"\n\nThe White House was also contacted for comment. It referred the ABC back to the DOJ statement.\n\nProsecutor's note about Trump's trips on Epstein's jet\n\nA 2020 email from a prosecutor in New York says Mr Trump travelled on Epstein's private jet many more times than had been previously reported.\n\nThe email, from an assistant US attorney whose name was redacted, says Mr Trump's name was listed in flight logs for at least eight trips between 1993 and 1996.\n\nEpstein's co-offender Ghislaine Maxwell was listed on at least four of those flights.\n\nMr Trump's then-wife Marla Maples, his daughter Tiffany and his son Eric were also on some of the flights, the email says.\n\nBut Mr Trump and Epstein were the only passengers on one of the flights, according to the email. On another flight, Mr Trump and Epstein travelled with an unnamed 20-year-old.\n\nThe prosecutor wrote:\n\n\"For your situational awareness, wanted to let you know that the flight records we received yesterday reflect that Donald Trump travelled on Epstein's private jet many more times than previously has been reported (or that we were aware), including during the period we would expect to charge in a Maxwell case.\"\n\nIn 2024, Mr Trump wrote on social media: \"I was never on Epstein's Plane, or at his 'stupid' Island.\" He was responding to AI-generated images that depicted him on Epstein's jet, which had spread online.\n\nLetter from a royal residence seeking 'inappropriate friends'\n\nAmong the pages of private correspondence in the files is a 2001 email to Ghislaine Maxwell from \"A\" at the \"Balmoral Summer Camp for the Royal Family\".\n\nThe author of the email asks Maxwell if she has found any \"new inappropriate friends\" for him.\n\nThough the sender's identity cannot be verified, there are many details that link it to Andrew Mountbatten-Windsor, the former duke of York who was recently stripped of his royal titles.\n\nThe then-prince was friends with Epstein and Maxwell, who is now in jail for recruiting and grooming victims for Epstein. He has for years denied allegations of abuse linked to Epstein.\n\nThe writer of the email complained of being \"totally exhausted at the end of the day\" and said \"the girls\" were \"completely shattered\".\n\nHe continued:\n\n\"How's LA? Have you found me some new inappropriate friends? …I want to go somewhere hot and sunny with some fun people before having to put my nose firmly to the grindstone for the fall.\"\n\nMaxwell replied:\n\n\"So sorry to disappoint you, however the truth must be told. I have only been able to find appropriate friends.\"\n\nAnother document shows that US authorities wanted to interview Mr Mountbatten-Windsor about his relationships with Epstein and another convicted sex offender, Peter Nygard.\n\nThe DOJ sent a formal request to the British government for help setting up a \"voluntary\" interview, or to conduct a \"compelled interview\" if Mr Mountbatten-Windsor did not cooperate.\n\nIt said Mr Mountbatten-Windsor \"may have been a witness to and/or participant in certain events of relevance\" to its investigation into Epstein.\n\nIt also said investigators found Mr Mountbatten-Windsor \"travelled to Nygard Cay in the Bahamas, a location where Nygard is believed to have trafficked minor and adult female victims\".\n\nBut it said Mr Mountbatten-Windsor was \"not presently a target\" of either investigation.\n\n'Fake' letter to Larry Nassar\n\nThe files include what looks like a handwritten note from Jeffrey Epstein to another well-known paedophile, Larry Nassar — though the DOJ says it is fake.\n\nNassar is a former US gymnastics team doctor. He was jailed in 2018 for 175 years for abusing young female gymnasts.\n\nThe note to Nassar was purportedly written just before Epstein died in 2019. It says:\n\n\"As you know by now, I have taken the 'short route' home. Good luck! We shared one thing… our love & caring for young ladies and the hope they'd reach their full potential.\"Our president also shares our love of young, nubile girls. When a young beauty walked by he loved to 'grab snatch', whereas we ended up snatching grub in the mess halls of the system.\"Life is unfair.\"\n\nThe documents indicate the note never reached Nassar and was returned to sender.\n\nThe DOJ later said the FBI had found the note was fake. The postmark on the envelope was from a different state to where Epstein was jailed, the return address was for the wrong jail, it did not include Epstein's inmate number as required, and the envelope was processed three days after Epstein's death.\n\nIt was \"a reminder that just because a document is released by the Department of Justice does not make the allegations or claims within the document factual\", the DOJ wrote on X.\n\nIn 2023, the Associated Press reported that the letter existed, but its contents were not revealed at that time.\n\nAngry reaction\n\nSome of Epstein's victims, survivors and accusers are furious with how the file release has been handled so far.\n\nUnder legislation passed by Congress last month, all relevant files should have been published on December 19.\n\nThe Department of Justice has argued the process has been held up by its work to redact victims' details, but hundreds of thousands of files would be released soon after the deadline.\n\nMore than a dozen women who said they were victims of Epstein signed a letter posted online on Monday, local time.\n\n\"The public received a fraction of the files … riddled with abnormal and extreme redactions with no explanation,\" it said. \"At the same time, numerous victim identities were unredacted, causing real and immediate harm.\"\n\nThey also complained the department had not been communicating with survivors, and the files were released in a way that made it \"difficult or impossible\" to find what they were looking for.\n\n\"While clearer communication would not change the fact that a law was broken, its absence suggests an ongoing intent to keep survivors and the public in the dark as much as possible,\" the letter said.\n\nDemocrats say the latest files raise new questions about Mr Trump's relationship with Epstein.\n\nFormer president Bill Clinton featured heavily in the photos that were initially published. His spokesman accused the Trump administration of selectively releasing material to shield \"themselves from what comes next, or from what they'll try and hide forever\".","summary":"The US government says newly released documents from the Epstein files contain \"untrue and sensationalist\" claims about Donald Trump.","url":"https://www.abc.net.au/news/2025-12-24/epstein-files-contain-fake-documents-us-justice-department-says/106173212","image":"https://live-production.wcms.abc-cdn.net.au/26f50e2a701b359b949b3b73721cfcac?impolicy=wcms_crop_resize&cropH=643&cropW=1143&xPos=0&yPos=57&width=862&height=485","video":null,"publish_date":"2025-12-24 01:08:12","author":"Brad Ryan,Patrick Martin","authors":["Brad Ryan","Patrick Martin"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.506},{"id":388575728,"title":"New Epstein files dump contains multiple Trump references","text":"A new batch of Jeffrey Epstein files released on Tuesday (December 23, 2025) contains numerous references to U.S. President Donald Trump, including documents detailing flights he took on his then friend’s private jet, and other claims that his Justice Department described as “untrue and sensationalist.”\n\nThe latest release contains reams of previously unseen material from the investigation into Epstein, a wealthy U.S. financier who died in jail in 2019 while awaiting trial for sex trafficking underage girls.\n\nA first collection of heavily redacted files made public last Friday sparked criticism that the Justice Department was deliberately excluding references to Trump.\n\nMr. Trump figures prominently, however, in the thousands of documents published on Tuesday, underlining his close ties to the disgraced financier who was already a convicted sex offender when the more serious trafficking case began.\n\nThe Justice Department issued a statement defending the 79-year-old Republican shortly after the files dropped, saying some documents “contain untrue and sensationalist claims made against President Trump.”\n\nMr. Trump, who is not accused of any wrongdoing, fought for months to prevent the release of the vast trove of documents about Epstein.\n\nBut a rebellion inside Mr. Trump’s Republican Party forced him to sign off on a law mandating release of all the documents.\n\nThe extraordinary move reflected intense political pressure to address what many Americans, including Mr. Trump’s own supporters, have long suspected to be a cover-up to protect rich and powerful men in Epstein’s orbit.\n\nPrivate jet trips\n\nMr. Trump said on Monday he did not approve of the file dumps, expressing concern that people who “innocently met” Epstein over the years risked having their reputations smeared.\n\n“Everybody was friendly with this guy,” he said. He did not immediately react to Tuesday’s release.\n\nDespite attempts to distance himself, Mr. Trump was friends for years with Epstein and has given different accounts of how he ended their relationship.\n\nMost recently, he said he threw him out of his Florida golf club for being “a creep.” However, he has also said they fell out when Epstein “stole” young women working in the spa at his club.\n\nThe latest documents add to evidence that Mr. Trump was close to Epstein.\n\nThey include a January 2020 note from New York federal prosecutors who were investigating Epstein’s associate, Ghislaine Maxwell, detailing Trump’s repeated travel — eight trips between 1993 and 1996 — on the financier’s private jet.\n\n“Records we received yesterday reflect that Donald Trump traveled on Epstein’s private jet many more times than previously has been reported (or that we were aware),” it says.\n\nOne flight reportedly had just three passengers: Epstein, Trump and an unidentified 20-year-old.\n\nOne Trump reference was swiftly disputed by the Department of Justice. A handwritten letter released in Tuesday’s tranche was purportedly written by Epstein, while in jail, to Larry Nassar, the former U.S. gymnastics doctor who was imprisoned over rampant abuse of female athletes.\n\nEpstein is shown complaining to Nassar that they are incarcerated while the “president shares our love of young, nubile girls. When a young beauty walked by he loved to ‘grab snatch.’”\n\nIn a statement the DOJ said the FBI “has confirmed this alleged letter from Jeffrey Epstein to Larry Nassar is FAKE,” saying it was postmarked three days after Epstein’s death, and entered the mail system in Virginia, despite him being jailed in New York.\n\nTrump critics say the government continues to slow-walk the release of embarrassing material.\n\nAt least two emails in the cache mention 10 unidentified “co-conspirators” of Epstein, and Democratic Senate Minority Leader Chuck Schumer called for the Justice Department to look into potential Epstein accomplices.\n\n“The Department of Justice needs to shed more light on who was on the list, how they were involved, and why they chose not to prosecute,” the senator said.\n\nMaxwell, Epstein’s former girlfriend, remains the only person convicted in connection with his crimes.","summary":"The U.S. Justice Department issued a statement defending the President shortly after the files dropped, saying some documents “contain untrue and sensationalist claims”","url":"https://www.thehindu.com/news/international/new-epstein-files-dump-contains-multiple-trump-references/article70432283.ece","image":"https://th-i.thgim.com/public/incoming/afxta6/article70432279.ece/alternates/LANDSCAPE_1200/2025-12-23T163207Z_456590441_RC29MIA16M4V_RTRMADP_3_USA-TRUMP-EPSTEIN-FILES.JPG","video":null,"publish_date":"2025-12-24 01:04:13","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.251},{"id":388575722,"title":"Venezuela seeks to criminalise oil tanker seizures as Trump puts pressure on Maduro","text":"Venezuela's parliament on Tuesday (December 23, 2025) approved a measure that criminalises a broad range of activities that can hinder navigation and commerce in the South American country, such as the seizure of oil tankers.\n\nThe Bill — introduced, debated and approved within two days in the National Assembly — follows this month's seizures by U.S. forces of two tankers carrying Venezuelan oil in international waters. The seizures are the latest strategy in U.S. President Donald Trump's four-month pressure campaign on Venezuela's leader Nicolás Maduro.\n\nAlso Read | Trump says it would be ‘smart’ for Venezuela’s Maduro to leave power\n\nThe tankers are part of what the Trump administration has said is a fleet Venezuela uses to evade U.S. economic sanctions.\n\nThe unicameral Assembly, which is controlled by Venezuela's ruling party, did not publish drafts on Tuesday nor the final version of the measure. But as read on the floor, the Bill calls for fines and prison sentences of up to 20 years for anyone who promotes, requests, supports, finances or participates in “acts of piracy, blockades or other international illegal acts” against commercial entities operating with the South American country.\n\nVenezuela's political Opposition, including Nobel Peace laureate María Corina Machado, has expressed support for Mr. Trump's Venezuela policy, including the seizure of tankers.\n\nThe Bill, which now awaits Mr. Maduro's signature, also instructs the executive branch to come up with “incentives and mechanisms for economic, commercial and other protections” for national or foreign entities doing business with Venezuela in the event of piracy activities, a maritime blockade or other unlawful acts.\n\nThe U.S. Coast Guard seized a Panama-flagged vessel called Centuries on Saturday, officials said, which was part of a fleet transporting sanctioned cargo. With assistance from the US Navy, it seized a rogue tanker called Skipper on December 10. That ship was registered in Panama.\n\nMr. Trump, after that first seizure, said the U.S. would carry out a “blockade” of Venezuela. He has repeatedly said that Mr. Maduro's days in power are numbered.\n\n“If he wants to do something, if he plays tough, it'll be the last time he'll ever be able to play tough,” Mr. Trump said of Mr. Maduro on Monday (December 22) as he took a break from his Florida vacation to announce plans for the Navy to build a new, large warship.","summary":"Venezuela's political Opposition, including Nobel Peace laureate María Corina Machado, has expressed support for Mr. Trump's Venezuela policy, including the seizure of tankers.","url":"https://www.thehindu.com/news/international/venezuela-seeks-to-criminalise-oil-tanker-seizures-as-trump-puts-pressure-on-maduro/article70432276.ece","image":"https://th-i.thgim.com/public/incoming/305lvp/article70432278.ece/alternates/LANDSCAPE_1200/2025-12-19T090146Z_1084623109_RC2XDIAZ14B6_RTRMADP_3_VENEZUELA-CRISIS-DEBT-RESTRUCTURING.JPG","video":null,"publish_date":"2025-12-24 00:50:37","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.045},{"id":388575962,"title":"Israel tiada rancangan bina semula penempatan di Gaza","text":"BAITULMAQDIS: Menteri Pertahanan Israel, Israel Katz, menafikan sebarang rancangan untuk membina semula penempatan di Gaza selepas kenyataan awalnya mencetuskan kekeliruan dan kebimbangan antarabangsa.\n\nPenafian itu dibuat susulan laporan media yang memetik Katz memberi bayangan bahawa Israel berhasrat untuk kembali menduduki wilayah berkenaan secara kekal.\n\nTindakan itu bercanggah sama sekali dengan pelan damai Presiden Amerika Syarikat (AS), Donald Trump, yang mahu membangunkan semula wilayah berkenaan untuk diduduki warga Palestin.\n\nTerdahulu, ketika berucap di kawasan penempatan haram Israel di Tebing Barat, Katz menyatakan tentera Israel tidak akan keluar sepenuhnya dari Gaza dan merancang untuk menempatkan unit 'Nahal'.\n\nUnit Nahal merujuk kepada penempatan awal yang disusuli dengan pembukaan perkampungan atau wilayah baharu masyarakat Israel, yang lazimnya dilakukan secara haram, baik di Tebing Barat mahupun Gaza. \n\nBagaimanapun, pejabat Katz kemudian mengeluarkan kenyataan susulan bagi memperbetulkan keadaan.\n\n\"Kerajaan tidak mempunyai niat untuk menubuhkan penempatan di Gaza. Rujukan mengenai integrasi unit Nahal di utara Gaza adalah dibuat semata-mata atas konteks keselamatan,\" katanya dalam satu kenyataan penjelasan.\n\nBerdasarkan pelan Gaza tajaan AS yang ditandatangani Israel dan Hamas pada Oktober lalu, tentera Israel sepatutnya berundur secara berperingkat dari wilayah terkepung itu dan tidak dibenarkan membina penempatan awam.\n\nJurucakap Hamas, Hazem Qassem, menegaskan kenyataan asal Katz adalah pencabulan jelas terhadap perjanjian gencatan senjata dan bertentangan sepenuhnya dengan pelan Trump.\n\nDi Washington, seorang pegawai AS menegaskan bahawa pentadbiran mereka kekal komited terhadap Pelan Damai 20-Perkara Trump dan mengharapkan semua pihak mematuhi komitmen masing-masing.\n\nKenyataan awal Katz itu dibuat di penempatan Beit El, berhampiran Ramallah, di mana beliau turut mengumumkan pembinaan 1,200 unit rumah baharu di Tebing Barat.\n\n\"Apabila tiba masanya, di utara Gaza, kita akan menubuhkan unit (tentera) Nahal bagi menggantikan komuniti (Israel) yang dipindahkan sebelum ini. \n\n\"Kita akan melakukannya dengan cara yang betul pada masa yang sesuai,\" katanya sebelum ini.\n\nKatz turut menegaskan kepentingan kehadiran tentera Israel demi keselamatan jangka panjang.\n\n\"Kami berada jauh di dalam Gaza dan tidak akan meninggalkannya sepenuhnya. Kami berada di sana untuk melindungi dan menghalang apa yang telah berlaku (serangan) daripada berulang. \n\n\"Kami tidak percaya kepada pihak lain untuk melindungi warganegara kami,\" katanya sambil memberi isyarat turut ada keperluan sama di Lubnan dan Syria.\n\nIsu ini timbul ketika Perdana Menteri Israel, Benjamin Netanyahu, dijadualkan bertemu dengan Trump di Rumah Putih minggu depan bagi membincangkan pelaksanaan fasa seterusnya pelan damai itu.\n\nWalaupun Netanyahu sebelum ini berulang kali menolak kemungkinan membina semula penempatan di Gaza, beliau berdepan tekanan daripada ahli gabungan sayap kanan dalam kerajaannya yang mendesak pendudukan semula wilayah itu. - REUTERS","summary":"BAITULMAQDIS: Menteri Pertahanan Israel, Israel Katz, menafikan sebarang rancangan untuk membina semula penempatan di Gaza selepas kenyataan awalnya mencetuskan kekeliruan dan kebimbangan antarabangsa.","url":"https://www.bharian.com.my/dunia/asia/2025/12/1488684/israel-tiada-rancangan-bina-semula-penempatan-di-gaza","image":"https://assets.bharian.com.my/images/articles/bh24sett-o_BHfield_image_listing_featured.var_1766536779.jpg","video":null,"publish_date":"2025-12-24 00:39:44","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.467},{"id":388573848,"title":"MAGA influencers 'conspicuously quiet' after Trump named in new Epstein files: NYT","text":"New York Times writer Alan Feuer says pro-Trump influencers have “always had a lot to say about the Jeffrey Epstein files.”\n\nSeveral called for the files release before President Donald Trump was re-elected, certain they would “expose a cabal of Democrats who had palled around” with Epstein after he’d been exposed as a convicted sex offender, said Feuer. Several more criticized Trump this year as he sought to block the files’ release, calling them a “Democratic hoax.”\n\n“But many of them were conspicuously quiet on Tuesday, when the Justice Department released a batch of materials that contained hundreds of mentions of Mr. Trump,\" Feuer said. “Their silence contrasted with the uproar made over the weekend when the department’s first release focused on former President Bill Clinton, including an image, stripped of context, showing him reclining in a hot tub. MAGA influencer Laura Loomer – also known as Trump's unofficial \"loyalty enforcer\" — mocked Clinton on social media after the photos emerged.\n\n“On Tuesday, however, Ms. Loomer said nothing about the newly released materials, which showed, among other things, that federal prosecutors had determined that Mr. Trump had flown on Mr. Epstein’s private plane more times than they originally knew,” Feuer noted. “Instead, Ms. Loomer seemed to post about everything except the Epstein files: immigrant work visas; ‘anti-white racism’; next year’s midterm elections; and Zohran Mamdani, the mayor-elect of New York.”\n\nFeuer identified similar silence with conservative influencer Rogan O’Handley, who posts on X under the handle DC Draino. On Friday, O’Handley was also berating Clinton, writing how the Epstein files had depicted him “shirtless in a hot tub with a female that is not his wife.”\n\n“But on Tuesday, Mr. O’Handley had nothing at all to say about the files,” said Feuer. \n\nThe same went for pro-Trump podcaster and “The Benny Show,” host Benny Johnson, who Feuer said much preferred posting about fired transgender instructors rather than Epstein.\n\n“One Trump-friendly account did, however, post about the newly released files: the one run by the Justice Department,” said Feuer, adding that the department quickly jumped to defend the president as if they were his personal troupe of lawyers.","summary":"New York Times writer Alan Feuer says pro-Trump influencers have “always had a lot to say about the Jeffrey Epstein files.”\n\nSeveral called for the files release before President Donald Trump was re-elected, certain they would “expose a cabal of Democrats who had palled around” with Epstein after he’d been exposed as a convicted sex offender, said Feuer. Several more criticized Trump this year as he sought to block the files’ release, calling them a “Democratic hoax.”\n\n“But many of them were conspicuously quiet on Tuesday, when the Justice Department released a batch of materials that contained hundreds of mentions of Mr. Trump,\" Feuer said. “Their silence contrasted with the uproar made over the weekend when the department’s first release focused on former President Bill Clinton, including an image, stripped of context, showing him reclining in a hot tub. MAGA influencer Laura Loomer – also known as Trump's unofficial \"loyalty enforcer\" — mocked Clinton on social media after the photos emerged.\n\n“On Tuesday,","url":"https://www.alternet.org/maga-influencers-epstein/","image":"https://www.alternet.org/media-library/image.jpg?id=61719630&width=1200&height=600&coordinates=0%2C39%2C0%2C39","video":null,"publish_date":"2025-12-24 00:29:05","author":"Adam Lynch","authors":["Adam Lynch"],"language":"en","category":"politics","source_country":"US","sentiment":-0.316},{"id":388571272,"title":"Single dad with six US citizen kids is deported by ICE after asking about special visa","text":"A single father with six young children, all of whom are US citizens, was deported because of a policy change enacted by the Trump administration.\n\nIn September, Rosalio Vasquez Meave had just dropped off his kids at school in Oklahoma when officers with Immigration and Customs Enforcement arrested him, The Dallas Morning News reported.\n\nVasquez Meave has lived the US for 34 years and is the sole caretaker of his children, who are all under the age of 16. He reportedly tried to explain this to the ICE agents but claimed 'they didn’t care'.\n\nOn November 24, he was deported to Mexico and has been living in Matamoros, a city on the US-Mexico border just below the southernmost point of Texas.\n\nVasquez Meave did not see his children for almost three months, but in early December, the family was reunited in Mexico.\n\nHe was deported from the country even though he was in the process of getting fully approved for a visa through the Violence Against Women Act.\n\nThis kind of visa allows illegal immigrants who have been the victims of domestic violence by a US citizen partner - man or women - to become a lawful permanent resident.\n\nVasquez Meave applied for the visa because of problems he had with his ex-wife, whom he divorced four years ago.\n\nHe applied for the visa in 2023 with US Citizenship and Immigration Services (USCIS), which determined that his application was credible and met the basic requirements.\n\nTherefore, the agency granted him a work permit while his application was pending. This decision was upheld in 2024 and again in April.\n\nIn February, President Donald Trump scrapped a Biden-era policy from 2021 that instructed ICE to use prosecutorial discretion when considering deporting individuals who have applications under VAWA and other victim-based laws.\n\n'When encountering an alien during a civil immigration enforcement action who is not known to be an approved beneficiary of victim-based immigration benefits or to have applied or petitioned for such benefits, ICE officers and agents are not required to affirmatively seek to identify indicia or evidence suggesting an alien is a victim of a crime or consider such evidence as a positive discretionary factor in determining whether to take civil immigration enforcement action,' stated the memo to all ICE agents.\n\n'ICE will no longer routinely request expedited adjudications from USCIS. ICE officers and agents may continue to do so subject to a case-by-case determination that it is in ICE’s best interests,' it continued.\n\nThe decision to rescind President Joe Biden's earlier guidance means that the more than 100,000 people who still have pending VAWA applications could be more vulnerable to arrest and deportation.\n\nMichelle Edstrom, Vasquez Meave’s attorney, told The Dallas Morning News that his removal from the country shows that the Trump administration want to deport as many people as possible.\n\n'They’re just going after anybody and everybody is what I see, no matter if they have applications pending or not,' she said.\n\nTricia McLaughlin, a spokesperson for the Department of Homeland Security, said that pending applications under VAWA 'do not confer legal status' and added that Vasquez Meave 'has received full due process'.\n\nVasquez Meave had already been in the US illegally for about nine years in 2000, when he had to go home to Mexico for a death in his family.\n\nHe was 23 years old then, and after he done with his business, he attempted to re-enter the US with a fraudulent green card. He was arrested at the port of entry and was sent back to Mexico the same day.\n\nVasquez Meave claims he didn't realize the green card was not legitimate and says he was scammed out of $600. Several months later, he crossed the border illegally.\n\nHe went back to Oklahoma, where he spent the next 25 years working as a contractor. He eventually started his own business that did roofing and painting.\n\nDuring that time, he married and had his children. His wife had substance abuse issues and he filed for divorce 11 years after their marriage. Court records show he was awarded full custody of his children.\n\nTwo years after winning the custody battle, he applied for the VAWA visa. Wait times for cases like these are more than three years, according to a USCIS report in July.\n\nThat suggests that Vasquez Meave could have been approved sometime next year, given that he applied in 2023.","summary":"A single father originally from Mexico was deported by ICE last month after being arrested in September. He spent almost three months being separated from his six young children.","url":"https://www.dailymail.co.uk/news/article-15409189/single-father-deported-mexico-special-visa.html","image":"https://i.dailymail.co.uk/1s/2025/12/23/23/104987655-0-image-a-23_1766533554618.jpg","video":null,"publish_date":"2025-12-24 00:26:31","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.507},{"id":388574092,"title":"U.S. Supreme Court rejects Trump's military deployment in Chicago area, for now","text":"WASHINGTON - The U.S. Supreme Court refused on Tuesday to let Donald Trump send national guard troops to the Chicago area as the Republican president expands the use of the military for domestic purposes in a growing number of Democratic-led jurisdictions, a policy critics call an effort to punish adversaries and stifle dissent.The justices let stand for now a judge’s order blocking the deployment of hundreds of national guard troops in a legal challenge brought by Illinois officials and local leaders. The Justice Department had sought to allow the deployment while the case proceeds.'At this preliminary stage, the Government has failed to identify a source of authority ​that would allow the military to execute the laws in Illinois,' the court's majority held in an unsigned order.","summary":"The rejection was a rare setback for the president's administration at the high court, which has often backed his assertions of presidential authority.","url":"https://www.japantimes.co.jp/news/2025/12/24/world/court-reject-chicago-guard/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/24/513349.JPG?v=3.1","video":null,"publish_date":"2025-12-24 00:26:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.315},{"id":388572492,"title":"Top takeaways from the 3rd Epstein files release: the president, the plane and the prince","text":"The Justice Department on Tuesday released a third batch of records related to Jeffrey Epstein, a wide array of documents that shed light on alleged co-conspirators and the late sex offender's ties to the former Prince Andrew. Among the records, released in accordance with the law passed by Congress last month, were several references to President Donald Trump. Trump, who was friends with Epstein for years and has said they had a falling-out because Epstein was a “creep,” has denied any wrongdoing in relation to Epstein. The White House on Tuesday referred NBC News to a statement the Justice Department made earlier in the day. “The Department of Justice has officially released nearly 30,000 more pages of documents related to Jeffrey Epstein. Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already,” it said on X. An NBC News review confirmed that the Justice Department released roughly 30,000 records. Here are the top takeaways from the files. Epstein's plane An email sent in January 2020 by a New York federal prosecutor who appeared to be involved with the criminal case against Epstein's accomplice Ghislaine Maxwell alerted an unidentified person to flight logs involving Trump and Epstein from the 1990s. “For your situational awareness, wanted to let you know that the flight records we received yesterday reflect that Donald Trump traveled on Epstein’s private jet many more times than previously has been reported (or that we were aware), including during the period we would expect to charge in a Maxwell case.” Maxwell was indicted on federal sex trafficking charges months later, in July 2020. She is serving a 20-year prison sentence. The email said Trump, then serving his first term as president, “is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which Maxwell was also present. He is listed as having traveled with, among others and at various times, Marla Maples, his daughter Tiffany, and his son Eric.” “On one flight in 1993, he and Epstein are the only two listed passengers; on another, the only three passengers are Epstein, Trump, and then-20-year-old [redacted]. On two other flights, two of the passengers, respectively, were women who would be possible witnesses in a Maxwell case.” The names of both the sender and the recipient were redacted. The message does not accuse Trump of any wrongdoing. Possible co-conspirators Another released document showed federal prosecutors discussing “10 co-conspirators” of Epstein’s in an email exchange. To date, Maxwell is the only co-conspirator to be charged. The Justice Department said in a memo in July that it did not have evidence to charge any other parties in the case. Their identities are not revealed in the exchange. One is described as a “wealthy business man in Ohio,” while “3 have been located in FL and served [grand jury] subpoenas; 1 in Boston, 1 in NYC, and 1 in CT were located and served.” The three others are “out of pocket,” the email said. It’s unclear what information investigators pursued or found about the potential co-conspirators. Maxwell is the only Epstein accomplice to be charged criminally, and it's not clear whether she's one of the 10 people referenced. Epstein had a history of turning some of his young victims into recruiters. A fake Austrian passport Another document revealed that investigators found that Epstein had a fake Austrian passport in his safe, which included his picture and the name Marius Robert Fortelni. It listed his residence as Saudi Arabia. A prosecutor said Epstein's lawyers said in a court filing that the document \"expired 32 years ago\" and that Epstein had never used it. \"Epstein — an affluent member of the Jewish faith — acquired the passport in the 1980s, when hijackings were prevalent, in connection to Middle East travel. The passport was for personal protection in the event of travel to dangerous areas, only to be presented to potential kidnapers, hijackers or terrorists should violent episodes occur,” it quotes the filing as saying. A Prince Andrew connection The third batch of released records also appears to include email exchanges between Maxwell and Andrew Mountbatten-Windsor, who lost his British titles of prince and Duke of York because of his ties to Epstein. An Aug. 16, 2001, email from an address labeled “The Invisible Man” to Maxwell reads, “I am up here at Balmoral Summer Camp for the Royal Family,” an apparent reference to Balmoral Castle, the royal family’s estate in Scotland. \"How’s LA? Have you found me some new inappropriate friends? Let me know when you are coming over as I am free from 25th August until 2nd Sept and want to go somewhere hot and sunny with some fun people before having to put my nose firmly to the grindstone for the Fall,\" continues the email, which concludes, \"See ya A xxx.” Maxwell responded: \"I have only been able to find appropriate friends. Will let you know about some church meetings on those dates. Kisses Gx.” One of Epstein’s victims, Virginia Giuffre, has claimed that Epstein and Maxwell trafficked her to the prince in the early 2000s when she was 17. Andrew, who has denied having had sex with Giuffre and any wrongdoing connected to Epstein, was never charged criminally. He settled a civil suit Giuffre brought against him by making a substantial donation to her charity. The settlement did not include an admission of wrongdoing, but a letter issued on his behalf at the time said he \"regrets his association with Epstein, and commends the bravery of Ms. Giuffre and other survivors in standing up for themselves and others.\" Giuffre died by suicide n April. FBI tips The release includes various unverified, anonymous tips to the FBI. One was called in shortly before the 2020 election, with a tipster who said he’d once spoken to a woman who alleged Trump and Epstein raped her in the 1990s. The tipster said the woman told him she wouldn't go to the police because she was scared for her life. It’s unclear whether the FBI investigated the anonymous secondhand claim. Deputy Attorney General Todd Blanche said Tuesday night in a post on X, “We produce documents, and sometimes this can result in releasing fake or false documents because they simply are in our possession because the law requires this.” He cited, “Fake videos of Epstein in his cell. Photos with no explanation. Sensational tales and lies by random people. These are not reality. We will continue to produce every document required by law. Let’s not let internet rumor engines outrun the facts.” 'Fake' note to Larry Nassar Included in the release was a note signed “J. Epstein” addressed to Larry Nassar, the sports doctor who was convicted of sexually abusing numerous girls and women in his care and is serving a prison sentence of 40 to 175 years behind bars. The Justice Department said Tuesday on social media that it was “looking into the validity of this alleged letter,” and in a follow-up post two hours later it declared that the letter is fake and that the “writing does not appear to match Jeffrey Epstein’s.” “This fake letter serves as a reminder that just because a document is released by the Department of Justice does not make the allegations or claims within the document factual,” the post said. The letter had a postmark of Aug. 13, 2019, at a U.S. Postal Service facility in Northern Virginia — three days after Epstein died in his jail cell while he was awaiting trial on sex trafficking charges in New York. Investigators say he died by suicide. The note says, “As you know by now I have taken the ‘short route’ home.” It then tells Nassar “we shared one thing ... our love and caring for young ladies and the hope they reach their full potential.” It says “our president also shares our love of young, nubile girls,” and it complains that he and Nassar have been locked up. “Life is unfair,” the note concludes. Epstein's death Another release showed confusion and miscommunication around Epstein’s Aug. 10, 2019, death, with the U.S. Marshals Service informing the U.S. attorney’s office about the death, which was already being reported in the media. “As you might imagine, we are getting increasingly frantic calls from defense counsel who continue to be seeing information in the press that we—the U.S. Attorney’s Office—haven’t yet received. We need to know as soon as possible the very basic facts, such as time and cause of death at the absolute minimum. It has now been hours since this was reported publicly,” the unidentified person wrote.","url":"https://www.nbcnews.com/politics/justice-department/jeffrey-epstein-third-batch-release-takeaways-trump-prince-andrew-rcna250706","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-12/251223-trump-epstein-prince-andrew-mn-1545-40b97f.jpg","video":null,"publish_date":"2025-12-24 00:25:50","author":"Dareh Gregorian","authors":["Dareh Gregorian"],"language":"en","source_country":"us","sentiment":-0.217},{"id":388571632,"title":"Olympic Torch Detours Through Pompeii With Jackie Chan And It Makes No Sense","text":"The Olympic torch is making its way from Greece to Milan — which really isn't that far compared to other journeys it's made over the years — and on the way, it took a detour to the ruins of ancient Pompeii. And it did so in the hands of — who else?! — Jackie Chan! What does the legendary Hong Kong-born action star have to do with Pompeii? Hell if I know, but it was cool! Pompeii is, of course, best known for being destroyed after Mount Vesuvius erupted in AD 79 and buried under layers of ash and lava. So, obviously, no one who was around then is in any shape to carry the torch through the ruins. Maybe that's why they got the star of one of Donald Trump's favorite film franchises, Rush Hour. First of all, do you get to keep the tracksuit? I would love to carry the Olympic torch and then run errands in that. I'd be at the fish counter buying some salmon or getting my oil changed, and everyone would be checking out and envying my torch-carryin' suit. But, I digress… I love when stuff like this happens because I think we're all trying to decipher why Jackie Chan was chosen to run that particular leg. Was he in a movie about Pompeii? That doesn't make much sense for a couple of reasons. Does he have a house near there? Was he just in the area on vacation or shooting a new flick, and they were like, \"Hey, Jackie, want to take the torch for a spin?\" Of course, he'd do it. He's not going to say, \"Meh, I'm good. I did it in 2022 (which he did).\" I would love to be the guy who gets to decide who gets to run which legs of the torch relay, because I would just do stuff like this to confuse everyone. I'd be like, \"Alright, so, we're going to have Flo from the Progressive insurance commercials do the route in Naples, Bruce Vilanch gets Venice, and then right after him will be Donna Kelce because that'll crack everybody up on account of how they look alike...\" Whatever the case, it's awesome to see Jackie Chan cruising around getting into shape for Rush Hour 4.","summary":"The Olympic torch takes an unexpected detour through Pompeii with Jackie Chan carrying the flame, leaving fans amused and baffled as Milan-bound festivities roll on.","url":"https://www.outkick.com/sports/jackie-chan-runs-olympic-torch-through-pompeii","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/12/gettyimages-2252545606.jpg","video":null,"publish_date":"2025-12-24 00:20:40","author":null,"language":"en","source_country":"us","sentiment":-0.025},{"id":388571716,"title":"Iran and US have rare public exchange at UN Security Council","text":"UNITED NATIONS (AP) — Iran and the United States reaffirmed their commitments to diplomacy at a contentious meeting of the U.N. Security Council on Tuesday, but the gap between the Trump administration and the Islamic Republic on a nuclear deal remains wide and deep.\n\nThe sixth round of negotiations between Washington and Tehran had been scheduled for soon after Israel’s 12-day war with Iran in June, during which the U.S. joined Israel in bombing Iranian nuclear sites. The talks were canceled, and in September Iran’s supreme leader, Ayatollah Ali Khamenei, rejected any direct nuclear negotiations with the United States.\n\nBut Iran’s U.N. Ambassador Amir Saeid Iravani told the Security Council that “Iran remains fully committed to principled diplomacy and genuine negotiations.” And said it’s now up to France, Britain and the U.S. “to reverse course and take concrete, credible steps to restore trust and confidence.”\n\nHe said Iran remains committed to the core principles of the 2015 nuclear deal aimed at preventing Tehran from developing nuclear weapons, in which Iran had agreed to limit its nuclear program in exchange for the lifting of sanctions.\n\nPresident Donald Trump in 2018 pulled the U.S. out of the agreement between Iran and the five permanent members of the Security Council, plus Germany. \n\nIn a rare public exchange between diplomats from the two countries, U.S. Mission counselor Morgan Ortagus, a Trump ally and former State Department spokesperson, said, “The United States remains available for formal talks with Iran but only if Tehran is prepared for direct and meaningful dialogue.”\n\nOrtagus said Trump extended “the hand of diplomacy” to Iran during both of his administrations.\n\n“But instead of taking that hand of diplomacy, you continue to put your hand in the fire,” she said, looking directly at Iravani. “Step away from the fire, sir, and take President Trump’s hand of diplomacy. It’s extended to you.”\n\nShe stressed, however, that the Trump administration has been clear that there can be no enrichment of nuclear material inside Iran, a major point of contention. \n\nIrvani said the U.S. insistence on zero enrichment was contrary to Iran’s rights under the 2015 deal and showed the U.S. was not pursuing fair negotiations. He said if France and Britain continued to side with the U.S., “diplomacy will be effectively destroyed.”\n\n“Iran will not bow down to any pressure and intimidation,” Irvani said. \n\nIn September, the agreement’s three Western members — Britain, France and Germany — triggered a “snapback” mechanism to reinstate the sanctions that had been lifted, citing Iran’s failure to comply with the deal’s conditions.\n\nAs tensions between Tehran and Washington have increased, Iran has accelerated its production of uranium to near weapons-grade. The U.N. nuclear watchdog, the Vienna-based International Atomic Energy Agency, has reported that Iran has over 440 kilograms of uranium enriched up to 60% — a short, technical step away from weapons-grade levels of 90%.\n\nFrance’s deputy U.N. ambassador Jay Dharmadhikari defended the “snapback” of U.N. sanctions, saying that since 2019 Iran has been in “increasingly flagrant violation” of all limitations designed to guarantee that its nuclear program remains peaceful. But he said the reimposition of sanctions does not mean the end of efforts to find a diplomatic solution. \n\nRussia’s U.N. Ambassador Vassily Nebenzia shot back, telling the French envoy: “You failed miserably in your so-called diplomatic efforts to strike a deal on the nuclear issue with Iran, and you know it.”","url":"https://apnews.com/article/un-us-iran-nuclear-negotiations-diplomacy-trump-ade8ace5b5b2c121329a6b903af0dcff","image":"https://dims.apnews.com/dims4/default/7a73164/2147483647/strip/false/crop/5694x3796+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Ff3%2F2cc72abd830dccdd1a4050d040b4%2F815022a347c14f06aaef7e04be1560bd","video":null,"publish_date":"2025-12-24 00:17:13","author":"Edith M. Lederer","authors":["Edith M. Lederer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.313},{"id":388571454,"title":"US tells UN it will deprive Venezuela's Maduro, drug cartel of resources","text":"US tells UN it will cut Maduro, drug cartel off from resources.Russia warns US actions could set precedent for Latin America.China urges US to \"avoid further escalation of tensions\".\n\nThe United States told the United Nations on Tuesday it will impose and enforce sanctions \"to the maximum extent\" to deprive Venezuelan President Nicolas Maduro of resources as Russia warned other Latin American countries could be next.\n\nUS President Donald Trump's administration has for months waged a campaign of deadly strikes against suspected drug trafficking boats off the Venezuelan coast and the Pacific coast of Latin America. He has threatened strikes on Venezuelan land.\n\n\"The single most serious threat to this hemisphere, our very own neighbourhood and the United States, is from transnational terrorist and criminal groups,\" US Ambassador to the UN Mike Waltz told the UN Security Council.\n\nThe US has ramped up its military presence in the region and Trump announced a blockade of all vessels subject to US sanctions.\n\nSo far this month, the US Coast Guard has intercepted two tankers in the Caribbean Sea, both fully loaded with Venezuelan crude. The Coast Guard is also pursuing a third empty vessel that was approaching the OPEC country's shore.\n\n\"The reality of the situation is that sanctioned oil tankers operate as the primary economic lifeline for Maduro and his illegitimate regime. The sanctioned tankers also fund the narco-terrorist group Cartel de Los Soles,\" Waltz said.\n\nWashington designated Cartel de los Soles, or Cartel of the Suns, as a foreign terrorist organisation late last month for the group's alleged role in importing illegal drugs into the US. It accuses Maduro of leading Cartel de los Soles. Venezuela's government rejected what it called a \"ridiculous\" move to designate the \"non-existent\" group.\n\n\"This intervention which is unfolding can become a template for future acts of force against Latin American states,\" Russia's UN Ambassador Vassily Nebenzia told the Security Council, citing a recent strategy document from Trump that said the US will reassert its dominance in the Western Hemisphere.\n\nWaltz spoke after Nebenzia and did not directly respond to his remark.\n\nChina urged the United States to \"immediately halt relevant actions and avoid further escalation of tensions,\" China's Deputy UN Ambassador Sun Lei told the council.\n\nVenezuela, backed by Russia and China, requested Tuesday's meeting, the second held on the escalating tensions.\n\nThe Security Council first met in October, when the United States justified its actions as consistent with Article 51 of the founding UN Charter, which requires the Security Council to be immediately informed of any action states take in self-defence against armed attack.\n\n\"Let it be clear once and for all that there is no war in the Caribbean, there is no international armed conflict, nor is there a non-international one, which is why it is absurd for the US government to seek to justify its actions by applying the rules of war,\" Venezuela's UN Ambassador Samuel Moncada told the council.\n\n\"The threat is not Venezuela. The threat is the US government,\" he said.","url":"https://www.geo.tv/latest/641179-us-tells-un-it-will-deprive-venezuelas-maduro-drug-cartel-of-resources","image":"https://www.geo.tv/assets/uploads/updates/2025-12-24/l_641179_051010_updates.jpg","video":null,"publish_date":"2025-12-24 00:13:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.196},{"id":388569462,"title":"School Assembly News Headlines Today (Dec 24): Top National, International & Sports Updates + Thought of the Day","text":"If you’re a student on the lookout for news headlines to read out in your school assembly, you’re at the right place! We’ve compiled a list of the most important national, international, and sports-related news items to keep students well-informed about the latest events happening both within the country and across the world.,National News,Indian Coast Guard inducts its first indigenously designed pollution control vessel, ‘Samudra Pratap’.DRDO successfully conducts user evaluation trials of the Akash-NG missile system.President Droupadi Murmu expresses grief over the demise of renowned Hindi writer Vinod Shukla.Union Health Minister J.P. Nadda says India’s healthcare sector has seen a paradigm shift in the last 11 years.India summons the Bangladesh envoy, seeking a thorough probe into the killing of Hadi.Indian Air Force hit Pakistan where it “hurt the most” during Operation Sindoor, says former IAF chief.Gujarat government transfers 26 senior IAS officers.Over 1.79 lakh voters found enrolled at multiple polling stations in Chhattisgarh.BMC elections: No nominations filed on Day 1, over 4,100 forms issued.CPI(M) to organise a rally in Tripura on December 26 against rising fundamentalism in Bangladesh.Kerala High Court records over 6% rise in case disposals in 2025.,Don't Miss | Study in India: New Foreign Universities That Opened in India This Year,International News,India announces a USD 450 million assistance package for cyclone-hit Sri Lanka.External Affairs Minister S. Jaishankar meets Indian-origin Tamil community leaders in Sri Lanka.Bangladesh government to take responsibility for the family of a slain Hindu worker.Trump administration moves to end the H-1B visa lottery system, favouring skilled workers.USCIS introduces a new system to select H-1B petitions based on skills and salary.Former US President Donald Trump approves deployment of 350 National Guard members to New Orleans.Trump orders a 90-day halt on offshore wind projects.US Vice President J.D. Vance criticises commentators over derogatory remarks against his wife, Usha.Venezuela seeks to criminalise oil tanker seizures amid US pressure on President Maduro.,Sports News,Deepti Sharma becomes world No. 1 T20I bowler for the first time.India defeats Sri Lanka by seven wickets in the second Women’s T20I.Jemimah Rodrigues appointed captain of Delhi Capitals ahead of WPL 2026.Ramita Jindal and Himanshu Dhillon win gold in the 10m air rifle mixed team event.Virat Kohli, Rohit Sharma and Shubman Gill add star power to the Vijay Hazare Trophy.New Zealand spinner Lennox earns maiden call-up; Kane Williamson to skip ODI series vs India.Shafali Verma says accepting her mistakes helped improve her performance.Australian coach says Pat Cummins’ T20 World Cup availability remains uncertain.Kagiso Rabada calls SA20 a key preparation platform ahead of the T20 World Cup.Indonesia’s Gede Priandana takes five wickets in an over to set a T20I record.Bengaluru Police deny permission for a cricket match at Chinnaswamy Stadium on December 24.,Thought of the Day,Small acts of honesty build great character.,ईमानदारी के छोटे-छोटे कार्य महान चरित्र का निर्माण करते हैं।,Get Latest News Live on Times Now along with Breaking News and Top Headlines from Education and around the world.","summary":"Take a look at the major national, international, and sports highlights of the day. You may use it in the school assembly on December 24, 2025.","url":"https://www.timesnownews.com/education/school-assembly-news-headlines-today-dec-24-top-national-international-sports-updates-thought-of-the-day-vijay-hazare-trophy-bangladesh-donald-trump-article-153339295","image":"https://images.timesnownews.com/thumb/msid-153339298,thumbsize-138266,width-1280,height-720,resizemode-75/153339298.jpg","video":null,"publish_date":"2025-12-24 00:12:59","author":"TN Education Desk","authors":["TN Education Desk"],"language":"en","source_country":"in","sentiment":-0.037},{"id":388570696,"title":"EU Leaders Stand With Denmark Over Donald Trump’s Latest Greenland Threat","text":"European leaders are standing strong with Denmark after Donald Trump revived his interest in incorporating Greenland into US territory.\n\nThe US president has revived his ambitions, citing national security, but European leaders say, “Greenland belongs to its people – and Denmark is its guarantor.” One year after Trump first announced his intention to take Greenland into US territory on the grounds of “national protection,” he is now back.\n\nDonald Trump has just appointed Governor of Louisiana, Jeff Landry, as the new US special envoy for Greenland. His stated objective of the appointment is “integrating Greenland into the United States” and he has repeated that the US needs the territory for its “national security.”\n\nMeanwhile, EU heads of state and government are taking the president’s comments seriously. They are now presenting a united front against what they term American expansionist ambitions towards the autonomous territory, which forms part of the Kingdom of Denmark.\n\nTuesday saw Trump telling reporters that the US “needs Greenland for national security, not for minerals or oil, but national security. And if you take a look at Greenland, there are Russian and Chinese ships all over the place. So, we need this for protection.”\n\nDonald Trump chastised Denmark for what he describes as neglecting the territory, saying, “they have spent no money, they have no military protection, they say Denmark arrived there 300 years ago with boats – we were there with boats too, I’m sure. We’ll have to work it all out.”\n\nAccording to the New York Times, officials in Denmark and Greenland are furious that Trump had appointed a special envoy to Greenland, as part of his continuing efforts to take over the semiautonomous Danish territory.\n\nMeanwhile, the EU is fighting back, with President Emmanuel Macron of France and his Minister for Europe and Foreign Affairs, Jean-Noël Barrot, both responding to the announcement by reaffirming their support for the integrity of Denmark’s territory. In their statement, they wrote, “Greenland belongs to its people. Denmark stands as its guarantor. I join my voice to that of Europeans in expressing our full solidarity.”\n\nIn Nuuk, I reaffirmed France’s unwavering support for the sovereignty and territorial integrity of Denmark and Greenland.\nGreenland belongs to its people.\nDenmark stands as its guarantor.\nI join my voice to that of Europeans in expressing our full solidarity. pic.twitter.com/W3EUn3dAME\n— Emmanuel Macron (@EmmanuelMacron) December 23, 2025\n\nAdding more European voices against US ambitions, Commissioner Ursula von der Leyen stated that “territorial integrity and sovereignty are fundamental principles of international law. Despite the tone, she appears to refer to the US as an ally in Arctic security.\n\nSpanish Prime Minister Pedro Sánchez added to the commentary, saying, “Respecting sovereignty and territorial integrity is central to the EU and to all nations of the world,” he wrote on X, adding, “Security in the Arctic is a priority in which we seek to work with allies and partners.”\n\nRespetar la soberanía e integridad territorial es central para la UE y para todas las naciones del mundo.\nLa seguridad en el Ártico es una prioridad en la que buscamos trabajar con aliados y socios.\nTrasladamos nuestra plena solidaridad con Dinamarca y el pueblo de Groenlandia.\n— Pedro Sánchez (@sanchezcastejon) December 23, 2025\n\nMeanwhile, the US and Denmark are both part of NATO, a group that is supposed to ensure mutual defense in the event of aggression against one of its members. That principle has never previously been tested by conflict between NATO members if one were to seize territory from another.\n\nDespite Trump insisting that he only wants Greenland for national security, it has critical minerals that have grabbed the interest of top officials in the Trump administration. Moreover, Greenland served as a base for American military operations in World War II and the Cold War, and there is still a remote US base on the northern side of the island.\n\nMeanwhile, the US and Denmark are both part of NATO, a group that is supposed to ensure mutual defense in the event of aggression against one of its members. That principle has never previously been tested by conflict between NATO members if one were to seize territory from another.","summary":"Donald Trump won't drop the idea of incorporating Greenland into US territory, citing national security.","url":"https://www.inquisitr.com/eu-leaders-stand-with-denmark-over-donald-trumps-latest-greenland-threat","image":"https://www.inquisitr.com/wp-content/uploads/2025/12/donald-trump-7.jpg","video":null,"publish_date":"2025-12-24 00:12:20","author":"Anne Sewell","authors":["Anne Sewell"],"language":"en","category":"politics","source_country":"us","sentiment":0.116},{"id":388570474,"title":"Democratic-Led States Sue To Block Defunding Of Consumer Financial Protection Bureau","text":"Dec 22 (Reuters) - A coalition of Democratic-led states filed a lawsuit on Monday seeking to prevent President Donald Trump’s administration from defunding the U.S. Consumer Financial Protection Bureau by refusing to request money from the Federal Reserve.\n\nDemocratic attorneys general from 21 states and the District of Columbia filed the lawsuit in federal court in Oregon, arguing that the administration’s decision not to seek additional funding for the U.S. consumer watchdog is unlawful and undermines Congress’ authority under the U.S. Constitution.\n\n“The administration’s actions are a handout to those who drive up costs by cheating hardworking Americans, and I will keep fighting to ensure they follow the law and our Constitution,” New York Attorney General Letitia James, a Democrat, said in a statement.\n\nThe CFPB did not immediately respond to a request for comment. Trump, a Republican, has sought to dismantle the CFPB since returning to office in January and has installed Russell Vought, his budget director, as the acting head of the agency. While efforts to fire most of its employees are tied up in litigation, Vought has effectively halted most CFPB activities.\n\nThe agency, which is tasked with protecting consumers in the financial sector, began operations in 2011 under Democratic President Obama following the 2008 financial crisis. It has since returned more than $21 billion improperly taken from consumers, its supporters say.\n\nIt receives its funding directly from the Fed, unlike federal agencies for which Congress appropriates money annually. Last month, the CFPB under Vought’s leadership said it could not request more money from the Fed because the Dodd-Frank Act of 2010 requires that funding come from the central bank’s “combined earnings.”\n\nSince the Fed had been operating at a loss since 2022, the Trump administration said no earnings were available. The CFPB in a November 10 court filing said it expected its funds would run out in early 2026. States led by California, Colorado, New Jersey, New York and Oregon said in Monday’s lawsuit that denying funding would prevent the CFPB from meeting a legal obligation to provide them with consumer complaints.\n\nThey said the administration’s actions also violate the Constitution’s principle of separation of powers, since Congress created the agency and the process by which it is funded. A federal employees’ union and several nonprofits are seeking in two separate lawsuits in Washington, D.C., and California to similarly force the CFPB to resume requesting funding. (Reporting by Nate Raymond in Boston; editing by David Bario and Nia Williams)","url":"https://www.huffpost.com/entry/cfpb-defunding-lawsuit_n_694b2cefe4b080674cebbd1b?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/694b2e032b00008755682cb6.jpeg?cache=hiwz9lI7kX&ops=1778_1000","video":null,"publish_date":"2025-12-24 00:07:37","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.499},{"id":388570476,"title":"Democratic-Led States Sue To Block Defunding Of Consumer Financial Protection Bureau","text":"Dec 22 (Reuters) - A coalition of Democratic-led states filed a lawsuit on Monday seeking to prevent President Donald Trump’s administration from defunding the U.S. Consumer Financial Protection Bureau by refusing to request money from the Federal Reserve.\n\nDemocratic attorneys general from 21 states and the District of Columbia filed the lawsuit in federal court in Oregon, arguing that the administration’s decision not to seek additional funding for the U.S. consumer watchdog is unlawful and undermines Congress’ authority under the U.S. Constitution.\n\n“The administration’s actions are a handout to those who drive up costs by cheating hardworking Americans, and I will keep fighting to ensure they follow the law and our Constitution,” New York Attorney General Letitia James, a Democrat, said in a statement.\n\nThe CFPB did not immediately respond to a request for comment. Trump, a Republican, has sought to dismantle the CFPB since returning to office in January and has installed Russell Vought, his budget director, as the acting head of the agency. While efforts to fire most of its employees are tied up in litigation, Vought has effectively halted most CFPB activities.\n\nThe agency, which is tasked with protecting consumers in the financial sector, began operations in 2011 under Democratic President Obama following the 2008 financial crisis. It has since returned more than $21 billion improperly taken from consumers, its supporters say.\n\nIt receives its funding directly from the Fed, unlike federal agencies for which Congress appropriates money annually. Last month, the CFPB under Vought’s leadership said it could not request more money from the Fed because the Dodd-Frank Act of 2010 requires that funding come from the central bank’s “combined earnings.”\n\nSince the Fed had been operating at a loss since 2022, the Trump administration said no earnings were available. The CFPB in a November 10 court filing said it expected its funds would run out in early 2026. States led by California, Colorado, New Jersey, New York and Oregon said in Monday’s lawsuit that denying funding would prevent the CFPB from meeting a legal obligation to provide them with consumer complaints.\n\nThey said the administration’s actions also violate the Constitution’s principle of separation of powers, since Congress created the agency and the process by which it is funded. A federal employees’ union and several nonprofits are seeking in two separate lawsuits in Washington, D.C., and California to similarly force the CFPB to resume requesting funding. (Reporting by Nate Raymond in Boston; editing by David Bario and Nia Williams)","url":"https://www.huffpost.com/entry/cfpb-defunding-lawsuit_n_694b2cefe4b080674cebbd1b?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/694b2e032b00008755682cb6.jpeg?cache=hiwz9lI7kX&ops=1778_1000","video":null,"publish_date":"2025-12-24 00:07:37","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.499},{"id":388574402,"title":"Bukele challenges Hillary Clinton to take El Salvador's entire prison population after criticism","text":"El Salvadoran President Nayib Bukele responded to allegations by former Secretary of State Hillary Clinton about the conditions at the Terrorism Confinement Center (CECOT), the country's maximum-security prison that has received migrants deported from the United States. Bukele was responding to a post on X by Clinton that was accompanied by an 11-minute video of the PBS Frontline documentary titled: \"Surviving CECOT.\" \"Curious to learn more about CECOT?\" she wrote. \"Hear Juan, Andry, and Wilmer share firsthand how the Trump administration branded them as gang members without evidence and deported them to the brutal El Salvadoran prison.\" '60 MINUTES' POSTPONES SEGMENT ON MIGRANT INMATES FROM EL SALVADOR'S CECOT PRISON The short documentary tells the story of three Venezuelan men — Juan José Ramos Ramos, Andry Blanco Bonilla and Wilmer Vega Sandia — who were deported by the Trump administration to CECOT, a description of the short film states. All three men were branded by the U.S. government as Tren de Aragua gang members, which they deny. In response, Bukele said his country was ready to cooperate if Clinton thinks people have been tortured in the notorious prison that houses many of the country's gang members and migrants deported from the U.S. \"We are willing to release our entire prison population (including all gang leaders and all those described as \"political prisoners\") to any country willing to receive them,\" he wrote. \"The only condition is straightforward: it must be everyone.\" FEDERAL JUDGE ORDERS KILMAR ABREGO GARCIA RELEASED FROM ICE CUSTODY \"This would also greatly assist journalists and your favorite NGOs, who would then have thousands of former inmates available for interviews, making it far easier to find additional voices critical of the Salvadoran government (or willing to confirm whatever conclusions are already expected),\" added Bukele. \"Surely, if these testimonies reflect a systemic reality, a much larger pool of sources should only reinforce the claim, and many governments should be eager to offer protection.\" Until then, he continued, El Salvador will continue prioritizing the human rights of the millions of Salvadorans who today live free from gang rule,\" Bukele said. Bukele solidified his relationship with President Donald Trump by offering to house certain migrants deported from the U.S. at CECOT. The U.S. has deported Venezuelan migrants deemed to be gang members to El Salvador after their home country refused to take them back. CLICK HERE TO GET THE FOX NEWS APP A federal judge on Monday ordered the Trump administration to provide due process to a class of Venezuelan migrants deported to El Salvador in March, and gave it two weeks to detail how it will do so – setting up another high-stakes clash between the White House and the federal courts.","summary":"Bukele challenged Hillary Clinton’s allegations of torture at El Salvador’s CECOT prison, offering to release inmates if other countries accept them.","url":"https://www.foxnews.com/world/bukele-challenges-hillary-clinton-take-el-salvadors-entire-prison-population-criticism","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/hillary-clinton-cecot-prison.jpg","video":null,"publish_date":"2025-12-24 00:07:26","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","category":"politics","source_country":"US","sentiment":0.012},{"id":388572766,"title":"Insecurity: How Did We Get To This Pass?","text":"ABIODUN KOMOLAFE\n\nThe roots of the current cri sis stretch deep into the past. To truly discern these origins, one must look all the way back to the Justice Alexander Ovie Aniagolu Report on the Maitatsine Riots in Kano (1981), whose findings clearly harbingered the events that were to come. Four decades later, we are facing the fatal consequences of unheeded warnings.\n\nBetween 1980 and 1985, the Maitatsine Riots encompassed a series of violent religious uprisings in Northern Nigeria. It was initiated and led by Muhammad Marwa (Maitatsine), whose followers belonged to the militant Islamic sect, Yan Tat sine. The conflict began in Kano and spread to other cities, resulting in thousands of deaths before it was suppressed by the Nigerian military.\n\nThe crisis Nigeria currently fac es was foretold in the Maitatsine and other Reports. The deepening poverty and woes in the North and parts of Nigeria were largely caused by the destruction of the agricultural value chain. This destruction was exacerbated by the termination of the 1963 Republican Constitution in 1966, and the irresponsible fixation on a misplaced depiction of an oil boom. The inability to reverse the destruction of the rural economy in Northern Nigeria, alongside the failure to make education free and compulsory from the age of 16, starting around 1977, ultimately led us to where we are today.\n\nFormer Military President Ibra him Babangida’s misconceived and now-discredited Structural Adjustment Programme (SAP) also added salt to the North’s festering injury. And, as if the gods were angry, SAP deconstructed its nascent industrial base, wiping out fundamental industries such as textiles. Nobody should be surprised, in view of this that we landed in the era of Boko Haram. Indeed, it would have been absurd had we not landed in that era. Having landed in that era, the political will to tackle the root cause was lacking. Instead, what became depicted as an insurgency opened a vast new avenue for making money by members of the connected political and military establishment.\n\n The military industrial complex arose out of the war against terror. Without parliamentary oversight worth the name, a never-ending war found a stool and sat comfortably in the country. Sadly, the Return on Investment (ROI) for those profiting from this war might be as high as an investment in Oil and Gas. Even a primary school student can do a Cost-Benefit Analysis (CBA) of the profiteering and conclude, beyond any reasonable doubt, that Nigeria has been badly defrauded in the pursuit of what is now a phantom war against terror.\n\nThe National Assembly must now, as a way out of terror, do a forensic audit into spending on the war against terror, stretching back fifteen years. This will reveal everything and show conclusively that even if we quadruple expenditure on Defence spending, the war will go on ad infinitum. This is simple common sense, for no turkey votes for an early Christmas. We have an entrenched business encompassing the high and the mighty, and dis mantling it would be a determined Herculean task. If we do not dis mantle the business framework, we will be fighting the war against terror until the Year 2050, and beyond.\n\nWorryingly, Nigeria does not have the much needed Unexplained Sources of Wealth Act, even though, commendably, Senator Ali Ndume from Borno South is proposing one. It is only by asking people to account for their wealth that we can really get to the root of the profiteering and racketeering industry that has arisen from the war against terror over the past fifteen years.\n\nIn addition to the forensic audit, the country must now have the intellectual humility to admit that it’s been fighting the war in a wrong way. Faced with guerilla warfare, we need to develop a framework centered on Special Forces as well as an increase in specially-trained ground troops to destroy the terrorists. For example, it is clearly absurd to pursue fleeing terrorists on motorbikes with heavy armour. We should have developed our own Special Forces with their own specially-configured motorbikes, perhaps even using electricity, to pursue, overtake and dismantle them.\n\nIt is clear that the development of Special Forces is not in sync with the profiteering and racketeering in Defence expenditure. We must now quickly develop Special Forces as well as strengthen the intelligence framework at the local level and use technology to monitor the movements of the terrorists. Satel lite sensors could have monitored the movement of scores of motor cycles moving symmetrically. We must also investigate the failure of intelligence.\n\nNigeria is in a very terrible situation and the entire sector of the war must now be configured in order to defeat terrorism. The top echelon of the Nigerian Defence system must study unconventional warfare, dating back about eighty years, to see how modern armies had to configure their methods to fight insurgents.\n\nA key example is Dien Bien Phu in Vietnam. Seventy-one years ago, on the paddy fields of Vietnam, a lightly-armed, barefooted guerrilla army, led by a lawyer named Võ Nguyên Giáp, not only defeated but also destroyed the French Army, which had air power, armoured tanks, and the most modern weaponry at its disposal.\n\nThe Battle of Dien Bien Phu (March-May 1954) was the decisive engagement of the First Indochina War. Apart from changing the conception of warfare forever, it also showed that a revolutionary ragtag army can defeat one of the best armies in the world. Most im portantly, it showed that guerrilla warfare is fundamentally different from state-on-state wars like Nige ria versus Ghana or Togo versus Niger Republic.\n\nThe French surrender ended its colonial rule in Vietnam and led to the country’s temporary partition. We must therefore study this as well as other examples of asymmetric warfare to resolve the ugly situation we now face. To put it succinctly, there must be a complete overhaul, for it is now clear that the constant changing of personnel is not the issue. The issue is that the strategy must change! It means that we must have a different force structure within the army!\n\nIt must also be noted that an insurgency movement mutates. When insurgents quarrel, which is not unlikely, divisions set in and the groups mutate, moving into different sectors. This means that, instead of fighting three groups, a country may eventually face ten or eleven. So, a country worth its vision and mission on security must anticipate this and nurture its strategic plans.\n\n Eni tó kàn ló mò! (Only the wear er knows where the shoe pinches!) For yours sincerely, the argument that heightened insecurity is merely a preelection narrative for 2027 is too lazy to sound as an excuse. Do we think the parents whose children were kidnapped care a hoot about any election? Have we counted how many of the Chibok girls’ parents are still alive? What of the parents whose children were abducted from St. Mary’s Catholic School in Kebbi: do we know how many have ended up in the hospital? For God’s sake, when will this madness come to an end?\n\n Again, consider the ancient wisdom: “Àgbàrà òjò kò l’óun ò n’ílé wó. Onílé ni kò níí gbà fun.” (The intent of a heavy storm and flood is to wreak havoc, and that of those to be affected is to prevent it.) This dynamic defines all conflict. It stands to reason that nobody has ever waged unconventional, or even conventional, warfare without successfully infiltrating the security apparatus of the opposition. Unfortunately, this tactic takes a sinister turn in a religious war. Here, there are people who view it as a divine calling, making infiltration a sacred duty.\n\nA school of thought contends that Nigeria’s current crisis is root ed in three interrelated factors: the rise of Islamic fundamentalism, the expansion of Sharia law in several Northern States, and the abandonment of Sir Ahmadu Bello’s vision of a secular penal code. Proponents argue that this shift coincided with a period in which some strands of international Islam turned towards militancy. A good example was the emergence of Osama bin Laden and the broader “war on terror” that re shaped global alliances.\n\nThis school of thought, which includes figures like Ayo Osun loye, also points to the perceived alignment of NATO members with Israel’s policies towards Arab and Muslim peoples. They suggest that such external dynamics have reverberated within Nigeria’s borders. According to this view, the 1999 Constitution imposed a largely unitary system that concentrates power at the centre.\n\nFurthermore, they argue that the dominance of a particular religious and ethnic bloc in government, the weakening of independent intelligence institutions, and the absence of egalitarian principles have further eroded the social contract. The result, they say, is a cascade of symptoms – insurgency, poverty, religious intolerance, ethnic oppression, and discrimination – that have failed to – and cannot – be solved by security measures alone.\n\nThe tragedy of our situation is a complex one, as it finds expression in the failure to address key allegations, such as the “clear sabotage” claim raised by Governor Bello Idris of Kebbi State regarding the Maga matter. This silence forces a deeper question: Are we content to remain paralyzed by inaction?\n\nWell, those whose flexible heels have been oiled by the speculative notion that Donald Trump’s ultimate interest was Nigeria’s oil exhibited their hypocrisy by over looking the fact that our country was a disaster waiting to happen. Trump, in fact, merely drew attention to the calm before an inevitable storm. Had Nigeria acted with the required political will years ago, we would have already tackled the social miasma currently threatening the national fabric. Now that the consequences have materialized, the focus must shift entirely to domestic defense and reform, not to seeking external saviours or breeding scapegoats.\n\n In his Farewell Address on January 17, 1961, former President Dwight D. Eisenhower warned against the military-industrial complex – the immense, intertwined power of the defense industry and the military establishment. Eisen hower cautioned that its unwarranted influence could threaten democratic processes and liberties. He urged an alert and knowledge able citizenry to maintain balance between security and freedom.\n\nAfter Eisenhower’s speech, John F. Kennedy, who succeeded him, decided that the only way the country could have an effective Defence budget was to bring in Robert Mc Namara from Ford Motors as Secretary of Defence. McNamara was not a General in the American Army, but he was one of the best managers of his generation. At that time, leaving Ford Motors as President/ CEO to become the Secretary of De fence (a post he held from 1961 to 1968) was a pay cut of around 99%. But McNamara accepted the offer.\n\nRemember also General Sir Frank Kitson, formerly the Commander-in-Chief, UK Land Forces, who authored the influential book, Low Intensity Operations. This work details the complexities of guerrilla warfare and describes the various functions the British Army employed to contain insurgencies in different theaters. Because of its practical insights, the book is strongly recommended reading for Ministers Christopher Musa and Bello Matawalle, and, indeed, the entire rank and file of the Nigerian Defence Forces.\n\nA lasting solution, Nigerians argue, requires a new constitution that guarantees equal citizenship regardless of religion or ethnicity and that fully embodies federalism – not in garb but in reality; both in letter and in practice. Such a frame work, they claim, would address the underlying structural imbalances rather than merely treating the out ward manifestations of the crisis. Even at that, the nation must seek, first, superior strategic thinking to manage the ongoing security crisis.\n\n *Komolafe writes from Ijebu-Jesa, Osun State, Nigeria ([email protected]; 08033614419 – SMS only","summary":"ABIODUN KOMOLAFE The roots of the current cri sis stretch deep into the past. To truly discern these origins, one must look all the way back to the Justice Alexander&#8230;\n\n\nThe post Insecurity: How Did We Get To This Pass? appeared first on Independent Newspaper Nigeria.","url":"https://independent.ng/insecurity-how-did-we-get-to-this-pass/","image":"https://independent.ng//wp-content/uploads/Christopher-Gwabin-Musa-Minister-of-Defence.png","video":null,"publish_date":"2025-12-24 00:07:20","author":"Our Correspondents","authors":["Our Correspondents"],"language":"en","source_country":"ng","sentiment":-0.177},{"id":388568868,"title":"Irish watchdog calls for EU reform to allow fans return tickets bought under pressure","text":"We need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nDaft.ie Property\nAllianz Home\nThe 42 Sport\nTG4 Entertainment\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nMany Oasis fans were blind-sided by high prices after hours in a virtual queue.Harriet T K Bols/Big Brother Recordings\n\nThe Morning Lead\n\nIrish watchdog calls for EU reform to allow fans return tickets bought under pressure\n\nIf the EU takes the Irish regulator’s advice, it would add a new consumer protection when buying on Ticketmaster.\n\n12.06am, 24 Dec 2025\n\nShare options\n\nFANS WHO BUY tickets under pressure should be allowed to return them for up to 14 days afterwards, Ireland’s consumer watchdog has told the European Commission.\n\nThe Competition and Consumer Protection Commission (CCPC) has called on Brussels to legislate for a “right to withdraw” from high demand live events.\n\nIf the EU acts on the Irish regulator’s advice, it will be a shot across the bow of Ticketmaster, the dominant player in live event ticket sales across Europe with a particular stranglehold on the Irish market.\n\nThere has been heightened scrutiny of this issue since the August 2024 scramble for Oasis tickets. Some fans paid over €400 to Ticketmaster for tickets for the August 2025 Croke Park gigs, advertised as starting at €86.50.\n\nFans complained of being confronted with prices well above what they expected after queueing for hours, with the highest prices branded “extortionate”. Fans were also frustrated by the apparent lottery element, whereby they did not know how much they would eventually be charged when they reached the top of the queue.\n\nIt’s understood a “tiered” pricing model was used for Oasis, with cheaper tickets selling out first.\n\nPressure to buy\n\nNow the CCPC has told the European Commission that when it comes to ticket sales for high demand live events, consumers are making decisions that “on reflection, they may not otherwise have made”, with limited time in which to do so.\n\nThe “sense of urgency” and “online hype”, as well as being under time pressure, all exacerbate consumers’ tendency to follow through with a purchase they have invested time in pursuing, the CCPC said.\n\nWhen fans get to the top of an online queue and select tickets, they normally have just 10 minutes to complete their payment.\n\nThe CCPC made its suggestion as the EU executive drafts a new Digital Fairness Act, to be published next year, aimed at strengthening consumer protections online.\n\nAdvertisement\n\nDynamic pricing\n\nThe CCPC told Brussels that the criteria under which a new “right to withdraw” should apply should include tiered, algorithmic or dynamic pricing, “including a model that uses price discrimination for tickets with the same objective benefits/characteristics”.\n\nThese types of pricing models create a situation in which consumers cannot know for certain in advance of entering an online queue what they will need to pay for tickets, the CCPC said.\n\nIt added that consumers should be entitled to apply for a refund for all payments. High service charges and booking charges can apply to ticket sales.\n\nUnder EU consumer law, shoppers have the right to return something they buy online within 14 days for a refund. However, there is an exception in the law that applies to tickets for gigs and other events.\n\nThis exception is supposed to protect organisers of events from being unable to fill capacity if punters return their tickets – but the CCPC argued this is not a real concern in the case of high demand events.\n\nThe CCPC noted that it may be argued that consumers have the option to re-sell tickets. It countered that this puts an unfair level of financial risk on the consumer.\n\nTicketmaster told The Journal it “works to provide a simple and safe ticket-buying experience and does not use surge pricing or dynamic algorithms”.\n\nIt’s understood that ticket prices are set by artists, promoters and other event organisers and Ticketmaster facilitates “tiered” pricing, whereby lower price tickets can sell out first.\n\nTicketmaster said fans are shown ticket prices while in the queue and have “at least an hour to select tickets”.\n\nIt added that a timer is displayed once tickets are placed in the basket “as a security measure”.\n\nIt said if fans don’t want to go to an event, they can resell tickets at face value on Ticketmaster, which is a “safe and secure process”.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nValerie Flynn\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Irish watchdog calls for EU reform to allow fans return tickets bought under pressure”.\n\nRecipient's Email\n\nFeedback on “Irish watchdog calls for EU reform to allow fans return tickets bought under pressure”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nCompetition and Consumer Protection Commission\nConsumer Affairs\n\nDon't look back in anger\n\nThe Morning Lead\n\nNews in 60 seconds\n\nArsenal into League Cup semi-final after 8-7 penalty shootout win over Crystal Palace\n\n54 mins ago\n\nLibya’s military chief and four others killed in plane crash over Turkey\n\nVisitation for man who died in Cork crash hears of 'phenomenal' outpouring of love since his death\n\nHere's What Happened Today: Tuesday\n\nChristmas Swimmers\nDry and sunny weather forecast ahead of Christmas dips\n\nPope calls for global truce on Christmas Day and says 'Russia rejected a request' for one\n\nNew South Wales\nAustralian state lawmakers approve sweeping gun and protest laws after Bondi attack\n\nGarda investigation launched after body of woman found in Clonmel\n\nLatest Epstein Files drop contains numerous references to Donald Trump\n\nno need for speed\nAlmost 400 new speed camera safety zones will become operational from New Year’s Day\n\nnight train\nMinister wants late night trains to run all year and is talking 'options' with Iarnród Eireann\n\nChristina Finn\n\nmore from us\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nGender Pay Gap Report '25\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nGender Pay Gap Report '25\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"If the EU takes the Irish regulator’s advice, it would add a new consumer protection when buying on Ticketmaster.","url":"https://www.thejournal.ie/ccpc-tickets-returns-6906784-Dec2025/","image":"https://img2.thejournal.ie/article/6906784/river/?height=400&version=6910905","video":null,"publish_date":"2025-12-24 00:05:24","author":null,"language":"en","source_country":"ie","sentiment":0.062},{"id":388569458,"title":"What Is the Posse Comitatus Act and Why the Supreme Court Used It to Block National Guard Deployment in Illinois","text":"In a big setback for President Donald Trump, the US Supreme Court on Tuesday rejected an attempt by his administration to deploy National Guard troops in Illinois, siding with state and local officials who opposed the move. ,In an unsigned order, the court turned down an emergency request from the administration, which had argued that the troops were needed to protect federal agents involved in immigration enforcement in the Chicago area. ,Although the ruling applies only to Chicago and is preliminary, it is expected to strengthen similar legal challenges to National Guard deployments in other cities and places new limits on the president's authority to federalise the Guard. ,Illinois Governor JB Pritzker welcomed the decision, saying in a statement: \"This is an important step in curbing the Trump Administration's consistent abuse of power and slowing Trump's march toward authoritarianism.\" ,The decision marked a rare setback for President Donald Trump at a Supreme Court with a 6–3 conservative majority, after the administration secured a number of high-profile victories earlier this year. ,In response, White House spokeswoman Abigail Jackson said Trump had deployed the National Guard to protect federal law enforcement officers and property in order to fulfil a campaign pledge. \"Nothing in today's ruling detracts from that core agenda. The Administration will continue working day in and day out to safeguard the American public,\" she said. ,The court rejected the administration's argument that conditions in Chicago were so chaotic that they justified invoking a federal law allowing the president to call the National Guard into federal service in extreme circumstances. Such circumstances include situations in which \"there is a rebellion or danger of a rebellion\" or when \"the president is unable with the regular forces to execute the laws of the United States\". ,The justices ruled on a threshold issue, finding that the law's reference to \"regular forces\" meant the National Guard could only be called up if regular military forces were unable to restore order. The court said the president could only deploy the military where they could \"legally execute the laws\", noting that this authority is restricted by the Posse Comitatus Act, which limits the use of the armed forces in domestic law enforcement. ,\"At this preliminary stage, the Government has failed to identify a source of authority that would allow the military to execute the laws in Illinois,\" the court said. It added that the administration had not shown that the National Guard law \"permits the President to federalize the Guard in the exercise of inherent authority to protect federal personnel and property in Illinois\". ,The ruling split the court's six conservative justices, with three joining the three liberal justices in the majority. Justices Samuel Alito, Clarence Thomas and Neil Gorsuch dissented. ,\"I have serious doubts about the correctness of the court's views. And I strongly disagree with the manner in which the court has disposed of this application,\" Justice Alito wrote. He added: \"There is no basis for rejecting the President's determination that he was unable to execute the federal immigration laws using the civilian law enforcement resources at his command.\" ,Trump's move to deploy the National Guard followed protests against increased immigration enforcement in Chicago, which his administration described as descending into \"lawless chaos\". That assessment has been disputed by local officials and judges who ruled against the deployment. ,The action was challenged by the Democratic-led state of Illinois and the city of Chicago, whose lawyers argued that the president's decision was politically motivated and violated both the US Constitution's 10th Amendment and the Posse Comitatus Act. ,A federal district judge, April Perry, said she had \"found no credible evidence that there is a danger of rebellion\" and issued a temporary restraining order blocking the deployment. The Chicago-based 7th US Circuit Court of Appeals largely agreed, saying \"the facts do not justify the president's actions\", though it narrowed the order to allow the Guard to be federalised but not deployed. ,Trump has also sought to deploy National Guard troops in other Democratic-led cities, including Washington DC, Los Angeles and Portland, Oregon. Courts have issued differing rulings on those deployments, and in recent days hundreds of Guard troops in Illinois and Oregon were set to return to their home states.,Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Trump's move to deploy the National Guard followed protests against increased immigration enforcement in Chicago, which his administration described as descending into \"lawless chaos\".","url":"https://www.timesnownews.com/world/us/us-news/what-is-the-posse-comitatus-act-supreme-court-illinois-national-guard-deployment-article-153339294","image":"https://images.timesnownews.com/thumb/msid-153339293,thumbsize-574538,width-1280,height-720,resizemode-75/153339293.jpg","video":null,"publish_date":"2025-12-24 00:01:57","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.327},{"id":388571252,"title":"Letters: Public safety is lost in bureaucratic speech about gas explosion","text":"Public safety is lost\nin bureaucratic speech\n\nRe: “How did gas leak go badly?” (Page A1, Dec. 21).\n\nBureaucratic spokespeople need a new script.\n\nPG&E and Alameda County Fire officials say more investigation is needed to determine if residents should have been told to leave. The fact that a house blew up and people were injured means they absolutely should have been told. These spokespeople mean “did we follow our flawed process that said no need to notify despite the risk, or did we not follow our good enough process that should have notified people?”\n\nAs such, they completely lose track of their real responsibility, our safety.\n\nRanked choice could\nsave county money\n\nRe: “A fix for Santa Clara county’s expensive special elections” (Page A6, Dec. 19).\n\nI completely agree with David Newswanger’s excellent, informative article.\n\nAs I filled in the circle next to Neysa Fligor on the ballot for Santa Clara County assessor, I thought of what a waste of money this is. If we had ranked-choice voting, the millions of dollars spent on this special election could have gone to education, food banks, medical care, housing, etc. And to add insult to injury, the other person on the ballot had been advertising that if he is elected, people over a certain age will not have to pay property taxes. The county assessor does not determine who has to pay property tax and who does not. Apparently, quite a few people believed him.\n\nI encourage voters to choose Neysa Fligor. Endorsed by the Mercury News, she is experienced and honest.\n\nLois Smallwood\n\nRichmond mayor’s post\ncreates mistrust\n\nRe: “Internal affairs” (Page B1, Dec. 21).\n\nI was deeply disheartened to read of Richmond Mayor Eduardo Martinez’s LinkedIn post characterizing the attacks at Bondi Beach as a “false flag” operation.\n\nAs a political leader representing a region that is culturally and religiously diverse, publicly suggesting that a targeted antisemitic attack may have been fabricated is deeply troubling. Such statements risk minimizing real acts of hatred and violence, and they can contribute to mistrust, fear and further polarization — particularly for Jewish communities who already face rising antisemitism worldwide.\n\nI read the mayor’s apology, and I suggest that he find his nearest synagogue, request a meeting with the rabbi, and attend a Shabbat service soon.\n\nJim Pollock\n\nIs Weiss creating\nstate media at CBS?\n\nCBS News editor-in-chief Bari Weiss shelved a “60 Minutes” story scheduled to run Sunday on Venezuelan detainees being sent to a notorious Salvadoran prison. Author and “60 Minutes” correspondent Sharyn Alfonsi responded with a memo stating that Weiss canceled the piece in response to political pressure from the Trump administration, despite the fact that it had been vetted and cleared by CBS attorneys and editors.\n\nCBS is now owned by Paramount Skydance, which is headed by David Ellison, who appointed Weiss to her position. His father is billionaire and Trump supporter Larry Ellison. Paramount is hoping to seek approval from the Trump administration to acquire Warner Brothers which owns CBS.\n\nThe First Amendment prohibits Congress from abridging freedom of the press. It appears that the real threat is from the president, who uses regulatory authority and alliance with corporate power to influence editorial news policy. Free press or state press?\n\nTrump is shaking\ndown Venezuela\n\nRe: “U.S. stops another oil tanker off the coast of Venezuela” (Page A3, Dec. 21).\n\nThe U.S. pursuit of oil tankers near Venezuela is not diplomacy — it is state-sponsored plunder. Under Donald Trump, federal power and taxpayer resources are being abused to wage economic warfare, stripping Venezuela of its resources while driving its people into deeper poverty.\n\nThis has nothing to do with democracy or human rights. It is about oil, coercion and regime change by starvation. Sanctions and naval intimidation have exacerbated problems of access to food, medicine and fuel. Collective punishment of civilians is a crime, not a policy tool.\n\nCongress’ silence is indefensible. The Constitution vests Congress with authority over war, foreign commerce and public funds. Lawmakers must break their long abdication, assert their vigorous legislative authority, and demand an immediate halt to Trump’s reckless actions.","summary":"Also: Saving money &#124; Creating mistrust &#124; State media? &#124; Plundering Venezuela. Mercury News reader letters to the editor for Dec. 24, 2025.","url":"https://www.mercurynews.com/2025/12/23/letters-bureaucratic-speech-about-explosion-leaves-out-public-safety/","image":"https://www.mercurynews.com/wp-content/uploads/2025/12/EBT-L-ALCOFIRE-1212-7.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-24 00:00:23","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.619},{"id":388545084,"title":"Venezuelans Brand Trump ‘Oil Thief’ As US Navy Chases Tankers In Caribbean; Maduro’s NEW Message","text":"1 views | Dec 24, 2025, 01:45:00 AM | TOI.in\n\nDozens of motorcyclists dressed as pirates swept through Caracas, staging a dramatic protest against U.S. President Donald Trump’s order to seize Venezuelan oil tankers under a blockade of sanctioned vessels. Protesters accused Washington of “piracy” and vowed to defend Venezuela’s sovereignty. As tensions rose, Interior Minister Diosdado Cabello escalated rhetoric, warning Trinidad and Tobago against allowing U.S. military operations from its territory, threatening retaliation if Venezuela is attacked. The warning follows U.S. seizures of oil tankers near Venezuela and Washington’s demand that Caracas return assets taken from U.S. oil firms. With warships, sanctions, and sharp rhetoric, Caribbean tensions are intensifying.","url":"https://timesofindia.indiatimes.com/videos/international/venezuelans-brand-trump-oil-thief-as-us-navy-chases-tankers-in-caribbean-maduros-new-message/videoshow/126147976.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126147976/126147976.jpg?resizemode=4","video":null,"publish_date":"2025-12-24 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":0.264},{"id":388545080,"title":"Vance The Next Trump? MAGA 'Cracks' Wide Open As Successor Question Sparks 'Infighting' | 2028 Race","text":"1 views | Dec 24, 2025, 01:18:03 AM | TOI.in\n\nThe race to succeed President Donald Trump is quietly heating up inside MAGA World. A major early endorsement from Turning Point USA CEO Erika Kirk has put Vice President J.D. Vance firmly in the spotlight as a potential front-runner for the 2028 Republican nomination. While Vance has not declared a run and insists his focus remains on defending GOP majorities in the midterms, new polling and straw votes suggest he is already leading the field. At the same time, internal tensions are emerging within the conservative movement over free speech, controversial figures, and who should carry Trump’s political legacy forward. With figures like Marco Rubio, Ron DeSantis, Ted Cruz, and Donald Trump Jr. circling, the battle to define the future of the Republican Party may be underway far earlier than expected.","url":"https://timesofindia.indiatimes.com/videos/international/vance-the-next-trump-maga-cracks-wide-open-as-successor-question-sparks-infighting-2028-race/videoshow/126147867.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126147867/126147867.jpg?resizemode=4","video":null,"publish_date":"2025-12-24 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","source_country":"in","sentiment":0.063},{"id":388571030,"title":"Where to Watch the Kennedy Center Honors","text":"The 2025 Kennedy Center Honors are set to air on Tuesday with President Donald Trump as host, after he appointed himself chair of the board. He has since added his name to the performing arts center building facade as well.\n\nThe 48th Kennedy Center Honors took place Dec. 7 on the Kennedy Center Opera House stage in Washington, D.C., but will finally air in full on Tuesday. The honorees received tributes through performances from their peers and recognition from the board.\n\n“For nearly half a century, this tradition has celebrated those whose voices and visions tell our nation’s story and share it with the world,” said Richard Grenell, president of the Kennedy Center. “This year’s honorees have left an indelible mark on our history, reminding us that the arts are for everyone.”\n\nTrump initially claimed that with him as host, the Kennedy Center Honors will be “the highest-rated show that they’ve ever done.”\n\nThe 48th annual ceremony is the first since Trump restructured the Kennedy Center board and named himself chair. The Trump administration then announced on Thursday that the JFK Memorial Center for the Performing Arts would be renamed to the “Trump-Kennedy Center.” The decision sparked backlash from many of the living Kennedys, including Maria Shriver, Kerry Kennedy and Jack Schlossberg.\n\nThe Kennedy Center Honors recognize artistic contributions that made an impact on American life. Previous honorees include Meryl Streep, Stevie Wonder, Tina Turner, Billy Joel and Tom Hanks, to name a few. Since 1978, the honors have recognized stars across genres for their influence on American culture and the arts.\n\nKeep reading for where to watch the 48th Kennedy Center Honor and find out which artists will be recognized Tuesday.\n\nWhen are the 48th Kennedy Center Honors?\n\nThe Kennedy Center Honors will air on Dec. 23 at 8 p.m. ET/PT.\n\nWhere can I watch?\n\nThe awards ceremony will broadcast on CBS, and it will stream on Paramount+.\n\nWho is hosting the telecast?\n\nPresident Donald Trump will host the awards ceremony “at the request of a certain television network,” he claimed at an honorees dinner earlier this month. Previous hosts include Walter Cronkite and Stephen Colbert, among others. Presidents typically watch the show alongside the honorees, but notably Trump skipped the honors altogether during his first term. Trump will be the first president to host the awards show.\n\nWho are the honorees?\n\nThis year’s honorees include country music singer George Strait, rock band KISS (Paul Stanley, Gene Simmons, Peter Criss, Ace Frehley), Tony Award-winning actor Michael Crawford, Grammy-winning disco singer Gloria Gaynor and Sylvester Stallone.\n\nWatch the trailer","summary":"President Donald Trump hosted the event on Dec. 7 and has since renamed the John F. Kennedy Memorial Center for the Performing Arts in his honor\n\n\nThe post Where to Watch the Kennedy Center Honors appeared first on TheWrap.","url":"https://www.thewrap.com/creative-content/what-to-watch/where-to-watch-the-kennedy-center-honors-trump-hosts/","image":"https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/12/GettyImages-2249982863.jpg?fit=1200%2C675&quality=89&ssl=1","video":null,"publish_date":"2025-12-24 00:00:00","author":"Tess Patton","authors":["Tess Patton"],"language":"en","source_country":"US","sentiment":0.676},{"id":388572990,"title":"ET Analysis| India has signed a flurry of trade accords, but do they deliver the goods?","text":"New Delhi: India’s recent trade agreements with New Zealand, Oman and the UK underscore the government’s push to conclude such pacts as the world’s geoeconomic map gets redrawn, primarily driven by US President Donald Trump’s tariff moves. New Delhi and Washington DC are also holding parleys over their long-awaited bilateral trade agreement.What’s been the impact of the country’s trade agreements thus far? The avowed aim is to deepen economic ties, help exporters and smoothen the way for qualified Indians to work overseas. An ET analysis of the seven free trade and economic cooperation agreements that the country has signed shows the work in progress.India has registered a surplus with two of its free trade agreement (FTA) partners — Mauritius and the South Asian Free Trade Area (SAFTA) — in the last five years while registering a deficit with others, including Asean, South Korea, Japan and the UAE. The trade gap with Australia has been narrowing for the last two years. Despite the trade deficit, India has exported new products such as pomegranate arils after the India-Australia Economic Cooperation and Trade Agreement (ECTA), which came into force on December 29, 2022. Export diversification“FTAs have led to deeper engagement with the partner countries with greater market access — trade has increased with them,” said an official. “One such example is pomegranate aril exports to Australia which got a boost after the trade pact.”Live EventsIndia’s exports of furniture and sports goods to Australia, fresh pineapple, apple berry and squash to the UAE and anthurium flowers to Singapore show New Delhi’s expanding ties with its trade partners, even though the value of such products is relatively low.As per official data, the trade deficit with the UAE widened to $26.8 billion in FY25 from $16.8 billion in FY22, while it narrowed with Australia to $6.9 billion from $8.5 billion over the same period. In contrast, India has maintained a trade surplus with Mauritius, although it declined slightly to $0.5 billion in FY25 from $0.6 billion in FY22.Similarly, the India-Sri Lanka Free Trade Agreement (ISFTA) was signed in 1998 and came into force in March 2000, has seen broad-based expansion of exports, driven by a combination of large-value industrial shipments and essential and consumer goods.Vehicles and ships powered the 17% rise in India’s exports to Sri Lanka in April–November 2025. “Apart from these large contributors, several other commodities recorded very high growth rates on a relatively lower base, underscoring diversification in India’s export basket to Sri Lanka,” said another official. The combination of strong absolute gains in high-value products and rapid growth in niche and industrial items points to a more diversified and resilient export relationship.These include cereals, animal products, marine products, lead, ceramics, lac, gums, resins and other vegetable saps and extracts. They recorded high export growth rates on a lower base.The goods trade deficit with the Association of Southeast Asian Nations (Asean) ballooned to $45.2 billion in FY25 from $25.8 billion in FY22 and $21.8 billion in FY19. Deficits with Japan and South Korea also widened to $12.7 billion and $15.2 billion, respectively, in FY25.“A review of the trade pacts with Asean and South Korea are going on,” said the official. The Asean-India Trade in Goods Agreement (AITIGA) came into effect in 2010. India’s goods exports to the bloc shrank 5.4% on-year in FY25 to $38.96 billion while imports rose 5.6% to $84.16 billion.Meanwhile, India continues to maintain a trade surplus with South Asia. However, this surplus declined to $20.2 billion in FY25 from $28.7 billion in FY22 and $21 billion in FY19.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onIndia New Zealand trade agreementsIndia trade agreements impactIndia Australia Economic Cooperation and Trade AgreementIndia trade deficitIndia exports growthIndia Sri Lanka Free Trade AgreementIndia ASEAN trade relations\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onIndia New Zealand trade agreementsIndia trade agreements impactIndia Australia Economic Cooperation and Trade AgreementIndia trade deficitIndia exports growthIndia Sri Lanka Free Trade AgreementIndia ASEAN trade relations \n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"India is actively signing trade pacts with countries like New Zealand, Oman, and the UK. These agreements aim to boost exports and deepen economic ties. While India has a trade surplus with some partners like Mauritius and SAFTA, it faces deficits with others such as Asean, South Korea, Japan, and the UAE.","url":"https://economictimes.indiatimes.com/news/economy/foreign-trade/et-analysis-india-has-signed-a-flurry-of-trade-accords-but-do-they-deliver-the-goods/articleshow/126147242.cms","image":"https://img.etimg.com/thumb/msid-126147283,width-1200,height-630,imgsize-154686,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-12-24 00:00:00","author":"Anoushka Sawhney","authors":["Anoushka Sawhney"],"language":"en","source_country":"in","sentiment":0.457},{"id":388574212,"title":"Macron, European partners express solidarity over Greenland issue","text":"French President Emmanuel Macron on Tuesday joined European partners in expressing \"full solidarity\" over the Greenland issue, after U.S. President Donald Trump recently reiterated his call to take over the Danish autonomous territory, reported Xinhua.\n\n \"Greenland belongs to its people. Denmark stands as its guarantor. I join my voice to that of Europeans in expressing our full solidarity,\" Macron said on social media platform X.\n\n \"In Nuuk, I reaffirmed France's unwavering support for the sovereignty and territorial integrity of Denmark and Greenland,\" said Macron, referring to his visit to Greenland in June.\n\n On Sunday, Trump announced the appointment of Louisiana Governor Jeff Landry as special envoy to Greenland.\n\n \"We have to have it (Greenland) and he (Landry) wanted to lead the charge,\" Trump has said.\n\n Trump's appointment of the envoy to Greenland has sparked strong diplomatic reactions in Greenland, Denmark and the European Union (EU).\n\n Danish Prime Minister Mette Frederiksen and Greenlandic Prime Minister Jens-Frederik Nielsen said on Monday in a joint statement that they expect respect for their \"joint territorial integrity\" from the U.S. side.\n\n \"We have said it very clearly before. Now we say it again. You cannot annex other countries. Not even with an argument about international security. Greenland belongs to the Greenlanders, and the U.S. should not take over Greenland,\" the statement said.\n\n \"Preserving the territorial integrity of the Kingdom of Denmark, its sovereignty and the inviolability of its borders is essential for the European Union,\" EU Foreign Affairs spokesperson Anouar El Anouni told a press conference Monday, adding that the bloc's stance is grounded in a long-standing position on the issue.\n\n Sweden on Monday reiterated its support for Denmark on the Greenland issue.\n\n \"Sweden stands wholeheartedly behind its neighbour ... will always stand up for international law,\" Swedish Foreign Minister Maria Malmer Stenergard said, adding that \"the obligation to respect the sovereignty and territorial integrity of states is a fundamental principle of international law.\"\n\n Dutch Minister of Foreign Affairs David van Weel on Tuesday expressed support for Denmark on the Greenland issue on X, saying it is up to Denmark and Greenland to decide on matters concerning Greenland.\n\n Greenland, a former Danish colony, was granted home rule in 1979. In 2009, Denmark passed the Act on Greenland Self-Government, expanding the island's authority over its domestic affairs. However, Denmark retains authority over Greenland's foreign, defense and security policy, according to information on the website of the Prime Minister's Office of Denmark.","url":"https://www.dailyfinland.fi/europe/46934/Macron-European-partners-express-solidarity-over-Greenland-issue","image":"https://www.dailyfinland.fi/assets/news_photos/2025/12/24/image-46934-1766532905.jpg","video":null,"publish_date":"2025-12-24 00:00:00","author":null,"language":"en","source_country":"fi","sentiment":0.082},{"id":388574204,"title":"US SC blocks Trump admin from deploying National Guard to Illinois","text":"The U.S. Supreme Court on Tuesday blocked President Donald Trump's attempt to send the National Guard to the state of Illinois, dealing a setback to the administration, reported Xinhua.\n\n The court denied the Trump administration's request in a 6-3 vote.\n\n \"At this preliminary stage, the government has failed to identify a source of authority that would allow the military to execute the laws in Illinois,\" the court said in an order published on its website.\n\n The dispute dates back to Oct. 4, when Trump called 300 members of the Illinois National Guard into active federal service in Illinois, particularly in and around Chicago. The following day, members of the Texas National Guard were also federalized and sent to Chicago, according to the court.\n\n On Oct. 9, the U.S. District Court for the Northern District of Illinois issued a temporary restraining order barring the federalization and deployment of the National Guard in Illinois.\n\n The decision was upheld on Oct. 16 by the U.S. Court of Appeals for the Seventh Circuit, which allowed the administration to federalize the National Guard but not to deploy its members.\n\n The Trump administration then appealed to the Supreme Court.","url":"https://www.dailyfinland.fi/worldwide/46941/US-SC-blocks-Trump-admin-from-deploying-National-Guard-to-Illinois","image":"https://www.dailyfinland.fi/assets/news_photos/2025/12/24/image-46941-1766536711.jpg","video":null,"publish_date":"2025-12-24 00:00:00","author":null,"language":"en","category":"politics","source_country":"fi","sentiment":-0.52},{"id":388570586,"title":"Trump travelled on Epstein’s plane more than previously thought, prosecutor says","text":"US President Donald Trump was listed as a passenger on the private jet of late convicted sex offender Jeffrey Epstein eight times between 1993 and 1996, a new email released by the US Department of Justice (DOJ) says. “Donald Trump travelled on Epstein’s private jet many more times than previously has been reported (or that we were aware),” reads the 7 January 2020 email from an assistant US attorney. Trump’s name on the flight record does not indicate wrongdoing. In 2024, Trump wrote: “I was never on Epstein’s Plane”. He has denied any wrongdoing in relation to Epstein. The DOJ says some files released on Tuesday “contain untrue and sensationalist claims” against Trump. Trump was a friend of Epstein’s for years, but the president has said they fell out in about 2004, years before Epstein was first arrested. The latest release of documents – running to more than 30,000 pages – is part of the so-called Epstein files, the DOJ was legally required to publish in their entirety by last Friday. In a statement on Tuesday, the DOJ said: “Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. “To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponised against President Trump already.” “Nevertheless, out of our commitment to the law and transparency, the DOJ is releasing these documents with the legally required protections for Epstein’s victims,” the DOJ statement on X said. The prosecutor’s email was sent on 7 January 2020 and is part of an email chain which includes the subject heading: “RE: Epstein flight records.” The sender and recipient are redacted, but the bottom of the email says assistant US attorney, Southern District of New York – with the name redacted. The email states that Trump “is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which [Epstein’s associate Ghislaine] Maxwell was also present. He is listed as having traveled with, among others and at various times, Marla Maples, his daughter Tiffany, and his son Eric.” “On one flight in 1993, he and Epstein are the only two listed passengers; on another, the only three passengers are Epstein, Trump, and then-20-year-old…” – the rest of the sentence has been redacted. It continues: “On two other flights, two of the passengers, respectively, were women who would be possible witnesses in a Maxwell case.” The email says Trump flew on Epstein’s jet “including during the period we would expect to charge in a Maxwell case”. In 2022, Maxwell was sentenced to 20 years in prison for crimes including conspiracy to entice minors to travel to engage in illegal sex acts and sex trafficking of a minor. The DOJ at the time said she committed the crimes from at least 1994 to up to, and including in or about, 2004. Epstein died in a New York prison cell in 2019 as he awaited his trial on sex trafficking charges. The 2020 email released by the US Department of Justice The prosecutor’s email does not provide more details about the flights. A handwritten flight log released by the DOJ in February appears to have many entries which are difficult to read. However, one lists Donald Trump, as well as his son Eric, for a flight on 13 August 1995 from PBI (Palm Beach International Airport in Florida) to TEB (Teterboro Airport in New Jersey). It also lists JE and GM – widely believed to be acronyms for Jeffrey Epstein and Ghislaine Maxwell. Tuesday’s release of files related to Epstein is the largest so far – but many more documents held by the DOJ are yet to be made public. Several thousand files have been published across eight batches since Friday. The DOJ missed last Friday’s deadline set by Congress to publish all its files related to Epstein – including photos, videos and investigative materials. The department has faced criticism from survivors and lawmakers from across the aisle for its failure to meet that deadline. Deputy Attorney General Todd Blanche said on the day of the deadline that not all the files would be made public immediately, and that more would be published over the coming weeks. “There’s a lot of eyes looking at these, so we want to make sure that when we do produce the materials that we’re producing, we’re protecting every single victim,” he said on Friday. President Commissions 36.5 Million Dollars Hospital In The Tain District You Will Not Go Free For Killing An Hard Working MP – Akufo-Addo To MP’s Killer I Will Lead You To Victory – Ato Forson Assures NDC Supporters Visit Our Social Media for More","url":"https://hbtvghana.com/trump-travelled-on-epsteins-plane-more-than-previously-thought-prosecutor-says/","image":"https://hbtvghana.com/wp-content/uploads/2025/12/trump-travelled-on-epsteins-plane-more-than-previously-thought-prosecutor-says.png","video":null,"publish_date":"2025-12-23 23:59:12","author":"Hbtvghana","authors":["Hbtvghana"],"language":"en","source_country":"gh","sentiment":-0.378},{"id":388575008,"title":"Trump travelled on Epstein’s plane more than previously thought, prosecutor says","text":"US President Donald Trump was listed as a passenger on the private jet of late convicted sex offender Jeffrey Epstein eight times between 1993 and 1996, a new email released by the US Department of Justice (DOJ) says.\n\n\"Donald Trump travelled on Epstein's private jet many more times than previously has been reported (or that we were aware),\" reads the 7 January 2020 email from an assistant US attorney.\n\nTrump's name on the flight record does not indicate wrongdoing. In 2024, Trump wrote: \"I was never on Epstein's Plane\". He has denied any wrongdoing in relation to Epstein.\n\nThe DOJ says some files released on Tuesday \"contain untrue and sensationalist claims\" against Trump.\n\nTrump was a friend of Epstein's for years, but the president has said they fell out in about 2004, years before Epstein was first arrested.\n\nThe latest release of documents - running to more than 30,000 pages - is part of the so-called Epstein files, the DOJ was legally required to publish in their entirety by last Friday.\n\nIn a statement on Tuesday, the DOJ said: \"Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. \n\n\"To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponised against President Trump already.\"\n\n\"Nevertheless, out of our commitment to the law and transparency, the DOJ is releasing these documents with the legally required protections for Epstein's victims,\" the DOJ statement on X said.\n\nThe prosecutor's email was sent on 7 January 2020 and is part of an email chain which includes the subject heading: \"RE: Epstein flight records.\"\n\nThe sender and recipient are redacted, but the bottom of the email says assistant US attorney, Southern District of New York - with the name redacted.\n\nThe email states that Trump \"is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which [Epstein's associate Ghislaine] Maxwell was also present. He is listed as having traveled with, among others and at various times, Marla Maples, his daughter Tiffany, and his son Eric.\"\n\n\"On one flight in 1993, he and Epstein are the only two listed passengers; on another, the only three passengers are Epstein, Trump, and then-20-year-old...\" - the rest of the sentence has been redacted.\n\nIt continues: \"On two other flights, two of the passengers, respectively, were women who would be possible witnesses in a Maxwell case.\"\n\nThe email says Trump flew on Epstein's jet \"including during the period we would expect to charge in a Maxwell case\".\n\nIn 2022, Maxwell was sentenced to 20 years in prison for crimes including conspiracy to entice minors to travel to engage in illegal sex acts and sex trafficking of a minor. The DOJ at the time said she committed the crimes from at least 1994 to up to, and including in or about, 2004.\n\nEpstein died in a New York prison cell in 2019 as he awaited his trial on sex trafficking charges.\n\nThe prosecutor's email does not provide more details about the flights.\n\nA handwritten flight log released by the DOJ in February appears to have many entries which are difficult to read.\n\nHowever, one lists Donald Trump, as well as his son Eric, for a flight on 13 August 1995 from PBI (Palm Beach International Airport in Florida) to TEB (Teterboro Airport in New Jersey). It also lists JE and GM - widely believed to be acronyms for Jeffrey Epstein and Ghislaine Maxwell.\n\nTuesday's release of files related to Epstein is the largest so far - but many more documents held by the DOJ are yet to be made public. Several thousand files have been published across eight batches since Friday.\n\nThe DOJ missed last Friday's deadline set by Congress to publish all its files related to Epstein - including photos, videos and investigative materials.\n\nThe department has faced criticism from survivors and lawmakers from across the aisle for its failure to meet that deadline.\n\nDeputy Attorney General Todd Blanche said on the day of the deadline that not all the files would be made public immediately, and that more would be published over the coming weeks.\n\n\"There's a lot of eyes looking at these, so we want to make sure that when we do produce the materials that we're producing, we're protecting every single victim,\" he said on Friday.","summary":"US President Donald Trump was listed as a passenger on the private jet of late convicted sex offender Jeffrey Epstein eight times between 1993 and 1996, a new email released by the US Department of Justice (DOJ) says.","url":"https://www.myjoyonline.com/trump-travelled-on-epsteins-plane-more-than-previously-thought-prosecutor-says/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/11/image-1086.png","video":null,"publish_date":"2025-12-23 23:59:12","author":"Abubakar Ibrahim,Bbc 59pm","authors":["Abubakar Ibrahim","Bbc 59pm"],"language":"en","source_country":"gh","sentiment":-0.385},{"id":388573896,"title":"US Supreme Court Blocks Trump's National Guard Deployment In Chicago","text":"The US Supreme Court dealt a blow to President Donald Trump's immigration crackdown on Tuesday by blocking his deployment of National Guard troops in Chicago.The conservative-dominated court kept in place for now a lower court order barring the deployment of troops on the streets of the city in the midwestern state of Illinois.\"At this preliminary stage, the Government has failed to identify a source of authority that would allow the military to execute the laws in Illinois,\" the court said in an unsigned order.Three conservative justices -- Samuel Alito, Clarence Thomas and Neil Gorsuch -- dissented.The Republican president has sent National Guard troops to three Democratic-led cities this year -- Los Angeles, Washington and Memphis -- but his efforts to deploy soldiers in Portland and Chicago have been tied up in the courts. White House spokeswoman Abigail Jackson, reacting to the court ruling, said the president \"activated the National Guard to protect federal law enforcement officers, and to ensure rioters did not destroy federal buildings and property.\"\"Nothing in today's ruling detracts from that core agenda,\" Jackson said.JB Pritzker, the Democratic governor of Illinois, who strongly opposed the deployment along with the Democratic mayor of Chicago, welcomed the ruling, calling it a \"big win for Illinois and American democracy.\"\"This is an important step in curbing the Trump Administration's consistent abuse of power and slowing Trump's march toward authoritarianism,\" Pritzker said.After two lower courts blocked Trump from sending troops into Chicago, his administration made an emergency appeal to the Supreme Court.In his filing with the top court, Solicitor General John Sauer claimed federal agents in Chicago were being \"forced to operate under the constant threat of mob violence.\"The court order blocking deployment of the National Guard \"improperly impinges on the president's authority and needlessly endangers federal personnel and property,\" Sauer added.The Supreme Court rebuff of the emergency appeal was a rare defeat for Trump at the top court, where conservatives hold a 6-3 majority.It was not immediately clear how Tuesday's decision would affect the other cases where Democratic-ruled states have challenged Trump's National Guard deployment.California and Oregon have both filed legal challenges against the Trump administration's extraordinary domestic use of the National Guard.Trump sent troops to Los Angeles earlier this year to quell demonstrations sparked by a federal crackdown on undocumented migrants.A district court judge ruled it unlawful, but an appeals court panel allowed the Los Angeles deployment to proceed.Some 300 National Guard troops remain activated in the Chicago area but are not engaged in operations.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The US Supreme Court dealt a blow to President Donald Trump's immigration crackdown on Tuesday by blocking his deployment of National Guard troops in Chicago.","url":"https://www.ndtv.com/world-news/us-supreme-court-blocks-donald-trumps-national-guard-deployment-in-chicago-9919325","image":"https://c.ndtvimg.com/2025-12/76kihrg8_us-national-guard-troops_625x300_24_December_25.jpeg","video":null,"publish_date":"2025-12-23 23:58:54","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.13},{"id":388575352,"title":"New Epstein files mention Trump again: Key takeaways from DOJ document release","text":"The US Justice Department has released tens of thousands more documents on Tuesday related to Jeffrey Epstein in its most extensive disclosure yet, a tranche that includes multiple mentions of President Donald Trump but offers little new information about the late financier and convicted sex offender. The release follows a sustained public push for transparency into the government’s Epstein investigations.Here are the key takeaways from the latest Epstein files: The latest document dump includes multiple references to Donald Trump, largely drawn from old news clippings and internal emails. While a prosecutor flagged Trump’s past travel on Epstein’s private jet, the Justice Department stressed that Trump has not been accused of any wrongdoing linked to Epstein. An internal email from January 2020 shows a federal prosecutor noting that Trump flew on Epstein’s jet more often than publicly known at the time. Records list Trump on at least eight flights between 1993 and 1996, some alongside Ghislaine Maxwell, though several of these trips had already surfaced during Maxwell’s trial. The US Department of Justice cautioned that some documents contain “untrue and sensationalist” allegations. One high-profile document — a purported letter from Epstein to disgraced sports doctor Larry Nassar — was officially declared fake by the FBI, underscoring that release does not equal verification. The files again reference public figures including Bill Clinton, Michael Jackson, Diana Ross, and Prince Andrew. Prosecutors reiterated that appearing in Epstein-related records or correspondence does not imply criminal conduct. The documents also detail failed efforts to compel Prince Andrew’s testimony amid legal and diplomatic hurdles. Nearly 30,000 additional pages were made public, the biggest release so far, following political pressure and a law mandating disclosure. While much of the material was already known, critics including Senate Minority Leader Chuck Schumer say the files still leave major gaps, including unanswered questions about potential co-conspirators mentioned in earlier FBI communications. - EndsPublished By: Aashish VashisthaPublished On: Dec 24, 2025Must Watch","url":"https://www.indiatoday.in/world/us-news/story/new-epstein-files-mention-trump-again-key-takeaways-from-doj-document-release-glbs-2840814-2025-12-24","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202512/jeffrey-epstein-files-23065863-16x9_1.jpg?VersionId=_7bLFK2bU4xcUZA7kRi6WhSyMiiZ8Fja?size=1280:720","video":null,"publish_date":"2025-12-23 23:58:40","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","source_country":"in","sentiment":-0.312},{"id":388571438,"title":"What tension between the U.S. and Venezuela could mean for Canada","text":"Amid growing tension between the U.S. and Venezuela over access to the South American country’s oil resources, Canada, and specifically its oil industry, could be impacted.\n\nOff the coast of Venezuela, sanctioned oil tankers have become the target of U.S. authorities. Washington has already seized two – along with millions of barrels of oil – and says its going after more.\n\n“Maybe we’ll sell it, maybe we’ll keep it, maybe we’ll use it in the strategic reserves,” U.S. President Donald Trump said on Monday.\n\nThe U.S. increased its military presence in the Caribbean Sea after Trump ordered a blockade last week, calling it the biggest armada the U.S. has ever had in South America.\n\nOn Tuesday, Venezuelans hit the streets in protest of the U.S. president – whom they call “Pirate Trump” – who Monday had a warning for Venezuelan President Nicolas Maduro.\n\n“He can do whatever he wants, it’s alright, whatever he wants to do, if he wants to do something,” Trump said. “If he plays tough, it’ll be the last time he’s ever able to play tough.” \n\nCanadian impact\n\nMeanwhile, the tension in South America could have implications for Canada too.\n\n“Venezuela has some of the largest oil reserves in the world,” said Richard Masson, a former Canadian oil industry executive. “They’re primarily heavy oil and bitumen, which are very much like what Canada’s reserves are here in the oil sands.”\n\nExperts say political instability in Venezuela had long given Canadian oil producers the advantage, but if Trump can topple the Maduro government, it could mean increased competition.\n\n“This makes it all the more important for us to think about sending out oil to the pacific, to a northwest pacific pipeline, knowing that the Asian market is growing,” said Heather Exner-Pirot, a senior fellow and director of natural resources, energy and environment at the Macdonald-Laurier Institute. \n\nExner-Pirot suggests Trump’s interest in Venezuelan oil could eventually force a fight for access to the U.S. market. Masson says it may take long for the impact of those tensions to take affect. \n\n“The question becomes: If Venezuela became a democracy, with the rule of law, with a stable investment climate, how long would it take to build the projects to displace western Canadian oil?” Masson said. “I think that would take a long time.”","url":"https://www.ctvnews.ca/business/article/what-tension-between-the-us-and-venezuela-could-mean-for-canada/","image":"https://www.ctvnews.ca/resizer/v2/OMVLZ2TAWFA5PF6V6TPSOMOVIQ.jpg?auth=934df908dee03cddde2ef966cacf54f50d31abf5bdb76d8d6fb38873ea9734c4","video":null,"publish_date":"2025-12-23 23:54:05","author":"Jeremie Charron","authors":["Jeremie Charron"],"language":"en","category":"politics","source_country":"ca","sentiment":0.012},{"id":388573218,"title":"S&P posts record close as growth stocks advance","text":"NEW YORK: US stocks rose on Tuesday and the S&P 500 notched a closing record after a flurry of economic data that included a reading of economic growth pushed bond yields higher and elevated growth names.\n\nThe Commerce Department said gross domestic product increased at a 4.3% annualised rate in the third quarter, the fastest pace since the third quarter of 2023 and well above the 3.3% estimate of economists polled by Reuters, fueled by robust consumer spending.\n\nWhile ‌the data was delayed due to the 43-day government shutdown and many analysts expected the fourth ⁠quarter would show a slower pace of economic growth, markets are now pricing in a smaller chance of a January rate cut from the Federal Reserve, according to CME's FedWatch Tool, and shorter-dated bond yields rose.\n\n\"The bond ​market didn't like this news,\" said Stephen Massocca, senior vice president at Wedbush Securities in San Francisco.\n\n\"It seems to me that when we lose this battle, growth does well, and growth's doing well today... but if you're a food company, or you're a chemical company, or you're an oil and gas company, or even if you're like a private credit company, that's bad news. Unless interest rates go down, it's bad.\"\n\nThe Dow Jones Industrial Average rose 79.73 points, or 0.16%, to 48,442.41, the S&P 500 gained 31.30 points, or 0.46%, to 6,909.79 and the Nasdaq Composite gained 133.02 points, or 0.57%, to 23,561.84.\n\nThe S&P 500 growth index gained 0.8% while the value index was largely unchanged.\n\nAI-related names added ‍to recent gains, rebounding from last week's selloff ⁠that was triggered ‍by concerns ​about inflated valuations and worries that high capital spending by AI companies would pressure their profits.\n\nNvidia rose 3% as the biggest boost to ⁠the benchmark S&P 500 index, while Amazon.com, Alphabet and Broadcom each saw gains of more than 1% on the day.\n\nOther economic data painted a less rosy image of the economy as US consumer confidence weakened in December amid deepening anxiety over jobs and income. Factory production was unchanged in November after declining in October.\n\nAll three main indexes were poised ‍for a third straight yearly gain. The S&P 500 and ‍the Dow were also on track to rise for an eighth consecutive month.\n\nRecent gains in US stocks have spurred hopes of a \"Santa Claus rally\", a seasonal phenomenon where ‌the S&P 500 posts gains in the last five trading days of the year and the first two in January, according to Stock Trader's Almanac.\n\nThis year, that period begins on ⁠Wednesday and runs through January 5.\n\nTrading volumes were light and likely to thin out further as the holiday approaches. US stock markets will close at 1 p.m. ET (1800 GMT) on Wednesday and remain shut on Thursday for Christmas.\n\nVolume on US exchanges was 14.01 billion shares, compared with the 16.67 billion average for the full session over the last 20 trading days.\n\nServiceNow ⁠declined 1.5% after the enterprise software maker agreed to buy cybersecurity startup Armis for US$7.75 billion in cash.\n\nUS military shipbuilder Huntington Ingalls edged up 0.3% after President Donald Trump announced plans for a new \"Trump class\" of battleships, which he said would be larger, faster and \"100 times more powerful\" than any previously built.\n\nMiner Freeport-McMoRan climbed 2.5% and closed at a 15-month high of US$52.29 as copper prices touched a record high and Wells Fargo raised its price target on the stock.\n\nDeclining issues outnumbered ‍advancers by a 1.02-to-1 ratio on the NYSE and by a 1.6-to-1 ratio on the Nasdaq.\n\nThe S&P 500 posted 35 new 52-week highs and five new ⁠lows while the Nasdaq Composite recorded 70 new highs and 178 new lows. — Reuters","url":"https://www.thestar.com.my/business/2025/12/24/sp-posts-record-close-as-growth-stocks-advance","image":"https://apicms.thestar.com.my/uploads/images/2025/12/24/3688419.JPG","video":null,"publish_date":"2025-12-23 23:51:00","author":"The Star Online","authors":["The Star Online"],"language":"en","source_country":"my","sentiment":-0.112},{"id":388576104,"title":"Shark Tank’s Kevin O’Leary blames Trump’s Canada trade tensions for Jim Beam’s shuttering of distillery: ‘Self-inflicted mess’","text":"Canadian businessman and Shark Tank judge Kevin O’Leary is blaming the trade tensions between the U.S. and Canada for the temporary closure of a Jim Beam distillery.\n\nJim Beam, one of the largest makers of American whiskey globally, announced it will halt production at its Clermont, Kentucky, distillery for one year, starting on January 1, 2026. The bourbon whiskey brand plans to “invest in site enhancements” during the closure, according to a statement.\n\nThe announcement comes as U.S. spirit exports to Canada are declining, with many Canadians boycotting American liquor in response to President Donald Trump’s tariffs and his suggestion that the nation should be the 51st state. \n\nWhen NewsNation asked O’Leary about the Kentucky distillery’s temporary closure, he labeled the issue a “specific problem” and called on Canadian and U.S. officials to find common ground.\n\n“Canada needs to get in a much more cooperative mode, and the U.S. has to get much more cooperative mode with Canada, because Canada has all the natural resources the U.S. needs. Water, paper, rare earth, commodities of all kinds all priced in U.S. dollars, gold, silver, you name it, they got it” O’Leary told the network.\n\n“There shouldn't be any tariffs between those two countries,” he later added.\n\nIn a follow-up post on X, O’Leary called the situation a “self-inflicted mess” and said that “playing tariff games between neighbors is stupid and completely unnecessary.”\n\n“When a major bourbon producer shuts down for a year, that’s not the market talking, that’s politics getting in the way of common sense,” O’Leary wrote.\n\n“There shouldn’t be tariffs between allies. This hurts businesses on both sides of the border,” he added.\n\nU.S. spirit exports to Canada plummeted 85 percent in the second quarter of 2025, while total U.S. spirit exports dropped nine percent compared to last year, according to an October report by the Distilled Spirits Council of the United States. Chris Swonger, the organization’s CEO, blamed the drop on “persistent trade tensions.”\n\n“There’s a growing concern that our international consumers are increasingly opting for domestically produced spirits or imports from countries other than the U.S., signaling a shift away from our great American spirits brands,” he said in a statement.\n\nThe president continues to claim his tariffs are the best way forward for the American economy. Trump posted on Truth Social Tuesday morning, “The TARIFFS are responsible for the GREAT USA Economic Numbers JUST ANNOUNCED…AND THEY WILL ONLY GET BETTER!”\n\nWhile Jim Beam is temporarily closing one of its distilleries, production will still continue at other locations, the company said in a statement.\n\n“We’ve shared with our teams that while we will continue to distill at our [Freddie Booker Noe] craft distillery in Clermont and at our larger Booker Noe distillery in Boston, we plan to pause distillation at our main distillery on the James B. Beam campus for 2026 while we take the opportunity to invest in site enhancements,” the company’s statement reads.\n\nThe Independent has contacted Jim Beam for comment.","url":"https://uk.news.yahoo.com/shark-tank-kevin-o-leary-234943503.html","image":"https://s.yimg.com/ny/api/res/1.2/1QLjUgfoieDl20WJD1t_JQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/337dc3a960bdf1263651311fc046349e","video":"","publish_date":"2025-12-23 23:49:43","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.297},{"id":388574778,"title":"Shark Tank’s Kevin O’Leary blames Trump’s Canada trade tensions for Jim Beam’s shuttering of distillery: ‘Self-inflicted mess’","text":"Canadian businessman and Shark Tank judge Kevin O’Leary is blaming the trade tensions between the U.S. and Canada for the temporary closure of a Jim Beam distillery.\n\nJim Beam, one of the largest makers of American whiskey globally, announced it will halt production at its Clermont, Kentucky, distillery for one year, starting on January 1, 2026. The bourbon whiskey brand plans to “invest in site enhancements” during the closure, according to a statement. \n\nThe announcement comes as U.S. spirit exports to Canada are declining, with many Canadians boycotting American liquor in response to President Donald Trump’s tariffs and his suggestion that the nation should be the 51st state. \n\nWhen NewsNation asked O’Leary about the Kentucky distillery’s temporary closure, he labeled the issue a “specific problem” and called on Canadian and U.S. officials to find common ground.\n\n“Canada needs to get in a much more cooperative mode, and the U.S. has to get much more cooperative mode with Canada, because Canada has all the natural resources the U.S. needs. Water, paper, rare earth, commodities of all kinds all priced in U.S. dollars, gold, silver, you name it, they got it” O’Leary told the network.\n\n“There shouldn't be any tariffs between those two countries,” he later added.\n\nIn a follow-up post on X, O’Leary called the situation a “self-inflicted mess” and said that “playing tariff games between neighbors is stupid and completely unnecessary.”\n\n“When a major bourbon producer shuts down for a year, that’s not the market talking, that’s politics getting in the way of common sense,” O’Leary wrote.\n\n“There shouldn’t be tariffs between allies. This hurts businesses on both sides of the border,” he added.\n\nU.S. spirit exports to Canada plummeted 85 percent in the second quarter of 2025, while total U.S. spirit exports dropped nine percent compared to last year, according to an October report by the Distilled Spirits Council of the United States. Chris Swonger, the organization’s CEO, blamed the drop on “persistent trade tensions.”\n\n“There’s a growing concern that our international consumers are increasingly opting for domestically produced spirits or imports from countries other than the U.S., signaling a shift away from our great American spirits brands,” he said in a statement.\n\nThe president continues to claim his tariffs are the best way forward for the American economy. Trump posted on Truth Social Tuesday morning, “The TARIFFS are responsible for the GREAT USA Economic Numbers JUST ANNOUNCED…AND THEY WILL ONLY GET BETTER!” \n\nWhile Jim Beam is temporarily closing one of its distilleries, production will still continue at other locations, the company said in a statement. \n\n“We’ve shared with our teams that while we will continue to distill at our [Freddie Booker Noe] craft distillery in Clermont and at our larger Booker Noe distillery in Boston, we plan to pause distillation at our main distillery on the James B. Beam campus for 2026 while we take the opportunity to invest in site enhancements,” the company’s statement reads.\n\nThe Independent has contacted Jim Beam for comment.","summary":"U.S. spirit exports to Canada fell 85 percent in the second quarter of 2025","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-tariffs-canada-jim-beam-b2889818.html","image":"https://static.independent.co.uk/2025/12/23/20/26/GettyImages-1935912469.jpg?crop=6000,4000,x0,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/eEEYPooD-4VHSaSK0.mp4","publish_date":"2025-12-23 23:49:43","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.297},{"id":388571714,"title":"Trump's new envoy to Greenland says US is not looking to 'conquer' the Danish territory","text":"WEST PALM BEACH, Fla. (AP) — President Donald Trump’s newly appointed envoy to Greenland said Tuesday that the Republican administration is looking to begin a conversation with residents of the semi-autonomous Danish territory about the best way forward for the strategically important island.\n\nIn his first extended comments since being appointed to the role this week, Louisiana Gov. Jeff Landry said the Trump administration isn’t going to “go in there trying to conquer anybody” or try to “to take over anybody’s country.” \n\nThe governor’s comments seemed somewhat at odds with Trump, who has repeatedly said the U.S. needs to take over the Arctic territory for the sake of U.S. security and has not ruled out military force to take control of the mineral-rich, strategically located Arctic island.\n\n“Well, I think our discussions should be with the actual people in Greenland — the Greenlanders,” Landry said in an appearance on Fox News’ “The Will Cain Show.” “What are they looking for? What opportunities have they not gotten? Why haven’t they gotten the protection that they actually deserve?”\n\nTrump’s announcement of Landry’s appointment has once again stirred anxiety in Denmark and Europe.\n\nDenmark’s foreign minister told Danish broadcasters that he would summon the U.S. ambassador to his ministry.\n\n”We have said it before. Now, we say it again. National borders and the sovereignty of states are rooted in international law,” Danish Prime Minister Mette Frederiksen and her Greenlandic counterpart, Jens-Frederik Nielsen, said in a joint statement Monday. “They are fundamental principles. You cannot annex another country. Not even with an argument about international security.”\n\nTrump called repeatedly for U.S. jurisdiction over Greenland during his presidential transition and in the early months of his second term. In March, Vice President JD Vance visited a remote U.S. military base in Greenland and accused Denmark of under-investing there.\n\nThe issue gradually drifted out of the headlines, but in August, Danish officials summoned the top U.S. diplomat in Copenhagen following a report that at least three people with connections to Trump had carried out covert influence operations in Greenland.\n\nThe Trump administration did not offer any warning ahead of the announcement of Landry’s appointment, according to a Danish government official, who spoke on condition of anonymity to discuss internal deliberations. \n\nThe administration also has yet to provide any details about the appointment to Congress, according to a congressional aide who was not authorized to comment publicly and spoke on the condition of anonymity.\n\nTrump is renewing the Greenland debate at a moment when he has no shortage of foreign policy crises to dealing with, including maintaining a fragile truce in Gaza and negotiating an end to Russian President Vladimir Putin’s brutal war in Ukraine. \n\nSen. Jeanne Shaheen, the top Democrat on the Senate Foreign Relations Committee, on Tuesday questioned the wisdom of “picking fights with friends” at such a difficult moment around the globe.\n\n“Greenland’s sovereignty is not up for debate,” Shaheen said. “Denmark is a critical NATO ally that has stood side by side with the U.S.”","url":"https://apnews.com/article/trump-greenland-landry-denmark-1c55b2c33241aad0d463a2ffec5810a6","image":"https://dims.apnews.com/dims4/default/c18ad28/2147483647/strip/false/crop/5104x3403+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F4f%2F73db76d944b85beab4053bbfd545%2Fc2b2c77d13c14afe877ddb124e2bac89","video":null,"publish_date":"2025-12-23 23:47:57","author":"Aamer Madhani","authors":["Aamer Madhani"],"language":"en","category":"politics","source_country":"us","sentiment":-0.247},{"id":388573244,"title":"Oil up as market weighs strong US economic growth, supply risks","text":"NEW YORK: Oil prices settled higher on Tuesday as investors assessed stronger-than-expected US economic growth and the risk of disruptions to oil supply from Venezuela and Russia.\n\nBrent crude futures settled 31 cents, or 0.5%, higher at US$62.38 a barrel. US West Texas Intermediate crude was up 37 cents, or 0.64%, at US$58.38.\n\nPrices had risen by more than 2% on ‌Monday, with Brent registering its biggest daily gain in two months and WTI climbing the ⁠most since November 14.\n\nThe US economy grew faster than expected, driven by robust consumer spending, the Commerce Department's Bureau of Economic Analysis said in its initial estimate of third-quarter GDP on Tuesday.\n\n\"The ​market is trying to decide whether we should be more excited about the demand coming from the strong growth or worried that the Fed is going to have to put on the brakes on that growth to get inflation under control,\" said Phil Flynn, senior analyst with the Price Futures Group.\n\nOther data painted a mixed picture of the economy. US consumer confidence deteriorated in December amid deepening anxiety over jobs and income while factory production was unchanged in November after declining in October, data showed on Tuesday.\n\nInvestors were also considering the risk of disruptions to Venezuelan supply.\n\nUS President Donald Trump earlier this ‍month announced a blockade of all oil ⁠tankers under sanctions ‍entering and ​leaving Venezuela, which has kept vessel owners on alert.\n\nPanama-flagged very large crude carrier Kelly, which had departed from Venezuela carrying ⁠oil last week, has returned to Venezuelan waters following the US interception of more tankers, monitoring service TankerTrackers.com said on Tuesday.\n\n\"With dwindling storage capacity in Venezuela, there are rising risks that the country might have to shut in some production,\" said UBS analyst Giovanni Staunovo.\n\nTanker loading in Venezuela has slowed, with most ‍ships moving oil cargoes only between domestic ports ‍following US action against more ships.\n\nTrump said on Monday that the US might keep or sell the oil it had seized off the coast of ‌Venezuela.\n\nDisruption to Russian oil supply also supported prices.\n\nRussian forces struck Ukraine's Black Sea port of Odesa late on Monday and damaged port facilities and a ⁠ship, the second attack on the region in less than 24 hours, while Ukrainian drone attacks damaged two vessels, two piers and sparked a fire in a village in Russia's Krasnodar region.\n\nUkraine has also targeted Russia's maritime logistics, focusing on shadow-fleet oil tankers that attempt to bypass sanctions on Russia.\n\nOil markets are expected ⁠to remain well supplied in the first half of 2026, Barclays said in a note this week, but the bank added the oil surplus would shrink to only 700,000 barrels per day in the fourth quarter of 2026 and prolonged disruption could tighten the market further.\n\nUS crude inventories rose by 2.39 million barrels last week, while gasoline stocks increased by 1.09 million barrels and distillate inventories rose by 685,000 barrels, market sources said, ‍citing American Petroleum Institute figures on Tuesday.\n\nThe US Energy Information Administration is due to release its data on Monday, later than usual due to ⁠the holidays. — Reuters","url":"https://www.thestar.com.my/business/2025/12/24/oil-up-as-market-weighs-strong-us-economic-growth-supply-risks","image":"https://apicms.thestar.com.my/uploads/images/2025/12/24/3688410.jpeg","video":null,"publish_date":"2025-12-23 23:47:00","author":"The Star Online","authors":["The Star Online"],"language":"en","category":"business","source_country":"my","sentiment":-0.393},{"id":388572252,"title":"US economic growth hits two-year high","text":"NEW YORK: US economic growth in the third quarter came in at 4.3 per cent on an annualised basis, easily topping expectations, according to Commerce Department data released on Tuesday.\n\nThe report, which also showed an acceleration in inflation, provides reassurance about the world’s largest economy after other recent data showing a weakening labor market. It comes as worries have moderated over President Donald Trump’s tariffs and as large tech companies advance massive investments to build new artificial intelligence infrastructure.\n\nThe gross domestic product report -- delayed for nearly two months due to a government shutdown -- reflects increases in consumer spending, exports and government spending, partially offset by a decrease in investment, according to the department’s Bureau of Economic Analysis.\n\nThe reading, an initial estimate expected to be updated in early 2026, marks the highest GDP in two years. Analysts had expected 3.2pc growth, according to consensus estimates from MarketWatch and Trading Economics.\n\nThe report also showed the price index for domestic purchases rose 3.4pc, a much higher inflation reading compared with 2.0 percent in the second quarter.\n\nThe data suggest faster growth and higher inflation than markets had expected — potentially changing the calculus for upcoming US monetary policy decisions.\n\nTrump pointed to the report as evidence that the “Trump Economic Golden Age is FULL steam ahead,” the product of a “genius” policy on tariffs and “NO INFLATION,” disregarding line-item aspects of the data showing otherwise.\n\nOther recent data has shown a weakening job market that has prompted the Federal Reserve to cut interest rates at the last three meetings, viewing the employment picture as its prime concern even as inflation has lingered above 2pc.\n\nPublished in Dawn, December 24th, 2025","summary":"NEW YORK: US economic growth in the third quarter came in at 4.3 per cent on an annualised basis, easily topping expectations, according to Commerce Department data released on Tuesday.\n\n\n\nThe report, which also showed an acceleration in inflation, provides reassurance about the world’s largest economy after other recent data showing a weakening labor market. It comes as worries have moderated over President Donald Trump’s tariffs and as large tech companies advance massive investments to build new artificial intelligence infrastructure.\n\n\n\nThe gross domestic product report -- delayed for nearly two months due to a government shutdown -- reflects increases in consumer spending, exports and government spending, partially offset by a decrease in investment, according to the department’s Bureau of Economic Analysis.\n\n\n\nThe reading, an initial estimate expected to be updated in early 2026, marks the highest GDP in two years. Analysts had expected 3.2pc growth, according to consensus estimates from MarketWatch and","url":"https://www.dawn.com/news/1962907/us-economic-growth-hits-two-year-high","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-12-23 23:46:44","author":"AFP","authors":["AFP"],"language":"en","category":"business","source_country":"pk","sentiment":0.017},{"id":388569372,"title":"China, Russia clash with US at UN meeting over Venezuela oil seizures and naval pressure","text":"China accused the United States at the United Nations on Tuesday of violating international law and destabilising the Caribbean region, as Washington defended its seizure of Venezuelan oil tankers and vowed to intensify pressure on President Nicolas Maduro’s government.\nSpeaking at an emergency meeting of the UN Security Council requested by Venezuela and backed by China and Russia, Beijing said US actions carried out under the banner of counter-narcotics enforcement amounted to unilateral coercion and a direct challenge to the principles of sovereignty and freedom of navigation.\n“The US actions and the rhetoric have led to continued tensions in the region, raising serious concerns among regional countries and the international community,” said Sun Lei, deputy permanent representative of China to the UN.\n“The US actions seriously infringe upon other countries’ sovereignty, security and the legitimate rising interests.”\n\nThe meeting came as the Trump administration escalated a maritime campaign in the Caribbean that has included the interception of Venezuelan oil tankers and a major US military deployment near Venezuela’s coast.\nEarlier this month, US President Donald Trump announced what he described as a “total and complete blockade” of sanctioned Venezuelan oil shipments, framing the move as part of an effort to combat drug trafficking and transnational crime.\nUS forces have since seized two tankers and pursued a third. On Monday, Trump said the United States would keep both the vessels and the oil taken from them, suggesting the cargo could be added to US reserves.\nChina rejected Washington’s justification, arguing that the actions had no basis in international law and posed risks far beyond Venezuela.\nBeijing has become Venezuela’s largest oil buyer in recent years, with crude often shipped through intermediaries, and Chinese officials warned that the seizures set a precedent that threatened global trade and maritime security.\nThe Chinese intervention also reflected broader concern over US policy in the Western Hemisphere. Sun pushed back against what Beijing sees as attempts to label normal economic engagement as a security threat, following language in the Trump administration’s National Security Strategy warning against “adversarial foreign influence” in the region.\n“As an independent sovereign state, Venezuela has the right to independently develop mutually beneficial cooperation with other countries and defend its legitimate rising interests,” Sun said.\n“China opposes all acts of unilateralism and bullying and supports all countries in defending their sovereignty and national dignity.”\nRussia echoed that position. Ambassador Vassily Nebenzia accused the United States of “cowboy-like conduct” and said the blockade and tanker seizures violated core norms of international law.\n“President Trump promised an end to conflict,” Nebenzia said. “Unfortunately, the situation is not improving, and the United States continues to sow chaos in the Western Hemisphere.”\nChina and Russia both urged Washington to de-escalate, citing the UN Charter’s principles of sovereign equality, non-interference and peaceful settlement of disputes. Sun called on the United States to halt actions that could further inflame tensions and to respect freedom of navigation under international law.\nThe dispute had already triggered a domestic response in Venezuela before the Security Council met.\nOn Tuesday, hours before the session in New York, Venezuela’s National Assembly debated and approved, at first reading, draft legislation that would impose prison sentences of up to 20 years on anyone who promotes or supports naval blockades or acts the government describes as piracy.\n\nThe bill also includes fines of up to one million euros and measures that provide legal and economic protections for shipping operators.\nVenezuela’s ambassador to the United Nations, Samuel Moncada, used the council meeting to present his government’s case, accusing the United States of carrying out acts of aggression on the high seas.\nHe said US forces had unlawfully seized oil tankers engaged in legitimate international trade, detained civilian crews and threatened Venezuela’s territorial integrity.\nMoncada described the tanker interceptions as “armed robberies carried out by military force in international waters” and said they amounted to an illegal naval blockade aimed at strangling Venezuela’s economy and forcing political change in Caracas.\nHe also alleged that more than 100 civilians had been killed in recent months during US operations against vessels Washington claimed were linked to drug trafficking, saying no evidence had been made public.\nThe United States rejected those accusations, with US Ambassador Mike Waltz saying Washington did not recognise Maduro as Venezuela’s legitimate leader and accusing his government of using oil revenues to finance criminal and terrorist organisations.\n“The United States does not recognise Nicolas Maduro or his cronies as the legitimate government of Venezuela,” Waltz said.\n“President Trump has been very clear that he is going to use the full power of the United States of America, the full might of the United States, to take on and eradicate these drug cartels which have operated with impunity in our hemisphere for far too long.”\nWaltz defended the tanker seizures as lawful enforcement of sanctions in international waters and framed the US campaign as both a security and humanitarian effort.\n“The people of Venezuela, frankly, deserve better,” he told the council.","summary":"China accused the United States at the United Nations on Tuesday of violating international law and destabilising the Caribbean region, as Washington defended its seizure of Venezuelan oil tankers and vowed to intensify pressure on President Nicolas Maduro’s government.\nSpeaking at an emergency meeting of the UN Security Council requested by Venezuela and backed by China and Russia, Beijing said US actions carried out under the banner of counter-narcotics enforcement amounted to unilateral...","url":"https://www.scmp.com/news/china/diplomacy/article/3337554/china-russia-clash-us-un-meeting-over-venezuela-oil-seizures-and-naval-pressure","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/24/299dd90a-d21b-4dba-90fa-b18faf348d3a_988e7629.jpg","video":null,"publish_date":"2025-12-23 23:46:08","author":"Igor Patrick,Mark Magnier","authors":["Igor Patrick","Mark Magnier"],"language":"en","category":"politics","source_country":"cn","sentiment":0.108},{"id":388566978,"title":"China, Russia clash with US at UN meeting over Venezuela oil seizures and naval pressure","text":"China accused the United States at the United Nations on Tuesday of violating international law and destabilising the Caribbean region, as Washington defended its seizure of Venezuelan oil tankers and vowed to intensify pressure on President Nicolas Maduro’s government.\nSpeaking at an emergency meeting of the UN Security Council requested by Venezuela and backed by China and Russia, Beijing said US actions carried out under the banner of counter-narcotics enforcement amounted to unilateral coercion and a direct challenge to the principles of sovereignty and freedom of navigation.\n“The US actions and the rhetoric have led to continued tensions in the region, raising serious concerns among regional countries and the international community,” said Sun Lei, deputy permanent representative of China to the UN.\n“The US actions seriously infringe upon other countries’ sovereignty, security and the legitimate rising interests.”\n\nThe meeting came as the Trump administration escalated a maritime campaign in the Caribbean that has included the interception of Venezuelan oil tankers and a major US military deployment near Venezuela’s coast.\nEarlier this month, US President Donald Trump announced what he described as a “total and complete blockade” of sanctioned Venezuelan oil shipments, framing the move as part of an effort to combat drug trafficking and transnational crime.\nUS forces have since seized two tankers and pursued a third. On Monday, Trump said the United States would keep both the vessels and the oil taken from them, suggesting the cargo could be added to US reserves.\nChina rejected Washington’s justification, arguing that the actions had no basis in international law and posed risks far beyond Venezuela.\nBeijing has become Venezuela’s largest oil buyer in recent years, with crude often shipped through intermediaries, and Chinese officials warned that the seizures set a precedent that threatened global trade and maritime security.\nThe Chinese intervention also reflected broader concern over US policy in the Western Hemisphere. Sun pushed back against what Beijing sees as attempts to label normal economic engagement as a security threat, following language in the Trump administration’s National Security Strategy warning against “adversarial foreign influence” in the region.\n“As an independent sovereign state, Venezuela has the right to independently develop mutually beneficial cooperation with other countries and defend its legitimate rising interests,” Sun said.\n“China opposes all acts of unilateralism and bullying and supports all countries in defending their sovereignty and national dignity.”\nRussia echoed that position. Ambassador Vassily Nebenzia accused the United States of “cowboy-like conduct” and said the blockade and tanker seizures violated core norms of international law.\n“President Trump promised an end to conflict,” Nebenzia said. “Unfortunately, the situation is not improving, and the United States continues to sow chaos in the Western Hemisphere.”\nChina and Russia both urged Washington to de-escalate, citing the UN Charter’s principles of sovereign equality, non-interference and peaceful settlement of disputes. Sun called on the United States to halt actions that could further inflame tensions and to respect freedom of navigation under international law.\nThe dispute had already triggered a domestic response in Venezuela before the Security Council met.\nOn Tuesday, hours before the session in New York, Venezuela’s National Assembly debated and approved, at first reading, draft legislation that would impose prison sentences of up to 20 years on anyone who promotes or supports naval blockades or acts the government describes as piracy.\n\nThe bill also includes fines of up to one million euros and measures that provide legal and economic protections for shipping operators.\nVenezuela’s ambassador to the United Nations, Samuel Moncada, used the council meeting to present his government’s case, accusing the United States of carrying out acts of aggression on the high seas.\nHe said US forces had unlawfully seized oil tankers engaged in legitimate international trade, detained civilian crews and threatened Venezuela’s territorial integrity.\nMoncada described the tanker interceptions as “armed robberies carried out by military force in international waters” and said they amounted to an illegal naval blockade aimed at strangling Venezuela’s economy and forcing political change in Caracas.\nHe also alleged that more than 100 civilians had been killed in recent months during US operations against vessels Washington claimed were linked to drug trafficking, saying no evidence had been made public.\nThe United States rejected those accusations, with US Ambassador Mike Waltz saying Washington did not recognise Maduro as Venezuela’s legitimate leader and accusing his government of using oil revenues to finance criminal and terrorist organisations.\n“The United States does not recognise Nicolas Maduro or his cronies as the legitimate government of Venezuela,” Waltz said.\n“President Trump has been very clear that he is going to use the full power of the United States of America, the full might of the United States, to take on and eradicate these drug cartels which have operated with impunity in our hemisphere for far too long.”\nWaltz defended the tanker seizures as lawful enforcement of sanctions in international waters and framed the US campaign as both a security and humanitarian effort.\n“The people of Venezuela, frankly, deserve better,” he told the council.","url":"https://www.scmp.com/news/china/diplomacy/article/3337554/china-russia-clash-us-un-meeting-over-venezuela-oil-seizures-and-naval-pressure?module=latest&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/24/299dd90a-d21b-4dba-90fa-b18faf348d3a_988e7629.jpg","video":null,"publish_date":"2025-12-23 23:46:08","author":"Mark Magnier","authors":["Mark Magnier"],"language":"en","category":"politics","source_country":"hk","sentiment":0.108},{"id":388566974,"title":"China, Russia clash with US at UN meeting over Venezuela oil seizures and naval pressure","text":"China accused the United States at the United Nations on Tuesday of violating international law and destabilising the Caribbean region, as Washington defended its seizure of Venezuelan oil tankers and vowed to intensify pressure on President Nicolas Maduro’s government.\nSpeaking at an emergency meeting of the UN Security Council requested by Venezuela and backed by China and Russia, Beijing said US actions carried out under the banner of counter-narcotics enforcement amounted to unilateral coercion and a direct challenge to the principles of sovereignty and freedom of navigation.\n“The US actions and the rhetoric have led to continued tensions in the region, raising serious concerns among regional countries and the international community,” said Sun Lei, deputy permanent representative of China to the UN.\n“The US actions seriously infringe upon other countries’ sovereignty, security and the legitimate rising interests.”\n\nThe meeting came as the Trump administration escalated a maritime campaign in the Caribbean that has included the interception of Venezuelan oil tankers and a major US military deployment near Venezuela’s coast.\nEarlier this month, US President Donald Trump announced what he described as a “total and complete blockade” of sanctioned Venezuelan oil shipments, framing the move as part of an effort to combat drug trafficking and transnational crime.\nUS forces have since seized two tankers and pursued a third. On Monday, Trump said the United States would keep both the vessels and the oil taken from them, suggesting the cargo could be added to US reserves.\nChina rejected Washington’s justification, arguing that the actions had no basis in international law and posed risks far beyond Venezuela.\nBeijing has become Venezuela’s largest oil buyer in recent years, with crude often shipped through intermediaries, and Chinese officials warned that the seizures set a precedent that threatened global trade and maritime security.\nThe Chinese intervention also reflected broader concern over US policy in the Western Hemisphere. Sun pushed back against what Beijing sees as attempts to label normal economic engagement as a security threat, following language in the Trump administration’s National Security Strategy warning against “adversarial foreign influence” in the region.\n“As an independent sovereign state, Venezuela has the right to independently develop mutually beneficial cooperation with other countries and defend its legitimate rising interests,” Sun said.\n“China opposes all acts of unilateralism and bullying and supports all countries in defending their sovereignty and national dignity.”\nRussia echoed that position. Ambassador Vassily Nebenzia accused the United States of “cowboy-like conduct” and said the blockade and tanker seizures violated core norms of international law.\n“President Trump promised an end to conflict,” Nebenzia said. “Unfortunately, the situation is not improving, and the United States continues to sow chaos in the Western Hemisphere.”\nChina and Russia both urged Washington to de-escalate, citing the UN Charter’s principles of sovereign equality, non-interference and peaceful settlement of disputes. Sun called on the United States to halt actions that could further inflame tensions and to respect freedom of navigation under international law.\nThe dispute had already triggered a domestic response in Venezuela before the Security Council met.\nOn Tuesday, hours before the session in New York, Venezuela’s National Assembly debated and approved, at first reading, draft legislation that would impose prison sentences of up to 20 years on anyone who promotes or supports naval blockades or acts the government describes as piracy.\n\nThe bill also includes fines of up to one million euros and measures that provide legal and economic protections for shipping operators.\nVenezuela’s ambassador to the United Nations, Samuel Moncada, used the council meeting to present his government’s case, accusing the United States of carrying out acts of aggression on the high seas.\nHe said US forces had unlawfully seized oil tankers engaged in legitimate international trade, detained civilian crews and threatened Venezuela’s territorial integrity.\nMoncada described the tanker interceptions as “armed robberies carried out by military force in international waters” and said they amounted to an illegal naval blockade aimed at strangling Venezuela’s economy and forcing political change in Caracas.\nHe also alleged that more than 100 civilians had been killed in recent months during US operations against vessels Washington claimed were linked to drug trafficking, saying no evidence had been made public.\nThe United States rejected those accusations, with US Ambassador Mike Waltz saying Washington did not recognise Maduro as Venezuela’s legitimate leader and accusing his government of using oil revenues to finance criminal and terrorist organisations.\n“The United States does not recognise Nicolas Maduro or his cronies as the legitimate government of Venezuela,” Waltz said.\n“President Trump has been very clear that he is going to use the full power of the United States of America, the full might of the United States, to take on and eradicate these drug cartels which have operated with impunity in our hemisphere for far too long.”\nWaltz defended the tanker seizures as lawful enforcement of sanctions in international waters and framed the US campaign as both a security and humanitarian effort.\n“The people of Venezuela, frankly, deserve better,” he told the council.","url":"https://www.scmp.com/news/china/diplomacy/article/3337554/china-russia-clash-us-un-meeting-over-venezuela-oil-seizures-and-naval-pressure?module=top_story&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/24/299dd90a-d21b-4dba-90fa-b18faf348d3a_988e7629.jpg","video":null,"publish_date":"2025-12-23 23:46:08","author":"Mark Magnier","authors":["Mark Magnier"],"language":"en","category":"politics","source_country":"hk","sentiment":0.108},{"id":388567222,"title":"MAGA factions 'fighting for control' as Trump 'smells like a lame duck': former RNC spox","text":"Former Vice President Mike Pence's think tank, Advancing American Freedom (AAF) has lately been poaching officials from the conservative Heritage Foundation. However, Tim Miller — a former spokesman for the Republican National Committee — is predicting the fight will not be between Pence and extremist MAGA, but between two MAGA extremes. \n\nAAF is providing a landing pad for former Heritage members in the wake of a mass departure over the role of right-wing influencers promoting antisemitic or racist views and other extremist ideas. Heritage Foundation president Kevin Roberts kicked off the flight of staffers after releasing a video defending far-right pundit Tucker Carlson’s friendly October interview with Nick Fuentes, an avowed white nationalist who has previously praised Adolf Hitler. Roberts' video sparked controversy inside Heritage, prompting him to later apologize for it.\n\nDuring a Tuesday MS NOW segment, Miller said the fight will not likely be between Pence’s nonprofit and Fuentes' camp, but between separate groups of MAGA extremists.\n\n“The unifying element that brought everybody in MAGA together was that they wanted Donald Trump to be president. And Donald Trump is, in a lot of ways, sometimes incoherent on policy ... And so, it allowed everybody to sort of fit under one roof. And if they had a disagreement, whatever daddy Trump said they went along with.”\n\n“Now as Trump starts to smell like a lame duck, everybody wants to shape the future of the movement and the way that they see fit. There are obviously a lot of ... traditional conservatives that held their nose and stuck around for Donald Trump. And they want the party to kind of go back to how it used to be, but there are people kind of new to the Republican movement that hate the old Republican Party and want it to be even more populist, more nationalist, and look more like a European far-right nationalist party,” Miller said. “… And so, all of it's like a Game of Thrones situation now, with all of them are fighting for control.”\n\nMiller said “it's interesting” that Pence and his more traditional conservative group is trying to gather support and infrastructure, but he said he’s “skeptical that would work.”\n\n“I think the real fight is what we saw at AmericaFest, which was between a MAGA establishment, like a hybrid of the old Republican Party and the new [party], with some even further right figures that want basically full nationalism, closed borders, no more support of Israel, embracing conspiracy theories. And the fight to me seems to be on that turf.”\n\nWatch the segment below:\n\n - YouTube youtu.be","summary":"Former Vice President Mike Pence's think tank, Advancing American Freedom (AAF) has lately been poaching officials from the conservative Heritage Foundation. However, Tim Miller — a former spokesman for the Republican National Committee — is predicting the fight will not be between Pence and extremist MAGA, but between two MAGA extremes. \n\nAAF is providing a landing pad for former Heritage members in the wake of a mass departure over the role of right-wing influencers promoting antisemitic or racist views and other extremist ideas. Heritage Foundation president Kevin Roberts kicked off the flight of staffers after releasing a video defending far-right pundit Tucker Carlson’s friendly October interview with Nick Fuentes, an avowed white nationalist who has previously praised Adolf Hitler. Roberts' video sparked controversy inside Heritage, prompting him to later apologize for it.\n\nDuring a Tuesday MS NOW segment, Miller said the fight will not likely be between Pence’s nonprofit and Fuentes' camp,  but between","url":"https://www.alternet.org/maga-infighting-trump/","image":"https://www.alternet.org/media-library/image.jpg?id=55411359&width=1200&height=600&coordinates=0%2C333%2C0%2C334","video":null,"publish_date":"2025-12-23 23:42:34","author":"Adam Lynch","authors":["Adam Lynch"],"language":"en","source_country":"us","sentiment":0.115},{"id":388574772,"title":"None of BRICS members wants to leave association — Brazilian ambassador to Russia","text":"MOSCOW, December 24. /TASS/. None of BRICS member states intend to leave the association, Brazil’s ambassador to Russia, Sergio Rodrigues dos Santos, said in an interview with TASS, adding that there is a long list of countries wishing to join it.\n\n\"I think that first of all, when we talk about BRICS, it is important to emphasize that this association is not against any country or group of countries. It is a platform based on political and economic cooperation between participants, aimed both at their own benefit and at the benefit of the countries of the global South and the international community as a whole,\" he said.\n\nBRICS is a constructive force in strengthening a multipolar world order that is becoming increasingly inclusive and democratic, the diplomat noted. \"As for statements about a possible withdrawal of countries from BRICS, as far as I know, not a single country has expressed such an intention. On the contrary, there is a long list of countries wishing to join BRICS,\" he said.\n\nEarlier, US President Donald Trump said that his threats to impose tariffs on BRICS countries had had an effect, adding that the countries intend to leave the group due to US tariffs.","summary":"Sergio Rodrigues dos Santos noted that BRICS is a constructive force in strengthening a multipolar world order that is becoming increasingly inclusive and democratic","url":"https://tass.com/world/2063849","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-12-23 23:42:34","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":0.152},{"id":388568972,"title":"State Department imposes sanctions on former EU official, disinformation group leaders for ‘censorship’","text":"The US State Department on Tuesday imposed visa sanctions on a former top European Union official and employees of organizations that combat disinformation for alleged censorship – sharply ratcheting up the Trump administration’s fight against European regulations that have impacted digital platforms, far-right politicians and Trump allies, including Elon Musk. In a statement, US Secretary of State Marco Rubio accused the five sanctioned people of leading “organized efforts to coerce American platforms to censor, demonetize, and suppress American viewpoints they oppose.” Top Trump administration officials have repeatedly condemned European nations for alleged censorship, and the latest State Department human rights report alleged “significant human rights issues” in allies like the United Kingdom, France, and Germany over “serious restrictions on freedom of expression.” Among those sanctioned Tuesday are Thierry Breton, a former European commissioner involved in the Digital Services Act (DSA), a sweeping EU law that requires Big Tech platforms to take meaningful steps to reduce illegal and harmful content. In a social media post on Tuesday, Breton questioned: “Is McCarthy’s witch hunt back?”, referencing the late senator’s Cold-War era inquisition of alleged communists who he claimed had infiltrated American government institutions. “To our American friends: ‘Censorship isn’t where you think it is,’” he said on X. The State Department also targeted the CEO of the Center for Countering Digital Hate, Imran Ahmed. The organization says it “works to stop the spread of online hate and disinformation through innovative research, public campaigns and policy advocacy.” Clare Melford, the CEO of the Global Disinformation Index, was also sanctioned. The organization describes itself as working to strengthen “the systems that make the internet safer by working with governments, industry, and civil society.” In a statement to CNN a spokesperson for GDI said that the sanctions amounted to an “authoritarian attack on free speech and an egregious act of government censorship.” “The Trump Administration is, once again, using the full weight of the federal government to intimidate, censor, and silence voices they disagree with,” the spokesperson said. “Their actions today are immoral, unlawful, and un-American.” Two employees of the German organization HateAid were also sanctioned. CNN reached out to the Center for Countering Digital Hate and HateAid but did not immediately receive a reply. Rubio’s statement said that for the five sanctioned people, he had “determined that their entry, presence, or activities in the United States have potentially serious adverse foreign policy consequences for the United States.” “These radical activists and weaponized NGOs have advanced censorship crackdowns by foreign states—in each case targeting American speakers and American companies,” he said. The top US diplomat said that “based on these determinations,” the State Department “has taken steps to impose visa restrictions on agents of the global censorship-industrial complex who, as a result, will be generally barred from entering the United States.” Further, the Department of Homeland Security “can initiate removal proceedings against certain individuals … which renders such individuals deportable,” he said. Breton has repeatedly clashed with Musk over the Digital Services Act. In August 2024, Breton told Musk in a letter – ahead of an interview with Donald Trump – that he must comply with the regulation, according to Reuters. US Undersecretary of State for Public Diplomacy Sarah Rogers specifically referenced that letter in a post on X Tuesday, accusing Breton of having “ominously reminded Musk of X’s legal obligations and ongoing ‘formal proceedings’ for alleged noncompliance with ‘illegal content’ and ‘disinformation’ requirements under the DSA.” Rogers said Ahmed was a “key collaborator with the Biden Administration’s effort to weaponize the government against U.S. citizens.” She indicated he had been sanctioned, in part, for the organization’s 2022 “Disinformation Dozen” report, which took aim at 12 anti-vaxxers, including now-HHS Secretary Robert F. Kennedy, Jr., responsible for the majority of anti‑vaccine content circulating on social media platforms. Rogers, in a social media post, accused Melford’s organization of using US “taxpayer money to exhort censorship and blacklisting of American speech and press.” The sanctions also hit two top officials at the German organization HateAid, which also aims to combat “hate, violence and systematic disinformation” on the internet. “The State Department stands ready and willing to expand today’s list if other foreign actors do not reverse course,” Rubio said. In February Vice President JD Vance used one of his first major speeches after taking office to criticize what he described as censorship efforts in Europe in a speech delivered at the Munich Security Conference. He claimed that leaders had “threatened and bullied social media companies to censor so-called misinformation,” citing the example of the Covid-19 lab leak theory. “It looks more and more like old entrenched interest, hiding behind ugly, Soviet-era words like misinformation and disinformation, who simply don’t like the idea that somebody with an alternative viewpoint might express a different opinion,” he added.","url":"https://edition.cnn.com/2025/12/23/politics/sanctions-censorship-state-rubio","image":"https://media.cnn.com/api/v1/images/stellar/prod/20251223-split-split-split.jpg?c=16x9&q=w_800,c_fill","video":null,"publish_date":"2025-12-23 23:38:20","author":"Jennifer Hansler","authors":["Jennifer Hansler"],"language":"en","category":"politics","source_country":"us","sentiment":0.046},{"id":388564600,"title":"'Untrue & Sensationalist': DOJ Denies Rape Claims Against Trump In Epstein Files","text":"The US Department of Justice (DOJ) has issued a sharp warning regarding “untrue and sensationalist” allegations following the release of nearly 30,000 pages of investigative files related to the late sex offender Jeffrey Epstein. On December 23, the department took the unusual step of preemptively dismissing certain claims within the documents—specifically those targeting President Donald Trump—as “unfounded and false”.\nThe controversy centres on a 2020 FBI intake report made public in this latest tranche. The document records a tip from an unnamed limousine driver who alleged that in 1995, he overheard Trump discussing the “abuse of some girl” while on a phone call with “Jeffrey”. More significantly, the file contains a secondhand account of a woman allegedly claiming that Trump and Epstein had raped her. The DOJ’s official statement on X was unequivocal: “If these claims had a shred of credibility, they certainly would have been weaponized against President Trump already.”\nBeyond the specific rape allegation, the document dump provides a more granular look at the historical ties between the two men. Internal emails from federal prosecutors in 2020 suggest that Trump flew on Epstein’s private aircraft “many more times than previously known”—at least eight times between 1993 and 1996. Some of these flights reportedly included Ghislaine Maxwell and, in one instance, an unnamed 20-year-old. The DOJ also flagged a “fake” letter purportedly written by Epstein to Larry Nassar, which used crude language to link the President to Epstein’s predilections. Forensic analysis of the handwriting and postmark confirmed the letter was a forgery.\nThe release of these files is mandated by the Epstein Files Transparency Act, which Trump signed into law in November 2025. Despite the administration’s stated commitment to transparency, the rollout has been fraught with tension. The White House has characterised the most salacious claims as politically motivated “smears” submitted to the FBI just weeks before the 2020 election. Meanwhile, the DOJ continues to redact the names of over 1,000 victims and witnesses, a process they claim is the cause of the “piecemeal” release schedule. As the investigation’s archives continue to go public, the government maintains that the mere inclusion of a name in these files does not constitute evidence of criminal wrongdoing, though the political fallout remains immense.","summary":"The files contain a secondhand account of a woman allegedly claiming that Trump and Epstein had raped her","url":"https://www.news18.com/world/untrue-sensationalist-doj-denies-rape-claims-against-trump-in-epstein-files-9788757.html","image":"https://images.news18.com/ibnlive/uploads/2025/11/epstein-trump-2025-11-5e63bb169cb21c7c45917c9ff43e8cc8.jpg","video":null,"publish_date":"2025-12-23 23:38:12","author":"News18,Pathikrit Sen Gupta","authors":["News18","Pathikrit Sen Gupta"],"language":"en","category":"politics","source_country":"in","sentiment":-0.307},{"id":388570114,"title":"Freed from ICE facility, activist Jeanette Vizguerra urges detainees: ‘Don’t give up. Keep fighting.’","text":"Twenty-four hours after she was released from immigration detention, Jeanette Vizguerra stood on the steps of a federal courthouse in downtown Denver on Tuesday and pledged to keep fighting the crackdown that still threatens to remove her from the country.\n\nHer attempts to regain her freedom, even temporarily, had galvanized supporters since she was detained in March and became one of Colorado’s highest-profile arrestees in President Donald Trump’s mass-deportation push. A chance at bail came only after a federal judge intervened in her case last week.\n\n“The victory belongs to everyone — everyone who contributed in different ways, who did all kinds of different jobs,” Vizguerra told supporters through a Spanish translator. “And I will keep struggling. The struggle goes on.”\n\nFor months, backers of the longtime immigrant-rights activist have organized regular vigils outside the Aurora detention center where Vizguerra had been held. On Tuesday, those supporters greeted her with long hugs, tears, chants, incense and a brass horn.\n\nThey chanted “Free them all!” and, in Spanish, “Yes we can” as Vizguerra urged them to set aside political differences and unite to oppose immigration arrests and deportations.\n\nWhen Vizguerra left detention, she said she first wanted to hug her children, thank the Virgin Mary and reconnect with her community. She said her release “represents a new stage in my life.”\n\n“Those nine months that I spent in detention were not days that are lost in detention,” said Vizguerra, a native of Mexico who’s lived in the United States for most of the past 28 years. “I documented dozens upon dozens upon dozens of cases of people who were arrested in Colorado by ICE without a warrant. I want to say to the people who are still in detention, to the women who were in my pod with me, to the men that are still in detention: Don’t give up. Keep fighting.”\n\nVizguerra’s temporary release was the result of a prolonged legal fight, waged by several prominent immigration attorneys who took on the case pro bono against U.S. Customs and Immigration Enforcement.\n\nA U.S. District Court judge last week ordered federal officials to provide her with a bail hearing. After that was convened late in the week, an immigration judge on Sunday ordered her released on $5,000 bail.\n\nShe will remain out of custody while her attorneys contest ICE’s attempts to deport her and while a separate legal challenge also plays out in federal court.\n\nVizguerra is in the country without legal status, and ICE and lawyers representing the federal government have argued that she was arrested to comply with a removal order that had been reinstated after Trump returned to office. She has been arrested by immigration authorities before and had agreed to return to Mexico in 2012. She reentered the U.S. the next year, she said Tuesday, to return to her family.\n\nVizguerra told reporters that she has a check-in appointment with ICE in January, which she said she will attend. She was released without any monitoring devices, like an ankle bracelet.\n\nHer attorneys have argued that Vizguerra was targeted by ICE agents. She’d risen to national prominence during Trump’s first term, when she’d sheltered in a church and was included on a TIME Magazine list of 2017’s most influential people.\n\nFederal officials sought a warrant to arrest her within 10 days of Trump’s return to office in January. When Vizguerra was arrested in March, administration officials celebrated her detention on social media, and one agent allegedly told her they had “finally got you.”\n\nICE officials sought to block journalists from attending Vizguera’s bail hearing last week, an abrupt departure from what are typically open court proceedings. The warden of the detention center told reporters and one of Vizguerra’s lawyers that media and other observers were prohibited from watching because of the attention the case had received. (Officials eventually relented and allowed media into the courtroom.)\n\nWhile Vizguerra’s release represents a victory for her family, legal team and supporters, it also illustrates the steep hill that many immigrants who lack proper legal status face in contesting their detentions and deportations.\n\nEven with a team of lawyers, Vizguerra was detained for more than nine months. Most immigration detainees are not represented by lawyers, and as ICE sought to prevent many from requesting bail earlier this year, a growing number accepted deportations as a means to escape detention.\n\n“If there’s something different about my case, it’s just that people don’t have the resources to pay for an attorney, the resources to access bond,” Vizguerra told supporters. “Their cases are not much different than mine. This administration is seeking … to trap and detain and deport every single one of us.”\n\nStay up-to-date with Colorado Politics by signing up for our weekly newsletter, The Spot.","summary":"Jeanette Vizguerra's attempts to regain her freedom had galvanized supporters since she was detained in March, becoming one of Colorado's highest-profile arrestees in Trump's mass-deportation push.","url":"https://www.denverpost.com/2025/12/23/colorado-jeanette-vizguerra-immigration-detention-release-trump/","image":"https://www.denverpost.com/wp-content/uploads/2025/12/TDP-L-Jeannette-Vizguerra-Ramirez-RJS-14380.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-23 23:36:41","author":"Seth Klamann","authors":["Seth Klamann"],"language":"en","source_country":"us","sentiment":-0.066},{"id":388576680,"title":"Trump administration to keep tariffs on Chinese semiconductors unchanged through June 2027","text":"The current tariff rates on China remain unchanged, including the 50% tariff on Chinese semiconductors issued under the Biden administration last year.\n\nThe move comes amid an ongoing investigation under Section 301 of the Trade Act of 1974. Against the backdrop of the finalized trade deal between the two nations, the United States accuses China of maintaining unfair trade practices in the semiconductor industry.\n\nThe USTR determined that China’s dominance in the semiconductor market is “unreasonable and burdens or restricts U.S. commerce,” thereby necessitating action.\n\n“For decades, China has targeted the semiconductor industry for dominance and has employed increasingly aggressive and sweeping non-market policies and practices in pursuing dominance of the sector,” the U.S. trade agency says in the filing. “China’s pursuit of its dominance goals has severely disadvantaged U.S. companies, workers, and the U.S. economy generally through lessened competition and commercial opportunities and through the creation of economic security risks from dependencies and vulnerabilities.”\n\nBy the end of the 18 months, starting Tuesday, the to-be-determined tariff rate will be added onto the existing 50% rate.\n\n“These new Section 301 tariffs would be additional to the existing 50% Section 301 tariff on semiconductors from China imposed pursuant to the Section 301 investigation related to forced technology transfer,” the USTR states.\n\nFCC BANS NEW FOREIGN-MADE DRONES AND COMPONENTS DUE TO SECURITY THREATS\n\n“The U.S. Trade Representative will continue to monitor the efficacy of this action, the progress made toward resolution of this matter, and the need for any additional action,” it adds.\n\nIn late October, President Donald Trump and Chinese President Xi Jinping reached an agreement that ended the trade war between their respective countries. The agreement’s fact sheet specified that China would end its investigations into U.S. semiconductor companies. In return, the U.S. would “extend the expiration of certain Section 301 tariff exclusions” to Nov. 10, 2026.","summary":"The Trump administration will maintain its&#160;tariffs&#160;on semiconductors made in&#160;China&#160;at the current level until June 2027, after which the&#160;semiconductor&#160;tariffs are expected to increase at a rate yet to be determined. In a Federal Register filing submitted on Tuesday, the U.S. Trade Representative announced that it would apply 0% additional tariffs on Chinese semiconductor imports. The administration [&#8230;]","url":"https://www.washingtonexaminer.com/policy/economy/4357227/trump-admin-tariffs-chinese-semiconductors-unchanged-through-june-2027/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/12/AP18137412874241.jpg?w=696","video":null,"publish_date":"2025-12-23 23:35:41","author":"David Zimmermann","authors":["David Zimmermann"],"language":"en","category":"politics","source_country":"US","sentiment":-0.088},{"id":388563950,"title":"Fintiri pardons farmer sentenced to death for killing herder","text":"Adamawa State Governor, Ahmadu Fintiri, has granted a state pardon to Sunday Jackson, a farmer who was sentenced to death by hanging for killing a herder.\n\nThe pardon, announced on Tuesday, sparked spontaneous jubilation across Yola, with residents trooping to the streets to celebrate the development.\n\nIn a statement, the Governor’s Chief Press Secretary, Humwashi Wonosikou, confirmed that Jackson, who was awaiting execution at the Kuje Medium Security Custodial Centre, Abuja, was pardoned alongside two other inmates.\n\n“Jackson, who is in Kuje Medium Security Custodial Centre, has been pardoned alongside Joseph Eugene from the Medium Security Custodial Centre, Yola, and Maxwell Ibrahim, serving at the Medium Security Custodial Centre in Kaduna,” Wonosikou said.\n\nHe explained that the pardons were granted in commemoration of the Christmas and New Year celebrations.\n\nThe governor also approved the remission of the remaining jail terms of five other inmates—Joshua James Audo, Adamu Ibrahim, Mohammed Abubakar, Ibrahim Usman and Saidu Abubakar—serving sentences at the Medium Security Custodial Centres in Numan and Jada.\n\nFintiri said the decision followed recommendations from the Adamawa State Advisory Council on Prerogative of Mercy, citing good conduct and significant behavioural improvement by the inmates.\n\n“In the exercise of my prerogative of mercy as enshrined in the Constitution of the Federal Republic of Nigeria, and in line with the recommendations of the Adamawa State Advisory Council on Prerogative of Mercy, I have granted pardon to three persons and directed the remission of the remainder of the sentences of five others,” the governor said.\n\nJackson was convicted of killing a Fulani herder who was grazing cattle on his farm. Reports indicated that the farmer sustained serious injuries while attempting to chase the herders away and overpowered one of them during a struggle, which resulted in the herder’s death.\n\nEarlier this year, the Supreme Court upheld Jackson’s conviction and sentenced him to death by hanging, a judgment that generated widespread public debate and condemnation.\n\nThe case also attracted international attention. In November 2025, a member of the United States House of Representatives, Riley Moore, called on the Nigerian government to pardon Jackson, describing the killing as an act of self-defence.\n\nMoore argued that Jackson had acted to protect his life during the confrontation and questioned the fairness of imposing the death penalty under such circumstances.\n\nHis case also featured in the US congress during a debate on President Donald Trump’s designation of Nigeria as Country of Particular Concern over alleged Christian genocide in the country.\n\nFollowing the announcement of the pardon on Tuesday, commercial activities in parts of Yola were temporarily disrupted as residents shut shops and businesses to mark what many described as a long-awaited act of justice.","summary":"Adamawa Governor Ahmadu Fintiri grants a state pardon to Sunday Jackson, a farmer sentenced to death for killing a herder, sparking celebrations.\n\nRead More: https://punchng.com/fintiri-pardons-farmer-sentenced-to-death-for-killing-herder/","url":"https://punchng.com/fintiri-pardons-farmer-sentenced-to-death-for-killing-herder/","image":"https://cdn.punchng.com/wp-content/uploads/2024/08/22222848/FINTIRI.jpg","video":null,"publish_date":"2025-12-23 23:33:32","author":"Emmanuel Ande,Punch Newspapers","authors":["Emmanuel Ande","Punch Newspapers"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.134}]}