{"offset":0,"number":50,"available":9119,"news":[{"id":278327288,"title":"Biden to ban new oil drilling over vast areas of US Atlantic, Pacific waters: Bloomberg","text":"President Joe Biden is set to ban new offshore oil and gas development across 625 million acres (250 million hectares) of U.S. coastal territory, Bloomberg News reported Friday.\n\nThe ban, to be announced Monday, rules out the sale of drilling rights in stretches of the Atlantic and Pacific oceans and the eastern Gulf of Mexico, said the report, citing unidentified people familiar with the matter.\n\nBiden is leaving the possibility open for new oil and natural gas leasing in the central and western areas of the Gulf of Mexico, which account for around 14 percent of the nation's production of these fuels, the report said.\n\nThe White House did not immediately respond to a Reuters request for comment outside of business hours.\n\nThe ban would solidify Biden's legacy on addressing climate change and his goal to decarbonize the U.S. economy by 2050.\n\nThe New York Times reported that a section of the law Biden's decision relies on, the Outer Continental Shelf Lands Act, gives a president wide leeway to bar drilling and does not include language that would allow President-elect Donald Trump or other future presidents to revoke the ban.\n\nBiden, Trump and Trump's predecessor, Barack Obama, all used the law to ban sales of offshore drilling rights in some coastal areas.\n\nTrump tried in 2017 to reverse Arctic and Atlantic Ocean withdrawals Obama had made at the end of his presidency, but a federal judge ruled in 2019 that the law does not give presidents the legal authority to overturn prior bans. (Reuters)","summary":"President Joe Biden is set to ban new offshore oil and gas development across 625 million acres (250 million hectares) of U.S. coastal territory, Bloomberg News reported Friday.","url":"https://nation.lk/online/biden-to-ban-new-oil-drilling-over-vast-areas-of-us-atlantic-pacific-waters-bloomberg-290352.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/86e7ce85238046db8476e4e8c34e30c1.jpg","video":null,"publish_date":"2025-01-05 01:00:22","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":-0.078},{"id":278328354,"title":"Blinken wades into political crisis with stop in South Korea","text":"Seoul - U.S. Secretary of State Antony Blinken arrives late Sunday in crisis-riven South Korea where he will seek delicately to encourage continuity with the policies, but not tactics, of the impeached president.Blinken will hold talks with counterpart Cho Tae-yul on Monday, the same day a warrant expires to arrest suspended President Yoon Suk Yeol who unsuccessfully tried to impose martial law on Dec. 3.Seoul is the first stop on what will likely be Blinken's final trip as the top U.S. diplomat as he seeks to highlight President Joe Biden's record rallying democratic allies before the return of the more mercurial Donald Trump.","summary":"The top U.S. diplomat will seek delicately to encourage continuity with the policies, but not tactics, of impeached President Yoon Suk Yeol.","url":"https://www.japantimes.co.jp/news/2025/01/05/asia-pacific/politics/south-korea-crisis-blinken/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/01/05/444082.jpg?v=3.1","video":null,"publish_date":"2025-01-05 01:00:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.91},{"id":278326650,"title":"Mexican President Shifts Stance on Accepting Deported Illegal Immigrants","text":"In a surprising reversal, Mexican President Claudia Sheinbaum has shifted her stance on accepting deported illegal immigrants from other countries— a move that could have had significant implications for President-elect Donald Trump’s incoming border policy. After months of resistance to taking in deportees, Sheinbaum now appears to be softening her position, signaling a potential new strategy for handling immigrants who are sent back to Mexico. Critics argue this change could further strain Mexico’s already overburdened resources and allow the flow of illegal immigration to continue unchecked as the new Trump Administration grapples with an inherited record surge in illegal alien crossings. \n\nDuring a press conference, Sheinbaum reversed her previous stance and suddenly said that Mexico is not ruling out the possibility of taking in illegal immigrants deported by the U.S.— regardless of nationality. However, she did say she would request that the U.S. compensate Mexico for returning them to their home countries.\n\n“There will be time to speak with the United States government if these deportations really happen, but we will receive them here, we are going to receive them properly, and we have a plan,” Sheinbaum said.\n\nIn a stunning turn of events, Sheinbaum backtracked on her previous pledge from last month when she insisted that Mexico would pressure Trump to send deported immigrants from other countries directly back to their homeland. She recently said that her government would vigorously oppose Trump’s tough immigration policies. While Mexico isn’t required to accept non-Mexican immigrants from other countries, it has done so in the past. For instance, Cuba and Venezuela frequently refuse U.S. deportation flights but will often accept deportees if they’re sent from Mexico instead.\n\nIn November, Trump announced that he and Sheinbaum agreed to stop the massive flow of illegal immigrants into the United States by “strengthening collaboration on security issues.” The sudden change of heart came after Trump threatened to impose 25 percent tariffs on Mexico if it did not take action to stop illegal immigrants from entering America through its southern border.","url":"https://townhall.com/tipsheet/saraharnold/2025/01/04/mexican-president-changes-course-about-receiving-deported-illegal-immigrants-from-other-countries-n2649983","image":"https://media.townhall.com/cdn/hodl/2024/235/728dec4f-e936-4ef8-9903-2926c4bbf249.jpg","video":null,"publish_date":"2025-01-05 00:56:12","author":"Sarah Arnold","authors":["Sarah Arnold"],"language":"en","category":"politics","source_country":"us","sentiment":-0.18},{"id":278325576,"title":"Ibrahim Kelesh on the prospects of creating a joint Turkic army - INTERVIEW","text":"What strategic steps is Türkiye taking to strengthen the military capabilities of Turkic states?\r\n\r\n- Today, we see active efforts by Turkic states to bolster their military power. Following Azerbaijan's successes, Kazakhstan has shown a keen interest in developing unmanned aerial vehicle (UAV) systems. In this regard, Türkiye is offering its advanced technologies.\r\n\r\nThe Turkish Aerospace Industries (TUSAŞ) manufactures two types of UAVs: Anka and Aksungur. An agreement with Kazakhstan focuses on the production of the Anka model, not merely as an export product but through localized manufacturing within Kazakhstan. A factory will be established in the country to produce UAVs domestically. TUSAŞ will provide the necessary technology and expertise, underscoring the uniqueness of this collaboration. Manufacturing Anka UAVs in Kazakhstan will strengthen regional security, enhance the capabilities of the Organization of Turkic States, and deepen Türkiye's strategic presence in Central Asia.\r\n\r\n Anka drone. Photo: Anadolu Agency \r\n\r\n - Can other Turkic states meet NATO military standards with Türkiye's support?\r\n\r\n- Absolutely. Collaboration with Türkiye enables member states of the Organization of Turkic States to gradually achieve NATO standards. Their military levels and equipment are significantly improving through these initiatives.\r\n\r\nFor example, in 2025, Türkiye will introduce the Altay tank into its arsenal, which could also be offered for export. Our Kaan fighter jets are currently undergoing testing, and the Kızılelma combat drone demonstrates unique capabilities.\r\n\r\nAlthough the Organization of Turkic States primarily focuses on economic and cultural cooperation, the idea of forming a joint army has been floated, often referred to as the Army of Turan. If a high level of training, equipment, and combat readiness is achieved, such an army could become a powerful deterrent against any threats.\r\n\r\nThe cooperation between Türkiye and Azerbaijan exemplifies how experience can be shared. Military schools, universities, and our National Defense University play pivotal roles in training Azerbaijani officers. Transitioning from Soviet-era military doctrine to standards akin to those of Türkiye is already yielding results, enabling Azerbaijan to protect its interests effectively and increase its regional influence.\r\n\r\n - What is Türkiye’s strategy concerning Syria?\r\n\r\n- Syria remains a priority for Türkiye. The main objectives of our strategy are as follows: 1) preserving Syria's territorial integrity. We advocate for a united and sovereign state within internationally recognized borders; 2) combating terrorist organizations. Türkiye will not allow structures like the PKK and PYD, which threaten our security, to establish themselves along our borders; 3) creating conditions for the voluntary return of Syrian refugees.\r\n\r\nTürkiye also seeks to help Syria become a strong state capable of defending itself and rebuilding its economy. Iraq’s history shows that state weakness leads to fragmentation and chaos. Syria must not face a similar fate.\r\n\r\nRestoring Syria involves numerous challenges, including securing oil fields, clearing them of PKK and PYD elements, and rebuilding energy infrastructure. Türkiye has made significant contributions, such as training the Syrian National Army, which has become an organized military force.\r\n\r\nEfforts are also needed to establish police forces and rebuild the economy. Türkiye is committed to supporting Syria in this process, understanding that its stability is crucial for the entire region.\r\n\r\n Turkish Foreign Minister Hakan Fidan (left) greets Hay'at Tahrir al-Sham (HTS) leader Ahmed al-Sharaa (right) during a visit to the Syrian capital on 22 December 2024. Photo: Hakan Fidan/X \r\n\r\n - Does the new Syrian government’s amnesty include former Assad army personnel? How is this process functioning?\r\n\r\n- Approximately ten days ago, weapons surrender process was announced. Former Syrian Army military personnel, as well as police and intelligence officers, were instructed to hand over their weapons to designated centers. So far, around 35,000 to 40,000 individuals have complied.\r\n\r\nUpon surrendering their weapons, military IDs and other state documents are confiscated, and temporary identification valid for three months is issued in their place. During this period, background checks are conducted. Those not involved in torture, violence, or other crimes may be integrated into the newly formed Syrian National Army.\r\n\r\nInvestigations are ongoing, but there are exceptions. For instance, a general who led a notorious prison known for its brutal torture was recently detained. Such individuals will clearly not be welcomed. Reports of atrocities, where prisoners were tortured to death and their bodies discarded, highlight the horrific practices that must be addressed.\r\n\r\nFurthermore, atrocities committed by armed groups linked to the Assad regime, such as the Shabbiha, against civilians also require close attention. Many areas are experiencing shifts in uniforms, flags, and affiliations—for example, PKK and PYD often change their symbols. Today they display their own flags; tomorrow, they may raise those of the U.S. or Russia. Similar tactics are used by ISIS militants, who rebrand themselves under new names. These manipulations demand vigilant oversight.\r\n\r\nIn recent days, Iran-backed efforts have incited uprisings in Latakia. In one ambush, 17 opposition fighters were killed. Such actions are clearly backed by external support and coordination.\r\n\r\n - What is the position of the new Syrian government regarding the Kurds and terrorist organizations like the PKK and PYD?\r\n\r\n- During the formation of the transitional government, military operations leader Ahmed al-Sharaan declared: All peoples of Syria are equal and will live in peace and harmony. No one has superiority over others, and Syrians will live on their land without discrimination.\r\n\r\nThis position has been upheld so far. For instance, Christmas celebrations by Christian communities occurred without restrictions. Similarly, other religious and cultural events have been observed freely. No discrimination against Alawites or Nusairis has been reported, although their armed activities and ambushes remain pressing issues.\r\n\r\nRegarding the Kurdish question, Ahmed al-Sharaan stated: We clearly distinguish between ordinary Kurdish citizens and terrorists affiliated with the PKK and PYD. The former are part of the Syrian people, while the latter are terrorist organizations.\r\n\r\nThe government has honored its promises to the Kurdish population. Kurds not involved in terrorist activities face no restrictions. However, Kurds living in areas controlled by the PKK and PYD endure the same suffering as others. Terrorists break into homes, abduct children, and force them into their ranks.\r\n\r\nThis is not a new tactic. The PKK has long used women and children as shields in its operations. For example, during the Afrin operation, Turkish forces encountered terrorists hiding behind civilians and refrained from attacking to avoid harming innocent lives. As a result, 12 of our soldiers were killed. This underscores the inhumane tactics employed by these terrorist organizations.\r\n\r\n Turkish soldiers stand as Syrian migrants wait at the Cilvegozu border gate to cross into Syria, after Syrian rebels announced that they have ousted Syria's Bashar al-Assad, in the Turkish town of Reyhanli in Hatay province, December 10, 2024. Photo: REUTERS/Dilara Senkaya \r\n\r\n - Syrian refugees who have lived in Türkiye for 13 years—do they carry the Turkish way of life with them when returning home? Can the Turkish experience serve as an example for the local population and Syria’s new government?\r\n\r\n- Historically, Türkiye itself has followed a similar path. Our mayors and ministers, upon visiting Europe, sought to adopt the level of development they observed there and apply it in Türkiye. Today, Syria lags behind Türkiye by 30 or even 40 years in terms of development. Syrians who have lived in Türkiye for 13 years have inevitably absorbed many aspects of the Turkish way of life and will likely try to implement this experience in their homeland.\r\n\r\nWe can already see growing gratitude and affection for Türkiye among Syrians. This is especially evident among children: around 758,000 Syrian students attend Turkish schools, and many of them are now fluent in Turkish. These children will become a bridge between Türkiye and Syria in the future. Just as Türkiye once adopted much from Europe, Syria will inevitably draw inspiration from Türkiye.\r\n\r\n - What has Russia lost by supporting the Assad regime?\r\n\r\n- For Russia, maintaining a military presence in the Mediterranean was a priority. It has two bases in Syria: the airbase in Latakia and the naval base in Tartus. As long as these bases remain intact, a change in Syria’s leadership does not pose a serious threat to Russia.\r\n\r\nRussia has not made significant economic investments in Syria, focusing instead on using its military facilities. Unlike Russia, Iran has invested heavily in spreading its ideology and strengthening Shiite communities in the region.\r\n\r\n - What goals did Iran pursue by supporting the Assad regime? What has it gained and lost?\r\n\r\n- Iran aimed to expand its religious influence and establish dominance in the region by creating a Shiite majority. However, its methods have been destructive. Instead of developing infrastructure and the economy, Iran left behind devastation. Cities like Aleppo, Hama, and Homs are tragic examples of this policy.\r\n\r\nThe Assad regime, backed by Iranian militias, has turned Syria into an open-air prison. Iran continues to support its allies in the region, instigating unrest among Alawites and Shiites in Latakia.\r\n\r\nMoreover, Iran claims that the new Syrian regime must repay the $30 billion it provided to Assad. Yet, one must ask: Were these funds used to develop Syria, or were they spent on financing mercenaries and sustaining the war?\r\n\r\n - How do you evaluate Iran’s policy in the region and Donald Trump’s approach to dealing with the country?\r\n\r\n- Unfortunately, Iran does not seek peace in the region and shows no goodwill toward its neighbors. However, its actions harm Iran itself more than they harm Türkiye. Türkiye has consistently demonstrated examples of good-neighborly relations, including providing aid to Iran during difficult times.\r\n\r\nRegarding Donald Trump, his policy toward Iran focused on intensifying sanctions. The primary objective was to ensure Israel’s security. Instead of investing in improving the lives of its citizens, Iran has concentrated on expanding its influence, which brings no benefits to its people.\r\n\r\nIt is likely that the U.S. will continue to pressure Iran through economic measures, aiming to increase public discontent and weaken the regime. However, it is unlikely that this will lead to military intervention.","url":"https://news.az/news/-ibrahim-kelesh-on-the-prospects-of-creating-a-joint-turkic-army-interview","image":"https://news.az/photos/2025/01/2-1735983546.jpg","video":null,"publish_date":"2025-01-05 00:42:12","author":"Bakhtiyar Mammadov","authors":["Bakhtiyar Mammadov"],"language":"en","category":"politics","source_country":"az","sentiment":0.458},{"id":278325570,"title":"Biden awards Wintour, Bono and Soros with Medal of Freedom","text":"Vogue editor Dame Anna Wintour, U2 frontman Bono and billionaire George Soros are among those who have received America's highest civilian honour from outgoing President Joe Biden, News.az reports citing BBC. \r\n\r\nFormer US Secretary of State Hillary Clinton joined actors Denzel Washington and Michael J Fox as they also received the Presidential Medal of Freedom at a White House ceremony on Saturday.\r\n\r\nNineteen people received the honour this year, spanning the worlds of culture, politics and activism.\r\n\r\nThe White House said the recipients had been chosen because are they are good people who have made extraordinary contributions to their country and the world.\r\n\r\nTogether, you leave an incredible mark - and I mean this sincerely, this group - you leave an incredible mark on our country.\r\n\r\nBono, who's real name is Paul David Hewson, has already been awarded the highest cultural honour of France and received an honorary knighthood.\r\n\r\nHe is known for campaigning against poverty and supporting those with HIV/Aids.\r\n\r\nWintour, one of the most significant players in fashion, has been serving as editor-in-chief of Vogue since 1988 and among other charities helped raised more than $20m for Aids research.\r\n\r\nShe also raised money for UK arts organisations following funding cuts in 2022.\r\n\r\nThe White House said in a statement that billionaire philanthropist and Democratic megadonor George Soros had supported organizations and projects across the world that strengthen democracy, human rights, education and social justice.\r\n\r\nHillary Clinton receives the award just weeks before her former political rival is sworn in as president. She was the Democratic White House candidate lost to Donald Trump in the 2016 election.\r\n\r\nInter Miami soccer star Lionel Messi, retired Los Angeles Lakers basketball player Earvin Magic Johnson and fashion designer Ralph Lauren also received the medal.\r\n\r\nAmerican Film Institute founder George Stevens Jr and former Kennedy Center chair David Rubinstein were among the cohort receiving medals.\r\n\r\nOther recipients include humanitarian and chef José Andrés, whose World Central Kitchen has helped provide food for civilians in war zones and areas hit by natural disasters; acclaimed British conservationist Jane Goodall and science educator Bill Nye.\r\n\r\nFormer US Attorney General Robert F Kennedy, former Defence Secretary Ash Carter, civil rights leader Fannie Lou Hamer and former Governor of Michigan George W Romney will receive the award posthumously.\r\n\r\nEstablished under former president John F Kennedy, the medal is awarded at the discretion of the president on the advice of an external advisory panel.\r\n\r\nPrevious recipients of the award include the most decorated gymnast of all time Simone Biles, Oscar-winning actress Michelle Yeoh and Apple founder Steve Jobs.","url":"https://news.az/news/biden-awards-wintour-bono-and-soros-with-medal-of-freedom","image":"https://news.az/photos/2025/01/eb28a-1736018518.jpg","video":null,"publish_date":"2025-01-05 00:42:12","author":null,"language":"en","source_country":"az","sentiment":0.45},{"id":278325538,"title":"Biden plans to send $8bn arms shipment to Israel","text":"The US Department of State has notified Congress of a planned $8bn (£6.4bn) arms sale to Israel, an American official has confirmed to the BBC, News.az reports citing BBC. \r\n\r\nThe weapons consignment, which needs approval from House and Senate committees, includes missiles, shells and other munitions.\r\n\r\nThe move comes just over a fortnight before President Joe Biden leaves office. Washington has rejected calls to suspend military backing for Israel because of the number of civilians killed during the war in Gaza.\r\n\r\nIn August, the US approved the sale of $20bn in fighter jets and other military equipment to Israel.\r\nThe latest planned shipment contains air-to-air missiles, Hellfire missiles, artillery shells and bombs, the US official said.\r\n\r\nA source familiar with the sale told the BBC on Saturday: The president has made clear Israel has a right to defend its citizens, consistent with international law and international humanitarian law, and to deter aggression from Iran and its proxy organisations.\r\n\r\nWe will continue to provide the capabilities necessary for Israel's defence.\r\n\r\nBiden has often described US support for Israel as iron-clad.\r\n\r\nThe US is by far the biggest supplier of arms to Israel, having helped it build one of the most technologically sophisticated militaries in the world.\r\n\r\nAccording to the Stockholm International Peace Research Institute (SIPRI), the US accounted for 69% of Israel's imports of major conventional arms between 2019 and 2023.\r\n\r\nIn May 2024, the US confirmed it had paused a single consignment of 2,000lb and 500lb bombs over concerns Israel was going ahead with a major ground operation in the southern Gaza city of Rafah. But Biden immediately faced a backlash from Republicans in Washington and from Netanyahu who appeared to compare it to an arms embargo. Biden has since partially lifted the suspension and not repeated it.\r\n\r\nThe planned shipment is one of a number of steps taken by the Biden administration in recent weeks, as the outgoing president attempts to shore up his legacy.\r\n\r\nIt will likely also be the last planned weapons sale to Israel before he leaves the White House on 20 January 2025, when his successor Donald Trump is inaugurated.\r\n\r\nThe president-elect has previously spoken of ending foreign conflicts, and of reducing US involvement, including during his re-election bid.\r\n\r\nTrump has positioned himself as a staunch supporter of Israel, but has urged the American ally to finish its military operation in Gaza quickly.\r\n\r\nIsrael launched a campaign to destroy Hamas in response to the group's unprecedented attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\r\n\r\nMore than 45,580 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry.","url":"https://news.az/news/biden-plans-to-send-8bn-arms-shipment-to-israel","image":"https://news.az/photos/2025/01/e2b7b-1736016956.jpg","video":null,"publish_date":"2025-01-05 00:42:12","author":null,"language":"en","category":"politics","source_country":"az","sentiment":-0.12},{"id":278325352,"title":"Russia promises retaliation after saying Ukraine fired US-supplied missiles","text":"Russia has pledged to retaliate after it claimed to have shot down eight US-supplied ATACMS missiles fired by Ukraine at its border region of Belgorod.\n\n“On January 3, an attempt was made from Ukrainian territory to launch a missile attack against the Belgorod region using US-made ATACMS operational-tactical missiles,” the Russian Ministry of Defence said on Saturday.\n\n“These actions by the Kyiv regime, which is supported by Western curators, will be met with retaliation,” it added, saying all the missiles were shot down.\n\nThe ministry said earlier that air defences downed eight ATACMS missiles in total, without saying when or where.\n\nOfficials in Ukraine have not yet responded to the accusation.\n\nThe Army Tactical Missile System (ATACMS) has a range of 300km (190 miles) and was first developed in the 1980s.\n\nOutgoing US President Joe Biden had authorised Kyiv to use long-range weapons against Russia last year, in a move the Kremlin denounced as a grave escalation of the nearly three-year conflict. Biden is expected to announce additional security assistance for Ukraine in the coming days, according to White House spokesperson John Kirby.\n\nUS President-elect Donald Trump said in an interview last month he was “very vehemently” opposed to Ukraine using the arms, which he said were “escalating” the conflict.\n\nBesides military support from the US, Kyiv will also reportedly receive its first French Mirage 2000-5F multirole fighters this month, according to French magazine Avions Legendaires.\n\nRussian President Vladimir Putin threatened last year to strike central Kyiv with a hypersonic ballistic missile if Ukraine continued hitting Russian territory with long-range Western weapons.\n\nBoth Kyiv and Moscow have accused each other of fatal attacks on civilians since the year began.\n\nA Russian attack on a village in Ukraine’s northeast Kharkiv region earlier on Saturday killed a 74-year-old man, regional Governor Oleg Synegubov said.\n\nAt least three people, including two children, were wounded in a Russian attack on the Sumy region of northeastern Ukraine on Saturday, local authorities said. Sumy borders Russia’s Kursk region and has been regularly shelled by Russian forces for months.\n\nRussian forces also launched attacks near the Ukrainian city of Pokrovsk in an effort to bypass it from the south and cut off supply routes to Ukraine’s troops, the Ukrainian military said on Saturday.\n\nUkrainian President Volodymyr Zelenskyy noted that Russia had launched 300 attack drones and 20 missiles at Ukrainian targets in the first three days of 2025, but said a large amount was shot down by Kyiv’s forces.\n\n“Such Russian terror, which continues with unrelenting intensity, requires both us and all our partners not to reduce efforts in strengthening our air defence shield and all its systemic components – from Patriot systems to mobile fire groups,” Zelenskyy said on his social media platforms.\n\nUS Secretary of State Antony Blinken will embark on his final trip in office this weekend, travelling to South Korea, Japan, and France.\n\nAt meetings in Paris, he is expected to discuss European security and Russia’s war in Ukraine with French officials, showcasing the Biden administration’s final outreach towards Kyiv before the Trump government takes over.","url":"https://stkittsgazette.com/russia-promises-retaliation-after-saying-ukraine-fired-us-supplied-missiles/","image":"https://stkittsgazette.com/app/uploads/2024/12/2024-12-06T123414Z_1209749526_RC2OJBAQ5JYO_RTRMADP_3_ISRAEL-PALESTINIANS-PROTESTS-YEMEN-1733517621-5flmaN.jpeg","video":null,"publish_date":"2025-01-05 00:40:13","author":null,"language":"en","category":"politics","source_country":"kn","sentiment":-0.151},{"id":278325340,"title":"Russia promises retaliation after saying Ukraine fired US-supplied missiles","text":"Russia has pledged to retaliate after it claimed to have shot down eight US-supplied ATACMS missiles fired by Ukraine at its border region of Belgorod.\n\n“On January 3, an attempt was made from Ukrainian territory to launch a missile attack against the Belgorod region using US-made ATACMS operational-tactical missiles,” the Russian Ministry of Defence said on Saturday.\n\n“These actions by the Kyiv regime, which is supported by Western curators, will be met with retaliation,” it added, saying all the missiles were shot down.\n\nThe ministry said earlier that air defences downed eight ATACMS missiles in total, without saying when or where.\n\nOfficials in Ukraine have not yet responded to the accusation.\n\nThe Army Tactical Missile System (ATACMS) has a range of 300km (190 miles) and was first developed in the 1980s.\n\nOutgoing US President Joe Biden had authorised Kyiv to use long-range weapons against Russia last year, in a move the Kremlin denounced as a grave escalation of the nearly three-year conflict. Biden is expected to announce additional security assistance for Ukraine in the coming days, according to White House spokesperson John Kirby.\n\nUS President-elect Donald Trump said in an interview last month he was “very vehemently” opposed to Ukraine using the arms, which he said were “escalating” the conflict.\n\nBesides military support from the US, Kyiv will also reportedly receive its first French Mirage 2000-5F multirole fighters this month, according to French magazine Avions Legendaires.\n\nRussian President Vladimir Putin threatened last year to strike central Kyiv with a hypersonic ballistic missile if Ukraine continued hitting Russian territory with long-range Western weapons.\n\nBoth Kyiv and Moscow have accused each other of fatal attacks on civilians since the year began.\n\nA Russian attack on a village in Ukraine’s northeast Kharkiv region earlier on Saturday killed a 74-year-old man, regional Governor Oleg Synegubov said.\n\nAt least three people, including two children, were wounded in a Russian attack on the Sumy region of northeastern Ukraine on Saturday, local authorities said. Sumy borders Russia’s Kursk region and has been regularly shelled by Russian forces for months.\n\nRussian forces also launched attacks near the Ukrainian city of Pokrovsk in an effort to bypass it from the south and cut off supply routes to Ukraine’s troops, the Ukrainian military said on Saturday.\n\nUkrainian President Volodymyr Zelenskyy noted that Russia had launched 300 attack drones and 20 missiles at Ukrainian targets in the first three days of 2025, but said a large amount was shot down by Kyiv’s forces.\n\n“Such Russian terror, which continues with unrelenting intensity, requires both us and all our partners not to reduce efforts in strengthening our air defence shield and all its systemic components – from Patriot systems to mobile fire groups,” Zelenskyy said on his social media platforms.\n\nUS Secretary of State Antony Blinken will embark on his final trip in office this weekend, travelling to South Korea, Japan, and France.\n\nAt meetings in Paris, he is expected to discuss European security and Russia’s war in Ukraine with French officials, showcasing the Biden administration’s final outreach towards Kyiv before the Trump government takes over.","url":"https://barbadosgazette.com/russia-promises-retaliation-after-saying-ukraine-fired-us-supplied-missiles/","image":"https://barbadosgazette.com/app/uploads/2025/01/AP24324585400921-1732092912-BysAfU.jpeg","video":null,"publish_date":"2025-01-05 00:40:12","author":null,"language":"en","category":"politics","source_country":"bb","sentiment":-0.151},{"id":278328336,"title":"Biden to deliver two major speeches in his final days in office","text":"President Joe Biden plans to deliver two major speeches before leaving office as part of an effort to outline what he sees as key parts of his legacy from more than 50 years in public service, according to two people familiar with the plans. The first speech is set to focus on foreign policy and is expected to be delivered sometime after Biden returns on Jan. 12 from a trip to Italy, these people said. They said Biden then plans to close out his final days in the White House with a farewell address to the country. Neither speech has been fully drafted, the sources familiar with the president’s plans said, but the contours and themes of both have been developed. In his farewell address, Biden is expected to offer a message to Americans for the future and reflect on his decades in public office, including his four years in the White House, according to the people familiar with the president’s plans. The traditional address is expected to channel a similar spirit to the parting sentiments offered by some of Biden’s recent predecessors, including former Presidents George W. Bush and Bill Clinton, who delivered their farewell speeches from the White House, and former President Barack Obama, who opted to speak to the nation from his hometown of Chicago in front of a large audience of supporters. After losing the 2020 election, President-elect Donald Trump posted a pre-recorded video message online the day before Biden was sworn into office. Biden’s foreign policy speech is set to focus on his belief that America is stronger when it invests in its alliances across the world, according to the people familiar with the president’s speeches. Biden is expected to highlight his efforts to broaden and strengthen the North Atlantic Treaty Organization and U.S. relations in the Indo-Pacific, as well as his administration’s military and financial support for Ukraine since Russia’s invasion in 2022. It’s unclear how much the speech might touch on Biden’s decision to order the U.S. withdrawal from Afghanistan in 2021, which has been widely criticized and resulted in the deaths of 13 American service members. Biden is likely to reference his administration’s efforts to combat terrorist groups, including ISIS, but the speech is not expected to dwell on domestic terrorism threats following the New Year’s Day attack in New Orleans, the people familiar with the president’s plans said. The administration is looking at additional steps it could take before Biden leaves office to try to help prevent attacks driven by homegrown radicalization, a person familiar with the discussions said. The president is planning for a busy final two weeks in office. He’s scheduled to travel on Monday to New Orleans to meet with family members of victims of the attack there, as well as local officials. He will then visit California to highlight his record on the environment, including new designations of national monuments. On Thursday, Biden is scheduled to travel to Rome and Vatican City for a three-day visit, likely his final international travel in office. And before leaving the White House on Jan. 20, the president is expected to issue additional pardons, specifically focused on sentencing disparities, a person familiar with the plans said. This person said Biden has not decided whether to preemptively pardon people who could be targeted by the new Trump administration for retribution, though Biden would not pardon anyone who does not want to receive clemency.","summary":"President Joe Biden plans to deliver two major speeches before leaving office as part of an effort to outline what he sees as key parts of his legacy from more than 50 years in public service, according to two people familiar with the plans.","url":"https://www.nbcnews.com/politics/joe-biden/biden-deliver-two-major-speeches-final-days-office-rcna186257","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-01/250104-biden-ch-1627-362f49.jpg","video":null,"publish_date":"2025-01-05 00:39:22","author":"Carol E. Lee,Kristen Welker","authors":["Carol E. Lee","Kristen Welker"],"language":"en","source_country":"us","sentiment":-0.006},{"id":278324426,"title":"Kyodo News Digest: Jan. 5, 2025","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nTOKYO - Japan's space agency plans to partner with private firms to enable various orbiting satellites to conduct emergency observations during natural disasters, sources familiar with the matter said Saturday, reflecting lessons learned from a massive earthquake in central Japan last year.\n\nThe Japan Aerospace Exploration Agency aims to draw up a framework for the coordinated use of public and private satellites by the end of the year that will outline coverage areas and observation times of the satellites, with a drill already conducted last month based on a hypothetical megaquake in the Nankai Trough, the sources said.\n\nTOKYO - Nippon Steel Corp. is set to file a lawsuit in response to U.S. President Joe Biden's decision to block its $14.1 billion takeover of United States Steel Corp., sources close to the matter said Saturday.\n\nBiden on Friday said the deal posed a risk to national security while urging the Japanese and U.S. steelmakers to \"fully and permanently\" abandon their plan, which has been backed by U.S. Steel shareholders. The leadership of the powerful United Steelworkers union strongly objected to the acquisition.\n\nKOBE - Tomiko Itooka, a 116-year-old Japanese woman recognized as the world's oldest person, has died of old age, an official of the western Japan city of Ashiya where she lived said Saturday.\n\nBorn on May 23, 1908, in Osaka as the eldest of three siblings, Itooka died Sunday night at the nursing home where she resided, the city government in Hyogo Prefecture said.\n\nBlinken to visit S. Korea, Japan, France before Trump inauguration\n\nWASHINGTON - U.S. Secretary of State Antony Blinken will leave for South Korea, Japan and France this weekend, the State Department said Friday.\n\nBlinken's trip from Saturday to Thursday could be his final foreign visits during his tenure. He plans to reaffirm the importance of security and other cooperation with Washington's two key Asian allies ahead of U.S. President-elect Donald Trump's return to the White House on Jan. 20 for a nonconsecutive second term.\n\nNEW YORK - Pakistan's envoy to the United Nations expressed hope that the Security Council will strengthen its dialogue on issues related to North Korea as Islamabad begins its two-year term as a nonpermanent member of the panel.\n\nDuring a recent interview with Kyodo News, Munir Akram said Pakistan is \"concerned\" about the lack of sufficient talk in the United Nations on the \"normalization of the situation on the Korean Peninsula.\"\n\nTOKYO - Japan's former world No. 4 Kei Nishikori reached the final of the Hong Kong Tennis Open after his Chinese opponent, Shang Juncheng, pulled out due to illness in the first set of their Saturday semifinal with Nishikori 4-3 up.\n\nOn Sunday, the 35-year-old Nishikori, currently ranked 106th, will play his first final on the ATP Tour since winning the Brisbane International in January 2019, looking to claim his 13th title.\n\nRugby: Tuitama stars as Blue Revs open League One season with 3 wins\n\nTOKYO - Shizuoka Blue Revs continued their perfect start to the Japan Rugby League One season on Saturday as they came from behind to beat Sagamihara Dynaboars 40-34 to make it three wins from three in the first division.\n\nMalo Tuitama scored back-to-back hat-tricks for the Blue Revs as the Samoan-born wing, who made his Japan debut last August under Eddie Jones, helped his side overcome a 19-12 halftime deficit at Prince Chichibu Memorial Rugby Ground in Tokyo.\n\nVideo: Tokyo station heavily congested by travellers returning home after New Year's holiday","summary":"TOKYO - \n People clad in traditional attire play \"kemari,\" a football game played by nobles in Jap...","url":"https://english.kyodonews.net/news/2025/01/38c208639d18-kyodo-news-digest-jan-5-2025--1-.html","image":"https://img.kyodonews.net/english/public/images/posts/91a038d308e437ed53621dbced3004f7/photo_l.jpg","video":null,"publish_date":"2025-01-05 00:33:12","author":null,"language":"en","source_country":"jp","sentiment":0.145},{"id":278324106,"title":"Uashingtoni shton masat e sigurisë","text":"Forcat e agjencive të zbatimit të ligjit dhe të sigurisë në Uashington dhe në zonën përreth po mobilizojnë përforcime, ndërsa përgatiten për sigurimin e tre aktiviteteve të rëndësishme në kryeqytetin e vendit. Këto zhvillime vijnë pas sulmit në ditën e Vitit të Ri në Nju Orlins dhe shpërthimit në kamionin Cybertruck, të kompanisë Tesla, përpara Hotelit Ndërkombëtar Trump në Las Vegas.\n\nAktiviteti i parë do të mbahet të hënën, kur Kongresi i ri mblidhet për të certifikuar rezultatin e zgjedhjeve presidenciale, katër vite pas trazirave të 6 janarit 2021 në Kapitol.\n\nAktiviteti i dytë do të jetë funerali shtetëror për ish-Presidentin Jimmy Carter, duke filluar me ceremoni që fillojnë të martën dhe përfundojnë të enjten.\n\nAktiviteti i fundit do të jetë më 20 janar, kur do të inaugurohet Presidenti i zgjedhur Donald Trump.\n\n“Nuk ka ndodhur ndonjëherë më parë. Kemi tre aktivitete (të veçanta të sigurisë kombëtare) brenda një periudhe prej 15 ditësh”, u tha të premten gazetarëve Matt McCool, nga zyra në Uashington e Shërbimit Sekret.\n“Por, dua t’ju them se u përshtatemi nevojave. Kemi punuar prej vitesh për aktivitete të tilla. Kështu që do të jemi të përgatitur”, tha ai.\n\nMegjithë shqetësimet e krijuara pas sulmit në Nju Orlins dhe shpërthimin në Las Vegas, zyrtarët e sigurisë deri më tani kanë besim se aktivitetet në Uashington do të zhvillohen të sigurta.\n\n“Nuk kemi ndonjë kërcënim të besueshëm apo konkret në lidhje me këto aktivitete”, tha David Sundberg, ndihmës drejtor në zyrën e FBI-së në Uashington.\n\nAgjencitë e zbatimit të ligjit dhe të sigurisë kanë marrë masa të shtuara, duke patur parasysh se qyteti dhe rajoni po përballen me një mjedis me rrezikshmëri të shtuar.\n\nShërbimi Sekret tha të premten se po sillte agjentë nga i gjithë vendi për të rritur praninë, e cila ishte sidoqoftë në nivelin më të lartë të tre viteve të fundit.\n\nDepartamenti Metropolitan i Policisë së Uashingtonit tha se ka shtuar rreth 4 mijë policë nga departamente të ndryshme nga mbarë vendi.\n\nGarda Kombëtare e kryeqytetit konfirmoi se ka miratuar kërkesa për mbështetje të mëtejshme, përfshirë vendosjen në dispozicion të 500 anëtarëve të tjerë të gardës, për certifikimin e zgjedhjeve në 6 janar dhe oficerët ndërlidhës për funeralin shtetëror.\n\nPo shqyrtohet edhe një kërkesë shtesë për 7,800 ushtarakë të tjerë nga garda për sigurimin e inaugurimit të Presidentit të zgjedhur Trump.\n\n“Një mori masash sigurie, të dukshme dhe të padukshme, do të merren në koordinim, për t’u siguruar mirëfunksionimi i planit gjithëpërfshirës”, tha agjenti i Shërbimit Sekret, McCool.\n\nPolicia e Uashingtonit njoftoi se masat e rritura të sigurisë hyjnë në fuqi të dielën. Oficerë të specializuar do të dislokohen në mbarë qytetin për të qenë në gatishmëri në rast të ndonjë emergjence.\n\nPolicia e Kapitolit, e cila ka 2,400 oficerë dhe punonjës civilë që janë përgjegjës për mbrojtjen e Kapitolit dhe anëtarët e Kongresit, njoftoi se është tashmë më e përgatitur për emergjencat, krahasuar me katër vite më parë./ Voa","url":"https://www.cna.al/kosova-bota/uashingtoni-shton-masat-e-sigurise-i419534","image":"https://media.cna.al/cna.al/media3/-1200-630-1736000053xuashington-123.png","video":null,"publish_date":"2025-01-05 00:28:12","author":null,"language":"en","category":"politics","source_country":"al","sentiment":-0.682},{"id":278324124,"title":"Viti i zgjedhjeve dhe sfidave drejt stabilitetit","text":"Zgjedhjet e rregullta parlamentare, që do të mbahen më 9 shkurt, si dhe zgjedhjet lokale në 38 komuna të vendit, që pritet të organizohen në vjeshtë, do të jenë ndër ngjarjet kryesore në Kosovë përgjatë vitit 2025, vlerësojnë analistët politikë në Kosovë dhe Serbi.\n\nAnalistët nga Prishtina, Lulzim Pecin, nga Instituti Kosovar për Kërkime dhe Zhvillime të Politikave (KIPRED) dhe Njomza Arifi nga Grupi për Studime Juridike dhe Politike, vlerësojnë se rezultatet që do të dalin nga zgjedhjet, qoftë parlamentare, qoftë lokale, do t’i diktojnë dinamikat e zhvillimeve të mundshme politike dhe të sigurisë në vend.\n\nMendim të përafërt kanë edhe analistët nga Beogradi, politologu, Ognjen Gogiq dhe Dushan Janjiq nga Forumi për Marrëdhënie Etnike. Megjithatë, ata i shohin si të mundshme incidentet në veri të vendit dhe cenimin e situatës së sigurisë, në rast se nuk parandalohen ato.\n\nZbatimi i obligimeve që dalin nga marrëveshjet e arritura në Bruksel, në kuadër të dialogut për normalizimin e marrëdhënieve Kosovë-Serbi, do të jetë sfidues gjatë vitit 2025, për Qeverinë e ardhshme të Kosovës, por edhe për atë të Serbisë, vlerësojnë analistët.\n\nAsociacioni, barrë e vjetër për Qeverinë e re\n\nZgjedhjet parlamentare do të përcaktojnë edhe fatin e ardhshëm të liderëve në skenën politike të vendit, vlerëson Lulzim Peci.\n\nKjo është arsyeja pse ai pret që fillimi i vitit 2025 të karakterizohet me fushatë zgjedhore agresive të partive politike.\n\nMegjithatë, sipas tij, qeveria e re, kushdo që do ta drejtojë, do të përballet menjëherë me kërkesat që partnerët nga Bashkimi Evropian dhe Shtetet e Bashkuara të Amerikës i kanë parashtruar tash e sa kohë.\n\n“Kushdo që bëhet lider i qeverisë së ardhshme, do të përballet me kërkesat për ecjen përpara me dialog (për normalizimin e marrëdhënieve me Serbinë) dhe sidomos me kërkesën për dorëzimin në Gjykatën Kushtetuese të draft-statutit për Asociacionin e komunave me shumicë serbe”, thekson Peci.\n\nNë tetor të vitit 2023, BE-ja ua dorëzoi Kosovës dhe Serbisë një “draft-statut modern” për formimin e Asociacionit. Shtetet e Bashkuara, Gjermania, Franca dhe Italia - e mbështetën atë.\n\nBE-ja dhe SHBA-ja i kanë bërë thirrje vazhdimisht Kosovës që ta dërgojë këtë draft-statut në Gjykatën Kushtetuese.\n\nNjomza Arifi nga Grupi për Studime Juridike dhe Politike në Prishtinës, vlerëson se zgjedhjet parlamentare të 9 shkurtit do të shpërfaqin edhe performancën e subjekteve të reja politike serbe.\n\nPjesëmarrjen në zgjedhje e kanë paraqitur në Komisionin Qendror të Zgjedhjeve gjashtë subjekte politike serbe: Demokracia Serbe, Lëvizja Popullore Serbe, Për Liri, Drejtësi dhe Mbijetesë, Partia e Serbëve të Kosovës, Nisma Qytetare Drejtësia Popullore, si dhe Lista Serbe.\n\n“Ne konsiderojmë se nëse do te thyhej monopoli politik i Listës Serbe kjo do te kontribuonte në rikthimin e normalitetit në Kuvendin e Kosovës, si dhe përmirësimin e marrëdhënieve ndëretnike në Kosovë”, thekson Arifi.\n\nLista Serbe, është partia më e madhe e serbëve të Kosovës, e cila gëzon mbështetjen e Beogradit zyrtar. Në dhjetë vjetët e fundit, ajo ka fituar zgjedhjet dhe ka përfaqësuar komunitetin në nivelin qendror dhe atë lokal.\n\nNë mbledhjen fillestare të Komisionit Qendror të Zgjedhjeve (KQZ), më 23 dhjetor, kjo parti nuk është certifikuar për pjesëmarrje në zgjedhje, pas kundërshtimeve të partisë në pushtet, Lëvizjes Vetëvendosje, me arsyetimin se Lista Serbe nuk e njeh shtetësinë e Kosovës.\n\nKjo parti është ankuar më pas në Panelin Zgjedhor për Ankesa dhe Parashtresa (PZAP), i cili e ka urdhëruar KQZ-në ta certifikojë këtë parti.\n\nMë 31 dhjetor, KQZ-ja ka thënë se vendimi i PZAP-së për certifikim të Listës Serbe për zgjedhjet e 9 shkurtit, është i plotfuqishëm dhe duhet zbatuar.\n\nDeputetët e Listës Serbe, në legjislaturën e fundit, kanë bojkotuar shumicën e seancave të Kuvendit të Kosovës.\n\nNë katër komunat në veri - Mitrovicë e Veriut, Leposaviq, Zubin Potok dhe Zveçan – Lista humbi pushtetin, pasi kryetarët e komunave atje hoqën dorë nga mandatet, si pjesë e dorëheqjes kolektive të serbëve nga institucionet e Kosovës, në nëntor të vitit 2022, përfshirë edhe policinë dhe gjyqësorin.\n\nNë vend të tyre, pushtetin e morën kryetarë nga partitë politike shqiptare, të cilët dolën nga zgjedhjet lokale në ato komuna, në prill të vitit 2023.\n\nAta u kundërshtuan nga serbët lokalë dhe ishin shkas për tensione dhe përplasje të grupeve të serbëve më Policinë e Kosovës dhe pjesëtarët të misionit të NATO-s në Kosovë – KFOR.\n\nZgjedhjet lokale, rast për kthimin e serbëve në institucione\n\nPolitologu nga Beogradi, Ognjen Gogiq, vlerëson se raportet e partive politike serbe dhe atyre shqiptare do të fillojnë të përcaktohen gjatë fushatës për zgjedhjet parlamentare të 9 shkurtit.\n\nNjë fushatë e ashpër, sipas tij, do t’i ashpërsonte edhe raportet ndërmjet tyre.\n\nKëto raporte, sipas tij, do të varen edhe nga fakti se kush do t’i prijë qeverisë së ardhshme të vendit, dhe a do të ketë bashkëpunim të partive serbe me atë qeveri.\n\n“Ky është faktori kryesor dhe këtë do ta kuptojmë në shkurt. Kjo do ta ruajë tonin gjatë tërë vitit. Më pas, vijnë zgjedhjet lokale, të cilat sërish janë më të rëndësishmet për serbët dhe për veriun, për shkak se përmes tyre do të mund të arrihej deri te kthimi i serbëve në institucione”, tha Gogiq.\n\nNë shtator, presidenti i Serbisë, Aleksandar Vuçiq, në një adresim para kombit, kërkoi shpalljen e zgjedhjeve të reja lokale në veri të Kosovës, kthimin e serbëve në Policinë e Kosovës dhe gjyqësor, si dhe tërheqjen e njësive speciale të Policisë së Kosovës nga rajoni i veriut.\n\nLulzim Peci vlerëson se zgjedhjet lokale të rregullta që do të mbahen në vjeshtë, do të kenë ndikim të madh në konfigurimin politik të Kosovës, përfshirë edhe veriun e saj të banuar me shumicë serbe.\n\nAi konsideron që përfaqësuesit politikë të serbëve do të marrin pjesë në ato zgjedhje.\n\n“Do të kemi një situatë interesante, sepse në aspektin politik do të jenë përfaqësuesit serbë të popullatës lokale serbe në veri. Ndërkaq, në anën tjetër, shumica e policëve atje do të vazhdojnë të jenë të komunitetit shqiptar. Të njëjtën gjë e kemi edhe në drejtësi”, thekson Peci, i cili shtoi se kthimi i serbëve të veriut në polici dhe gjyqësor kërkon zgjidhje politike, në mënyrë që të ecet para drejt stabilizimit të Kosovës në përgjithësi.\n\nEdhe Gogiq e sheh pjesëmarrjen e serbëve në zgjedhjet parlamentare, e sidomos në ato lokale në komunat veriore të Kosovës, si një rrugë që mund të çojë drejt uljes së tensioneve ne atë pjesë të vendit.\n\n“Ato zgjedhje bartin shansin. Se a do të kuptohet ky shans, është e vështirë të thuhet në këtë moment. Mbase (zgjedhjet) mund të jenë edhe pretekst për përplasjet e reja”, thekson Gogiq.\n\nKryeministri i Kosovës, Albin Kurti, në një konferencë për media, më 24 dhjetor, ka komentuar mundësinë e veprimeve dhe incidenteve që mund ta sfidojnë sigurinë në Kosovë.\n\n“...pritet të ndodhin edhe në të ardhmen e afërt, dhe veçmas para dhe pas Vitit të Ri”, ka thënë Kurti.\n\nAi ka komentuar sulmin në kanalin e Ibër-Lepencit, që ndodhi më 29 nëntor 2024 në fshatin Varragë të komunës së Zubin Potokut, duke thënë se urdhrin për kryerje e ka dhënë Millan Radoiçiq, ndërkaq përgjegjës për financimin, planifikimin dhe logjistikën e sulmit është shteti i Serbisë. Radoiçiq ka pranuar përgjegjësinë për organizimin e sulmit në Banjskë të Zveçanit , më 24 shtator 2023, ku mbeti i vrarë rreshteri policor Afrim Bunjaku. Në përleshje e sipër më pas janë vrarë edhe tre sulmues serbë.\n\nRadoiçiq aktualisht po hetohet në Serbi, ndërkaq autoritetet e Kosovës kërkojnë që ai t’i nënshtrohet drejtësisë në Kosovë.\n\nDialog apo incidente?\n\nBashkimi Evropian dhe Shtetet e Bashkuara të Amerikës në vazhdimësi u kanë bërë thirrje Kosovës dhe Serbisë që t’i kthehen dialogut dhe të shmangin veprimet që tensionojnë situatën.\n\nNjomza Arifi shpreh mendimin se pas ndryshimeve në institucionet e Bashkimit Evropian dhe ardhjes në krye të diplomacisë evropiane të Kaja Kallasit, mund të pritet që viti 2025 të jetë më pozitiv në kontekstin e dialogut ndërmjet Kosovës dhe Serbisë, në krahasim me vitin 2024.\n\n“Mund të presim një ekip ndërmjetësues më pozitiv nga BE-ja, ndërsa administrata (e presidentit të zgjedhur amerikan, Donald) Trump me shumë gjasë do t’ia lë barrën e ndërmjetësimit Brukselit”, u shpreh Arifi.\n\nPor, kështu nuk mendon Dushan Janjiq nga Forumi për Marrëdhënie Etnike në Beograd.\n\nAi konsideron se dialogu i lehtësuar nga Bashkimi Evropian është rrënuar, për shkak se vetë BE-ja nuk ka një politikë të qartë të “menaxhimit të konfliktit”, e cila do të merrej me qetësimin e tensioneve dhe situatave që çojnë drejt destabilizimit.\n\nJanjiq konsideron se “kriza e sigurisë”, do të vazhdojë edhe në vitin 2025.\n\nDuke iu referuar sulmeve në Banjskë dhe në kanalin Ibër-Lepenc si “akte terroriste”, Janjiq thekson se incidentet janë bërë pjesë e politikës ose të konfliktit brenda marrëdhënieve politike ndërmjet Kosovës dhe Serbisë.\n\n“Kjo do të thotë që do të kemi forma të ndryshme (të incidenteve), sikurse forma që kishte sulmi i fundit terrorist në kanalin Ibër-Lepenc, e para saj edhe në Banjska. Pra, nuk përjashtohet një seri e ngjarjeve të tilla deri në maj apo qershor”, theksoi Janjiq.\n\nAi shtoi se tashmë është e qartë që nëse të dyja vendet, Kosova dhe Serbia dëshirojnë t’i normalizojnë marrëdhëniet dhe të hyjnë në Bashkimin Evropian, atëherë ato duhet të bëhen pjesë e NATO-s.\n\nNë pozicionet e tanishme, të dyja vendet, sipas tij, janë “të ekspozuara ndaj ndikimit rus dhe ndikimeve tjera negative”.\n\nPor, përderisa pritja, që gjatë vitit 2025 të dy vendet të anëtarësohen në NATO, nuk është reale, Janjiq beson që së paku do të arrihet një marrëveshje ndërmjet Kosovës dhe Serbisë “për pakon e sigurisë”.\n\n“Mendoj se qysh moti ekziston vetëdija për një gjë të tillë në Londër. Është e qartë se ideja e tillë është e afërt edhe për mënyrën e qeverisjes së Trumpit. Kjo, sigurisht se do të vijë në radhën e prioriteteve. Nuk do ta bëjnë këtë përmes këtyre mekanizmave që thonë ‘më mirë 100 vjet bisedime’, sikurse BE-ja. Kjo bëhet me grupin e QUINT-it dhe NATO-n. Nuk ka aty ndërmjetësues dhe të tillë të ngjashëm”, theksoi Janjiq.\n\nAi shtoi se një marrëveshje e tillë do t’i definonte raportet e ndërsjella të institucioneve të sigurisë dhe të drejtësisë të të dyja vendeve, pa hyrë në pikëpamjet delikate dhe të kundërta të tyre lidhur me statusin e Kosovës.\n\n“Duhet të menaxhohet me sigurinë, për shkak të luftërave, të cilat është e mundur të zgjerohen edhe në Ballkanin Perëndimor”, përfundoi Janjiq./ Rel","url":"https://www.cna.al/kosova-bota/viti-i-zgjedhjeve-dhe-sfidave-drejt-stabilitetit-i419559","image":"https://media.cna.al/cna.al/media3/-1200-630-1736008041xzgjedhje-223.png","video":null,"publish_date":"2025-01-05 00:28:12","author":null,"language":"en","category":"politics","source_country":"al","sentiment":0.897},{"id":278324114,"title":"Mike Johnson rizgjidhet kryetar i Dhomës së Përfaqësuesve","text":"Mike Johnson u rizgjodh kryetar i Dhomës së Përfaqësuesve të premten pas një raundi të gjatë votimi që vuri në dukje ndasitë e vazhdueshme mes Partisë Republikane në Kongres.\n\nFillimisht ai u duk se nuk arriti të siguronte votat që i duheshin për të mbajtur rolin e udhëheqësit, por dy republikanë, që fillimisht nuk mbështetën atë, ndryshuan qëndrim duke votuar për të, pas më shumë se një orë e gjysmë negociatash. Ai u rizgjodh me 218 vota, minimumi i votave të nevojshme.\n\nRepublikanët e kontrollojnë Dhomën e Përfaqesuesve me një shumicë të ngushtë 219 -215.\n\nVotimi ishte një provë e hershme mbi aftësinë e Partisë Republikane për të qenë e bashkuar ndërsa synon të çojë përpara agjendën e Presidentit të zgjedhur Donald Trump për shkurtim të taksave dhe forcim të sigurinë kufitare. Procesi po ashtu vuri në provë ndikimin e zotit Trump në Kapitol, ku një grusht republikanësh kishin shfaqur dëshirën për ta sfiduar.\n\nRepublikanët në Dhomën e Përfaqësuesve janë përballur me ndasi të brendshme gajtë dy vjetëve të fundit.\n\nZoti Johnson e mori detyrën pasi Partia Republikane e shkarkoi paraardhësin e tij Kevin McCarthy në mes të mandatit të këtij të fundit.\n\nDy vjet më parë, zoti McCarthy u zgjodh në krye të Dhomës së Përfaqësuesve pas 15 raundesh votimi.\n\nNë këtë legjislaturë të re, republikanët do të kenë edhe kontrollin e Senatit, që deri më tani ishte mbajtur nga demokratët.\n\nRepublikanët do të kenë shumicën 53 - 47, shumë më pak se 60 votat që nevojiten për miratimin e pjesës së më të madhe të akteve ligjore.\n\nMe betimin e zotit Trump në 20 janar, republikanët do kenë kontrollin e të tre degëve të qeverisjes në 2 dhomat e Kongresit dhe në Shtëpinë e Bardhë.\n\nTradicionalisht, 100 ditët e para të Presidencës dhe Kongresit të ri paraqesin një periudhë për një agjendë legjislative ambicioze.\n\n“Presidenti i ri do të përqëndrohet tek tarifat, tek kufiri, urdhërat ekzekutivë të lidhur me emigracionin dhe emigrantët, veçanërisht ata nga Meksika dhe vendet myslimane. Dhe më pas ai do të përpiqet për çdo kompromis të mundshëm për të siguruar miratimin e ligjeve për çështje që lidhen me ekonominë, ushqimet, siç preferon ai t’i cilësojë”, shprehet për Zërin e Amerikës përmes platformës Zoom Casey Burgat, profesore pranë universitetit “George Washington”./ Voa","url":"https://www.cna.al/kosova-bota/mike-johnson-rizgjidhet-kryetar-i-dhomes-se-perfaqesuesve-i419531","image":"https://media.cna.al/cna.al/media3/-1200-630-1735998702xmike-485.png","video":null,"publish_date":"2025-01-05 00:28:12","author":null,"language":"en","category":"sports","source_country":"al","sentiment":-0.25},{"id":278323206,"title":"Politicians will hinder central banks’ easing plan","text":"Global Economy \n\n REUTERS, London\n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:18 AM \n\n Most Viewed\n\n Global Economy\n\n Global Economy \n\n Politicians will hinder central banks’ easing plan\n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:18 AM \n\n REUTERS, London\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:18 AM \n\n The US Federal Reserve building is seen in Washington. There are some ideal conditions for central banks around the world to lower interest rates this year. Photo: REUTERS/FILE\n\n In 2025, the global economy will be in a much better place than at any time since the outbreak of Covid-19. Growth will be solid, and inflation will finally abate. Those are ideal conditions for central banks to lower interest rates. But the virtuous circle of an easier monetary policy feeding faster expansion will hit a big snag: governments' inability, or unwillingness, to reduce their huge debts.\n\nBarring a major external shock – and there are plenty of candidates to supply one – 2025 could be a placid year for the world economy. Global GDP will expand by 3.2 percent – keeping pace with 2024 and faster than the 2.9 percent recorded in 2019, according to the International Monetary Fund. Advanced economies are on course to grow by 1.8 percent in 2025, not far from the 1.9 percent cruising speed they had reached in the nine years prior to the pandemic. For all latest news, follow The Daily Star's Google News channel. \nAdmittedly, world growth will still be below its long-term average, largely because China's days as an economic locomotive are behind it. And developed economies' performances will vary widely, with yet another strong showing by the United States offsetting weakness in Europe and Japan. Still, the relatively benign outlook should also be accompanied by subdued price growth. Inflation will be around the 2 percent level targeted by major central banks in all advanced economies in 2025, the IMF reckons.\n\nThis economic environment is usually blissful for central bankers. After playing the Grinch for a couple of years, squeezing living standards with sharp hikes in interest rates, the likes of U.S. Federal Reserve Chair Jerome Powell and European Central Bank President Christine Lagarde should be in a position to dole out presents to citizens and businesses by lowering borrowing costs. Indeed, the Fed, the ECB and the Bank of England have all begun cutting rates and markets expect them to continue doing so in the next 12 months.\n\nIn normal times, steady growth, low inflation and falling rates would have another positive outcome: encouraging governments to cut public debt. But politicians, especially in developed countries, will squander the chance to tighten their belts.\nThat's not because the world's fiscal house is in order. In fact, it resembles a family home after teenage kids staged a party while their parents were away for the weekend. The IMF calculates that global public debt is on course to hit 100 percent of GDP – 10 percentage points above the 2019 level – by the end of the decade. Countries accounting for 75 percent of world GDP, including the United States, Japan, France, Italy, China and Brazil, are set to run large budget deficits of more than 3 percent of GDP until 2026 at least. And their plans to reduce their budgetary shortfalls between now and 2029 are four times smaller than what the IMF recommends.\nIn other words, the political masters of the biggest economies have embraced a near-permanent state of fiscal expansion. And they are not rowing back any time soon, as austerity is a sure-fire vote loser. Alberto Alesina and other economists found that a package of tax increases worth 1 percent of GDP reduces the vote share of the governing party by 7 percent on average at the following election.\n\nBelts are already starting to loosen. In the United States, the policies pledged by President-elect Donald Trump would add up to $15 trillion to an already huge budget deficit by 2035, according to the non-partisan Committee for a Responsible Federal Budget. In Britain, the Labour government presented plans to increase public expenditures by almost 70 billion pounds a year until 2029 – and said it would fund half of that through more borrowing. Germany may follow suit, with a February election likely to usher in a freer-spending government. In Europe, seven countries, including heavyweights France and Italy, are in breach of the bloc's budgetary rules.\nPoliticians' penchant for fiscal expansion, and its inflationary effects, leaves central bankers with two unpalatable options. The first is to simply close one eye to deficits and debt, keep lowering rates and live with inflation above their 2 percent target. That's a path few rate-setters will take because they fear that tolerating elevated prices would lead to persistently high inflation, with dire consequences for both their credibility and living standards. Powell, Lagarde and their peers were roundly criticised for letting prices spiral out of control in 2022 and 2023.\nThe second option is to stop cutting rates much earlier than markets expect and start raising them again at the first glimmer of rising inflation. The United Kingdom is already showing the way: investors reacted to the government's spending plans by betting that the Bank of England would abandon one of its expected rate cuts, according to derivatives prices collected by LSEG. Yet as the global fiscal expansion gathers steam in 2025, investors will have to dial back even further their hopes for looser policy. That will keep markets volatile, and government bond yields will stay elevated, driving up funding costs. As politicians insist on walking towards the fiscal abyss, homebuyers, bond investors and businesses will pay a high price.\n\n Click to comment\n\n Global Economy\n\n Global Economy \n\n Politicians will hinder central banks’ easing plan\n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:18 AM \n\n REUTERS, London\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:18 AM \n\n The US Federal Reserve building is seen in Washington. There are some ideal conditions for central banks around the world to lower interest rates this year. Photo: REUTERS/FILE\n\n In 2025, the global economy will be in a much better place than at any time since the outbreak of Covid-19. Growth will be solid, and inflation will finally abate. Those are ideal conditions for central banks to lower interest rates. But the virtuous circle of an easier monetary policy feeding faster expansion will hit a big snag: governments' inability, or unwillingness, to reduce their huge debts.\n\nBarring a major external shock – and there are plenty of candidates to supply one – 2025 could be a placid year for the world economy. Global GDP will expand by 3.2 percent – keeping pace with 2024 and faster than the 2.9 percent recorded in 2019, according to the International Monetary Fund. Advanced economies are on course to grow by 1.8 percent in 2025, not far from the 1.9 percent cruising speed they had reached in the nine years prior to the pandemic. For all latest news, follow The Daily Star's Google News channel. \nAdmittedly, world growth will still be below its long-term average, largely because China's days as an economic locomotive are behind it. And developed economies' performances will vary widely, with yet another strong showing by the United States offsetting weakness in Europe and Japan. Still, the relatively benign outlook should also be accompanied by subdued price growth. Inflation will be around the 2 percent level targeted by major central banks in all advanced economies in 2025, the IMF reckons.\n\nThis economic environment is usually blissful for central bankers. After playing the Grinch for a couple of years, squeezing living standards with sharp hikes in interest rates, the likes of U.S. Federal Reserve Chair Jerome Powell and European Central Bank President Christine Lagarde should be in a position to dole out presents to citizens and businesses by lowering borrowing costs. Indeed, the Fed, the ECB and the Bank of England have all begun cutting rates and markets expect them to continue doing so in the next 12 months.\n\nIn normal times, steady growth, low inflation and falling rates would have another positive outcome: encouraging governments to cut public debt. But politicians, especially in developed countries, will squander the chance to tighten their belts.\nThat's not because the world's fiscal house is in order. In fact, it resembles a family home after teenage kids staged a party while their parents were away for the weekend. The IMF calculates that global public debt is on course to hit 100 percent of GDP – 10 percentage points above the 2019 level – by the end of the decade. Countries accounting for 75 percent of world GDP, including the United States, Japan, France, Italy, China and Brazil, are set to run large budget deficits of more than 3 percent of GDP until 2026 at least. And their plans to reduce their budgetary shortfalls between now and 2029 are four times smaller than what the IMF recommends.\nIn other words, the political masters of the biggest economies have embraced a near-permanent state of fiscal expansion. And they are not rowing back any time soon, as austerity is a sure-fire vote loser. Alberto Alesina and other economists found that a package of tax increases worth 1 percent of GDP reduces the vote share of the governing party by 7 percent on average at the following election.\n\nBelts are already starting to loosen. In the United States, the policies pledged by President-elect Donald Trump would add up to $15 trillion to an already huge budget deficit by 2035, according to the non-partisan Committee for a Responsible Federal Budget. In Britain, the Labour government presented plans to increase public expenditures by almost 70 billion pounds a year until 2029 – and said it would fund half of that through more borrowing. Germany may follow suit, with a February election likely to usher in a freer-spending government. In Europe, seven countries, including heavyweights France and Italy, are in breach of the bloc's budgetary rules.\nPoliticians' penchant for fiscal expansion, and its inflationary effects, leaves central bankers with two unpalatable options. The first is to simply close one eye to deficits and debt, keep lowering rates and live with inflation above their 2 percent target. That's a path few rate-setters will take because they fear that tolerating elevated prices would lead to persistently high inflation, with dire consequences for both their credibility and living standards. Powell, Lagarde and their peers were roundly criticised for letting prices spiral out of control in 2022 and 2023.\nThe second option is to stop cutting rates much earlier than markets expect and start raising them again at the first glimmer of rising inflation. The United Kingdom is already showing the way: investors reacted to the government's spending plans by betting that the Bank of England would abandon one of its expected rate cuts, according to derivatives prices collected by LSEG. Yet as the global fiscal expansion gathers steam in 2025, investors will have to dial back even further their hopes for looser policy. That will keep markets volatile, and government bond yields will stay elevated, driving up funding costs. As politicians insist on walking towards the fiscal abyss, homebuyers, bond investors and businesses will pay a high price.\n\n Click to comment\n\n |ভারতবাংলাদেশিদের ভিসা কমিয়ে ভারতে বিদেশি রোগী অর্ধেকে নেমেছেবাংলাদেশিদের ভিসা দেওয়া কমিয়ে দেওয়ায় ভারতের হাসপাতালগুলোতে বিদেশি রোগীর সংখ্যা প্রায় অর্ধেকে নেমে গেছে বলে জানিয়েছে সংবাদমাধ্যম আল জাজিরা। ৬ ঘণ্টা আগে |রাজনীতিদেশে নতুন করে ষড়যন্ত্র ও চক্রান্ত শুরু হয়েছে: মির্জা ফরুখল ৮ ঘণ্টা আগে","url":"https://www.thedailystar.net/business/global-economy/news/politicians-will-hinder-central-banks-easing-plan-3791921","image":"https://www.thedailystar.net/sites/default/files/styles/very_big_201/public/images/2025/01/05/us_fed.jpg","video":null,"publish_date":"2025-01-05 00:23:17","author":"Global Economy","authors":["Global Economy"],"language":"en","category":"politics","source_country":"bd","sentiment":0.184},{"id":278323184,"title":"Gold slips from three-week high","text":"Global Economy \n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:31 AM \n\n Most Viewed\n\n Global Economy\n\n Global Economy \n\n Gold slips from three-week high\n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:31 AM \n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:31 AM \n\n Gold prices retreated from a three-week high on Friday, pressured by a robust dollar, while markets braced for potential economic and trade shifts under US President-elect Donald Trump.\n\nSpot gold eased 0.6 percent to $2,641.52 an ounce at 01:41 p.m. ET (1841 GMT), after hitting its highest level since Dec. 13 earlier in the session. Bullion is up about 0.8 percent for the week so far. For all latest news, follow The Daily Star's Google News channel. \nUS gold futures settled 0.5 percent lower at $2,654.70.\n\nThe new president's agenda that supports higher tariffs has boosted the dollar and created significant underlying pressure on metal markets, said Nitesh Shah, commodity strategist at WisdomTree.\n\nThe dollar index was set for its strongest weekly performance since mid-November, making gold pricier for overseas buyers.\n\"For most of the metals, the slowing of global trade has typically been coupled with a slowing economy and therefore slowing demand for metals,\" Shah said, referring to the potential impact of Trump's proposed trade tariffs.\nA headwind from a stronger dollar is likely to persist for gold, but it looks like debt will continue rising in the US and other countries, and geopolitical issues aren't going to end soon, so it should stay supported, he added.\n\nTrump is set to take the oath of office on Jan. 20. His proposed tariffs and protectionist policies are expected to fuel inflation.\nThis could slow the US Federal Reserve's interest rate cuts, limiting gold's upside. After three rate cuts in 2024, the Fed projects only two reductions in 2025 due to persistent inflation.\nGold, which thrives in low-rate environments, is currently benefiting from seasonal demand.\n\n Click to comment\n\n Global Economy\n\n Global Economy \n\n Gold slips from three-week high\n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:31 AM \n\n Sun Jan 5, 2025 12:00 AM Last update on: Sun Jan 5, 2025 01:31 AM \n\n Gold prices retreated from a three-week high on Friday, pressured by a robust dollar, while markets braced for potential economic and trade shifts under US President-elect Donald Trump.\n\nSpot gold eased 0.6 percent to $2,641.52 an ounce at 01:41 p.m. ET (1841 GMT), after hitting its highest level since Dec. 13 earlier in the session. Bullion is up about 0.8 percent for the week so far. For all latest news, follow The Daily Star's Google News channel. \nUS gold futures settled 0.5 percent lower at $2,654.70.\n\nThe new president's agenda that supports higher tariffs has boosted the dollar and created significant underlying pressure on metal markets, said Nitesh Shah, commodity strategist at WisdomTree.\n\nThe dollar index was set for its strongest weekly performance since mid-November, making gold pricier for overseas buyers.\n\"For most of the metals, the slowing of global trade has typically been coupled with a slowing economy and therefore slowing demand for metals,\" Shah said, referring to the potential impact of Trump's proposed trade tariffs.\nA headwind from a stronger dollar is likely to persist for gold, but it looks like debt will continue rising in the US and other countries, and geopolitical issues aren't going to end soon, so it should stay supported, he added.\n\nTrump is set to take the oath of office on Jan. 20. His proposed tariffs and protectionist policies are expected to fuel inflation.\nThis could slow the US Federal Reserve's interest rate cuts, limiting gold's upside. After three rate cuts in 2024, the Fed projects only two reductions in 2025 due to persistent inflation.\nGold, which thrives in low-rate environments, is currently benefiting from seasonal demand.\n\n Click to comment\n\n |ভারতবাংলাদেশিদের ভিসা কমিয়ে ভারতে বিদেশি রোগী অর্ধেকে নেমেছেবাংলাদেশিদের ভিসা দেওয়া কমিয়ে দেওয়ায় ভারতের হাসপাতালগুলোতে বিদেশি রোগীর সংখ্যা প্রায় অর্ধেকে নেমে গেছে বলে জানিয়েছে সংবাদমাধ্যম আল জাজিরা। ৬ ঘণ্টা আগে |রাজনীতিদেশে নতুন করে ষড়যন্ত্র ও চক্রান্ত শুরু হয়েছে: মির্জা ফরুখল ৮ ঘণ্টা আগে","url":"https://www.thedailystar.net/business/global-economy/news/gold-slips-three-week-high-3791916","image":"https://www.thedailystar.net/sites/default/files/styles/very_big_201/public/images/2025/01/01/afp_gold.jpg","video":null,"publish_date":"2025-01-05 00:23:17","author":"Reuters","authors":["Reuters"],"language":"en","category":"business","source_country":"bd","sentiment":-0.325},{"id":278324984,"title":"Donald Trump frustrated flags will fly at half-staff on inauguration day to honor Jimmy Carter","text":"President-elect Donald Trump has expressed frustration that flags will be flying at half-staff when he takes office later this month.\n\nIt's an action put in place by President Joe Biden to honor the late President Jimmy Carter, who died Sunday at 100. It's not a timeline that Trump can do anything about - until after he takes office.\n\nHere's what to know about why flags are lowered when a president dies, who can issue that order and how long the process lasts:\n\nWhy are U.S. flags being flown at half-staff?\n\nOn Sunday, Biden ordered that U.S. flags be flown at half-staff in honor of the late former president. It's an honor that indicates that the country or a state is in mourning.\n\nThe U.S. flag code lays out parameters for lowering the U.S. flag to half-staff, including a 30-day period for current or former presidents to cover flags at federal government buildings and their grounds, as well as at U.S. embassies and other facilities abroad, including military installations and vessels.\n\nFlags can be lowered to commemorate the deaths of other officials, including the vice president, Supreme Court justices and members of Congress, although those periods aren't as long.\n\nFlags can also be ordered lowered in other circumstances, including a national tragedy or on Memorial Day.\n\nSince U.S. flag code states that no flag should fly higher than the American flag on the same pole or nearby, state flags get lowered during those periods, too.\n\nHow long will flags be lowered?\n\nAccording to Biden's proclamation, U.S. flags will be lowered for 30 days from Carter's death, until Jan. 28.\n\nWith the inauguration on Jan. 20, that means that flags will be at half-staff when Trump takes office and for the first week of his administration.\n\nWho decides when to lower flags?\n\nAccording to the U.S. General Services Administration, the president, a governor and the mayor of the District of Columbia can order U.S. flags to be flown at half-staff.\n\nWhat has Trump said about flags being lowered?\n\nOn Friday, Trump posted on social media that \"Democrats are all 'giddy'\" about the notion that flags will be lowered when he takes office as president.\n\n\"Nobody wants to see this,\" Trump wrote. He added that \"no American can be happy about it. Let's see how it plays out. MAKE AMERICA GREAT AGAIN!\"\n\nAsked about Trump's post at Friday's briefing, White House press secretary Karine Jean-Pierre said Biden would not consider reversing or reevaluating the half-staff plans.\n\nCan Trump decide to raise the flags?\n\nYes. U.S. flag code dictates that flags remain lowered for the 30-day period from the death of a former president. But that code isn't mandatory, so once he becomes president, Trump could technically override it.\n\nThat's what happened in February 1973, when then-President Richard Nixon opted to raise flags - which he had ordered lowered in mourning following the death of former President Lyndon Johnson - before the 30-day mark to honor the first American prisoners of war released from Vietnam. The hiatus only lasted a day, and flags went back to half-staff thereafter for eight days.\n\nFlags had also been at half-staff when Nixon was sworn in for his second term in January 1973, due to Nixon having ordered them lowered after the death of former President Harry S. Truman.\n\nHas Trump taken issue with lowering flags before?\n\nYes. After the death of Arizona Republican Sen. John McCain - with whom Trump had a fractious relationship - in 2018, the Stars and Stripes were briefly lowered to half-staff over the weekend but went back up to full height the following Monday, while flags at the U.S. Capitol and elsewhere stayed at half-staff.\n\nThe flag was lowered again to half-staff after complaints from people in both the Republican and Democratic parties. Former presidents spoke at McCain's funeral, but the senator's family made clear they did not want Trump to attend.","summary":"President Joe Biden ordered flags to fly at half-staff to honor the late President Jimmy Carter, who died Sunday at 100. It's not a timeline that Trump can do anything about - until after he takes office.","url":"https://abc7.com/post/inauguration-day-2025-president-elect-donald-trump-frustrated-flags-will-fly-half-staff-honor-jimmy-carter/15754258/","image":"https://cdn.abcotvs.com/dip/images/15754294_010425-ap-white-house-flags-img.jpg?w=1600","video":null,"publish_date":"2025-01-05 00:21:46","author":"Meg Kinnard","authors":["Meg Kinnard"],"language":"en","category":"politics","source_country":"US","sentiment":-0.44},{"id":278322818,"title":"Washington Post cartoonist resigns over paper's refusal to publish satirical cartoon of Bezos and Trump","text":"Pulitzer Prize-winning cartoonist Ann Telnaes announced on Friday she had resigned from The Washington Post after the newspaper refused to publish a satirical cartoon depicting billionaire Post owner Jeff Bezos on bended knee in front of President-elect Donald Trump.\n\nTalnaes, who had been with The Post since 2008, wrote in a Substack post announcing her resignation that, \"I have had editorial feedback and productive conversations—and some differences—about cartoons I have submitted for publication, but in all that time I've never had a cartoon killed because of who or what I chose to aim my pen at. Until now.\"\n\nThe cartoon depicted Bezos, Meta founder Mark Zuckerberg and OpenAI chief Sam Altman on their knees, handing over bags of cash to a statue of Trump next to a lipstick-holding Los Angeles Times owner Patrick Soon-Shiong and bowing Mickey Mouse.\n\nREAD MORE: Arsonists light home on fire three nights in a row\n\nTalnaes said the cartoon \"criticises the billionaire tech and media chief executives who have been doing their best to curry favour with incoming President-elect Trump,\" satirising \"these men with lucrative government contracts and an interest in eliminating regulations making their way to Mar-a-lago\".\n\nThe Post's refusal to run the cartoon, Talnaes said, was a \"game changer…and dangerous for a free press\".\n\nDavid Shipley, The Post's opinions editor, said in a statement that he respected Telnaes, \"but I must disagree with her interpretation of events.\"\n\n\"Not every editorial judgment is a reflection of a malign force,\" he said. \"My decision was guided by the fact that we had just published a column on the same topic as the cartoon and had already scheduled another column – this one a satire – for publication. The only bias was against repetition.\"\n\nREAD MORE: Bodies of British woman and her fiance found inside Vietnam villa﻿\n\nThe resignation marked the latest high-profile departure from The Post, which has seen several members of its editorial board step down and star reporters exit after Bezos killed an endorsement of Vice President Kamala Harris just weeks before the November election. Bezos' controversial decision led to a tidal wave of reader backlash, with The Post reporting more than 250,000 readers cancelling their subscriptions.\n\nLast month, Bezos dined with Trump at his Mar-a-Lago club in Florida and Amazon announced it would donate $1 million to Trump's inauguration. Disney, the parent company of ABC, settled a defamation suit brought by Trump for $15 million in a highly scrutinized decision. And Facebook and Instagram parent Meta said that it was donating $1 million to Trump's inaugural fund after Zuckerberg met with Trump privately.\n\nThe Los Angeles Times, owned by biotech billionaire Soon-Shiong, also announced in October it would not publish its endorsement of Harris, leading to a subscriber revolt and resignation of all but one member of its seven-member editorial board.","url":"https://www.9news.com.au/world/washington-post-cartoonist-resigns-over-papers-refusal-to-publish-satirical-cartoon-of-bezos-and-trump/0accc40c-b113-4112-a1b2-1bdd0d2eca72","image":"https://imageresizer.static9.net.au/rOLI3WqVDMorQfhf2EjtpEwYRq0=/0x0:3000x1687/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fa018f332-903f-4657-a1ca-baea5d23e876","video":null,"publish_date":"2025-01-05 00:21:12","author":null,"language":"en","category":"politics","source_country":"au","sentiment":0.134},{"id":278322816,"title":"Hillary Clinton, George Soros and Denzel Washington received the highest US civilian honour","text":"In the East Room of the White House on a particularly frigid Saturday afternoon, President Joe Biden bestowed the Presidential Medal of Freedom to 19 of the most famous names in politics, sports, entertainment, civil rights, LGBTQ+ advocacy and science.\n\nFormer Secretary of State Hillary Clinton aroused a standing ovation from the crowd as she received her medal.\n\nClinton was accompanied to the event by her husband former President Bill Clinton, daughter Chelsea Clinton and grandchildren.\n\nREAD MORE: Arsonists light home on fire three nights in a row\n\nDemocratic philanthropist George Soros and actor-director Denzel Washington were also awarded the nation's highest civilian honour in a White House ceremony.\n\n\"For the final time as president I have the honour bestowing the Medal of Freedom, our nation's highest civilian honour, on a group of extraordinary, truly extraordinary people, who gave their sacred effort, their sacred effort, to shape the culture and the cause of America,\" Biden said in his opening remarks.\n\n\"Let me just say to each of you, thank you, thank you, thank you for all you've done to help this country,\" Biden said on Saturday.\n\nREAD MORE: Indian skipper's injury revealed after 'devastating' exit﻿\n\nFour medals were awarded posthumously.\n\nThey went to George W. Romney, who served as both a Michigan governor and secretary of housing and urban development; former Attorney General and Sen. Robert F. Kennedy; Ash Carter, a former secretary of defence; and Fannie Lou Hamer, who founded the Mississippi Freedom Democratic Party and laid the groundwork for the 1965 Voting Rights Act.\n\nKennedy is father to Robert F. Kennedy Jr., President-elect Donald Trump's nominee for health and human services secretary.\n\nBiden said, \"Bobby is one of my true political heroes. I love and I miss him dearly\".\n\nRomney is the father of former Utah Republican Sen. Mitt Romney, one of Trump's strongest conservative critics.\n\nBiden has days left in the Presidential office and has spent the last few days issuing awards and medals to valiant military veterans, courageous law enforcement officials and exceptional Americans.\n\nThe White House said the Medal of Freedom recipients have made \"exemplary contributions to the prosperity, values, or security of the United States, world peace, or other significant societal, public or private endeavors\".\n\nMajor philanthropists receiving the award include Spanish American chef José Andrés, whose World Central Kitchen charity has become one of the world's most recognized food relief organisations, and Bono, the front man for rock band U2 and a social justice activist.\n\nSoros' son Alex Soros accepted the medal on his father's behalf. In an emailed statement, Soros said: \"As an immigrant who found freedom and prosperity in America, I am deeply moved by this honour.\"\n\nSports and entertainment stars recognised include professional soccer player Lionel Messi, who did not attend the event; retired Los Angeles Lakers basketball legend and businessman Earvin \"Magic\" Johnson; actor Michael J. Fox, who is an outspoken advocate for Parkinson's disease research and development; and William Sanford Nye, known to generations of students as \"Bill Nye the Science Guy.\"\n\nOther awardees include conservationist Jane Goodall; longtime Vogue Magazine editor-in-chief Anna Wintour; American fashion designer Ralph Lauren; American Film Institute founder George Stevens Jr.; entrepreneur and LGBTQ+ activist Tim Gill; and David Rubenstein, co-founder of The Carlyle Group global investment firm.\n\nLauren is the first fashion designer to receive the honor.\n\nLast year, Biden bestowed the Presidential Medal of Freedom on 19 people, including the late Medgar Evers, House Speaker Emerita Nancy Pelosi, Rep. James Clyburn of South Carolina and actor Michelle Yeoh.\n\nThe Presidential Medal of Freedom was awarded 654 times between 1963 and 2024, according to the Congressional Research Service. Notable Medal of Freedom recipients from the past include Dr. Martin Luther King Jr., Maya Angelou and Mother Teresa.\n\nDOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.","url":"https://www.9news.com.au/world/hillary-clinton-george-soros-and-denzel-washington-received-the-highest-us-civilian-honor/9dcf5142-d988-4436-8679-f5afe9036482","image":"https://imageresizer.static9.net.au/P3lSsjWKgDh5OV9C4T4D4Cgi52A=/0x16:1024x592/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F2e89197e-dcbc-469b-a543-7fdf12dc032f","video":null,"publish_date":"2025-01-05 00:21:12","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"au","sentiment":0.27},{"id":278322314,"title":"Media maqedonase: Maqedonia e Veriut duhet ta ketë zili Shqipërinë","text":"Samiti i Komunitetit Politik Evropian do të mbahet në maj 2025 në Tiranë, ndërsa samiti i NATO-s pritet të mbahet në 2027 po në Tiranë, shkruan faqja maqedonase novatv.mk.\n\nSipas shumë operatorëve Shqipëria po ecën me ritme të pandalshme. Vetëm këtë vit aeroporti i Tiranës këtë vit arriti të priste 10 milionë pasagjerë.\n\nKy pasqyrim nuk është një lëvdatë për Shqipërinë, por vetëm një përfaqësim që çdo shtet punon për veten e vet duke prezantuar veten dhe tërhequr miq, politikanë dhe biznese ndërkombëtare.\n\nPor, secili shtet për sa i përket aspiratave evropiane ka problemet e veta: dikush ka kushte si Maqedonia e Veriut që nuk dëshiron t’i respektojë: dikush është kushtëzuar nga koncesionet në kufirin detar (siç bëri Greqia me Shqipërinë): Kroacia i kërkon Malit të Zi të respektojë shtetasit kroatë që mbaheshin si robër lufte në fillim të viteve 1990 e tjerë.\n\nMaqedonia e Veriut është në konflikt me fqinjët (ai me Bullgarinë është më i ndërlikuari), por më e rëndësishme duket se jemi në konflikt me veten tonë.\n\n”MV tashmë duhet ta ketë zili Shqipërinë, jo vetëm në rrugën e saj drejt BE-së, por edhe në rrjetet ndërkombëtare, ndërkohë që ne po kërkojmë një rrugëdalje nga ngërçi në të cilin kemi ngecur në integrimin evropian”, theksojnë burime nga Maqedonia e Veriut.\n\nKa më shumë përgjigje pozitive sesa negative.\n\nËshtë e habitshme se si vendi i vetmuar dhe i mbyllur ballkanik dikur (pothuajse i harruar nga të gjithë), shndërrohet në një destinacion mjaft tërheqës për turistët, biznesmenët, politikanët dhe ushtritë.\n\nNëse duam t’i shohim realisht ngjarjet, duhet të distancohemi nga njohuritë tona, e bashkë me të edhe nga paragjykimet, për shembjen e piramidave në vitin 1997 në Shqipëri, për trazirat në Vlorë dhe qytete të tjera.\n\nMë 30 dhjetor, kryeministri Rama njoftoi se Tirana do të jetë pritëse e samitit të NATO-s 2027.\n\nSamiti i NATO-s, ku duhet të mbërrijnë shtetarët më të fuqishëm, përfaqëson një sfidë të pabesueshme për çdo vend, nga pikëpamja organizative, e sigurisë, e transportit dhe e pritjes.\n\nDhe mbi të gjitha një samit në të cilin do të duhet të vijë presidenti i ri amerikan, Donald Trump.\n\n“Para disa vitesh ishte e pamendueshme që Tirana të priste samitin e NATO-s në 2027. Por, kjo është arsyeja pse ne filluam bashkëpunimin me NATO-n. Misioni për të verifikuar kushtet e infrastrukturës dhe logjistikës erdhi në Tiranë dhe bëri vlerësime që do të kishin qenë të pamundura përpara se qeveria së bashku me autoritetet bashkiake të Tiranës të ndërtonin shumë gjëra në dekadën e fundit. Ardhja e presidentit amerikan dhe të gjithë liderëve të NATO-s është njëkohësisht një mesazh i qartë se të gjithë janë të lidhur me Shqipërinë. Ne jemi një vend i vogël, por sot trajtohemi si të barabartë dhe me një respekt që nuk e kemi pasur në historinë tonë”, thekson kryeministri Rama.\n\nVitin e kaluar, NATO përfundoi modernizimin e bazës ajrore të Kuçovës, e cila do të shërbejë si një qendër kryesore ajrore për aleancën. NATO investoi 50 milionë euro në rinovimin e kullës së kontrollit, pistat, hangarët dhe magazinat.\n\nShtatorin e kaluar, ministri shqiptar i Mbrojtjes deklaroi se qeveria kishte miratuar 54 milionë euro për ndërtimin e një baze detare të NATO-s në zonën e Porto Romanos në veriperëndim të Durrësit, nga një investim total prej 390 milionë eurosh të planifikuar për ndërtimin e një kompleks i ri portual.\n\nShqipëria është një vend i vogël: ka 2,4 milionë banorë dhe është pak më i madh se MV. Nuk do të jetë hera e parë që Shqipëria organizon një tubim të madh ndërkombëtar. Aty u mbajt edhe samiti i Procesit të Berlinit në tetor 2023.\n\nSi një përgatitje e rëndësishme për Samitin e NATO-s në maj të këtij viti, në Tiranë do të mbahet edhe Samiti i Komunitetit Politik Evropian. Ky do të jetë takimi i gjashtë radhazi i nismës së nisur nga presidenti francez Emmanuel Macron, ku të gjitha vendet e BE-së, kandidatët për anëtarësim (ata që janë duke negociuar dhe ata që nuk kanë negociuar ende), por edhe vendet që kanë marrëdhënie të ndryshme me Bashkimin Evropian si Britania e Madhe dhe Zvicra.\n\nËshtë një sfidë e pabesueshme nga pikëpamja logjistike dhe e sigurisë. Samiti i fundit i Komunitetit Politik Evropian u mbajt vitin e kaluar në nëntor në Budapest në stadiumin e madh “Arena Puskas”, pikërisht për shkak të sfidave të mëdha politike, të sigurisë dhe logjistikës.\n\nVitin e kaluar, në mars, në Tiranë u mbajt një samit i Evropës Juglindore plus Ukrainën dhe presidenti Volodymyr Zelenski vajti në kryeqytetin shqiptar.\n\nNë dhjetor 2022, u mbajt në Tiranë samiti BE-Ballkani Perëndimor, i pari i këtij lloji në rajon, i cili i dha shkas deklaratës së famshme të Tiranës për anëtarësimin e Ballkanit Perëndimor në BE.\n\nKa shumë tubime të tjera të këtij lloji që mbahen në Tiranë, por të tjera nuk i rendisim.\n\nTirana është tashmë një vend i njohur në hartën politike në Evropë.\n\nQë kur Shqipëria u shkëput nga Maqedonia në rrugën e saj drejt BE-së, ajo tashmë ka hapur dy kapituj, një në tetor dhe tjetrin në dhjetor.\n\n“Marshi ynë vazhdon. Ne jemi këtu për të bërë një hap të rëndësishëm dhe për të hapur një kapitull të ri të rugëtimit, i rëndësishëm për planin tonë. Kjo sepse gjërat po shkojnë sipas planit. Ne duhet të ecim përpara”, theksoi kryeministri Rama.\n\nFalë pozicionit të saj të jashtëzakonshëm, në portën e Otrantos, ku bashkohen detet Adriatik dhe Jon, Shqipëria ka qenë një magnet për investime në dhjetë vitet e fundit, më të larta se ato të Maqedonisë.\n\nSipas të dhënave nga organi tregtar i Kombeve të Bashkuara, UNCTAD, nga viti 2018 deri në vitin 2022, në Shqipëri kanë ndodhur investime të huaja direkte mesatare vjetore prej 1,27 miliardë dollarësh.\n\nSipas Departamentit të Shtetit, në vitin 2023 investimet e huaja direkte do të arrijnë në 1.6 miliardë dollarë dhe shifra totale e tyre do të jetë 14 miliardë dollarë.\n\nNdryshe nga sa mendon qytetari mesatar maqedonas, pra se italianët janë investitorët kryesorë në Shqipëri, faktet tregojnë të kundërtën.\n\nNë Shqipëri Zvicra, Holanda dhe Kanadaja janë burimet më të mëdha të investimeve të huaja direkte, të ndjekura nga Italia, Turqia dhe Austria.\n\nInvestimet janë të përqendruara në sektorin e pasurive të paluajtshme, në industrinë nxjerrëse, në sektorin bankar, të sigurimeve dhe të energjisë.\n\nEkonomia e Shqipërisë është rritur me shpejtësi vitet e fundit.\n\nTë dhënat zyrtare të Bankës Botërore tregojnë se në vitin 2023 PBB-ja e Shqipërisë ishte 22,98 miliardë dollarë dhe për vitin 2024 parashikimi është 26,18 miliardë dollarë.\n\nGDP për frymë në vitin 2023 ishte 8,367 dollarë, në 2024 do të jetë 10,586.\n\nTirana – qendra aeronautike e Ballkanit\n\nAeroporti “Nënë Tereza” i Tiranës është një nga qendrat ajrore më të ngarkuara dhe me rritjen më të shpejtë në rajon. Dhe nga vendet që janë dhe nuk janë pjesë e BE-së. Dhe sidomos kur krahasohet me madhësinë e vetë qytetit të Tiranës.\n\nSipas të dhënave të organizatave dhe mediave që monitorojnë trafikun ajror, rreth 10 milionë pasagjerë janë transportuar përmes aeroportit të Tiranës në vitin 2024. Më shumë se aeroportet e Beogradit dhe Sofjes. Dhe të mos flasim për Shkupin.\n\nSipas të dhënave të website-it të specializuar VoliFrom, përmes aeroportit të Tiranës shërbehen 84 destinacione me 31 linja ajrore. Për shembull, ka shtatë linja ajrore për në Britaninë e Madhe dhe 17 për në Itali.\n\nVitet e fundit, aeroporti i Tiranës është përdorur gjerësisht nga qytetarët maqedonas për të udhëtuar nëpër botë apo për pushime, veçanërisht nga ata që jetojnë në pjesën jugperëndimore të vendit.\n\nSigurisht që deti i Shqipërisë është magneti kryesor për turistët e huaj. Në vitin 2024, 13 milionë turistë të huaj vizituan Shqipërinë dhe rreth 800 000 vizituan MV. Ata qytetarë maqedonas që pesë vite më parë ishin në bregdetin shqiptar në Sarandë apo Vlorë dhe që u kthyen verën e kaluar nuk do të njohin shumë gjëra për shkak të projekteve të mëdha të investimeve.\n\nNjë javë përpara se të njoftonte se samiti i NATO-s 2027 do të mbahet në Tiranë, kryeministri shqiptar Edi Rama njoftoi një tjetër lajm befasues për promovimin e jashtëzakonshëm të vendit të tij.\n\nGara e madhe e çiklizmit ”Giro d’Italia 2025” do të ketë fazën hapëse në Shqipëri. Jo vetëm starti, por edhe tre etapat e para do të jenë në Shqipëri.\n\n”Giro d’Italia” së bashku me ”Tour de France” janë dy garat legjendare të çiklizmit që demonstrojnë rezistencën, njohuritë dhe profesionalizmin spektakolar të atletëve.\n\nKëto gara kanë kapacitetin të bëjnë shumë më tepër për promovimin ndërkombëtar të vendit sesa të gjitha broshurat dhe deklaratat propagandistike turistike dhe politike.\n\nPër shkak të mënyrës së transmetimit të garave (përfshirë pamjet nga helikopterët) është një mundësi për të paraqitur bukurinë e vendit në një mënyrë dhe në një kohë që nuk është e mundur në raste të tjera.\n\nDuhet shtuar se ”Giro d’Italia”, me traditën e saj 114-vjeçare, është e aksesueshme për 800 milionë shikues në mbarë botën përmes 200 stacioneve televizive që transmetojnë drejtpërdrejt garën.\n\nKjo do të thotë se shumë mund të dëgjojnë për herë të parë për Shqipërinë, të mësojnë diçka për të dhe të inkurajohen të vizitojnë vendin.\n\nEtapa e parë do të nisë më 9 maj në qytetin port të Durrësit dhe do të përfundojë në Tiranë në një itinerar kodrinor. Tirana do të presë një provë individuale kohore prej 13.7 km për fazën 2, më pas faza 3 më 11 maj do të jetë një tjetër etapë kodrinore 160 km, që fillon dhe përfundon në qytetin bregdetar të Vlorës, i cili ndodhet direkt nga ana tjetër e Adriatikut, përballë rajonit italian të Pulias ku gara do të rifillojë më 13 maj pas një dite pushimi.\n\nNjoftimi erdhi pasi programi i kryeministres italiane, Giorgia Meloni për të kontrolluar azilkërkuesit jashtë kufijve të Bashkimit Evropian në një kamp të veçantë në Shqipëri përballet me sfida ligjore.\n\nMegjithatë, në maj, mijëra njerëz nga MV dhe rajoni do të dynden në rrugët kodrinore rreth Vlorës dhe rrugëve të Tiranës për të parë çiklistët më të mirë të planetit në garën tepër sfiduese trejavore./ Lexo.al","url":"https://noa.al/lajmi/2025/01/2481321.html","image":"https://noa.al//newsImages/2025/01/1736024508_111092351scalede1669388577288.jpg","video":null,"publish_date":"2025-01-05 00:17:54","author":null,"language":"en","source_country":"al","sentiment":0.035},{"id":278321882,"title":"XINHUA PICTURES OF THE YEAR 2024: WORLD NEWS (Part 2)","text":"XINHUA PICTURES OF THE YEAR 2024: WORLD NEWS (Part 2)\n\nCentral Asia News\n\nInternational News\n\nBusiness News\n\nSearch News\n\nSun, 05 Jan 2025\n\n«Back to Home\n\nXINHUA PICTURES OF THE YEAR 2024: WORLD NEWS (Part 2)\n\n03 Jan 2025, 02:28 GMT+10\n\nXINHUA PICTURES OF THE YEAR 2024: WORLD NEWS (Part 2)\n© Provided by Xinhua Passengers queue at check-in counters in Singapore's Changi Airport on July 19, 2024. A faulty software update from cybersecurity firm CrowdStrike on July 19, 2024 affected computers running Microsoft Windows at organizations, causing major IT outage, taking out banks, airlines and businesses globally. (Photo by Then Chih Wey/Xinhua)© Provided by Xinhua This photo shows then Hamas Politburo Chief Ismail Haniyeh (C) in Tehran, Iran, on July 30, 2024. Israel assassinated Haniyeh in Tehran on July 31, 2024. (Xinhua/Shadati)© Provided by Xinhua Camels run from the starting line during a race in El Alamein City, Egypt, on July 31, 2024. (Xinhua/Ahmed Gomaa)© Provided by Xinhua A Ukrainian soldier bids farewell to his family member who came to visit him, at Kramatorsk train station, Donetsk, on Aug. 12, 2024. (Photo by Peter Druk/Xinhua)© Provided by Xinhua A dragon dance is staged at a reception celebrating the 50th anniversary of the establishment of diplomatic relations between China and Brazil in Brasilia, capital of Brazil, on Aug. 15, 2024. (Xinhua/Wang Tiancong)© Provided by Xinhua An aerial drone photo taken on Aug. 20, 2024 shows a view of the Redstone Concentrated Solar Thermal Power Project, built by SEPCOIII Electric Power Construction Corporation, a subsidiary of POWERCHINA, near Postmasburg in Northern Cape Province of South Africa. The 100 MW Redstone Concentrated Solar Thermal Power (CSP) Project is not only the first CSP project in sub-Saharan Africa, but also one of the largest renewable energy investment projects in South Africa. (Xinhua/Zhang Yudong)© Provided by Xinhua People pose for photos at the photo area of \"Black Myth: Wukong\" during Gamescom 2024 in Cologne, Germany, on Aug. 22, 2024. Considered the first Chinese-developed \"Triple-A\" title, \"Black Myth: Wukong\" topped the \"most-played games\" list on Steam, a leading gaming platform, merely an hour after its debut on Aug. 20, 2024. (Xinhua/Zhang Fan)© Provided by Xinhua Russian honor guards perform during the \"Spasskaya Tower\" International Military Music Festival in Moscow, Russia, on Aug. 23, 2024. (Xinhua/Cao Yang)© Provided by Xinhua J-10 fighter jets of China's Bayi Aerobatic Team fly over the Giza Pyramids scenic spot in Giza, Egypt, on Aug. 28, 2024. J-10 fighter jets of China's Bayi Aerobatic Team and one Y-20, China's domestically developed large transport aircraft, were in Egypt for the first edition of the Egypt International Airshow. (Xinhua/Sui Xiankai)© Provided by Xinhua Swarms of mayflies fly over a street in Szentendre, Hungary, on Sept. 1, 2024. (Photo by Attila Volgyi/Xinhua)© Provided by Xinhua Brazilian President Luiz Inacio Lula da Silva (L, above) attends a parade to celebrate the 202nd anniversary of independence in Brasilia, Brazil, on Sept. 7, 2024. (Xinhua/Wang Tiancong)© Provided by Xinhua Vehicles of Chinese brands are displayed at the 2024 Turin Auto Show in Turin, Italy, on Sept. 13, 2024. Many Chinese carmakers, including Dongfeng, Voyah, BYD and Chery, showcased their latest products at the three-day event that kicked off on Sept. 13, 2024. (Xinhua/Li Jing)© Provided by Xinhua Argentine President Javier Milei (C) sings the national anthem before his speech at the National Congress, in Buenos Aires, Argentina, on Sept. 15, 2024. Milei submitted the budget proposal for fiscal year 2025 to the National Congress. (Photo by Martin Zabala/Xinhua)© Provided by Xinhua A Hezbollah member holds a wireless communication device with its battery removed during a funeral for the victims in explosions of wireless communication devices, in Beirut, Lebanon, on Sept. 18, 2024. Israeli Prime Minister Benjamin Netanyahu on Nov. 10, 2024 officially took responsibility for a deadly attack targeting Hezbollah in September, in which thousands of pagers and walkie-talkies exploded across Lebanon and Syria. (Xinhua/Bilal Jawich)© Provided by Xinhua This photo taken on Sept. 18, 2024 shows a view of the Central Business District (CBD) of Egypt's new administrative capital, east of Cairo, Egypt. (Xinhua/Wang Dongzhen)© Provided by Xinhua Attendees walk in the venue of the Labour Party Conference in Liverpool, Britain, on Sept. 23, 2024. British Chancellor Rachel Reeves reassured the country during her 2024 Labour Party Conference speech on Sept. 23, 2024 that the United Kingdom would not return to austerity policies. (Xinhua/Li Ying)© Provided by Xinhua Attendees walk past a sculpture outside the venue of the Summit of the Future at the UN headquarters in New York, on Sept. 23, 2024. The two-day Summit of the Future concluded at the UN headquarters in New York on Sept. 23, 2024. The summit featured the adoption of the Pact for the Future and its annexes -- the Global Digital Compact and the Declaration on Future Generations. (Xinhua/Wu Xiaoling)© Provided by Xinhua Smoke traces are seen as an Israeli anti-missile system intercepts rockets fired from Lebanon, as seen from Safed, northern Israel, on Sept. 26, 2024. (Xinhua/Chen Junqing)© Provided by Xinhua Models present creations during the Prince Kung's Palace Fashion Show in Paris, France, on Sept. 28, 2024. The year 2024 marked the 60th anniversary of the establishment of diplomatic ties between China and France and the China-France Year of Culture and Tourism. (Xinhua/Gao Jing)© Provided by Xinhua This photo taken on Sept. 29, 2024 shows a broken doll on the ground after Israeli airstrikes in the southern suburbs of Beirut, Lebanon. (Xinhua/Bilal Jawich)© Provided by Xinhua A woman holding a cat is pictured near ruins after Israeli airstrikes in the southern suburbs of Beirut, Lebanon, on Oct. 2, 2024. (Xinhua/Bilal Jawich)© Provided by Xinhua Japanese Prime Minister Shigeru Ishiba (1st R, front row) attends a plenary session at the lower house of Japan's parliament in Tokyo, Japan, on Oct. 9, 2024. The lower house of Japan's parliament was officially dissolved on Oct. 9, 2024. (Xinhua/Zhang Xiaoyu)© Provided by Xinhua An aerial drone photo shows a view of Miraflores in Lima, Peru, on Oct. 9, 2024. (Xinhua/Li Muzi)© Provided by Xinhua This photo taken on Oct. 16, 2024 shows debris washed ashore on Coogee Beach in Sydney, Australia. The popular Coogee Beach in eastern Sydney was closed temporarily after mysterious black balls of debris were washed ashore. (Xinhua/Ma Ping)© Provided by Xinhua Smoke billows from a building after an Israeli airstrike in the southern suburb of Beirut, Lebanon, on Oct. 22, 2024. (Xinhua/Bilal Jawich)© Provided by Xinhua People clear a road after floods in Utiel, Spain, on Nov. 2, 2024. Torrential rains in October of 2024 triggered Spain's worst flooding in decades, claiming over 200 lives. (Xinhua/Meng Dingbo)© Provided by Xinhua A supporter of the Republican Party attends an election watch party in Fort Lauderdale, Florida, the United States, on Nov. 6, 2024. Republican candidate Donald Trump declared victory in the 2024 U.S. presidential election early Nov. 6, 2024. (Xinhua/Wu Xiaoling)© Provided by Xinhua Birds perch on a deer in Richmond Park in London, Britain, on Nov. 10, 2024. (Photo by Stephen Chung/Xinhua)© Provided by Xinhua A woman with two children rests in a tent at a center for displaced people in Port Sudan, Red Sea State, eastern Sudan, on Nov. 12, 2024. Fighting between the Sudanese Armed Forces and the paramilitary Rapid Support Forces, which began in mid-April of 2023, has killed more than 28,700 people. (Xinhua/Fayez Ezaki)© Provided by Xinhua A container is lifted at Chancay Port in Peru, on Nov. 14, 2024. The inauguration ceremony of Chancay Port was held on Nov. 14, 2024 local time. Chancay Port is not only an important project under Belt and Road cooperation, but also the first smart and green port in South America. (Xinhua/Li Mengxin)© Provided by Xinhua A supermoon rises in Rome, Italy, on Nov. 15, 2024. (Photo by Alberto Lingria/Xinhua)© Provided by Xinhua Robert Wood (C, front), deputy U.S. ambassador to the United Nations, votes against a UN Security Council draft resolution that calls for an immediate ceasefire in Gaza at the UN headquarters in New York, on Nov. 20, 2024. The 15-member council voted 14-1 in favor of the resolution, and the United States used its veto as a permanent council member to block it. (Xinhua/Xie E)© Provided by Xinhua A child with prosthetic limbs practices during a physiotherapy session at a rehabilitation center run by the International Committee of the Red Cross in Kabul, Afghanistan, on Nov. 26, 2024. War-ravaged Afghanistan is reportedly one of the most landmine-contaminated countries in the world, with dozens of people, mostly children, being killed and maimed every month. (Xinhua/Li Ang)© Provided by Xinhua This photo taken on Dec. 3, 2024 shows the 100,000th China-Europe freight train at Duisburg Intermodal Terminal in Duisburg, Germany. The 100,000th China-Europe freight train, coded X8083, which had departed from Chongqing of China, arrived in Duisburg of Germany on Dec. 3, 2024. (Xinhua/Du Zheyu)© Provided by Xinhua A video on Spring Festival is played during the 19th session of the Intergovernmental Committee for the Safeguarding of Intangible Cultural Heritage in Asuncion, Paraguay, on Dec. 4, 2024. The United Nations Educational, Scientific and Cultural Organization (UNESCO) on Dec. 4, 2024 inscribed Spring Festival, social practices of the Chinese people in celebration of traditional new year, on the Representative List of the Intangible Cultural Heritage of Humanity. (Xinhua/Zhu Yubo)© Provided by Xinhua People attend a rally to call for the impeachment of South Korean President Yoon Suk-yeol near the National Assembly in Seoul, South Korea, on Dec. 7, 2024. (Xinhua/Yao Qilin)© Provided by Xinhua People gather outside the restored Notre-Dame de Paris cathedral with the word \"Merci\" (Thank you) projected on it in Paris, France, on Dec. 7, 2024. Five years after being devastated by a fire, the restored Notre-Dame de Paris cathedral officially reopened in December. (Xinhua/Gao Jing)© Provided by Xinhua This photo taken on Dec. 8, 2024 shows thick smoke after an explosion in Damascus, Syria. The militant coalition led by Hayat Tahrir al-Sham seized full control of Damascus on Dec. 8, 2024 and toppled former President Bashar al-Assad's government. (Photo by Monsef Memari/Xinhua)© Provided by Xinhua Children try to receive food relief at a food distribution center in Gaza City, on Dec. 23, 2024. (Photo by Mahmoud Zaki/Xinhua)© Provided by Xinhua An aerial drone photo taken on Dec. 25, 2024 shows the plane crash site near Aktau, Kazakhstan. A passenger plane operated by Azerbaijan Airlines from Azerbaijan's Baku to Russia's Grozny crashed near the Kazakh city of Aktau on Dec. 25, 2024. Thirty-eight people were killed in the crash. (Photo by Azamat Sarsenbayev/Xinhua)© Provided by Xinhua A member of the South Korean rescue team works at the site of an airplane crash at the Muan International Airport, in South Korea, on Dec. 30, 2024. The Jeju Air flight 7C2216 crashed while landing at Muan International Airport, about 290 km southwest of Seoul, on Dec. 29, 2024. All the 179 people aboard the passenger jet were confirmed dead except only two rescued. (Photo by Jun Hyosang/Xinhua)\n\nShare article:\n\nAfghan aircraft stationed abroad not expected to be returned to Kabul: PentagonAfghan aircraft stationed outside the country are not expected to be returned to Kabul, according to the US Department of Defence.AfghanistanNews\n\n30 photos that really make you thinkHigh Tally|\nSponsoredSponsored\n\nBelly fat removal | search ads\n\nBelly Fat Removal Without Surgery in United States: The Price Might Surprise YouBelly fat removal | search ads|\nSponsoredSponsored\n\nSupplement Treatment | Search Ads\n\nSupplements for Older Men: Browse Affordable OptionsSupplement Treatment | Search Ads|\nSponsoredSponsored\n\nHouseCultures\n\nFemale Athletes Who Own the Red Carpet, RankedHouseCultures|\nSponsoredSponsored\n\nSponsored Ads\n\nSearch For Nectar Sleep Adjustable Bed Bundles at KohlsFind More DealsSponsored Ads|\nSponsoredSponsored\n\nMore Afghanistan News\n\nPakistan: Khyber Pakhtunkhwa police struggle to combat militant presence in southern districts\n\nAfghanistan News.Net\n\nPM Modi govt committed to revive historic, cultural heritage of Kashmir, will reclaim what has been lost: Amit Shah\n\nAfghanistan News.Net\n\nShane Watson opens up on importance of ICC Champions Trophy ahead of it's 2025 edition\n\nAfghanistan News.Net\n\nExplainer: What to make of the deadly U.S. New Orleans vehicle attack\n\nAfghanistan News.Net\n\nAsia Album: Oranges ripening in Nangarhar, Afghanistan\n\nAfghanistan News.Net\n\nFrom James Anderson to Ravichandran Ashwin, top 10 most heartbreaking retirements in cricket in 2024\n\nAfghanistan News.Net\n\n\"Adios 2024\": Vijay Varma shares glimpse of his vacation with friends, check out\n\nAfghanistan News.Net\n\nAfghanistan: Taliban orders all NGOs to stop employing women or face closure\n\nAfghanistan News.Net\n\nTaliban bars women from looking out of windows\n\nAfghanistan News.Net\n\nEight killed on Afghan side during border clashes between Pakistani and Afghan forces\n\nAfghanistan News.Net\n\nSeven to eight Taliban forces killed in border clash with Pakistan forces\n\nAfghanistan News.Net\n\nAfghanistan shows what investing in women's education - or divesting - can do to an economy\n\nAfghanistan News.Net\n\nXINHUA PICTURES OF THE YEAR 2024: WORLD NEWS (Part 2)\n\nAfghanistan News.Net\n\nXINHUA-PICTURES OF THE YEAR 2024-WORLD NEWS\n\nAfghanistan News.Net\n\nIran's Deputy FM Takht Ravanchi set to visit India today, talks to focus on trade, security issues, Chabahar Port\n\nAfghanistan News.Net\n\nPakistan: Levies forces arrest 72 Afghan nationals for \"illegally\" entering Chagai\n\nAfghanistan News.Net\n\nJasprit Bumrah becomes highest-ever ranked Indian Test bowler in ICC rankings history\n\nAfghanistan News.Net\n\nRohit Sharma thanks 2024 for \"all the ups and downs and everything in between\"\n\nAfghanistan News.Net\n\nAustralia almost there, India's outside chance: A look at state of play of ICC World Test Championship 2023-25\n\nAfghanistan News.Net\n\nFrom James Anderson to Ravichandran Ashwin, top 10 most heartbreaking retirements in cricket this year\n\nAfghanistan News.Net\n\nWanindu Hasrasnga, Kushal Mendis, Sherfane Rutherford, Azmatullah Omarzai nominated for ICC Men's ODI Cricketer of the Year\n\nAfghanistan News.Net\n\nSign up for Afghanistan News\n\na daily newsletter full of things to discuss over\ndrinks.and the great thing is that it's on the house!\n\nnull in null\n\nAll Afghanistan News Headlines\n\nPakistani FO evades Afghan airstrike allegations\n\nAfghanistan News.Net\n\nAFGHANISTAN-KABUL-DRUG ADDICTS-RECOVERY-VOCATIONAL TRAINING\n\nAfghanistan News.Net\n\nAFGHANISTAN-KABUL-SNOW FALL-TRAFFIC\n\nAfghanistan News.Net\n\nIndia-Iran hold 19th Foreign Office Consultations; discuss bilateral ties, Chabahar Port\n\nAfghanistan News.Net\n\nEAM Jaishankar meets Iran Deputy FM Takht Ravanchi, discusses bilateral ties, Chabahar Port\n\nAfghanistan News.Net\n\nPakistan: Khyber Pakhtunkhwa police struggle to combat militant presence in southern districts\n\nAfghanistan News.Net\n\nAfghanistan shows what investing in women's education - or divesting - can do to an economy\n\nAfghanistan News.Net\n\nPM Modi govt committed to revive historic, cultural heritage of Kashmir, will reclaim what has been lost: Amit Shah\n\nAfghanistan News.Net\n\nXINHUA PICTURES OF THE YEAR 2024: WORLD NEWS (Part 2)\n\nAfghanistan News.Net\n\nShane Watson opens up on importance of ICC Champions Trophy ahead of it's 2025 edition\n\nAfghanistan News.Net\n\nXINHUA-PICTURES OF THE YEAR 2024-WORLD NEWS\n\nAfghanistan News.Net\n\nExplainer: What to make of the deadly U.S. New Orleans vehicle attack\n\nAfghanistan News.Net\n\nIran's Deputy FM Takht Ravanchi set to visit India today, talks to focus on trade, security issues, Chabahar Port\n\nAfghanistan News.Net\n\nAsia Album: Oranges ripening in Nangarhar, Afghanistan\n\nAfghanistan News.Net\n\nPakistan: Levies forces arrest 72 Afghan nationals for \"illegally\" entering Chagai\n\nAfghanistan News.Net\n\nFrom James Anderson to Ravichandran Ashwin, top 10 most heartbreaking retirements in cricket in 2024\n\nAfghanistan News.Net\n\nJasprit Bumrah becomes highest-ever ranked Indian Test bowler in ICC rankings history\n\nAfghanistan News.Net\n\n\"Adios 2024\": Vijay Varma shares glimpse of his vacation with friends, check out\n\nAfghanistan News.Net\n\nRohit Sharma thanks 2024 for \"all the ups and downs and everything in between\"\n\nAfghanistan News.Net\n\nAfghanistan: Taliban orders all NGOs to stop employing women or face closure\n\nAfghanistan News.Net\n\nAustralia almost there, India's outside chance: A look at state of play of ICC World Test Championship 2023-25\n\nAfghanistan News.Net\n\nTaliban bars women from looking out of windows\n\nAfghanistan News.Net\n\nFrom James Anderson to Ravichandran Ashwin, top 10 most heartbreaking retirements in cricket this year\n\nAfghanistan News.Net\n\nEight killed on Afghan side during border clashes between Pakistani and Afghan forces\n\nAfghanistan News.Net\n\nWanindu Hasrasnga, Kushal Mendis, Sherfane Rutherford, Azmatullah Omarzai nominated for ICC Men's ODI Cricketer of the Year\n\nAfghanistan News.Net\n\nSeven to eight Taliban forces killed in border clash with Pakistan forces\n\nAfghanistan News.Net\n\nArshdeep Singh joins Sikandar Raza, Babar Azam, Travis Head as nominees for ICC Men's T20I Cricketer of the Year\n\nAfghanistan News.Net\n\n(SpotNews)AFGHANISTAN-KABUL-EXPLOSION\n\nAfghanistan News.Net\n\nAfghanistan Taliban targets \"several points\" in Pakistan, tensions increase\n\nAfghanistan News.Net\n\nPakistan: PTI chief Imran Khan rejects offer of house arrest, demands release of political prisoners\n\nAfghanistan News.Net\n\nPakistani PM Shehbaz urges Taliban regime in Afghanistan to act against TTP\n\nAfghanistan News.Net\n\n\"I deplore the killing of Afghan civilians\": UN Special Rapporteur on Pak's airstrike\n\nAfghanistan News.Net\n\nYearender: India's long wait for ICC Trophy finally ended in 2024, secure T20 World Cup\n\nAfghanistan News.Net\n\n\"Pakistan committed to security of its people\": Foreign Ministry defends airstrikes in Afghanistan\n\nAfghanistan News.Net\n\nIran's ambassador to Afghanistan stresses strengthening ties with Taliban\n\nAfghanistan News.Net\n\nUP CM Yogi Adityanath pays tributes to \"Sahibzadas\" at CM's residence\n\nAfghanistan News.Net\n\nJSMM chairman condemns Pakistan's military bombings in Afghanistan, calls for global accountability\n\nAfghanistan News.Net\n\nAfghanistan summons Pakistani envoy over airstrikes in Paktika\n\nAfghanistan News.Net\n\nUAE strongly condemns attack at Ministry of Refugees in Afghanistan\n\nAfghanistan News.Net\n\nTaliban orders NGOs to fire female workers\n\nAfghanistan News.Net\n\nTaliban bans windows that overlook women\n\nAfghanistan News.Net\n\nMiddle East Insights 2024: Afghanistan, long road to reconstruction\n\nAfghanistan News.Net\n\nAfghanistan vows to retaliate against Pakistan for deadly strikes\n\nAfghanistan News.Net\n\nKabul vows to retaliate against Islamabad for deadly strikes\n\nAfghanistan News.Net\n\nAfghanistan reactivates 14 cold storage facilities to support farmers\n\nAfghanistan News.Net\n\n2 killed, 3 injured in road accident in northern Afghanistan\n\nAfghanistan News.Net\n\nPolice foil attempt to smuggle drugs in W. Afghanistan\n\nAfghanistan News.Net\n\nFeature: Recovered Afghan drug addicts lend healing hands\n\nAfghanistan News.Net\n\nHeavy snowfalls block multiple highways in Afghanistan\n\nAfghanistan News.Net\n\nConstruction of 4 drug rehabilitation centers completed in Afghanistan\n\nAfghanistan News.Net\n\nCentral Asia News\n\nATP roundup: U.S., Poland to clash in United Cup final\n\nAfghanistan News.Net\n\nAFGHANISTAN-KABUL-DRUG ADDICTS-RECOVERY-VOCATIONAL TRAINING\n\nAfghanistan News.Net\n\n7000 km of highway constructed, airports terminal opened: Kazakh President Tokayev on 2024 development\n\nAfghanistan News.Net\n\nEAM Jaishankar meets Iran Deputy FM Takht Ravanchi, discusses bilateral ties, Chabahar Port\n\nAfghanistan News.Net\n\nPakistan: Khyber Pakhtunkhwa police struggle to combat militant presence in southern districts\n\nAfghanistan News.Net\n\nAfghanistan shows what investing in women's education - or divesting - can do to an economy\n\nAfghanistan News.Net\n\nAccess More\n\nNews Releases\n\nAfghanistan News.Net's News Release Publishing\nService provides a medium for circulating your organization's\n\nInternational News\n\nChinese driver who ran over 35 people sentenced to death\n\nAfghanistan News.Net\n\nWWII veteran and Pearl Harbor survivor dies at 103\n\nAfghanistan News.Net\n\nChina's 'reunification' with Taiwan can't be stopped, warns Xi\n\nAfghanistan News.Net\n\n9th US telecom firm identified in Chinese hacking campaign\n\nAfghanistan News.Net\n\nSuicide car bombing in Las Vegas mystifies investiigators\n\nAfghanistan News.Net\n\nSwiss flight attendant who inhaled smoke in emergency dies week later\n\nAfghanistan News.Net\n\nNo power on New Year's Eve in nearly all of Puerto Rico\n\nAfghanistan News.Net\n\nExposure to cold kills 2 Oregon men on trip in Washington state forest\n\nAfghanistan News.Net\n\nTugboat collides with tanker in Louisiana, sinks in Mississippi River\n\nAfghanistan News.Net\n\n$1.3 billion jackpot for California resident in Mega Millions lottery\n\nAfghanistan News.Net\n\nAfghanistan News.Net\n\nNews Releases\n\nPrivacy Policy\n\nTerms and Conditions\n\n© Copyright 1999-2025 Afghanistan News.Net - Mainstream Media Ltd. All rights reserved.","url":"https://www.afghanistannews.net/news/274907503/xinhua-pictures-of-the-year-2024-world--part-2","image":"https://cdn.bignewsnetwork.com/xih1735835204.jpg","video":null,"publish_date":"2025-01-05 00:11:14","author":"Then Chih Wey","authors":["Then Chih Wey"],"language":"en","source_country":"af","sentiment":0.443},{"id":278321852,"title":"9th US telecom firm identified in Chinese hacking campaign","text":"WASHINGTON, D.C.: The U.S. government has identified a ninth telecommunications company compromised in the widespread Chinese-linked cyberespionage campaign known as Salt Typhoon, a senior White House official announced.\n\nAnne Neuberger, U.S. deputy national security advisor for cyber and emerging technology, revealed during a press briefing that the latest addition to the list was uncovered following the government's issuance of guidance to help detect and defend against the operation. Previously, officials named major telecom firms such as Verizon, AT&T, and Lumen among the targets of the breach.\n\nThe Cybersecurity and Infrastructure Security Agency (CISA) on December 18 advised senior government and political figures to adopt end-to-end encrypted apps for mobile communications to counter the threat posed by Salt Typhoon. The campaign reportedly targeted officials linked to the campaigns of Kamala Harris, President-elect Donald Trump, and Vice President-elect JD Vance.\n\nOfficials said \"a large number of Americans' metadata was taken\" as part of the cyberespionage effort.\n\nChinese authorities have denied the accusations, labeling them disinformation and reaffirming their opposition to cyberattacks in all their forms. Beijing has stated that it \"firmly opposes and combats cyberattacks and cyber theft in all their forms.\"\n\nLawmakers have highlighted the severity of the breach. During a December 11 hearing, Senator Ben Ray Lujan called it \"the largest telecommunications hack in our nation's history,\" while Senator Ted Cruz emphasized the urgency of securing communication networks.\n\nIn response to the revelations, Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel announced on December 5 that the agency is proposing new rules requiring telecom carriers to bolster network security.\n\nNeuberger detailed the extensive access gained by the attackers, explaining that the Chinese operatives could \"geolocate millions of individuals\" and \"record phone calls at will.\" She stressed that updated FCC regulations could play a critical role in mitigating the impact of such intrusions in the future.","url":"https://www.afghanistannews.net/news/274908981/9th-us-telecom-firm-identified-in-chinese-hacking-campaign","image":"https://cdn.bignewsnetwork.com/cus1735704554555.jpg","video":null,"publish_date":"2025-01-05 00:11:14","author":"Salt Typhoon. The","authors":["Salt Typhoon. The"],"language":"en","source_country":"af","sentiment":-0.088},{"id":278321822,"title":"Indian stocks on strong footing, Sensex soars around 1,300 points","text":"New Delhi [India], January 2 (ANI): Indian stock indices are on a strong footing at the start of 2025. The Sensex and Nifty rallied both on January 1 and January 2.\n\nAt the time of filing this report, Sensex was at 79,752.03 points, up 1,244.62 points or 1.59 per cent.\n\nExperts stated that the upcoming Q3 results season will now decide the market's movement. Afterwards, the market is expected to shift focus towards expectations from the Union Budget and the policy decisions of the Trump 2.0 administration.\n\n\"Trump 2.0 start remains the main global event of the month and year,\" Ajay Bagga, a veteran banking and market expert.\n\nFinancial services firm Geojit's Head Investment Strategist, Gaurang Shah, asserted better than expected advance tax collection numbers, firm GST collections, strong Q3 outlook for some sector, boosted market sentiments. He expects some profit booking going ahead.\n\nGoods and Services Tax (GST) collections in December, in gross terms, were at Rs 1.76 lakh crore, with a yearly jump of 7.3 per cent. So far in 2024-25, the total GST collection has been 9.1 per cent higher at Rs 16.33 lakh crore, as against Rs 14.97 lakh crore mopped up in the corresponding period of 2023.\n\nIndian stock market touched two-week high with gains in key sectors.\n\nAuto, tech, and financial services sectors were primary contributors to the market's rise, Kedia Advisory said. However, investor caution persists due to potential new tariff policies under Donald Trump's presidency.\n\nThe Sensex still remains nearly 6000 points below its all-time high of 85,978 points.\n\nIn 2024, Sensex and Nifty accumulated 9-10 per cent each. In 2023, Sensex and Nifty gained 16-17 per cent, on a cumulative basis. In 2022, they gained a mere 3 per cent each.\n\nWeak GDP growth, foreign fund outflows, rising food prices, and slow consumption were some of the hurdles this year, keeping many investors at bay in 2024.\n\nThe Indian rupee are also hovering their all-time lows, weighed down by the expectation of fewer Fed rate cuts, coupled with a widening trade deficit, and weak economic growth seen in the first two quarters of 2024-25. (ANI)","url":"https://www.afghanistannews.net/news/274907149/indian-stocks-on-strong-footing-sensex-soars-around-1300-points","image":"https://cdn.bignewsnetwork.com/ani1735810679.jpg","video":null,"publish_date":"2025-01-05 00:11:14","author":null,"language":"en","source_country":"af","sentiment":-0.138},{"id":278321814,"title":"US prices of over 250 medicines raised by drugmakers","text":"NEW YORK CITY, New York: At the start of 2025, drug companies raised prices on over 250 brand-name medications in the U.S., including Pfizer's COVID-19 treatment Paxlovid, Bristol Myers Squibb's cancer therapies, and vaccines from Sanofi, according to healthcare research firm 3 Axis Advisors.\n\nMost price increases were under 10 percent, with the median increase at 4.5 percent-similar to last year's average. Drugmakers have scaled back significant price hikes in recent years after facing criticism for sharp increases in the mid-2010s. These price hikes apply to list prices, not accounting for discounts or rebates.\n\nIn 2023, drug companies launched new medications at prices 35 percent higher than the year before. On January 1, Pfizer raised prices on more than 60 drugs, including a three percent increase for Paxlovid. \n\nIn addition, the company raised prices on medicines, including migraine treatment Nurtec and cancer drugs Adcetris, Ibrance, and Xeljanz, between three percent and five percent.\n\nBristol Myers raised prices on its expensive cancer therapies Abecma and Breyanzi by six and nine percent, respectively. These personalized treatments can already cost close to US$500,000. Sanofi increased prices on about a dozen vaccines by 2.9 to nine percent. \n\nLeadiant Pharmaceuticals made the most significant increases, raising prices by 15 percent for its Hodgkin's disease drug Matulane and 20 percent for eye drops treating a rare condition.\n\nMerck reduced prices for its diabetes drugs Januvia and Janumet to better reflect net pricing. Other drugmakers are expected to announce more price changes in January, the most common month for such increases. \n\nThe U.S. pays more for prescription medicines than any other country, and incoming President Donald Trump has vowed to lower drug costs by focusing on middlemen in the U.S. healthcare system.","url":"https://www.afghanistannews.net/news/274908055/us-prices-of-over-250-medicines-raised-by-drugmakers","image":"https://cdn.bignewsnetwork.com/cus1735790439365.jpg","video":null,"publish_date":"2025-01-05 00:11:14","author":null,"language":"en","source_country":"af","sentiment":0.188},{"id":278321804,"title":"Toyota joins growing list of donors for Trump's inauguration","text":"DETROIT, Michigan: Toyota Motor of North America is donating $1 million to support President-elect Donald Trump's inauguration on January 20, a company spokesperson said this week.\n\nThis follows similar donations from Ford Motor and General Motors, which also announced they would provide vehicles for the event. Toyota, however, said it does not plan to supply vehicles.\n\nTrump's proposed tariffs on imports from Mexico and Canada could impact automakers like Toyota, which makes the Toyota Tacoma pickup truck in Mexico. Reuters also reported that Trump plans to roll back many policies introduced by President Joe Biden on electric vehicles and emissions.\n\nOther big companies, including Amazon and Meta (Facebook's parent company), have also contributed to the inauguration.","url":"https://www.afghanistannews.net/news/274904289/toyota-joins-growing-list-of-donors-for-trump-inauguration","image":"https://cdn.bignewsnetwork.com/cus1735361372650.jpg","video":null,"publish_date":"2025-01-05 00:11:14","author":"President Joe Biden","authors":["President Joe Biden"],"language":"en","category":"politics","source_country":"af","sentiment":-0.341},{"id":278325906,"title":"Olivia Dunne performs the 'Donald Trump dance' with LSU teammate Kylie Coen","text":"Olivia Dunne performs the 'Donald Trump dance' with LSU teammate Kylie Coen\n\nREAD MORE: Olivia Dunne begins final season at LSU... but what's next for her? \n\nBy DANIEL MATTHEWS\n\nPublished: 00:07 GMT, 5 January 2025 | Updated: 00:10 GMT, 5 January 2025\n\nOlivia Dunne became the latest athlete to perform the 'Donald Trump dance' ahead of her return to gymnastics action.\n\nThe LSU star began her final season on Friday night, with boyfriend Paul Skenes among the crowd as the Tigers beat Iowa State.\n\nDunne shone on the floor and the beam and ahead of the meet, the 22-year-old showed off her dance moves.\n\nThe gymnast posted a short clip on TikTok, which showed her and teammate Kylie Coen imitating the president-elect.\n\n'A little pre-meet hype,' Dunne wrote after joining the likes of Brock Bowers and Christian Pulisic in doing the 'Trump dance'.\n\nFollowing Trump's win in the presidential election, stars from across sports have celebrated on the field by shuffling like the 78-year-old.\n\nLSU gymnast Olivia Dunne became the latest athlete to perform the 'Donald Trump dance' \n\nThe LSU star began her final season on Friday night, with Paul Skenes among the crowd \n\nTrump popularized the moves during the recent election campaign, before he beat Kamala Harris to seal a return to the White House.\n\nBowers, Calvin Ridley and Nick Bosa were among the first athletes to imitate Trump and, on Friday, Dunne and Coen joined the craze.\n\nShe posted the video ahead of LSU's season opener against Iowa State, which kicked off her fifth and final year with the Tigers.\n\nDunne's boyfriend, MLB star Skenes, was among the crowd. The meet came only days after they celebrated the New Year in New Orleans - on the same night as the deadly terror attack.\n\nOlivia DunneDonald TrumpTikTok\n\nShare or comment on this article:\nOlivia Dunne performs the 'Donald Trump dance' with LSU teammate Kylie Coen\n\nAdd comment","summary":"The gymnast posted a short clip on TikTok, which showed her and teammate Kylie Coen imitating the president-elect. 'A little pre-meet hype,' Dunne wrote alongside the video.","url":"https://www.dailymail.co.uk/sport/othersports/article-14250889/Olivia-Dunne-performs-Donald-Trump-dance-LSU-teammate-Kylie-Coen.html","image":"https://i.dailymail.co.uk/1s/2025/01/05/00/93731361-0-Olivia_Dunne_s_final_season_debut_for_LSU_gymnastics_had_Paul_Sk-a-19_1736035636327.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/18/5907730584862542131/1024x576_MP4_5907730584862542131.mp4","publish_date":"2025-01-05 00:10:26","author":"Daniel Matthews,Editor","authors":["Daniel Matthews","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.115},{"id":278321416,"title":"Cooper defends Phillips as ‘fearless’ advocate after Musk criticism","text":"The Home Secretary has defended Jess Phillips as a “fearless and formidable” advocate for sexual abuse victims after Elon Musk criticised the safeguarding minister.\n\nThe billionaire X owner suggested Ms Phillips “deserves to be in prison” for denying requests for the Home Office to lead a public inquiry into child sexual exploitation in Oldham.\n\nMs Phillips said in a letter to the local council that Oldham must follow in the footsteps of other towns such as Rotherham and Telford and commission its own inquiry into historical abuse of children.\n\nJess Phillips has dedicated her career to tackling sexual violence and abuse and to being a voice for victims and survivors of the most terrible crimes, including child sexual abuseYvette Cooper, Home Secretary\n\nMr Musk also attacked Sir Keir Starmer, saying the Prime Minister failed to bring “rape gangs” to justice when he was director of public prosecutions.\n\nHome Secretary Yvette Cooper said Ms Phillips had “campaigned tirelessly” on behalf of those that had been failed by institutions.\n\n“Jess Phillips has dedicated her career to tackling sexual violence and abuse and to being a voice for victims and survivors of the most terrible crimes, including child sexual abuse,” she said.\n\n“From setting up the first ever child sexual exploitation service in the Black Country and supporting survivors in Telford, Jess has been a fearless and formidable advocate for victims and survivors.\n\n“She has worked with whistleblowers and campaigned tirelessly for justice for those badly let down by endemic institutional failure.”\n\nAs a Home Office minister, Ms Phillips has put the experience of grooming and trafficking victims “at the heart” of the department’s work on modern slavery and launched a national scheme so police and staff work together to spot when hotels are used as a site of child sexual exploitation, Ms Cooper said.\n\nMs Cooper said the Birmingham Yardley MP would keep working on implementing the recommendations of the Independent Inquiry into Child Sex Abuse, which published its final report in 2022.\n\nLed by Professor Alexis Jay, the inquiry looked into abuse by organised groups following multiple convictions of sexual offences against children across the UK between 2010-2014, including in Rotherham, Cornwall, Derbyshire, Rochdale and Bristol.\n\nLast year, Ms Phillips described X, formerly Twitter, as a “place of misery” and said she planned to use the site less.\n\nIts owner Mr Musk, a key member of US President-elect Donald Trump’s inner circle, shared and reacted to a series of tweets relating to grooming in the UK earlier this week.\n\nThe Tesla boss described the Prime Minister as “two-tier Keir”, claiming there was “no justice for severe, violent crimes but prison for social media posts” in the UK.\n\nHe also said Sir Keir failed to bring “rape gangs” to justice when he was director of public prosecutions (DPP) between 2008 and 2013.\n\nSenior Tories including Opposition leader Kemi Badenoch have since sought to put pressure on the Government over grooming gangs.\n\nIn 2022, the then-Conservative government also refused a request for a public inquiry into events in Oldham.\n\nReform UK said on Saturday it would launch a national inquiry into grooming gangs if elected.\n\nChairman Zia Yusuf told supporters at a conference in Chelmsford, Essex, that his party would launch an independent inquiry that would “leave no stone unturned”.\n\nParty leader Nigel Farage said a “full, open, national inquiry” was needed, so that everyone in the country “knows the truth” and understands that “mass open-door immigration without assimilation is a complete cultural disaster for our country”.\n\nWhistleblower Maggie Oliver, a former detective who resigned from Greater Manchester Police in 2012, said Sir Keir is “perhaps as guilty as anyone” over the failure to bring about change but added that she believed those who “pop up when this hits the headlines” would not do so either.\n\nMs Oliver said on X that inquiries into what happened have led “absolutely nowhere” and “wasted” millions of pounds, adding that those leading them “have always wanted to cover up the truth”.\n\nShe went on: “I firmly believe we need totally independent people who will ensure it’s not just another attempt to delay and hide the truth. Radical change and overhaul of all our public bodies.”\n\n“Bring in criminal accountability for all our senior police and public officials who have turned a blind eye.”\n\nShe said she felt the Conservatives and Labour were equally to blame and that Sir Keir as former DPP is “perhaps as guilty as anyone I know in where we find ourselves today”.\n\n“We all know what’s going on but I don’t trust a single one of those who to date have been entrusted with keeping our children safe and prosecuting serial rapists. They’ve failed. Repeatedly. Knowingly. Criminally.”\n\nWhistleblower Sara Rowbotham, co-ordinator of the crisis intervention team set up to support young people in Rochdale, expressed frustration at Mr Musk’s posts about the scandal on X, which he owns.\n\nShe told The Guardian: “What is (Musk’s) motivation for interfering? It seems very political.\n\n“The person he is trying to go after is Keir Starmer – it is a political swipe that is nothing to do with the women and girls who have been abused time after time.”\n\nThe Independent Inquiry into Child Sex Abuse described the sexual abuse of children as an “epidemic that leaves tens of thousands of victims in its poisonous wake”.\n\nIn November last year, Prof Jay said she felt “frustrated” that none of the probe’s 20 recommendations had been implemented more than two years after its conclusion.\n\nThe Labour Party and Number 10 have been approached for comment.","url":"https://www.grampianonline.co.uk/news/national/cooper-defends-phillips-as-fearless-advocate-after-musk-criticism-124453/","image":"https://www.grampianonline.co.uk/_media/img/UNIZXIGLQ58U0TSO03AP.jpg","video":null,"publish_date":"2025-01-05 00:08:14","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.073},{"id":278321592,"title":"Jimmy Carter Lies in Repose at The Carter Center on First Night of 6-Day State Funeral","text":"Jimmy Carter is lying in repose on the first night of his multi-day state funeral.\n\n The body of the former president, who died on Sunday, Dec. 29 at 100, is currently at the Carter Presidential Center in Atlanta, where the Nobel Peace Prize winner will remain until 6 a.m. local time on Tuesday, Jan. 7.\n\n Earlier in the day, while en route to the center, a motorcade stopped in front of the farm that served as Carter's boyhood home in Plains, Ga. There, the National Park Service saluted the late president and rang a historic farm bell 39 times — symbolizing Carter's role as the 39th President of the United States.\n\n Once in Atlanta, a moment of silence took place at the Georgia State Capitol, which was led by Gov. Brian Kemp, Lt. Gov. Burt Jones, Atlanta Mayor Andre Dickens, members of the Georgia Legislature and Georgia State Patrol troopers.\n\n Following an arrival ceremony at the Carter Presidential Center, a private service was conducted in the lobby of the Jimmy Carter Presidential Library and Museum, before the location was opened up to the public, allowing mourners to come and pay their respects.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n Carter, who was a one-term president from 1977 to 1981, died at his home in Plains, after spending almost two years in hospice care. His death was confirmed by his son, James E. Carter III, known as Chip, per The Washington Post. The Carter Center also confirmed the news in a message shared on X (formerly Twitter).\n\n Carter's funeral proceedings will take place over multiple days, ending on Thursday, Jan. 9.\n\n After his time lying in repose at the Carter Presidential Center, Carter will be taken to Washington, D.C., on Tuesday, Jan. 7, when members of Congress will pay their respects during a service in the Rotunda of the U.S. Capitol. Visitors will be able to pay their respects soon after.\n\n Carter will remain there through the early hours of Thursday, Jan. 9, before he is moved to the Washington National Cathedral, where his national funeral service will take place. Later in the day, Carter will be moved back to Georgia for a private funeral service at the Maranatha Baptist Church, which will be followed by a burial his home. He will be laid to rest next to his late wife Rosalynn Carter, who died at age 96 in November 2023.\n\n Flags at all federal buildings are scheduled to fly at half-mast for 30 days after Carter's death, including during Donald Trump's Jan. 20 inauguration.","summary":"The former president died at his home last month after spending almost two years in hospice care","url":"https://people.com/jimmy-carter-lies-in-repose-first-night-6-day-state-funeral-8769103","image":"https://people.com/thmb/fOKzLEhf31fx6eg_Kgi3MVQe2ww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(721x344:723x346)/Jimmy-Carters-casket-funeral-010425-aa11195ee55441b98b542b08e82b2257.jpg","video":null,"publish_date":"2025-01-05 00:05:41","author":"Nicholas Rice","authors":["Nicholas Rice"],"language":"en","source_country":"US","sentiment":-0.241},{"id":278321070,"title":"Russia promises retaliation after saying Ukraine fired US-supplied missiles","text":"Russia has pledged to retaliate after it claimed to have shot down eight US-supplied ATACMS missiles fired by Ukraine at its border region of Belgorod.\n\n“On January 3, an attempt was made from Ukrainian territory to launch a missile attack against the Belgorod region using US-made ATACMS operational-tactical missiles,” the Russian Ministry of Defence said on Saturday.\n\n“These actions by the Kyiv regime, which is supported by Western curators, will be met with retaliation,” it added, saying all the missiles were shot down.\n\nThe ministry said earlier that air defences downed eight ATACMS missiles in total, without saying when or where.\n\nOfficials in Ukraine have not yet responded to the accusation.\n\nThe Army Tactical Missile System (ATACMS) has a range of 300km (190 miles) and was first developed in the 1980s.\n\nOutgoing US President Joe Biden had authorised Kyiv to use long-range weapons against Russia last year, in a move the Kremlin denounced as a grave escalation of the nearly three-year conflict. Biden is expected to announce additional security assistance for Ukraine in the coming days, according to White House spokesperson John Kirby.\n\nUS President-elect Donald Trump said in an interview last month he was “very vehemently” opposed to Ukraine using the arms, which he said were “escalating” the conflict.\n\nBesides military support from the US, Kyiv will also reportedly receive its first French Mirage 2000-5F multirole fighters this month, according to French magazine Avions Legendaires.\n\nRussian President Vladimir Putin threatened last year to strike central Kyiv with a hypersonic ballistic missile if Ukraine continued hitting Russian territory with long-range Western weapons.\n\nBoth Kyiv and Moscow have accused each other of fatal attacks on civilians since the year began.\n\nA Russian attack on a village in Ukraine’s northeast Kharkiv region earlier on Saturday killed a 74-year-old man, regional Governor Oleg Synegubov said.\n\nAt least three people, including two children, were wounded in a Russian attack on the Sumy region of northeastern Ukraine on Saturday, local authorities said. Sumy borders Russia’s Kursk region and has been regularly shelled by Russian forces for months.\n\nRussian forces also launched attacks near the Ukrainian city of Pokrovsk in an effort to bypass it from the south and cut off supply routes to Ukraine’s troops, the Ukrainian military said on Saturday.\n\nUkrainian President Volodymyr Zelenskyy noted that Russia had launched 300 attack drones and 20 missiles at Ukrainian targets in the first three days of 2025, but said a large amount was shot down by Kyiv’s forces.\n\n“Such Russian terror, which continues with unrelenting intensity, requires both us and all our partners not to reduce efforts in strengthening our air defence shield and all its systemic components – from Patriot systems to mobile fire groups,” Zelenskyy said on his social media platforms.\n\nUS Secretary of State Antony Blinken will embark on his final trip in office this weekend, travelling to South Korea, Japan, and France.\n\nAt meetings in Paris, he is expected to discuss European security and Russia’s war in Ukraine with French officials, showcasing the Biden administration’s final outreach towards Kyiv before the Trump government takes over.","url":"https://stvincenttribune.com/russia-promises-retaliation-after-saying-ukraine-fired-us-supplied-missiles/","image":"https://stvincenttribune.com/app/uploads/2025/01/AFP__20250104__36RY3DM__v1__HighRes__FilesJapanElderlyRecord-1735998547-34XG6G.jpeg","video":null,"publish_date":"2025-01-05 00:04:21","author":null,"language":"en","category":"politics","source_country":"vc","sentiment":-0.151},{"id":278322646,"title":"Nigerians doubt fresh predictions over 2024 failed prophecies","text":"From megachurches to smaller congregations, New Year’s Eve services are often marked by pastors, prophets, and spiritual leaders sharing their visions and prophecies for the upcoming year.\n\nThese prophecies, which often address issues such as economic recovery, political events, natural disasters, and national security, have become an annual tradition in Nigeria.\n\nEvery year, people in the country look forward to the declarations of respected and popular religious leaders, hoping for insight into the country’s fortunes and future.\n\nWhile some of these prophecies come to pass, others fall short, deepening mistrust and raising concerns about the credibility and calling of these preachers.\n\nIn 2024, religious leaders predicted economic hardship and eventual recovery, major political changes, breakthroughs in national security, and a year of divine intervention for the country.\n\nHowever, the reality of the past year painted a starkly different picture, as economic hardship worsened, insecurity persisted, and political tensions remained unresolved.\n\nIn 2024, the General Overseer of the Redeemed Christian Church of God Worldwide, Pastor Enoch Adeboye, released seven prophecies for Nigeria and the international community.\n\nThe cleric said, “Things will get worse before it gets better in 2024, some serious secrets would come into the open, there will be divine intervention in those places that are hot, and medical breakthroughs in areas like cancer, asthma, hypertension, and sugar diabetes.”\n\nThere is no evidence all the prophecies came to pass.\n\nThe most notable unfulfilled prophecy for year 2024 came from the General Overseer of Omega Fire Ministries International, Apostle Johnson Suleman, who predicted victory for Vice President Kamala Harris at the US presidential election.\n\nThe controversial pastor said Harris would not only emerge the winner of the election, but also become the first female president of America.\n\n“The person I see ruling America is a woman; the person who is vice will become president, write it down,” Suleman said to the cheering of his church members.\n\nHowever, former President Donald Trump won the election by a landslide and is set for inauguration as the 47th president of the US on January 20, 2025.\n\nAnother unfulfilled prophecy came from the founder and senior pastor of the Champions Royal Assembly, Prophet Joshua Iginla, who predicted that President Bola Tinubu would experience major medical emergencies and health failure.\n\n“President Tinubu should focus on his health to prevent medical emergencies twice. We pray God’s agenda for him will come to pass,” Iginla said.\n\nAlso, the cleric’s prediction on the removal of Plateau State Governor, Caleb Mutfwang,failed to manifest.\n\nPredicting Mutfwang’s removal, Iginla said, “The governor should pray. I saw his seat being occupied by another person. He should pray to finish what he has started. He should rise not to only sustain his seat but his life too. He is a star in this country despite the issues surrounding him.”\n\nHowever, his prediction on possible attack on the Governor of Taraba State, Agbu Kefas,or his relatives came to pass when a policeman escorting the family accidentally shot the governor’s sister, Atsi Kefas, while attempting to fend off some assailants last December.\n\n2025 prophecies \n\nReligious leaders have made several predictions for the new year.\n\nPastor Adeboye, in his 2025 prophecies during the cross over night on Tuesday, December 31 at the Redemption city, said, 2025 would be a landmark year.\n\n“God says the wind that started blowing last year will continue to blow this year but stronger. The Lord said some earthly helpers will be replaced by heavenly helpers this year. The Lord said mockers will be louder and more aggressive but unfortunately many will not survive 2025. The Lord says some towns and villages will shout victory at last,” the cleric added.\n\nThe leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, in an interview with Saturday PUNCH, revealed some of his prophecies for 2025, predicting that Nigerians would face more economic hardships.\n\nAyodele said, “The spirit of the Lord revealed to me that things will be difficult even as the economy will be sluggish. As the lord revealed, economic hardship will continue in 2025, the economy is not going to get better as expected this year unless the government fights corruption and cuts the cost of governance”.\n\nThe cleric also predicted a crisis in the Senate and a ploy to remove the Senate President, Godswill Akpabio.\n\n“Nigeria will fail if it continues to rely on petroleum as the major source of revenue. If Nigeria is still investing in petrol in the next five to six years, we will regret it. Petrol price will crash, Nigerians will still buy petrol for N200; it may not be now, but in the near future. \n\n“There will be more problems in the Peoples Democratic Party. If the spell in PDP and Labour Party is not cast away, they will fail because more people will defect to the All Progressives Congress. If the opposition parties do not stand firm, they will not defeat APC,” Ayodele said.\n\nIn his prophecies, the General Overseer of Mountain of Fire and Miracles Ministries, Daniel Olukoya, said 2025 would be a year of strange battles.\n\nOlukoya, who made the predictions during the church’s annual crossover service, on Wednesday, also noted that “many prayers are needed to avert economic turbulence”.\n\nOther predictions of the cleric include: “2025 will be a year God will raise transformative leaders. A year when the Lord will render naked and disgrace fake ministers. A year of tragedy for married men who like going around with strange women. A year when prayers are needed to tackle strange economic and political turbulence.”\n\nThe General Superintendent of the Deeper Christian Life Ministry, Pastor Williams Kumuyi, in his prophecies during the crossover service, said the name of Jesus Christ would open closed doors for people in 2025.\n\nThe cleric added that those who connected their names to Jesus Christ would explode positively in 2025.\n\nKumuyi said, “Welcome the new year. What’s your name? Your new year has come, 2025. I give you a prosperous 2025, a fully-loaded 2025.\n\n“All sufficiency for your life, for your ministry, for your profession. 2025 fully, completely loaded for you. The enemy will not determine your life in the New Year. You have the final say.”\n\nThe founder of Living Faith Church Worldwide, popularly known as Winners’ Chapel, Bishop David Oyedepo, said 2025 would be the beginning of a transformative era for believers.\n\n“By the guidance of the Holy Spirit, 2025 will be your year of new beginnings—a year of fresh opportunities and significant advancements in your life.\n\n“Welcome to 2025, a new era. You may find yourself questioning, ‘Have I truly been a Christian all this time?’ Incredible transformations will start occurring in your lives.\n\n“You are entering a new phase in every aspect of your existence—your health, family, spiritual journey, business, and career,” Oyedepo said.\n\nProphecies or predictions?\n\nThe Chairman of the Christian Association of Nigeria, Lagos State, Bishop Tunde Adegbite, described prophecies by some clerics as mere predictions generated from the reactions and comments of people on issues.\n\nHe also described many clerics as “talkatives who issue prophecies just to please their congregants and Nigerians.”\n\n“You can imagine somebody saying, ‘this year God told me a politician will die, one rich man will die, is that a prophecy?’ That is a fallacy; has there been any year that a politician will not die? Has there been any year a rich man will not die? Has there been any year a man or woman will not die?\n\n“Everyone of us know that what they are giving now is not from God and if you have anything from God, everybody will know from what you are saying. Once it does not come to pass, we regard you as being talkative.\n\n“We need to critically examine many acclaimed prophets now and know whether what they are saying is from God for man or it is because of their stomach, so that people can be coming to them for succour, and that is not the work of a prophet, you must say it as it is,” Adegbite said.\n\nOn his part, the General Overseer of Victory Life Bible Church, Apostle Lawrence Achudume, said the New Year prophecies were unnecessary, describing them as acts of show off by clerics.\n\n“I think these prophecies are unnecessary. What the church should focus on is how people can obey the rules and regulations of the land and obey the principles that add value to society. If we can follow all these, we do not need any prophecy to govern any nation.\n\n“Prophecies have not really made any impact on the country, but in a way, it has made some people lazy because prophecies without work are useless,” Achudume said.\n\nThe Archbishop of Lagos, Methodist Church Nigeria, Most Rev. Ayo Olawuyi,cautioned clerics against misleading Nigerians with New Year prophecies.\n\nHe described many of the prophecies as misleading, saying “The right prophecy is for people to turn away from their evil ways; from wickedness, corruption, exploitation and seek righteousness.”\n\nHe argued that rather than causing apprehension and confusion with their prophecies, religious leaders must continue to pray for the good of the nation.\n\nBut the leader of INRI Evangelical Spiritual Church, Primate Ayodele, defended New Year prophecies by Nigerian clerics, arguing that “prophecies are spiritual guidelines for nations that care to listen.”\n\nHe called on Nigerians not to underrate prophecies because “they provide spiritual insight and guidance, helping people prepare for potential challenges and embrace opportunities with faith and caution.”","summary":"In this report, Olufemi Adediran examined some 2024 prophecies of popular Nigerian pastors and prophets and how many of them went unfulfilled. While looking at the predictions for 2025, some Christian leaders advised preachers to de-emphasise such practices From megachurches to smaller congregations, New Year’s Eve services are often marked by pastors, prophets, and spiritual \n\n\n \n Read More","url":"https://punchng.com/nigerians-doubt-fresh-predictions-over-2024-failed-prophecies/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/04233039/PASTORS.jpg","video":null,"publish_date":"2025-01-05 00:03:03","author":"Our Reporters","authors":["Our Reporters"],"language":"en","source_country":"ng","sentiment":0.233},{"id":278320962,"title":"'What’s going on with my makeup?': Matt Gaetz seeks beauty tips from former drag queen George Santos","text":"Matt Gaetz, the former Florida congressman, became the subject of online jokes about his makeup after appearing on his talk show, The Matt Gaetz Show, New York Post reported. In the second episode, which aired on Friday, Gaetz invited his former colleague George Santos to offer beauty advice. This followed a social media frenzy where many mocked Gaetz for looking like a \"Who from Whoville,\" a reference to the quirky, round-faced characters from Dr. Seuss's How the Grinch Stole Christmas.— nypost (@nypost) Gaetz asked Santos for help with his makeup, saying, “What’s going on with my makeup? Help me! Give me advice!” Santos, a former drag queen, quickly offered his thoughts. “Let me tell you something, highlighter is not for you,” he said. Santos explained that highlighting the centre of Gaetz's face made his eyes look smaller and didn’t give the right effect. Gaetz tried to defend his makeup, mentioning his deep-set eyes, but Santos disagreed.“Look at the flawlessness in my skin. No highlighter needed!” Santos said. He continued, “You’re a Florida man. I’m in Florida right now. When you’re tan and you’re a Florida man, you don’t need that level of highlighter.” Santos then recommended Gaetz use “Double Wear foundation from Estee Lauder,” an expensive product that costs $52 per ounce.But Gaetz’s makeup isn’t his only issue. He is also involved in a serious sex scandal, facing accusations of trafficking, fraud, and drug use, along with allegations of having sex with a 17-year-old girl. In November, Gaetz announced he was withdrawing as President-elect Donald Trump’s nominee for attorney general. His chances of Senate confirmation were slim due to ongoing investigations into alleged drug use and payments for sex. He submitted his resignation to Congress.","url":"https://timesofindia.indiatimes.com/world/us/whats-going-on-with-my-makeup-matt-gaetz-seeks-beauty-tips-from-former-drag-queen-george-santos/articleshow/116952478.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116952564/116952564.jpg","video":null,"publish_date":"2025-01-05 00:02:13","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.062},{"id":278320942,"title":"Russia vows response after ATACMS targets Belgorod","text":"Russia vowed on Saturday to retaliate after it accused Ukraine of targeting its territory with US-supplied ATACMS (Army Tactical Missile System) at the border region of Belgorod the previous day. Outgoing US President Joe Biden authorised Kyiv to use the long-range weapons against Russia last year, in a move the Kremlin denounced as a grave escalation of the conflict. \"On Jan 3, an attempt was made from Ukrainian territory to launch a missile strike against the Belgorod region using US-made ATACMS operational-tactical missiles,\" the Russian defence ministry said.\"These actions by the Kyiv regime, supported by Western curators, will be met with retaliation,\" it added, saying all the missiles were shot down. Earlier, it said that air defences downed eight ATACMS missiles in total, without saying when or where.Russian President Vladimir Putin threatened last year to strike central Kyiv with a hypersonic ballistic missile if Ukraine continued hitting Russian territory with long-range Western weapons.US President-elect Donald Trump said in an interview last month he was \"very vehemently\" opposed to Ukraine using the arms, which he said were \"escalating\" the conflict.Both Kyiv and Moscow have accused each other of fatal attacks on civilians since the year began.A Russian strike on a village in Ukraine's northeast Kharkiv region earlier on Saturday killed a 74-year-old man, regional governor Oleg Synegubov said.Russia's defence ministry said on Saturday it had captured the Ukrainian village of Nadiia, one of the few settlements in the eastern Lugansk region still under Kyiv's control.Moscow advanced by almost 4,000 square kilometres in Ukraine in 2024, according to an AFP analysis. afp","url":"https://timesofindia.indiatimes.com/world/europe/russia-vows-response-after-atacms-targets-belgorod/articleshow/116952394.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116952397/116952397.jpg","video":null,"publish_date":"2025-01-05 00:02:13","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.335},{"id":278322016,"title":"Bộ Tư pháp Mỹ phản đối kế hoạch ‘cứu’ TikTok của ông Trump","text":"Mới đây, Bộ Tư pháp Mỹ đã yêu cầu Tòa án Tối cao bác bỏ đề nghị của Tổng thống đắc cử Donald Trump về việc trì hoãn thi hành luật cấm ứng dụng mạng xã hội TikTok hoặc buộc ByteDance bán ứng dụng này trước ngày 19/1.\n\n Biểu tượng của ứng dụng TikTok trên màn hình điện thoại thông minh. Ảnh: AFP/TTXVN\n\nLuật nói trên, được thông qua vào tháng 4/2024, yêu cầu ByteDance, công ty mẹ Trung Quốc của TikTok, phải thoái vốn khỏi nền tảng này tại Mỹ, nếu không sẽ phải đối mặt với lệnh cấm.\n\nTheo Chính phủ Mỹ, việc Trung Quốc kiểm soát TikTok thông qua ByteDance là mối đ.e dọ.a nghiêm trọng đối với an ninh quốc gia: TikTok thu thập một lượng lớn dữ liệu nhạy cảm về 170 triệu người Mỹ khiến ứng dụng này trở thành một công cụ mạnh mẽ cho hoạt động gián điệp. TikTok chưa đưa ra bình luận về động thái nói trên của Bộ Tư pháp.\n\nTuần trước, ông Trump đã đệ trình một bản tóm tắt pháp lý, lập luận rằng ông cần có thời gian sau khi nhậm chức vào ngày 20/1 để tìm ra một “giải pháp chính trị” cho vấn đề này. Tòa án dự kiến sẽ nghe các lập luận trong vụ việc vào ngày 10/1 tới. TikTok ngày 3/1 đã kêu gọi Tòa án Tối cao ngăn chặn luật này với lý do tự do ngôn luận theo Tu chính án thứ nhất của Hiến pháp Mỹ. Công ty cho biết Quốc hội Mỹ đã không tìm cách cấm các ứng dụng thuộc sở hữu của Trung Quốc như Shein hoặc Temu. TikTok cho rằng điều này cho thấy rõ ràng “họ nhắm mục tiêu vào TikTok vì nội dung mạng xã hội của ứng dụng này, chứ không phải dữ liệu”. Nếu tòa án không ngăn chặn luật nói trên trước ngày 19/1, người dùng mới sẽ không thể tải TikTok từ các cửa hàng ứng dụng của Apple hoặc Google, nhưng người dùng hiện tại vẫn có thể tiếp tục truy cập ứng dụng. Các dịch vụ trên ứng dụng này sẽ xuống cấp theo thời gian và cuối cùng ngừng hoạt động do các công ty sẽ bị cấm cung cấp dịch vụ hỗ trợ. Tổng thống Joe Biden có thể gia hạn thời hạn thêm 90 ngày nếu ông xác nhận ByteDance đang có tiến triển đáng kể trong việc thoái vốn.\n\nVideo đang HOT\n\nViệc ông Trump ủng hộ TikTok là một sự thay đổi lập trường so với năm 2020, khi ông cố gắng chặn ứng dụng này tại Mỹ do lo ngại an ninh quốc gia.\n\nTòa án Tối cao Mỹ đồng ý xử vụ cấm TikTok Tòa án Tối cao Mỹ đã tiếp nhận đơn kiện của TikTok và xếp lịch để xử lý trước khi mạng xã hội này bị cấm tại Mỹ. Tòa án Tối cao Mỹ ngày 18.12 đồng ý xem xét đơn kiện của TikTok đối với luật của Mỹ quy định công ty mẹ ByteDance phải thoái vốn khỏi TikTok nếu không nền tảng...","summary":"Tuần trước, ông Trump đã đệ trình một bản tóm tắt pháp lý, lập luận rằng ông cần có thời gian sau khi nhậm chức vào ngày 20/1 để tìm ra một giải pháp chính trị cho vấn đề này. Tòa án dự kiến sẽ nghe các lập luận trong vụ việc vào ngày 10/1 tới.","url":"https://vietgiaitri.com/bo-tu-phap-my-phan-doi-ke-hoach-cuu-tiktok-cua-ong-trump-20250105i7353204/","image":"https://t.vietgiaitri.com/2025/1/2/bo-tu-phap-my-phan-doi-ke-hoach-cuu-tiktok-cua-ong-trump-600x432-0db-7353204.webp","video":null,"publish_date":"2025-01-05 00:02:11","author":"Khánh Ly","authors":["Khánh Ly"],"language":"en","category":"politics","source_country":"vn","sentiment":-1},{"id":278320188,"title":"US President-elect nominates Roman Pipko as US Envoy to Estonia","text":"Washington DC [US], January 4 (ANI): US President-Elect Donald Trump on Saturday announced Roman Pipko as the next United States Ambassador to Estonia.Pipko was born and raised in Estonia, Trump said, adding that he believed that he would promote the US interests there.\n\n🚨 President Trump announces the nomination of Roman Pipko to serve as U.S. Ambassador to the Republic of Estonia! pic.twitter.com/M824bALcPN— Trump War Room (@TrumpWarRoom) January 4, 2025\n\n\"I am pleased to announce the nomination of Roman Pipko to serve as the next United States Ambassador to the Republic of Estonia,\" Trump said in his social media post on Truth Social. \"Roman was born and raised in Estonia. He has extensive experience in dealing with Foreign Governments, having represented U.S. interests in the European Bank for Reconstruction and Development, and the Russian American Enterprise Fund. Roman has represented American companies, negotiating projects in Mongolia, Africa, Russia, Western Europe, and his native Estonia, in cooperation with U.S. Government Agencies, and has worked with Foreign Governments on the enforcement of U.S. sanctions. Roman is a graduate of Columbia University and Yale Law School. As a legal immigrant, he has lived the promise of America, and I trust that he will advance American interests in his new role. Congratulations Roman!\" he added.Estonia is a NATO member.Estonian security is guaranteed by the membership in the North Atlantic Treaty Organization (NATO) and the European Union, as well as close cooperation with allies and other international partners. Estonia contributes to NATO and the EU, in order to strengthen the solidarity of member states, counter the security threats in different regions, and improve the defence capability of member states, the NATO stated. NATO's collective defence provides credible deterrence and defence for Estonia, as per NATO.Earlier on January 1, Trump accused Senate Democrats of attempting to delay the confirmation process of Republican nominees, urging his party to be \"smart\" and \"tough\" in countering their efforts.\n\nWe just won a Historic Landslide and Mandate from the American People, but Senate Democrats are organizing to improperly stall and delay the confirmation process of many of our Great Nominees. They will try all sorts of tricks starting very soon. Republicans must not allow them…— Donald J. Trump (@realDonaldTrump) December 31, 2024\n\nIn a post on X, he said, \"We just won a Historic Landslide and Mandate from the American People, but Senate Democrats are organizing to improperly stall and delay the confirmation process of many of our Great Nominees...\" (ANI)","url":"https://aninews.in/news/world/us/us-president-elect-nominates-roman-pipko-as-us-envoy-to-estonia20250104224739","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20250104142634.jpg","video":null,"publish_date":"2025-01-04 23:52:12","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.199},{"id":278319826,"title":"National Newswatch","text":"But while House Speaker Mike Johnson on Friday avoided the dayslong ordeal that his predecessor, Kevin McCarthy, endured to become speaker, his relatively swift victory was hardly a unifying moment. The tumult of the day laid bare that Johnson retains only tenuous support from hard-line conservatives who gave him their votes for now, but stand ready to dispatch him just as they did McCarthy if their demands aren't met.\n\n\"Is he going to fight?\" said Rep. Ralph Norman, a South Carolina Republican who initially opposed Johnson but ultimate changed his vote.\n\nRepublicans are relishing the moment as they take unified control of Washington and rally around President-elect Donald Trump. Yet the elements that made for a turbulent House the past two years remain stubbornly in place, except that the stakes are far higher now as Republicans try to deliver on Trump's agenda.\n\nThe scale of the conflict to come was apparent as Congress began its new session Friday. House Republicans took shots at each other on TV and argued on the House floor, the freshly elected speaker looked worried, and even after Johnson's victory, some GOP lawmakers openly discussed what might trigger his removal.\n\nFor a time, it seemed things might get even worse.\n\nThe House chamber seemed to snap back to a familiar scene from the speakership vote two years ago as archconservatives refused to back Johnson, gesticulating while they openly negotiated on the floor. But after an hour of uncertainty and tense negotiations -- as well as Trump calling in from a golf course to make clear he supported Johnson -- two of the three Republicans who at first denied Johnson the speakership changed their votes to give him the majority he needed.\n\nNorman said it was not so much Trump who changed his mind, but the fact that Johnson, as he huddled with the holdouts in the back of the House chamber, vowed that he would indeed \"fight for everything going forward.\"\n\nEasier said than done.\n\nJohnson has the difficult task of leading a Republican majority that will be even slimmer than it was in the last Congress -- potentially down to a single vote, once a handful of members join Trump's administration.\n\nLast year, the thin majority, as well as near-constant defiance from his right flank, forced Johnson to rely on Democratic support to pass practically any significant legislation.\n\nJohnson tried to turn the page in his first speech after winning the speaker's gavel, arguing that Republicans are now empowered by a \"groundswell of Americans\" who want an end to the status quo in Washington.\n\n\"Speaker Johnson contends that in a environment where we have the White House and the Republican Senate, that he's going to be able to go get the job done,\" said Rep. Chip Roy, R-Texas, who has been outspoken in his criticism of Johnson. \"So we'll give him a chance to see. But we need to deliver. There's no room for any excuses now.\"\n\nMaking matters more difficult, even if Johnson manages to unite his conference in the House, most legislation will still need at least some Democratic support in the Senate, where the chamber's filibuster rules prevent most bills from advancing unless they have support from at least 60 senators. Republicans will have a 53-47 majority in the Senate.\n\n\"He's got a really, really tough job,\" Senate Majority Leader John Thune, R-S.D., said in an interview with NBC's \"Meet the Press.\"\n\nRepublican leadership did ease one threat to Johnson by making it more difficult to oust the speaker through a so-called motion to vacate. Any motion will now need at least nine members from the majority party rather than being triggered by a single lawmaker. Democrats protested that Republicans are shielding the speaker from bipartisan accountability.\n\nStill, within minutes of Johnson gaining the support he needed to take the speakership, the House Freedom Caucus released a letter signed by 11 members demanding that Johnson deliver ambitious policy goals, including enacting permanent border security changes, making aggressive federal spending cuts and banning members of Congress from stock trading.\n\nCaucus members said Johnson now \"must prove he will not fail to enact President Trump's bold agenda.\"\n\nAt the same time, conservatives are also agitating for guarantees to reduce the federal deficit as well as move power from the speaker's office by allowing rank-and-file members greater control over what's included in legislation. While such promises could prove hard to keep, Johnson committed to working closely with Freedom Caucus members in crafting legislation.\n\n\"Speakers typically don't last very long,\" said Rep. Byron Donalds, R-Fla., a caucus member. \"I would say this about Speaker Johnson: As long as this is a member-driven process, I think his speakership will be successful. If it's not, that's going to be tough.\"\n\nNine conservatives initially withheld support for Johnson during the speakership vote by either staying silent while their names were called or voting for someone else. It was taken by many as a not-so-subtle message that the motion to vacate is still at hand, even with the rules change.\n\nThe warning was even raised to Johnson during a huddle over the speaker vote, Norman said.\n\nNorman said Johnson responded: \"Look, if I don't perform like I say I'm going to perform and push the things that you're saying, put me out. I never thought I would have this job anyway.'\"","url":"https://nationalnewswatch.com/2025/01/04/house-speaker-mike-johnson-held-onto-his-job-but-there-are-signs-of-trouble-ahead","image":"https://assets-nnw.nationalnewswatch.com/articles/_1200x630_crop_center-center_82_none/56a35def90951b5be7124e160c3a98d2a91f39010fb55200e6559fc886293884.jpg?mtime=1735998302","video":null,"publish_date":"2025-01-04 23:48:12","author":"Stephen Groves","authors":["Stephen Groves"],"language":"en","source_country":"ca","sentiment":-0.341},{"id":278320156,"title":"Russia Includes West in 'Retaliation' Warning After Ukraine's ATACMS Attack","text":"Moscow has promised to strike back at Ukraine after claiming the Eastern European nation on Friday had shot a U.S.-supplied missile at its Belgorod region.Newsweek reached out to the Ukrainian and Russian foreign ministries by email on Saturday afternoon for comment.Why It MattersAmid the Russia-Ukraine war, which began in February 2022 when Russian President Vladimir Putin launched his invasion, Kyiv has taken the fight to Russia over recent months, starting with the incursion into Kursk, which caught Moscow and the world by surprise. Within a matter of weeks, Ukraine had seemingly established a permanent presence within the region.President Joe Biden then, following the U.S. presidential election, announced plans to authorize Ukraine to use long-range American weapons to directly strike Russia—something that President-elect Donald Trump later called \"foolish\" and \"a big mistake.\"What To KnowUkraine on Friday launched a strike against Belgorod, but Russia's defense ministry claimed that it shot down all eight U.S.-made Army Tactical Missile System (ATACMS) missiles as well as 72 other aircraft-type unmanned aerial vehicles (UAV).The Russian defense ministry then denounced the attack as a major escalation and said, \"These actions by the Kyiv regime, which is supported by Western curators, will be met with retaliation.\"Amid the conflict, Ukraine has received support from the West, which has allowed Kyiv to bolster its defense efforts and allow its military to launch strong counteroffensives to reclaim occupied territory.ATACMS are a Cold War-era weapon designed to provide the U.S. military with long-range strike capabilities. The missiles travel at high altitudes before descending at immense speeds, making them difficult to intercept.The missiles have a range of up to 190 miles, allowing deep penetration into enemy territory while evading advanced air defense systems. However, deploying the system requires a cost between $1 million and $1.5 million depending on the model.Reporter Dies in Eastern Ukraine in 'Kamikaze' AttackKyiv reportedly followed up with an attack on Saturday morning in which it launched 10 drones, with at least one of those \"kamikaze\" drones allegedly striking a car and killing a Russian journalist.Alexander Martemyanov, who freelanced for Russian newspaper Izvestia, was returning from covering shelling in Ukrainian city of Gorlivka, which is currently held by Russia in Eastern Ukraine, when the drone allegedly struck the car, injuring five other media workers, Russian state news agency RIA reported.What People Are SayingRussian President Vladimir Putin last year threatened to respond to ATACMS use with the \"Oreshnik\" missile, which he has claimed will put nations \"on the verge of virtually eliminating the need to employ nuclear weapons.\"The Kremlin heavily criticized Biden's authorization for Kyiv to use these systems and missiles. Putin's spokesman Dmitry Peskov accused Biden of seeking to \"continue fueling the fire and provoking further escalation of tensions.\"\"If such a decision was really formulated and announced to the Kyiv regime, then of course it's a qualitatively new spiral of tensions and a qualitatively new situation from the point of view of the US's engagement in the conflict,\" Peskov told radio station Mayak in November.What Happens NextRussia has regularly retaliated when threatening to do so, which makes it likely that Moscow will launch a strike of significant magnitude—either in number of missiles or strength of weapon, should the Russian leader choose to deploy the Oreshnik.","summary":"The Kremlin responded to an attempted missile strike on the border territory of Belgorod, which Russia blamed as much on the U.S. for authorizing ATACMS use.","url":"https://www.newsweek.com/russia-includes-west-retaliation-warning-after-ukraines-atacms-attack-2009824","image":"https://d.newsweek.com/en/full/2556557/vladimir-putin-russian-kremlin-defense.jpg","video":null,"publish_date":"2025-01-04 23:46:03","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.267},{"id":278319060,"title":"How Mike Johnson Kept His Speakership","text":"Mike Johnson keeps the speaker’s gavel after Donald Trump persuades holdouts to switch their vote. And we are days away from Kamala Harris presiding over the certification of Trump’s win.\n\nJoin moderator Jeffrey Goldberg, Peter Baker of The New York Times, Leigh Ann Caldwell of Washington Post Live, Francesca Chambers of USA Today, and David Ignatius of The Washington Post to discuss this and more.\n\nWatch the full episode here.","url":"https://www.theatlantic.com/national/archive/2025/01/how-mike-johnson-kept-his-speakership/681213/","image":"https://cdn.theatlantic.com/thumbor/A-EBg0ohH4r8UoWVyUS_aE9g0lA=/0x41:1917x1039/1200x625/media/img/mt/2025/01/still3/original.jpg","video":null,"publish_date":"2025-01-04 23:41:13","author":"The Editors","authors":["The Editors"],"language":"en","source_country":"us","sentiment":0.123},{"id":278318858,"title":"It's Trump's Party Now","text":"Make no mistake about it, this isn’t the GOP of old—it’s Trump’s GOP now, and the events surrounding Rep. Mike Johnson’s rise to the Speaker’s gavel only make that more evident.\n\nTrump’s backing of Johnson was not just a casual endorsement; it was a strategic move to minimize drama and unify the party at a critical time when he need the Republican Party to be unified to get this country back on track after four years of Biden-Harris. Initially, Johnson faced a dozen holdouts, threatening yet another round of Republican disarray. In the end, there were only three holdouts during the first vote—a remarkable turnaround that can be traced back to Trump’s influence.\n\nIn fact, nearly a dozen members of the House Freedom Caucus sent a letter to their Republican colleagues, explaining that their decision to support Speaker Johnson and keep him in his leadership role was ultimately driven by President-elect Donald Trump.\n\nRecommended: Joe Biden Insults Kamala Harris On His Way Out\n\nTwo holdouts, Reps. Ralph Norman and Keith Self, eventually switched their votes. While Norman initially attributed his change to reassurances from Johnson about fiscal priorities, the reality was more telling.\n\n\"I said, ‘Mike, are you going to give us specific examples of fighting for the things we mentioned? Will you give us your word?' He said, ‘Yes.’ So I said, 'OK, we'll take you at your word.' That's why I changed my vote,\" Norman told Fox News on Friday.\n\nHowever, that wasn’t the entire reason. It turns out that a phone call from Trump—who was in the middle of a golf game, no less—sealed the deal. \n\nNorman told CNN that he had a conversation with Trump ahead of Friday’s vote. \"He said 'look I'm in the middle of a golf game,'\" Norman said. He then explained how Trump asked him if he had voted for Nikki Haley in the presidential primaries, and Norman said he replied, \"Yes sir I did, we're with you now, and I said we will be with Mike Johnson.\"\n\nA spokesperson for Norman confirmed to Newsweek that he had two conversations with Trump on Friday before Johnson secured the speakership.\n\n\"He ended up switching his initial vote after Speaker Johnson reassured him that getting our fiscal house in order is a priority for him as well and so that we can move ahead and focus on President Trump's agenda for the next four years,\" the spokesperson told Newsweek.\n\nThis episode underscores Trump’s unique ability to bring even reluctant members of the GOP to heel. Rep. Thomas Massie was the lone dissenter in the end, but Trump’s intervention ensured all other Republicans rallied behind Johnson. His ability to consolidate the party’s support not only avoided further chaos, but also signaled a promising future for the Republican agenda over the next two years.\n\nMore importantly, this is a positive indicator that Trump can keep the GOP united as he embarks on a mission to clean up the mess left by Joe Biden. With the House speaker firmly in place and the party showing signs of cohesion, Trump has set the stage for a unified Republican effort in the months ahead.\n\nLet's hope it lasts.","url":"https://pjmedia.com/matt-margolis/2025/01/04/its-trumps-party-now-n4935673","image":"https://media.townhall.com/cdn/hodl/2024/106/33152966-8fce-4101-a082-e0f129f86450.jpg","video":null,"publish_date":"2025-01-04 23:39:12","author":"Matt Margolis","authors":["Matt Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.034},{"id":278318766,"title":"Hillary Clinton, Denzel Washington, Michael J. Fox awarded Presidential Medal of Freedom","text":"Four medals were awarded posthumously. They went to George W. Romney, who served as both a Michigan governor and secretary of housing and urban development; former Attorney General and Sen. Robert F. Kennedy; Ash Carter, a former secretary of defense; and Fannie Lou Hamer, who founded the Mississippi Freedom Democratic Party and laid the groundwork for the 1965 Voting Rights Act.\n\nKennedy is father to Robert F. Kennedy Jr., President-elect Donald Trump’s nominee for health and human services secretary. Biden said, “Bobby is one of my true political heroes. I love and I miss him dearly.”\n\nRomney is the father of former Utah Republican Sen. Mitt Romney, one of Trump’s strongest conservative critics.\n\nBiden has days left in the Presidential office and has spent the last few days issuing awards and medals to valiant military veterans, courageous law enforcement officials and exceptional Americans.","url":"https://ottawasun.com/news/world/hillary-clinton-george-soros-and-denzel-washington-will-receive-presidential-medal-of-freedom","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/01/hillary-clinton-medal.jpg","video":null,"publish_date":"2025-01-04 23:38:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.186},{"id":278318482,"title":"BAFTA 2025 Longlist: Payal Kapadia's All We Imagina As Light gets three nods, check full list here","text":"The British Academy of Film and Television Arts (BAFTA) has revealed the longlists for the upcoming 2025 BAFTA Film Awards, and leading the charge are two high-profile contenders: Jacques Audiard's 'Emilia Perez' and Edward Berger's 'Conclave'.The longlist was released by the official X handle of BAFTA. Both films have secured prominent places across several categories, with Emilia Perez claiming a record-equalling 15 longlist nominations, as per Deadline. Emilia Perez's 15 nods span a range of categories, including Best Film, Best Director for Jacques Audiard, Adapted Screenplay, Film Not in the English Language, and Leading Actress for Karla Sofia Gascon. The film also garnered support in the Supporting Actress category, with Selena Gomez, Zoe Saldana, and Adriana Paz all securing longlist mentions. This impressive haul matches the previous record set by Edward Berger's 'All Quiet on the Western Front' (2022) and was equalled last year by Christopher Nolan's 'Oppenheimer', Greta Gerwig's 'Barbie', and Martin Scorsese's 'Killers of the Flower Moon'. Trailing closely behind, 'Conclave' amassed 14 nominations, including nods for Best Film, Best Director for Edward Berger, and acting mentions for Ralph Fiennes (Leading Actor), Stanley Tucci (Supporting Actor), and Isabella Rossellini (Supporting Actress), as per Deadline. Other films gaining traction in this year's longlists include Mubi's 'The Substance', which appears on 11 lists, and Brady Corbet's 'The Brutalist', along with 'A Complete Unknown', the Bob Dylan biopic, which also earned 11 longlist mentions. Notably, 'Wicked' and 'Dune: Part Two' both secured 10 longlist spots, as per Deadline. Among other notable films, Sean Baker's 'Anora' scored 9 mentions, while Steve McQueen's 'Blitz' and the subversive Irish indie 'Kneecap' each received 7. Meanwhile, Ali Abbasi's political drama, 'The Apprentice', centred on Donald Trump, earned 6 longlist mentions. Ridley Scott's much-anticipated 'Gladiator II' also made a significant appearance with 9 longlist mentions, predominantly in technical categories such as Costume Design, though Denzel Washington was notably included in the Supporting Actor category. Washington, a two-time Academy Award winner, has yet to receive a BAFTA nomination.On the other hand, Luca Guadagnino's 'Challengers' had a more muted response, with only two longlist mentions in Original Screenplay and Editing. Similarly, Nickel Boys appeared only once in Adapted Screenplay, a surprising omission given its earlier critical buzz. Among the unexpected names featured in this year's longlist is Dev Patel, who received a longlist nod in the Leading Actor category for his performance in 'Monkey Man'. Additionally, Ellen Kuras, who directed the biographical film, 'Lee', earned a rare mention in the Director category. The official nominations will be determined after the next round of voting, which will take place between January 3 and January 10, 2025, as per Deadline. BAFTA film-voting members will cast their votes to finalize the shortlist in each category. The final voting period for determining the winners will take place from January 22 to February 11, 2024, with the prestigious BAFTA Film Awards ceremony set for February 16, 2025. Full Longlist highlights: Best Film Anora The Apprentice The Brutalist A Complete Unknown Conclave Dune: Part Two Emilia Perez Kneecap The Substance Wicked Leading Actress Amy Adams, 'Nightbitch' Karla Sofia Gascon, 'Emilia Perez' Cynthia Erivo, 'Wicked' Demi Moore, 'The Substance' Leading Actor Dev Patel, 'Monkey Man' Ralph Fiennes, 'Conclave' Timothee Chalamet, 'A Complete Unknown' Adrien Brody, 'The Brutalist' Supporting Actress Isabella Rossellini, 'Conclave' Selena Gomez, 'Emilia Perez' Ariana Grande, 'Wicked' Director Jacques Audiard, 'Emilia Perez' Edward Berger, 'Conclave' Denis Villeneuve, 'Dune: Part Two' Payal Kapadia, 'All We Imagine as Light' Film Not in the English Language Emilia Perez The Count of Monte Cristo Kneecap All We Imagine as Light (Except for the headline, this story has not been edited by DNA staff and is published from ANI)","url":"https://www.dnaindia.com/entertainment/report-bafta-2025-longlist-payal-kapadia-s-all-we-imagina-as-light-gets-three-nods-check-full-list-here-3125483","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/04/2670007-phto-2025-01-04t081009.248.png","video":null,"publish_date":"2025-01-04 23:35:13","author":"Varsha Agarwal","authors":["Varsha Agarwal"],"language":"en","source_country":"in","sentiment":0.484},{"id":278318462,"title":"Judge sets Donald Trump's sentencing in hush money case for Jan 10","text":"Donald Trump will be sentenced on January 10 in a criminal case for which he was convicted for silencing a porn star by paying hush money and falsifying business record, a New York judge ruled on Friday (local time). The judge also added that Trump will face no legal penalties for his conviction in the case, CNN reported. Judge Juan Merchan, upholding Trump's conviction, set the sentencing on January 10, however, he indicated that the case is essentially over. Trump had appealed to throw out the jury's verdict because of his reelection in November, CNN reported. The judge in his ruling said that imposing no penalty would bring \"finality\" to the case while allowing Trump to continue pursuing an appeal of the conviction. \"A sentence of an unconditional discharge appears to be the most viable solution to ensure finality and allow Defendant to pursue his appellate options,\" Merchan wrote. According to CNN, the judge also said that he would allow Trump to appear at the sentencing virtually, to assuage the president-elect's concerns about the \"mental and physical demands during this transition period.\" \"It was a smart move by Judge Merchan to announce in advance that he is going to impose no punishment, and hold the proceeding remotely because that undermines any effort by Trump's team to argue in federal court that sentencing imposes some major burden,\" said CNN senior legal analyst Elie Honig said. Trump was convicted in May of last year on 34 counts of falsifying business records last month in connection with a hush money payment his ex-fixer, Cohen, made to Daniels, a porn actor, ahead of the 2016 election to keep her story of an alleged affair with Trump a secret. Trump has denied the affair and vowed to appeal the guilty verdict. That verdict marked a historic moment as Trump became the first president in US history to be convicted of a felony. (This story has not been edited by DNA staff and is published from ANI)","url":"https://www.dnaindia.com/world/report-hush-money-case-donald-trump-to-be-sentenced-on-jan-10-won-t-face-jail-time-3125476","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/04/2670001-image-2025-01-04t062131.220.jpg","video":null,"publish_date":"2025-01-04 23:35:13","author":"Sonali Sharma","authors":["Sonali Sharma"],"language":"en","category":"politics","source_country":"in","sentiment":-0.35},{"id":278318428,"title":"Trump Doctrine: Reimagining US borders with Greenland and beyond","text":"Critics are gearing up to criticize former President Trump for once again suggesting the idea of buying Greenland. He’s not just interested in the land itself but also in taking control of Greenland’s political independence. When Mr Trump first brought up the idea during his presidency, many people made fun of it. Both then and now, the topic could benefit from looking at it with some historical context. In 2019, Denmark, which governs Greenland, dismissed the U.S. president's idea as absurd. In America, critics called the proposal either selfish and grandiose or against the country's values. However, the idea isn’t unusual or exclusive to Trump. Leaders from both political sides have made similar deals in U.S. history. The United States: Built on Purchased Territories Thomas Jefferson (the third U.S. president) purchased Louisiana, a vast territory in North America that stretched from the Mississippi River to the Rocky Mountains, from France in 1803 during his presidency. He later even considered the idea of buying Cuba. When John Quincy Adams was secretary of state, he negotiated a deal with Spain in 1819 to forgive $5 million in claims against Spain. In return, the United States gained control of Florida, which covered the area of present-day Florida. Later, in 1867, Secretary of State William Seward arranged the purchase of Alaska, a massive territory spanning over 586,000 square miles, from Russia for $7.2 million. What Mr. Trump suggests follows a long American tradition and aligns with our current borders. In fact, buying land from other nations has contributed to over 40% of the land that makes up the United States today. This approach has also been accepted internationally. When countries like Spain, France, Mexico, and Russia sold land to the United States, which now makes up a large part of the country, they acknowledged that these kinds of agreements were legitimate. Trump's Vision: Canal and Canada In recent weeks, Trump suggested taking control of the Panama Canal and mentioned that Canada should become the 51st state of the United States. The Panama Canal is located in Panama, a country in Central America. It connects the Atlantic Ocean (via the Caribbean Sea) to the Pacific Ocean and is a key waterway for global trade. Greenland's Dual Identity: Arctic Land, Danish Control Greenland, an Arctic island about three times larger than Texas, has a small population of around 57,000. While geographically located on the North American continent, northeast of Canada, it is politically tied to Europe. The island is an autonomous territory of Denmark, which has governed it for over two centuries and still handles some aspects of its foreign policy. The people of Greenland are Danish citizens and are represented by two members in Denmark's Parliament. Most of Greenland's population consists of Indigenous people. Why Trump wants Greenland? Donald Trump has stated that owning Greenland is important for U.S. national security. The U.S. military operates a base there, called Pituffik Space Base, which plays a key role in missile defense and space monitoring. This base, established during the early Cold War, is strategically located for these missions, according to the U.S. Space Force. Greenland is a massive island, covering over 800,000 square miles (around 2 million square kilometers). It is rich in natural resources like oil and rare earth minerals, such as neodymium and dysprosium. These minerals are essential for making advanced technologies (like electric vehicles, wind turbines, and smartphones) and are mainly sourced from countries like China and Russia, according to the Royal Society of Chemistry. Is Greenland for sale? Greenland is not up for sale, and neither Greenland nor Denmark's officials have suggested the possibility of selling it. Has the United States previously attempted to purchase Greenland? In the 1860s, during President Andrew Johnson's time in office, a report was put together that suggested Greenland could be valuable because of its natural resources. However, the idea of investing in Greenland didn’t gain much support or move forward. Not long after World War II ended, President Harry S. Truman’s administration offered $100 million to buy Greenland. What would the cost be to purchase Greenland? In 2019, The Washington Post estimated that buying Greenland could cost as much as $1.7 trillion, based on its industries and natural resources. However, since Greenland isn’t actually for sale, it doesn’t have a real price. What has occurred following Trump’s most recent remarks? At the end of December 2024, Denmark's Defense Minister revealed a new defense plan for Greenland, valued at about $1.5 billion, according to The Washington Post . Defense Minister Troels Lund Poulsen explained that the decision to increase defense spending in Greenland was made before Trump’s renewed calls to buy the island. He called the timing an “irony of fate” (a surprising or unexpected coincidence). \"We haven’t invested enough in the Arctic for many years, but now we’re planning to strengthen our presence there,\" Poulsen said to a Danish news outlet. The plan includes two long-range drones, two patrol boats, more soldiers, two sled dog teams (dogs trained to pull sleds for transport), and upgrades to the airport so it can handle F-35 fighter jets.","url":"https://www.dnaindia.com/world/report-trump-doctrine-reimagining-us-borders-with-greenland-and-beyond-3125513","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/04/2670040-image-2025-01-04t140237.251.jpg","video":null,"publish_date":"2025-01-04 23:35:13","author":"Girish Linganna","authors":["Girish Linganna"],"language":"en","category":"politics","source_country":"in","sentiment":0.109},{"id":278318396,"title":"Republican Mike Johnson re-elected as US House Speaker","text":"President-elect Donald Trump backed Republican Mike Johnson was re-elected as the US House Speaker in a close race after two opponents switched their votes. Johnson secured the top spot in the chamber with 218 votes, securing just enough support to be re-elected, CNN reported. Johnson's re-election was made possible after key Republican opponents flipped their votes back to Johnson at the last minute. The House speaker Johnson said that he did not make any promises to opponents Keith Self and Ralph Norman to flip their votes. Johnson, who could only lose one vote with the razor-thin majority of 219-215, needed the support of Self and Norman as Republican Rep. Thomas Massie maintained his opposition. According to CNN, Representative Andy Ogles, a Republican from Tennessee, also said that no deals were made to get Johnson's detractors on board, adding that instead, it \"was just a matter of getting it done\" and a result of \"persistence.\" Notable, It was Donald Trump who convinced the opposition representatives to vote for Johnson to secure the victory on the first ballot, multiple sources told CNN. Trump congratulated Johnson after the Republican from Louisiana was elected speaker. \"Congratulations to Speaker Mike Johnson for receiving an unprecedented Vote of Confidence in Congress. Mike will be a Great Speaker, and our Country will be the beneficiary. The People of America have waited four years for Common Sense, Strength, and Leadership. They'll get it now, and America will be greater than ever before!\" Trump posted on Truth Social. The speaker, in his first remark, called for a moment of silence to mark the New Year's Day terrorist attack in New Orleans.\"Of course, these are difficult days in our home state of Louisiana, where I come from,\" Johnson said in the House. \"We all know about the terrorist attack in New Orleans and it's really shaken our state. People are reeling from that attack.\"An ISIS supporter rammed a pickup truck into a crowd on Bourbon Street in New Orleans during New Year celebrations, killing 14 people and injuring dozens more.In 2023, Mike Johnson was elected as the 56th Speaker of the House. (This story has not been edited by DNA staff and is published from ANI)","url":"https://www.dnaindia.com/world/report-republican-mike-johnson-re-elected-as-us-house-speaker-3125480","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/04/2670005-image-2025-01-04t074453.908.jpg","video":null,"publish_date":"2025-01-04 23:35:13","author":"Sonali Sharma","authors":["Sonali Sharma"],"language":"en","category":"politics","source_country":"in","sentiment":-0.166},{"id":278318398,"title":"Apple CEO Tim Cook's big donation to Donald Trump's fund, know cause, amount","text":"According to an Axios article, Tim Cook, the CEO of Apple, has made the decision to contribute $1 million to the inauguration fund of US President-elect Donald Trump. This occurred prior to the January 20 swearing-in of the wealthy Republican leader. According to Cook, the inauguration is an important American custom, and he is participating in the \"spirit of unity.\" Although Cook is giving personally, it is not expected that Apple, the largest taxpayer in the US, will also donate. Trump's inaugural committee has received money pledges from a number of significant businesses and executives. For example, Amazon will stream the event live on Prime Video and donate $1 million. Following comparable donations from Ford and General Motors, who are also supplying vehicles for the occasion, Toyota Motor of North America has committed $1 million. Despite not giving to Trump's campaign before the election, Ken Griffin, the founder of Citadel LLC, would donate $1 million to the financial industry. Uber Technologies and its CEO, Dara Khosrowshahi, are each contributing $1 million, and retail trading platform Robinhood has contributed $2 million. According to a person who spoke to the AP, Trump invited Cook to join him for dinner at his Mar-a-Lago club in Florida on December 13. Following Trump's victory in the 2024 US Elections, business leaders were speculating that the move was an attempt to build a good relationship with him. Trump, who will take office on January 20, said in October that Cook had called him to express concerns about the EU's financial sanctions against Apple. Apple lost its last appeal in a dispute with the EU over past taxes owing to Ireland of 13 billion euros ($14.34 billion), according to an AP report.","url":"https://www.dnaindia.com/world/report-apple-ceo-tim-cook-s-big-donation-to-donald-trump-s-fund-know-cause-amount-3125515","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/04/2670043-image-2025-01-04t143320.630.jpg","video":null,"publish_date":"2025-01-04 23:35:13","author":"Sonali Sharma","authors":["Sonali Sharma"],"language":"en","category":"politics","source_country":"in","sentiment":0},{"id":278318168,"title":"Elon Musk rages against Biden’s decision to honor George Soros with Medal of Freedom: ‘A travesty’","text":"George Soros, investor and philanthropist, was among the 19 individuals conferred with the prestigious US Presidential Medal of Freedom by President Joe Biden on Saturday (January 4). The 2024 list includes individuals from a variety of sectors including politics, sports, philanthropy, and entertainment.George Soros was recognized for his global philanthropic work through the Open Society Foundations, which has supported initiatives focused on democracy, human rights, education, and social justice in over 120 countries.In a press statement issued by the White House, George Soros was recognized as \"an investor, philanthropist, and founder of the Open Society Foundations.\" The White House highlighted his global impact, stating, \"Through his network of foundations, partners, and projects in more than 120 countries, Soros has focused on global initiatives that strengthen democracy, human rights, education, and social justice.\"Controversy over Soros’s awardElon Musk, CEO of Tesla and a prominent figure close to former President Donald Trump, expressed his disapproval on social media over award to Soros. Musk labeled the award a \"travesty,\" posting on X (formerly Twitter), \"A travesty that Biden is giving Soros the Medal of Freedom.\" Other major recipientsOther high-profile figures receiving the award include former Secretary of State Hillary Clinton, football legend Lionel Messi, and celebrated actors Denzel Washington and Michael J. Fox. Four individuals were awarded the medal posthumously: George W. Romney, former Michigan governor and Secretary of Housing and Urban Development; former Attorney General and Senator Robert F. Kennedy; Ash Carter, former Secretary of Defense; and Fannie Lou Hamer, founder of the Mississippi Freedom Democratic Party and a key figure in the 1965 Voting Rights Act.Former Secretary of State Hillary Clinton received a standing ovation as she was honored with the Medal of Freedom. She was joined by her husband, former President Bill Clinton, daughter Chelsea Clinton, and grandchildren at the ceremony.In his opening remarks, President Biden expressed, “For the final time as president I have the honor bestowing the Medal of Freedom, our nation’s highest civilian honor, on a group of extraordinary, truly extraordinary people, who gave their sacred effort, their sacred effort, to shape the culture and the cause of America,” Biden said in his opening remarks.“Let me just say to each of you, thank you, thank you, thank you for all you’ve done to help this country,\" Biden added.In a statement, the White House praised the recipients as \"great leaders who have made America and the world a better place.\" Biden remarked, \"These nineteen individuals are great leaders because they are good people who have made extraordinary contributions to their country and the world.\"The Presidential Medal of FreedomThe Presidential Medal of Freedom is the United States’ highest civilian honor, awarded to individuals who have made extraordinary contributions in areas such as global peace, security, societal well-being, or public and private endeavors. The medal is a symbol of recognition for those whose actions have significantly influenced the prosperity and values of the United States and the world.Other awardees include William Sanford Nye, known for his work in science education and space exploration, and David Rubenstein, lauded for his philanthropic efforts and support for the restoration of historic landmarks in America.Continued legacy of service and leadershipPresident Biden’s statement emphasized that the recipients exemplify the core values of decency, fairness, and commitment to service. \"Great leaders keep the faith, give everyone a fair shot, and put decency above all else,\" Biden said, underscoring that each honoree has worked to advance societal progress through their dedicated efforts in various fields.","url":"https://www.livemint.com/news/us-news/elon-musk-rages-against-biden-s-decision-to-honor-george-soros-with-medal-of-freedom-a-travesty-11736017684333.html","image":"https://www.livemint.com/lm-img/img/2025/01/04/1600x900/Biden-Medal-Of-Freedom-46_1736018928867_1736018944169.jpg","video":null,"publish_date":"2025-01-04 23:33:12","author":"Livemint","authors":["Livemint"],"language":"en","source_country":"in","sentiment":0.324},{"id":278318170,"title":"Elon Musk remains wealthiest billionaire: Here’s the top 10","text":"With a net worth of over $420 billion, Elon Musk kicked off 2025 as the world’s wealthiest individual, followed by Amazon founder Jeff Bezos, who had $233.5 billion, according to Forbes’ latest billionaire rankings. President- Donald Trump’s first buddy witnessed a jump of $91 billion in net worth since 1 December 2024, mainly due to SpaceX’s new valuation of $350 billion.Noteworthy riseForbes’ ranking shows a noteworthy rise in the net worth of the top 10 wealthiest individuals, with their combined wealth reaching $1.9 trillion, up from $1.8 trillion in December. Here’s a look at the top 10 wealthiest people in the world according to Forbes:1. Elon MuskNet worth: $421.2 billionWith a net worth of $421.2 billion, Elon Musk topped the Forbes list. Musk, who founded SpaceX in 2002 and serves as its CEO, also heads Tesla and holds stakes in social media platform X, AI company xAI, and tunnelling firm Boring Co. He owns 13% of Tesla. Before launching SpaceX in 2002 and joining Tesla in 2004, Musk co-founded PayPal, which was later sold to eBay.2. Jeff BezosNet worth: $233.5 billionWith a net worth of $233.5 billion, Amazon founder and Executive Chair Jeff Bezos ranked second on the list. Bezos founded Amazon in 1994 as an online bookstore and later expanded into cloud computing, entertainment, and more. He also owns Blue Origin, a private space company he founded and has invested billions in. Amazon’s stock rose by 5% in December 2024, adding around $10 billion to his wealth.3. Larry EllisonNet worth: $209.7 billionOracle co-founder Larry Ellison, who boasts a net worth of $209.7 billion ranked third on the list. He co-founded the company in 1977 and led as CEO until 2014. He now serves as chairman and CTO. Oracle’s stock dropped over 9% in December 2024, wiping out around $17 billion from his wealth - pushing him down to third spot from the second-richest.4. Mark ZuckerbergNet worth: $202.5 billionMark Zuckerberg, founder, chairman, and CEO of Meta - the company that owns Facebook, the world’s largest social media platform has a net worth of $202.5 billion according to Forbes. He owns about 13% of the company. His net worth rose by 3.8 billion USD in December 2024, driven by a 1.9% increase in Meta shares.5. Bernard ArnaultNet worth: $168.8 billionBernard Arnault who’s the CEO and chairman of luxury goods giant LVMH has a net worth of $168.8 billion. LVMH’s portfolio includes- Christian Dior Couture, Givenchy, Fendi, Celine, Kenzo, Tiffany, Bulgari, Loewe, TAG Heuer, Marc Jacobs, Sephora among others. Over the past month, his net worth rose by 8.5 billion USD, driven by a 7% increase in LVMH shares. Arnault was the world’s richest person for most of 2023 and part of 2024.6. Larry PageNet worth: $156 billionFueled by an 11% rally in Google parent Alphabet’s stock price, Larry Page’s net worth increased by $14 billion to $156 billion. Page cofounded Google with Sergey Brin in 1998 and served as CEO until 2001, and again from 2011 to 2015. He is now a board member of Google’s parent, Alphabet, and retains a controlling stake.7. Sergey BrinNet worth: $149 billionLike his Google cofounder Larry Page, Sergey Brin’s net worth also jumped $14.7 billion in the past month due to an increase in Alphabet’s stock price. This surge pushed him from 8th rank to 7th on the Forbes list of the world’s richest people.8. Warren BuffettNet worth: $141.7 billionThe Oracle of Omaha dropped from Rank 6 to Rank 8 after Berkshire Hathaway’s stock price slipped about 6% in December wiping off $8.9 billion from his net worth. Warren Buffett, storied for his value investment strategy owns major businesses such as insurer Geico, battery maker Duracell, and fast-food chain Dairy Queen.9. Steve BallmerNet worth: 124.3 billionSteve Ballmer, a former classmate of Bill Gates at Harvard, was Microsoft’s CEO from 2000 to 2014. After retiring from Microsoft, Ballmer purchased the Los Angeles Clippers for $2 billion. Presently, Forbes values the team at $5.5 billion. In December, Ballmer’s fortune decreased by approximately $500 million.10. Jensen HuangNet worth: $117.2 billionJensen Huang, the cofounder and CEO of Nvidia, has seen his fortune soar as the company’s chips gained popularity within the AI sector.Thanks to the AI boom, Jensen Huang, the cofounder and CEO of Nvidia, saw a noticeable rise in his fortune. Despite a slight dip in Nvidia shares in December, Huang secured his spot in the top 10 richest.","url":"https://www.livemint.com/companies/people/forbes-rich-list-elon-musk-leads-followed-by-jeff-bezos-and-larry-ellison-11736020434571.html","image":"https://www.livemint.com/lm-img/img/2025/01/04/1600x900/GERMANY-ELECTION-MUSK-0_1736020823538_1736020845398.JPG","video":null,"publish_date":"2025-01-04 23:33:12","author":"Livemint","authors":["Livemint"],"language":"en","source_country":"in","sentiment":0.012},{"id":278317578,"title":"Russia promises retaliation after saying Ukraine fired US-supplied missiles","text":"Russia has pledged to retaliate after it claimed to have shot down eight US-supplied ATACMS missiles fired by Ukraine at its border region of Belgorod.\n\n“On January 3, an attempt was made from Ukrainian territory to launch a missile attack against the Belgorod region using US-made ATACMS operational-tactical missiles,” the Russian Ministry of Defence said on Saturday.\n\n“These actions by the Kyiv regime, which is supported by Western curators, will be met with retaliation,” it added, saying all the missiles were shot down.\n\nThe ministry said earlier that air defences downed eight ATACMS missiles in total, without saying when or where.\n\nOfficials in Ukraine have not yet responded to the accusation.\n\nThe Army Tactical Missile System (ATACMS) has a range of 300km (190 miles) and was first developed in the 1980s.\n\nOutgoing US President Joe Biden had authorised Kyiv to use long-range weapons against Russia last year, in a move the Kremlin denounced as a grave escalation of the nearly three-year conflict. Biden is expected to announce additional security assistance for Ukraine in the coming days, according to White House spokesperson John Kirby.\n\nUS President-elect Donald Trump said in an interview last month he was “very vehemently” opposed to Ukraine using the arms, which he said were “escalating” the conflict.\n\nBesides military support from the US, Kyiv will also reportedly receive its first French Mirage 2000-5F multirole fighters this month, according to French magazine Avions Legendaires.\n\nRussian President Vladimir Putin threatened last year to strike central Kyiv with a hypersonic ballistic missile if Ukraine continued hitting Russian territory with long-range Western weapons.\n\nBoth Kyiv and Moscow have accused each other of fatal attacks on civilians since the year began.\n\nA Russian attack on a village in Ukraine’s northeast Kharkiv region earlier on Saturday killed a 74-year-old man, regional Governor Oleg Synegubov said.\n\nAt least three people, including two children, were wounded in a Russian attack on the Sumy region of northeastern Ukraine on Saturday, local authorities said. Sumy borders Russia’s Kursk region and has been regularly shelled by Russian forces for months.\n\nRussian forces also launched attacks near the Ukrainian city of Pokrovsk in an effort to bypass it from the south and cut off supply routes to Ukraine’s troops, the Ukrainian military said on Saturday.\n\nUkrainian President Volodymyr Zelenskyy noted that Russia had launched 300 attack drones and 20 missiles at Ukrainian targets in the first three days of 2025, but said a large amount was shot down by Kyiv’s forces.\n\n“Such Russian terror, which continues with unrelenting intensity, requires both us and all our partners not to reduce efforts in strengthening our air defence shield and all its systemic components – from Patriot systems to mobile fire groups,” Zelenskyy said on his social media platforms.\n\nUS Secretary of State Antony Blinken will embark on his final trip in office this weekend, travelling to South Korea, Japan, and France.\n\nAt meetings in Paris, he is expected to discuss European security and Russia’s war in Ukraine with French officials, showcasing the Biden administration’s final outreach towards Kyiv before the Trump government takes over.","url":"https://stluciachronicle.com/russia-promises-retaliation-after-saying-ukraine-fired-us-supplied-missiles/","image":"https://stluciachronicle.com/app/uploads/2025/01/AP24260736011836-1726533892_5ee7b4-1726534454-HfxF0l.jpeg","video":null,"publish_date":"2025-01-04 23:26:12","author":null,"language":"en","category":"politics","source_country":"lu","sentiment":-0.151},{"id":278317244,"title":"German chancellor has withering response to Elon Musk over his support for far-right: ‘Don’t feed the troll’","text":"German Chancellor Olaf Scholz has issued a withering response to billionaire Elon Musk’s endorsement of the country’s far-right party, Alternative for Germany.\n\nScholz said it was important to not “feed the troll,” referring to Musk, who recently offered support for the Alternative für Deutschland party — a far-right group — claiming, “only the AfD can save Germany.”\n\n“There are a lot of people on social media who want to attract attention with snappy slogans,” Scholz told the German media outlet Stern. “I don’t believe in courting Mr. Musk’s favor. I’m happy to leave that to others.”\n\nHe added: “There are many people on social media who want to attract attention with shrill slogans. The rule is: don’t feed the troll.”\n\nMusk and Scholz have an ongoing feud, with the billionaire calling the chancellor a “fool” and claiming he’ll lose in the next election, Politico reports. He has also called for Scholz to step down.\n\nChristiane Hoffmann, a spokesperson for the German government, denounced Musk’s endorsement.\n\n“It is indeed the case that Elon Musk is trying to influence the federal election through his statement,” she said.\n\nShe added that “freedom of expression also includes the greatest nonsense.”\n\nThe SpaceX and Tesla owner faced immediate backlash for backing the AfD.\n\nGerman health minister Karl Lauterbach called his support for the far-right party “undignified and highly problematic.” Elmar Brok, a former German MEP, called Musk’s comment, “the world domination fantasies of the American tech kings”.\n\nMusk has scheduled a conversation with AfD leader Alice Weidel for Thursday, according to Politico.\n\nThis comes as Musk appears to be closely advising Donald Trump. The billionaire has been by Trump’s side ever since he won the White House in November.\n\nMusk has also been named as co-chair of the new Department of Government Efficiency. Alongside co-leader Vivek Ramaswamy, Musk has vowed to cut hundreds of millions of dollars from the federal government’s budget in the role.","summary":"Musk backed Germany’s AfD party last month","url":"https://www.independent.co.uk/news/world/americas/us-politics/elon-musk-olaf-scholz-alternative-for-germany-response-b2673864.html","image":"https://static.independent.co.uk/2025/01/02/15/SEI234399278.jpg?width=1200","video":null,"publish_date":"2025-01-04 23:07:15","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":0.087},{"id":278315316,"title":"‘Disgrace’: Clinton awarded Presidential medal","text":"The White House said Ms Clinton, Mr Soros and the 17 other recipients of the prestigious award are “individuals who have made exemplary contributions to the prosperity, values, or security of the United States, world peace, or other significant societal, public or private endeavours.” \n\n“President Biden believes great leaders keep the faith, give everyone a fair shot, and put decency above all else,” the White House said in a statement. \n\nU2 lead singer Bono, soccer star Lionel Messi, Vogue icon Anna Wintour and NBA legend Magic Johnson were also recipients of the award, the NY Post reports. \n\nMs Clinton, 77, received the medal nearly 12 years after her husband, former President Bill Clinton, was bestowed the honour by former President Barack Obama. \n\nThe former first lady, secretary of state and New York senator “made history many times over decades in public service,” the White House said. \n\nThe move has sparked outrage online, with Montana’s new Senator Tim Sheehy also letting his feelings known. \n\n“Hillary Clinton abandoned our Navy SEALs in Libya and George Soros spent millions electing soft-on-crime politicians that let criminals wreak havoc in our major cities,” he said. \n\n“Joe Biden’s decision to give Hillary Clinton and George Soros the Presidential Medal of Freedom is a national disgrace.”\n\nMissouri senator Josh Hawley also expressed his outrage to the NY Post. \n\n“Joe Biden is spending his final days in office asking ‘how can I disgrace myself even more?’ And this is just the latest example. Hillary Clinton should have been prosecuted, not celebrated with the nation’s highest civilian honor,” he said. \n\nIn 2016, Ms Clinton made history when she became the first woman nominated for president by a major United States political party. \n\nHer bid to become the nation’s first female president came up short when President-elect Donald Trump defeated her in the 2016 race. \n\nMs Clinton was the subject of an FBI probe over her use of a private email server during her time in the Obama administration but was never charged with a crime.\n\nAt the conclusion of the bureau’s investigation, former FBI Director James Comey said that Clinton and her colleagues were “extremely careless in their handling of very sensitive, highly classified information” but that the FBI “did not find clear evidence that Ms Clinton or her colleagues intended to violate laws governing the handling of classified information.”\n\nMr Soros, 94, has been one of the most prolific fundraisers for the Democratic Party in recent history. \n\nThe Hungarian-born hedge-fund billionaire gave more than US$175 million to Democrats during the 2022 midterms, according to Federal Election Commission records. \n\nIn 2024, Mr Soros funnelled another US$60 million for House and Senate Democrats and other left-wing causes through his Democracy PAC, records show. \n\nMr Soros, who has shifted tens of billions of dollars of his personal net worth over to his Open Society Foundations, which funds a multitude of progressive projects around the world, has also heavily invested in races to install far-left district attorneys in major American cities.\n\nSoros-backed DAs, including Manhattan’s Alvin Bragg and Philadelphia’s Larry Krasner, have been criticised by Republicans for pursuing priorities such as criminal justice reform over prosecuting criminals.\n\nThe left-wing investor has also come under fire for funnelling tens of millions of dollars to groups supporting anti-Israel protesters on college campuses. \n\nThe White House described Mr Soros as “a philanthropist who four decades ago founded the Open Society Foundations” and “through his network of foundations … has supported organisations, and projects across the world that strengthen democracy, human rights, education, and social justice.”\n\nMr Biden, 82, will also award medals to several Hollywood A-listers, superstar athletes and American cultural icons at Saturday’s ceremony, including:\n\n• Bono, the frontman of rock band U2\n\n• Michael J. Fox, the “Back to the Future” star \n\n• Earvin “Magic” Johnson, a Los Angeles Lakers legend\n\n• Ralph Lauren, the visionary fashion designer\n\n• Lionel Messi, the MLS star and captain of Argentina’s World Cup-winning soccer team \n\n• Denzel Washington, the Academy-Award-winning actor\n\n• Anna Wintour, the editor-in-chief of Vogue\n\n• William Sanford Nye, the television presenter better known as “Bill Nye the Science Guy \n\n• Robert Francis Kennedy, the slain former New York senator and US Attorney-General \n\n• Jane Goodall, the renowned primatologist and anthropologist \n\n• David M. Rubenstein, the billionaire co-founder of The Carlye Group\n\n• José Andrés, the celebrity chef and founder of the World Central Kitchen charity group\n\n• Ashton Baldwin Carter, the former Defense Secretary \n\n• Tim Gill, an entrepreneur whose work has advanced LGBT rights\n\n• George W. Romney, the late businessman and former Michigan governor\n\n• George Stevens, Jr., an author and playwright\n\n• Fannie Lou Hamer, the late civil rights leader and founder of the Mississippi Freedom Democratic Party\n\n- This article originally appeared in The NY Post and was reproduced with permission","summary":"US President Joe Biden has awarded Hillary Clinton the nation’s highest civilian honour in a move which has sparked outrage.","url":"https://www.news.com.au/world/north-america/us-politics/joe-biden-to-present-hillary-clinton-and-18-others-the-presidential-medal-of-freedom/news-story/313022f552fde5b57794c120858f7428?from=rss-basic","image":"https://content.api.news/v3/images/bin/6dfec3525fa1e59e7c87a2a79b6685df","video":null,"publish_date":"2025-01-04 23:05:13","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"au","sentiment":-0.008},{"id":278315590,"title":"Jimmy Carter Funeral Observers Pay Respect to Leader—'Ahead of His Time'","text":"Observers of former President Jimmy Carter's funeral paid their respects Saturday to the late leader who was \"ahead of his time,\" according to a 12-year-old mourner who spoke with the Associated Press.Newsweek reached out to The Carter Center via email for comment Saturday evening.Why It MattersCarter, the 39th president of the United States, died last Sunday at his home in Plains, Georgia, at the age of 100. He was the longest-living president in U.S. history. He is survived by his children, Jack, Chip, Jeff, and Amy, 11 grandchildren, and 14 great-grandchildren.His wife, former first lady Rosalynn Carter, passed away in November 2023. She was buried in Plains where Carter will rest in peace next to her.What To KnowCarter's six-day state funeral commenced Saturday morning as members of the Carter family arrived at Phoebe Sumter Medical Center in Americus, Georgia. The late president's remains were carried into a hearse and a motorcade proceeded through Plains.Observers were seen holding bouquets of flowers and wearing pins with images of Carter. One person held signs that read, \"President Carter, A Man Of Honor!\" and \"Thank you, President Carter!\"Will Porter Shelbrock, just 12 years old, decided to travel from Gainesville, Florida, to Plains with his grandmother.\"We want to pay our respects,\" he told the AP. \"He was ahead of his time on what he tried to do and tried to accomplish.\"Shelbrock, born over three decades after Carter's term, from 1977 to 1981, said he admired Carter's humanitarian work and his acknowledgment of a warming planet before the climate crisis was part of regular political discourse.Willie Browner, who grew up in the nearby town of Parrott, Georgia, and later moved to Miami, told the AP of Carter, \"This man, he thought of more than just himself.\"The 75-year-old said it meant \"a great deal\" to have a president from a small Southern town like his, but he worries something like that will probably not happen again.To look at photos of Carter's funeral, click here.Jimmy Carter's LegacyCarter, a peanut farmer and Navy man, was a breath of fresh air after the Watergate Scandal during former President Richard Nixon's administration. While he made big strides in peace-making abroad with the Camp David Accords between Egypt and Israel, he struggled at home with an energy crisis. The Iranian hostage crisis, in which dozens of Americans were taken hostage for 444 days, all but sealed his fate as a one-term president.Carter is known as the best former president in U.S. history for his work at The Carter Center, created in 1982, with his wife and their work at Habitat for Humanity.The former president was recognized \"for his decades of untiring effort to find peaceful solutions to international conflicts, to advance democracy and human rights, and to promote economic and social development\" with the Nobel Peace Prize in 2002.Carter's Funeral RouteCarter will be remembered and celebrated at a series of different events in Georgia and the country's capital, Washington, D.C.The late president's motorcade proceeded through Plains and briefly stopped at his family's farm in Archery, Georgia. The National Park Service commemorated Carter's life with a salute and rang the farm's bell 39 times.What People Are SayingChip Carter, Jimmy and Rosalynn's second eldest son who is now 72 years old, said in a December 29 statement released by The Carter Center: \"My father was a hero, not only to me but to everyone who believes in peace, human rights, and unselfish love. My brothers, sister, and I shared him with the rest of the world through these common beliefs. The world is our family because of the way he brought people together, and we thank you for honoring his memory by continuing to live these shared beliefs.\"President Joe Biden said in a December 29 statement: \"I do further appoint January 9, 2025, as a National Day of Mourning throughout the United States. I call on the American people to assemble on that day in their respective places of worship, there to pay homage to the memory of President James Earl Carter, Jr. I invite the people of the world who share our grief to join us in this solemn observance.\"President-elect Donald Trump on Truth Social on December 29: \"The challenges Jimmy faced as President came at a pivotal time for our country and he did everything in his power to improve the lives of all Americans,\" he posted on Truth Social. \"For that, we all owe him a debt of gratitude. Melania and I are thinking warmly of the Carter Family and their loved ones during this difficult time. We urge everyone to keep them in their hearts and prayers.\"Georgia Governor Brian Kemp said in a December 29 statement: \"As the only American president thus far to come from Georgia, he showed the world the impact our state and its people have on the country. And as a son of Plains, he always valued Georgians and the virtues of our state, choosing to return to his rural home after his time in public office.\"What Happens NextThe White House has announced that Carter will be honored with a National Day of Mourning on January 9, the final day of services. The American flag will continue to be flown at half-staff until January 28, meaning that it will be flown at half-staff on President-elect Donald Trump's inauguration roughly two weeks from now.This article includes reporting from The Associated Press.","summary":"\"He was ahead of his time on what he tried to do and tried to accomplish,\" Will Porter Shelbrock, 12, told the AP.","url":"https://www.newsweek.com/jimmy-carter-state-funeral-plains-georgia-2009814","image":"https://d.newsweek.com/en/full/2556547/jimmy-carter-funeral.jpg","video":null,"publish_date":"2025-01-04 23:04:46","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"us","sentiment":0.064},{"id":278315584,"title":"President-elect Donald Trump unleashes on ‘crooked Joe Biden’ over January 10 hush money sentencing date","text":"President-elect Donald Trump has unleashed his fury over the “evil” and “illegal” treatment he claims he is being subjected to after being handed a sentencing date by a Manhattan court for his criminal conviction in a hush money case.\n\n“There has never been a president who was so evilly and illegally treated as I,” Mr Trump wrote on Truth Social in a series of posts spanning 12 hours.\n\n“Corrupt Democrat judges and prosecutors have gone against a political opponent of a president, ME, at levels of injustice never seen before.”\n\nMr Trump called the Department of Justice and the FBI “corrupt” as he referenced the raid of his Mar-a-Largo home in 2022, saying it “will go down as one of the ‘dirtiest tricks’ ever perpetrated by one candidate, a dumb as a rock, Sleepy Joe Biden”.\n\nHe described the Manhattan District Attorney’s handling of his case as a “witch hunt”, adding the case should “never have been brought”.\n\n“This illegitimate political attack is nothing but a rigged charade. ’Acting’ Justice Merchan, who is a radical partisan, just issued another order that is knowingly unlawful, goes against our Constitution and, if allowed to stand, would be the end of the presidency as we know it.”\n\nReferencing a gag order that was placed on Mr Trump, the Republican who will be in office as of January 20 said: “I am the only political opponent in American history not allowed to defend myself - A despicable First Amendment Violation!”\n\nWhen will Donald Trump be sentenced in the Manhattan hush money criminal case?\n\nJustice Juan Merchan rules Mr Trump must be sentenced on January 10 in the criminal case in which he was convicted on charges involving hush money paid to a porn star, adding he is not inclined to impose a jail sentence.\n\nJustice Juan Merchan said he denied Mr Trump’s motion to dismiss the case due to his victory in the presidential election.\n\nThe judge said the Republican president-elect may appear for the sentencing, which will take place just 10 days before his inauguration, either in-person or virtually.\n\nJudge Merchan wrote on Friday that a sentence of “unconditional discharge” - meaning no custody, monetary fine, or probation - would be “the most viable solution.”\n\nIn Mr Trump’s second motion to dismiss the case filed since his May conviction, his defence lawyers argued that having the case hanging over him during his presidency would impede his ability to govern.\n\nJudge Merchan rejected that argument, writing that setting aside the jury’s verdict would “undermine the Rule of Law in immeasurable ways.”\n\n“Defendant’s status as president-elect does not require the drastic and ‘rare’ application of (the court’s) authority to grant the (dismissal) motion,” Judge Merchan wrote in the decision.\n\nMr Trump was initially scheduled to be sentenced on November 26, but Judge Merchan pushed that back indefinitely after Mr Trump defeated Democratic Vice President Kamala Harris in the November 5 election.\n\nProsecutors with Manhattan District Attorney Alvin Bragg’s office, which brought the case, said there were measures short of the “extreme remedy” of overturning the jury’s verdict that could assuage Mr Trump’s concerns about being distracted by a criminal case while serving as president.\n\nThey suggested several options for Judge Merchan, including delaying the sentencing until Mr Trump, 78, leaves the White House in 2029, or guaranteeing a sentence that would not involve prison time.\n\nThe prosecutors also said the judge could simply terminate the case with a notation that Mr Trump was never sentenced and his conviction was neither affirmed nor reversed on appeal.\n\nThey said a similar approach was used in cases where a defendant dies after being convicted but before being sentenced.\n\nThe case stemmed from a $US130,000 payment that Mr Trump’s former lawyer Michael Cohen made to adult film actor Stormy Daniels.\n\nThe payment was for her silence before the 2016 election about a sexual encounter she has said she had a decade earlier with Mr Trump, who denies it.\n\nA Manhattan jury in May found Trump guilty of 34 counts of falsifying business records to cover up the payment. It was the first time a US president - former or sitting - had been convicted of or charged with a criminal offence.\n\nMr Trump pleaded not guilty and called the case an attempt by Mr Bragg, a Democrat, to harm his 2024 campaign.\n\nMr Trump on December 16 lost a separate bid to toss the conviction in light of the US Supreme Court’s July 1 decision that presidents cannot be criminally prosecuted over their official actions, and that evidence of their official actions cannot be presented in criminal cases over personal conduct.\n\nIn denying Mr Trump’s motion to dismiss, Judge Merchan said the prosecution over “decidedly personal acts of falsifying business records poses no danger of intrusion on the authority and function of the executive branch”.\n\nFalsifying business records is punishable by up to four years in prison, but incarceration is not required.\n\nBefore his election victory, legal experts said it was unlikely Mr Trump would be locked up due to his lack of a criminal history and advanced age.\n\nMr Trump was charged in three other state and federal criminal cases in 2023: one involving classified documents he kept after leaving office and two others involving his efforts to overturn his 2020 election loss.\n\nHe pleaded not guilty in all three cases. The Justice Department moved to dismiss the two federal cases after Mr Trump’s election victory.\n\nMr Trump’s state criminal case in Georgia over charges stemming from his effort to overturn his 2020 election loss in that state is in limbo.\n\n- With Reuters","summary":"President-elect Donald Trump has unleashed his fury over the ‘evil’ and ‘illegal’ treatment he claims he is being subjected to after being given a sentencing date over his hush money criminal conviction.","url":"https://thewest.com.au/politics/world-politics/president-elect-donald-trump-unleashes-on-crooked-joe-biden-over-january-10-hush-money-sentencing-date-c-17288345","image":"https://images.thewest.com.au/publication/C-17288345/c66ddec3e5346a517f4e9280aa1bd1102acfe87a-16x9-x242y502w7259h4083.jpg?imwidth=1200","video":null,"publish_date":"2025-01-04 23:01:54","author":"Max Corstorphan,Mr Bragg","authors":["Max Corstorphan","Mr Bragg"],"language":"en","category":"politics","source_country":"au","sentiment":-0.546}]}