{"offset":0,"number":50,"available":9892,"news":[{"id":353939366,"title":"Trump says he’s worried about getting into heaven. He should be","text":"When I got there, she roughly pulled me over her lap, yanked my pinafore up and spanked me hard – delivering many whacks. The other students gawked.\n\nI got the message: There was no silver lining to slavery. There is nothing positive to say. Ever. Under any circumstances.\n\nIf only that nun were still around to drill that into the president’s thick skull.\n\nDonald Trump is what the nuns called “a bold, brazen piece”, transgressing in nefarious and damaging ways. He said last week that he’s worried about getting into heaven. He should be. The no-nonsense Franciscan sisters at Nativity would have warned him to worry. He has invented new commandments, beyond the usual 10, to break.\n\nHe told Fox & Friends he hoped that if he brokered peace between Russia and Ukraine, he could slip through the Pearly Gates.","summary":"Trump’s newest painting of himself is a perfect metaphor for the president who sets fires and leaves destruction in his wake.","url":"https://www.brisbanetimes.com.au/world/north-america/trump-says-he-s-worried-about-getting-into-heaven-he-should-be-20250824-p5mpah.html","image":"https://static.ffx.io/images/$zoom_0.5837%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_108%2C$y_0/t_crop_custom/q_86%2Cf_auto/fbad01823edb2a89244cef44f78310fd45013942","video":null,"publish_date":"2025-08-25 01:20:00","author":"Maureen Dowd","authors":["Maureen Dowd"],"language":"en","category":"politics","source_country":"au","sentiment":-0.439},{"id":353937184,"title":"MAUREEN CALLAHAN: Age 26, Melania Trump made a prediction about her life and marriage. It's come true… and it'll drive her enemies absolutely nuts","text":"When she was 26 years old, before she was even married to Donald Trump, Melania Knauss was asked what kind of First Lady she might emulate.\n\n'I would be very traditional, like Jackie Kennedy,' she said in 1999.\n\nThe comparison is more apt than one might think — and it's sure to drive the ultra-progressive left, and the Kennedy wing that deludes itself into thinking they remain American royalty, absolutely nuts.\n\nMelania made her ambitions clear at Trump's first inauguration in 2016.\n\nFor the swearing-in ceremony, she chose a soft, powder-blue knee-length dress with a high-necked tailored jacket and matching gloves — a design by Ralph Lauren and one unmistakably evocative of Jackie Kennedy's 1960 swearing-in look.\n\nNot that Vogue or any other major American fashion bible covered Melania that way, or have acknowledged the similarities between her and Jackie – or have done anything, really, but disparage one of our empirically most beautiful and stylish First Ladies.\n\nIn fact, Vogue made its first ever presidential endorsement in 2016, with Anna Wintour's publication stating there was no choice but to back Hillary Clinton — a Vogue cover star several times over — 'given the profound stakes of this [election].'\n\nCindi Leive, like Wintour another since-departed editor-in-chief, used her then-perch at Glamour magazine to do much the same.\n\n'For me, the only option is Hillary Clinton,' Leive wrote, adding that Trump, 'sports a decade-long resumé of dismissiveness towards women and their concerns.'\n\nAsk those women who voted for Trump over the trans issue and his kept promise to reinstate Title IX protections for girls and women in sports.\n\nOr perhaps Glamour and Vogue could have put questions to Melania, had they — unlike a mass media enthralled with then-Senator John F. Kennedy's wife — looked to her as her husband's best surrogate.\n\nDespite being shunned by the fashion establishment, women's talk shows (cough-cough, The View) and all manner of female-centric podcasts, Melania has kept her cool, her quiet and her dignity.\n\nVery Jackie.\n\nMelania, too, seems to have no illusions about the kind of man she married, and feels no compunction to explain herself.\n\nWhen Trump stood trial in New York City for hush money payments to Stormy Daniels, Melania never once set foot in the courtroom, nor did she stand by his side at any given press conference.\n\nTo my mind, she was clearly taking her cues from Jackie's famous refusal to attend JFK's televised birthday celebration-slash-fundraiser at Madison Square Garden in 1962.\n\nAs Marilyn Monroe slunk onto that stage in a near-transparent gown so tight that she had to be sewn into it, cooing 'Happy Birthday, Mr. President' and all but announcing their affair to the world, Jackie stayed back on her rented farm in Virginia with their small children.\n\nWithout saying a word, Jackie — and later, Melania — made their feelings quite clear.\n\nAnd despite whatever alleged extramarital humiliations their husbands put them through, both asserted their own strength.\n\nJack Kennedy, for all his many transgressions against women, respected Jackie's intellect, her ability to read people and her brilliance at communicating glamour on the world stage.\n\nIt was Jackie who charmed President Charles de Gaulle, and France's mainstream media, on the young American president's first official trip to France.\n\nAs President Kennedy said at a press conference in Paris on June 2, 1961, 'I do not think it altogether inappropriate to introduce myself… I am the man who accompanied Jacqueline Kennedy to Paris, and I have enjoyed it.'\n\nPresident Trump similarly recognizes Melania's abilities to wield her own soft power, never more so than at the opening of his recent peace summit with Vladmir Putin in Alaska.\n\nTrump arrived bearing a letter to Putin from Melania — who grew up in then-Communist Yugoslavia — in which the First Lady wrote that 'every child shares the same quiet dreams in their heart… of love, possibility, and safety from danger' and implored Putin to 'singlehandedly restore their melodic laughter.'\n\nThis was powerful stuff from a First Lady who, much like Jackie, prefers to spend most of her time away from the White House and out of the public eye.\n\nShe did not join her husband on that trip to Alaska, nor at any of the meetings held with Zelensky in D.C.\n\nBut Trump and his top advisers are open about how engaged Melania is in every major decision that crosses his desk.\n\nEven President Trump, who the left universally tars as the worst misogynist to ever inhabit the Oval Office (as someone who literally wrote the book, I'd say JFK gives Trump a run for that title), said as much in July.\n\nAnd he said it during a meeting with NATO Secretary General Mark Rutte — not in an offhand Q&A on a tarmac or a golf course.\n\nTrump said: 'I tell the First Lady, \"You know, I spoke to Vladimir today — we had a wonderful conversation.\" She said, \"Oh really? Another city was just hit.\"'\n\nEven Jill Biden's former White House press secretary Michael LaRosa had to concede that the Putin letter was a masterstroke of soft diplomacy.\n\n'This was an intentional move by President Trump and the First Lady as a team — a move that we do not see very often,' LaRosa told the Daily Mail. 'It's one of the few moments I can recall that I've seen the two of them work brilliantly together as a political force.'\n\nAnd Kellyanne Conway, Trump's 2016 campaign manager, revealed that 'it is Melania's opinion that he has consistently sought. He fears yet reveres her.'\n\nAnd just as Jackie shaped her husband's legacy, it is Melania who will brook no slander against her marriage, threatening to sue Hunter Biden for $1 billion for, as she says, his 'false, disparaging, defamatory and inflammatory' claim that Jeffrey Epstein introduced her to Trump.\n\nJackie was just as formidable.\n\nHad she been First Lady circa now, it's all too easy to imagine her suited up like Melania in her second-term official White House portrait, standing assertively over a reflective table, eyes looking straight at the camera, glamorous yet sending one clear message: If you come for my family, this First Lady will destroy you.","summary":"When she was 26 years old, before she was even married to Donald Trump, Melania Knauss made a prediction.","url":"https://www.dailymail.co.uk/news/article-15030431/Melania-Trump-prediction-marriage-MAUREEN-CALLAHAN.html","image":"https://i.dailymail.co.uk/1s/2025/08/25/01/97796251-0-Melania_s_soft_diplomacy_has_earned_rare_compliments_from_across-a-7_1756080991672.jpg","video":null,"publish_date":"2025-08-25 00:58:52","author":"Editor,Maureen Callahan","authors":["Editor","Maureen Callahan"],"language":"en","source_country":"gb","sentiment":0.188},{"id":353939346,"title":"China says ‘rampant’ US protectionism threatens agricultural ties","text":"BEIJING: US protectionism is undermining agricultural cooperation with China, Beijing’s ambassador to Washington said, warning that farmers should not bear the price of the trade war between the world’s two largest economies. \n\n“It goes without saying that protectionism is rampant, casting a shadow over China-US agricultural cooperation,” said Xie Feng, according to the transcript of a speech published by the Chinese embassy on Saturday. \n\nAgriculture has emerged as a major point of contention between China and the US as the superpowers are locked in a tariff war launched by President Donald Trump. \n\nChina in March slapped levies of up to 15% on $21 billion worth of American agricultural and food products in retaliation for sweeping US tariffs. Washington and Beijing this month extended a truce for 90 days, staving off triple-digit duties on each other’s goods. \n\nUS agricultural exports to China fell 53% in the first half of the year from the same period in 2024, with a 51% decline in soybeans, Xie said in the speech to a soybean industry event in Washington on Friday. \n\n“American farmers, like their Chinese counterparts, are hardworking and humble,” Xie said. “Agriculture should not be hijacked by politics, and farmers should not be made to pay the price of a trade war.” \n\nThe envoy said agriculture is a promising area of cooperation and a “pillar of bilateral relations”. China has a comparative advantage in labour-intensive products, while the US excels in land-intensive bulk commodities through mechanised, large-scale production, he said. \n\nLast month US Agriculture Secretary Brooke Rollins said Washington would curb farmland purchases by “foreign adversaries,” including China. \n\nThe Department of Agriculture said it had fired 70 foreign contract researchers after a national security review intended to secure the US food supply from adversaries including China, Russia, North Korea and Iran. \n\nXie dismissed the US concerns. “Chinese investors hold less than 0.03% of US agricultural land, so where does the claim of ‘threatening US food security’ even come from,” he said, calling the US restrictions a “political manipulation”. \n\nUS soybean exporters risk missing out on billions of dollars worth of sales to China this year as trade talks drag on and buyers in the top oilseed importer lock in cargoes from Brazil for shipment during the key US marketing season, traders say.","summary":"BEIJING: US protectionism is undermining agricultural cooperation with China, Beijing’s ambassador to Washington said, warning that farmers should not bear the price of the trade war between the world’s two largest economies. \n\n\n\n“It goes without saying that protectionism is rampant, casting a shadow over China-US agricultural cooperation,” said Xie Feng, according to the transcript of a speech published by the Chinese embassy on Saturday. \n\n\n\nAgriculture has emerged as a major point of contention between China and the US as the superpowers are locked in a tariff war launched by President Donald Trump. \n\n\n\nChina in March slapped levies of up to 15% on $21 billion worth of American agricultural and food products in retaliation for sweeping US tariffs. Washington and Beijing this month extended a truce for 90 days, staving off triple-digit duties on each other’s goods. \n\n\n\nUS agricultural exports to China fell 53% in the first half of the year from the same period in 2024, with a 51% decline in soybeans, Xie sa","url":"https://www.brecorder.com/news/40379434/china-says-rampant-us-protectionism-threatens-agricultural-ties","image":"https://i.brecorder.com/large/2025/08/68abb3d011b66.jpg","video":null,"publish_date":"2025-08-25 00:52:42","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.521},{"id":353937024,"title":"Trump expands cities targeted for possible military deployment to Baltimore in a spat with governor","text":"APArmed members of the South Carolina National Guard are positioned outside of Union Station in Washington, Sunday, Aug. 24, 2025. \n\nPresident Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland's governor to join him in a tour of Baltimore by saying he might instead \"send in the 'troops.'\" His latest pledge to ramp up the military's presence in left-leaning cities came as at least some National Guard units in the nation's capital began carrying weapons over the weekend, making good on a directive issued Friday by Defense Secretary Pete Hegseth. An Associated Press photographer on Sunday saw members of the South Carolina National Guard outside Union Station with holstered handguns. The most recent developments in Trump's extraordinary effort to override the law enforcement authority of state and local governments came after he said he was considering Chicago and New York for troop deployments similar to what he has unleashed on the nation's capital. Thousands of National Guard and federal law enforcement officers are now patrolling the district's streets, drawing sporadic protests from local residents. Trump made the threat to Baltimore in a spat with Maryland Gov. Wes Moore, a Democrat who has criticized Trump's unprecedented flex of federal power aimed at combatting crime and homelessness in Washington. Moore last week invited Trump to visit his state to discuss public safety and walk the streets. In a Truth Social post on Sunday, Trump said Moore asked \"in a rather nasty and provocative tone,\" and then raised the specter of repeating the National Guard deployment he made in Los Angeles over the objections of California's Democratic governor, Gavin Newsom. Live Events \"Wes Moore's record on Crime is a very bad one, unless he fudges his figures on crime like many of the other 'Blue States' are doing,\" Trump wrote, as he cited a pejorative nickname he uses frequently for the California governor. \"But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the 'troops,' which is being done in nearby DC, and quickly clean up the Crime.\" Moore said he invited Trump to Maryland \"because he seems to enjoy living in this blissful ignorance\" about improving crime rates in Baltimore. After a spike during the pandemic that matched nationwide trends, Baltimore's violent crime rate has fallen. The 200 homicides reported last year were down 24% from the prior year and 42% since 2021, according to city data. Between 2023 and 2024, overall violent crime was down nearly 8% and property crimes down 20%. \"The president is spending all of his time talking about me,\" Moore said on CBS's \"Face the Nation\" on Sunday. \"I'm spending my time talking about the people I serve.\" Trump is \"spouting off a bunch of lies about public safety in Maryland,\" Moore said in a fundraising email. In Washington, where Trump is surging National Guard troops and federal law enforcement officers, a patchwork of protests popped up throughout the city over the weekend, while some normally bustling corners were noticeably quiet. In some of the most populated areas, residents walked by small groups of national guardsmen, often talking among themselves. Videos of arrests and detainments circulated on social media. Trump has said Chicago and New York are most likely his next targets, eliciting strong pushback from Democratic leaders in both states. The Washington Post reported Saturday that the Pentagon has spent weeks preparing for an operation in Chicago that would include National Guard troops and potentially active-duty forces. Asked about the Post report, the White House pointed to Trump's earlier comments discussing his desire to expand his use of military forces to target local crime. \"I think Chicago will be our next,\" Trump told reporters at the White House on Friday, adding, \"And then we'll help with New York.\" Trump has repeatedly described some of the nation's largest cities - run by Democrats, with Black mayors and majority-minority populations - as dangerous and filthy. Baltimore Mayor Brandon Scott is Black, as is Moore. The District of Columbia and New York also have Black mayors. The Rev. Al Sharpton, speaking during a religious event Sunday at Howard University in Washington, said the Guard's presence in the nation's capital was not about crime: \"This is about profiling us.\" \"This is laced with bigotry and racism,\" he later elaborated to reporters. \"Not one white mayor has been designated. And I think this is a civil rights issue, a race issue, and an issue of D.C. statehood.\" Illinois Gov. JB Pritzker, a Democrat, said there is no emergency warranting the deployment of National Guard troops in Chicago. \"Donald Trump is attempting to manufacture a crisis, politicize Americans who serve in uniform, and continue abusing his power to distract from the pain he's causing families,\" Pritzker wrote on X. \"We'll continue to follow the law, stand up for the sovereignty of our state, and protect Illinoisans.\" Chicago Mayor Brandon Johnson said the city doesn't need \"a military occupation\" and would sue to block one. He said there has been no communication from the White House about a possible military deployment. \"We're not going to surrender our humanity to this tyrant,\" Johnson said Sunday on MSNBC. \"I can tell you this, the city of Chicago has a long history of standing up against tyranny, resisting those who wish to undermine the interests of working people.\"(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump military deploymentBaltimore crime ratesNational Guard presenceMaryland Governor Wes MooreChicago troop deploymentTrump Baltimore threatsDemocratic mayorscivil rights issues\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump military deploymentBaltimore crime ratesNational Guard presenceMaryland Governor Wes MooreChicago troop deploymentTrump Baltimore threatsDemocratic mayorscivil rights issues(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"Donald Trump considers deploying troops to cities led by Democrats. This follows deployments in Washington D.C. Maryland's Governor, Wes Moore, invited Trump to discuss public safety. Trump mentioned Chicago and New York as possible targets. Leaders in those cities oppose the idea. Al Sharpton criticizes the move as racially motivated. Illinois Governor, J.B. Pritzker, sees it as a manufactured crisis.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-expands-cities-targeted-for-possible-military-deployment-to-baltimore-in-a-spat-with-governor/articleshow/123491416.cms","image":"https://img.etimg.com/thumb/msid-123491431,width-1200,height-630,imgsize-192658,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-25 00:49:00","author":"Sectionstrump Expands Cities Targeted For Possible Military Deployment To Baltimore In A Spat With G","authors":["Sectionstrump Expands Cities Targeted For Possible Military Deployment To Baltimore In A Spat With G"],"language":"en","category":"politics","source_country":"in","sentiment":-0.21},{"id":353936920,"title":"Aid Freeze by Donor Agencies Takes Toll on Nigeria","text":"Lost 23% of USAID’s country programmes by March 27\n\n*FG confirms half-year negative ODA flows, constrained fiscal space\n\n * WFP suspends hunger programme in North-east \n\nNdubuisi Francis in Abuja\n\nThe massive cut of Official Development Assistance (ODA) from historical donor countries\n\n is already taking a toll on Nigeria and other developing countries, constraining the fiscal space and worsening emergency hunger programme in the North east, among others.\n\nWhile being sworn in for the second time on January 20, 2025, the United States President, Donald Trump had ordered an initial 90-day stoppage of the supply of medical aid related to HIV, malaria, and tuberculosis as well as the supplies of drugs and equipment meant for newborns in USAID-supported countries, including Nigeria.\n\nLatest information made available by the Mo Ibrahim Foundation revealed that USAID had frozen 23 per cent of its entire programmes in Nigeria as of March 27, 2025, representing 0.05 per cent of Gross National Income (GNI).\n\nThe United States alone provided $7.8 billion in foreign aid to Nigeria between 2015 and 2024, supporting sectors like healthcare, security, and economic development.\n\nAs of May 7, 2025 only 891 or 14 per cent of the 6,256 operating USAID global programmes worth $69 billion were sustained (down from $120 billion on January 20, 2025).\n\nIn 2023 (the latest year available), the US contributed 20.7 per cent of total ODA to Africa.\n\nAlthough there is no Nigeria-specific figure of Official Development Assistance (ODA)–a foreign aid metric used by the Organisation for Economic Co-operation and Development (OECD) and Development Assistance Committee (DAC) to measure financial flows from wealthier countries to developing nations, Africa received $42 billion of the global total aid of $212 billion in 2024. \n\nA new publication by the Mo Ibrahim Foundation, titled “Demystifying Africa’s Dependence on Foreign Aid,” net ODA received as a share of GNI has remained more or less the same in Sub-Saharan Africa over the past 20 years, from 2.83 per cent in 2000 to 2.95 per cent in 2022. \n\n“This represents the highest share of all world regions, five times higher than second place Middle East and North Africa at 0.59% in 2022.\n\n“Unlike other regions which remained relatively stagnant, Sub-Saharan Africa was on a downward trend from the historical (since 2000) high of 4.29% in 2006 until 2019. \n\n“However, between 2019 and 2020, ODA received as share of GNI increased from 2.96% to 3.94%, the steepest year-on year rise due to increased disbursements in the wake of COVID-19.\n\n“In 43 out of the 51 African countries with available data, the ODA received-to-GNI ratio increased between 2019-2020, the highest number of countries since 2000. Since 2020, this number of countries has been on a downward trend again, albeit from a much higher starting point,” the report said.\n\nThe Minister of Finance and Coordinating Minister of the Economy, Mr. Wale Edun recently disclosed that Nigeria recorded negative ODA flows in the first half of 2025.\n\nHe said: “One way the fiscal space is constrained; first of all, overseas development assistance–the flow is negative. More countries- (developing) countries are paying back more in terms of repayments, in terms of debt servicing than they are receiving. And that has meant clearly constraint in the fiscal space.”\n\nAccording to preliminary data across all DAC countries, cumulative ODA for all recipients and sectors fell by -7.1 pper cent in 2024 compared to 2023, the first drop after five years of consecutive growth.\n\nTo a large extent, analysts have attributed the drop to increases in ODA to Ukraine.\n\nIn Germany, Africa’s second largest bilateral donor after the US, budget reductions for ODA between 2023 and 2025 amounted to €3 billion ($3.1 billion), or 10.5 per cent . France’s 2025 budget includes a €1.2 billion ($1.4 billion) cut to development aid, bringing it to 18.6 per cent less than 2024. \n\nThe United Kingdom has also reduced development aid by about 6.5 per cent, from £15.3 billion in 2023 to £14.3 billion in 2025.\n\nOf the top ten donors to Africa in 2023, six were multilateral (World Bank, European Union, Global Fund, United Nations, IMF and AfDB), and four Development Assistance Committee (DAC) countries–USA, Germany, France and Japan.\n\nAlthough the federal government announced plans to increase domestic funding for the health sector following the United States’ decision to stop foreign aid to Nigeria and other developing nations, other sectors are already reeling from the cut in foreign aid \n\nOne of the casualties is the hunger programme in the Northeast.\n\nThe World Food Programme (WFP), the United Nations food aid agency and world’s largest provider of food assistance, which catered to some 1.3 million displaced people and others in hard-to-reach areas, fringe locations accessible only by helicopter, was recently forced to shut down over half of all its nutrition clinics across North east Nigeria.\n\nThe UN and its agencies were the focus of aid cuts from the United States in April, leading to the WFP receiving zero aid from the US this year, Other donors such as the European Union and the United Kingdom have also cut back on aid, instead diverting money to security as tensions remain high over Russia’s war in Ukraine.\n\nWith the increasing freezing of aid by traditional donor countries/agencies, the Director General of the World Trade Organisation (WTO), Dr. Ngozi Okonjo-Iweala and others had recently advised African countries to look inwards and explore other funding windows.\n\nShe said: “Some traditional donors have lost faith in the conviction that underpinned aid, the notion that our future prosperity and their future prosperity would go hand in hand. While this is still true, their populations are no longer convinced. \n\n“The world as we know it has changed for aid, trade and development. We are not likely to return to the familiar status quo ante. These shifts present Africa with obvious challenges, but they also contain opportunities for the continent to move forward and deliver better.”","summary":"*Lost 23% of USAID&#8217;s country programmes by March 27 *FG confirms half-year negative ODA flows, constrained fiscal space  * WFP suspends hunger programme in North-east  Ndubuisi Francis in Abuja The\n\n\nThe post Aid Freeze by Donor Agencies Takes Toll on Nigeria appeared first on THISDAYLIVE.","url":"https://www.thisdaylive.com/2025/08/25/aid-freeze-by-donor-agencies-takes-toll-on-nigeria/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/IMG_5379.jpeg","video":null,"publish_date":"2025-08-25 00:45:11","author":"Ayo Yusuf,Donor Agencies Takes","authors":["Ayo Yusuf","Donor Agencies Takes"],"language":"en","source_country":"ng","sentiment":0.089},{"id":353938306,"title":"Judicial implications of ‘emergency’ tariff powers","text":"When President Donald Trump issued Executive Order 14157 and declared a national emergency under the law to target violent drug cartels, the aim sounded urgent and justified.\n\nHe blamed foreign actors, cartels in Latin America, lax border enforcement in Canada, and chemical suppliers in China for flooding the US with deadly fentanyl and other illicit drugs, along with violent criminals and vicious gangs. In response, his administration imposed sweeping ad valorem tariffs ranging from 10 to 50 per cent, not just on targeted industries or nations, but eventually on all imports from nearly every US trading partner.\n\nWhat started as a measure to tackle the drug trafficking cartels and violent gangs soon expanded to all imports across all trading partners.\n\nSeveral businesses and states filed a case in the United States Court of International Trade called V.O.S. Selections, Inc. v. USA (2025). The three-member court ruled that executive orders from President Trump, which imposed broad tariffs under the International Emergency Economic Powers Act (IEEPA), are invalid.\n\nThese tariffs affected imports from Canada, Mexico, China, and other trading partners, citing national emergencies about drug trafficking and trade imbalances.\n\nInstead of simply issuing a stay, the court took the extraordinary step of releasing a summary judgment. The court’s decision not only cancels these tariffs but also confirms the limits of executive power in trade issues. While this case is with the appeals court, the verdict has significant political and economic effects for the world.\n\nFour implications\n\nPolitically, it has four implications. First, the court found that the executive orders issued by President Trump were effectively usurping legislative powers. The court ruled that national emergency powers do not allow the President to unilaterally change trade policy.\n\nThis may set a precedent that could constrain future administrations from using emergency powers as a backdoor to implement broad trade policies without Congressional approval.\n\nSecond, the judgment differentiates between legitimate uses of the IEEPA and overreach. IEEPA was created to allow the President to address “unusual and extraordinary threats” to national security, foreign policy, or the economy. The court found that tariffs imposed under the guise of national emergencies, such as drug trafficking and trade deficits, did not meet the necessary legal standards.\n\nThirdly, this verdict restricts the scope of the IEEPA only to trade matters. It signals to future administrations that national emergencies used to justify broad measures like tariffs must be directly tied to specific trade threats.\n\nFinally, the judgment affects US trade relations in both the short and long term. The tariffs didn’t stop drugs, but they disrupted supply chains, undermined goodwill, and made the US an unpredictable trade partner. The tariffs also led to higher costs for US businesses and consumers. Furthermore, retaliatory measures from trading partners led to lower exports. If the tariffs are removed, it may help reduce tensions and create more stable trade flows.\n\nBeyond the political ramifications, the court order exposes a fundamental economic flaw: tariffs are ineffective against criminal enterprises. Drugs are already banned, and traffickers operate outside legal trade channels, and they don’t pay customs duties. Yet, under the guise of a national emergency, the Trump administration imposed sweeping tariffs not just on illicit goods, but on all imports from all trading partners, damaging legitimate commerce.\n\nMisuse of national security\n\nCombating drug trafficking requires law enforcement, intelligence cooperation, and bilateral cooperation, not tariffs. The solution is to target criminals, not trade.\n\nThe Trump administration’s misuse of national security to justify broad tariffs marked a troubling shift, turning emergency powers into a cover for trade protectionism. This not only undermines democratic norms and global trust in the rule-based international order but also invites similar overreach by other nations, eroding the rules-based trade order.\n\nThe court’s ruling is a crucial correction, a clear message that tariffs require legal authority and that criminal threats demand law enforcement, not economic punishment of lawful trade. The judgment is under appeal, but the logic of the court is impeccable, with implications for all trading countries.\n\nThe writers are faculty, TA Pai Management Institute, Manipal\n\nPublished on August 25, 2025","summary":"The tariffs didn’t stop drugs, but they disrupted supply chains and turned US into an unpredictable trade partner","url":"https://www.thehindubusinessline.com/opinion/judicial-implications-of-emergency-tariff-powers/article69972469.ece","image":"https://bl-i.thgim.com/public/incoming/fivkqc/article69972459.ece/alternates/LANDSCAPE_1200/2025-07-05T031957Z_1383120692_RC23GFA2HTJJ_RTRMADP_3_USA-TRUMP.JPG","video":null,"publish_date":"2025-08-25 00:45:00","author":"N Srinivasa Reddy Meera","authors":["N Srinivasa Reddy Meera"],"language":"en","category":"politics","source_country":"in","sentiment":-0.187},{"id":353937020,"title":"France summons US Ambassador Kushner over 'unacceptable' letter about rising antisemitism","text":"APFILE - Charles Kushner arrives for the funeral of Ivana Trump, July 20, 2022, in New York. \n\nFrance has summoned the American ambassador to Paris after the diplomat, Charles Kushner, wrote a letter to French President Emmanuel Macron alleging the country did not do enough to combat antisemitism. France's foreign ministry issued a statement Sunday announcing it had summoned Kushner to appear Monday at the French Ministry for Europe and Foreign Affairs and that his allegations \"are unacceptable.\" The White House did not immediately respond to a message seeking comment. State Department spokesperson Tommy Pigott on Sunday evening said it stood by Kushner's comments, adding: \"Ambassador Kushner is our U.S. government representative in France and is doing a great job advancing our national interests in that role.\" The summoning of the ambassador is a formal and public notice of displeasure. Kushner, a real-estate developer, is the father of President Donald Trump's son-in-law Jared Kushner.Live Events The French foreign ministry, in its statement, said \"France firmly rejects these allegations\" from Kushner and that French authorities have \"fully mobilized\" to combat a rise in antisemitic acts since the Oct. 7, 2023 attack by Hamas on Israel, deeming the acts \"intolerable.\" The contents of the letter were not released. Kushner's allegations violate international law and the obligation not to interfere with the internal affairs of another country, the French ministry said, and, \"They also fall short of the quality of the transatlantic partnership between France and the United States and of the trust that must prevail between allies.\" The dustup follows Macron's rejection this past week of accusations from Israel Prime Minister Benjamin Netanyahu that France's intention to recognize a Palestinian state is fueling antisemitism. France is home to the largest Jewish population in Western Europe, with an estimated 500,000 Jews. That's approximately 1% of the national population. The diplomatic discord comes as French-U.S. relations have faced tensions this year amid Trump's trade war and a split over the future of U.N. peacekeepers in Lebanon. France in particular has objected to the U.S. push to wind down the peacekeeping operation known as UNIFIL, with a vote on the issue set for the end of the month by the U.N. Security Council. France and the U.S. have also been divided on support for Ukraine in its war with Russia, but the split has eased with Trump expressing support for security guarantees and a warm meeting with Macron and other European leaders at the White House last week. Trump at the end of his first term as president pardoned Charles Kushner, who pleaded guilty years earlier to tax evasion and making illegal campaign donations. His son Jared is a former White House senior adviser to Trump who is married to Trump's eldest daughter, Ivanka.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onFrance summons US AmbassadorKushner letter to MacronFrench foreign ministry statementantisemitism allegationsUS France relationsHamas attack on Israeldiplomatic tensionsCharles Kushner\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onFrance summons US AmbassadorKushner letter to MacronFrench foreign ministry statementantisemitism allegationsUS France relationsHamas attack on Israeldiplomatic tensionsCharles Kushner(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"France summoned the U.S. ambassador, Charles Kushner, after he alleged insufficient action against antisemitism in a letter to President Macron. The French foreign ministry deemed Kushner's allegations \"unacceptable\" and a violation of international law. This diplomatic clash occurs amid existing tensions between France and the U.S. over trade, peacekeeping operations, and support for Ukraine.","url":"https://economictimes.indiatimes.com/news/international/global-trends/france-summons-us-ambassador-kushner-over-unacceptable-letter-about-rising-antisemitism/articleshow/123491359.cms","image":"https://img.etimg.com/thumb/msid-123491362,width-1200,height-630,imgsize-207230,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-25 00:42:14","author":"Sectionsfrance Summons Us Ambassador Kushner Over 'unacceptable' Letter About Rising Antisemitismby","authors":["Sectionsfrance Summons Us Ambassador Kushner Over 'unacceptable' Letter About Rising Antisemitismby"],"language":"en","category":"politics","source_country":"in","sentiment":0.267},{"id":353937068,"title":"South Korea tells China it wants to normalise ties, upgrade economic relations - TradingView","text":"South Korea hopes to normalise relations with China that have been strained in recent years, a special envoy from Seoul told Chinese foreign minister Wang Yi on Sunday, and agreed to boost economic cooperation, Seoul's foreign ministry said.\n\nSouth Korean President Lee Jae Myung sent a special delegation led by former parliament speaker Park Byeong-seug to his country's main trading partner as he travels to Washington to meet U.S. President Donald Trump. \n\n Lee arrived in Washington early on Monday. \n\n Park told Wang he hoped the countries would work together to \"open the door to normalising South Korea-China relations, which have been strained in recent years,\" according to his comments relayed by South Korean TV. \n\n Park handed Wang a letter from Lee to Chinese President Xi Jinping and invited Xi to the summit of the Asia-Pacific Economic Cooperation (APEC) grouping in October, South Korea's foreign ministry said in a statement on Monday.\n\n Wang welcomed the delegation's visit and appreciated the message of developing ties between the countries, the ministry said. \n\n \"(South Korea's) new government will pursue a mature development of South Korea-China strategic cooperation partnership based on national interest while continuing to develop the South Korea-U.S. alliance,\" Park said. \n\n The two sides agreed to work towards substantive progress on economic and supply chain cooperation, the ministry said. \n\nDiplomatic ties between the countries have improved since a 2017 dispute over South Korea's deployment of a U.S. missile defence system, which Beijing opposed. \n\nBut they exchanged harsh words in 2023 about critical comments on Beijing by South Korea's last president, Yoon Suk Yeol.","summary":"South Korea tells China it wants to normalise ties, upgrade economic relations  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3UG06L:0-south-korea-tells-china-it-wants-to-normalise-ties-upgrade-economic-relations/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-08-25 00:42:00","author":"South Korea","authors":["South Korea"],"language":"en","category":"politics","source_country":"gb","sentiment":0.102},{"id":353937706,"title":"France summons U.S. Ambassador Charles Kushner over anti-Semitism accusations","text":"Aug. 24 (UPI) -- France summoned U.S. Ambassador Charles Kushner on Sunday after he published an open letter to French President Emmanuel Macron accusing the government of failing to effectively take action on anti-Semitism.\n\nThe French Foreign Ministry issued a statement to CNN saying Kushner would be expected at the ministry's Paris headquarters Monday.\n\nIn the letter, published Sunday in The Wall Street Journal and dated Monday, Kushner wrote to Macron that he was concerned about \"the dramatic rise of anti-Semitism in France and the lack of sufficient action by your government to confront it.\" Kushner, the father-in-law of President Donald Trump's daughter, Ivanka Trump, has served as the ambassador of France for less than seven weeks.\n\nSince the start of the Israel-Hamas war, \"pro-Hamas extremists and radical activists have waged a campaign of intimidation and violence across Europe,\" Kushner wrote.\n\nThe French Foreign Ministry denied the allegations and called Kushner's comments \"unacceptable.\"\n\n\"The rise in anti-Semitic acts in France since the 7 October, 2023, is a reality that we deplore and against which French authorities are totally mobilized, because these actions are intolerable,\" the ministry said, referencing the Oct. 7, 2023, attacks by Hamas that sparked the Israel-Hamas war.\n\nKushner took issue with France's plans to recognize an independent Palestinian state in September, saying that doing so gives \"legitimacy to Hamas and its allies.\"\n\n\"Public statements haranguing Israel and gestures towards recognition of a Palestinian state emboldened extremists, fuel violence and endanger Jewish life in France,\" Kushner wrote. \"In today's world, anti-Zionism is anti-Semitism -- plain and simple.\"\n\nMacron announced in July that he plans to make a formal statement recognizing Palestine at U.N. headquarters in New York City. He said it was part of France's \"historical commitment to a just and durable peace in the Middle East.\"\n\n\"The urgent priority today is to end the war in Gaza and to bring relief to the civilian population,\" Macron said in a post on X.\n\nSeveral other Western nations have come out in favor of a Palestinian state, including Canada, Spain, Norway and Ireland.\n\nU.S. Secretary of State Marco Rubio said the United States was against France's plans in July.\n\n\"This reckless decision only serves Hamas propaganda and sets back peace. It is a slap in the face to the victims of October 7th,\" he said.\n\nIsraeli Prime Minister Benjamin Netanyahu accused Macron of leading a \"crusade against the Jewish state.\"","summary":"France summoned U.S. Ambassador Charles Kushner on Sunday after he published an open letter to French President Emmanuel Macron accusing the government of failing to effectively take action on anti-Semitism.","url":"https://www.upi.com/Top_News/World-News/2025/08/24/france-Charles-Kushner-ambassador-anti-semitism-Gaza/3701756080747/","image":"https://cdnph.upi.com/sv/ph/og/upi/3701756080747/2025/1/1c730b1f025f05c1a2c694fe23f9563a/v1.5/France-summons-US-ambassador-over-anti-Semitism-accusations.jpg","video":null,"publish_date":"2025-08-25 00:39:39","author":"Danielle Haynes","authors":["Danielle Haynes"],"language":"en","category":"politics","source_country":"US","sentiment":-0.05},{"id":353935920,"title":"As Ukraine marks 24 years of independence: 'Putin will just build up his forces and when Trump's term ends, all this will flare up again. Next time we won't be able to cope'","text":"As Ukraine marks 24 years of independence: 'Putin will just build up his forces and when Trump’s term ends, all this will flare up again. Next time we won’t be able to cope'\n\nBy RICHARD PENDLEBURY AND ANDY JEHRING\n\nPublished: 01:36 BST, 25 August 2025 | Updated: 01:37 BST, 25 August 2025\n\nOnce, in what now feels like an age ago, I described the Donbas coal-mining town of Dobropillia as a ‘safe haven’.\n\nPlain, hardscrabble and dominated by an enormous slag heap, Dobropillia was where refugees who had fled the fighting further east settled in their thousands. In 2023, the Daily Mail’s Ukraine Appeal delivered motorised wheelchairs to its small hospital. Because the town was safe.\n\nEarlier this month, three days before the President of the United States had his soldiers get down on their hands and knees on an Alaskan airfield to roll out the red carpet for the bloody-handed President Putin of Russia, Kremlin forces burst through the Ukrainian defence line near Dobropillia to a depth of six miles. \n\nThey even managed to cut the critical Dobropillia-Kramatorsk highway before being pushed back.\n\nPutin wants to be given the whole of the Donbas under the mooted terms of a Trump-brokered ‘peace’ deal. Trump has said he backs the surrender – or as he calls it, the ‘reshuffling’ – of Ukrainian territory to the Russian invader in order to secure a ‘deal’ to end the fighting.\n\nUkraine would be given ‘security guarantees’ but not be allowed to join Nato. If Ukraine was obstructive the supply of weapons would stop.\n\nCanada's prime minister Mark Carney joins Ukrainian president Volodymyr Zelensky and his wife, Olena Zelenska, as they take part in a wreath laying ceremony in Kyiv on Sunday \n\nMuch has been written about this extraordinary Alaskan summit. But what of the men – and women – who are on the ground, fighting the Russians? Some of them have been at war for more than a decade now. \n\nThey have shed blood and witnessed countless comrades killed and maimed in the defence of their homeland against a far more powerful enemy.\n\nExhausted, would they now support the terms of a Trump-Putin deal, in order to attain ‘peace’? Soldiers have been the pawns of political compromise since history began.\n\nI spoke to a number of Ukrainians on the frontline; among them the defiant, the desperate, the weary. Most are psychologically damaged. All are cynical. They hate not only Putin but Russia. Trump is not well spoken of, either.\n\nWhatever happens, Ukraine has already demonstrated an extraordinary feat of arms – to have kept Russia at bay for so long.\n\nBut the soldiers are not in it for moral victories. This is an existential war. They want Ukraine’s freedom from tyranny. Peace for them still seems a distant dream.\n\nPresident Donald Trump greets Russian president Vladimir Putin in Alaska earlier this month \n\nNot all have been fighting for years. Last week, I was disturbed to learn that among those Ukrainian troops on the critical Dobropillia front is my friend and former colleague, Daria.\n\nBorn in Kramatorsk, she was a postgraduate journalism student in Kyiv at the time of the full-scale Russian invasion. After that, she worked for a medical charity delivering aid to frontline areas and as a field producer for the Mail’s Frontline film series. But earlier this year, Daria joined the Ukrainian army and is now a private in an assault battalion.\n\n‘The most important thing I want to say is that I, and most of my comrades with whom I discussed this, consider territorial concessions a betrayal,’ she tells me. ‘A betrayal to themselves and the betrayal of those guys who died or gave their health defending the country.\n\n‘In the fourth year of a full-scale war, a lot of soldiers have lost that enthusiasm and motivation. But almost everyone I know who has been in the armed forces for a long time holds the opinion that they cannot betray the sacrifices made by their brothers during this war.\n\n‘The appeasement of Putin by the voluntary abandonment of the remnants of the Donetsk region, including my home city, would in my opinion lead to mass protests in the country.\n\nLast week, Richard Pendlebury was disturbed to learn that among those Ukrainian troops on the critical Dobropillia front is his friend and former colleague, Daria, who joined the Ukrainian army and is now a private in an assault battalion\n\n‘It would indicate the absolute inability of the Ukrainian authorities and the world community to protect the interests of the Ukrainian people in the international arena. Such a decision will be an absolute concession to the tyrant. As Churchill famously said: “You cannot reason with a tiger when your head is in its mouth.” ’\n\nHer Churchill reference is typical of the Ukrainian military mindset and its opposition to appeasement. The UK’s experience in the Second World War is often held up by Ukrainians as an example of what can be achieved with backs to the wall. In that respect Churchill is a totem for Ukrainians.\n\nIt’s clear they do not have the same admiration for Trump.\n\nMykhailo, drone operator with the 58th brigade, said of the US President: ‘His desire to bring both sides to peace is of course good, if it is sincere. But unfortunately, he knows little or nothing about Ukraine and the Russian Federation.\n\n‘Where I am fighting, the enemy has a technical advantage, an advantage in people, an advantage in UAVs [Unmanned Aerial Vehicles]. He does not spare the means to destroy our guys. Everything works for them and works well. [The Russians] send small infantry groups forward. If it did not work out this time, they will send the next group.\n\nRichard Pendlebury (far right) and photographer Jamie Wiseman (far left) with, from left, Daria, fixer Olex and Ukrainian soldier Makar\n\n‘I think that they will not reject the idea of capturing Ukraine, because all they have known for the last 100 years is to wage such wars without sparing the lives of their own soldiers. This is truly a war of annihilation. It is not about Ukrainian nationalists but about some existential hatred towards us. They will not drop this matter.’\n\nMakar, the deputy commander of an assault battalion in Donetsk, has an equally bleak view. ‘Zelensky is actually a hostage of the situation,’ he says. ‘Everyone dictates to him what to do. \n\nMeanwhile, Putin has such a psychotype that easily tolerates war, murders – he will not stop. It just won’t happen like that.\n\n‘I don’t know what exactly they will agree on regarding the exchange of territories, maybe rare minerals, or perhaps something else. Let’s be realistic – Ukraine does not have that many resources left. \n\nYes, they will give us weapons, but who will use these means? People remain the main element on the battlefield. Who controls all these means, who shoots, who aims the cannons? We really don’t have any people left.’\n\nWhat does he expect to come from the current negotiations? ‘I think there will be some kind of freeze in hostilities for a short time, so that the Russian Federation can build up some forces and so that we can also rest.\n\n‘A couple of years after Trump’s term ends, all this will flare up again. But next time we won’t be able to cope. Every day dozens of men cross the border (to escape conscription), every day dozens of men die on the front, and there are no replenishments.’\n\nKruger is the middle-aged deputy commander of a fire support company in the 41st Brigade. He has been wounded several times. The last occasion we met was at a cardiac hospital in Kyiv where he was undergoing a heart procedure before returning to the front.\n\nKruger is very cynical about the summit and the chances of a just peace for Ukraine. ‘Trump is Putin’s puppet,’ he says. ‘All these supposedly peaceful negotiations have only one meaning for Putin: he needs a break for about a year to prepare the army and weapons. \n\nPutin stuns Trump with surprise invitation to visit Moscow after peace talks 'didn't get there'\n\nPutin’s calculation is very simple: a truce, even along the line of combat contact. But Russia immediately begins to prepare a second invasion, and we cancel martial law at the request of the United States and hold elections.\n\n‘Elections are always a fierce confrontation here. This time, Russian agents under the guise of heroic corps commanders, battalion commanders and brigade commanders will begin to muddy the waters. And it will be very good if it does not end in a civil war.’\n\nHe believes the Ukrainian army will begin to disintegrate if there is a truce and martial law is lifted. ‘The first to flee will be the mobilized, and then others. “What’s the necessity to sit in a trench?” they will argue. “The war is over!”’\n\n‘And we will have such a fun year – until the next war begins. However, next time there will be no volunteers.’\n\nOther servicemen watched the welcome of the Russian president on American soil with amusement and disbelief.\n\nIn Daria’s increasingly threatened hometown of Kramatorsk, locksmith Dmytro Kotov faces losing everything he has built with his wife Svitlana Kotova and their 14-year-old boy.\n\nThere has been much talk of the strategic gains Putin would make were Washington to strong-arm Kyiv into ceding the roughly 20 per cent of the Donbas his military has failed to seize by force in 12 years of trying.\n\nAnd when Donald Trump spoke breathlessly of ‘land swaps’, it was the lives of Dmytro and hundreds of thousands of others like him that he was referring to. They would be forced to decide whether to live under Russian rule, or become refugees.\n\n‘I would miss the life I’ve lived here,’ Dmytro says, knowing he and his wife, both 39, would be forced to flee – not least as their son has cerebral palsy.\n\n‘We would never stay under Russia, their rule is brutal,’ he says, his voice bristling with anger.\n\n‘My child would never pass their so-called “filtration”. He sings Ukrainian songs, he loves them. With our position, we simply cannot stay.’\n\n‘You always miss the place where you spent your days – where you walked, worked, where your life happened,’ Dmytro says. ‘It’s the familiar streets and pathways, the memories are tied to them – that’s where all the emotions lie.’\n\nLittle wonder, then, that Dmytro watched the spectacle in Alaska two weeks ago with contempt.\n\n‘America was once considered the greatest country in the world, the number one power – a so-called policeman of the world,’ he said. ‘Yet now that “policeman” turns not into a protector but into a businessman. A ruthless one, who pushes and pressures others just to advance his own business ideas.\n\n‘Frankly, he is not far from Putin, who acts like a street thug.’\n\nBut those who live here still believe in their countrymen.\n\n‘We have our own path,’ Dmytro says. ‘Let him say whatever he wants. We must fight for what is ours — for our homes, for our courtyards, for every single piece of our land.\n\n‘The war will end only when one of the countries is exhausted, no longer able to fight. Hopefully, it will be Russia that runs out of strength.’\n\nAdditional reporting by Oleksandr Kostiuchenko and Olha Cherenkova\n\nRussiaUkraine\n\nShare or comment on this article:\nAs Ukraine marks 24 years of independence: 'Putin will just build up his forces and when Trump's term ends, all this will flare up again. Next time we won't be able to cope'\n\nAdd comment","summary":"Once, in what now feels like an age ago, I described the Donbas coal-mining town of Dobropillia as a 'safe haven'.","url":"https://www.dailymail.co.uk/news/article-15029887/As-Ukraine-marks-24-years-independence-Putin-just-build-forces-Trumps-term-ends-flare-time-wont-able-cope.html","image":"https://i.dailymail.co.uk/1s/2025/08/24/22/101507793-0-image-m-19_1756069991321.jpg","video":null,"publish_date":"2025-08-25 00:37:04","author":"Editor,Richard Pendlebury","authors":["Editor","Richard Pendlebury"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.297},{"id":353935836,"title":"Expect Putin to pay big-time for trolling Trump","text":"We expect Russia’s Vladimir Putin and his top minions to soon regret their decision to make a fool of President Donald Trump.\n\nAt their Alaska summit, Putin gave Trump renewed hope for a peace deal on the Ukraine war — but that’s now looking like Lucy setting up Charlie Brown for another football humiliation.\n\nAfter initially signaling openness to a meet, Sergey Lavrov, Putin’s foreign secretary, just dumped yet more cold water on any chance for a Putin sitdown with Ukraine’s Volodymyr Zelensky.\n\nBloviating on NBC’s “Meet the Press,” Lavrov announced, “There is no meeting planned,” and none will happen without advance agreement that fits Putin’s “presidential agenda.”\n\nAnd that agenda is “not ready at all”: Ukraine must publicly agree it will never join NATO, Zelensky must repeal laws that Lavrov claims ban “the Russian language” and concede in advance on “territorial issues” Lavrov wouldn’t specify.\n\nOh, and he reiterated the Russians’ believe that Zelensky isn’t Ukraine’s “legitimate” president, though “we recognize him as the de facto head of the regime.”\n\nThis follows a full week of Lavrov & Co. insisting, for example, that no European troops can be deployed in Ukraine to secure the peace, and indeed demanding a veto over any post-war security guarantees for Kyiv.\n\nThe Russians are also pushing hard for Ukraine to agree in advance that it will cede the half of Donbas that Putin’s been trying to conquer since 2014.\n\nAll of it clearly contradicts the gist of what Vice President JD Vance says Putin agreed to in Anchorage: “They’ve recognized that they’re not going to be able to install a puppet regime in Kyiv, and importantly, they’ve acknowledged that there is going to be some security guarantee to the territorial integrity of Ukraine,” Vance said on the same NBC show.\n\nYes, Putin from the start of his invasion has claimed he means to oust a supposed “neo-Nazi” regime in Kyiv (though Zelensky is Jewish!), and generally insists that Ukraine is really just a part of Russia that never should’ve been independent. So what?\n\nIf Vlad were genuinely willing to discuss a lasting peace deal, he’d have been willing to set those delusions aside, and to order Lavrov and his fellow toadies to quit it.\n\nInstead, Putin has his minions outright trolling not just Zelensky, but Trump himself.\n\nThe American president’s been slowly signaling his displeasure, posting days ago of this war that “it is very hard, if not impossible, to win a war without attacking” the invader’s country — a blatant warning that Washington might give Kyiv added ability to strike deep inside Russia.\n\nThat’s on top of the threats Trump has conspicuously so far left on the table, including secondary sanctions that would cripple Russia’s economy and so its whole war machine.\n\nTrump was beyond clear after Alaska that Putin only had another two weeks to publicly move toward a face-to-face with Zelensky as a key step in reaching a peace accord.\n\nOne week’s already done, and Russia’s done nothing but signal that no sitdown is in sight unless Ukraine basically surrenders in advance on every issue up for discussion.\n\nThat is, Putin’s displaying “the art of the no-deal” — and treating Trump like a sucker for believing everything he said to the contrary in Anchorage.\n\nThe Russian plainly thinks he’ll get away with humiliating the leader of the Free World; it won’t be pretty when Trump finally moves to dispel that delusion.","summary":"We expect Russia’s Vladimir Putin and his top minions to soon regret their decision to make a fool of President Donald Trump.","url":"https://nypost.com/2025/08/24/opinion/expect-putin-to-pay-big-time-for-trolling-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/president-donald-trump-russian-president-109808391-e1756081875143.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-08-25 00:33:25","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.201},{"id":353935588,"title":"Trans volleyball player sparks chaos in California as two more schools take action and FORFEIT games in protest","text":"Trans volleyball player sparks chaos in California as two more schools take action and FORFEIT games in protest\n\nREAD MORE: Mom of besieged trans teen athlete launches furious response\n\nBy BEN NAGLE, US SPORTS EDITOR\n\nPublished: 01:17 BST, 25 August 2025 | Updated: 01:31 BST, 25 August 2025\n\nThe presence of a trans volleyball player in California has sparked chaos as teams continue to forfeit games against Jurupa Valley High School.\n\nAB Hernandez helped the Lady Jags to an unbeaten season and a championship last year, and also recently claimed gold in the high jump and triple jump at the state championships, much to the dismay of furious rival parents.\n\nNow, the current season of women's volleyball is spiraling out of control after two more teams forfeited their game against Jurupa Valley due to the presence of Hernandez on the team.\n\nFox Sports are reporting that both Rim of the World High School and Orange Vista High School have pulled out of upcoming games on August 25 and 29 respectively.\n\nThe news was confirmed by Maribel Munoz, the mother of a female player on Jurupa Valley's roster, who provided copies of the message sent by coach Liana Manu to the parents of players informing them of the news.\n\nIn a statement to Fox, a spokesperson for the school said: 'We understand and acknowledge the disappointment of our Jurupa Valley High School athletes who are ready and prepared to play. \n\nTransgender athlete AB Hernandez dominated a girls' track meet in California earlier this year\n\nHernandez last year helped Jurupa Valley to a championship and undefeated league season\n\n'Decisions to cancel matches were made by teams in other districts. As a public school district in California, JUSD is compelled to follow the law, which protects students from discrimination based on gender identity and requires that students be permitted to participate on athletic teams that are consistent with their gender identity (California Education Code 221.5 (f)). \n\n'This is consistent with the guidance provided by California Attorney General Rob Bonta and California State Superintendent of Public Instruction Tony Thurmond.\n\n'We are proud of our JVHS Jaguars and their willingness to play any team and represent their school and our district with pride. We are currently working to find additional matches to give them that opportunity.'\n\nThe news of the latest two forfeits come after the Riverside Poly Bears also pulled out of a game against Jurupa Valley earlier this month, leaving the team's plans in tatters. \n\nIn response, the mother of Hernandez - Nereyda - attended the Riverside Unified School District board meeting to defend her child, accusing one official of 'moral failure' and 'welcoming harassment.'\n\nDonald Trump signed an executive order entitled: 'Keeping Men Out of Women's Sports'\n\n'You actually entertained and welcomed harassment to my child,' she said to Amanda Vickers, who spoke to Fox News over last week's forfeit.\n\n'You are a board member. You have an oath to protect, to support all children, not just the ones that fit your ideas, your beliefs.' \n\nHernandez continued: 'When you allow or tolerate targeted harassment, whether online, in person or allowing false narratives to be spread at board meetings, you are only failing morally.'\n\nShe insisted her 'daughter is not the problem', pointing the finger instead at 'coordinated external efforts… to spread fear and pit parents against each other using religion as a shield for discrimination. \n\n'This has nothing to do with fairness in sports and everything to do with erasing transgender children. My daughter is a student, an athlete and a girl and she deserves the same protections and dignity as every other child.'\n\nAnother parent accused the board of 'gross negligence' and putting Hernandez 'in danger', claiming the teen has been 'stalked (and) followed'. \n\nBut there were also some who spoke in support of the Riverside Poly players, including Maria Correo, who condemned parents who encourage transgender athletes to play in girls' sports.\n\n'Poly girls, we stand with you. Keep fighting, because these parents that support their confused child are the problem,' Correo said. \n\n'If my child was on drugs, I would love him, but guess what? I would tell him the truth: drugs are bad for you. I would not feed him more drugs.'\n\nTransgender Issues\n\nShare or comment on this article:\nTrans volleyball player sparks chaos in California as two more schools take action and FORFEIT games in protest\n\nAdd comment","summary":"AB Hernandez helped the Lady Jags to an unbeaten season and a championship last year, and also recently claimed gold in the high jump and triple jump at the state championships.","url":"https://www.dailymail.co.uk/sport/othersports/article-15030499/AB-Hernandez-California-Jurupa-Valley-volleyball-forfeit.html","image":"https://i.dailymail.co.uk/1s/2025/08/25/01/98934159-0-Transgender_athlete_AB_Hernandez_dominated_a_girls_track_meet_in-a-23_1756080997570.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/24/8546791556193010189/1024x576_MP4_8546791556193010189.mp4","publish_date":"2025-08-25 00:31:09","author":"Ben Nagle,Editor","authors":["Ben Nagle","Editor"],"language":"en","source_country":"gb","sentiment":0.069},{"id":353938202,"title":"Data points","text":"Spending for job search\n\nIt takes a lot of money to make money, especially when it comes to looking for a job these days. Josh Morgan, 45 years old, was laid off from his senior finance role late last year. After several fruitless months of searching for a new one, he paid a company about $10,000 for six months’ help. The firm provides weekly meetings with a career strategist to evaluate open roles and source potential jobs from talent recruiters. Two converging forces are driving up the cost of finding a job for many Americans. One is the exploding cottage industry of networking and job-search subscriptions, career-coaching services and artificial-intelligence tools — all capitalising on job seekers’ frustrations in a stalled hiring market. The other is the growing length of the average job search as companies slow recruiting and leave positions unfilled.\n\n(Adapted from “Inside The $10,000 Job Search: Career Coaching, LinkedIn Fees, Résumé Help,” by Lindsay Ellis, published on August 10, 2025, by the Wall Street Journal) \n\nTracking the US presidency\n\nDonald Trump claims to have ended six wars in six months and has been angling for a Nobel Peace Prize. Americans are less convinced of his diplomatic prowess. In February, his net approval rating — the share who approve, less the share who disapprove — for foreign policy was two. It has since fallen steadily. In last week’s survey — which began on the day that Mr Trump met Vladimir Putin, Russia’s president, in Alaska and ended on the day Volodymyr Zelensky, his Ukrainian counterpart, visited the White House — it was -14. More Americans think Mr Trump is an ineffective negotiator with foreign leaders than believe he is an effective one. Just 32pc said that the American and Russian presidents made at least some progress towards ending the war. Mr Trump’s net approval rating for his handling of the Ukraine-Russia conflict is -10.\n\n(Adapted from “Tracking The Presidency,” updated on August 23, 2025, by The Economist)\n\nShooting abroad\n\nMarvel is one of many Hollywood companies that have shot in Georgia to take advantage of the state’s generous production tax credits. It made nearly two dozen superhero movies and TV shows in the Atlanta area. But beginning with this summer’s “The Fantastic Four: First Steps,” Marvel is making most of its upcoming content in the United Kingdom. Rising costs in Georgia mean it’s now cheaper to shoot in the UK, according to a person familiar with the matter. Marvel is making two new “Avengers” movies and the next “Spider-Man” at a facility outside London where parent company Disney has a long-term lease. Marvel’s departure is part of a nearly 50pc drop in production spending in Georgia over the past three years. The precipitous decline has raised questions about whether state subsidies built a “Hollywood of the South,” or sparked a gold rush that’s ending faster than it began.\n\n(Adapted from “Disney’s Marvel Abandons Georgia, Taking Livelihoods With It,” by Ben Fritz, published on August 17, 2025, by the Wall Street Journal)\n\nAI takeover\n\nIf artificial-intelligence models have a hometown, it is probably Ashburn, northern Virginia, just outside Washington, DC. Data centres are part of the cluster — the world’s biggest — which last year guzzled more than a quarter of the power produced by Virginia’s main electrical utility. Fears of a slowdown abound in America, with high interest rates and tariff chaos weighing on most of the economy. But they are doing little to reduce the breakneck pace at which firms are building the infrastructure needed for artificial intelligence. Such investment has accounted for some 40pc of America’s real GDP growth over the past year. The trouble is that the very sector powering so much of the country’s economic growth is squeezing the rest of its output. The AI buildout is not a normal investment boom, and it could spell trouble for America if it turns into a bust.\n\n(Adapted from “How America’s AI Boom Is Squeezing The Rest Of The Economy,” by Lindsay Ellis, published on August 10, 2025, by the Wall Street Journal) \n\nPublished in Dawn, The Business and Finance Weekly, August 25th, 2025","summary":"Spending for job search\n\n\n\nIt takes a lot of money to make money, especially when it comes to looking for a job these days. Josh Morgan, 45 years old, was laid off from his senior finance role late last year. After several fruitless months of searching for a new one, he paid a company about $10,000 for six months’ help. The firm provides weekly meetings with a career strategist to evaluate open roles and source potential jobs from talent recruiters. Two converging forces are driving up the cost of finding a job for many Americans. One is the exploding cottage industry of networking and job-search subscriptions, career-coaching services and artificial-intelligence tools — all capitalising on job seekers’ frustrations in a stalled hiring market. The other is the growing length of the average job search as companies slow recruiting and leave positions unfilled.\n\n\n\n(Adapted from “Inside The $10,000 Job Search: Career Coaching, LinkedIn Fees, Résumé Help,” by Lindsay Ellis, published on August 10, 2025, by the Wal","url":"https://www.dawn.com/news/1936980/data-points","image":"https://i.dawn.com/large/2025/08/68ab88abd6852.gif","video":null,"publish_date":"2025-08-25 00:30:05","author":"From the Newspaper","authors":["From the Newspaper"],"language":"en","source_country":"pk","sentiment":-0.024},{"id":353938318,"title":"Below the Line","text":"The Soy Connext 2025 inaugural in Washington had a few humorous moments, particularly when a reference was made to US President Donald Trump.\n\nIt was an indication of how people in the US are shocked by Trump’s statements. For soyabean growers, who attended the event, the concern was over China not buying any beans from the new crop, which is due in a couple of weeks.\n\nJim Sutter, CEO of the US Soybean Export Council, said his organisation had set up a special elevator for the US President to come and make an announcement at the event, leaving the audience bursting out in laughter.\n\nBharat Atta\n\nThe Centre plans to include soya flour in Bharat Atta as part of its efforts to address protein deficiency among the citizens and boost soyabean consumption. A little bird says a similar attempt was made in Gujarat in 2012, when Prime Minister Narendra Modi was its chief minister. However, with irregularities taking place, the scheme wound up soon. Have Modi and his men drawn lessons from that experience?\n\nTrump effect\n\nThe CEO of a leading auto-component maker is so worried about Trump tariffs that the first thing he does early morning these days is read Financial Times and Wall Street Journal rather than Indian newspapers.\n\nEarlier, the first thing he did in the morning was read Indian newspapers.\n\n“I am reading foreign newspapers to know what Trump had to say on the tariff. It’s so worrying and unpredictable,” he says.\n\nOver to ChatGPT\n\nIs it keeping with technology or maintaining secrecy? A hack in Telangana messaged a senior official in the State finance department wanting to know if the official can spare some time. What surprised the scribe was the response: “Message on ChatGPT”!\n\nThe confused scribe wanted to understand how many channels of communications are to be used to get a simple answer — SMS, WhatsApp or ChatGPT!\n\nMarriage advice\n\nSocial media was buzzing with some banter from Tejaswi Yadav at an event in Bihar. To a question on Chirag Paswan, Yadav went on to say that we should stick to issues. My advice to him is: “I am requesting him (Chirag Paswan) to get married soon!” Hearing this, Rahul Gandhi, who was sitting beside Yadav, said: “This is applicable for me too...”, easing the atmosphere!\n\nPublished on August 25, 2025","summary":"","url":"https://www.thehindubusinessline.com/opinion/below-the-line/article69972425.ece","image":"https://www.thehindubusinessline.com/theme/images/og-image.png","video":null,"publish_date":"2025-08-25 00:30:00","author":"Our Bureaus","authors":["Our Bureaus"],"language":"en","category":"sports","source_country":"in","sentiment":-0.026},{"id":353934924,"title":"Trump’s redistricting push could bring decades of Republican rule to the US House","text":"WASHINGTON: President Donald Trump’s push for Republican-led states to redraw their US House of Representatives districts to protect their majority in next year’s midterm elections could set the stage for Republicans to dominate the chamber in decades to come, political analysts and experts said.\n\nRepublicans hold a 219-212 House majority and Trump is looking to break the streak of midterm House losses for the sitting president’s party — as happened to him in 2018 and to Democratic President Joe Biden in 2022 — by pushing states starting with Texas to aggressively redistrict.\n\nDemocratic states, led by California, have threatened to retaliate by redrawing their own districts for partisan gain, a longstanding feature of US politics known as gerrymandering that has grown far more potent thanks to modern data analysis tools.\n\nBut Republicans hold the advantage, with control of the state legislatures and governorships of 23 states, compared with 15 for Democrats. Further, independent analysts say, population shifts could create as many as 11 new congressional seats in Republican Southern and Western states after the 2030 US Census.\n\nDemocrats enjoyed 40 years of unbroken House control beginning in 1955 and ending in 1995 as conservative Southern Democrats defected to the Republican Party in earnest.\n\nThe current redistricting battle has raised concerns about a new era of gerrymandering, with Republicans and Democrats jockeying for advantage and further dividing an already polarized nation.\n\n“I feel like it’s cheating,” said Adam Kinzinger, a Trump critic and former Republican congressman who lost his Illinois seat to redistricting after the 2020 census. “Every time we break a norm in politics now, that norm never comes back. It’ll be an avalanche of constant redistricting. I worry about that.”\n\nThe Republican-controlled Texas state legislature last week passed a new map meant to provide five more Republican seats. The Democratic-led California legislature responded by proposing a map that would give Democrats five more seats, though the state’s voters will have to approve that move in a November special election.\n\nA Reuters/Ipsos poll this month found that most Americans oppose partisan gerrymandering, to the degree that many worry about American democracy itself being in jeopardy.\n\nNonpartisan election analysts currently rate just three dozen of the nation’s 435 House districts as competitive in the 2026 midterm elections, pushing the real contests to party primaries that select more partisan lawmakers less interested in compromise.\n\n“That would be another way of saying that the will of the voters is not being reflected in the outcome of the election,” said Thomas Kahn, acting director of the Center for Congressional and Presidential Studies at American University.\n\n“If Republicans build institutional advantages, whether through fundraising ... or through gerrymandering, then essentially they will be creating a lock on the House. And I don’t think that’s good for democracy,” he added.\n\nDemocratic strongholds including New York and California are already losing population to Florida, Texas, Idaho and other Republican-led states, a trend that many Republicans view as an endorsement of their party’s policies.\n\n“A lot of the voters who are moving from California - the Bay Area - to Austin or Dallas or Boise, Idaho, are the more conservative-leaning folks who want to live in a red state for a variety of reasons: cost of living, laws and regulations, how the state’s run, business environment, stuff like that,” said Will Kiley, spokesman for the National Republican Congressional Committee, the campaign arm of the House Republicans.\n\nThe Reuters/Ipsos poll found that 21% of Republicans and 14% of Democrats have considered moving to a different state where taxes are lower.\n\nThe US Census data that underlies redistricting expectations shows that nearly all of the population growth in states such as Texas and Florida since 2020 has occurred in minority communities.\n\nIn Texas, which is expected to pick up three to four House seats after 2030 according to party redistricting committees, nearly 97% of newcomers are Hispanic, Black or Asian. In Florida, which could add two to four seats, the same groups account for more than three-quarters of the growth, US Census data shows.","summary":"WASHINGTON: President Donald Trump’s push for Republican-led states to redraw their US House of Representatives districts to protect their majority in next year’s midterm elections could set the stage for Republicans to dominate the chamber in decades to come, political analysts and experts said.\n\n\n\nRepublicans hold a 219-212 House majority and Trump is looking to break the streak of midterm House losses for the sitting president’s party — as happened to him in 2018 and to Democratic President Joe Biden in 2022 — by pushing states starting with Texas to aggressively redistrict.\n\n\n\nDemocratic states, led by California, have threatened to retaliate by redrawing their own districts for partisan gain, a longstanding feature of US politics known as gerrymandering that has grown far more potent thanks to modern data analysis tools.\n\n\n\nBut Republicans hold the advantage, with control of the state legislatures and governorships of 23 states, compared with 15 for Democrats. Further, independent analysts say, populatio","url":"https://www.brecorder.com/news/40379431/trumps-redistricting-push-could-bring-decades-of-republican-rule-to-the-us-house","image":"https://i.brecorder.com/large/2025/08/68ab920298ac0.jpg","video":null,"publish_date":"2025-08-25 00:29:26","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.235},{"id":353934920,"title":"Lagarde warns against subverting central bank independence","text":"WASHINGTON: Under-mining a central bank’s independence would trigger economic dysfunction, the European Central Bank’s president warned in remarks in the United States, where President Donald Trump is seeking to shape monetary policy.\n\nSuch independence is “critically important,” Christine Lagarde said in an interview broadcast Sunday on Fox, a network popular with conservatives including Trump, after she attended annual meetings in Jackson Hole, Wyoming alongside US Federal Reserve chair Jerome Powell.\n\n“I have seen close hand what happens when a central bank stops being independent or when its independence is under threat,” said Lagarde, referring to her time working with financial institutions while heading the International Monetary Fund from 2011 until she moved to the ECB in 2019.\n\n“It becomes dysfunctional, it starts doing things that it shouldn’t do,” the French national told Fox News Channel’s “Sunday Morning Futures.” \n\n“And the next step is really — yes, it is disruption. It is instability, if not worse.”\n\nSince returning to power in January, Trump has been pressuring the Fed to lower interest rates, which affect borrowing costs and the overall economy.\n\nWith the US central bank holding rates steady for months, the Republican president has embarked on a campaign to undermine Powell in the hope of hastening his departure from the institution.","summary":"WASHINGTON: Under-mining a central bank’s independence would trigger economic dysfunction, the European Central Bank’s president warned in remarks in the United States, where President Donald Trump is seeking to shape monetary policy.\n\n\n\nSuch independence is “critically important,” Christine Lagarde said in an interview broadcast Sunday on Fox, a network popular with conservatives including Trump, after she attended annual meetings in Jackson Hole, Wyoming alongside US Federal Reserve chair Jerome Powell.\n\n\n\n“I have seen close hand what happens when a central bank stops being independent or when its independence is under threat,” said Lagarde, referring to her time working with financial institutions while heading the International Monetary Fund from 2011 until she moved to the ECB in 2019.\n\n\n\n“It becomes dysfunctional, it starts doing things that it shouldn’t do,” the French national told Fox News Channel’s “Sunday Morning Futures.” \n\n\n\n“And the next step is really — yes, it is disruption. It is instability,","url":"https://www.brecorder.com/news/40379433/lagarde-warns-against-subverting-central-bank-independence","image":"https://i.brecorder.com/large/2025/08/68ab95016ac5a.jpg","video":null,"publish_date":"2025-08-25 00:29:24","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.256},{"id":353936334,"title":"Gavin Newsom has a Trump-trolling merch website. The ‘Bible’ is already ‘sold out’","text":"California Governor Gavin Newsom is now selling merchandise a la Donald Trump — including $100 “Bibles” that are already “sold out” — in his latest move to troll the president.\n\nAfter days of imitating the president’s signature all-caps social media posting style, Newsom capped off a week of trolling Trump with the opening of what he’s calling the “Patriot Shop.” \n\n“THE PATRIOT SHOP IS NOW OPEN!!!!” the Democratic governor announced Sunday in a social media post. “MANY PEOPLE ARE SAYING THIS IS THE GREATEST MERCHANDISE EVER MADE. PLEASE ENJOY, AMERICA!”\n\nIn a direct jab at the president, the website lists a “Holy Bible” signed by “America’s Favorite Governor!” for $100.\n\nThe president’s hefty \"God Bless the USA\" Bibles went for $60 a pop and included the chorus to Lee Greenwood's song by the same name as well as the text of the Constitution, the Bill of Rights, the Declaration of Independence, and the Pledge of Allegiance.\n\nWithin the last several weeks, the California governor has been mocking Trump’s idiomatic all-caps posting style, from his childish nicknames down to his classic sign-off — swapping “DJT” for “GCN.”\n\n“I’m just following [Trump’s] example,” Newsom told reporters last week when asked about his posting strategy. “If you have issues with what I’m putting out, you sure as hell should have concerns with what he’s putting out as president.”\n\nAfter Trump’s allies criticized the governor for carrying Bibles on the website, he wrote: “They still really don’t get it. Honestly incredible.”\n\nThe Patriot Shop also offers a “Trump is not hot” tank top, MAGA red-colored caps emblazoned with “Newsom was right about everything!” and “The Chosen One” T-shirt that features Newsom surrounded by far-right personalities Tucker Carlson, Kid Rock, and Hulk Hogan. Trump in 2019 declared himself “the chosen one.”\n\nThree hours after the merchandise shop launched, Newsom boasted in an X post about its sales: “WOW! $50,000 IN PURCHASES ALREADY!! THANK YOU PATRIOTS!!!”\n\nThe store is administered by Bright Blue Ink, a Texas printshop working on behalf of Campaign For Democracy Committee, according to the website.\n\nThe store serves as Newsom’s latest salvo in his ongoing feud with the president, whose campaign and affiliated entities have monetized his political agenda and even his mugshot to make millions of dollars with Trump-themed sneakers, cryptocurrency, Christmas gift wrap, guitars, perfume, phones, and his line of MAGA hats.\n\nThe attacks have extended offline, too. \n\nNewsom signed legislation this week calling for new congressional maps in California that could amount to five additional Democratic seats in Congress to offset a Trump-led effort to redistrict in Texas for five additional Republican seats.\n\nNewsom’s press office wrote Thursday of the redistricting plan: “THESE ARE ‘PERFECT, BEAUTIFUL’ MAPS. BETTER THAN COLUMBUS, BETTER THAN GOOGLE MAPS, BETTER THAN APPLE MAPS (SORRY TIM, NO GOLD BAR FOR ME, BUT I STILL LOVE YOU!).” \n\n“THE GOLDEN ERA BEGINS IN THE GOLDEN STATE, ALL BECAUSE OF ME, THE PEOPLE’S GOVERNOR, THE CARTOGRAPHER-IN-CHIEF, WHO WILL NOW LET THE PEOPLE VOTE!!! THANK YOU, USA!!!”\n\nNewsom’s proposal came weeks after Trump suggested in July that Texas Republicans redraw the state’s congressional maps so that his party wins more seats in the 2026 midterm elections.\n\nThe president reiterated this idea, telling CNBC’s Squawk Box earlier this month that he was “entitled” to additional seats in Texas: “I got the highest vote in the history of Texas, as you probably know, and we are entitled to five more seats.”\n\nSeparately, the Trump administration sued California’s department of education in July over its policy to allow transgender athletes to compete in girls’ sports. This week, the Trump administration terminated the California State Personal Responsibility Education Program, a federal grant aiming to educate young people on both abstinence and contraception. \n\n“California’s refusal to comply with federal law and remove egregious gender ideology from federally funded sex-ed materials is unacceptable,” Andrew Gradison, the acting assistant secretary at the Administration for Children and Families, said in a statement. \n\nThe California governor’s recent trolling appears to have spurred a “rising tide of support” among voters in his home state, Harry Enten, CNN’s chief data analyst, said.\n\nHe was referring to a recent poll that found that 75 percent of registered Democratic voters said they are “excited” about the prospect of Newsom running for president in 2028.","summary":"‘MANY PEOPLE ARE SAYING THIS IS THE GREATEST MERCHANDISE EVER MADE,’ the governor announced","url":"https://www.independent.co.uk/news/world/americas/us-politics/gavin-newsom-trump-merch-bible-b2813426.html","image":"https://static.independent.co.uk/2025/08/24/23/50/Newsom-launches-The-Patriot-Shop-which-mockingly-offers-MAGA-red-hats-and-100-Holy-Bibles.png?width=1200","video":"https://cdn.jwplayer.com/videos/HltqslHV-OhrQWqOm.mp4","publish_date":"2025-08-25 00:26:06","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.044},{"id":353934852,"title":"Gavin Newsom has a Trump-trolling merch website. The ‘Bible’ is already ‘sold out’","text":"California Governor Gavin Newsom is now selling merchandise a la Donald Trump — including $100 “Bibles” that are already “sold out” — in his latest move to troll the president.\n\nAfter days of imitating the president’s signature all-caps social media posting style, Newsom capped off a week of trolling Trump with the opening of what he’s calling the “Patriot Shop.”\n\n“THE PATRIOT SHOP IS NOW OPEN!!!!” the Democratic governor announced Sunday in a social media post. “MANY PEOPLE ARE SAYING THIS IS THE GREATEST MERCHANDISE EVER MADE. PLEASE ENJOY, AMERICA!”\n\nIn a direct jab at the president, the website lists a “Holy Bible” signed by “America’s Favorite Governor!” for $100.\n\nThe president’s hefty \"God Bless the USA\" Bibles went for $60 a pop and included the chorus to Lee Greenwood's song by the same name as well as the text of the Constitution, the Bill of Rights, the Declaration of Independence, and the Pledge of Allegiance.\n\nWithin the last several weeks, the California governor has been mocking Trump’s idiomatic all-caps posting style, from his childish nicknames down to his classic sign-off — swapping “DJT” for “GCN.”\n\n“I’m just following [Trump’s] example,” Newsom told reporters last week when asked about his posting strategy. “If you have issues with what I’m putting out, you sure as hell should have concerns with what he’s putting out as president.”\n\nAfter Trump’s allies criticized the governor for carrying Bibles on the website, he wrote: “They still really don’t get it. Honestly incredible.”\n\nThe Patriot Shop also offers a “Trump is not hot” tank top, MAGA red-colored caps emblazoned with “Newsom was right about everything!” and “The Chosen One” T-shirt that features Newsom surrounded by far-right personalities Tucker Carlson, Kid Rock, and Hulk Hogan. Trump in 2019 declared himself “the chosen one.”\n\nThree hours after the merchandise shop launched, Newsom boasted in an X post about its sales: “WOW! $50,000 IN PURCHASES ALREADY!! THANK YOU PATRIOTS!!!”\n\nThe store is administered by Bright Blue Ink, a Texas printshop working on behalf of Campaign For Democracy Committee, according to the website.\n\nThe store serves as Newsom’s latest salvo in his ongoing feud with the president, whose campaign and affiliated entities have monetized his political agenda and even his mugshot to make millions of dollars with Trump-themed sneakers, cryptocurrency, Christmas gift wrap, guitars, perfume, phones, and his line of MAGA hats.\n\nThe attacks have extended offline, too.\n\nNewsom signed legislation this week calling for new congressional maps in California that could amount to five additional Democratic seats in Congress to offset a Trump-led effort to redistrict in Texas for five additional Republican seats.\n\nNewsom’s press office wrote Thursday of the redistricting plan: “THESE ARE ‘PERFECT, BEAUTIFUL’ MAPS. BETTER THAN COLUMBUS, BETTER THAN GOOGLE MAPS, BETTER THAN APPLE MAPS (SORRY TIM, NO GOLD BAR FOR ME, BUT I STILL LOVE YOU!).”\n\n“THE GOLDEN ERA BEGINS IN THE GOLDEN STATE, ALL BECAUSE OF ME, THE PEOPLE’S GOVERNOR, THE CARTOGRAPHER-IN-CHIEF, WHO WILL NOW LET THE PEOPLE VOTE!!! THANK YOU, USA!!!”\n\nNewsom’s proposal came weeks after Trump suggested in July that Texas Republicans redraw the state’s congressional maps so that his party wins more seats in the 2026 midterm elections.\n\nThe president reiterated this idea, telling CNBC’s Squawk Box earlier this month that he was “entitled” to additional seats in Texas: “I got the highest vote in the history of Texas, as you probably know, and we are entitled to five more seats.”\n\nSeparately, the Trump administration sued California’s department of education in July over its policy to allow transgender athletes to compete in girls’ sports. This week, the Trump administration terminated the California State Personal Responsibility Education Program, a federal grant aiming to educate young people on both abstinence and contraception.\n\n“California’s refusal to comply with federal law and remove egregious gender ideology from federally funded sex-ed materials is unacceptable,” Andrew Gradison, the acting assistant secretary at the Administration for Children and Families, said in a statement.\n\nThe California governor’s recent trolling appears to have spurred a “rising tide of support” among voters in his home state, Harry Enten, CNN’s chief data analyst, said.\n\nHe was referring to a recent poll that found that 75 percent of registered Democratic voters said they are “excited” about the prospect of Newsom running for president in 2028.","url":"https://uk.news.yahoo.com/gavin-newsom-trump-trolling-merch-002606118.html","image":"https://s.yimg.com/ny/api/res/1.2/bIitRRgzTo8w09v8r4RJWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNDE2O2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/882f51a9f74d5d4802945cb8e9ee8b11","video":"","publish_date":"2025-08-25 00:26:06","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.044},{"id":353936376,"title":"Pentagon says some Guard units in Washington are now carrying firearms as Trump targets more cities","text":"WASHINGTON (AP) — Some National Guard units patrolling the nation’s capital at the direction of President Donald Trump have started carrying firearms, an escalation of his military deployment that makes good on a directive issued late last week by his defense secretary.\n\nA Defense Department official who was not authorized to speak publicly said some units on certain missions would be armed — some with handguns and others with rifles. The spokesperson said that all units with firearms have been trained and are operating under strict rules for use of force.\n\nAn Associated Press photographer on Sunday saw members of the South Carolina National Guard outside Union Station with holstered handguns.\n\nA statement from the joint task force that has taken over policing in the nation’s capital said units began carrying their service weapons on Sunday and that the military’s rules say force should be used “only as a last resort and solely in response to an imminent threat of death or serious bodily harm.” It said the force is committed to protecting “the safety and wellbeing” of Washington’s residents.\n\nThe development in Trump’s extraordinary effort to override the law enforcement authority of state and local governments comes as he is considering expanding the deployments to other Democratic-led cities, including Baltimore, Chicago and New York.\n\nEarlier Sunday, the president threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland’s governor to join him in a tour of Baltimore by saying he might instead “send in the ‘troops.’” He earlier said he was considering deploying troops to Chicago and New York.\n\nThousands of National Guard and federal law enforcement officers are now patrolling the district’s streets, drawing sporadic protests from local residents.\n\nTrump made the threat to Baltimore in a spat with Maryland Gov. Wes Moore, a Democrat who has criticized Trump’s unprecedented flex of federal power aimed at combatting crime and homelessness in Washington. Moore last week invited Trump to visit his state to discuss public safety and walk the streets.\n\nIn a Truth Social post on Sunday, Trump said Moore asked “in a rather nasty and provocative tone,” and then raised the specter of repeating the National Guard deployment he made in Los Angeles over the objections of California’s Democratic governor, Gavin Newsom.\n\n“Wes Moore’s record on Crime is a very bad one, unless he fudges his figures on crime like many of the other ‘Blue States’ are doing,” Trump wrote, as he cited a pejorative nickname he uses frequently for the California governor. “But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the ‘troops,’ which is being done in nearby DC, and quickly clean up the Crime.”\n\nMoore said he invited Trump to Maryland “because he seems to enjoy living in this blissful ignorance” about improving crime rates in Baltimore. After a spike during the pandemic that matched nationwide trends, Baltimore’s violent crime rate has fallen. The 200 homicides reported last year were down 24% from the prior year and 42% since 2021, according to city data. Between 2023 and 2024, overall violent crime was down nearly 8% and property crimes down 20%.\n\n“The president is spending all of his time talking about me,” Moore said on CBS’s “Face the Nation” on Sunday. “I’m spending my time talking about the people I serve.”\n\nTrump is “spouting off a bunch of lies about public safety in Maryland,” Moore said in a fundraising email.\n\nIn Washington, where Trump is surging National Guard troops and federal law enforcement officers, a patchwork of protests popped up throughout the city over the weekend, while some normally bustling corners were noticeably quiet. In some of the most populated areas, residents walked by small groups of national guardsmen, often talking among themselves. Videos of arrests and detainments circulated on social media.\n\nTrump has said Chicago and New York are most likely his next targets, eliciting strong pushback from Democratic leaders in both states. The Washington Post reported Saturday that the Pentagon has spent weeks preparing for an operation in Chicago that would include National Guard troops and potentially active-duty forces.\n\nAsked about the Post report, the White House pointed to Trump’s earlier comments discussing his desire to expand his use of military forces to target local crime.\n\n“I think Chicago will be our next,” Trump told reporters at the White House on Friday, adding, “And then we’ll help with New York.”\n\nTrump has repeatedly described some of the nation’s largest cities — run by Democrats, with Black mayors and majority-minority populations — as dangerous and filthy. Baltimore Mayor Brandon Scott is Black, as is Moore. The District of Columbia and New York also have Black mayors.\n\nThe Rev. Al Sharpton, speaking during a religious event Sunday at Howard University in Washington, said the Guard’s presence in the nation’s capital was not about crime: “This is about profiling us.”\n\n“This is laced with bigotry and racism,” he later elaborated to reporters. “Not one white mayor has been designated. And I think this is a civil rights issue, a race issue, and an issue of D.C. statehood.”\n\nIllinois Gov. JB Pritzker, a Democrat, said there is no emergency warranting the deployment of National Guard troops in Chicago.\n\n“Donald Trump is attempting to manufacture a crisis, politicize Americans who serve in uniform, and continue abusing his power to distract from the pain he’s causing families,” Pritzker wrote on X. “We’ll continue to follow the law, stand up for the sovereignty of our state, and protect Illinoisans.”\n\nChicago Mayor Brandon Johnson said the city doesn’t need “a military occupation” and would sue to block one. He said there has been no communication from the White House about a possible military deployment.\n\n“We’re not going to surrender our humanity to this tyrant,” Johnson said Sunday on MSNBC. “I can tell you this, the city of Chicago has a long history of standing up against tyranny, resisting those who wish to undermine the interests of working people.”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — Some National Guard units patrolling the nation’s capital at the direction of President Donald Trump have started carrying firearms, an escalation of...","url":"https://wsvn.com/news/us-world/pentagon-says-some-guard-units-in-washington-are-now-carrying-firearms-as-trump-targets-more-cities/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/08/081225-National-Guard-troops-in-DC.jpg?quality=60&strip=color","video":null,"publish_date":"2025-08-25 00:23:33","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","category":"politics","source_country":"us","sentiment":-0.095},{"id":353934712,"title":"Warning US cuts to science could put Australian research, lives at risk","text":"Cuts to science agencies in the United States are causing \"turmoil\" in regional research projects run by universities across Australia.\n\nUnder US President Donald Trump, the US-based National Oceanic and Atmospheric Administration (NOAA) had its budget slashed and thousands of jobs cut.\n\nThe NOAA collects real-time data from satellites, airplanes, weather balloons, radar and maritime buoys, which is used by forecasters to help project seasonal conditions ahead of time.\n\nThe impact of the cuts to NOAA is being felt far beyond the US.\n\nAustralia's Bureau of Meteorology (BOM) often relies on US data for its ACCESS model, which produces daily weather forecasts.\n\nAndrew Watkins is a research associate at Melbourne's Monash University and the former head of long-range forecasts at the Bureau of Meteorology.\n\nHe said the cuts would reduce access to crucial datasets, vital for Australia's ability to monitor and predict natural disasters, making regional communities more vulnerable to weather events.\n\nAid cuts to hit Pacific \n\nAcademics at Australian universities say the cuts and deregulation of science will have a ripple effect for regional research.\n\nRegina Souter heads the International Water Centre at Queensland's Griffith University.\n\nHer work also relies on satellite data provided by NOAA to guide efforts to develop clean water and sanitation projects in the Pacific Islands.\n\nDr Souter said her funding was impacted after deep cuts to USAID took place, jeopardising their work.\n\n\"We are working on research projects with UN [United Nations] agencies and those specific projects were funded by USAID.\n\n\"So [because] one of the projects that was funded by USAID was put on hold, that means our ability ... to identify effective development next steps is being hampered.\"\n\nThe UNICEF project had to find funding from other sources and as a result has been severely scaled back.\n\n'Culture of fear'\n\nSome Australian academics fear funding could be cut if their research field becomes a target of the Trump administration.\n\nUniversity of the Sunshine Coast Associate Professor Gail Crimmins said it could discourage researchers from collaborating with the US.\n\nThe McCarthy era was a period in 1950s America characterised by its intolerance of left-leaning ideas amid the spectre of the Cold War and communism.\n\nShe said it was tricky finding people who were happy to come on record and say, \"In Australia, my research has been impacted\".\n\n\"Because by doing so we are exposing our colleagues to potential further surveillance and potentially harmful impacts on their academic careers,\" she said.\n\nLooking elsewhere\n\nAcademics say researchers need to look beyond the United States for funding and scientific data.\n\nA regional Queensland climate and marine scientist said working with large datasets you needed to be able to have almost unrestricted and uninterrupted access.\n\nHe asked the ABC to remain anonymous because he feared retaliation from the US administration toward both himself, and colleagues here and overseas.\n\n\"If we don't have access to the data from the earth system models, we can't make those projections, we can't assess those opportunities and risks.\"\n\nAssociate Professor Naomi Barnes from the Queensland University of Technology said the concerns about scientific research in the United States led her team to consider working with European partners instead.\n\n\"Part of our grant was an international collaboration grant funded by the Australian Government,\" she said.\n\n\"We were going to go to the US and talk through this [our project] with colleagues.\n\n\"Two out of three of us have agreed that we need to probably look elsewhere, other than the US.\"\n\nShe said fortunately she could still fulfil the objective by going to Europe.\n\nFederal support needed \n\nIn reaction to the uncertainty enveloping joint US-Australian projects, there were calls for the federal government to step in.\n\nQUT's Dr Barnes said federal support would help researchers and experts continue their work without the US.\n\nUSC's Dr Crimmins said the government must \"protect the dignity of that research\" at risk by US cuts.\n\nIn a statement, the Australian Department of Education said it was already investing significantly in research, and monitoring changes to joint projects with the US.\n\n\"Across the Australian government, total investment in research and development is projected to reach about $15.14 billion in the 2025-26 financial year,\" the statement said.\n\nAustralia's Department of Foreign Affairs and Trade said in a statement it was committed to supporting aid work in the Pacific.\n\n\"Recognising the impact of global aid cuts, we have re-prioritised our development assistance to dedicate 75 cents of every Australian development dollar to support the Indo-Pacific next year,\" a spokesperson said.","summary":"Academics say cuts to US-based scientific agencies could make predicting emergency weather in Australia more difficult, with other critical research projects also at risk. ","url":"https://www.abc.net.au/news/2025-08-25/australian-academics-us-funding-cuts-will-hurt-local-research/105684772","image":"https://live-production.wcms.abc-cdn.net.au/d7938db97f62e6f60229aa22e1d4d078?impolicy=wcms_crop_resize&cropH=312&cropW=554&xPos=0&yPos=52&width=862&height=485","video":null,"publish_date":"2025-08-25 00:18:29","author":"Jay Carstens","authors":["Jay Carstens"],"language":"en","source_country":"AU","sentiment":0.077},{"id":353934510,"title":"World News | Trump Administration Planning to Send National Guard to Chicago Amid Crime Crackdown","text":"Washington [US], August 25 (ANI): As part of US President Donald Trump's efforts to expand anti-crime and immigration crackdown, the administration has been planning for weeks to deploy the National Guard to Chicago, CNN reported, citing officials.\nIt remains unclear how many troops may be sent to Chicago or when such deployments could begin. Trump appeared to signal the plans during an Oval Office statement on Friday, saying, \"I think Chicago will be our next, and then we'll help with New York.\"\nAlso Read | Volodymyr Zelensky Playing a 'Game' Over Call to Meet Vladimir Putin, EU Prolonging Conflict, Accuses Russian Foreign Minister Sergey Lavrov.\nDemocrat Mayor of Chicago Brandon Johnson said the city has not been contacted by the White House regarding any potential deployment or increased federal law enforcement presence, calling such a move \"uncalled for\" and \"unlawful.\"\n\"There are many things the federal government could do to help us reduce crime and violence in Chicago, but sending in the military is not one of them,\" Johnson said.\nAlso Read | Russia-Ukraine War: Ukrainian Drone Strike Causes Fire at Kursk Nuclear Power Plant; No Injuries Reported.\nCNN, citing MSNBC, reported that the mayor has vowed to take legal action if Trump sends troops into the city, adding that \"the people of this city are accustomed to rising up against tyranny.\"\nJohnson further warned, \"What he is proposing at this point would be the most flagrant violation of our Constitution in the 21st century. The city of Chicago does not need a military occupation. That's not what we need. In fact, we've been very clear about what we need. We need to invest in people to ensure that we can build safe and affordable communities.\"\nThe White House, when approached for comment on Saturday, referred CNN to the president's Oval Office remarks, noting that Trump had not communicated with Mayor Johnson about any concrete steps toward a federal crackdown in Chicago.\nA Pentagon spokesperson told CNN, \"We won't speculate on further operations. The Department is a planning organisation and is continuously working with other agency partners on plans to protect federal assets and personnel.\"\nIllinois Governor JB Pritzker stated that he has not received any communication from the federal government, and Illinois has not requested federal assistance. \"The safety of the people of Illinois is always my top priority. There is no emergency that warrants the President of the United States federalising the Illinois National Guard, deploying the National Guard from other states, or sending active-duty military within our own borders,\" Pritzker said.\nThe plan reflects the Trump administration's recent efforts to use military forces for domestic law enforcement and immigration actions. In June, Trump invoked Title 10 of the US Code to deploy approximately 700 active-duty Marines and 4,000 National Guard troops to Los Angeles despite objections from California Governor Gavin Newsom. Title 10 allows the president to deploy the National Guard to repel invasion, suppress rebellion, or execute federal laws, meaning the forces report directly to the president rather than the governor. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  As part of US President Donald Trump's efforts to expand anti-crime and immigration crackdown, the administration has been planning for weeks to deploy the National Guard to Chicago, CNN reported, citing officials.","url":"https://www.latestly.com/agency-news/world-news-trump-administration-planning-to-send-national-guard-to-chicago-amid-crime-crackdown-7075687.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250824192235.jpg","video":null,"publish_date":"2025-08-25 00:18:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.228},{"id":353934854,"title":"Duke of York faces fresh Epstein revelations in book by accuser","text":"Virginia Giuffre, the sex trafficking victim who accused the Duke of York of sex crimes, has reportedly written an autobiography which will be published posthumously later this year.\n\nMs Giuffre, who claimed she was forced to have sex with the Duke when she was 17, is said to have finished her memoir more than a year ago.\n\nShe died by suicide at the age of 41 in April, with her family calling her a “fierce warrior” who “will always be remembered for her incredible courage”.\n\nHer book, called Nobody’s Girl, will now be published in the US on October 21.\n\nThe memoir, which is expected to detail Ms Giuffre’s experience at the hands of Jeffrey Epstein and Ghislaine Maxwell, will place further pressure on the Duke, who made a multi-million-pound out-of-court settlement with his accuser.\n\nThe claims – of sexual abuse and rape – have never been tested in a court of law, and the Duke has vehemently and repeatedly denied them.\n\nThe Duke has already stepped back from public duty as a result of the fallout of his friendship with Epstein, and a television interview in which he denied meeting Ms Giuffre.\n\nOn the night she said she had met him, he said he had been at Pizza Express in Woking with one of his daughters. His allies have claimed that a photograph of the Duke and Ms Giuffre together in London was falsified.\n\nMs Giuffre was one of the most high-profile victims of paedophile financier Epstein, who died by suicide in prison in 2019, and Maxwell, a British socialite who is serving a 20-year prison sentence in the US for recruiting under-age girls.\n\nThe mother of three’s memoir will be published by Penguin Random House, which also published the Duke of Sussex’s memoir Spare, according to The Sun.\n\nSources told the newspaper publication was initially held back because of her health issues.\n\nA spokesman for Knopf, a division of Random House, confirmed they would be publishing the book despite Ms Giuffre previously having a seven-figure contract with Penguin Press.\n\nThe book is reported to feature more revelations about her time with Epstein, Ghislaine Maxwell and their friends, including the Duke of York.\n\nTed Doughty, from the publishing house, did not give details of which Epstein associates feature in the book, but did say Ms Giuffre made no allegations of abuse against Donald Trump.\n\nJordan Pavlin, the editor-in-chief of Knopf, described the memoir as a “raw and shocking journey and the story of a fierce spirit struggling to break free”.\n\nA US source said: “Virginia’s family have seen her maligned in life and in death, and they feel very strongly that her whole story should be told.”\n\nThe Duke has already stepped back from public life, no longer retaining royal patronages or honorary military roles, and appearing only on what the palace now describes as “family occasions”.\n\nOn Sunday, he did not attend church at Balmoral with the Royal family. The King, Queen, Prince and Princess of Wales and their children, the Princess Royal and Duke of Edinburgh all attended Crathie Kirk during the family’s annual summer holiday.\n\nThe Duke of York, who has been staying with his ex-wife Sarah, Duchess of York, at Craigowan Lodge on the estate, was seen driving elsewhere.\n\nThe Duke and Duchess have come under significant pressure this summer, after an explosive biography by Andrew Lownie revisited details of their complicated finances and sexual exploits.\n\nThe new memoir, by Ms Giuffre, may cause further embarrassment for the Duke, despite the details of her allegations against him already being in the public domain.\n\nA recent poll found that two thirds of Britons would like Prince Andrew stripped of his titles.\n\nOn Friday, the US Justice Department released transcripts of an interview it carried out with Maxwell in prison.\n\nIn the interview, Maxwell claimed Sarah, Duchess of York, tried to “put the moves” on Epstein.\n\nShe said: “I thought that Sarah was trying to put the moves on Jeffrey, if I’m being honest, and I thought the whole thing was annoying and I was p----d off.\n\n“I think Sarah is the one that pushed that. And they met and hung out, I want to say two or three times that had nothing to do with me.\n\n“I wasn’t communicating with Andrew, I wasn’t in touch with him. And I know this because I was annoyed and I felt left out, and I felt disrespected and I was like, this is weird. I couldn’t even imagine Epstein and Andrew together.”\n\nSpokesmen for the Duke and Duchess of York have not commented.","url":"https://uk.news.yahoo.com/duke-york-accuser-life-story-211918701.html","image":"https://s.yimg.com/ny/api/res/1.2/hBo8dPUnqQUIXKtKmn3d9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNTAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_telegraph_818/5a79afae9286c4f984c6849fcf201a70","video":null,"publish_date":"2025-08-25 00:12:02","author":"Gwyn Wright","authors":["Gwyn Wright"],"language":"en","source_country":"gb","sentiment":0.058},{"id":353932542,"title":"Memories of the Panama Invasion Rekindled as U.S. Deploys Warships to Caribbean","text":"As three Navy destroyers and three amphibious warships move toward the coast of Venezuela this weekend in an ostensible U.S. counter-narcotics operation, the Trump administration’s show of force is rekindling memories of another presidency, era and country. In mid-December 1989, President George H.W. Bush ordered a military invasion of Panama, saying its strongman leader, Manuel Noriega, a one-time American ally and CIA informant, was a threat to U.S. interests in the Canal Zone and a corrupt general wanted on drug-trafficking charges for turning his country into a narco-state for Colombian cartels. During Operation Just Cause, the U.S. troops not only used force but blasted rock music, including songs by the band Guns ‘n’ Roses, as Noriega took sanctuary in the Vatican Embassy in Panama City.\n\nHe surrendered on Jan. 3, 1990, and was whisked away to Miami, where he would later stand trial, be convicted and spend about 20 years in prison. Two South Florida lawyers — one who charged Noriega and another who defended him — say that it may look like President Donald Trump has ripped a page out of the Panama playbook as U.S. Naval forces veer toward Venezuela. But attorneys Richard “Dick” Gregorie and Jon May point out there are similarities and differences between then and now. They also say it’s unlikely that Trump, who has an avowed aversion for committing U.S. troops in warfare around the globe, would risk invading a country the size of Venezuela. Venezuelan President Nicolás Maduro, like Noriega at the height of the U.S. war on drugs, was indicted by a New York grand jury on drug-trafficking charges in 2020.\n\nBut Maduro is the leader of an oil- and mineral-rich country that, despite its economic troubles, is far larger and more powerful than Panama. Moreover, Maduro doesn’t exert the same degree of control over his military as the Panamanian dictator did over his forces in the 1980s. “There’s a big difference between the situations that were going on in Panama at the time than what is going in Venezuela,” Gregorie said in an interview on Friday. “There’s something else going on [other] than drug trafficking,” added Gregorie, who worked as a high-level federal prosecutor in Miami and other parts of the country for more than 40 years before his retirement in 2018. “That’s not the reason why Trump is sending those ships down there.\n\n“There’s more going on and intelligence that I don’t have access to,” he said, noting Venezuela’s ties to Iran and the South American country’s substantial mineral resources. May, who along with attorney Frank Rubino defended Noriega at his 1992 trial in Miami, agreed with the former prosecutor, saying that while Maduro and Noriega seem like similar targets as accused drug traffickers in the United States, invading Venezuela would be foolish. “I can’t imagine the United States invading Venezuela – other than the crazy factor,” May said, noting that Trump’s sending the fleet of destroyers and warships to Venezuela is a “modest” mission, but perhaps “just enough saber rattling” to help him and the Republicans in the midterm elections next year.\n\n“It was really easy for the U.S. military to crush Panama,” he said, “but it would not be the same thing in Venezuela. You have a highly motivated army in Venezuela that would provide stiff resistance. It would be suicidal.” Another major difference: Even before the American invasion of Panama in late 1989, the U.S. military already had more than 12,000 troops stationed at bases in the Central American country, plus warships, planes and vehicles. The Pentagon estimated that more than 500 Panamanians were killed during the invasion, including more than 300 soldiers and 200 civilians. A total of 23 U.S. soldiers and three U.S. civilians were killed. \n\nThe United Nations General Assembly, the Organization of American States and the European Parliament condemned the invasion as a violation of international law. Indeed, using U.S. forces to invade Panama and capture Noriega in a law-enforcement operation in a foreign country was highly controversial at the time. Once Noriega surrendered and no longer posed a threat to U.S. interests in the Canal Zone, the U.S. military turned him over to federal agents. “There was no basis for our military to hold him as a prisoner, which is why he was turned over by the Marines to the DEA on the flight home,” May said. Because of the legal and political complexity of the case, it took until 1992 for the U.S. Attorney’s office — led by prosecutors Michael “Pat” Sullivan, Guy Lewis and Myles Malman — to convict Noriega of cocaine trafficking and racketeering.\n\n“It was the mother of all battles in the war on drugs,” Malman told the Miami Herald in 2010. “There was so much riding on it — the reputations of the prosecutors, the U.S. government and the president of the United States.” After the trial, U.S. District Judge William Hoeveler declared Noriega a prisoner of war who should be accorded special privileges, including an apartment-like cell — complete with phone, color TV and exercise bike — at the low-security Southwest Miami-Dade federal prison. His sentence ended in September 2007, but Noriega remained behind bars for another three years, when he was extradited to France to face money laundering charges. In 2017, he died at 83 in Panama.\n\nNaval Fleet Headed to Venezuela\n\nTwo U.S. officials familiar with the Trump administration’s deployment told the Reuters news agency that three Navy warships — the USS San Antonio, USS Iwo Jima and USS Fort Lauderdale — could be stationed off the coast of Venezuela as early as Sunday. Together, the ships are carrying 4,500 service members, including a 2,200-strong Marine expeditionary unit. The amphibious squadron will operate alongside three Arleigh Burke-class guided-missile destroyers — the USS Sampson, USS Jason Dunham and USS Gravely — which are designed to counter threats from the air, land, sea and even undersea simultaneously. The destroyers’ arsenal centers on a 96-cell vertical launch system that can be loaded with a mix of weapons, including Tomahawk cruise missiles for long-range land attacks, standard missiles for air and missile defense, and anti-submarine rockets for undersea warfare.\n\nBy adding amphibious vessels, the task force gains expanded land capabilities, particularly the ability to quickly deploy Marines into coastal zones. The Pentagon has not publicly disclosed the ships’ mission, but sources told the news agency that the move aligns with the Trump administration’s aims at addressing threats to U.S. national security from specially designated “narco-terrorist organizations” in the region. Speaking about the possible use of U.S. military personnel in Venezuela, the White House said that the deployment underscores Trump’s pledge to use every instrument of American power — from sanctions to military force — to stop narcotics from reaching U.S. soil. \n\n“President Trump has been very clear and consistent: he’s prepared to use every element of American power to stop drugs from flooding into our country and to bring those responsible to justice,” said White House press secretary Karoline Leavitt after being asked by a McClatchy reporter on the chances of a boots on the ground operation taking place inside the South American nation. Cracking down on drug cartels is a pillar of Trump’s domestic and foreign policy. Earlier this year, the administration formally designated Mexico’s Sinaloa Cartel, Venezuela’s Tren de Aragua gang and several other groups as global terrorist organizations. The move gave U.S. agencies expanded authority to target cartel finances, logistics and leadership. \n\nLast month, the Trump administration designated the Cartel of the Suns — which U.S. prosecutors say is run by Maduro and other high-ranking members of his regime — as a “Specially Designated Global Terrorist” entity. The designation raises the possibility that the cartel could become a direct target of U.S. military action if Trump chooses. The administration also recently raised the bounty for Maduro’s capture to an unprecedented $50 million. Maduro and several of his top allies have been indicted by U.S. prosecutors for allegedly turning Venezuela into a narco-state Cartel of the Suns. Maduro has dismissed the charges as a “rotting rerun” aimed at justifying foreign intervention.\n\nIn response to the U.S. military buildup in the Caribbean, Maduro announced on Monday that his government will activate a plan to mobilize more than 4.5 million militia members across Venezuela to “defend national sovereignty.” “This week I’m launching a special plan to ensure coverage by more than 4.5 million prepared, activated, and armed militia members across the national territory,” Maduro declared during a televised event, flanked by senior commanders. He said the mobilization is needed to counter what he described as “extravagant, bizarre, and outlandish threats” from the United States.","summary":"The Arleigh Burke class guided missile destroyers, USS Preble, USS Halsey, and USS Sampson, under way in the Arabian Gulf.\n\n\nThe post Memories of the Panama Invasion Rekindled as U.S. Deploys Warships to Caribbean appeared first on Newsroom Panama.","url":"https://newsroompanama.com/2025/08/24/memories-of-the-panama-invasion-rekindled-as-u-s-deploys-warships-to-caribbean/","image":"https://newsroompanama.com/wp-content/uploads/2025/08/us-ships.jpg","video":null,"publish_date":"2025-08-25 00:10:58","author":"Newsroom Panama","authors":["Newsroom Panama"],"language":"en","category":"politics","source_country":"pa","sentiment":0.041},{"id":353931840,"title":"Ecuador: Victims of violent cartels tell BBC they now hide from US authorities","text":"This law is the subject of \"much, much interpretation\", according to Kathleen Bush-Joseph of the Migration Policy Institute.\n\nDuring US President Donald Trump's first term in office, his administration made it harder for people to seek asylum from gang violence or domestic violence - two categories that at face value appear to be about crimes between individuals, but in many countries, are connected to systemic issues of justice and corruption.\n\nTrump's attorney general raised the bar on those claims, issuing a directive that \"the applicant must show that the government condoned the private actions or demonstrated an inability to protect the victims\".\n\nThat can be difficult. Gabriela says that reporting threats in a country like Ecuador, can be risky. \"If you're lucky enough and they catch the criminal, it's likely he'll get out the next day and try to kill you in revenge.\"\n\nWhile the Biden administration repealed this legal interpretation, the law remains unchanged and those fleeing the cartels feel in limbo.\n\nDonald Trump has also made criminal cartels a target of his immigration policies – designating some as terrorist organisations and deporting those he claims are affiliated to them, in some cases without providing evidence.\n\nMs Bush-Joseph says it is too early to tell how this will play out in the courts but it could go \"both ways\" for those fleeing cartel violence.\n\nIt could categorise some of them as victims of \"terrorists\". But there are concerns that those who have been forced to pay extortions could also be accused of having provided \"material support\" to these groups - even if it was coerced.\n\nGabriela agrees with Trump that cartel members are \"terrorists\" and thinks that therefore his government should recognise her and others as victims: \"I would like the president to grant asylum to those fleeing violence from these terrorists.\"\n\nMario Russell, the executive director of the US-based Center for Migration Studies, believes the legal definitions of who can claim asylum should be updated.\n\nHe says that for now, most victims end up claiming asylum on political grounds, by arguing cartels have so much social and political power they act \"as if they were the governing entity\".\n\n\"The problem is these people are suffering violence and persecution, and by persecution we mean horror. There's a fear for their life.\"\n\nGabriela says that at her asylum interview - for which she has not yet been given a date - she plans to ask for political asylum. She argues that due to the fact that some police officers and judges in Ecuador are corrupt and have ties to the gangs, she did not feel she would have been protected from the threats gang members made against her in her home country.","url":"https://www.bbc.com/news/articles/cvg4kd385e4o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/c316/live/0ac4e770-813d-11f0-ab3e-bd52082cd0ae.jpg","video":null,"publish_date":"2025-08-25 00:10:23","author":"Ione Wells","authors":["Ione Wells"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.415},{"id":353931906,"title":"Australia could dodge higher US tariffs ‘if Albo stays away’, Jacqui Lambie says","text":"Australia might be able to stave off higher US tariffs if Anthony Albanese “stays away” from Donald Trump, independent senator Jacqui Lambie says.\n\nThe US President spared Australia from tariff hikes earlier month, leaving the rate at 10 per cent for most goods.\n\nIt is the lowest rate any country has managed to secure and has been achieved without an in-person meeting between the Prime Minister and Mr Trump.\n\nSenator Lambie said on Monday that Mr Albanese’s inability to lock in a face-to-face has “probably worked well”.\n\n“Tariffs didn’t go up so that was a bit of a bonus,” she told Nine.\n\n“So maybe if maybe if Albo stays away from him that may continue.”\n\nThough, she added “it’s really rude actually of Trump” not to meet with Mr Albanese, saying she knew the government “is doing everything it can to secure a meeting”.\n\nSenator Lambie said it was “actually Trump” who was the barrier.\n\n“It’s not on Albanese at all,” she said.\n\n“Quite frankly … if he doesn’t want to meet you, then why push the envelope?”\n\nWhile most Australian exports are covered by the 10 per cent duties, some are hit with higher rates.\n\nSteel, aluminium and copper are subject to 50 per cent levies.\n\nMost vehicles and automotive parts are slugged with 25 per cent imposts.\n\nThe Trump administration is also eyeing broader sectoral tariffs, including on timber, semiconductors and pharmaceuticals.\n\nWith pharmaceuticals worth billions to Australian producers, Mr Trump’s floated 250 per cent duties on the industry have triggered alarm bells in Canberra.\n\nNoting looming concerns around AUKUS sparked by the Trump administration’s review, Senator Lambie said it was “embarrassing” that Australia had funnelled billions to Washington without much to show for the submarine pact.\n\n“We’ve paid $2bn but haven’t seen one piece of metal,” she said.\n\nThe crossbencher also said she did not think “it makes any difference … if you were mates with (Mr Trump) or you weren’t”.\n\n“When he decides to make his mind up, he makes mind up and everybody else pays the consequences,” Senator Lambie said.","summary":"Anthony Albanese’s inability to lock in a meet with Donald Trump might not be the worst thing, according to a prominent senator.","url":"https://thewest.com.au/news/australia-could-dodge-higher-us-tariffs-if-albo-stays-away-jacqui-lambie-says-c-19793210","image":"https://images.thewest.com.au/publication/C-19793210/02b771dbeed189c90e84aee727c461eec236fbf8-16x9-x0y8w1024h576.jpg?imwidth=1200","video":null,"publish_date":"2025-08-25 00:05:48","author":"Joseph Olbrycht,Joseph Olbrycht-Palmer","authors":["Joseph Olbrycht","Joseph Olbrycht-Palmer"],"language":"en","source_country":"au","sentiment":-0.354},{"id":353931362,"title":"Trump Targets Two Democrat-Led Cities for Federal Intervention","text":"Donald Trump was poised to intensify his military response in additional Democratic cities on Sunday, as Chicago braced for the arrival of National Guard troops and Baltimore received a stern warning that they could be next.\n\nAccording to a U.S. official speaking with ABC News on Sunday, the Pentagon was preparing to send troops to Chicago after Trump suggested that the city would follow Washington DC as a target for federal action.\n\nTrump indicated last week that he was considering deploying troops to Chicago and New York. This would resemble the military measures taken in the nation’s capital, where numerous National Guard members and federal law enforcement are currently patrolling the streets.\n\nA spokesperson for the Pentagon said they would not ‘speculate’ on the Chicago deployment.\n\n“The Department is a planning organization and is continually coordinating with other agency partners on strategies to protect federal assets and personnel,” a Pentagon representative told The Daily Mail. “We will not speculate on further operations.”\n\nThe White House directed The Daily Mail to Trump’s comments about the city earlier this week.\n\n“Chicago is a disaster,” Trump stated. “There’s an incompetent mayor—grossly incompetent. We’ll probably handle that next. That will be our next target, and it won’t even be difficult.”\n\nIn addition, Trump was invited to join Democrat Maryland Governor Wes Moore in a tour of Baltimore. \n\nHe responded by saying he might ‘send in the troops’ instead. \n\nMoore has criticized Trump’s unprecedented flex of federal power aimed at combatting crime and homelessness in Washington. The governor last week invited Trump to visit his state to discuss public safety and walk the streets.\n\nIn a Truth Social post on Sunday, Trump said Moore asked ‘in a rather nasty and provocative tone,’ and then raised the specter of repeating the National Guard deployment he made in Los Angeles over the objections of California’s Democratic governor, Gavin Newsom.\n\n‘Wes Moore´s record on Crime is a very bad one, unless he fudges his figures on crime like many of the other `Blue States´ are doing,’ Trump wrote, as he cited a pejorative nickname he uses frequently for the California governor. \n\n‘But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the `troops,´ which is being done in nearby DC, and quickly clean up the Crime.’\n\nMoore said he invited Trump to Maryland ‘because he seems to enjoy living in this blissful ignorance’ about improving crime rates in Baltimore. \n\nAfter a spike during the pandemic that matched nationwide trends, Baltimore’s violent crime rate has fallen. \n\nThe 200 homicides reported last year were down 24% from the prior year and 42% since 2021, according to city data. \n\nBetween 2023 and 2024, overall violent crime was down nearly 8% and property crimes down 20%.\n\nWhen reached for comment by The Daily Mail, Governor Moore said via a spokesperson Trump was representing ‘what people hate most about politicians.’ \n\n‘This is a President who would rather attack his country’s largest cities from behind a desk than walk the streets with the people he represents.’\n\n‘The President should join us in Baltimore because the blissful ignorance, tropes, and the 1980s scare tactics benefit no one. We need leaders who are there helping the people who are actually on the ground doing the work.’\n\nHe also called the city ‘a story of resilience and strength’ as the murder rate has dropped. \n\nTrump and Moore also traded accusations regarding military service on Sunday.\n\nThe president asked on Truth Social: ‘Did Wes Moore, the Governor of Maryland, lie about getting a Bronze Star?’\n\nLast year, Moore said that he made ‘an honest mistake’ in failing to correct a White House fellowship application 18 years ago when he wrote he had received a Bronze Star for his military service in Afghanistan though he never ended up receiving it, after the New York Times obtained a copy of the application and reported on it.\n\nMoore responded by asking on X: ‘Did Donald Trump, the President of the United States, lie about an injury to dodge the Vietnam draft?’ \n\nIn Washington, where Trump is surging National Guard troops and federal law enforcement officers, a patchwork of protests popped up throughout the city over the weekend, while some normally bustling corners were noticeably quiet. \n\nIn some of the most populated areas, residents walked by small groups of national guardsmen, often talking among themselves. Videos of arrests and detainments circulated on social media. \n\nTrump has repeatedly described some of the nation´s largest cities – run by Democrats, with Black mayors and majority-minority populations – as dangerous and filthy. \n\nBaltimore Mayor Brandon Scott is Black, as is Moore. The District of Columbia and New York also have Black mayors.\n\nThe Rev. Al Sharpton, speaking during a religious event Sunday at Howard University in Washington, said the Guard’s presence in the nation’s capital was not about crime: ‘This is about profiling us.’\n\n‘This is laced with bigotry and racism,’ he later elaborated to reporters. ‘Not one white mayor has been designated. And I think this is a civil rights issue, a race issue, and an issue of D.C. statehood.’\n\nIllinois Gov. JB Pritzker, a Democrat, said there is no emergency warranting the deployment of National Guard troops in Chicago.\n\n‘Donald Trump is attempting to manufacture a crisis, politicize Americans who serve in uniform, and continue abusing his power to distract from the pain he´s causing families,’ Pritzker wrote on X. \n\n‘We´ll continue to follow the law, stand up for the sovereignty of our state, and protect Illinoisans.’\n\nChicago Mayor Brandon Johnson said the city doesn’t need ‘a military occupation’ and would sue to block one. \n\nHe said there has been no communication from the White House about a possible military deployment.\n\n‘We´re not going to surrender our humanity to this tyrant,’ Johnson said Sunday on MSNBC. \n\n‘I can tell you this, the city of Chicago has a long history of standing up against tyranny, resisting those who wish to undermine the interests of working people.’\n\nThe Daily Mail has reached out to the mayors of Baltimore and Chicago for further comment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump was poised to intensify his military response in additional Democratic&#8230;\n\n\nThis Post: Trump Targets Two Democrat-Led Cities for Federal Intervention first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-targets-two-democrat-led-cities-for-federal-intervention/","image":"https://internewscast.com/wp-content/uploads/2025/08/Trump-names-two-Dem-run-cities-as-next-target-for-federal.jpg","video":null,"publish_date":"2025-08-25 00:05:42","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.099},{"id":353935700,"title":"National Guard Troops to Start Carrying Weapons in DC","text":"The National Guard troops deployed to Washington, D.C., will begin carrying weapons on Sunday evening just two days after given authorization by Defense Secretary Pete Hegseth.Newsweek reached out to the Pentagon by email outside of normal business hours on Sunday evening for comment.Why It MattersThe deployment aims to combat crime in the city, even as crime rates have reached a 30-year low, marking one of the most aggressive federal interventions in local law enforcement in recent history.The deployment has prompted strong backlash due to the fact the administration bypassed the city's elected leaders, who have variously described Trump's directive as \"unsettling,\" \"unprecedented\" and \"dangerous.\"What To KnowA Joint Task Force-DC (JTF-DC) spokesperson told Newsweek that service members were cleared to start carrying their service-issue weapons on Sunday evening, and that they were to only use them \"as a last resort and solely in response to an imminent threat of death or serious bodily harm.\"\"Task force personnel operate under the established Rules for the Use of Force,\" the spokesperson said, adding that the force \"remains committed to protecting the safety and wellbeing of the residents of the District of Columbia.\"Hegseth on Friday authorized National Guard troops deployed into the city to use weapons, but the final decision to carry those weapons, telling Newsweek on Friday that authority remains with the Interim Commanding General of the D.C. National Guard \"to make any necessary force posture adjustments.\"As of Friday, JTF-DC had told Newsweek that there was \"no change in our arming posture.\" It remains unclear what had changed as of Sunday evening to warrant a change in arming posture.The order applies to all service who are members of the Task Force, which will total around 2,000 troops, including those deployed by states to bolster the baseline 800 troops Trump deployed to the capital.That includes 300 to 400 troops from West Virginia, 200 troops from South Carolina, 150 troops from Ohio, 135 troops from Louisiana, 200 troops from Mississippi, and 160 troops from Tennessee.What People Are SayingPresident Donald Trump wrote on Truth Social: \"Washington, D.C. is SAFE AGAIN! The crowds are coming back, the spirit is high, and our D.C. National Guard and Police are doing a fantastic job. They are out in force, and are NOT PLAYING GAMES!!! As bad as it sounds to say, there were no murders this week for the first time in memory. Mayor Muriel Bowser must immediately stop giving false and highly inaccurate crime figures, or bad things will happen, including a complete and total Federal takeover of the City! Washington D.C. will soon be great again!!!\"Washington, D.C., Mayor Muriel Bowser earlier this month wrote on X: \"Violent crime in DC is at its lowest level in 30 years. We had an unacceptable spike in 2023, so we changed our laws and strategies. Now, crime levels are not only down from 2023, but from before the pandemic. Our tactics are working, and we aren't taking our foot off the gas.\"Update 8/24/25, 8:23 p.m. ET: This article has been updated with additional information.","summary":"The National Guard has been preparing to carry weapons in public for over a week after reports broke that troops were informed to prepare.","url":"https://www.newsweek.com/national-guard-troops-start-carrying-weapons-dc-2118593","image":"https://d.newsweek.com/en/full/2708799/national-guard-washington-dc-capitol.jpg?w=1600&h=900&q=88&f=0b4ba6cbb3fc9a564f16cc463c7cb84d","video":null,"publish_date":"2025-08-25 00:00:18","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.262},{"id":353932958,"title":"Jefferies gets in heated clash with CNN host on 'hypocritical' redistricting position and if Dems have a plan","text":"House Minority Leader Hakeem Jeffries, D-NY, was pressed on the Democratic Party’s redistricting plans to counter Texas Republicans and whether they’re \"hypocritical,\" because of the history of his state of New York. After Jeffries criticized Texas Republicans for successfully passing a new congressional map, CNN’s \"State of the Union\" host Dana Bash asked Jeffries about whether his own state planned to counter with redistricting. Jeffries confirmed that Democratic New York Gov. Kathy Hochul was going to explore options. Bash highlighted that Jeffries had previously fought against New York's congressional maps being drawn by an independent commission in 2022. \"You praised New York’s state legislature for redrawing new ones,\" Bash said. \"Is criticizing Texas hypocritical given what you pushed for in your own state?\" HAKEEM JEFFRIES' CALL TO FIGHT TRUMP AGENDA ‘IN THE STREETS’ SPARKS BACKLASH AS A 'MAXINE WATERS MOMENT' \"So let’s go into the actual facts,\" Jeffries responded. \"The map was not drawn by the independent redistricting commission. The map was drawn by a special master who was put into place by a random right-wing judge in Steuben County. That was problem number one.\" New York’s Democratic-controlled legislature enacted new congressional maps ahead of the 2022 midterm elections, rejecting the ones created by the bipartisan Independent Redistricting Commission. The New York Court of Appeals later rejected the legislature’s maps, and a state trial court judge appointed a special master to draw maps used for 2022. New York Democrats filed a new lawsuit claiming that the state legislature had the authority to redraw a new map for the remainder of the decade. Last year, the Court of Appeals ruled in favor of the Democratic Party, allowing them to pass new maps in 2024. \"What’s important is that in New York, the redrawn map that was actually adopted by the legislature was adopted on a bipartisan basis,\" Jeffries said. \"Democrats and Republicans in the Assembly voted for the map because the redraw was fair. That’s not what’s happening in Texas. In Texas, this is a racial partisan gerrymander ordered by Donald Trump as part of an effort to rig the midterm elections. And we’re not going to let it happen.\" PETE HEGSETH SAYS HAKEEM JEFFRIES' 'DUMB EFFING INDIVIDUALS' JAB IS EVIDENCE OF HOW FAR DEMS 'HAVE FALLEN' Jeffries has supported other state Democrats’ efforts to redraw their congressional maps in retaliation for the new Texas maps. However, Bash questioned whether new maps could even be drawn for New York now. \"What can you do in New York? Is it even feasible to redraw the maps before the midterms?\" Bash asked. \"Texas acted in a way to try and rig the congressional maps so they could add a couple of different seats to the Republican column,\" Jeffries answered. \"Understand that Republicans right now have the narrowest majority—just a three-seat majority of any party since the Great Depression—and they have no track record of accomplishment to be able to successfully run on, which is why they are running scared.\" He went on to compliment California after it \"responded forcefully\" to Texas Republicans without clarifying what New York plans to do. CLICK HERE TO GET THE FOX NEWS APP \"So is there not a plan yet in New York? Is that what I’m hearing?\" Bash repeated. \"There’s a plan to respond as appropriately in New York and in other parts of the country as the circumstances dictate,\" Jeffries said.","summary":"House Minority Leader Hakeem Jeffries defended his record on New York redistricting plans while discussing potential responses to Texas Republicans.","url":"https://www.foxnews.com/media/jefferies-gets-heated-clash-cnn-host-hypocritical-redistricting-position-dems-have-plan","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/hakeem-jeffries-presser.jpg","video":"https://www.foxnews.com/video/6377328258112","publish_date":"2025-08-25 00:00:18","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"us","sentiment":-0.052},{"id":353931360,"title":"D.C. National Guard Troops to Start Carrying Firearms","text":"WASHINGTON — National Guard troops stationed in Washington this month to aid President Donald Trump’s crime reduction efforts will begin carrying firearms Sunday evening, as reported by a Defense Department official familiar with the plan.\n\nMost of the guard members will be equipped with M17 pistols, their standard service weapons, the official said, while a few troops will carry their service M4 rifles. The weapons are authorized for self-defense purposes.\n\nOn Sunday evening, several armed National Guard troops were observed patrolling D.C.’s Chinatown area, wearing patches labeled “MP” to denote their military police role.\n\nDefense Secretary Pete Hegseth authorized approximately 2,000 National Guard troops in D.C. to carry weapons on Friday, signaling a change in their posture as they had previously been unarmed while assisting law enforcement with community safety patrols, traffic controls, and managing crowd movement.\n\nIn response to Hegseth’s order, the Army stated that “Guard members receive initial, ongoing, and refresher training” and “complete yearly weapons qualifications prior to carrying weapons.”\n\nAccording to a White House official, the National Guard troops in D.C., although armed, are not conducting arrests as of Saturday night. Their focus remains on safeguarding federal assets and ensuring a secure environment for law enforcement officers to make arrests.\n\nMore than 2,200 National Guard soldiers and airmen, a majority from out of state, have been deployed to D.C. to support what Trump has framed as a concerted effort to tackle crime and homelessness in the nation’s capital. At the time of the initial troop deployment this month, violent crime had dropped roughly 27% year over year, according to D.C. police data.\n\nDemocrats have bashed the deployment as partisan in nature, accusing Trump of trying to exert his presidential authority through scare tactics and noting that his primary targets have been cities with Black leadership.\n\nTrump threatened Sunday to send the military into Baltimore after he sparred with Democratic Maryland Gov. Wes Moore, deriding the city as “crime-ridden.”\n\n“But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the ‘troops,’ which is being done in nearby DC, and quickly clean up the Crime,” Trump said on Truth Social.\n\nDeploying the National Guard to cities like D.C. is historically uncommon, as the force is typically used to respond to situations like natural disasters and civil unrest.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON — National Guard troops stationed in Washington this month to aid&#8230;\n\n\nThis Post: D.C. National Guard Troops to Start Carrying Firearms first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/d-c-national-guard-troops-to-start-carrying-firearms/","image":"https://internewscast.com/wp-content/uploads/2025/08/National-Guard-troops-in-DC-to-begin-carrying-firearms.jpg","video":null,"publish_date":"2025-08-24 23:57:43","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.212},{"id":353930772,"title":"Trump names two Dem-run cities notorious for murders as next targets for his federal crime crackdown","text":"Donald Trump was ready to expand his military crackdown into more Democratic cities on Sunday as Chicago was expected to receive National Guard troops and Baltimore was given a stark warning they would be next.\n\nA US official told ABC News on Sunday that the Pentagon was planning to deploy troops to Chicago after Trump hinted that the Windy City would be the next target for a federal takeover following Washington DC. \n\nLast week, Trump said he was considering Chicago and New York for troop deployments. The move would mimic the military action in the nation's capital, where thousands of National Guard and federal law enforcement officers are patrolling the streets. \n\nA spokesperson for the Pentagon said they would not 'speculate' on the Chicago deployment.\n\n'The Department is a planning organization and is continuously working with other agency partners on plans to protect federal assets and personnel,' the Pentagon rep told The Daily Mail in a statement. 'We won't speculate on further operations.'\n\nThe White House directed The Daily Mail to Trump's comments about the city earlier this week.\n\n'Chicago is a mess,' Trump said. 'You have an incompetent mayor -- grossly incompetent. And we'll straighten that one out probably next. That will be our next one after this, and it won't even be tough.'\n\nIn addition, Trump was invited to join Democrat Maryland Governor Wes Moore in a tour of Baltimore. \n\nHe responded by saying he might 'send in the troops' instead. \n\nMoore has criticized Trump's unprecedented flex of federal power aimed at combatting crime and homelessness in Washington. The governor last week invited Trump to visit his state to discuss public safety and walk the streets.\n\nIn a Truth Social post on Sunday, Trump said Moore asked 'in a rather nasty and provocative tone,' and then raised the specter of repeating the National Guard deployment he made in Los Angeles over the objections of California's Democratic governor, Gavin Newsom.\n\n'Wes Moore´s record on Crime is a very bad one, unless he fudges his figures on crime like many of the other `Blue States´ are doing,' Trump wrote, as he cited a pejorative nickname he uses frequently for the California governor. \n\n'But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the `troops,´ which is being done in nearby DC, and quickly clean up the Crime.'\n\nMoore said he invited Trump to Maryland 'because he seems to enjoy living in this blissful ignorance' about improving crime rates in Baltimore. \n\nAfter a spike during the pandemic that matched nationwide trends, Baltimore's violent crime rate has fallen. \n\nThe 200 homicides reported last year were down 24% from the prior year and 42% since 2021, according to city data. \n\nBetween 2023 and 2024, overall violent crime was down nearly 8% and property crimes down 20%.\n\nWhen reached for comment by The Daily Mail, Governor Moore said via a spokesperson Trump was representing 'what people hate most about politicians.' \n\n'This is a President who would rather attack his country's largest cities from behind a desk than walk the streets with the people he represents.'\n\n'The President should join us in Baltimore because the blissful ignorance, tropes, and the 1980s scare tactics benefit no one. We need leaders who are there helping the people who are actually on the ground doing the work.'\n\nHe also called the city 'a story of resilience and strength' as the murder rate has dropped. \n\nTrump and Moore also traded accusations regarding military service on Sunday.\n\nThe president asked on Truth Social: 'Did Wes Moore, the Governor of Maryland, lie about getting a Bronze Star?'\n\nLast year, Moore said that he made 'an honest mistake' in failing to correct a White House fellowship application 18 years ago when he wrote he had received a Bronze Star for his military service in Afghanistan though he never ended up receiving it, after the New York Times obtained a copy of the application and reported on it.\n\nMoore responded by asking on X: 'Did Donald Trump, the President of the United States, lie about an injury to dodge the Vietnam draft?' \n\nIn Washington, where Trump is surging National Guard troops and federal law enforcement officers, a patchwork of protests popped up throughout the city over the weekend, while some normally bustling corners were noticeably quiet. \n\nIn some of the most populated areas, residents walked by small groups of national guardsmen, often talking among themselves. Videos of arrests and detainments circulated on social media. \n\nTrump has repeatedly described some of the nation´s largest cities - run by Democrats, with Black mayors and majority-minority populations - as dangerous and filthy. \n\nBaltimore Mayor Brandon Scott is Black, as is Moore. The District of Columbia and New York also have Black mayors.\n\nThe Rev. Al Sharpton, speaking during a religious event Sunday at Howard University in Washington, said the Guard's presence in the nation's capital was not about crime: 'This is about profiling us.'\n\n'This is laced with bigotry and racism,' he later elaborated to reporters. 'Not one white mayor has been designated. And I think this is a civil rights issue, a race issue, and an issue of D.C. statehood.'\n\nIllinois Gov. JB Pritzker, a Democrat, said there is no emergency warranting the deployment of National Guard troops in Chicago.\n\n'Donald Trump is attempting to manufacture a crisis, politicize Americans who serve in uniform, and continue abusing his power to distract from the pain he´s causing families,' Pritzker wrote on X. \n\n'We´ll continue to follow the law, stand up for the sovereignty of our state, and protect Illinoisans.'\n\nChicago Mayor Brandon Johnson said the city doesn't need 'a military occupation' and would sue to block one. \n\nHe said there has been no communication from the White House about a possible military deployment.\n\n'We´re not going to surrender our humanity to this tyrant,' Johnson said Sunday on MSNBC. \n\n'I can tell you this, the city of Chicago has a long history of standing up against tyranny, resisting those who wish to undermine the interests of working people.'\n\nThe Daily Mail has reached out to the mayors of Baltimore and Chicago for further comment.","summary":"Last week, Trump said he was considering Chicago and New York for troop deployments to follow Washington DC.","url":"https://www.dailymail.co.uk/news/article-15030119/Trump-Democrat-cities-federal-crime-crackdown.html","image":"https://i.dailymail.co.uk/1s/2025/08/25/00/101508433-0-image-a-23_1756079521431.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/22/5463904092758100659/1024x576_MP4_5463904092758100659.mp4","publish_date":"2025-08-24 23:50:18","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.235},{"id":353934978,"title":"Trump adds Baltimore to target cities ","text":"WASHINGTON — President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland’s governor to join him in a tour of Baltimore by saying he might instead “send in the ‘troops.'”\n\nThe most recent developments in Trump’s extraordinary effort to override the law enforcement authority of state and local governments came after he said he was considering Chicago and New York for troop deployments similar to what he has unleashed on the nation’s capital. Thousands of National Guard and federal law enforcement officers are now patrolling the district’s streets, drawing sporadic protests from local residents.\n\nTrump made the threat to Baltimore in a spat with Maryland Gov. Wes Moore, a Democrat who has criticized Trump’s unprecedented flex of federal power aimed at combatting crime and homelessness in Washington. Moore last week invited Trump to visit his state to discuss public safety and walk the streets.\n\nIn a Truth Social post on Sunday, Trump said Moore asked “in a rather nasty and provocative tone,” and then raised the specter of repeating the National Guard deployment he made in Los Angeles over the objections of California’s Democratic governor, Gavin Newsom.\n\n“Wes Moore’s record on Crime is a very bad one, unless he fudges his figures on crime like many of the other ‘Blue States’ are doing,” Trump wrote, as he cited a pejorative nickname he uses frequently for the California governor. “But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the ‘troops,’ which is being done in nearby DC, and quickly clean up the Crime.”\n\nMoore said he invited Trump to Maryland “because he seems to enjoy living in this blissful ignorance” about improving crime rates in Baltimore. After a spike during the pandemic that matched nationwide trends, Baltimore’s violent crime rate has fallen. The 200 homicides reported last year were down 24% from the prior year and 42% since 2021, according to city data. Between 2023 and 2024, overall violent crime was down nearly 8% and property crimes down 20%.\n\n“The president is spending all of his time talking about me,” Moore said on CBS’s “Face the Nation” on Sunday. “I’m spending my time talking about the people I serve.”\n\nTrump is “spouting off a bunch of lies about public safety in Maryland,” Moore said in a fundraising email.\n\nIn Washington, where Trump is surging National Guard troops and federal law enforcement officers, a patchwork of protests popped up throughout the city over the weekend, while some normally bustling corners were noticeably quiet. In some of the most populated areas, residents walked by small groups of national guardsmen, often talking among themselves. Videos of arrests and detainments circulated on social media.\n\nTrump has said Chicago and New York are most likely his next targets, eliciting strong pushback from Democratic leaders in both states. The Washington Post reported Saturday that the Pentagon has spent weeks preparing for an operation in Chicago that would include National Guard troops and potentially active-duty forces.\n\nAsked about the Post report, the White House pointed to Trump’s earlier comments discussing his desire to expand his use of military forces to target local crime.\n\n“I think Chicago will be our next,” Trump told reporters at the White House on Friday, adding, “And then we’ll help with New York.”\n\nTrump has repeatedly described some of the nation’s largest cities — run by Democrats, with Black mayors and majority-minority populations — as dangerous and filthy. Baltimore Mayor Brandon Scott is Black, as is Moore. The District of Columbia and New York also have Black mayors.\n\nThe Rev. Al Sharpton, speaking during a religious event Sunday at Howard University in Washington, said the Guard’s presence in the nation’s capital was not about crime: “This is about profiling us.”\n\n“This is laced with bigotry and racism,” he later elaborated to reporters. “Not one white mayor has been designated. And I think this is a civil rights issue, a race issue, and an issue of D.C. statehood.”\n\nIllinois Gov. JB Pritzker, a Democrat, said there is no emergency warranting the deployment of National Guard troops in Chicago.\n\n“Donald Trump is attempting to manufacture a crisis, politicize Americans who serve in uniform, and continue abusing his power to distract from the pain he’s causing families,” Pritzker wrote on X. “We’ll continue to follow the law, stand up for the sovereignty of our state, and protect Illinoisans.”\n\nChicago Mayor Brandon Johnson said the city doesn’t need “a military occupation” and would sue to block one. He said there has been no communication from the White House about a possible military deployment.\n\n“We’re not going to surrender our humanity to this tyrant,” Johnson said Sunday on MSNBC. “I can tell you this, the city of Chicago has a long history of standing up against tyranny, resisting those who wish to undermine the interests of working people.”","summary":"President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland's governor to join him in a tour of Baltimore by saying he might instead \"send in the 'troops.'\"","url":"https://www.bostonherald.com/2025/08/24/trump-adds-baltimore-to-target-cities/","image":"https://www.bostonherald.com/wp-content/uploads/2025/08/AP25236835426367.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-24 23:37:11","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.178},{"id":353929894,"title":"Prince Andrew accuser Virginia Giuffre to publish bombshell book from beyond grave","text":"Prince Andrew's accuser Virginia Giuffre is set to publish a bombshell book from beyond the grave. 'Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice' is scheduled for release on October 21, around six months after Ms Giuffre took her own life aged 41 . She had been working on the book with author Amy Wallace in the month before her death, and completed the 400-page manuscript. Virginia Giuffre said she was just 17 when she was sexually abused by American financier Jeffrey Epstein - and also made allegations against the Duke of York . Andrew and Giuffre reached an out-of-court financial settlement in February 2022 to end her civil sexual assault lawsuit. The settlement was not an admission of guilt and he accepted no liability. He has continuously denied any wrongdoing in the Jeffrey Epstein scandal. Epstein was found dead in a New York City jail cell in 2019 in what investigators described as a suicide. His former girlfriend, Ghislaine Maxwell, was convicted in late 2021 on sex trafficking and other charges. A statement from Knopf, the publisher of Virginia's posthumous book, included an email sent by her to Ms Wallace a few weeks before her death, saying that she hoped the book would \"impact many lives\" and expose how human trafficking takes place. The email reads: \"The content of this book is crucial, as it aims to shed light on the systemic failures that allow the trafficking of vulnerable individuals across borders. \"It is imperative that the truth is understood and that the issues surrounding this topic are addressed, both for the sake of justice and awareness.\" \"In the event of my passing, I would like to ensure that NOBODY'S GIRL is still released. I believe it has the potential to impact many lives and foster necessary discussions about these grave injustices.\" In 2023, it was reported that Giuffre had reached a deal \"believed to be worth millions\" with an undisclosed publisher. It comes after Ghislaine Maxwell dragged Princess Diana into the Jeffrey Epstein scandal by claiming the paedophile was set up with her. In tapes made public on Friday by the US Justice Department, the disgraced socialite - who is serving a 20-year prison sentence for human trafficking - told US Deputy Attorney General Todd Blanche that she believed the financier had travelled to Britain to meet Diana. Discussing Epstein's alleged courtship of the Princess, she said he had gone to a \"big event\" in the UK without her, and said: \"I don't know if he sat with Diana or he met with Diana and he'd already met her. I don't know, but this, I believe, was organised by [one of Diana's closest confidantes].\" She added: \"I don't know if she was being set up as a date for him, maybe because she was... I don't want to speak bad of Diana, but... I'm not going to do that.\" She also told how Epstein had lived in London for a period in the 1980s and mixed with \"high society people\". Elsewhere in the interviews, Maxwell was questioned on Epstein's relationship with US President Donald Trump , and said she \"never witnessed the president in any inappropriate setting in any way\" and that he was \"never inappropriate with anybody\", the transcripts said.","summary":"Virginia Giuffre, who accused Prince Andrew of sexual assault, will release a posthumous memoir entitled 'Nobody's Girl' six months after she took her own life this year aged 41","url":"https://www.mirror.co.uk/news/uk-news/prince-andrew-accuser-virginia-giuffre-35786259","image":"https://i2-prod.mirror.co.uk/article35786463.ece/ALTERNATES/s1200b/0_FILES-US-AUSTRALIA-SUICIDE-GIUFFRE-CRIME-EPSTEIN.jpg","video":null,"publish_date":"2025-08-24 23:33:40","author":"Benedict Tetzlaff-Deas","authors":["Benedict Tetzlaff-Deas"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.269},{"id":353936976,"title":"France summons US ambassador over anti-Semitism allegations","text":"France has summoned the US ambassador, Charles Kushner, after he wrote a letter to President Emmanuel Macron alleging that Paris had failed to do enough to stem anti-Semitic violence, a French Ministry of Foreign Affairs spokesperson says.\n\nKushner published the open letter in the Wall Street Journal on Sunday, in which he focused on France’s criticism of Israel – which has been accused by leading rights groups of carrying out a genocide in Gaza – and its plans to recognise a Palestinian state.\n\n“Public statements haranguing Israel and gestures toward recognition of a Palestinian state embolden extremists, fuel violence, and endanger Jewish life in France,” he wrote. “In today’s world, anti-Zionism is anti-Semitism – plain and simple.”\n\nParis was quick to respond to the ambassador.\n\n“France firmly refutes these latest allegations,” a Foreign Ministry statement said on Sunday. “The allegations from the ambassador are unacceptable.”\n\nFrance is “fully committed” to fighting anti-Semitism, the ministry added.\n\nThe Foreign Ministry’s statement also said that Kushner’s comments went “against international law, and in particular the duty not to interfere in internal matters of states” by diplomatic personnel.\n\n“Furthermore, they do not live up to the quality of the transatlantic relationship between France and the United States and the trust that should result between allies,” it added.\n\nIsrael has been imposing deadly hunger on Palestinians in Gaza, whom it has displaced repeatedly as it systematically destroys the enclave of 2 million people, killing dozens daily.\n\nIn recent weeks, France and other Western nations have announced plans to recognise a Palestinian state, while maintaining their trade, diplomatic and security ties to Israel.\n\nStill, the move has angered Israel and its top ally, the US.\n\nKushner, who is the father of US President Donald Trump’s son-in-law and former adviser Jared Kushner, was pardoned by Trump during his first term, having been convicted of tax evasion and witness tampering in 2005.\n\nThe envoy’s letter follows a similar statement addressed to Macron by Israeli Prime Minister Benjamin Netanyahu last week, which also linked France’s decision to recognise a Palestinian state to anti-Semitism.\n\nThe French president’s office hit back swiftly at Netanyahu, calling his allegations “abject” and “erroneous”, and promising that they “will not go unanswered”.\n\n“This is a time for seriousness and responsibility, not for conflation and manipulation,” the French presidency said, adding that France “protects and will always protect its Jewish citizens”.\n\nRights advocates say that Israel’s supporters often invoke accusations of anti-Semitism to distract from the country’s abuses against Palestinians and silence the debate around the issue.","summary":"Foreign Ministry calls Charles Kushner&#039;s claim that Paris is not doing enough to combat anti-Semitism &#039;unacceptable&#039;.","url":"https://www.aljazeera.com/news/2025/8/24/france-summons-us-ambassador-over-anti-semitism-allegations?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/08/AFP__20250824__72CF3G6__v1__HighRes__FilesFranceUsDiplomacy-1756072658.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-08-24 23:30:12","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.078},{"id":353931570,"title":"Deportations reach new high after summer surge in immigration arrests","text":"President Donald Trump’s campaign promise of mass deportations may be coming closer to reality. Until June, deportations had lagged behind immigration arrests and detentions. By the first week of August, deportations reached nearly 1,500 people per day, according to the latest data, a pace not seen since the Obama administration.\n\nWith an infusion of cash from Trump’s domestic policy bill signed in July — an additional $76 billion that Immigration and Customs Enforcement can spend over a little more than four years — the agency appears poised to scale its operations even further.\n\nAt least 180,000 people have been deported by ICE under Trump so far. At the current higher pace, the agency is on track to deport more than 400,000 people in his first year in office, well more than the 271,000 people ICE removed in the year ending in September but still short of the administration’s stated goal of 1 million deportations a year.\n\n(The Department of Homeland Security says the total number of deportations so far under Trump is much higher — at 332,000. That figure includes people who are turned around or quickly deported at U.S. borders by Customs and Border Protection.)\n\nICE now uses about a dozen charter planes every day to conduct deportations and move detainees around the country, almost twice as many as in January, according to data collected by Tom Cartwright, an immigration activist who tracks ICE flights. In May, ICE modified its contract with CSI Aviation, its primary air charter company, to increase the number of flights per week. It has also resumed using a limited number of military planes.\n\nICE’s expanded operations have drawn nationwide protests, fierce backlash and an endless series of legal challenges. But officials have pressed forward with their aggressive tactics.\n\n Not just criminals \n\nTrump may be catching up to President Barack Obama, whom immigrant activists called the “deporter in chief,” but the nature of Trump’s immigration enforcement has been very different. The hundreds of thousands of people removed under Obama were mostly recent border-crossers, and ICE focused its arrests in the interior of the country on criminals.\n\nIn late May, Stephen Miller, a White House deputy chief of staff and a top immigration policy adviser, ordered ICE leaders to escalate arrests across the board, even if it meant broadening its focus beyond immigrants with a criminal record.\n\nSince then, almost all of the increase in arrests has been of people without prior criminal convictions. Immigration arrests of people with a past violent criminal conviction increased to about 1,900 in June from about 1,100 in December. At the same time, arrests overall tripled to more than 28,000 and arrests of people with no past conviction or charges increased by almost 20 times.\n\nBut the summer surge experienced in much of the country did not last. Arrests peaked at an average of almost 1,200 per day in early June, but the pace has since fallen back to levels seen in April.\n\nIt is unclear why arrests dropped, but in Los Angeles, high-profile street arrests and raids triggered a backlash that led to protests and the deployment of the National Guard and the Marines.\n\nIn response to a lawsuit accusing ICE of illegal racial profiling, a federal court issued a temporary restraining order blocking the government from arresting someone based on their race or ethnicity and presence at a certain location. The Trump administration has appealed the order.\n\nBetween the start of the surge and the court order, ICE arrested more than 2,000 immigrants in the Los Angeles area who had no criminal records. A majority were from Mexico or Guatemala.\n\nNew York City also saw a spike in arrests of non-criminals this summer, many at immigration court and ICE check-ins, tactics that prompted their own backlash and lawsuit.\n\n New detention centers \n\nWith 60,000 people now in custody, the Trump administration has stretched the capacity of the immigrant detention system, arresting more people and releasing far fewer on bond, parole or supervised release.\n\nThat’s a deliberate tactic to boost deportations, said Aaron Reichlin-Melnick, a senior fellow at the American Immigration Council, because people held in detention are more likely to have their cases end with a removal order and are also more likely to abandon their cases and agree to be deported.\n\nThe Laken Riley Act also expanded the types of immigrants whom ICE is required to keep in detention to include many who have been accused of low-level crimes, like shoplifting.\n\nTo hold them all, ICE has had to seek more and more detention space. In addition to holding more people at existing facilities, ICE has added at least 50 new detention centers since Trump took office Jan. 20. At the end of July, these facilities held more than 6,000 people.\n\nAmong the detention centers are Delaney Hall, a private facility run by the Geo Group in Newark, New Jersey; a tent facility in El Paso, Texas, that was formerly used by the U.S. Border Patrol; the Guantánamo Bay naval base; a reopened family detention center in Dilley, Texas; federal prisons in Atlanta, New York City, Miami and Philadelphia, and a large number of state and local jails and prisons.\n\n More funding \n\nBecause deporting people who are in the country unlawfully is logistically challenging, ICE will likely need to hire more agents not only to arrest people but also to ensure due process, said Blas Nuñez-Neto, who was a homeland security adviser to President Joe Biden. The agency will also need to procure more detention space to hold people for several weeks while their removal is arranged, he said, and contract for more aircraft for removal flights.\n\nFlush with new money on top of its 2025 budget of $10 billion, ICE is preparing to spend to address each of those chokepoints. Tricia McLaughlin, a DHS spokesperson, said the new funding would go toward hiring 10,000 ICE agents and adding 80,000 new detention beds. Some $45 billion is designated for expanding detention, and $14 billion is set aside for transporting people out of the country.\n\nICE also intends to expand detention partnerships with state and local governments, like the one for the facility Florida has named “Alligator Alcatraz,” McLaughlin said.\n\nAbout the data\n\nData comes from Immigration and Customs Enforcement reports and data obtained through Freedom of Information Act requests by the Deportation Data Project, a repository of immigration enforcement data at the law school at the University of California, Berkeley.\n\nArrests in charts are administrative arrests — arrests in which ICE is seeking to deport rather than criminally prosecute the arrestees — that were conducted by the agency’s Enforcement and Removal Operations division and that led to a book-in to detention. The charts do not include criminal arrests, arrests by ICE’s Homeland Security Investigations division or arrests by Customs and Border Protection.\n\nDeportations are removals and enforcement returns conducted by ICE.\n\nFor the chart of arrests by field office, the Los Angeles field office covers Los Angeles County and surrounding counties from San Luis Obispo to Riverside counties. The New York City field office covers the five boroughs, Long Island and the Hudson Valley. The Boston field office covers all six New England states. The Miami field office covers Florida, Puerto Rico and the U.S. Virgin Islands. The Chicago field office covers Illinois, Indiana, Kentucky, Missouri, Kansas and Wisconsin. The San Antonio field office covers central Texas spanning from near Del Rio to Austin.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"President Donald Trump&#8217;s campaign promise of mass deportations may be coming closer to reality. Until June, deportations had lagged behind immigration arrests and detentions. By the first week of August, deportations reached nearly 1,500 people per day, according to the latest data, a pace not seen since the Obama administration.","url":"https://www.staradvertiser.com/2025/08/24/breaking-news/deportations-reach-new-high-after-summer-surge-in-immigration-arrests/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/08/web1_IMMIG-DATA-1.jpg","video":null,"publish_date":"2025-08-24 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.14},{"id":353928226,"title":"Roger Clemens Appreciates Donald Trump Calling For Him To Be Enshrined In Hall Of Fame","text":"President Donald Trump has been heavily involved in MLB matters over the past year. In October 2024 (before winning the election), Trump posted his opinion that outcast All-Star Pete Rose should have his gambling problems forgiven and be enshrined in the Hall of Fame. ENTER OUTKICK's SWEEPSTAKES FOR FREE TICKETS TO SEE ALABAMA vs. GEORGIA Just last month, he patted himself on the back for being the catalyst for a 10-game win streak by the Boston Red Sox. (It’s scientifically verifiably he was the main reason for this success. Trust the science!). Now, he’s at it again. Trump played a round of golf with baseball great Roger Clemens on Saturday, along with the pitcher’s son, Kacy. After the round, Trump posted an energetic plea for the \"Rocket\" to get enshrined in Cooperstown. Clemens posted a screenshot of the Truth Social post and thanked Trump for his support. \"Roger Clemens was easily one of the few Greatest Pitchers of All Time, winning 354 Games, the Cy Young Award seven times (A Record, by a lot!), and played in six World Series, winning two!\" Trump wrote. \"...He should be in the Baseball Hall of Fame, NOW! People think he took drugs, but nothing was proven. He never tested positive, and Roger, from the very beginning, totally denies it. He was just as great before those erroneous charges were leveled at him.\" Clemens was mentioned in the 2007 Mitchell Report in a slew of players who used PEDs. Again, Clemens has denied it, but the findings condemned him to miss getting elected by the PBWA in his final year of eligibility. Trump obviously does not have the power to override the MLB’s election process, but that doesn’t mean he’ll refrain from using whatever influence he has to make the Hall of Fame great again.","summary":"President Trump is doing all he can to get Roger &quot;Rocket&quot; Clemens in the Hall of Fame.","url":"https://www.outkick.com/sports/roger-clemens-appreciates-donald-trump-calling-him-enshrined-hall-fame","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/08/trump-4-scaled.jpg","video":null,"publish_date":"2025-08-24 23:10:34","author":"John Simmons","authors":["John Simmons"],"language":"en","category":"politics","source_country":"us","sentiment":-0.02},{"id":353931526,"title":"Trump expands cities targeted for possible military deployment to Baltimore","text":"US President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland’s governor to join him in a tour of Baltimore by saying he might instead “send in the troops”.\nLast week, Trump said he was considering Chicago and New York for troop deployments similar to what he has unleashed on the nation’s capital, where thousands of National Guard and federal police officers are patrolling the streets.\nTrump made the threat to Baltimore in a row with Maryland Governor Wes Moore, a Democrat who has criticised Trump’s unprecedented flex of federal power aimed at combating crime and homelessness in Washington. Moore last week invited Trump to visit his state to discuss public safety and walk the streets.\nIn a Truth Social post on Sunday, Trump said Moore asked “in a rather nasty and provocative tone”, and then raised the spectre of repeating the National Guard deployment he made in Los Angeles over the objections of California’s Democratic Governor Gavin Newsom.\n“Wes Moore’s record on Crime is a very bad one, unless he fudges his figures on crime like many of the other ‘Blue States’ are doing.\n“But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the ‘troops,’ which is being done in nearby DC, and quickly clean up the Crime,” Trump wrote, citing a pejorative nickname he uses frequently for the California governor.\nMoore said he invited Trump to Maryland “because he seems to enjoy living in this blissful ignorance” about improving crime rates in Baltimore.\nAfter a spike during the coronavirus pandemic that matched nationwide trends, Baltimore’s violent crime rate has fallen. The 200 murders reported last year were down 24 per cent from the year before and 42 per cent since 2021, according to city data. Between 2023 and 2024, overall violent crime was down nearly 8 per cent and property crimes down 20 per cent.\n“The president is spending all of his time talking about me,” Moore said on CBS’ Face the Nation on Sunday. “I’m spending my time talking about the people I serve.”\nTrump is “spouting off a bunch of lies about public safety in Maryland”, Moore said in a fundraising email.\n\nIn Washington, where Trump is surging National Guard troops and federal police officers, a patchwork of protests popped up throughout the city over the weekend, while some normally bustling corners were noticeably quiet.\nIn some of the most populated areas, residents walked by small groups of national guardsmen, often talking among themselves. Videos of arrests and detainments circulated on social media.\nTrump has said Chicago and New York are most likely to be his next targets, eliciting strong pushback from Democratic leaders in both states.\nThe Washington Post newspaper reported on Saturday that the Pentagon has spent weeks preparing for an operation in Chicago that would include National Guard troops and potentially active-duty forces.\nAsked about the Post report, the White House pointed to Trump’s earlier comments discussing his desire to expand his use of military forces to target local crime.\n“I think Chicago will be our next,” Trump told reporters at the White House on Friday, adding: “And then we’ll help with New York.”\nTrump has repeatedly described some of the nation’s largest cities – run by Democrats, with black mayors and majority-minority populations – as dangerous and filthy. Baltimore Mayor Brandon Scott is black, as is Moore. The District of Columbia and New York also have black mayors.\nThe Reverend Al Sharpton, speaking during a religious event on Sunday at Howard University in Washington, said the National Guard’s presence in the nation’s capital was not about crime: “This is about profiling us.”\n“This is laced with bigotry and racism,” he later elaborated to reporters. “Not one white mayor has been designated. And I think this is a civil rights issue, a race issue and an issue of DC statehood.”\n\nIllinois Governor J.B. Pritzker, a Democrat, said there is no emergency warranting the deployment of National Guard troops in Chicago.\n“Donald Trump is attempting to manufacture a crisis, politicise Americans who serve in uniform, and continue abusing his power to distract from the pain he’s causing families,” Pritzker wrote on social media. “We’ll continue to follow the law, stand up for the sovereignty of our state, and protect Illinoisans.”\nChicago Mayor Brandon Johnson said the city does not need “a military occupation” and would sue to block one. He said there has been no communication from the White House about a possible military deployment.\n“We’re not going to surrender our humanity to this tyrant,” Johnson said on Sunday on MSNBC. “I can tell you this, the city of Chicago has a long history of standing up against tyranny, resisting those who wish to undermine the interests of working people.”","summary":"US President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland’s governor to join him in a tour of Baltimore by saying he might instead “send in the troops”.\nLast week, Trump said he was considering Chicago and New York for troop deployments similar to what he has unleashed on the nation’s capital, where thousands of National Guard and federal police officers are patrolling the streets.\nTrump made the threat to...","url":"https://www.scmp.com/news/world/united-states-canada/article/3323005/trump-expands-cities-targeted-possible-military-deployment-baltimore","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/08/25/d63a970c-1d94-47cd-a314-6d59c7cd713a_97a7f946.jpg","video":null,"publish_date":"2025-08-24 23:09:27","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.1},{"id":353935100,"title":"‘No magic fixes’ for Democrats as party confronts internal and fundraising struggles","text":"MINNEAPOLIS (AP) — Ken Martin is in the fight of his life.\n\nThe low-profile political operative from Minnesota, just six months on the job as chairman of the Democratic National Committee, is charged with leading his party’s formal resistance to President Donald Trump and fixing the Democratic brand.\n\n“I think the greatest divide right now in our party, frankly, is not ideological,” Martin told The Associated Press. “The greatest divide is those people who are standing up and fighting and those who are sitting on the sidelines.”\n\n“We’re using every single lever of power we have to take the fight to Donald Trump,” he said of the DNC.\n\nAnd yet, as hundreds of Democratic officials gather in Martin’s Minneapolis hometown on Monday for the first official DNC meeting since he became chair, there is evidence that Martin’s fight may extend well beyond the current occupant of the Oval Office.\n\nBig Democratic donors are unhappy with the direction of their own party and not writing checks. Political factions are fragmented over issues such as the Israel-Hamas war. The party’s message is murky. Key segments of the Democratic base — working-class voters and young people, among them — have drifted away.\n\nAnd there is deep frustration that the Democratic Party under Martin’s leadership is not doing enough to stop the Republican president — no matter how tough his rhetoric may be.\n\n“There are no magic fixes,” said Jeanna Repass, the chair of the Kansas Democratic Party, who praised Martin’s performance so far. “He is trying to lead at a time where everyone wants it to be fixed right now. And it’s just not going to happen.”\n\nAt this week’s three-day summer meeting, DNC officials hope to make real progress in reversing the sense of pessimism and frustration that has consumed Democrats since Republicans seized the White House and control of Congress last fall.\n\nIt may not be so easy.\n\nConfidence questions and money trouble\n\nAt least a couple of DNC members privately considered bringing a vote of no confidence against Martin this week in part because of the committee’s underwhelming fundraising, according to a person with direct knowledge of the situation who was granted anonymity to share internal discussions. Ultimately, the no confidence vote will not move forward because Martin’s critics couldn’t get sufficient support from the party’s broader membership, which includes more than 400 elected officials from every state and several territories.\n\nStill, the committee’s financial situation is weak compared with the opposition’s.\n\nThe most recent federal filings reveal that the DNC has $14 million in the bank at the end of July compared with the Republican National Committee’s $84 million. The Democrats’ figure represents its lowest level of cash on hand in at least the last five years.\n\nMartin and his allies, including his predecessor Jaime Harrison, insist it’s not fair to compare the party’s current financial health with recent years, when Democratic President Joe Biden was in the White House.\n\nHarrison pointed to 2017 as a more accurate comparison. That year, the committee struggled to raise money in the months after losing to Trump the first time. And in the 2018 midterm elections that followed, Harrison noted, Democrats overcame their fundraising problems and won the House majority and several Senate seats.\n\n“These are just the normal pains of being a Democrat when we don’t have the White House,” Harrison said. “Ken is finding his footing.”\n\nMartin acknowledged that big donors are burnt out after the last election, which has forced the committee to turn to smaller-dollar donors, who have responded well.\n\n“Money will not be the ultimate determinant in this (midterm) election,” Martin said. “We’ve been making investments, record investments, in our state parties. … We have the money to operate. We’re not in a bad position.”\n\nGaza debate could get ugly\n\nWhile Martin is broadly popular among the DNC’s rank and file, internal divisions may flare publicly this week when the committee considers competing resolutions about the Israel-Hamas war.\n\nOne proposed resolution would have the DNC encourage Democratic members of Congress to suspend military aid to Israel, establish an arms embargo and recognize Palestine as a country, according to draft language reviewed by the AP. The measure also states that the crisis in Gaza has resulted in the loss of over 60,000 lives and the displacement of 1.7 million Palestinians “at the hands of the Israeli government.”\n\nThe DNC leadership, led by Martin, introduced a competing resolution that adds more context about Israel’s challenges.\n\nOne line, for example, refers to “the suffering of both Palestinians and Israelis” and notes the number of Israelis killed in Hamas’ Oct. 7 attack on Israel. Martin’s version calls for a two-state solution, but there is no reference to the number of Palestinians killed or displaced, nor is there a call for an end to military aid or an arms embargo.\n\nMeanwhile, another proposed resolution would reaffirm the DNC’s commitment to “diversity, equity and inclusion.” Many Democrats, businesses and educational institutions have distanced themselves from DEI programs after Trump and other Republicans attacked them as Democrats’ “woke” policies.\n\nUltimately, Martin said the party needs to focus its message on the economy.\n\n“There’s no doubt we have to get back to a message that resonates with voters,” he said. “And focusing on an economic agenda is the thing that brings all parts of our coalition and Americans into the conversation.”\n\n“We have work to do for sure,” he added.\n\nPresidential prospects on the agenda\n\nThe DNC is years away from deciding which states vote first on the 2028 presidential primary calendar, but that discussion will begin in earnest at the Minneapolis gathering, where at least three presidential prospects will be featured speakers: Connecticut Sen. Chris Murphy, Minnesota Gov. Tim Walz and Minnesota Sen. Amy Klobuchar.\n\nMartin said the DNC is open to changes from the 2024 calendar, which kicked off in South Carolina, while pushing back traditional openers Iowa and New Hampshire. In recent days, Iowa Democrats have publicly threatened to go rogue and ignore the wishes of the DNC if they are skipped over again in 2028.\n\nThe DNC’s Rules and Bylaws committee this week is expected to outline what the next calendar selection process would look like, although the calendar itself likely won’t be completed until 2027.\n\n“We’re going to make sure that the process is open, that any state that wants to make a bid to be in the early window can do so,” Martin said.\n\nSteve Peoples, The Associated Press","summary":"MINNEAPOLIS (AP) — Ken Martin is in the fight of his life. The low-profile political operative from Minnesota, just six months on the job as chairman of the Democratic National Committee, is charged with leading his party&#8217;s formal resistance to President Donald Trump and fixing the Democratic brand. “I think the greatest divide right now [&#8230;]","url":"https://toronto.citynews.ca/2025/08/24/no-magic-fixes-for-democrats-as-party-confronts-internal-and-fundraising-struggles/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/08/17af75976f9bc51cbccd644cbfbd1d52abadeb42ab62df50a0ded98321645035.jpg","video":null,"publish_date":"2025-08-24 23:03:50","author":"News Staff,Steve Peoples","authors":["News Staff","Steve Peoples"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.171},{"id":353927786,"title":"Chicago mayor calls Trump's National Guard plan 'most flagrant violation of our Constitution'","text":"Chicago Mayor Brandon Johnson on Sunday called President Donald Trump’s plan to send the National Guard to Chicago a \"flagrant violation of our Constitution.\" \"What the President is proposing would be the most flagrant violation of our Constitution in the 21st Century,\" Johnson wrote on X. \"The City of Chicago does not need a military occupation.\" Johnson also shared a clip from his appearance on MSNBC’s \"The Weekend.\" On the show, Johnson said Chicago has made clear what it needs instead of troops. GOV. PRITZKER SAYS TRUMP TRYING TO 'MANUFACTURE A CRISIS' AS ADMIN PLANS NATIONAL GUARD DEPLOYMENT TO CHICAGO \"We need to invest in people to ensure that we can build safe and affordable communities. That’s what I’ve done as mayor since assuming office,\" he said. \"It’s unfortunate that this president is working overtime to divide in his attempt to conquer working families and to conquer cities across America. \"But this is clearly a violation of the Constitution, and we’re going to remain firm and vigilant in our commitment to ensure that our democracy is protected, and our humanity is secured,\" Johnson added. Trump said Friday that Chicago would be next for federal intervention after efforts in Washington, D.C., conclude. CHICAGO MAYOR CALLS TRUMP'S NATIONAL GUARD DEPLOYMENT PLAN 'UNCOORDINATED, UNCALLED-FOR AND UNSOUND' He vowed to send troops elsewhere afterward to \"make it safe\" as well. \"We’re going to make our country very safe,\" Trump said. \"...Chicago’s a mess.\" Soon after Trump’s announcement, Johnson said Chicago had received no formal notice of law enforcement or military deployments and expressed \"grave concerns\" about any unlawful action. He called the administration’s efforts \"uncoordinated, uncalled-for and unsound,\" pushing back after Trump labeled him \"grossly incompetent\" earlier in the day. He noted homicides are down 30%, robberies are down 35% and shootings are down nearly 40% in the past year, arguing federal action would erode trust. TRUMP HINTS AT FEDERAL CRACKDOWN IN CHICAGO AMID ANTI-CRIME PUSH IN DC Johnson released a statement on Sunday, saying he and his team are in communication with counterparts at the county and state levels as Chicago prepares for any possible military deployments to the city. \"The Governor, the Cook County Board President, and I are in complete alignment: Chicago is not calling for a military occupation of our city. We are currently evaluating all of our legal options to protect the people of Chicago from unconstitutional federal overreach,\" Johnson said. \"No matter what happens, the City of Chicago will not waver. We are Chicago. We will not bend or cower, and we will never break.\" The White House suggested that leaders of blue cities like Chicago focus on their own issues rather than criticizing the president for trying to make America great. \"If Democrats spent half as much time solving their own city’s crime problems as they did criticizing the President for wanting to Make America Safe Again, their constituents would be much better off,\" White House spokesperson Abigail Jackson told Fox News Digital. Chicago, which struggles with poverty and gangs, has a crime rate above the national average. But 2023 data shows several Illinois cities—including Chicago Heights, Danville, Peoria, Rockford and Harvey—had much higher violent crime rates than Chicago. CLICK HERE TO GET THE FOX NEWS APP On Aug. 11, Trump federalized D.C.’s Metropolitan Police under the Home Rule Act, which lets the president control the force for 30 days. A week later, six red states pledged 2,000 Guardsmen to D.C., joining agents from the FBI, DEA and ATF. Fox News Digital’s Alexandra Koch contributed to this report.","summary":"Mayor Brandon Johnson pushed back against Trump&apos;s National Guard plans for Chicago, citing 30% drop in homicides and concerns about eroding police-community trust.","url":"https://www.foxnews.com/politics/chicago-mayor-calls-trumps-national-guard-plan-most-flagrant-violation-our-constitution","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/chicago-mayor-trump-national-guard-constitution-fox-news-001.jpg","video":"https://www.foxnews.com/video/6374490312112","publish_date":"2025-08-24 23:00:43","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"US","sentiment":-0.3},{"id":353932544,"title":"On the Colombian Border with Venezuela –  A Billboard Posted a Reward for Maduro and Cabello","text":"A billboard displaying a reward offered by the United States government for Venezuelan President Nicolás Maduro and his Interior Minister, Diosdado Cabello, was installed this Saturday on the Colombian side of the border with the Caribbean nation. The large sign surprised those traveling today on the Simón Bolívar International Highway, which connects Colombia and Venezuela, near the municipality of Villa del Rosario, near Cúcuta, the capital of the border department of Norte de Santander. On the billboard, in English, is the $50 million reward the U.S. is offering for Maduro and $25 million for Cabello, for crimes such as “conspiracy to commit narco-terrorism” and to export cocaine, among others. \n\nOn August 7, U.S. Attorney General Pam Bondi announced a $50 million reward for information leading to the arrest of Maduro. Maduro was charged with drug trafficking and terrorism in 2020 during Donald Trump’s first presidency. This was followed by a $25 million reward for his capture in January. According to the United States, the Venezuelan government is linked to the Cartel of the Suns, a drug trafficking group classified as a terrorist organization. The Secretary of Government of Villa del Rosario, José Guillermo Ruiz, told reporters that the fence was installed without any authorization or compliance with the requirements established by the municipal administration. \n\n“We contacted the person responsible for the process, the Undersecretary of Urban Control, who confirmed that no permit existed and requested the removal of the advertising,” he added. This week, the U.S. sent three Navy ships carrying 4,000 troops to Caribbean waters near Venezuela, which, according to White House spokeswoman Karoline Leavitt, are intended to “use all their power” to stem the “flow of drugs into their country.” This deployment has heightened tensions in Venezuela, where pro-government militias are holding a recruitment drive in barracks and plazas this Saturday, called by Maduro. María Corina Machado is on Instagram, thanking everyone in the USA below:\n\nMaría Corina Machado Calls for Disobedience to Maduro’s Call for Military Enlistment\n\nGovernment supporters gathered in several parts of Caracas to enlist and urged the population to join. Venezuelan opposition leader María Corina Machado called this Saturday for disobedience of the weekend readiness campaign for “militia forces” called by President Nicolás Maduro, in response to the planned U.S. patrol of ships in the Caribbean Sea near the South American country to combat drug trafficking. \n\n“They want to use you to appear strong, when the reality is that they are falling apart. They expect you to come out and defend them when they are hiding,” Machado wrote on his X account, along with the request: “Disobey; ignore them, leave them alone.” The former parliamentarian also emphasized that “the empty squares throughout Venezuela today” reflect, in her opinion, “the future that is approaching.” Maduro called for a militia registration day in every Plaza Bolívar in the country and in the barracks. This Saturday, reporters were able to confirm that Venezuelan government supporters gathered in various parts of Caracas to enlist in the Bolivarian National Militia (MNB) and urged the population to join the event, which will initially run until Sunday. \n\nThe mayor of Libertador Municipality, Carmen Meléndez, joined, along with other local authorities, in the activity, which was replicated, as news reporters confirmed, in other locations such as La Pastora Square, also in downtown Caracas. According to images broadcast by the state-run Venezolana de Televisión (VTV), the enlistment campaign for the MNB, which is made up of civilian volunteers and was created in 2009 by the late President Hugo Chávez (1999-2013), also took place in several Venezuelan states, including Lara, Bolívar, Táchira, Trujillo, Sucre, and La Guaira. Last Monday, Maduro ordered the deployment of 4.5 million militiamen across the country, after the US increased the reward for information leading to his capture to $50 million. \n\nA day later, on Tuesday, White House spokeswoman Karoline Leavitt asserted that Washington is prepared to “use all its power” to stem the “flow of drugs into its country,” which would include sending ships and troops to waters near Venezuela. Venezuelan Defense Minister Vladimir Padrino urged people not to “get nervous” as the enlistment process begins. According to the military commander, this Saturday’s demonstration is “a voluntary mobilization of the people to register for a very powerful body created by the Bolivarian Revolution,” which, he asserted, is “spread throughout the national territory.”","summary":"On the billboard, in English, was the $50 million bounty the U.S. is offering for Maduro.\n\n\nThe post On the Colombian Border with Venezuela &#8211;  A Billboard Posted a Reward for Maduro and Cabello appeared first on Newsroom Panama.","url":"https://newsroompanama.com/2025/08/24/on-the-colombian-border-with-venezuela-a-billboard-posted-a-reward-for-maduro-and-cabello/","image":"https://newsroompanama.com/wp-content/uploads/2025/08/maduro-valla-colombia.jpg","video":null,"publish_date":"2025-08-24 22:58:51","author":"Newsroom Panama","authors":["Newsroom Panama"],"language":"en","category":"politics","source_country":"pa","sentiment":0.007},{"id":353926820,"title":"Catch Up: Key News Highlights You Might’ve Missed This Weekend","text":"Vice President JD Vance remains confident the U.S. can broker an end to the war between Russia and Ukraine despite potential hurdles that have arisen since President Donald Trump’s meeting earlier this month with Russian President Vladimir Putin.\n\n“We believe we’ve already seen some significant concessions from both sides, just in the last few weeks,” Vance stated in an exclusive interview on NBC News’ “Meet the Press.”\n\n“We’re going to eventually be successful, or we’ll hit a brick wall. And if we hit a brick wall, then we’re going to continue this process of negotiation, of applying leverage,” the vice president elaborated. “This is the energetic diplomacy that’s going to bring this war to a close.”\n\nMeanwhile, Russia’s top diplomat, Foreign Minister Sergey Lavrov, put a damper on hopes that Trump will propel a swift end to the war in Ukraine.\n\nHe mentioned to “Meet the Press” moderator Kristen Welker that Ukraine has impeded the process, noting that Ukrainian President Volodymyr Zelenskyy and European leaders “don’t want peace.”\n\n“Zelenskyy said no to everything,” Lavrov said. “How can we meet with a person who is pretending to be a leader?”\n\nLavrov indicated that Putin is ready to meet with Zelenskyy “when the agenda is ready.” However, he hinted that Putin would not sign a peace agreement with Zelenskyy, whose legitimacy Moscow has challenged since Ukrainian elections were postponed last year due to martial law.\n\n“When we come to a stage when you have to sign documents, we would need a very clear understanding by everybody that the person who is signing is legitimate,” he commented. “And according to the Ukrainian constitution, Mr. Zelenskyy is not at the moment.”\n\nJustice Department gave Ghislaine Maxwell ‘a platform to rewrite history,’ family of Virginia Giuffre says\n\nFamily members of Virginia Giuffre, a prominent Jeffrey Epstein accuser, said they were “outraged” by the Justice Department’s decision to release transcripts from Ghislaine Maxwell’s testimony last month, arguing the interviews provided Maxwell a “platform to rewrite history.”\n\n“The content of these transcripts is in direct contradiction with felon Ghislaine Maxwell’s conviction for child sex trafficking,” the family of Virginia Roberts Giuffre said in a statement. The family added, “This travesty of justice entirely invalidates the experiences of the many brave survivors who put their safety, security, and lives on the line to ensure her conviction, including our sister.”\n\nThe Justice Department on Friday released audio and transcripts of the two-day interview, during which Maxwell disputed several allegations of wrongdoing against her and Epstein, including by Giuffre, who died by suicide in April.\n\nMaxwell said she never witnessed any inappropriate conduct from any man, including Trump, and denied the existence of an incriminating “client list” of those who benefited from Epstein’s crimes.\n\nOn “Meet the Press,” Sen. am Schiff echoed the Giuffre family’s view, claiming that Maxwell has the motivation to say anything that could potentially get her pardoned.\n\n“She says exactly what her lawyers tell her is going to be necessary to get a pardon. No one should be surprised here,” Schiff said.\n\nPolitics in brief\n\nPadding passage: The Republican-controlled Texas state Senate passed the party’s new congressional maps — designed to pad the GOP majority in the U.S. Congress — completing a legislative odyssey that sparked a nationwide scramble over redistricting.\nUndelivered: Postal services across the world are halting parcel deliveries to the United States amid mounting confusion over new import duties imposed on small shipments under Trump’s new tariff regime.\nBaltimore next? Trump on Truth Social threatened to send the military into Baltimore to “quickly clean up” crime, the latest in a line of threats to replicate the deployment of National Guard troops to Washington.\n\nThe federal takeover of Washington has sparked a fierce debate over the state of crime in the city. What’s beyond dispute is that carjackings exploded during the pandemic and are not yet back to pre-pandemic levels. It’s a particularly brutal crime, experts say, one that often causes lasting psychological damage.\n\n“It became the crime of the pandemic,” said Chuck Wexler, executive director of the Police Executive Research Forum, a Washington-based organization of current and former law enforcement officials focused on improving policing. “And the reason you still have it is because juveniles learned how to do it. That presents a lot of challenges for the justice system.”\n\nThe soaring number of young people who have engaged in carjacking is indeed one of the key factors that has driven the surge in the Washington area and beyond, according to interviews with more than half a dozen police officials, criminologists and youth advocates.\n\nSome of these perpetrators stole vehicles to use them to commit more crimes. Many others commit carjackings simply for the thrill of it, or to earn respect and attention on social media, according to police investigators and advocates who have spoken to the young offenders.\n\nOver the last 18 months, the carjacking numbers have fallen in the area. Sgt. Josh Scall, a supervisor in the carjacking unit in neighboring Prince George’s County, Maryland, said he’s proud of the progress, but even one carjacking is one more than he wants to see in his county.\n\n“We can parade that we’re not at 573,” Scall added, referring to the record number of carjackings recorded in Prince George’s in 2023. “But it’s still unacceptable in our books.”\n\nSending a freshman off to college is almost always an expensive endeavor, but the latest viral trend is taking back-to-school shopping to the next level.\n\nExtreme dorm makeovers are becoming increasingly popular, with some parents shelling out tens of thousands of dollars and hiring professional interior designers to transform their kids’ humble abodes into the dorm rooms of their dreams.\n\nFar removed from the beat-up mini-fridges and crooked posters of the past, the dramatic transformations are unnecessary, some say, and reflect the widening line between the haves and have-nots in the United States.\n\n“Wealth disparity just becomes obvious on a college campus, because suddenly your lifestyle is either funded by you or it’s not,” said Mya Mendola, who graduated from the University of Minnesota last year.\n\nNotable quote\n\nFrank Ilett announced last October he wouldn’t trim his locks until his beloved Manchester United won five soccer matches in a row. More than 320 days later, he’s still waiting.\n\nIn case you missed it\n\nKilmar Abrego Garcia, wrongfully deported to a notorious prison in El Salvador, now faces removal to Uganda after being freed from federal custody.\nPolice on Saturday identified the five people who were killed in a tour bus crash in western New York.\nJerry ler, best known for playing a mobster’s confidant on “The Sopranos,” dies at 96.\nA judge in Mexico said boxer Julio César Chávez Jr. will stand trial over alleged cartel ties and arms trafficking but could await that trial outside of detention, the boxer’s lawyer said.\nThe son of “Walking Dead” star Norman Reedus was arrested and charged following an alleged assault in a New York City apartment.\nMore than 20 hospitals and health systems have temporarily or indefinitely rolled back transgender care for minors and some young adults this year amid threats of federal investigations and cuts to government funding.\nHome Depots have become prime locations for immigration enforcement as federal agents target day laborers in search of work.\nA lawsuit against Delbarton, an elite all-boys Catholic school where several former students have come forward with sex abuse allegations, is set to be the first civil trial involving the Catholic Church in New Jersey.","summary":"Internewscast Journal\n\nInternewscast\n\n\nVice President JD Vance remains confident the U.S. can broker an end&#8230;\n\n\nThis Post: Catch Up: Key News Highlights You Might&#8217;ve Missed This Weekend first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/catch-up-key-news-highlights-you-mightve-missed-this-weekend/","image":"https://internewscast.com/wp-content/uploads/2025/08/1756076097_Here039s-the-biggest-news-you-missed-this-weekend.jpg","video":null,"publish_date":"2025-08-24 22:56:43","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.329},{"id":353936336,"title":"Trump threatens to cut off Key bridge repair money after Maryland governor tells him to keep National Guard out of Baltimore","text":"Donald Trump deepened his feud with Maryland’s Democratic governor on Sunday and threatened to cancel funding for the reconstruction of the Francis Scott Key Bridge, which was destroyed by a ship strike last year.\n\nThe Republican president made no attempt to offer a reason for his threat other than his own political differences with Wes Moore, Maryland’s governor and the only Black leader of a U.S. state.\n\nInstead, the president made clear in a Truth Social post that disaster relief funding would be wielded as a political weapon against any state or local leaders who dared challenge him.\n\n“I gave Wes Moore a lot of money to fix his demolished bridge,” Trump said on Sunday, which isn’t true. He wasn’t president in 2024, when full federal funding for the project was allocated during government funding negotiations.\n\nHe continued: “I will now have to rethink that decision???” \n\nThe post came in response to Moore’s invitation to the president to walk the city of Baltimore.\n\nMoore attempted to extend an olive branch to the president with his invitation last week, which came amid Trump’s threats to extend his federal takeover of Washington, D.C. to other cities with Democratic leadership and large Black populations.\n\n“Donald Trump, if you are not willing to walk our communities, keep our name out of your mouth,” Moore said last week.\n\nBut Trump wasn’t having it.\n\nIn a lengthy Truth Social post on Sunday, he claimed the governor’s record on “crime” is “a very bad one, unless he fudges his figures on crime like many of the other ‘Blue States’ are doing.”\n\nHe said he would send in “troops” like he did in Los Angeles to “quickly clean up the Crime.”\n\n“When it is like that in Baltimore, I will proudly ‘walk the streets’ with the failing, because of Crime, Governor of Maryland,” he wrote.\n\nThe White House announced earlier in August that it was federalizing Washington, D.C.’s police force and deploying the National Guard and agents from multiple federal law enforcement agencies on the streets of the nation’s capital. The purpose was ostensibly to combat a crime wave, though the administration’s explanation has shifted between fighting crime and beautification measures. After a few days, control of the police was returned to city leaders.\n\nNational Guard troops remain across D.C., however, and federal agents continue to patrol city streets. The president said on Friday that he was looking to expand his efforts to other cities led by Democrats, though legal restrictions over the deployment of the Guard will likely hinder that plan.\n\nMoore, like other Democratic governors, has said that he will refuse to authorize the deployment of Maryland’s National Guard troops for crimefighting efforts in Baltimore.\n\nBut Sunday’s post from the president is an indication he could attempt to use Department of Transportation and FEMA disaster relief funding as a means of enticing Democratic governors to do his bidding.\n\n“It's interesting the president seems to be more concerned about my future than he is about the future of the American people, and that's why I'm asking him to keep his focus,” Moore told CBS Face the Nation when asked about Trump’s remarks about the governor’s possible presidential ambitions.\n\n“Focus on the things that actually matter right now, which is the fact that his economic policies are driving up prices on everything from electronics, to the clothes that we wear, to the food that we eat,” Moore said. “Talk about the fact that he has immigration policies that are knocking out tens of thousands of jobs in the state of Maryland. Talk about the fact that you are about to kick veterans and seniors off of health care. Don't worry about my future. Worry about theirs.”\n\nAfter his appearance on the show on Sunday, Moore fired back at Trump’s\n\n“President Bone Spurs will do anything to get out of walking — even if that means spouting off more lies about the progress we’re making on public safety in Maryland,” Moore wrote, referencing the president’s medical deferment that exempted him from being drafted into military service during the Vietnam War.\n\n“Hey Donald, we can get you a golf cart if that makes things easier,” Moore wrote. “Just let my team know.”\n\nThe Francis Scott Key Bridge, named after the poet who penned “The Star-Spangled Banner,” was a Baltimore landmark for decades. Its destruction in 2024, the result of a cargo ship losing power and steering into a support column, also caused the deaths of a work crew who were performing maintenance on the bridge in the late evening hours when the incident took place.\n\nThe closure of that stretch of Maryland’s I-695 beltway continues to disrupt transit around Baltimore and had immediate and significant effects on the state economy. The destruction shuttered the Port of Baltimore for 11 weeks, at a staggering economic impact estimated around $15 million per day.\n\nIn a separate post on Truth Social the president questioned whether Moore, who served in the Army, lied about being awarded a Bronze Star.\n\nMoore was awarded a Bronze Star last year for meritorious service; Army officials acknowledged that the mixup was a result of paperwork not being properly processed, not deception on Moore’s part.\n\nThe governor fired back in a post on X, writing: “Did Donald Trump, the President of the United States, lie about an injury to dodge the Vietnam draft?”","summary":"Trump escalates attacks on nation’s only Black governor as African-American leaders continue to be his favorite targets","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-wes-moore-key-bridge-baltimore-national-guard-b2813409.html","image":"https://static.independent.co.uk/2025/08/24/22/06/MixCollage-24-Aug-2025-06-27-PM-945.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/40gK1YJZ-4VHSaSK0.mp4","publish_date":"2025-08-24 22:54:28","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.21},{"id":353933264,"title":"France summons US ambassador over 'unacceptable' letter about antisemitism","text":"WASHINGTON -- France has summoned the American ambassador to Paris after the diplomat, Charles Kushner, wrote a letter to French President Emmanuel Macron alleging the country did not do enough to combat antisemitism.\n\nFrance's foreign ministry issued a statement Sunday announcing it had summoned Kushner to appear Monday at the French Ministry for Europe and Foreign Affairs and that his allegations “are unacceptable.”\n\nThe White House and U.S. State Department did not immediately respond to messages seeking comment. The summoning of the ambassador is a formal and public notice of displeasure. \n\nKushner, a real-estate developer, is the father of President Donald Trump’s son-in-law Jared Kushner.\n\nThe French foreign ministry, in its statement, said “France firmly rejects these allegations” from Kushner and that French authorities have “fully mobilized” to combat a rise in antisemitic acts since the Oct. 7, 2023 attack by Hamas on Israel, deeming the acts “intolerable.”\n\nThe contents of the letter were not released.\n\nKushner’s allegations violate international law and the obligation not to interfere with the internal affairs of another country, the French ministry said, and, “They also fall short of the quality of the transatlantic partnership between France and the United States and of the trust that must prevail between allies.”\n\nThe dustup follows Macron's rejection this past week of accusations from Israel Prime Minister Benjamin Netanyahu that France's intention to recognize a Palestinian state is fueling antisemitism.\n\nFrance is home to the largest Jewish population in Western Europe, with an estimated 500,000 Jews. That’s approximately 1% of the national population.\n\nThe diplomatic discord comes as French-U.S. relations have faced tensions this year amid Trump's trade war and a split over the future of U.N. peacekeepers in Lebanon. France in particular has objected to the U.S. push to wind down the peacekeeping operation known as UNIFIL, with a vote on the issue set for the end of the month by the U.N. Security Council.\n\nFrance and the U.S. have also been divided on support for Ukraine in its war with Russia, but the split has eased with Trump expressing support for security guarantees and a warm meeting with Macron and other European leaders at the White House last week. \n\nTrump at the end of his first term as president pardoned Charles Kushner, who pleaded guilty years earlier to tax evasion and making illegal campaign donations. \n\nHis son Jared is a former White House senior adviser to Trump who is married to Trump’s eldest daughter, Ivanka.","summary":"He wrote to Macron alleging France did not do enough to combat antisemitism.","url":"https://abcnews.go.com/US/wireStory/france-summons-us-ambassador-kushner-unacceptable-letter-rising-124938909","image":"https://i.abcnewsfe.com/a/d12c0cab-cde3-4e64-bf1c-16677a3daf61/wirestory_f282bad136613817ae2f2a3043d9f159_16x9.jpg?w=1600","video":null,"publish_date":"2025-08-24 22:50:14","author":"Michelle L. Price Associated Press","authors":["Michelle L. Price Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.119},{"id":353925968,"title":"Trump Threatens To Deploy National Guard Troops To Baltimore: 'Clean Up Crime Or...'","text":"US President Donald Trump has threatened to send federal troops to Baltimore, escalating tensions with Maryland Governor Wes Moore after the Democrat invited him to join a community “safety walk” in the city. On Sunday, Trump posted on Truth Social, saying, \"If Wes Moore needs help, like Gavin Newscum did in LA, I will send in the 'troops,' which is being done in nearby DC, and quickly clean up the Crime.\" The President’s comments came after Governor Moore wrote a letter inviting Trump to walk with him in Baltimore neighborhoods to better understand the challenges residents face. Trump described the letter as “nasty” and “provocative,” saying he would prefer Moore “clean up this crime disaster” before his visit, as per AFP report. Governor Moore’s Response Governor Moore called Trump’s remarks “tone deaf and ignorant.” \"It's because they have not walked our streets. They have not been in our communities, and they are more than happy to keep making these repeated tropes about us,\" Moore said. Baltimore, which has long been targeted in Trump’s speeches on crime, recorded its lowest number of homicides in more than 50 years in 2024, according to city data. Troops Already in Washington Trump has already sent about 2,000 National Guard troops to Washington DC, supported by Republican-led states. While the troops have not taken part in direct law enforcement, they are now authorized to carry weapons and have been stationed near landmarks. Trump said the mission had brought “total safety” to the capital. \"DC was a hellhole,\" he said, adding, \"But now it's safe.\" However, police data shows violent crime in DC had already been falling. In 2024, crime levels reached a 30-year low, and in 2025 so far, violent crime has dropped another 26% compared to last year. Democratic leaders opposed Trump’s strategy. Illinois Governor JB Pritzker said Trump’s threat to send troops to Chicago was an “abuse of power.” House Minority Leader Hakeem Jeffries argued Trump lacked legal authority to dispatch troops into cities like Baltimore and Chicago without local approval. He also accused the President of exaggerating crime problems to justify military action. A recent Washington Post/Schar School poll showed that nearly 80% of Washington DC residents oppose the deployment of both federal officers and the National Guard, as well as the idea of the federal government taking over the Metropolitan Police Department. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Tensions have escalated between President Trump and Maryland Governor Wes Moore following Trump's threat to deploy federal troops to Baltimore. This came after Moore invited Trump to participate in a community walk to witness local challenges firsthand. Trump criticized the invitation as \"nasty\" and insisted on crime cleanup before visiting.","url":"https://www.timesnownews.com/world/us/us-news/trump-threatens-to-deploy-national-guard-troops-to-baltimore-clean-up-crime-or-article-152518720","image":"https://images.timesnownews.com/thumb/msid-152518729,thumbsize-1217007,width-1280,height-720,resizemode-75/152518729.jpg","video":null,"publish_date":"2025-08-24 22:47:13","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","category":"politics","source_country":"in","sentiment":0.009},{"id":353933502,"title":"Russia-Ukraine tukar 146 tawanan perang","text":"ISTANBUL: Russia dan Ukraine menukar 146 tawanan perang masing-masing pada Ahad dengan pengantaraan Emiriah Arab Bersatu (UAE), menurut Kementerian Pertahanan Rusia, lapor Anadolu Ajansi (AA).\n\n Dalam kenyataan itu, kementerian berkenaan berkata seramai 146 anggota tenteranya dikembalikan hasil \"usaha pengantaraan kemanusiaan\" oleh UAE.\n\n Sebagai pertukaran, 146 tawanan perang Angkatan Tentera Ukraine diserahkan kepada pihak Ukraine,\" katanya.\n\n Menurut kementerian itu, turut dikembalikan kepada Moscow ialah lapan warganegara Russia yang menetap di wilayah sempadan Kursk, sebagai sebahagian daripada pertukaran itu.\n\n Kementerian itu memaklumkan anggota tentera Russia yang dibawa pulang itu kini berada di Belarus untuk menerima bantuan psikologi dan perubatan yang diperlukan.\n\n Ukraine setakat ini belum mengesahkan pertukaran itu, yang berlaku di tengah-tengah usaha intensif diplomatik diketuai Presiden Amerika Syarikat (AS), Donald Trump bagi mengantara satu penyelesaian konflik Russia-Ukraine yang berlarutan sejak Februari 2022. – BERNAMA-ANADOLU","summary":"ISTANBUL: Russia dan Ukraine menukar 146 tawanan perang masing-masing pada Ahad dengan pengantaraan Emiriah Arab Bersatu (UAE), menurut Kementerian Pertahanan Rusia, lapor Anadolu Ajansi (AA).","url":"https://www.bharian.com.my/dunia/eropah/2025/08/1437548/russia-ukraine-tukar-146-tawanan-perang","image":"https://assets.bharian.com.my/images/articles/BHROSYA_BHfield_image_listing_featured.var_1756078117.jpg","video":null,"publish_date":"2025-08-24 22:45:36","author":"Clicking Here","authors":["Clicking Here"],"language":"en","category":"politics","source_country":"my","sentiment":0.035},{"id":353925482,"title":"Russia, Ukraine tukar masing-masing 146 tawanan perang","text":"ISTANBUL: Russia dan Ukraine menukar 146 tawanan perang masing-masing pada Ahad dengan pengantaraan Emiriah Arab Bersatu (UAE), menurut Kementerian Pertahanan Rusia, lapor Anadolu Ajansi (AA).\n\n Dalam kenyataan itu, kementerian berkenaan berkata seramai 146 anggota tenteranya dikembalikan hasil \"usaha pengantaraan kemanusiaan\" oleh UAE.\n\n Sebagai pertukaran, 146 tawanan perang Angkatan Tentera Ukraine diserahkan kepada pihak Ukraine,\" katanya.\n\n Menurut kementerian itu, turut dikembalikan kepada Moscow ialah lapan warganegara Russia yang menetap di wilayah sempadan Kursk, sebagai sebahagian daripada pertukaran itu.\n\n Kementerian itu memaklumkan anggota tentera Russia yang dibawa pulang itu kini berada di Belarus untuk menerima bantuan psikologi dan perubatan yang diperlukan.\n\n Ukraine setakat ini belum mengesahkan pertukaran itu, yang berlaku di tengah-tengah usaha intensif diplomatik diketuai Presiden Amerika Syarikat (AS), Donald Trump bagi mengantara satu penyelesaian konflik Russia-Ukraine yang berlarutan sejak Februari 2022. – BERNAMA-ANADOLU","summary":"ISTANBUL: Russia dan Ukraine menukar 146 tawanan perang masing-masing pada Ahad dengan pengantaraan Emiriah Arab Bersatu (UAE), menurut Kementerian Pertahanan Rusia, lapor Anadolu Ajansi (AA).","url":"https://www.bharian.com.my/dunia/eropah/2025/08/1437548/russia-ukraine-tukar-masing-masing-146-tawanan-perang","image":"https://assets.bharian.com.my/images/articles/BHROSYA_BHfield_image_listing_featured.var_1756075527.jpg","video":null,"publish_date":"2025-08-24 22:45:36","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.035},{"id":353924948,"title":"Trump Floats Sending Military to Baltimore to Fight ‘Crime Disaster’","text":"Executive Branch\n\nTrump Floats Sending Military to Baltimore to Fight ‘Crime Disaster’\n\n‘If [Maryland Gov.] Wes Moore needs help ... I will send in the ’troops’ ... and quickly clean up the Crime,’ President Donald Trump said.\n\nJoseph Lord\n\n8/24/2025|Updated: 8/24/2025\n\n“If [Maryland Gov.] Wes Moore needs help, like [California Gov. Gavin Newsom] did in L.A., I will send in the ’troops,' which is being done in nearby DC, and quickly clean up the Crime,” Trump wrote in a post on Truth Social.\n\nJoseph LordAuthorJoseph Lord is a congressional reporter for The Epoch Times. \nAuthor’s Selected ArticlesTexas Senate Passes Redistricting Map Favoring RepublicansAug 23, 2025Texas Senate to Take Up Redistricting BillAug 22, 2025Federal Judge Bars New Detainees, Construction at ‘Alligator Alcatraz’Aug 21, 2025US Pauses Visas for Commercial Truck Drivers, Citing Safety and Other ImpactsAug 21, 2025","summary":"'If [Maryland Gov.] Wes Moore needs help ... I will send in the 'troops' ... and quickly clean up the Crime,' President Donald Trump said.","url":"https://www.theepochtimes.com/us/trump-floats-sending-military-to-baltimore-to-fight-crime-disaster-5905506","image":"https://img.theepochtimes.com/assets/uploads/2025/08/24/id5905521-National-Guard-GettyImages-2230695100-300x180.jpg","video":null,"publish_date":"2025-08-24 22:43:56","author":"Joseph Lord","authors":["Joseph Lord"],"language":"en","category":"politics","source_country":"us","sentiment":-0.04},{"id":353926476,"title":"SpaceX Starship, the most powerful rocket ever built, is set for its next test Sunday","text":"The most powerful rocket system ever constructed is headed for its next test - using a version of the vehicle that has been at the center of a series of explosive missteps and failures.\n\nSpaceX said it is aiming to launch its Starship megarocket on an hour-long test flight as soon as 7:30 p.m. ET Sunday, though the liftoff time is subject to change. A webcast of the event is expected to begin about 30 minutes earlier, according to the company.\n\nThe uncrewed Starship prototype will follow a similar flight plan to the lastthree missions and aim to complete test objectives left untried during those tests, all of which ended prematurely. SpaceX debuted the current generation of Starship vehicles in January, following a clean run of test missions with a slightly scaled-down version of the rocket in 2024.\n\nBut since that debut, the vehicle has twice exploded over populated islands east of Florida, creating debris that hit roadways in Turks and Caicos and washed up onto the shores of Bahamian islands. The spacecraft also spun out of control as it headed toward its landing site in the Indian Ocean on its last test flight in May.\n\nThen, in June, a Starship spacecraft that had been strapped to an engine testing stand at the company's launch and development facilities in South Texas abruptly exploded - spewing shrapnel and causing damage to SpaceX infrastructure.\n\nThese setbacks roused long-standing SpaceX critics and attracted new ones, including the Mexican government, which has threatened legal action against the company over reported debris on and around its shores. The UK governmentalso said in a statement Thursday that it's been \"working closely with US Government partners to protect the safety\" of its overseas territories, including Turks and Caicos.\n\nThe string of mishaps this year has also raised concerns among spaceflight experts and stakeholders who have emphasized that the United States has a lot riding on Starship's eventual success, including its plans to return humans to the moon as soon as 2027.\n\nAnd that success is not guaranteed.\n\n\"It's very, very difficult to predict how this is going to end up,\" said Garrett Reisman, a former NASA astronaut and SpaceX consultant who is a professor of astronautical engineering at the University of Southern California.\n\n\"I think it could end up never working, or it could end up revolutionizing our entire future of activities in space - and geopolitics,\" he added, referring to the US goal of displaying technical superiority to China in a new space race.\n\nWhy SpaceX is allowed to fly again\n\nSpaceX said it implemented changes to the Starship system slated to fly this weekend in response to the last in-flight failure in May.\n\nThose alterations include adjustments to a component called a fuel diffuser, which the company believes malfunctioned during the last flight, causing higher-than-expected pressure to build up in Starship's nose cone. It is likely what caused the vehicle to spiral out of control, according to a technical overview SpaceX published last week.\n\nDespite the series of recent problems, the Federal Aviation Administration - which licenses commercial rocket launches - said last week it had closed its investigation into SpaceX's latest mishap and approved the company's plans to fly Sunday's mission.\n\nUnder current laws and regulations, the FAA is tasked solely with ensuring that commercial rocket companies do not pose a risk to public property or bystanders' safety.\n\n\"There are no reports of public injury or damage to public property. The FAA oversaw and accepted the findings of the SpaceX-led investigation,\" the agency said in an August 15 statement. \"SpaceX identified corrective actions to prevent a reoccurrence of the event.\"\n\nA long road ahead\n\nIn its update, SpaceX also made clear that the version of Starship that has experienced so many issues will soon be retired.\n\n\"Two flights remain with the current generation, each with test objectives designed to expand the envelope on vehicle capabilities,\" according to a company blog post.\n\nSpaceX CEO Elon Musk has already been teasing plans for larger, more ambitious iterations of the vehicle that would stretch even taller and carry more propellant.\n\nNow it appears clear that SpaceX will pursue that scaled-up version of Starship - which is already more than twice as powerful as the NASA rockets that powered the Apollo moon landings - whether or not the current line of Starship prototypes ever pulls off a successful test flight.\n\n\"It's very possible that a bigger upgrade might solve the current problem,\" Reisman said. \"It also could introduce new problems - you never know.\"\n\nNotably, the US government has taken several steps that could aide SpaceX in its efforts to expedite Starship testing.\n\nIn May, the FAA approved the company's plans to launch Starship as many as 25 times per year from Texas, up from the five it had been previously authorized to conduct.\n\nAnd earlier this month, President Donald Trump - despite a public and vitriolic falling out with Musk in June - issued an executive order that appears designed to scale back roadblocks and regulatory oversight for private-sector rocket operations, including environmental reviews.\n\nMeanwhile, the stakes appear to be growing with each Starship test flight, as SpaceX is racing against the clock.\n\nNot only does Musk want to send one of the vehicles on an uncrewed flight to Mars when the next opportunity arises in 2026, but NASA also plans to send its astronauts to the lunar surface aboard one of the vehicles as soon as mid-2027 as part of a $2.9 billion contract.\n\n\"We made this bet\" on Starship, said Janet Petro, who served as acting NASA administrator until July. \"They have had a rough year, but SpaceX is a pretty intense and motivated company.\"\n\nPetro added she had \"full confidence\" that SpaceX will refine Starship's design and get the vehicle working.\n\nReisman, the former SpaceX adviser, said he is also hopeful but less certain.\n\n\"SpaceX has made an existential gamble on Starship,\" Reisman said, adding that he is concerned about the rate of progress SpaceX has been making with Starship. \"They're pouring a tremendous amount of money and resources into its development ... but at some point, the laws of financial physics still apply.\"\n\nWhat SpaceX hopes to achieve with Flight 10\n\nIf all goes according to plan with Starship's next flight, referred to as Flight 10, the 400-foot-tall Starship launch system will take off from SpaceX's facilities in South Texas and soar out over the waters off the coast.\n\nThe bottom portion of the rocket system that gives the initial burst of power at liftoff, called Super Heavy, will attempt to make a controlled splashdown off the Texas coast, according to SpaceX.\n\nFor this mission, the company will not attempt to repeat its dramatic Super Heavy \"chopsticks\" landing in which the rocket booster steers itself back into the arms of the tower from which it launched. SpaceX said it will instead put the booster through a series of tests designed to push the vehicle to its limits \"to gather real-world performance data\" that could mimic a future mission that does not go as planned.\n\nMeanwhile, the upper Starship spacecraft, which is designed to one day carry cargo or convoys of astronauts but will haul only dummy satellites for this mission, will continue flying through space.\n\nDuring the flight, Starship will attempt to deploy the eight satellite \"simulators\" as well as relight one of the spacecraft's rocket engines in space. SpaceX has failed to hit both of those milestones in its last three test missions.\n\nEven if this V2 Starship prototype meets a similarly ill fate, SpaceX is likely once again to frame the test flight as a success.\n\nThe company employs an engineering philosophy called \"rapid iterative development,\" which emphasizes a pursuit of launching relatively cheap prototypes on frequent test missions over extensive ground testing or other less risky simulations.\n\nBecause of its unique development approach, SpaceX has been known to embrace fiery mishaps. The company has said that even failed test flights help engineers improve Starship's design - quicker than if SpaceX employed alternative engineering approaches.\n\n\"Every lesson learned, through both flight and ground testing, continues to feed directly into designs for the next generation of Starship and Super Heavy,\" SpaceX's August 15 statement reads. \"Two flights remain with the current generation, each with test objectives designed to expand the envelope on vehicle capabilities as we iterate towards fully and rapidly reusable, reliable rockets.\"\n\nSpaceX's development approach, while often seen as risky and brazen, has served the company well in the past.\n\nRarely has one of the company's rockets malfunctioned once it leaves the development stage and becomes operational. The company's human spaceflight track record, using Falcon 9 rockets, has been spotless.\n\nAnd if Starship does eventually work, Reisman said, it won't only be SpaceX - or even NASA - that benefits.\n\n\"The entire space industry is hoping and betting on Starship working, because if it achieves its promise, it'll also be a revolution in affordability,\" Reisman said. \"I think there's causes for optimism and pessimism - and I think it's very, very difficult to predict how this is going to end up.\"\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.","summary":"The most powerful rocket system ever constructed is headed for its next test - using a version of the vehicle that has been at the center of a series of explosive missteps and failures.","url":"https://abc7.com/post/spacex-starship-most-powerful-rocket-built-is-set-launch-test-today/17636918/","image":"https://cdn.abcotvs.com/dip/images/13142024_041723-ktrk-spacex.png?w=1600","video":null,"publish_date":"2025-08-24 22:42:05","author":"CNNWire,Jackie Wattles","authors":["CNNWire","Jackie Wattles"],"language":"en","source_country":"US","sentiment":-0.197},{"id":353933634,"title":"Reports indicate Trump intends to send National Guard troops to Chicago","text":"National Guard on the Horizon: A New Chapter in Chicago’s Tumultuous Struggle for Safety\n\nChicago, a city of soaring skylines and vibrant neighborhoods, a mosaic of cultures and a crucible of American urban challenges, now faces another potential upheaval. Whispers from Washington hint at a deepening federal intervention: thousands of National Guard troops poised to step onto Chicago’s streets. This isn’t merely a story about troop deployments—it’s a vivid tableau of politics, public safety, and the very soul of a city grappling with violence and polarized ideals.\n\nIn the Eye of the Storm: Unpacking the Federal Strategy\n\nFor weeks, according to multiple reports from The Washington Post and other major outlets, the Trump administration has been quietly crafting plans to send several thousand National Guard members to Chicago by as soon as September. The Pentagon, traditionally a bastion of secrecy, neither confirms nor denies the specifics, maintaining a cloak of caution that only fuels speculation.\n\n“The Department is always planning,” one defense official shared, preferring anonymity. “We continually coordinate with agency partners about protecting federal assets and personnel.” Yet the ambiguity surrounding this operation says as much about Jenga-like political dynamics as it does about law enforcement strategy.\n\nThis move follows similar deployments, most notably in June to Los Angeles when 4,000 California National Guardsmen and 700 active-duty Marines were sent into the city, despite protests from the state government. And now, Washington, DC, has witnessed a military presence bolstered to the point where troops are reportedly arming themselves in public spaces.\n\n“We’re going to make our cities very, very safe.”\n\nPresident Donald Trump’s words carry a resolute promise to transform urban safety across major cities. Speaking from the White House, he singled out Chicago and New York, promising federal muscle to combat crime. “Chicago will be our next,” Trump declared. \n\nBut safety is a word laden with meaning—and in cities where neighborhoods are stitched tightly with histories of systemic inequities and social activism, “safety” is seldom uncomplicated.\n\nChicago’s Political and Social Fabric: At the Heart of the Debate\n\nChicago’s political leaders were swift to push back. Democrat leaders, including Illinois Governor JB Pritzker and Mayor Brandon Johnson, rejected troop deployments outright, framing them as politically charged and counterproductive moves.\n\n“Donald Trump and MAGA Republicans are trying to paint their party as one of ‘law and order.’ That couldn’t be further from the truth,” Governor Pritzker wrote on X (formerly Twitter), his words echoing across a city skeptical of militarized approaches.\n\nMayor Johnson voiced frustration at the lack of collaboration: “We have received no formal communication from the administration regarding any plans,” he said in a statement to WBEZ Chicago. “Such action would be uncoordinated, uncalled for, and unsound.”\n\nChicago is no stranger to violence. The grim statistic of 573 homicides so far in 2024—an 8% drop compared to last year—still casts a long shadow over communities battling gun violence, poverty, and under-resourced services. But for those on the front lines like activists, community organizers, and residents, the question isn’t simply how to stamp out crime—it’s how to do so without fracturing the fragile trust between citizens and those in power.\n\nVoices from the Street\n\nMaria Hernandez, a lifelong South Side resident and community organizer, offers a grounded perspective. “Adding more troops might make some people feel safer,” she says, “but it doesn’t fix the fact that many here don’t trust law enforcement. We need jobs, better schools, and mental health support, not just more boots on the ground.”\n\nMeanwhile, Jason Kim, owner of a local bookstore near Wicker Park, worries about the broader implications. “Chicago’s always been a city of resilience. But when you see history repeating—militarization, protests, tear gas—it raises questions. Are we protecting people or just trying to appear tough for political points?”\n\nThe Larger Picture: Crime, Immigration, and the Politics of Fear\n\nThis impending deployment also dovetails with the Trump administration’s intensified crackdown on undocumented immigrants through Immigration and Customs Enforcement (ICE). The coupling of militarized policing with aggressive immigration enforcement feeds into a larger narrative about security, sovereignty, and American identity.\n\nYet, as experts like Dr. Leah Simmons, a criminologist at Northwestern University, point out, “There’s little evidence that such large-scale military interventions in urban crime control yield long-term reductions in violence or improved community trust. In fact, they often exacerbate tensions.”\n\nThe story unfolding in Chicago is emblematic of a wider trend seen across several major cities — a tug-of-war between federal power and local governance, entwined with racial, social, and political fault lines. And it forces us all to ask: What does true safety look like in a democracy?\n\nChicago Today: A City at a Crossroads\n\nFrom the jazz notes drifting out of a Bronzeville concert to the smell of deep-dish pizza wafting beneath the summer skyline, Chicago lives and breathes complexity. It is a place where history lingers palpably in every street corner and community space. And it is precisely in this intricate tapestry that the proposed National Guard deployment threads a delicate, fraught narrative.\n\nHow will everyday Chicagoans, who often feel like pawns in larger political games, perceive this move? Will it bring the seismic change promised, or will it deepen divides? And beyond Chicago—what lessons do other cities and nations draw from this unfolding drama?\n\nAs night falls over the city of winds, remember this: safety and security are more than the absence of violence—they are the presence of justice, opportunity, and hope. Any strategy that overlooks these essentials risks missing the heartbeat of the communities it claims to protect.\n\nSo, dear reader, as we witness this unfolding chapter, ask yourself: In a world increasingly drawn to spectacle and force, how do we reclaim compassion, understanding, and true safety in our cities? Chicago’s story is a mirror—what do you see?","summary":"National Guard on the Horizon: A New Chapter in Chicago’s Tumultuous Struggle for Safety Chicago, a city of soaring skylines and vibrant neighborhoods, a mosaic of cultures and a crucible of American urban challenges, now faces another potential upheaval. Whispers from Washington hint at a deepening federal intervention: thousands of National Guard troops poised to [&#8230;]","url":"https://jowhar.com/reports-indicate-trump-intends-to-send-national-guard-troops-to-chicago/","image":"https://jowhar.com/wp-content/uploads/2025/08/Reports-indicate-Trump-intends-to-send-National-Guard-troops-to.jpg","video":null,"publish_date":"2025-08-24 22:36:10","author":"hanad","authors":["hanad"],"language":"en","category":"politics","source_country":"so","sentiment":-0.035},{"id":353931470,"title":"Noah Cyrus addresses 'emotionally draining' attention on family tension: 'It doesn't hurt us or touch us'","text":"Noah Cyrus would like you to know that all the headlines and speculation about tension in her family over the years don't affect them.\n\n During a recent interview with PEOPLE, the 25-year-old singer and actress addressed the public's \"fixation\" on her family, which ramped up in the past few years after her parents, Tish Cyrus-Purcell and Billy Ray Cyrus, filed for divorce in 2022 after reconciling following their previous 2010 and 2013 filings. Speculation of strife was rampant as the family largely remained mum on the rumored rift.\n\n \"I keep myself quite separated from any interest or 'drama' with the family,\" Noah told PEOPLE. \"The one thing that's connected us with the entire world is music, and that's what's the most important to us.\" \n\n She admitted that the attention \"emotionally is draining,\" but asserted that the glare from the public's spotlight \"doesn't hurt us or touch us. It's something that you really learn to keep separate and far away from yourself.\"\n\n In the time that followed Tish and Billy Ray's divorce, the latter announced his engagement to singer Firerose in November 2022. A year later, Tish married Prison Break star Dominic Purcell, with Miley Cyrus reportedly serving as the maid of honor at the ceremony, which also included her siblings Brandi and Trace.\n\n Outlets reported that Noah's absence from the wedding was due to a rift between her and Tish because Noah had been romantically involved with Purcell for several months when Tish started pursuing him.\n\n Billy Ray then filed for divorce from Firerose in June 2024, after seven months of marriage. The ex-couple settled their contentious split that August.\n\n Billy Ray also made headlines this year after his unusual performance at Donald Trump's second inauguration. The incident prompted his son, Trace, to pen an open letter calling for his father to seek help.\n\n Shortly after, Billy Ray posted on Instagram that he was praying for his loved ones. \"Praying for my family,\" he wrote. \"For my children… sons and daughters… and their mother.\"\n\n He then announced a new relationship with Elizabeth Hurley in April. The couple first met while filming the 2022 movie Christmas in Paradise.\n\n Miley herself addressed the rumors of friction within her family during an appearance on the podcast Reclaiming With Monica Lewinsky in June. \n\n \"My family and I have had a really difficult… What did you call your decade? Dark decade. Yeah, we had one of those,\" Miley told host Monica Lewinsky. \"Half of us weren't speaking to each other at one point, and we cleaned all that up. That was a really important part of my year this year, was all of my family putting those lines of communication back together. A lot because of, you know, I had a lot of loyalty to my mom, the way that families do when parents get divorced.\"\n\n Miley said the implosion within her family was fueled by conflicts left unresolved for decades. \n\n \"But I just kind of bust through the pile that's stacked, and just go, 'I'm here. You're here. Let's start by having a good time together,'\" she said. \"And then as we start bringing some happiness and joy into each other's life, then we'll just be in a better place to have these conversations. 'Cause I'd rather get it balanced first.\"\n\n Looking back on their period of unrest two months after Miley's revelation, Noah told PEOPLE that her family is on the other side of all the \"drama.\"\n\n \"Everybody's great and loves each other,\" she said. \"I think when you grow up with that being normal — things being public — that it doesn't quite reach you. At the end of the day, this is a family, and that's really it: just going through normal family stuff.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n And nothing says family togetherness like working on an album together. Noah told the outlet that her latest album, I Want My Loved Ones to Go With Me, features four generations of Cyruses. The track \"Apple Tree\" features a sample of a recording of a hymn written by her great-grandfather, sung by her paternal grandfather. \"With You,\" was the first song her dad, Billy Ray, ever wrote. And her Fleet Foxes duet \"Don't Put It All on Me\" was written by her brother Braison.\n\n She explained that the song's lyric \"The words that were spoken / Mean nothing to me\" strikes a particular chord when it comes to her family dynamic.\n\n \"I think that really sums up a relationship with a sibling,\" Noah said. \"There's so many times, especially in my relationship with my siblings growing up, you fight and you say things — but that's your family, and they're always going to be there for you, and I'm lucky enough to say that that's been my case with me and my siblings and my family.\"","summary":"\"It's something that you really learn to keep separate and far away from yourself,\" the singer adds.","url":"https://ew.com/noah-cyrus-addresses-emotionally-draining-attention-on-family-tension-11795475","image":"https://ew.com/thmb/KF4Kv7HaeKD9goJpPjw2FQ5NKXw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/noah-cyrus-tish-cyrus-082125-bb2498d9bdfa4b27a5c9340eff612e5e.jpg","video":null,"publish_date":"2025-08-24 22:30:00","author":"Mekishana Pierre","authors":["Mekishana Pierre"],"language":"en","source_country":"US","sentiment":-0.088},{"id":353935098,"title":"France summons US Ambassador Kushner over ‘unacceptable’ letter about rising antisemitism","text":"WASHINGTON (AP) — France has summoned the American ambassador to Paris after the diplomat, Charles Kushner, wrote a letter to French President Emmanuel Macron alleging the country did not do enough to combat antisemitism.\n\nFrance’s foreign ministry issued a statement Sunday announcing it had summoned Kushner to appear Monday at the French Ministry for Europe and Foreign Affairs and that his allegations “are unacceptable.”\n\nThe White House did not immediately respond to a message seeking comment. State Department spokesperson Tommy Pigott on Sunday evening said it stood by Kushner’s comments, adding: “Ambassador Kushner is our U.S. government representative in France and is doing a great job advancing our national interests in that role.”\n\nThe summoning of the ambassador is a formal and public notice of displeasure. \n\nKushner, a real-estate developer, is the father of President Donald Trump’s son-in-law Jared Kushner.\n\nThe French foreign ministry, in its statement, said “France firmly rejects these allegations” from Kushner and that French authorities have “fully mobilized” to combat a rise in antisemitic acts since the Oct. 7, 2023 attack by Hamas on Israel, deeming the acts “intolerable.”\n\nThe contents of the letter were not released.\n\nKushner’s allegations violate international law and the obligation not to interfere with the internal affairs of another country, the French ministry said, and, “They also fall short of the quality of the transatlantic partnership between France and the United States and of the trust that must prevail between allies.”\n\nThe dustup follows Macron’s rejection this past week of accusations from Israel Prime Minister Benjamin Netanyahu that France’s intention to recognize a Palestinian state is fueling antisemitism.\n\nFrance is home to the largest Jewish population in Western Europe, with an estimated 500,000 Jews. That’s approximately 1% of the national population.\n\nThe diplomatic discord comes as French-U.S. relations have faced tensions this year amid Trump’s trade war and a split over the future of U.N. peacekeepers in Lebanon. France in particular has objected to the U.S. push to wind down the peacekeeping operation known as UNIFIL, with a vote on the issue set for the end of the month by the U.N. Security Council.\n\nFrance and the U.S. have also been divided on support for Ukraine in its war with Russia, but the split has eased with Trump expressing support for security guarantees and a warm meeting with Macron and other European leaders at the White House last week. \n\nTrump at the end of his first term as president pardoned Charles Kushner, who pleaded guilty years earlier to tax evasion and making illegal campaign donations. \n\nHis son Jared is a former White House senior adviser to Trump who is married to Trump’s eldest daughter, Ivanka. \n\nMichelle L. Price, The Associated Press","summary":"WASHINGTON (AP) — France has summoned the American ambassador to Paris after the diplomat, Charles Kushner, wrote a letter to French President Emmanuel Macron alleging the country did not do enough to combat antisemitism. France&#8217;s foreign ministry issued a statement Sunday announcing it had summoned Kushner to appear Monday at the French Ministry for Europe [&#8230;]","url":"https://toronto.citynews.ca/2025/08/24/france-summons-us-ambassador-kushner-over-unacceptable-letter-about-rising-antisemitism/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/08/007bd56530d3434c675cad8c49b5f7807c4c4b717c2a5bdb2bd470fefcc5ac4a.jpg","video":null,"publish_date":"2025-08-24 22:27:48","author":"Michelle L. Price,News Staff","authors":["Michelle L. Price","News Staff"],"language":"en","category":"politics","source_country":"ca","sentiment":0.245}]}