{"offset":0,"number":50,"available":12712,"news":[{"id":252114036,"title":"Inside the RNC: Funny Stories about Trump Impersonators, CNN Anchor, and Vivek’s Senate Plan – Get Ready for a Crazy 2024","text":"On night three of the RNC, a new MAGA star was born. Too bad for J.D. Vance, it wasn’t him. Being the dedicated correspondent that I am, I’ve been on the ground in Milwaukee since Tuesday to monitor all the GOP mayhem. From my perch (at a convention site bar on Wednesday evening), it seemed that the keynote speaker was the least buzzed-about orator of the day. As the bearded Beltway outsider took the stage, the audience’s eyes dropped to their iPhones to read breaking news about President Joe Biden testing positive for COVID. The delegates doom-scrolled and lol’d as Vance ranted about ‘cheap Chinese goods [made] with cheap foreign labor.’ (He better not check the labels on that ‘Trump 2024’ merch.) In fact, no one looked up until Vance started telling the story of his self-described ‘hillbilly’ grandma who raised him in Rust Belt Ohio while his mother was addicted to drugs. When ‘Mamaw’ died, Vance said, the family found 19 loaded handguns in her house, ‘under her bed, in her closet, in the silverware drawer.’ Then Vance recognized his mother Bev, who was sitting next to Speaker of the House Mike Johnson, and heavily-mascaraed eyes (Not mine! My heart’s too hard to ruin a good pair of falsies) welled with tears. ‘I’m proud to say that tonight, my mom is here, 10 years clean and sober. I love you, Mom,’ he said, prompting the convention crowd to erupt. Though neither Bev nor even Mamaw stole MAGA hearts last night. That prize went to 17-year-old Kai Trump, the former president’s eldest granddaughter, who demonstrated the poise of a woman twice her age. She told the crowd, ‘a lot of people have put my grandpa through hell, and he’s still standing.’ She’s chip off the old orange block. On the night that The Donald introduced his running mate to America – it was a Trump who grabbed all the headlines. What’s more Trumpian than that? Assassination Chic Donald’s brush with death has sparked a surprisingly hot new fashion trend among the GOP 50-something set. I met Joe Neglia, an Arizona delegate who taped a white envelope to his right ear. He did it in solidarity with 45, who’s been proudly parading around the hall with a big bandage over his badly disfigured right lobe. The only downside is that already hard-of-hearing delegates have rendered themselves deaf. Milwaukee’s Best? On the convention floor, I also met one handsy, love-struck Trump impressionist donning a blond wig and MAGA hat who seemed, well, inebriated. I feared he was going to pole vault into Fox News anchor Shannon Bream’s broadcasting booth for a smooch. Where’s the Secret Service when you need them? One-way ticket to Crazytown At a book signing for MAGA rodeo clown Rep. Marjorie Taylor Greene, I happened across two Texas convention-goers, who had been waiting hours to meet their idol. ‘It’s going to be MTG and Congresswoman Lauren Boebert on top of the GOP tickets in 2028, mark our words,’ swore Jan, as her friend Alice nodded in agreement. Ah heck, in our bat poop-crazy politics that might just make sense. Mean Girlz Peckish journalists and attention-starved lawmakers got a chance to hobnob in CNN’s unimaginatively named CNN Grill. But when I grabbed a chopped salad and a Coke Zero I got an unwanted serving of side-eye from snotty CNN chief political correspondent Dana Bash. At least the network’s chief of chiefs knows how to charm a fangirl. When Wolf Blitzer walked by, I screamed, ‘Blitzer – you sexy beast!’ Without batting a silver eyelash, he responded, ‘You’ve got that right.’ Muppets take Milwaukee Speaking of Silver Foxes – who was that handsome man with glowing rugged skin and luscious salt-and-pepper waves? The new Golden Bachelor? Sam Eagle from The Muppets? No, it was the captivatingly boring North Dakota Governor Doug Burgum fresh off losing the Veep-lympics. ‘Hey, Doug!’ I called, ‘I thought it was going to be you. You were at the top of my list.’ He gave me the reassuring look of a man who had just been told that his tumor was benign. ‘It’s ok, I have the greatest job in the world,’ said Burgum. ‘Ah, yes,’ I said. ‘You’re the Dakota Governor who didn’t shoot their dog!’ Unleash Elise! I strolled passed by New York Congresswoman Elise Stefanik as she was basking in her post-convention speech adulation. She won over conservatives in December when she dressed down serial plagiarist/antisemite apologist ex-Harvard President Claudine Gay. ‘I hope you do to the Secret Service Director what you did to Claudine Gay!’ I yelled. ‘Oh, don’t worry,’ she replied. ‘I have plenty of questions.’ Rudy can fail You could almost hear the Merlot sloshing when America’s Mayor did a slow-motion, a** over tea kettle stumble into a row of folding chairs on Wednesday afternoon. It took two burly staffers to get Rudy Giuliani back on his feet. Oh, how the mighty have fallen and can’t get up. ‘Shut up Gaetz’ Bad boy Florida Congressman Matty Gaetz marred the RNC’s unity-themed night on Tuesday when he bum-rushed former House Speaker Kevin McCarthy, who was in the middle of an interview. The two have had beef ever since McCarthy said Gaetz begged him to quash a House investigation into claims that Gaetz paid a teen for sex. Gaetz started screeching at McCarthy: ‘If you were on that [convention] stage you’d get booed off. You would get booed off the stage.’ One Illinois delegate spoke for all of us when he got into Gaetz’s face and said: ‘Shut up Gaetz… you’re an a**hole.’ Tight and Shiny I caught up with the fuming Floridian myself before his speech on Wednesday. His taut forehead gleamed like the underside of a stretched beaver pelt. ‘You speaking tonight?’ I asked. Gaetz: ‘Nah, tomorrow. I’ve had to rewrite my speech 87 times… I wanted to talk about the assassination attempt, but they don’t want anyone to touch it.’ ‘You know me,’ he said. ‘I’m going to tell it like it is, I’m a straight shooter.’ Gulp! Eat your Wheaties Outside the Fiserv Forum, where the magic is happening, you can find a glittering array of overpriced Chinese-made MAGA merch. A box of ‘Trump cereal’ will set you back $20. Same for the ‘I’m Voting For The Felon’ T-shirt. It’s all guaranteed to get you kicked out of your millennial niece’s baby-naming… or your money back! Vivek in the House! I ran into ex-motormouth GOP hopeful and Jimmy Neutron-impersonator Vivek Ramaswamy on the Fox News set of Gutfeld! Wednesday night. ‘Looks like there actually will be a Vivek in the White House!’ I said. (J.D. Vance and his wife Usha have a son named Vivek) For that, I got a chuckle and a scoop: Vivek might run for Vance’s Senate seat.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOn night three of the RNC, a new MAGA star was born.&#8230;\n\n\nThis Post: Inside the RNC: Funny Stories about Trump Impersonators, CNN Anchor, and Vivek&#8217;s Senate Plan &#8211; Get Ready for a Crazy 2024 first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/inside-the-rnc-funny-stories-about-trump-impersonators-cnn-anchor-and-viveks-senate-plan-get-ready-for-a-crazy-2024/","image":"https://i.dailymail.co.uk/1s/2024/07/18/23/87514713-13648909-image-a-1_1721341666360.jpg","video":null,"publish_date":"2024-07-19 00:32:24","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.132},{"id":252114034,"title":"Understanding the Secret Service’s Counter Sniper Team","text":"WASHINGTON – A U.S. Secret Service sniper killed the would-be assassin of former President Donald Trump in a split-second decision, taking out the man perched on an adjacent rooftop. Secret Service Director Kimberly Cheatle has publicly praised the sniper’s quick work on Saturday. But the Counter Sniper Team is now subject to a review by the Office of the Inspector General, which aims to determine how well the team is “prepared to respond to threats at events.” The Secret Service was already subject to a more general probe from the Inspector General as well as congressional subpoenas regarding the shooting at the Trump campaign rally, in what has become the most intense scrutiny the agency has faced since President Ronald Reagan was shot in 1981. Here’s what to know about the agency’s elite sniper group. Sniper team is ‘very elite and difficult to get into’ The Counter Sniper Team was established in 1971. It provides intelligence and observations of potential threats from far away in an effort to protect U.S. presidents, vice presidents, first ladies and others, according to a 2020 report by the Government Accountability Office on federal tactical teams. Those who join the team have already worked for the Secret Service for at least two years, according to the agency’s website. They must undergo 11 weeks of counter sniper selection and basic training, along with a color vision test. Counter snipers must have excellent eyesight and hearing. “It’s very sought after, it’s very elite and difficult to get into,” Pete Piraino, who spent 23 years with the Secret Service, including five years in the presidential protective division, told The Associated Press on Thursday. They typically work in pairs The counter snipers are on the look out for threats from far away, even beyond the established security perimeter, said Piraino, who is now vice provost for academics and a criminal justice professor at Tiffin University in Ohio. They often work outdoors, focusing on rooftops and the windows of surrounding buildings. They typically work in teams of two — one serves as a spotter while the other trains their rifle’s sight on the same area. “They’re trained to scan an area, remember what they see and come back to scan it again and see if there’s any change,” Piraino said. “It’s not just a matter of picking up their binoculars and looking around. They are trained very thoroughly and specifically with rangefinders and their equipment.” If they don’t qualify, they don’t work The counter snipers, code named “Hercules,” can respond to a threat from a distance with their .300 Winchester Magnum rifles, according to Ronald Kessler’s 2009 book, “In the President’s Secret Service.” And they have to prove they can do so on a monthly basis. “Counter-Snipers are required to qualify shooting out to a thousand yards each month,” Kessler wrote. “If they don’t qualify, they don’t travel or work.” The snipers shoot with a rifle called a JAR, said Paul Eckloff, a retired Secret Service agent who served on details protecting three different presidents during his 23-year career. “You’ve never heard of it because the Secret Service makes them,” Eckloff said. It stands for “just another rifle” and they’re built specifically for each counter sniper by the Secret Service’s armorer to take into account things like the length of the shooter’s arms, wrists and trigger finger. Eckloff wouldn’t disclose how many counter sniper teams there are but noted that it’s a finite resource and they could always use more. What happened? Police learned of a suspicious character outside the fairgrounds in Butler, Pennsylvania, before Trump took the stage. Minutes into his speech, shots were fired. A counter sniper shot and killed Thomas Matthew Crooks in the seconds after he opened fire from a rooftop some 150 yards (135 meters) from the stage. Secret Service agents threw themselves on top of the former president before hustling him off stage. Stephen Colo, who retired from the Secret Service in 2003 as an assistant director, told The AP on Sunday that presidential candidates and former presidents don’t typically get the same level of protection as the sitting president. Colo said he was surprised that the agency had staffed the event with a counter sniper team because there are not many of those highly trained operatives and they are usually reserved for the president. Kessler told the AP that the Counter Sniper Team should not be the focus of all of the scrutiny and investigations. He said the Secret Service members working closer to Trump should have called off the speech and moved him to safety as soon as they heard reports of a suspicious person in the crowd and then on a nearby rooftop. “They should have just evacuated as soon as there was any hint of danger,” Kessler said. Trump was not seriously injured and two days later he arrived in Milwaukee, with his right ear bandaged, to the adulation of his supporters at the Republican National Convention. The shooting had more serious ramifications for others at the rally. Former fire chief Corey Comperatore was shot and killed and two other people were wounded. Cheatle, the Secret Service director, told ABC News on Tuesday that the sniper who shot Crooks made a “split-second decision.” “They have the ability to make that decision on their own. If they see that it’s a threat and they did that in that instance,” she said. “And I applaud the fact that they made that decision and didn’t have to check with anybody and thankfully neutralized the threat.” ___ Finley reported from Norfolk, Virginia.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – A U.S. Secret Service sniper killed the would-be assassin of&#8230;\n\n\nThis Post: Understanding the Secret Service&#8217;s Counter Sniper Team first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/understanding-the-secret-services-counter-sniper-team/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-What-to-know-about-the-Secret-Service039s.jpg","video":null,"publish_date":"2024-07-19 00:28:57","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.022},{"id":252113874,"title":"Who Could Be Kamala Harris' Vice President? 5 Candidates","text":"As speculation about President Joe Biden's 2024 candidacy swirls, some believe Vice President Kamala Harris would become the Democratic nominee. But who could take her place? An expert told Newsweek his thoughts on the candidates.Biden has faced growing pressure in the aftermath of last month's debate to step aside and let another Democrat take his place. Top Democrats, like kingmaker and Representative Jim Clyburn, have already signaled that they'd back Harris if Biden leaves the race and polls show that most Democratic voters support Harris at the top of the ticket.An Economist/YouGov survey conducted this week found that 79 percent would support Harris as the Democratic nominee if Biden were to withdraw from the race. Harris would also benefit from the $91 million war chest that the Biden-Harris campaign has raised.While she may be the obvious choice to replace Biden, Harris would have to pick her own running mate if she were to become the nominee.\"Truthfully, they all have something to offer,\" Audrey Haynes, a politics professor at the University of Georgia, told Newsweek of the contenders. \"The Democratic Party has a strong bench and the choice will depend on who is at the top of the ticket. Who will balance the ticket, provide some electoral benefit (perhaps move a swing state) or perhaps expand a voter bloc that may have voters to expand vote margins in close races.\"\"At this juncture, a governor, who is popular, and has a strong economic record in their state, would be the most valuable foil for competing with the Trump Vance ticket,\" Haynes said. \"Neither of whom have the type of executive experience that governors earn over time.\"Pennsylvania Governor Josh ShapiroA rising Democratic star, Josh Shapiro is often floated as a possible running mate for Harris. He governs a major battleground state and could help Harris make inroads among voters in the Keystone State.Shapiro, who comfortably beat Trump-backed Doug Mastriano in 2022, is wildly popular in his home state and enjoys support from both Democrats and Republicans. The only governor with a divided state legislature, Shapiro was able to reach a bipartisan agreement just last week. He's also been applauded for his handling of major infrastructure crises, including the collapse of the I-95 bridge last year and the train derailment in Ohio, which borders Pennsylvania.Of all the potential VP contenders, Shapiro might be among the sharpest of the group because his presence could help Democrats secure Pennsylvania, Jeffrey Kraus, a politics professor at Wagner College, told Newsweek.\"Shapiro has never lost an election and is closer to the center of the Democratic Party,\" Kraus said.Michael Gordon, a Democratic strategist and principal at Group Gordon, also said Shapiro would have \"the biggest impact on the outcome\" of the 2024 election.\"He's a popular governor of a swing state with a lot of electoral votes. He's also a young rising star who could inspire voters in other swing states,\" Gordon told Newsweek.But with only two years under his belt, experts think that Shapiro would be wise to continue working for voters in Pennsylvania, especially if he has plans to run for the commander-in-chief position himself later down the line.\"It is hard for me to imagine that Josh Shapiro would want to be anyone's running mate,\" Berwood Yost, Director of the Floyd Institute for Public Policy and Center for Opinion Research at Franklin & Marshall College, told PoliticsPA.com. \"He would undoubtedly be a great choice given that he is a popular governor in one of the key states Democrats must carry in 2024, but what benefit would there be for him to take the position?\"North Carolina Governor Roy CooperRoy Cooper's governorship has been a sign of hope for Democrats in the Tar Heel state.While the party hasn't won a presidential election in the state since 2008, Cooper was elected in 2016 and 2020 despite former President Donald Trump's Electoral College victories in both elections. Cooper won in 2016 mostly in opposition to a bill banning transgender people from public restrooms of their gender. In 2020, he was reelected for his handling of the pandemic and natural disasters in the state.Kraus said Cooper might help attract North Carolina voters to the ticket, but because the governor doesn't have a national profile, he said, \"I don't know what else he might bring to the ticket besides putting North Carolina in play.\"\"Roy Cooper can fit the bill too as a popular governor of a swing state,\" Gordon said. \"He is a safe choice but may not be as inspiring nationally as Shapiro.\"Cooper is also close to Harris, having served as the attorney general in North Carolina at the same time Harris held the position in California. He's commended her for being able to relate to women voters and appeared alongside her at events in his home state, calling her a \"fighter.\"Harris herself has said of Cooper, \"I've known him for almost two decades, and he is an extraordinary leader.\"Earlier this month, the New York Times reported that Cooper was \"an emerging favorite\" for Harris.Michigan Governor Gretchen WhitmerGretchen Whitmer's name has long been floated as a possible presidential candidate and a Harris-Whitmer ticket would mark the first all-women ticket in history.\"Whether the Democrats would run a ticket with two female candidates is an open question,\" Kraus said.Whitmer's position in Michigan could help the Democratic Party win back voters who abandoned the party in response to Biden's response to the Israel-Hamas war.The state, which is home to more than 200,000 registered voters who are Muslim and 300,000 people who claim ancestry from the Middle East and North Africa, has spelled trouble for Biden in recent months. Despite winning Michigan by 154,000 votes in 2020, Biden is now trailing behind Trump by 1.6 percentage points, according to RealClearPolling averages.Michigan also has a decadeslong streak of voting for the winning presidential candidate. The state has not voted for a losing candidate since 2004.Whitmer, who easily won reelection in 2022 and brought a Democratic trifecta with her, has expressed her support for Harris. On Tuesday, she said that she would be \"eager\" to support Harris as the nominee if Biden were to exit the race.Kentucky Governor Andy BeshearAndy Beshear impressed many Democrats when he won a second term in the conservative state last year.\"Andy Beshear is a rising star, but Harris won't win Kentucky, even with him on the ticket,\" Gordon said.While Kentucky is not seen as a likely pickup in November and Beshear's departure to the White House would leave the state without any Democrats, he's one of the most popular and youngest governors in the country.A Morning Consult poll conducted last year found that Beshear is tied with Hawaii Governor Josh Green as the most popular Democratic governor among Trump voters. He is also the most popular Democratic governor among Biden voters. The survey showed that Beshear has the highest net approval rating of any Democratic governor in a red state, with overall approval at 60 percent.Beshear told reporters last week that he had concerns about Biden's candidacy but that he wasn't calling for the president to step aside.At the press conference, he signaled that he would be open to leaving his role for one that helps \"the Commonwealth even more\" but said that he wasn't planning to and that his current role is \"more than enough for me.\"California Governor Gavin NewsomNewsom has become one of the most nationally recognizable figures within the Democratic Party.He drew speculations about his White House ambitions last year when he debated Florida Governor Ron DeSantis, prompting some to ask what Newsom was doing facing off against a Republican presidential candidate when he wasn't in the 2024 race.Billed as a red state versus blue state debate, the two governors clashed over taxes, immigration, crime, guns, abortion and the pandemic in a 90-minute event moderated by Fox News. Newsom repeatedly defended Biden as DeSantis argued that the president's mental state was in decline.\"We have one thing in common, neither of us will be the nominee for our party in 2024,\" Newsom said during the debate.But Newsom as VP could cause problems for Harris since both of them are from California, similar to how observers questioned if Trump picking Senator Marco Rubio could present the same constitutional question since both Republicans were from Florida.\"The reality is that none of these governors really would make a difference to a Harris-led ticket,\" Kraus said. \"For that matter, Harris might not be the best candidate to lead the ticket, although it seems that will be the only scenario if Biden (and this is not a sure thing) withdraws.\"\"At best, the Democrats should focus on retaining the Senate and trying to retake the House. Unless something else happens, Trump seems likely to prevail,\" he said.","summary":"If Harris replaces Biden as the Democratic nominee, who will she choose to serve as her running mate?","url":"https://www.newsweek.com/who-could-kamala-harris-vice-president-candidates-1927297","image":"https://d.newsweek.com/en/full/2431994/kamala-harris-vp-pick.jpg","video":null,"publish_date":"2024-07-19 00:24:54","author":"Katherine Fung","authors":["Katherine Fung"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.157},{"id":252113684,"title":"Conservative commentator Lou Dobbs, known for hosting shows on Fox Business and CNN, passes away at the age of 78","text":"NEW YORK – Lou Dobbs, the conservative political pundit and veteran cable TV host who was a founding anchor for CNN and later was a nightly presence on Fox Business Network for more than a decade, has died. He was 78. His death was announced Thursday in a post on his official X account, which called him a “fighter till the very end – fighting for what mattered to him the most, God, his family and the country.” No cause of death was given. “Lou’s legacy will forever live on as a patriot and a great American. We ask for your prayers for Lou’s wonderful wife Debi, children and grandchildren,” the post said. He hosted “Lou Dobbs Tonight” on Fox Business from 2011 to 2021, following two separate stints at CNN. Fox News Media said in a statement that the network was saddened by Dobbs’ passing. “An incredible business mind with a gift for broadcasting, Lou helped pioneer cable news into a successful and influential industry,” the statement said. “We are immensely grateful for his many contributions and send our heartfelt condolences to his family.” Dobbs was an early and vocal supporter of Donald Trump during his candidacy for the White House and throughout his presidency. After his death was announced Thursday, Trump wrote on his media platform Truth Social that Dobbs was a friend and a “truly incredible Journalist, Reporter, and Talent.” “He understood the World, and what was ‘happening,’ better than others. Lou was unique in so many ways, and loved our Country. Our warmest condolences to his wonderful wife, Debi, and family. He will be greatly missed!” Trump wrote on the platform. Dobbs was named in a lawsuit against Fox News by Dominion Voting systems over lies told on the network about the 2020 presidential election. A mediator in 2023 pushed the two sides toward a $787 million settlement, averting a trial. A mountain of evidence — some damning, some merely embarrassing — showed many Fox executives and on-air talent didn’t believe allegations aired mostly on shows hosted by Dobbs, Maria Bartiromo and Jeanine Pirro. At the time, they feared angering Trump fans in the audience with the truth. Dobbs spent more than two decades at CNN, joining at its launch in 1980 and hosting the program “Moneyline.” He left CNN in 2009 to help media mogul Rupert Murdoch launch Fox Business. “Lou was one of the CNN originals, who helped launch and shape the network. We are saddened to hear about his passing and extend our sincerest condolences to his wife Debi, children and his family,” CNN said in a statement. When he joined Fox, he said he considered himself the underdog. A few years later his show was highly rated and he was a key figure on the right-leaning network. “We’ll focus on the American people, their standard of living … the American nation,” he said about his show in 2011. “Those are always my starting points.” Dobbs’ Fox show was titled “Lou Dobbs Tonight,” the same as the one he left in 2009 after an awkward last few years at CNN. Once the most visible television business journalist with his “Moneyline” show in the 1990s, Dobbs made CNN management uneasy as he grew more opinionated and drew angry protests from Latinos for his emphasis on curbing illegal immigration. Dobbs dove into the complex public policy and economic issues that drive society. Dobbs said he always wanted to be straight with his viewers about his own views on issues. “My audience has always expected me to tell them where I’m coming from, and I don’t see any reason to disappoint them,” he said in 2011.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – Lou Dobbs, the conservative political pundit and veteran cable&#8230;\n\n\nThis Post: Conservative commentator Lou Dobbs, known for hosting shows on Fox Business and CNN, passes away at the age of 78 first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/conservative-commentator-lou-dobbs-known-for-hosting-shows-on-fox-business-and-cnn-passes-away-at-the-age-of-78/","image":"https://www.clickorlando.com/resizer/mprCjCCibfKw4a8wPmvTifXamus=/cloudfront-us-east-1.images.arcpublishing.com/gmg/TTXVPA6FMVC5DNXB7TIZCKHHNU.jpg","video":null,"publish_date":"2024-07-19 00:20:45","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.045},{"id":252113690,"title":"Mass. delegates divided over whether Biden should stay in the race, new survey shows","text":"Amid unprecedented questions in the Democratic party, Massachusetts delegates to the Democratic National Convention (DNC) are divided on whether President Joe Biden should be their nominee. A new survey of Massachusetts delegates found that 62 percent of the delegates think Biden should stay in the race. Fifteen percent said they think he should drop out, another 15 percent were unsure, and nine percent didn’t want to say. The survey, conducted by The MassINC Polling Group for CommonWealth Beacon, polled respondents about their thoughts on other potential candidates if Biden were to drop out. Sixty-seven percent of respondents said they would support Vice President Kamala Harris if she were to become the nominee. CommonWealth Beacon notes the survey results are not “representative of the delegation, but they are illustrative of what’s on their minds.” Why does this matter? The Democratic party is at a massive crossroads less than a month before their national convention in Chicago. An ABC News poll revealed that 86 percent of Americans think Biden, the presumptive nominee, is too old to serve another four years as president. After a shaky performance at a debate last month and other less-than-spectacular public engagements (including referring to Harris as “Vice President Trump” in a recent press conference), Biden has seen more than two dozen high ranking Democratic officials calling on him to step out of the race. This poll serves as a microcosm for what Massachusetts delegates specifically are thinking. It shows the stark divides within the Democratic party, even in a state as blue as Massachusetts. Governor Maura Healey said earlier this month that Biden should “listen to the American people and carefully evaluate whether he remains our best hope to defeat Donald Trump.” Three members of the Massachusetts Congressional delegation have come out with statements either concerned with Biden’s ability to win, or flat-out calling for him to step off the ticket. What is a convention delegate? What is a delegate, anyway? Delegates are people chosen by their political parties. They carry the support and votes from their home state to the national convention. While they are usually very politically active within their party, they are tied to the candidate that won their state’s primary. How many are sent to the convention varies from state to state. Massachusetts will send 116 delegates and a few alternates to the convention. Notable delegates include Mayor Michelle Wu, Attorney General Andrea Campbell, and Lieutenant Governor Kim Driscoll. Congressional Representative Jake Auchincloss is also a delegate. When asked his thoughts on Biden stepping down, he said “We have strong people, not just the top of the ticket, but around the ticket, who can be strong surrogates.”","summary":"A survey of Massachusetts delegates found that only 62 percent of the delegates think Biden should stay in the race.\n\n\nThe post Mass. delegates divided over whether Biden should stay in the race, new survey shows appeared first on Boston.com.","url":"https://www.boston.com/news/politics/2024/07/18/mass-delegates-divided-over-whether-biden-should-stay-in-the-race-new-survey-shows/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2024/07/6FEYTRTDGAC36IT4FWNCYEDKNU-6699a793ac5b9-768x432.jpg","video":null,"publish_date":"2024-07-19 00:17:13","author":"Eva Levin,The Massinc Polling","authors":["Eva Levin","The Massinc Polling"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.14},{"id":252113740,"title":"Donald Trump RNC speech LIVE — Former president to speak publicly for 1st time since assassination attempt & nomination","text":"FORMER President Donald Trump is set to speak at the Republican National Convention for the first time tonight since the assassination attempt on his life Saturday. Thomas Matthew Crooks, 20, was able to climb a roof at a campaign rally in Butler, Pennsylvania, on Saturday that had a clear view of former President Trump. Crooks fired eight rounds bloodying the former president's ear as he was escorted away by Secret Service agents. Trump has arrived and is expected to take the RNC stage tonight at 9:09 pm CT. Other guests anticipated to speak tonight include Tucker Carlson, Hulk Hogan, Dana White, Alina Habba, and more. Meanwhile, the Democratic Party is in disarray after it has been revealed President Biden has tested positive for Covid-19. Former President Barack Obama believes Biden's \"path to victory has greatly diminished and he thinks the president needs to seriously consider the viability of his candidacy,\" according to the Washington Post. Follow our Donald Trump RNC speech for news and updates...","summary":"","url":"https://www.thescottishsun.co.uk/news/13183889/donald-trump-rnc-speech-live-updates/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2024/07/me-op-rnc-trump-mike.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-19 00:11:00","author":"Matthew Aquino","authors":["Matthew Aquino"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.343},{"id":252113872,"title":"Donald Trump RNC speech LIVE — Former president to speak publicly for 1st time since assassination attempt & nomination","text":"FORMER President Donald Trump is set to speak at the Republican National Convention for the first time tonight since the assassination attempt on his life Saturday. Thomas Matthew Crooks, 20, was able to climb a roof at a campaign rally in Butler, Pennsylvania, on Saturday that had a clear view of former President Trump. Crooks fired eight rounds bloodying the former president's ear as he was escorted away by Secret Service agents. Trump has arrived and is expected to take the RNC stage tonight at 9:09 pm CT. Other guests anticipated to speak tonight include Tucker Carlson, Hulk Hogan, Dana White, Alina Habba, and more. Meanwhile, the Democratic Party is in disarray after it has been revealed President Biden has tested positive for Covid-19. Former President Barack Obama believes Biden's \"path to victory has greatly diminished and he thinks the president needs to seriously consider the viability of his candidacy,\" according to the Washington Post. Follow our Donald Trump RNC speech for news and updates...","summary":"","url":"https://www.thesun.co.uk/news/29329702/donald-trump-rnc-speech-live-updates/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/07/me-op-rnc-trump-mike.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-19 00:11:00","author":"Matthew Aquino","authors":["Matthew Aquino"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.343},{"id":252113564,"title":"Speaker Mike Johnson admits he won’t be happy to allow Democratic states to keep abortion rights","text":"House Speaker Mike Johnson has rejected the notion that the Republican platform on abortion means that the party is happy for Democratic states to give wide access to abortion. “I don't think that's what it means at all,” he said, when accessed about abortion access in blue states by Politico on Thursday. “I think it's a recognition of the reality of the politics of the country.” Johnson continued: “No one who believes in the sanctity of life or calls himself a pro-lifer is comfortable with where some of these blue states are going – almost unlimited abortion access all the way to the end ... to the moment of birth.” The Republican National Committee platform is not explicitly endorsing a federal ban on abortion, instead leaving the decision to the states. The platform invokes the 14th Amendment to suggest that fetuses are guaranteed rights and supports a ban on “late-term” abortion - which is not a medical term. An RNC committee adopted a draft platform that states: “Republicans will protect and defend a vote of the people, from within the states, on the issue of life.” A landmark Supreme Court decision in June 2022 overturned Roe v Wade, which enshrined a constitutional right to abortion care. The decision effectively left the legality of abortions up to individual states. “We proudly stand for families and Life,” the RNC platform states. “We believe that the 14th Amendment to the Constitution of the United States guarantees that no person can be denied Life or Liberty without Due Process, and that the States are, therefore, free to pass Laws protecting those Rights.” That stance, leaving the decision to the states, brings the platform in line with GOP nominee Donald Trump’s stance on abortion. Trump has often bragged about appointing the Supreme Court justices who overturned Roe but also shared his concerns about the implications that strict abortion bans, and attacks on fertility treatments like IVF, may have on the election results in November. Convention delegates expressed their support for the platform and leaving the decision to the states earlier this week.","summary":"Speaker says Republican platform is a ‘recognition of the reality of the politics of the country’","url":"https://www.independent.co.uk/news/world/americas/us-politics/mike-johnson-abortion-democratic-states-roe-v-wade-b2582337.html","image":"https://static.independent.co.uk/2024/07/18/23/SEI213255719.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/zDOWUmyN-4VHSaSK0.mp4","publish_date":"2024-07-19 00:10:45","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.051},{"id":252113490,"title":"Elon Musk’s X Introduces Trump-Themed Hashtags After He Endorses Former President","text":"Share to Facebook Share to Twitter Share to Linkedin Topline Elon Musk’s X, formerly known as Twitter, now has two hashtags themed after former President Donald Trump on its platform—a change that follows the billionaire’s endorsement of the former president after he survived an assassination attempt at a rally Saturday. The branded hashtags appeared Thursday. (Photo by Emin Sansar/Anadolu Agency via Getty Images) Anadolu Agency via Getty Images Key Facts #MAGA and #Trump2024 now appear with small images of Trump with his fist in the air and an American flag, respectively, as #MAGA has become the No. 1 trending hashtag on X as of Thursday evening. Searching #Trump2024 on X now also includes a flurry of American flags that rain down from the top of the search page. The branded hashtags come a few days after Musk, the world’s wealthiest person, endorsed Trump, as well as hours before Trump is scheduled to speak and accept the Republican nomination at the Republican National Convention. #Biden2024 does not appear to have the same branded features as the Trump hashtags. The hashtag variants, which X calls “hashmojis,” have historically been used by advertisers or partners to promote events, products and brands and have been on the platform for years, usually lasting for about 24 hours once they’re enabled. X did not immediately answer Forbes’ inquiry asking whether the Trump-themed hashtags were purchased by his campaign, a Trump-affiliated organization or if they were added internally. It is unclear how much the branded hashtags cost, as prices for using the feature on X are not listed on X’s branded features page. A representative for Trump did not immediately respond to Forbes’ request for comment. Get Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here. Forbes Valuation We estimate Musk’s net worth at $250.3 billion, making the Tesla chief the world’s wealthiest person, ahead of Amazon founder Jeff Bezos ($201.3 billion), and LVMH chief Bernard Arnault ($191.4 billion). Key Background Musk said, “I fully endorse President Trump,” following the attempted assassination of the former president Saturday. The endorsement from the billionaire was not a complete shocker, as Musk has become increasingly politically vocal in the lead-up to the presidential election, aligning with right-wing stances on matters such as immigration, free speech and vaccines. Musk tweeted earlier this year he was “leaning away” from President Joe Biden and did not explicitly support Trump at the time. The Tesla chief reportedly donated to a pro-Trump super PAC known as America PAC prior to the attempted assassination of Trump and will reportedly supply the organization with around $45 million a month. Further Reading Elon Musk Reportedly Donates To Pro-Trump Group—In Billionaire’s Starkest Political Move Yet (Forbes) Elon Musk Will Give About $45 Million A Month To Support Trump, Report Says (Forbes) Follow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IV Following Editorial Standards Print Reprints & Permissions","summary":"Musk has increasingly aligned himself with conservative standpoints in the last year.","url":"https://www.forbes.com/sites/antoniopequenoiv/2024/07/18/elon-musks-x-introduces-trump-themed-hashtags-after-he-endorses-former-president/","image":"https://imageio.forbes.com/specials-images/imageserve/651df64e5c5352c0fc9fea54/0x0.jpg?format=jpg&crop=2897,1929,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-19 00:09:58","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.253},{"id":252113698,"title":"Trump will not mention Biden by name in RNC speech, campaign's senior adviser says","text":"Trump will not mention Biden by name in RNC speech, campaign's senior adviser says Former President Donald Trump will not mention President Biden by name during his speech at the Republican National Convention on Thursday, Trump campaign senior adviser Danielle Alvarez tells Major Garrett on \"America Decides.\" Alvarez has more on Trump's upcoming speech and his 2024 campaign.","summary":"Former President Donald Trump will not mention President Biden by name during his speech at the Republican National Convention on Thursday, Trump campaign senior adviser Danielle Alvarez tells Major Garrett on \"America Decides.\" Alvarez has more on Trump's upcoming speech and his 2024 campaign.","url":"https://www.cbsnews.com/video/trump-will-not-mention-biden-by-name-in-rnc-speech-campaigns-senior-adviser-says/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/19/8cd66467-3398-4969-afb1-6be8e5816508/thumbnail/1200x630/ec9f2b6bb9cb21ccc359e41ee4d97b9f/cbsn-fusion-trump-will-not-mention-biden-by-name-in-rnc-speech-campaigns-senior-adviser-says-thumbnail.jpg?v=5710","video":null,"publish_date":"2024-07-19 00:07:00","author":null,"language":"en","source_country":"US","sentiment":0.032},{"id":252113896,"title":"Democratic mood darkens as Biden faces new pressure","text":"Mr Obama was reported by the Washington Post to have privately stated Mr Biden's chances were greatly diminished. Spokespeople for the former president have declined to comment. The polls and report on Mr Obama came after US media reported that former house speaker Nancy Pelosi and the two most senior Democrats in Congress, Hakeem Jeffries and Chuck Schumer, had advised Mr Biden to consider his candidacy for the good of the party. All have rejected the reports. The senior Democrat source told BBC News that the mood in Washington was grim: \"We are all waiting for the inevitable decision.\" Adam Smith, a Democratic congressman for Washington state, painted a similarly grim picture. Asked by BBC Radio 4's The World Tonight whether the party was \"coming to the end\" of Mr Biden's candidacy, he said: \"That is my sense\". \"I mean, I don’t know. But without question, I think that is the direction that this is heading right now.\" Mr Biden has faced a torrid few weeks since his poor showing in the first presidential debate late last month. He is currently in isolation in Delaware while he recovers from a Covid infection. By contrast, Donald Trump will give the headline speech at the Republican national convention in Milwaukee on Thursday evening, his first speech since surviving an assassination attempt. Delegates and supporters here have been in high spirits all week. Mr Biden has so far struck a defiant tone in response to Democratic pressure for him to step aside as the party's candidate. He continues to enjoy the public support of many politicians, including members of the powerful Congressional black caucus. But there are signs the Democratic leadership has begun to apply more pressure. Mr Schumer, the Senate Majority Leader and Mr Jeffries, the ranking Democrat in the House of Representatives, are reported to have told Mr Biden last week that their colleagues in Congress were \"concerned\" that his troubles would hit their own chances of re-election. Mr Schumer said the reports were \"idle speculation\", while Mr Jeffries said his was \"a private conversation that will remain private\". CNN meanwhile reported that Mrs Pelosi had told Mr Biden that polls show he cannot win. She later slammed the reporting as a \"feeding frenzy\", but did not deny that a conversation with Mr Biden had taken place. On Thursday, the Post reported that Mr Obama told several allies that Mr Biden, his former vice-president, must seriously consider if his candidacy remains viable. Jamie Raskin, a congressman from Maryland, wrote to Mr Biden, comparing him to a baseball pitcher at the end of his career - saying there was \"no shame\" in retiring \"to the overflowing appreciation of the crowd when your arm is tired out\". TJ Ducklo, a Biden campaign senior adviser, slammed reports of grandee concern as \"baseless conjecture from anonymous sources\". \"Joe Biden is his party's nominee,\" he wrote on X. \"He's running for re-election.\" Deputy campaign manager Quentin Fulks said Mr Biden was \"not wavering on anything. The president has made his decision. I don't want to be rude, but I don’t know how many more times we can answer that.\" Mr Biden has mild upper respiratory symptoms associated with Covid but does not have a fever, presidential doctor Kevin O'Connor said on Thursday, The White House said he was expected to meet Israeli Prime Minister Benjamin Netanyahu after he arrives in the US on Wednesday.","summary":"A new poll shows Trump with his biggest lead of the campaign, as high-level Democrats are reportedly expressing fresh concern.","url":"https://www.bbc.com/news/articles/c51y2v4vv7ko","image":"https://ichef.bbci.co.uk/news/1024/branded_news/6198/live/57a605e0-453b-11ef-8102-c9e8652d6cfd.jpg","video":null,"publish_date":"2024-07-19 00:04:52","author":"Sam Cabral And Sarah Smith","authors":["Sam Cabral And Sarah Smith"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.227},{"id":252113290,"title":"Biden campaign co-chair says president still seeking ‘input,’ despite claim he’s committed to 2024 campaign","text":"Despite President Biden’s public insistence that he’s “firmly committed” to sticking out the 2024 race, his campaign national co-chair says the 81-year-old is still seeking “input” from colleagues. Sen. Chris Coons (D-Del.), a longtime Biden ally who serves from the president’s home state, repeatedly refused on Thursday to unequivocally state that the president won’t call it quits. “In my conversations with the president, he’s been asking for input,” Coons told CNN. “He’s been asking from all of us who talk to him regularly for advice, for counsel, for input on the polls, on the opinion of our colleagues, but he has communicated to every Democrat in writing that he intends to continue this campaign,” he added. Last week, Biden penned a letter to congressional Democrats declaring that he is “firmly committed to staying in this race, to running this race to the end, and to beating Donald Trump.” Biden further proclaimed “clearly and unequivocally: I wouldn’t be running again if I did not absolutely believe I was the best person to beat Donald Trump in 2024.” Despite that assertion, a growing chorus of prominent Democrats has been nudging him both publicly and privately to drop out after being rattled by the shock of his debate performance last month in which he appeared to struggle to hold his train of thought. At least 21 congressional Democrats have come forward so far and publicly called on him to step aside. Coons, 60, was coy about whether Biden is still giving serious thought as to whether he will remain in the race. “I think he weighs very seriously the input of those trusted advisers, those who served with him. And beyond that, I’m not going to get into the detail,” Coons said. “I think he deserves the respect to being able to reflect on this moment.” The Delaware senator was pressed at least three times about whether Biden is still mulling the possibility of exiting the race and said he shouldn’t comment “without direct knowledge.” Coons admitted that he hadn’t spoken with Biden in a few days. He also argued that the president is the most formidable Democrat to take on Trump. “What you’re hearing from many Democrats is concerns that Donald Trump does not belong back in the White House,” he said. “That unifies all Democrats, not just Democrats, but Donald Trump’s own vice president, secretary of defense, chief of staff, national security adviser, all the core folks who served right around Donald Trump, think he should never be reelected,” he went on. Earlier in the day, Biden-Harris principal deputy campaign manager, Quentin Fulks, was emphatic to reporters that the president doesn’t plan to drop out. “The president has said it several times: he’s staying in this race,” he said. “I talk to the president every single day in some form … He is usually fact-checking me on a statistic that I got wrong.” On Wednesday, an ABC News report emerged that Senate Majority Leader Chuck Schumer (D-NY) privately and forcefully encouraged Biden to step aside over the weekend. A spokesperson for Schumer did not explicitly deny that report, but rather, called it “idle speculation.” In addition, former House Speaker Nancy Pelosi (D-Calif.) and House Minority Leader Hakeem Jeffries (D-NY) have privately shared with Biden their doubts about his ability to win, according to additional reports. For the most part, their spokespeople have not explicitly denied those reports, but haven’t confirmed them either. Ironically, Biden has gotten a bit of a boost from the left flank of his party amid the mutiny. “I can’t tell you all how shameful it feels to hear all these leaks about what Democratic leaders are saying and not to have a single one of them out here confirming or denying it,” Rep. Ilhan Omar (D-Minn.) posted on X. “It’s a lack of leadership and it’s making all Democrats look bad. Whatever this mess leads to will not undo the damage that has already been inflicted. May God help us all,” she added.","summary":"Despite President Biden's public insistence that he's \"firmly committed\" to sticking out the 2024 race, his campaign co-chair says the 81-year-old is still seeking \"input.\"","url":"https://nypost.com/2024/07/18/us-news/biden-campaign-co-chair-says-prez-still-seeking-input-despite-claim-hes-committed-to-2024/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/85667733.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/MESACJLu-RyIcpnTz.mp4","publish_date":"2024-07-19 00:03:57","author":"Ryan King","authors":["Ryan King"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.216},{"id":252113054,"title":"Many people come together at a banquet hall to honor the memory of a former fire chief who tragically passed away at a Trump rally.","text":"FREEPORT, Pa. (AP) — Thousands of mourners filed into a Pennsylvania banquet hall Thursday to remember the former fire chief who was fatally shot during the attempted assassination of former President Donald Trump, who sent a note of condolence hailing him as a hero. The crowd paying their respects to Corey Comperatore and his family appeared to be a mix of friends, neighbors and strangers who wanted to show their appreciation for the man who officials said spent his final moments shielding his wife and daughter from gunfire at the campaign rally. Fire trucks and police vehicles filled the parking lot outside the building. Sharpshooters were positioned on top of the event hall and on nearby buildings as dozens of people waited in line to enter. Among the mourners were firefighters in dress uniforms. Comperatore, 50, worked as a project and tooling engineer, was an Army reservist and spent many years as a volunteer firefighter after serving as chief, according to his obituary. Trump suffered an ear injury but was not seriously hurt and has been participating this week in the Republican National Convention in Milwaukee. Mourners filled Laube Hall, a space with white brick walls, white linens, white curtains and exposed wooden beams that’s normally used for weddings and other celebratory occasions. Guests walked past a large framed photo of Comperatore holding a fish, while a slideshow of photos from his life was projected on a screen — his wedding, a recent 50th birthday party, time with his daughters, firefighting, fishing on a lake and palling around with his beloved Dobermans. The gathering included firefighters from other nearby communities and people involved in local and state Republican politics. Rich Tallis, a Penn Hills volunteer firefighter who attended the visitation, did not know Comperatore personally but felt a need to honor his memory. “Any first responder, it’s a brotherhood – police, EMS fire, military. We’re technically all one,” he said. “When one goes, we all go.” Tables inside the hall were lined with flowers — some sent by fire departments in New York and West Virginia, an auto racing circuit and the mayor of a nearby community. Others came from people in faraway places such as Connecticut and Florida who knew of Comperatore only because of his death. The messages on the cards accompanying the arrangements praised his selflessness and dedication to his family. One said his name would be “written in the history books.” Several hundred people were inside the space at any given time, and the overall attendance was sure to climb into the thousands. Mourners took turns pausing in front of Comperatore’s open casket, which was adorned with flower arrangements and ribbons with words such as “dad” and “husband.” In a corner was a framed copy of a note to Comperatore’s wife signed by Trump and former first lady Melania Trump. “Corey will forever be remembered as a True American Hero,” they wrote. Retired New York City Fire Department Lt. Joe Torrillo said outside the visitation that he came because Comperatore was a firefighter who lost his life the same way he lived his life — like a real, true hero. “And, you know, a lot of people maybe wouldn’t or couldn’t have done what he did,” Torrillo said. A box truck parked on a route to the banquet hall displayed video screens showing slides, including a photograph of Trump raising his fist after Saturday’s shooting. It had the slogan “never surrender” and a message expressing prayers for Trump and Comperatore. The visitation, which was broken into a pair of two-hour blocks, was the second of two public events memorializing and celebrating Comperatore’s life. Hundreds of people gathered Wednesday at a vigil for him at an auto racing track. A private funeral is scheduled for Friday. A statement issued Thursday by Comperatore’s family described him as a “beloved father and husband, and a friend to so many throughout the Butler region.” “Our family is finding comfort and peace through the heartfelt messages of encouragement from people around the world, through the support of our church and community, and most of all through the strength of God,” the statement said. Dan Ritter, who gave a eulogy at Wednesday’s vigil, said he bought Comperatore’s childhood home in 1993, sparking a friendship that grew with their shared values of family, Christian faith and politics. “Corey loved his family and was always spending time with them,” Ritter said. “This past Saturday was supposed to be one of those days for him. He did what a good father would do. He protected those he loved. He’s a true hero for us all.” Comperatore’s pastor, Jonathan Fehl of Cabot Methodist Church in Cabot, said the family “has been humbled by the way this community has rallied around them” and by the support they have received from people around the world. The vigil concluded with people in the crowd lighting candles and raising cellphones, glow sticks and lighters as Comperatore’s favorite song — “I Can Only Imagine,” by Christian rock band MercyMe — played while pictures of him and his family were shown on a screen. Two other people were wounded at the rally: David Dutch, 57, of New Kensington, and James Copenhaver, 74, of Moon Township. As of Wednesday night, both had been upgraded to serious but stable condition, according to a spokesperson with Allegheny Health Network. Joseph Feldman, an attorney for Copenhaver, said Wednesday that he had spoken with his client by phone. “He seems to be in good spirits, but he also understands the gravity of the situation,” Feldman said. “And he’s deeply saddened about what has occurred, and he’s deeply sympathetic” to the other victims and their families. Feldman said Copenhaver suffered “life-altering injuries,” declining to go into detail. He said Copenhaver’s priority is to “keep up with the medical treatment he’s receiving and hopefully be released at some point.” In a statement, Dutch’s family thanked the “greater western Pennsylvania community and countless others across the country and world” for the incredible outpouring of prayers and well wishes. ___ Associated Press reporters Heather Hollingsworth in Mission, Kansas; Lisa Baumann in Bellingham, Washington; and Michael Rubinkam in northeastern Pennsylvania contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFREEPORT, Pa. (AP) — Thousands of mourners filed into a Pennsylvania banquet&#8230;\n\n\nThis Post: Many people come together at a banquet hall to honor the memory of a former fire chief who tragically passed away at a Trump rally. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/many-people-come-together-at-a-banquet-hall-to-honor-the-memory-of-a-former-fire-chief-who-tragically-passed-away-at-a-trump-rally/","image":"https://www.cbs42.com/wp-content/uploads/sites/81/2024/07/6699ab4b36c748.62308112.jpeg?w=900","video":null,"publish_date":"2024-07-18 23:58:12","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.436},{"id":252112984,"title":"Trump taps Vance for White House bid: Letters to the Editor — July 19, 2024","text":"The Issue: Former President Donald Trump chooses Sen. JD Vance to complete the Republican ticket. Former President Donald Trump has chosen Ohio’s Sen. JD Vance as his running mate, suggesting that it is time for the millennials to step into the limelight in American politics (“Trump says it’s Vance for VP,” July 16). Washington politics seems to be largely dominated by older Americans, primarily Baby Boomers and also those in the Silent Generation. That must change, and young leaders must ascend to various positions of power. Trump, by picking Vance for vice president, has shown that he understands the importance of bright minds and fresh ideas. I applaud Trump’s decision. It is time for the people to accept the arrival of the next generation in national politics. Tawsif Anam Madison, Wisc. New York Post columnist Henry Olsen heaps praise on Vance without mentioning a single substantive policy position he holds. We’re told only that Vance cares about ordinary Americans and that he’s “unburdened by the GOP’s past free-market fundamentalism.” One unfortunate result of this “unburdening” is that Vance shares Trump’s enthusiasm for tariffs. Yet tariffs are pro-worker only superficially and destroy as many American jobs as they create. They do so directly by reducing foreigners’ demand for American exports. They destroy jobs indirectly because, with most US imports being intermediate goods used to produce outputs in America, the costs of production incurred by many American businesses rise. At the end of all this are higher prices for consumer goods — meaning reduced purchasing power for the vast majority of American families. Donald J. Boudreaux Fairfax, Va. I love the JD Vance pick for VP candidate. This is the political moment to go full MAGA, real MAGA: America first, strong deterrence abroad, less power in Washington and more in the states. It’s time to put the GOP where it belongs: in the hands of the people. As for the concerns that Vance is “too Trumpy” and having two political pugilists on the ticket is counterproductive, I see a different tack. With Vance as the VP, former President Donald Trump can now be “less Trumpy” and more of the unifying, cool and collected Trump we’ve seen this cycle. The pick works great and cements the MAGA GOP beyond 2028, much to the chagrin of the country-club conservatives who’ve ruled Washington for my entire lifetime. Nick McNulty Windham, NH Trump’s selection of Vance is mystifying. He is apparently supportive of Federal Trade Commission head Lina Khan remaining in place to continue destroying American businesses. The former president had many wonderful possibilities, yet he picked this young firebrand who seemingly misunderstands economics and the point of capitalism. Rick Meyer Pinehurst, NC I would like to praise Donald Trump for selecting JD Vance as his running mate. There are those who disagree, because at one point Vance opposed Trump. But as he got to know Trump and Trump got to know Vance, the pair eventually realized they were on the same page in support for the American people. Frederick R. Bedell Jr. Bellerose Vance is the perfect choice for Trump. Like many who have become Trump sycophants and sellouts, Vance initially saw the light about who Trump is, even comparing him to Hitler. He then learned that if he wanted to pursue power, he would have to fall in line with the rest of the GOP and express his devotion to its leader. Consequently, Vance has joined Trump in lying about the result of the 2020 presidential election. The two aggrieved men of privilege are two peas in a pod. Oren Spiegler Peters Township, Pa. Great pick for VP by Trump. This ticket has all the smarts to “Make America Great Again,” as advertised. Warren Goldfein Mount Arlington, NJ Want to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss former President Donald Trump choosing Sen. JD Vance to complete the Republican ticket.","url":"https://nypost.com/2024/07/18/opinion/trump-picks-jd-vance-for-vice-presidential-nominee-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/USATSI_23768455-e1721332587734.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-18 23:52:53","author":"Post Readers","authors":["Post Readers"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.705},{"id":252113312,"title":"Corey Comperatore’s fire gear to be placed on stage with Trump during RNC speech","text":"Firefighter Corey Comperatore’s gear will be placed on the stage during former President Donald Trump’s speech at the Republican National Convention. Sources told Fox News that Comperatore’s fire helmet and jacket are being shipped to Milwaukee by his family and will be placed on the stage of the convention just before Trump’s remarks. Comperatore, a 50-year-old Server, Pennsylvania resident and volunteer firefighter, was killed while shielding his family from the gunfire last week when a would-be assassin opened fire on Trump during a rally in Butler. Trump and two others, 74-year-old James Copenhaver and 57-year-old David Dutch, were also injured in the shooting. TRUMP SHOOTING FUNDRAISER FOR COREY COMPERATORE RAISES MORE THAN $1M FOR SLAIN FIREFIGHTER'S FAMILY Comperatore’s wife, Helen Comperatore, told the New York Post that the couple were close to celebrating their 29th wedding anniversary when they went to the event last week. \"He’s my hero,\" Helen Comperatore said, going on to describe her husband’s last words as gun fire erupted at the event. \"He just said, ‘get down!’ That was the last thing he said.\" \"Me and the kids were all there as a family,\" she added. \"He was just excited. It was going to be a nice day with the family. TRUMP RALLY VICTIM IDENTIFIED AS COREY COMPERATORE, 'HERO' SHIELDED WIFE AND GIRLS FROM BULLETS Corey Comperatore served as a fire chief for the Buffalo Township Volunteer Fire Company. The department set up a memorial with Comperatore’s uniform outside of the firehouse to honor him in the days after his death, describing him as a \"brother, son, husband, father and friend.\" Helen Comperatore said that President Biden has reached out to her following the incident, but noted she \"didn’t want to talk to him.\" \"I didn’t talk to Biden,\" she said. \"My husband was a devout Republican and he would not have wanted me to talk to him.\" CLICK HERE TO GET THE FOX NEWS APP \"I don’t have any ill-will towards Joe Biden,\" she added. \"I’m not one of those people that gets involved in politics. I support Trump, that’s who I’m voting for but I don’t have ill-will towards Biden.\"","summary":"Corey Comperatore&apos;s gear from his time as a firefighter will be placed on the stage before former President Donald Trump&apos;s remakrs at the Republican National Convention.","url":"https://www.foxnews.com/politics/corey-comperatores-fire-gear-placed-stage-trump-during-rnc-speech","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/download.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-18 23:52:53","author":"Michael Lee","authors":["Michael Lee"],"language":"en","source_country":"us","sentiment":0.047},{"id":252113006,"title":"Donald Trump Breaks Polling Record for Second Straight Day","text":"Former President Donald Trump has taken his biggest lead over President Joe Biden in the 2024 presidential campaign cycle, according to a new poll, as Thursday marks the second consecutive day of record survey totals for Trump.In a recent survey released by CBS News and YouGov, 52 percent of registered voters said they would choose Trump if the election were held today. Biden was supported by 47 percent of the 2,247 voters surveyed, while 1 percent of respondents said they \"would not vote\" if Trump and Biden appeared on the ballot. The poll was conducted from July 16 to July 18.Thursday's results are a slight jump from a CBS News/YouGov poll taken in the days following the first presidential debate, where Biden's performance ignited concerns over the president's ability to defeat Trump and serve another four years in the White House. From June 28 to July 2, 50 percent of voters said they would vote for Trump if the election were held today, while Biden was backed by 48 percent.When asked the same question from June 5 to June 7, 50 percent of voters said they would back Trump, while 49 percent chose Biden.The polling boost comes a day after Trump broke his record in an Economist/YouGov poll, where nearly half (49 percent) of U.S. adults said they believe Trump will win in November regardless of whom they would support in the election.Polling analysis site FiveThirtyEight also gave Trump his largest lead on average across national polls on Thursday. The former president was up 3 percentage points on Biden—a 1 percent jump from the day before and 2.8 percent jump since the June 27 presidential debate.Newsweek reached out to Trump and Biden's campaigns via email for comment Thursday evening.Voters were also asked in the CBS News/YouGov poll released Thursday how they would vote if the election were held between Trump and Vice President Kamala Harris, considered the likely replacement for Biden if the president steps aside as the Democratic nominee. Harris fared a bit better than Biden, although she still lost to Trump, 48 percent to 51 percent.Out of the voters who indicated that they plan to support or are leaning toward Biden in the fall, half said they would choose the president \"mainly to oppose\" Trump in November. Twenty-seven percent of Biden's voters said they were choosing him because they \"like\" the president, while 23 percent said they were voting for him because he \"will be the Democratic nominee.\"When asked similar questions, 58 percent of the voters who indicated that they would vote for Trump or are leaning toward backing the former president said they were doing so because they \"like\" him. Twenty-seven percent said they would back Trump \"mainly to oppose\" Biden, while 15 percent said they would vote for Trump because he \"will be the Republican nominee.\"The Republican National Convention formally nominated Trump as the GOP presidential choice for 2024 on Monday. The Democratic National Convention will begin August 15, although leaders plan to hold a virtual roll call to accelerate choosing Biden as the party nominee before the convention.","summary":"Trump has taken his biggest lead over President Biden as of Thursday, according to a national pollster.","url":"https://www.newsweek.com/donald-trump-breaks-polling-record-second-straight-day-1927331","image":"https://d.newsweek.com/en/full/2432019/trump-breaks-back-back-polling-records.jpg","video":null,"publish_date":"2024-07-18 23:51:05","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","source_country":"us","sentiment":-0.446},{"id":252113504,"title":"Hunter Biden tries to toss criminal cases using Trump ruling","text":"WASHINGTON >> President Joe Biden’s son, Hunter Biden, moved on Thursday to throw out his criminal conviction on gun charges and dismiss a separate case accusing him of tax evasion based on an argument that the special counsel prosecuting him was unlawfully appointed. Biden’s lawyers cited a federal judge’s decision on Monday to dismiss the criminal case accusing former President Donald Trump of illegally retaining classified documents after leaving office. Florida-based U.S. District Judge Aileen Cannon found the appointment of the special counsel in that case, Jack Smith, violated the U.S. Constitution because Congress had not given him the authority to pursue the case. Smith’s office is appealing. “The Attorney General relied upon the exact same authority to appoint the Special Counsel in both the Trump and Biden matters, and both appointments are invalid for the same reason,” Biden’s lawyers argued in a court filing. A different special counsel, David Weiss, secured Hunter Biden’s conviction last month in Delaware federal court on charges he lied about his illegal drug use to buy a gun. Weiss is also leading a tax case against Biden that is scheduled to go to trial in September. Biden has pleaded not guilty in that case. A spokesperson for Weiss did not immediately respond to a request for comment. The move by Biden shows the potential ripple effects from Cannon’s decision to limit the attorney general’s ability to appoint a special counsel to handle politically sensitive investigations, a practice the U.S. Justice Department has used for decades. It also presents the awkward dynamic of the president’s son relying on a ruling benefiting Trump, his father’s Republican opponent in the Nov. 5 presidential election. Biden is likely to have a more difficult time challenging the special counsel because Cannon’s ruling focused on the fact that Smith was not in the U.S. government when appointed and had not been confirmed for the role by the Senate. Before being named special counsel, Weiss was confirmed by the Senate to serve as the top federal prosecutor in Biden’s home state of Delaware during the Trump administration. Biden previously challenged the appointment of Weiss on different grounds, efforts that were rejected by federal judges in both cases against him. Another defendant charged as part of Weiss’ investigation, Alexander Smirnov, moved to invalidate the special counsel after the ruling in Trump’s case. Smirnov has pleaded not guilty to charges that he lied to the FBI when he claimed knowledge of a bribe to Joe Biden.","summary":"WASHINGTON >> President Joe Biden&#8217;s son, Hunter Biden, moved on Thursday to throw out his criminal conviction on gun charges and dismiss a separate case accusing him of tax evasion based on an argument that the special counsel prosecuting him was unlawfully appointed.","url":"https://www.staradvertiser.com/2024/07/18/breaking-news/hunter-biden-tries-to-toss-criminal-cases-using-trump-ruling/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_2024-07-18T211102Z_1967914595_RC2WX8AF96K8_RTRMADP_3_USA-BIDEN-HUNTER.JPG","video":null,"publish_date":"2024-07-18 23:48:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.151},{"id":252112888,"title":"Senate Republicans call on Durbin to investigate Trump assassination attempt","text":"All Republicans on the U.S. Senate Judiciary Committee have called on its chair, Sen. Dick Durbin, D-Ill., to hold a hearing on the circumstances surrounding the assassination attempt of former President Donald Trump. Led by ranking member Sen. Lindsey Graham, R-SC, they asked Durbin to hold a hearing to call U.S. Department of Homeland Security Director Alejandro Mayorkas, Secret Service Director Kimberly Cheatle and Federal Bureau of Investigations Director Christopher Wray as witnesses. The Senate Judiciary Committee has jurisdiction and oversight authority over all three agencies; the Secret Service falls under the leadership of Mayorkas. “In light of the attempted assassination of President Donald Trump and the murder and injury of other attendees at a peaceful political event, we urgently request that you hold a hearing into the circumstances that led to this tragedy,” they wrote, calling on him to request Mayorkas, Cheatle and Wray to testify,” the letter, dated Monday. said. “There is much unknown about this attempted assassination, but its occurrence raises alarming questions and concerns,” they said, raising questions about how a “would-be assassin was able to access a nearby rooftop with a rifle and a line of sight to President Trump.” Because of the committee’s oversight of the federal agencies responsible for security of the president and former presidents, they said the committee “must fulfill its responsibility to investigate this thoroughly and publicly to understand how this happened and how it can be prevented in the future. The sanctity of our elections, the safety of our candidates, and the peaceful transition of power in our Republic demand nothing less.” Graham was joined by Republican Sens. Chuck Grassley of Iowa, John Cornyn and Ted Cruz of Texas, Mike Lee of Utah, Josh Hawley of Missouri, Tom Cotton of Arkansas, John Kennedy of Louisiana, Thom Tillis of North Carolina and Marsha Blackburn of Tennessee. On the same day as they sent the letter, Durbin said, “This morning, I was briefed by FBI Deputy Director Abbate on the investigation into the assassination attempt on former President Trump. I’ve requested a closed-door, in-person briefing next week with USSS, DHS, FBI for all Judiciary Committee members when the Senate is back.” On Wednesday. U.S. Sen. Ron Johnson, R-Wisc., said the briefing some senators did have with Secret Service “was unbelievably uninformative. Only 4 questions were allowed. The rest of us are supposed to submit questions. I already have. Awaiting a response. Not holding my breath.” He also published a letter of his questions, including requesting information from Mayorkas about a security plan in place for the July 13 rally, all records between Secret Service, the FBI, state and local law enforcement regarding the rally, among other questions. The U.S. House Oversight Committee has subpoenaed Cheatle to testify, stating it will hold a hearing on Wednesday. Numerous Republican leaders, including House Speaker Mike Johnson, R-Louisiana, and Senate Minority Leader Mitch McConnell, R-Kentucky, have called for her resignation. Johnson said he’s creating a bipartisan task force to investigate the assassination attempt. The U.S. House Committee on Homeland Security has also demanded answers of Mayorkas, who has defended Secret Service’s failures. These include failing to secure the perimeter of the event, not having security on all surrounding building rooftops or a nearby water tower, not deploying helicopters, drones or other technologies, reportedly assigning new recruits as detail, including women who do not appear physically qualified for the job, former Secret Service agents have argued, describing the security failures as “apocalyptic” and calling for Cheatle’s immediate resignation. The Department of Homeland Security’s Inspector General is also investigating Secret Service security breaches. U.S. Rep. August Pfluger, R-Texas, who chairs the U.S. House Committee on Homeland Security Subcommittee on Intelligence and Counterterrorism, is also conducting an investigation. He said he directed his staff “to review U.S. Secret Service actions before, during, and after the event. I am talking to law enforcement officials, Homeland Security Chairman Mark Green, and others to collect all relevant information and take action.” Cheatle will testify before the House committee “either willingly or under subpoena,” he said. “Our nation was millimeters away from a presidential assassination,” he said. “As Americans, we must unite together and move forward from this tragedy.”","summary":"“In light of the attempted assassination of President Donald Trump and the murder and injury of other attendees at a peaceful political event, we urgently request that you hold a hearing into the circumstances that led to this tragedy,” they wrote, calling on him to request Mayorkas, Cheatle and Wray to testify,\" the letter, dated...","url":"https://nypost.com/2024/07/18/us-news/senate-republicans-call-on-durbin-to-investigate-trump-assassination-attempt/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/85661424.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/uZDpHe6y-RyIcpnTz.mp4","publish_date":"2024-07-18 23:47:40","author":"The Center Square","authors":["The Center Square"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.142},{"id":252113580,"title":"When Kanye West Pushed The Interviewer to Not ‘Jimmy Kimmel the Situation’: “Give Me Time to Think”","text":"Kanye West is well known for speaking his mind no matter what. Back in 2018, when he appeared in an interview with TMZ Live, the rapper made sure the interview would run on his terms and not the \"Jimmy Kimmel\" way. Expressing his support for Donald Trump for the then-presidential elections West left no stone unturned in declaring himself a Republican supporter. However, when asked about the former President's goals, West hilariously lashed back at the interviewer comparing him to Jimmy Kimmel. Wearing a Make America Great Again cap and a jacket, the Yeezy founder maintained a minute-long silence when asked by Harvey Levin, \"[Donald Trump] has been on this path for years now where people have criticized it, and he’s just amped it up. At a point, don’t you say, He is who he is?\" The question came in response to Ye's view on Trump where he stated, \"Do you feel people can grow? For someone to grow, they need to know that they have love. That someone loves, and that someone is leading with love, or that a group of people is leading with love. There’s no way to start a dialogue with ‘Fuck you.’ That’s not how you lead with love,\" as reported by Vulture. After a long muted gap, when Levin reiterated, \"Do you want me to repeat?\" he responded with a, \"No.\" To which the interviewer suggests, \"Why don’t we do this, we can’t take a quick break — \" The Gimme A Second 2 rapper lashed back at the TMZ journalist saying, \"No. We’re not going to Jimmy Kimmel the situation. No, we’re not going to come right back. We’re not going to Jimmy Kimmel the situation.\" Taking the interviewer by surprise he continued, \"We’re going to give me time to think. You asked me a serious question and I’m going to take some time to think about my answer.\" As he said this, Ye then hilariously added, \"I’m going to use the time to my advantage in this situation. Now repeat the question,\" as he put his hand on his chin sitting in the thinker's position. Moments later he looks at Levin saying, \"You’re not giving a question, you’re giving opinions.\" To which Levin reframed his question saying, \"The question is you had said that people have the ability to grow. What I’m saying is — \" Ye retaliated, \"Yeah, what you’re saying. So now I’m waiting for a question for me.\" The interviewer reverted, \"My point is, do you give up on them growing?\" Ye stuck with his point saying, \"We’re not making a point. You’re going to ask me a question.\" Levin finally asked, \"Do you give up on somebody growing when they are unrelenting because they are who they are?\" Ye answered, \"And I love it. Now you asked me the perfect question, you set me up to win. We never give up on anyone.\" The interview went viral for its hilarious mention of Kimmel, who had questioned West on his late-night show for showing support for Trump.","summary":"The interviewer, Harvey Levin asked Kanye West, &#34;Do you want me to repeat?&#34; to which he responded with a, &#34;No.&#34;","url":"https://www.inquisitr.com/when-kanye-west-pushed-the-interviewer-to-not-jimmy-kimmel-the-situation-give-me-time-to-think","image":"https://dab57h0r8ahff.cloudfront.net/705875/uploads/f99cbcd0-4500-11ef-bd27-730666e6f280_1200_630.jpeg","video":null,"publish_date":"2024-07-18 23:46:11","author":"INQUISITR,Tavishi","authors":["INQUISITR","Tavishi"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.265},{"id":252113578,"title":"Netizens Paint a Dark Future, Say It Is 'Obvious' That Elon Musk Bought X to Get Trump Elected","text":"The environment of social media and politics is ever-changing. There is new speculation in the market that has swept over X (previously Twitter). Many Twitter users are bluntly stating their thoughts on why Elon Musk went on to buy the platform. Speculation believes he did it solely to aid former President Donald Trump's return to power. The user @theliamnissan started the tweet saying, \"Elon bought this website to get Donald Trump elected.\" Many echoed this sentiment, with @jimmy607 asserting, \"It was never a business decision. It was never about 'free speech'. It was always about controlling narrative.\" This point suggests that there was a deeper motive for Musk to buy the platform. The discussion took on a more urgent tone after that. @quidprojlo questioned their continued use of the platform: \"At what point is continuing to use this website enabling Musk and Trump? I wish a Twitter alternative like Blue Sky managed to take off.\" Others delved into more complex theories. @r0z_75 offered a multi-faceted view: \"And fuck with our stocks, direct activating dog whistles to the appropriate demographics, do a little social engineering, sabotage a few American legacy companies (like Tesla) and command (pfft) a stellar neural network. Musksy is quite the Enterprising dark mule, amirite?\" Some users kept their responses brief but impactful. @erthcrclr simply stated, \"where's the lie,\" implying agreement with the original post. The notion that Musk's intentions were transparent from the start gained traction. @PawlowskiMario claimed, \"It was obvious for a long time, I knew it since he first mentioned that he is interested in buying Twitter.\" However, not all users agreed with these theories. @INVEST327 offered a contrasting view: \"If Elon didn't buy this app you probably wouldn't have the freedom to post that. The woke boys would've shadow banned any election tweet and push one sided advertising (propaganda).\" Some users took a more dramatic stance on the potential consequences. @LaBecs warned, \"He overpaid and didn't care about losing what's a drop in the bucket to him, so he could then own the government. I'd advise americans to start packing. It'll be fun watching the white snowflakes becoming refugees of the very countries they've looked down upon all their lives.\" @Lyrics85 added historical context, stating, \"Yup. And don't forget this happened right after getting he got banned.\" These theories come within a broader political context in which tensions between current and former leaders are simmering. President Joe Biden recently tested positive for COVID-19, causing him to issue a statement that included direct references to Musk and Trump. In a post on X, Biden said, \"I'm sick,\" before adding, \"of Musk and his rich buddies trying to buy this election. And if you agree, pitch in here.\" The letter was accompanied by photographs of Musk and Trump.","summary":"One user questioned, &#34;At what point is continuing to use this website enabling Musk and Trump? I wish a Twitter alternative like Blue Sky.&#34;","url":"https://www.inquisitr.com/netizens-paint-a-dark-future-say-it-is-obvious-that-elon-musk-bought-x-to-get-trump-elected","image":"https://dab57h0r8ahff.cloudfront.net/705741/uploads/409eb6b0-44d9-11ef-ba73-b1d3c1f3853b_1200_630.jpeg","video":null,"publish_date":"2024-07-18 23:46:00","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","source_country":"US","sentiment":0.053},{"id":252113274,"title":"Rep. Michael McCaul pushes Trump on aid for Ukraine as Vance spurns it","text":"Sign up for the We the Texans newsletter to receive twice-monthly updates on our year-long initiative dedicated to boosting civic engagement and chronicling how democracy is experienced in Texas. MILWAUKEE — U.S. Rep. Michael McCaul isn’t giving up hope that a second Donald Trump presidency will support Ukraine in its war against Russia, even after Sen. J.D. Vance, a vocal Ukraine aid critic and outspoken isolationist, was nominated to the vice presidency. Vance’s selection as running mate sets up some potential tension between a future Trump administration and the congressional defense hawks like McCaul, who played a role in securing Ukraine aid last April. Vance has been skeptical of sustained aid for U.S. allies abroad and voted against continued assistance for Ukraine, including the aid package McCaul advocated. Both are cornerstone priorities for McCaul, an Austin Republican who chairs the House Foreign Affairs Committee. McCaul said he’s “a little” concerned Vance could portend greater withdrawal by the United States on the world stage, but he isn’t throwing in the towel just yet. McCaul said he is still in touch with Trump's foreign policy team, which expands beyond Vance and includes aides who are dedicated to defending American interests overseas. “I don't think he wants to be a loser,” McCaul said of Trump on the sidelines of the National Republican Convention. “To Trump, that's a big thing. And if Putin takes over Ukraine, the United States loses.” McCaul has been a steadfast supporter of aiding U.S. allies against growing threats from Russia, China and Iran, including Ukraine, Taiwan and Israel. He is part of a dwindling generation of pro-defense Republicans who used to dominate Texas’ influence on national politics, from former House Appropriations Chair Kay Granger to former President George W. Bush. McCaul made appeals to House Speaker Mike Johnson, R-Louisiana, to support the Ukraine aid package. Johnson eventually backed the package despite having past misgivings about continuing aid to Ukraine. Meanwhile, Vance said at the Munich Security Conference this year that Europe should prepare for the U.S. moving to “pivot” away from the continent. “The American security blanket has allowed European security to atrophy,” Vance said. “I believed in the propaganda of the George W. Bush administration that we needed to invade Iraq, that it was a war for freedom and democracy,” Vance said on the Senate floor in April. “The promises of the foreign-policy establishment of this country were a complete joke.” Vance said on a 2022 podcast that \"I gotta be honest with you, I don't really care what happens to Ukraine one way or another.” Trump has bemoaned that NATO allies don’t spend more on their common defense. But he also acknowledged that Ukraine’s survival is important for U.S. interests. “As everyone agrees, Ukrainian Survival and Strength should be much more important to Europe than to us, but it is also important to us!” Trump posted on social media in April. “GET MOVING EUROPE!” McCaul acknowledged that “it’s not popular to look outside the United States” and recognized Vance’s position as “trying to stand for the common man, the working man. That's always what Trump has done.” “I think their overall messaging is, we're tired of paying for it. And I think that resonates,” McCaul said. “What they want is assurances we're not gonna be footing the bill for everybody's conflict, but it is getting more dangerous.” McCaul advised Trump on his 2016 presidential campaign on foreign policy. Prior to leading the Foreign Affairs Committee, McCaul served as the top Republican on the House Homeland Security Committee. He said he is still in touch with members of Trump’s team and that there are several of Trump’s top advisers who feel that a strong American presence is necessary. He named former Secretary of State Mike Pompeo, who served with McCaul in the House, former National Security Adviser Robert O’Brien and former National Security Adviser to the Vice President Keith Kellogg. “It really depends who the president puts around himself,” McCaul said. “He likes to have differences of opinion and likes to throw them in the ring and let them fight it out.” Big news: director and screenwriter Richard Linklater; NPR President and CEO Katherine Maher; U.S. Rep. Pete Aguilar, D-California; and Luci Baines Johnson will take the stage at The Texas Tribune Festival, Sept. 5–7 in downtown Austin. Buy tickets today!","summary":"J.D. Vance, the Republican vice presidential nominee, has been a vocal critic of Ukraine aid — a cause McCaul has made a top priority.","url":"https://www.texastribune.org/2024/07/18/michael-mccaul-ukraine-jd-vance-trump/","image":"https://thumbnails.texastribune.org/H02ZwNzT54MkUsFSIgpmbO69x9o=/450x300/https://static.texastribune.org/media/files/e6b957cfd69ba55c083c2b916ef184f7/McCaul%20Foreign%20Affairs%20Cmte%20REUTERS.jpg","video":null,"publish_date":"2024-07-18 23:44:28","author":"Matthew Choi","authors":["Matthew Choi"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.251},{"id":252113228,"title":"Stellantis warns of battery fires in Chrysler Pacifica hybrid minivans","text":"CTVNews.ca Top Stories DEVELOPING DEVELOPING | Live RNC updates: Donald Trump, Hulk Hogan set to speak on final day of convention The final day of the Republican National Convention is underway in Milwaukee where Donald Trump is set to speak along with his son, Eric, as well as famed wrestler Hulk Hogan. Once defiant, Biden is now 'soul searching' about dropping out of race: Reuters source U.S. President Joe Biden is taking calls to step aside as the Democratic presidential candidate seriously and multiple Democratic officials think an exit is a matter of time, Reuters reported, citing sources familiar with the matter. 2 dead after small plane crashes in Tofino, B.C. Two people died and a third was seriously injured in a fiery plane crash in Tofino, B.C., on Thursday, according to authorities. Donald Trump will accept Republican nomination again days after surviving an assassination attempt Donald Trump takes the stage Thursday at the Republican National Convention to accept his party's nomination again and give his first speech since he was cut off mid-sentence by a flurry of gunfire in an assassination attempt at a rally in Pennsylvania. Stellantis warns of battery fires in Chrysler Pacifica hybrid minivans Stellantis is warning the owners of more than 2,900 hybrid minivans in Canada to stop charging their vehicles and park them outdoors, away from buildings and other cars, due to the risk of battery fires. 'We had a good run': High-profile Liberal minister quitting cabinet, not running in next election Labour Minister Seamus O'Regan has announced he will not run in the next federal election, and will be quitting his cabinet position Friday. B.C. woman who thought Coldplay concert 'was a date' must pay ex for ticket, tribunal rules A B.C. woman has been ordered to repay her ex for a ticket to Coldplay's 2023 concert in Vancouver – in a small claims decision that highlights the distinction between gifts and loans under Canadian law. Comedian Bob Newhart, deadpan master of sitcoms and telephone monologues, dies at 94 Bob Newhart, the deadpan accountant-turned-comedian who became one of the most popular TV stars of his time after striking gold with a classic comedy album, has died at 94. When will the 'Big One' earthquake hit? Scientists weigh in Researchers say they know the 'Big One' is coming, but when should we expect it? Scientists say predicting when a megathrust earthquake will occur is a guessing game. Canada 2 dead after small plane crashes in Tofino, B.C. Two people died and a third was seriously injured in a fiery plane crash in Tofino, B.C., on Thursday, according to authorities. Wildfire prompts evacuation orders near Spences Bridge, B.C., as hot spell continues The Thompson-Nicola Regional District has issued an evacuation order for 76 properties in the Venables Valley area north of Spences Bridge, B.C., due to the out-of-control Shetland Creek wildfire. Multiple horses in Alberton, P.E.I., have hair cut off tails: RCMP The Prince Edward Island RCMP is asking for the public’s help after three horses recently had their tails cut off. 'Just fly a drone over': Suggestion on encampment response at U of T Council meeting sparks privacy concerns for protesters, advocates A suggestion by a University of Toronto Governing Council member to deploy drones and facial recognition on encampment participants and seek financial reparations from 'bad actors' within the movement has sparked concern among protesters and privacy advocates. When will the 'Big One' earthquake hit? Scientists weigh in Researchers say they know the 'Big One' is coming, but when should we expect it? Scientists say predicting when a megathrust earthquake will occur is a guessing game. B.C. woman who thought Coldplay concert 'was a date' must pay ex for ticket, tribunal rules A B.C. woman has been ordered to repay her ex for a ticket to Coldplay's 2023 concert in Vancouver – in a small claims decision that highlights the distinction between gifts and loans under Canadian law. World DEVELOPING DEVELOPING | Live RNC updates: Donald Trump, Hulk Hogan set to speak on final day of convention The final day of the Republican National Convention is underway in Milwaukee where Donald Trump is set to speak along with his son, Eric, as well as famed wrestler Hulk Hogan. What is Project 2025? A look at the conservative platform Joe Biden says 'will destroy America' Its authors call it the U.S. conservative movement's 'mandate for leadership,' designed to guide a potential second term for former U.S. president Donald Trump. Biden has COVID-19 and didn't wear a mask. The CDC's guidelines say he doesn't have to President Joe Biden did not wear a face mask in public a couple of times after the White House announced he had tested positive for COVID-19. What does the CDC guidance say? Tiger Woods says he lost sleep over Trump assassination attempt Tiger Woods said he endured a sleepless flight to the Open Championship after watching coverage of the assassination attempt on Donald Trump. South Korea restarts propaganda broadcasts across border in reaction to North's balloon launches South Korea said Friday it has restarted anti-Pyongyang propaganda broadcasts across the border in response to North Korea's resumption of trash-carrying balloon launches. Man dies after he rescues two young boys who were struggling to stay afloat in New Jersey river A man who dove into a southern New Jersey river and rescued two children who were struggling to stay afloat has died after he disappeared underneath the water, authorities said. Politics 'We had a good run': High-profile Liberal minister quitting cabinet, not running in next election Labour Minister Seamus O'Regan has announced he will not run in the next federal election, and will be quitting his cabinet position Friday. Canada selling one of its Manhattan apartments to cover cost of new $9M condo Canada is selling one of its apartments in New York City to cover the cost of a brand-new luxury condo it recently purchased for $9 million. 'I feel ready:' Gen. Jennie Carignan officially named head of military Lt.-Gen. Jennie Carignan becomes the first female to lead the Canadian Armed Forces following a ceremony in Ottawa today. Health Two listeriosis deaths in Ontario linked to plant-based milk recall: MOH Two deaths as a result of a listeriosis outbreak linked to a plant-based milk recall are in Ontario, provincial health officials confirmed Thursday. A decade after Insite, drug policy landscape is still being shaped in B.C. In 2021, the Vancouver-based Drug User Liberation Front approached Health Canada with a proposal. The guidance for RSV vaccines has changed. Here's what Canadian seniors need to know Health officials recently changed the guidelines for respiratory syncytial virus vaccines. Here's what Canadians need to know about the guidance and the virus itself. Sci-Tech Love at first sight? AI making it even harder to detect romance scams As more people look to find love on dating apps and social media these days, so too are those looking to commit romance scams as artificial intelligence makes it harder to know what's real and what isn't. When will the 'Big One' earthquake hit? Scientists weigh in Researchers say they know the 'Big One' is coming, but when should we expect it? Scientists say predicting when a megathrust earthquake will occur is a guessing game. A meteor streaked over the NYC skyline before disintegrating over New Jersey A meteor streaked over the New York City skyline before disintegrating over nearby New Jersey, according to NASA. Entertainment Netflix beats subscriber targets but cautions on next quarter Netflix said on Thursday it added more than eight million subscribers in its second quarter as the streaming service benefited from a password-sharing crackdown and such titles as 'Bridgerton,' 'Baby Reindeer' and 'The Roast of Tom Brady.' Comedian Bob Newhart, deadpan master of sitcoms and telephone monologues, dies at 94 Bob Newhart, the deadpan accountant-turned-comedian who became one of the most popular TV stars of his time after striking gold with a classic comedy album, has died at 94. Toronto councillor wants downtown route designated as 'Taylor Swift Way' during Eras Tour One city councillor wants Toronto to welcome the biggest pop star in the world in style and designate a downtown route 'Taylor Swift Way' in November when the 'Eras Tour' stops in the city. Business Netflix beats subscriber targets but cautions on next quarter Netflix said on Thursday it added more than eight million subscribers in its second quarter as the streaming service benefited from a password-sharing crackdown and such titles as 'Bridgerton,' 'Baby Reindeer' and 'The Roast of Tom Brady.' Final hurdle clears for grocery code of conduct as Walmart, Costco sign on All the major Canadian grocers are now on board for a grocery code of conduct, paving the way for industry guidelines that have been several years in the making. Amazon says it had its best Prime Day sales event ever The company said 'millions' of customers also joined Prime in the past three weeks to take advantage of the discount event, which ended right before midnight Pacific Standard Time on Thursday. Lifestyle Video shows B.C. grizzly basking in clawfoot tub A donated clawfoot bathtub has become the preferred lounging spot for a pair of B.C. grizzly bears, who have been taking turns relaxing and reclining in it – with minimal sibling squabbling – for the past year. 'It's this or that': Why some Canadians aren't having kids anymore Some Canadians feel stuck between a rock and a hard place when considering starting a family, while others are concerned about what their child's future could look like. 'Just so grateful': B.C. man uses Google Lens to reunite woman with lost family heirloom After more than three years, a B.C. woman has been reunited with a lost family heirloom. Sports Tiger Woods in danger of missing cut at British Open again after 8-over 79 at Royal Troon Tiger Woods' 8-over 79 at Royal Troon on Thursday left him in danger of missing the cut for a third straight time at the British Open. 'I actually rented a bike:' Race car driver almost misses Indy press conference due to Toronto gridlock It appears that not even race car drivers are immune to Toronto gridlock. In Paris, Canadian boxer Tammara Thibeault has one objective: gold Canadian boxer Tammara Thibeault won’t hide it. At the Paris Olympics, she has only one goal — capturing gold in the 75-kilogram weight class. Autos Ford to produce F-Series pickups at Oakville plant starting in 2026 Ford Motor Co. says it plans to assemble its F-Series Super Duty pickup trucks at its Oakville, Ont., assembly plant starting in 2026, adding capacity of up to 100,000 additional units. Stellantis warns of battery fires in Chrysler Pacifica hybrid minivans Stellantis is warning the owners of more than 2,900 hybrid minivans in Canada to stop charging their vehicles and park them outdoors, away from buildings and other cars, due to the risk of battery fires. Toronto traffic has reached crisis level, poll data reveal Toronto traffic has reached the point of a congestion crisis, according to the Toronto Region Board of Trade, whose new numbers warn of a significant impact on the city’s economy. Local Spotlight Video shows B.C. grizzly basking in clawfoot tub A donated clawfoot bathtub has become the preferred lounging spot for a pair of B.C. grizzly bears, who have been taking turns relaxing and reclining in it – with minimal sibling squabbling – for the past year. Cemetery 'investigators' connecting families with forgotten gravestones A pair of cemetery investigators are cleaning and preserving as many gravestones they have permission to work on, as they conduct their research and document gravestones. 'Just so grateful': B.C. man uses Google Lens to reunite woman with lost family heirloom After more than three years, a B.C. woman has been reunited with a lost family heirloom. Edmonton man contributes thousands of photos to Google while dressed as an alien One of Edmonton’s main contributors to Google Street View is a man who dresses up as an alien. Nearly 10 years after it was first pitched, Vancouverites can climb the stairway to nowhere Nearly 10 years after it was first proposed, an interactive piece of public art is officially open in Vancouver's Hastings Park. Sudbury's Big Nickel celebrates its 60th birthday An event July 22 at Dynamic Earth in Sudbury will mark the 60th anniversary of the iconic Big Nickel, the largest coin in the world. Cyclist riding across Canada for children's charity stops in Montreal Cyclist Jagjeet Singh cruised through Montreal on Sunday morning as he rides across the country to raise money for a children's charity. Rare marine fossil found in eastern Saskatchewan A rare ammonite fossil – about 75 million years old - has been discovered in eastern Saskatchewan. Ontario dad highlights Calgary Flames' act of kindness Seven-year-old goalie Hudson Hardill is an unlikely Calgary Flames fan, being that he lives in Peterborough, Ont., and his dad Chris is a Toronto Maple Leafs fan. Vancouver Doctors speak up: What's behind waits and closures at B.C. emergency departments Across the province, B.C.'s health authorities are pleading with doctors and offering hefty incentives to get them to pick up extra shifts, but emergency departments are facing increasing risk of closures, CTV News has learned. 2 dead after small plane crashes in Tofino, B.C. Two people died and a third was seriously injured in a fiery plane crash in Tofino, B.C., on Thursday, according to authorities. Fireworks and other things to do in Metro Vancouver this weekend Festivals celebrating folk music, barbecue ribs, bubble tea and multiculturalism are on offer around Metro Vancouver this weekend, but the biggest event of them all is likely to be the fireworks over English Bay Saturday night. Toronto 'I actually rented a bike:' Race car driver almost misses Indy press conference due to Toronto gridlock It appears that not even race car drivers are immune to Toronto gridlock. Homicide unit investigating death of Toronto woman found with obvious signs of trauma Toronto police are investigating the death of a woman who was found with obvious signs of trauma in a home in the city’s Rockliffe-Smythe neighbourhood last week. Grocery stores can sell ready-to-drink beverages as of today as LCBO strike continues Shoppers could soon see an expanded selection of alcoholic beverages at their local grocery store, as a strike by LCBO workers continues to drag on. Calgary 'Completely helpless': Canmore, Alta., family waited hours for help as bear killed dog, slept in their backyard A Canmore family says they could only watch as a black bear attacked their dog and then slept in their backyard overnight as they waited for help from wildlife officers. Calgary's air quality drops to 'moderate' amid smoky smell Calgary's air quality declined slightly on Thursday with the acrid smell of smoke becoming noticeable in some parts of the city. Driver killed, 8 injured in southern Alberta head-on collision with bus RCMP say a one person was killed and eight others were injured when a bus and an SUV collided head-on in southern Alberta on Wednesday. Ottawa Warrant issued for second suspect in July 5 homicide Ottawa police are asking for the public's help in locating a man accused of murder following a shooting on Carling Avenue earlier this month. 'It smells like paradise': This is where you can stroll through 5,000 lavender plants If you're looking for an outing that will stimulate your vision and sense of smell, Lavande Braydale Lavender is home to 5,000 lavender plants, which you can visit. Chick-fil-A greeted with a big crowd as it opens first location in Ottawa More than 100 people lined up on foot and in vehicles outside Chick-fil-A at Ottawa's Tanger Outlets on Thursday, as the U.S.-based fast food outlet opened its first location in the capital. Montreal Closing arguments heard in case against former West Island baseball coach The sexual assault trial of former West Island baseball coach Robert Litvack wrapped up with closing arguments at the Montreal Courthouse today. Here's a look at the Ile-aux-Tourtes Bridge construction and repair Work to maintain the current Ile-aux-Tourtes Bridge is ongoing, but construction of its replacement is in its first year, as those west of the Island of Montreal wait in traffic. Montreal-area man shocked to get $2,000 bill from Hydro-Quebec due to undercharging When Neil Brazer, a resident of Pointe-Claire, received mail from Hydro-Quebec a few months ago, he tossed the envelopes aside because he thought they were just statements. Edmonton 22-year-old arrested in string of violent attacks on Edmonton sex-trade workers A man has been arrested for allegedly attacking and robbing multiple women this year. Record high temperatures set in Alberta on Wednesday Edmonton was one of a half-dozen locations in central and northern Alberta that set a new daily record high on Wednesday, July 17. Guide to Edmonton's K-Days 2024 Edmonton's K-Days annual summer festival starts on Friday, July 19, with the Premier's pancake breakfast and runs through Sunday, July 28. Atlantic N.B. RCMP discovers human remains during search for missing woman The New Brunswick RCMP is investigating human remains found in a forest in Baie de Petit-Pokemouche on Wednesday. Horse owner in P.E.I. saddened, confused after hair on her horses' tails cut off A horse owner in Alberton, P.E.I., is heartbroken and confused after three of her horses had the hair cut off their tails over the weekend. 78-year-old hobby shop in Halifax closing its doors The purported oldest hobby shop in Canada is apparently closing its doors for good. Winnipeg Manitoba Métis Federation purchases two office buildings, parking lot downtown The Manitoba Métis Federation (MMF) is expanding its footprint downtown. Body of second missing boater found: Manitoba RCMP Manitoba RCMP said the body of a second boater who went missing on Lake Winnipeg last month has been found, while the search continues for the remaining man. Movie shoot to take over Birds Hill Provincial Park next week A new movie being shot in Birds Hill Provincial Park next week means people will need to use an alternate entrance to get in. Regina Saskatchewan scout camp reeling after vandals cost thousands in damages A Saskatchewan not-for-profit is reeling after vandals inflicted thousands of dollars of damages at the Good Spirit Scout Camp. Hospital emergency codes in Sask: What each colour means In light of the recent bomb scare at one of Saskatoon's busiest hospitals — here's a refresher on the emergency codes used in Saskatchewan health facilities and what they mean. Swift Current RCMP asking public for help finding missing 87-year-old woman Swift Current RCMP is asking the public for help finding a missing 87-year-old woman, who was last in contact with her family on July 13. Kitchener Waterloo Region secures one third of Wilmot property marked for future investment The Region of Waterloo says it's making good progress on its plan to assemble shovel-ready land in Wilmot Township. Conestoga College extends deadline for first-year students to secure housing Conestoga College is extending the deadline for first-year students at its Waterloo and Brantford campuses to apply for housing, as demand continues to grow. Woolwich mayor says time is right for long-awaited Elmira truck bypass route Community leaders explain why they want to divert big trucks from downtown Elmira. Saskatoon Sask. woman charged in fatal THC-driving case had Charter rights violated, defence says The lawyer representing a woman who struck and killed a child while driving says a number of her Charter rights were violated. Two men charged with first-degree murder of Saskatoon woman Saskatoon police have arrested and charged two men in relation to the homicide of 24-year-old Melissa Duquette. Police say hospital 'bomb threat' might just have been man seeking care for chemical exposure Saskatoon’s Royal University Hospital (RUH) and Jim Pattison Children’s Hospital (JPCH) were under lockdown following a bomb threat Wednesday morning, but police soon discovered it may have been a misunderstanding. Northern Ontario Northern Ont. OPP sergeant charged with impaired driving An Ontario Provincial Police sergeant with 26 years of experience has been charged with impaired driving in Cochrane. Northern Ont. man charged after allegedly chasing, threatening people with bat A 21-year-old northern Ontario man is charged with three counts of assault after police received a call about a suspect threatening and chasing people with a baseball bat last weekend. Comedian Bob Newhart, deadpan master of sitcoms and telephone monologues, dies at 94 Bob Newhart, the deadpan accountant-turned-comedian who became one of the most popular TV stars of his time after striking gold with a classic comedy album, has died at 94. London Fatal crash in Elgin County involving cyclist A cyclist has died after a crash with a passenger vehicle in Elgin County. Dutton-Dunwich fire was on scene with OPP and EMS in the area of Talbot Line. City of London continues to deal with flooding of the Thames River High water levels are continuing along the Thames River tonight, with the City of London issuing warnings to Londoners to avoid high water areas. Solidarity picket line outside London LCBO sees several unions show support A solidarity picket line outside the LCBO outlet at Oxford and Wonderland today saw a large gathering of supporters from several unions. With the strike nearly two weeks old, the union and LCBO leadership resumed bargaining yesterday. Barrie Police investigate bizarre incident involving driver and passenger Police are investigating a bizarre incident after a passenger allegedly assaulted a driver before taking off in the vehicle only to return a short time later. Motorcyclist airlifted to hospital with serious injures after crashing One person has been airlifted to a Toronto hospital with serious injuries after a collision in Kawartha Lakes. This town is the latest to introduce photo radar camera program to curb speeding Photo radar cameras are becoming more popular to curb speeding in community safety zones, with Innisfil being the latest town planning to introduce the system. Windsor Ford to add 150 jobs, increase production in Windsor, Ont. Ford Motor Company is expected to increase engine production volumes and add jobs in Windsor as a result of the production volumes of Super Duty trucks in Oakville. Cyclist in 'critical condition' after crashing in Chatham-Kent Around 2:40 p.m. on Tuesday, police said a group of cyclists were riding single file, northbound on Charing Cross when the lead cyclist hit gravel and lost control of their bike. What’s happening in Windsor-Essex from July 18-21 A look at events in Windsor-Essex from July 18-21, according to the Tourism Windsor-Essex Pelee Island website. Vancouver Island 2 dead after small plane crashes in Tofino, B.C. Two people died and a third was seriously injured in a fiery plane crash in Tofino, B.C., on Thursday, according to authorities. Video shows 'extremely creative' suspect use forklift to break into B.C. bike shop Police in Greater Victoria arrested a man early Thursday morning after he allegedly drove a stolen forklift through the front of a bike shop and made off with four e-bikes on the front of the machine. 'Things have dried out': Fire risk climbing as warm temperatures grip Vancouver Island As tinder dry conditions set in across Vancouver Island a brush fire broke out Wednesday afternoon in Port Alberni, burning dangerously close to the city's hospital. Kelowna Motorcyclist seriously injured in Kelowna crash: RCMP A motorcyclist was severely injured in a crash with an SUV Sunday afternoon, according to the Kelowna RCMP. Crews searching for Alta. man swept away by river in B.C. A search effort is underway for a man who was swept away by the North Thompson River in Kamloops on Friday. 1 dead, 17 displaced after Kelowna apartment fire One person is dead and 17 others have been displaced after a stubborn fire burned overnight in a Kelowna apartment building. Lethbridge Boil water advisory ended for Redcliff The Town of Redcliff’s boil water advisory ended Thursday. More physicians needed in Lethbridge despite recent recruitment, health-care advocate says Lethbridge has added nearly 30 doctors in the past year, but according to advocates, more are needed to address the backlog of patients. Contractor killed at construction site near Coaldale A contractor was killed at the McCain Foods expansion site near Coaldale, Alta., on Wednesday. Sault Ste. Marie RotaryFest returns for its 101st edition in Sault Ste. Marie The biggest event of the summer officially began Thursday afternoon in Sault Ste. Marie: the 101st RotaryFest. Steelworkers call for ‘urgent’ meeting with premier to save northwestern Ont. pulp mill The leader of the United Steelworkers union in Ontario is calling for an urgent meeting with Premier Doug Ford to ramp up efforts to re-open the AV Terrace Bay pulp mill, the northwestern Ontario community’s largest employer before it closed six months ago. Shelter in place ends after northwestern Ont. police apprehend 'armed and dangerous' suspect Shortly before 11 a.m. Thursday, police in northwestern Ontario lifted a shelter in place for residents of the Kejick Bay community of Lac Seul First Nation following an 'ongoing threat to public safety.' N.L. Ground assault begins on Labrador City wildfire that forced thousands to evacuate Firefighters began attacking a fire near Labrador City from the ground today, marking a new stage in the effort to get the roaring wildfire under control. Get it while you can, fish harvesters say, handing out free cod in downtown St. John's The latest protest against Ottawa's decision to reopen a commercial cod fishery drew a good line in downtown St. John's Father sues Newfoundland and Labrador government for death of son in provincial jail A father in St. John's, N.L., is suing the Newfoundland and Labrador government over his son's death last year in the province's largest jail. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks I'm Fairly Certain You’ll Never Drive Without This Car Phone Mount Again (And It's On Sale Right Now) If You Have No Idea What To Get Them For Their Birthday, Try One Of These Gifts Prime Day Is A Few Weeks Away, But You Can Already Snag These 30+ Deals On Amazon Canada Home How to Keep Your Yard Looking Its Best This Summer This Best-Selling Geedel Cheese Grater Deserves All Your Attention 17 Game-Changing Travel Products You Won’t Want To Leave Behind Gifts 19 Foolproof Gifts For Kids That Cost Less Than $50 21 Kitchen Goodies And Gifts For The Foodie In Your Life (Or Yourself) 15 Gifts They'll Get Plenty Of Use Out Of This Summer Beauty If You're On The Hunt For A Retinol Serum, Here Are 15 That Reviewers Are Loving Right Now If You Want To Ditch Your Heavy Foundation For Summer, Here Are The Best Tinted Moisturizers You Can Get Online Right Now The Maybelline Instant Age Rewind Concealer Is A Tried-And-True Reviewer Favourite — And Here's Why Deals Amazon Prime Day May Be Over, But You Can Still Take Advantage Of These 70+ Amazing Deals Amazon Prime Day Is Almost Over — Here Are 100+ Of The Best Deals And Discounts You Can Still Snag Amazon Prime Day Deal: You Can Get This 23andMe+ Premium Membership Bundle For 50% Off Right Now Stay Connected","summary":"Stellantis is warning the owners of more than 2,900 hybrid minivans in Canada to stop charging their vehicles and park them outdoors, away from buildings and other cars, due to the risk of battery fires.","url":"https://www.ctvnews.ca/autos/stellantis-warns-of-battery-fires-in-chrysler-pacifica-hybrid-minivans-1.6969572","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/7/18/chrysler-pacifica-hybrid-1-6969579-1721346777069.jpg","video":null,"publish_date":"2024-07-18 23:42:12","author":"Megan DeLaire","authors":["Megan DeLaire"],"language":"en","source_country":"ca","sentiment":-0.202},{"id":252112700,"title":"David Lammy refuses to apologise for Donald Trump Nazi jibe but insists they can do business if he wins election","text":"DAVID Lammy refused to apologise for a Nazi jibe at Donald Trump yesterday — but insisted they can do business if he becomes President. As an MP in 2018, the now Foreign Secretary called him a neo-Nazi-sympathising sociopath. Asked about the comment, he said: “You’ll struggle to find anyone who hasn’t had things to say about Donald Trump. “We’ll work with whomever the US choose to put in the White House.” Mr Lammy also said he could work with running mate JD Vance, who called Britain the first “truly Islamist” nuclear state under Labour. He said: “Let me just say on JD Vance that I’ve met him now on several occasions, we share a similar working class background with addiction issues in our family. \"We’ve written books on that. \"We’ve talked about that. \"And we’re Christians. \"So I think I can find common ground with JD Vance.”","summary":"","url":"https://www.thesun.co.uk/news/29331149/david-lammy-donald-trump-nazi-jibe/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/07/britains-new-foreign-secretary-david-917027610.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-18 23:42:05","author":"Jack Elsom","authors":["Jack Elsom"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.092},{"id":252113034,"title":"JD Vance, Elon Musk, Peter Thiel and Silicon Valley’s Embrace of the MAGA Movement","text":"Chafkin:  It refers to the early employees and founders of PayPal, who, you know, got together in the late 90s, took PayPal public, sold it to eBay, got very rich, and then used that money essentially to make other investments. And so it’s a group that includes Elon Musk, who was effectively a co-founder of PayPal. Max Levchin, who runs a company called Affirm, David Sacks, who was at the Republican Convention, has become a major donor, Reid Hoffman, founder of LinkedIn, who’s a big, Democratic donor. Founders of YouTube, Yelp. You know, it goes on and on. Many of them have stayed in touch. They invest in each other’s companies. They help one another. It’s not just a business network, it’s a political network. In addition to helping one another’s companies, advancing a vision of politics as well. Gura: During the 2016 campaign, Peter Thiel made waves by endorsing Donald Trump. Chafkin:  First of all, it was shocking because very few business people, not just Silicon Valley people, were enthusiastic about Trump. But also because like Trump’s whole thing seemed 180 degrees from the stereotype of Silicon Valley, even the stereotype of like Silicon Valley conservatism, like we’re talking about a proud Luddite, a guy who doesn’t use email, we’re talking about a guy who wants to, have like extreme crackdown on immigration and Peter Thiel, like many very successful people in Silicon Valley, is an immigrant. It just goes on and on, right? He seemed like the very opposite of everything that somebody like Peter Thiel stood for.","summary":"On today’s Big Take podcast: The story of Silicon Valley elites’ embrace of the MAGA movement.","url":"https://financialpost.com/pmn/business-pmn/jd-vance-elon-musk-peter-thiel-and-silicon-valleys-embrace-of-the-maga-movement","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/07/776175230.jpg","video":null,"publish_date":"2024-07-18 23:41:55","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"CA","sentiment":-0.211},{"id":252112656,"title":"RNC conversations shift from Trump assassination to Biden’s dilemma","text":"With the work of nominating the party’s presidential ticket done, the topic of conversation on the floor at the RNC has shifted to slowly percolating problems on the other side of the political aisle, according to one long-time party delegate. MassGOP Chair Amy Carnevale, speaking with the Herald while attending her fourth party convention, said that before the delegates gathered in Milwaukee all that anyone wanted to talk about was President Joe Biden and the growing push for him to step aside following his disastrous display at the first debate. “Before Saturday, that subject completely dominated conversations, with people talking about which Democrats were saying he should be replaced, what it would mean, who it might be,” Carnevale said. After former President Donald Trump’s apparent near brush with death on Saturday, naturally, Trump’s health and the business of seeing through with his nomination became the central topic of conversation. “The focus was back on President Donald Trump and his health with the start of the Republican National Convention and on Republican Party priorities,” she said. But with even more calls coming from the Left for the 81-year-old Biden, currently home sick with COVID-19, to make way for a younger liberal, Carnevale said that Republicans are taking notice. “There was more of that talk last night starting with his COVID diagnosis,” she said. “It’s coming back around.” Even apart from Saturday’s apparent assassination attempt, this year’s Republican National Convention has been one for the history books, according to Carnevale. The MassGOP Chairwoman attended as a delegate in 2012, 2016, 2020, and this year as the chair of the state party. Carnevale said one major difference is the lead up to the event. This time around, it was Trump in control of the party apparatus instead of any of the attempts at the reverse, as seen in past elections. The Republican Party platform adopted by the convention, she said, “is very much a Donald Trump focused document,” down to the diction and capitalization. “I think the party seems more unified than ever,” she said. “We’ve heard from former competitors and former VP contenders over the last couple of days and their message is all the same: we have to come together to defeat Joe Biden.” Carnevale said it’s hard to convey the “sheer sense of enthusiasm and energy for the Trump-Vance ticket. Again, that’s really felt on the floor of the convention.”","summary":"“Before Saturday, that subject completely dominated conversations, with people talking about which Democrats were saying he should be replaced, what it would mean, who it might be,” MassGOP Chair Amy Carnevale said.","url":"https://www.bostonherald.com/2024/07/18/rnc-conversations-shift-from-trump-assassination-to-bidens-dilemma/","image":"https://www.bostonherald.com/wp-content/uploads/2024/07/BHR-L-EDITORIAL.jpg?w=1024","video":null,"publish_date":"2024-07-18 23:41:54","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","source_country":"us","sentiment":-0.307},{"id":252113068,"title":"Biden urged to drop out by Democratic mega-donors, while Kamala Harris attracts large crowds","text":"On a Tuesday in early July, 75 wealthy Democratic political donors gathered on a Zoom call to discuss the path forward for President Joe Biden after his calamitous debate performance against Donald Trump, according to a person on the call. Only one of the donors said they thought Biden should stay in the race, this person said. All the others made it very clear that they believed Biden needed to drop out of the race, if the party wanted to defeat Trump in November. People who spoke to CNBC for this story were granted anonymity to speak freely about a sensitive matter. Since then, big money donors who fund either the Biden campaign, his allied political action committees or the party at large have launched a lobbying campaign aimed at senior Democrats in both the House and Senate. Their goal is to convince lawmakers to publicly call on Biden to end his reelection campaign, according to over half a dozen people familiar with the matter. Many of these donors laid their positions out in stark terms: If Biden refused to drop out, they would not be giving money to help his reelection until polls showed that he was a clear favorite to beat Trump. Donors who have made these types of calls to Democrats on Capitol Hill include Hollywood executive Ari Emanuel, his brother Zeke Emanuel and Alan Jones, a senior managing director at Intermediate Capital Group and a longtime Democratic party donor, two people familiar with the matter explained. The effort set off a scramble by some of Biden’s allies to keep donors on the president’s team. Former Secretary of State Hillary Clinton, her husband former President Bill Clinton and Biden campaign co-chair and media mogul Jeff Katzenberg have all made pleas to donors, asking them to stick with Biden, according to people briefed on the matter. Biden has repeatedly said he has no plans to drop out of the race, despite over 20 members of Congress publicly calling on him to “pass the torch,” with many more doing so in private. “I think almost every donor at this point has publicly or privately expressed their deep concern to the campaign team, to former House Speaker Nancy Pelosi, Senate majority leader Chuck Schumer and House Minority Leader Hakeem Jeffries,” said one longtime Biden bundler. “While Biden doesn’t really care what donors think, the leadership does, because of the impact down ballot,” the bundler added. Pelosi, Schumer and Jeffries have each reportedly warned Biden about their members’ concerns and said that his long odds in November will likely drag down congressional candidates if he stays in the race. The Biden campaign did not reply to a request for comment. Representatives for Hillary and Bill Clinton and Zeke Emanuel, likewise, did not reply to requests for comment from CNBC. A press representative for Ari Emanuel declined to comment. Jones did not return emails seeking comment. Yet Biden’s fundraising collapse does not necessarily spell doom for the party. In an unexpected twist, events that feature Vice President Kamala Harris, Biden’s likely successor should he step aside, have started to sell out. An online seating chart for a concert event with Harris in Pittsfield, Mass. on July 27 shows it is almost entirely sold out. Tickets start at $100 and go up to just over $12,000, according to the invitation. Folk legend James Taylor and cello star Yo-Yo Ma are the headliners.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOn a Tuesday in early July, 75 wealthy Democratic political donors gathered on&#8230;\n\n\nThis Post: Biden urged to drop out by Democratic mega-donors, while Kamala Harris attracts large crowds first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/biden-urged-to-drop-out-by-democratic-mega-donors-while-kamala-harris-attracts-large-crowds/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-07/240718-joe-biden-kamala-harris-2023-ac-707p-cebeb7.jpg","video":null,"publish_date":"2024-07-18 23:41:51","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.45},{"id":252112868,"title":"Lawsuit Alleges ‘Severe Sexual Abuse’ of Migrant Children, Other Violations at Nonprofit Shelters","text":"Employees at the largest shelter provider for unaccompanied migrant children in the U.S. sexually abused and harassed them, the U.S. Department of Justice alleged in a lawsuit. The lawsuit, filed this week in the Western District of Texas, alleges a “pattern” of “severe or pervasive sexual harassment” going back to at least 2015 by multiple workers in the network of shelters run by the Austin, Texas-based Southwest Key. The nonprofit contracts with the federal government to care for migrants arriving in the U.S. without parents or legal guardians. Southwest Key operates 29 shelters that provide temporary housing for unaccompanied children in three states, including California. North County and East County have been locations for shelters operated by the nonprofit, which also has sites in Texas and Arizona under grants from the Department of Health and Human Services. The complaint includes alleged cases of “severe sexual abuse and rape, solicitation of sex acts, solicitation of nude photos, entreaties for sexually inappropriate relationships, sexual comments and gestures.” Southwest Key did not immediately respond to a request for comment. The Justice Department said Southwest Key failed to protect the children in its care and did not consistently follow federal requirements for preventing, detecting and reporting abuse. In a 2022 case detailed in the complaint, a Southwest Key employee allegedly repeatedly sexually abused three girls, ages 5, 8 and 11, at Casa Franklin in El Paso, Texas. The eight-year-old girl said the employee threatened to kill her family if she disclosed the abuse, the complaint alleges. In another case, from 2020, an employee took a 15-year-old boy from Casa Kokopelli in Arizona to a hotel room for several days and paid him for sex acts. In both cases, the abuse was documented in Southwest Key’s own reports, according to the lawsuit. “Sexual harassment of children in residential shelters, where a child should be safe and secure, is abusive, dehumanizing and unlawful,” Assistant Attorney General Kristen Clarke said in a statement on Thursday. Migrant children who arrive at the border unaccompanied are housed by the U.S. government before being released to sponsors in the U.S., usually parents or close relatives. The lawsuit seeks monetary damages to compensate children harmed by the alleged harassment, a civil penalty to vindicate and a court order barring future discrimination and an order requiring Southwest Key to take appropriate steps to prevent it in the future. Individuals who believe that they may have been victims of sexual harassment or abuse at Southwest Key shelters or who have other information that may be relevant to this case, may contact the Justice Department’s housing discrimination tip line at 1-833-591-0291. There have been a record number of migrant crossings during the administration of President Joe Biden, a Democrat running for re-election against Republican Donald Trump. Since fiscal year 2021 through June of this year more than 500,000 unaccompanied minors have arrived at the U.S.-Mexico border, according to U.S. government data. (Reporting by Kristina Cooke and Mica Rosenberg; editing by Marguerita Choy)","summary":"Employees at the largest shelter provider for unaccompanied migrant children sexually abused and harassed them, the federal government alleged.","url":"https://timesofsandiego.com/crime/2024/07/18/lawsuit-alleges-severe-sexual-abuse-of-migrant-children-other-crimes-at-nonprofit-shelters/","image":"https://timesofsandiego.com/wp-content/uploads/2024/07/4_MIGRATION-USA-MINORS-ABUSE1.jpg","video":null,"publish_date":"2024-07-18 23:41:44","author":"Reuters,Southwest Key Programs","authors":["Reuters","Southwest Key Programs"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.357},{"id":252112972,"title":"Norfolk family says they received ‘veiled threat’ for hanging Trump banners","text":"A couple in Norfolk said they returned from vacation Saturday to find what they initially thought was a letter from former President Donald Trump’s campaign. Instead, it was a threat was “full of a lot of hate speech,” Craig Koch said. Norfolk police confirmed they are investigating the letter. The letter, dated July 4, was addressed to Koch and his wife at their Norfolk home. When going through their vacation mail, Koch said they saw the Trump campaign’s logo, including the “Make America Great Again” line, displayed as the return address and at the top of the letter itself. The letter began tamely but quickly targeted the family for the Trump banners on their property. Koch said they have three banners that read “Women for Trump,” “Trump,” and “Trump 2024.” “It was noticed that your signs that are displayed on your garage doors are not in current compliance with MAGA regulations,” the letter’s first paragraph said. “Therefore, you and your family have been reported to the MAGA legal counsel for discipline at a later date, but certainly prior to the November 2024 presidential election.” “In other words, ‘we’re going to make sure your vote never gets counted.’ That’s how we interpreted it,” Koch said. “They’re going to do something to us before the election. It was a threat.” The letter goes on to say that the Kochs should purchase new banners and display the new signage no less than four feet off the ground or on the roof, so “any communist democrat will be sure to see your MAGA signage from afar,” the letter said. The final and longest paragraph of the letter asks the Koch for a $2,500 donation. The letter then said their neighbors in Norfolk and Walpole already consider them “completely fools and idiots” for supporting Trump, “a convicted felon (40+ times), sexual predator, fraudster, liar, wife cheater, bully, and a lot more.” “We are once again canvassing your region in an effort to fleece as many low IQ MAGA members, like yourselves, prior to former President Donald J. Trump’s incarceration in federal prison,” the letter said. “We thank you for your incredible stupidity.” Koch said they opened the letter Saturday before the attempted assassination of Trump at a Pennsylvania rally. “We all have our right to free speech, and we’re not out there telling other people what to do or what to think. We’re just showing our support for a presidential candidate,” Koch said. “I would hope that our neighborhood and our townspeople would support us and hope for the best for us.”","summary":"Craig Koch said he opened a letter that appeared to be from the Trump campaign but was \"full of a lot of hate speech.\"\n\n\nThe post Norfolk family says they received &#8216;veiled threat&#8217; for hanging Trump banners appeared first on Boston.com.","url":"https://www.boston.com/news/local-news/2024/07/18/norfolk-family-says-they-received-veiled-threat-for-hanging-trump-banners/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2024/07/Global_Elections_2024_64683-6699a55e67c9d-768x432.jpg","video":null,"publish_date":"2024-07-18 23:41:14","author":"Molly Farrar","authors":["Molly Farrar"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.189},{"id":252112720,"title":"Trump to speak at final night of Republican National Convention","text":"Trump to speak at final night of Republican National Convention Former President Donald Trump will take center stage at the Republican National Convention in Milwaukee Thursday, delivering a speech he rewrote after Saturday's assassination attempt. His speech comes amid the controversy swirling around President Biden's own reelection run. Robert Costa and Margaret Brennan have more.","summary":"Former President Donald Trump will take center stage at the Republican National Convention in Milwaukee Thursday, delivering a speech he rewrote after Saturday's assassination attempt. His speech comes amid the controversy swirling around President Biden's own reelection run. Robert Costa and Margaret Brennan have more.","url":"https://www.cbsnews.com/video/trump-to-speak-at-final-night-of-republican-national-convention/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/18/a0d0bc35-7b0d-4f3f-ab78-5199e8ed23d5/thumbnail/1200x630/3ae6059606fb30772b63b9d34193e7d4/costabrennan.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d","video":null,"publish_date":"2024-07-18 23:38:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.101},{"id":252112914,"title":"Is JD Vance the key to uniting the GOP? Congressional Republicans weigh in","text":"Since Sen. J.D. Vance (R-OH) became the Republican vice presidential nominee, people have commented on how President Joe Biden, 81, has been in politics longer than Vance, 39, has been alive. In 2016, Donald Trump became president without ever running for office but picked a seasoned politician, Mike Pence, to be his running mate. This time is different. Vance, a freshman senator with only nearly 18 months of office under his belt, is not a traditional pick. As voters’ trust is eroding in the government and career politicians, could a political outsider such as Vance be what unites not only the Republican Party but also moderates to this ticket? “Experience in Washington isn’t necessarily a recipe for success,” Rep. Kat Cammack (R-FL) said. “Our party has shifted away from everybody waits their turn, and it’s now your turn.” Rep. Byron Donalds (R-FL) said. Donalds believes paying your dues in politics is a dated notion and is the reason the Democratic Party is struggling. President Joe Biden ran his first campaign saying he would be a one term president; now he is facing calls to step down due to age and mental acuity. Sen. Marco Rubio (R-FL), who was in the running for vice president, said Vance was a really good choice. “Think about the talent we have in our party that Donald Trump gets to pick from to fill out his administration,” Rubio said. “And the Democrats don’t even know who the nominee is yet.” Cammack compared Vance with Biden’s numerous years of experience. “Biden had 40 years in the Senate, and he hasn’t exactly delivered results that he’s promised.” “I think J.D. Vance will be a great complement to the president,” Gov. Sarah Huckabee Sanders (R-AR) said. “Vance is a powerful story, and I think he’s going to do a really great job connecting with Americans, particularly in the Rust Belt, and really fighting for the American worker, something that’s going to be really important for the November election.” “The reason why we’re a more diverse party, and a younger party than the Democratic Party is because we’re not playing the old political games of waiting your turn,” Donalds said. Donalds added Trump’s picking of Vance signals the party no longer needs to “groom” people into “fully-formed politicians.” “No, our party’s done with that,” Donalds said. “If you can do the job, and you can excel, we want you. Period. Full stop.”","summary":"Since Sen. J.D. Vance (R-OH) became the Republican vice presidential nominee, people have commented on how President Joe Biden, 81, has been in politics longer than Vance, 39, has been alive. In 2016, Donald Trump became president without ever running for office but picked a seasoned politician, Mike Pence, to be his running mate. This [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3089888/is-jd-vance-key-uniting-republican-party-congress-weighs-in/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Trump-Vance-1-scaled.webp","video":null,"publish_date":"2024-07-18 23:35:17","author":"Amy DeLaura","authors":["Amy DeLaura"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.009},{"id":252112728,"title":"Secret Service was aware of suspicious person before Trump took stage, sources say","text":"Secret Service was aware of suspicious person before Trump took stage, sources say U.S. Secret Service was aware of a suspicious person about 20 minutes before he attempted to kill former President Donald Trump during a rally in Pennsylvania on Saturday, three sources from a closed door briefing between lawmakers and federal officials told CBS News. Meg Oliver has the latest.","summary":"U.S. Secret Service was aware of a suspicious person about 20 minutes before he attempted to kill former President Donald Trump during a rally in Pennsylvania on Saturday, three sources from a closed door briefing between lawmakers and federal officials told CBS News. Meg Oliver has the latest.","url":"https://www.cbsnews.com/video/secret-service-was-aware-of-suspicious-person-before-trump-took-stage-sources-say/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/18/4b77e064-3d36-4995-a7bb-f84571b98459/thumbnail/1200x630/d853bc29a7fb91604030be7f4b9fd6db/0718-en-oliver.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d","video":null,"publish_date":"2024-07-18 23:35:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.378},{"id":252112820,"title":"Whole world focused on how does Republican Party and Donald Trump approach future after assassination attempt: US Representative Pete Sessions","text":"US Representative Pete Sessions said that the whole world, not just America, is focused on how the Republican Party and former US President Donald Trump approached the future after the assassination attempt in Pennsylvania’s Butler. Speaking to ANI, Pete Sessions said the Republican Party recognises that there are people who disagree with them and don’t want them to be successful, but stressed that Trump will be a strong voice and the party can overcome this viewpoint. Asked on how the 2024 Republican National Convention looks different, he said, “This is my sixth Republican National Convention and at each one of these conventions, it has been up to our party to speak to the American people. As a result of the things that happened in Butler, Pennsylvania on Saturday, the entire world, not just nation, is focused on how does the Republican Party, and more specifically Donald Trump, our nominee, kind of see it look at and approach the future. I think it’s not with a fight.”“I think it’s with a resolve, a resolve that we do recognize that there are people who disagree with us and even want us to not be successful. I think Donald Trump will be a strong voice for saying we can overcome this viewpoint. We can work together. We can do the things that will be necessary to moving not only this party and this country forward, but the world friendships and opportunity and the way I say it is less fight and more work together. If you work together you can achieve so much but if you find differences that will not work so you can either have fight or you can have opportunity to make it better and I go for a fix side of that equation,” he added. Trump was on stage at a campaign rally on Saturday when gunshots rang out and Secret Service agents stormed the stage. Hours after the shooting, Trump said that the bullet pierced the upper part of his right ear. One of the rally attendees was killed, while two more were critically injured in the shooting. The Federal Bureau of Investigation (FBI) identified the shooter as Thomas Matthew Crooks, 20, from Bethel Park, Pennsylvania. The shooter was killed by the Secret Service agents.The four-day-long conference included high-profile speakers, as well as primetime speech from the presidential candidate Trump. Monday’s theme was “Make America wealthy again”, Tuesday’s was “Make America safe again”, Wednesday’s was “Make America strong again”, and Thursday was “Make America great once again.”He said that Donald Trump will speak about bringing the country together and added that he will be very poised. Asked about his expectations on Donald Trump’s speech at Republican National Convention, Sessions said, “The expectations that I have, and I think almost anybody that listens knows what happened on Saturday. They know that you could come out and be defiant, upset and angry. I think he’s going to talk about bringing the country together.”“I think he’s going to talk about in his mind that he is very clear that there are certainly two sides here, at least an adversaries who do not want to see us or him to be successful. I think he’s going to sell that we can do this together, and I think he will be very poised. I think he’ll be very deliberate and he will be of a focus that a lot of people will recognize we’re all lucky,” he added. US Representative Pete Sessions noted that the Republican Party became united and people chose back starting in March this year when people from Texas and other states on Super Tuesday backed Trump. Asked whether the Republican Party this year is far more united than what it was back in the days, he responded, “I think that our party became united. We had certainly people who had different voices. People chose back home, starting with probably in March of this year, when people from Texas and other states on Super Tuesday overwhelmingly wanted Donald Trump. I think Donald Trump has continued to shape.”Once every four years, each of the two main US parties hosts a convention to formally select the respective White House standard bearer. During the convention, the delegates from each state pledged their support to the candidate of their choice and approve a platform or manifesto. It is merely a formality for Trump as the party’s presumptive nominee because he wants 2265 delegates in the primaries, which is enough for the nomination. US Senator from Ohio, JD Vance, officially accepted the nomination as Donald Trump’s vice-presidential running mate during his keynote speech at the Republican National Convention on Wednesday.“Tonight, Mr. Chairman, I stand here humbly, and I’m overwhelmed with gratitude to say I officially accept your nomination to be Vice President of the United States of America,” Vance said.He hailed Trump in his speech, calling him “tough” and saying that he “cares about people.”He also lauded Trump’s call for unity, saying “my message to you, my fellow Republicans, is we love this country and we are united to win.”“I think our disagreements actually make us stronger,” he added.In his inaugural speech, Vance also addressed the recent assassination attempt on Trump, emphasising the former president’s resilience and dedication to the nation.“Look at that photo of him, defiant, fist in the air. When Donald Trump rose to his feet in that Pennsylvania field, all of America stood with him. And what did he call us to do for our country? To fight. To fight for America,” Vance said of Trump’s move to raise his fist and encourage his rally attendees to “fight.” (ANI)","summary":"The News Mill","url":"https://thenewsmill.com/2024/07/whole-world-focused-on-how-does-republican-party-and-donald-trump-approach-future-after-assassination-attempt-us-representative-pete-sessions/","image":"https://thenewsmill.com/wp-content/uploads/2024/07/whole-world-focused-on-how-does-republican-party-and-donald-trump-approach-future-after-assassination-attempt-us-representative-pete-sessions.jpg","video":null,"publish_date":"2024-07-18 23:34:36","author":"ANI","authors":["ANI"],"language":"en","catgory":"politics","source_country":"in","sentiment":-0.054},{"id":252112384,"title":"[Graphic News] History of US presidential assassination attempts","text":"In the lead-up to the US presidential election on Nov. 5, Donald Trump was shot by a gunman during a campaign rally in Pennsylvania on July 13. The bullet pierced through the upper part of Trump’s right ear, but he escaped assassination. He appeared two days later at the Republican National Convention with a bandaged ear. Shown here is a look back at some other assassination attempts on US presidents.","summary":"In the lead-up to the US presidential election on Nov. 5, Donald Trump was shot by a gunman during a campaign rally in Pennsylvania on July 13. The bullet pierced through the upper part of Trump&rsquo;s right ear, but he escaped assassination. He appeared two days later at the Republican National Convention with a bandaged ear. Shown here is a look back at some other assassination attempts on US presidents.","url":"https://www.koreaherald.com/view.php?ud=20240718050779","image":"https://res.heraldm.com/content/image/2024/07/18/20240718050821_0.gif","video":null,"publish_date":"2024-07-18 23:34:05","author":"Nam Kyung-Don","authors":["Nam Kyung-Don"],"language":"en","catgory":"politics","source_country":"kr","sentiment":-0.516},{"id":252112862,"title":"Pelosi backed lawmaker urging Biden to quit race, source says","text":"WASHINGTON >> Former House Speaker Nancy Pelosi has told President Joe Biden she believes he cannot win the Nov. 5 election and backed California lawmaker Adam Schiff’s call for him to step aside, a top White House source with direct knowledge of the matter said. But a source close to Pelosi — one of the most influential members of Biden’s Democratic Party — said that Schiff’s comments “came as news” to the former speaker and that he did not consult with Pelosi before making his concerns public. A spokesman for the former speaker did not address Schiff’s comments or what Pelosi told Biden. “Speaker Pelosi respects the confidentiality of her meetings and conversations with the President,” a spokesman said in a statement. “Sadly, the feeding frenzy from the press based on anonymous sources misrepresents any conversations the Speaker may have had with the President.” Schiff said in a statement on Wednesday that he has “serious concerns” about whether Biden can defeat Republican challenger Donald Trump, the first Democrat to come out after the Saturday assassination attempt against the former president. Biden’s campaign had hoped the shooting, in which a bullet grazed Trump’s ear, would tamp down calls for him to step aside in the 2024 race before Schiff’s statement. “Nancy is all over this. She doesn’t miss. Schiff wouldn’t move without her approval,” said the White House source, who spoke on condition of anonymity. Pelosi is “convinced public sentiment is against POTUS (president of the United States) and he can’t change it,” the source added. Pelosi and Schiff, a former chair of the House intelligence committee, both represent California districts in the House. The White House declined to comment. Biden’s deputy campaign manager, Quentin Fulks, said there were no plans to replace him as the Democratic nominee for the Nov. 5 election. Biden “is not wavering on anything. The president has made his decision,” Fulks said in Milwaukee on Thursday. Some Democratic lawmakers in the House and Senate have called on Biden to step aside in the race after a shaky debate performance raised questions about his fitness for the job at age 81. A Democratic aide said that Pelosi’s main “unofficial” political role for some 25 years had been to work to ensure that Democrats have a majority in the House, a chamber now narrowly controlled by Republicans. Biden’s standing among voters in swing districts based on opinion polls would make retaking the House “not a tenable situation,” the aide said. Pelosi likes to quote from a speech by former President Abraham Lincoln in leadership meetings, the White House source noted. In the speech, Lincoln said, “With public sentiment, nothing can fail; without it nothing can succeed.” The source said the push from top Democratic leaders had raised the question of whether Biden will stay in the race: “I hadn’t seen a single crack from him but now who knows?” “There is a path” to victory “but it’s going to be hard. It will not be easy for Kamala,” the source added, referring to Vice President Kamala Harris, who potentially would replace Biden as the Democratic presidential nominee.","summary":"WASHINGTON >> Former House Speaker Nancy Pelosi has told President Joe Biden she believes he cannot win the Nov. 5 election and backed California lawmaker Adam Schiff&#8217;s call for him to step aside, a top White House source with direct knowledge of the matter said.","url":"https://www.staradvertiser.com/2024/07/18/breaking-news/pelosi-backed-lawmaker-urging-biden-to-quit-race-source-says/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_2024-07-18T134444Z_1512332958_RC2CJ6A4Y3WT_RTRMADP_3_USA-ELECTION-BIDEN-PELOSI.JPG","video":null,"publish_date":"2024-07-18 23:34:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.289},{"id":252112596,"title":"Hunter Biden (center) was convicted in Delaware in June on federal gun charges in a historic first criminal prosecution of the child of a sitting US president","text":"Hunter Biden (center) was convicted in Delaware in June on federal gun charges in a historic first criminal prosecution of the child of a sitting US president | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Hunter Biden (center) was convicted in Delaware in June on federal gun charges in a historic first criminal prosecution of the child of a sitting US president Anna Moneymaker Tags Partners/afp As featured on Hunter Biden seeks case dismissals using Trump legal argument US President Joe Biden's son Hunter asked federal judges on Thursday to toss out gun and tax cases filed against him, citing a legal argument made by Donald Trump. Facebook Twitter WhatsApp SMS Email Print Save Liberation 80th Gallery Honoring war victims, survivors at Hasso Inalåhan WWII survivors Manibusan, Paulino are 80th Liberation Day Parade grand marshals Guam WWII liberator Marine Cpl. Frank Wright, 99, addresses Guam residents Guam's war liberator, war survivors meet 80 years later Residents get coveted parade route camping permits Latest E-Edition Pacific Daily News Pacific Daily News Video Updates WWII survivors Manibusan, Paulino are 80th Liberation Day Parade grand marshals Jul 17, 2024 Trending Now Man charged in Dededo hit-and-run that killed pregnant woman $20.29 is average hourly pay on Guam, report says Naval Base Guam implements revised Trusted Traveler program by July 24 Man charged in string of burglaries at Finegayan Elementary School Woman on pre-trial release faces new drug charge Local Events","summary":"Hunter Biden (center) was convicted in Delaware in June on federal gun charges in a historic first criminal prosecution of the child of a sitting US president","url":"https://www.guampdn.com/news/national/hunter-biden-center-was-convicted-in-delaware-in-june-on-federal-gun-charges-in-a/image_a251c555-949f-5522-bd5c-24acdfc8bf35.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/a/25/a251c555-949f-5522-bd5c-24acdfc8bf35/6699a590939a9.image.jpg?crop=378%2C378%2C67%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-07-18 23:25:56","author":"Anna Moneymaker","authors":["Anna Moneymaker"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.187},{"id":252112458,"title":"I Spent Days Roaming the Republican National Convention. This Is What I Saw.","text":"Days after the attempted assassination of Donald Trump, Republicans arrived to Milwaukee to renominate him for president—and, by all accounts, to toast to their odds for November. The party atmosphere pervaded the event, even as largely placid protestors gathered outside the compound and darker messages took hold in each evening’s speeches. Below, some background scenes from my days roaming the Republican National Convention. Read all of Slate’s coverage of the 2024 Republican National Convention.","summary":"The bizarrely jubilant MAGA coronation, in photos.","url":"https://slate.com/news-and-politics/2024/07/donald-trump-rnc-convention-speech-kai-vance.html?via=rss","image":"https://compote.slate.com/images/d0422f31-8f55-4e4b-b9a4-fc737e8238e6.jpeg?crop=1533%2C1022%2Cx0%2Cy448&width=1200","video":null,"publish_date":"2024-07-18 23:24:48","author":"Aymann Ismail","authors":["Aymann Ismail"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.494},{"id":252113108,"title":"What happens next if Biden drops out of the presidential race","text":"President Joe Biden is under siege from within his own party, as more Democrats — in private and in public — urge him to end his reelection bid in the wake of his damaging debate against Donald Trump. Biden's efforts to shore up confidence in his candidacy have failed to close the growing rift between him and his party. And while he has so far roundly rejected the calls to step aside, Biden said Tuesday that should a \"medical condition\" emerge, it could force him to rethink his decision to stay in the race. On Wednesday, Biden, 81, tested positive for Covid-19. His doctors say his symptoms are mild. Realistically, the only way to replace Biden at the top of the Democratic ticket at this stage in the campaign cycle is if he agrees to drop out voluntarily, or if he dies or suffers a \"disability.\" After breezing through the primary virtually unopposed, Biden has won almost all of his party's 4,000-plus delegates, who are selected in large part because of their loyalty and support for their chosen candidate. Those delegates are set to vote for their presidential nominee in a virtual roll call in early August, before the Democratic National Convention. If Biden ends his campaign before voting begins, the pledged delegates could cast their ballots for a new candidate. According to the DNC rules, If no candidate won a majority on that first ballot, then the more than 700 \"superdelegates\" could join in subsequent votes. The voting would then continue until one candidate won a simple majority of delegates. If Biden were to die, resign or suffer a \"disability\" after the convention adjourned on Aug. 22, then the Democratic National Committee chair — currently Jaime Harrison — would confer with top congressional Democrats and the Democratic Governors Association about a replacement, per the party rules. Harrison would then report to the committee, which \"is authorized to fill the vacancy.\"","summary":"Biden's campaign crisis has put a spotlight on Vice President Kamala Harris, who is widely viewed as the likeliest choice to replace him.","url":"https://www.cnbc.com/2024/07/18/biden-drops-out-what-happens-next.html","image":"https://image.cnbcfm.com/api/v1/image/107432366-1719245191902-gettyimages-2157930600-AFP_34XZ93L.jpeg?v=1721324333","video":null,"publish_date":"2024-07-18 23:23:25","author":"Kevin Breuninger","authors":["Kevin Breuninger"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.016},{"id":252112134,"title":"Trump to accept Republican nomination amid turmoil over Biden's fate","text":"Donald Trump will formally accept the Republican presidential nomination on Thursday, at a time when his Democratic rival Joe Biden is struggling to fight off more doubts about his ability to run a successful campaign and serve another four-year term. Trump will deliver a speech to a packed arena of Republicans in Milwaukee before the party concludes its four-day national convention. When accepting his third consecutive presidential nomination from the party, just days after surviving an assassination attempt during a rally, Trump is expected to call for national unity to make the United States stronger and more prosperous. The 78-year-old former president is expected to present his often-heard narrative that the country was in a far better position, both domestically and internationally, when he was in office than at present under the Biden administration. He is likely to slam China for stealing American jobs through what he views as unfair trade practices, while casting himself as a guardian of forgotten communities across the United States. All the Republican convention fanfare, which will culminate with Trump's speech, comes as more Democrats have joined the mounting calls for Biden to drop out of the race for the November presidential election. The 81-year-old president has been under intense scrutiny over his physical and mental fitness since his shaky performance in a television debate with Trump in late June. But the pressure Biden is facing now seems much stronger after U.S. media reports that Democratic leaders, including former House of Representatives Speaker Nancy Pelosi, have privately told him their concerns about his ability to defeat Trump and that their party is at risk of failing to regain control of the lower chamber. The Washington Post and other leading U.S. media outlets said former President Barack Obama, a close ally of Biden, has also told associates in recent days that the likelihood of the incumbent winning the election has greatly diminished. In contrast to the show of unity among Republicans, there have been widening divisions among Democrats, although Biden has been the presumptive nominee for months after cruising through the party's primaries with little opposition and its national convention in Chicago is just a month away. Related coverage","summary":"MILWAUKEE, WISCONSIN - Donald Trump will formally accept the Republican presidential nomination on Thursday, at a time when...","url":"https://english.kyodonews.net/news/2024/07/8dda79d23fff-trump-to-accept-republican-nomination-amid-turmoil-over-bidens-fate.html","image":"https://img.kyodonews.net/english/public/images/posts/2ef3ff63c4cd5cc5853484558b7973e6/cropped_image_l.jpg","video":null,"publish_date":"2024-07-18 23:23:05","author":null,"language":"en","catgory":"politics","source_country":"jp","sentiment":0.038},{"id":252112436,"title":"Key takeaways from JD Vance's RNC speech","text":"Key takeaways from JD Vance's RNC speech Vice President Harris spoke Thursday morning, criticizing the Republican National Convention's messaging and her newly nominated opponent, Sen. JD Vance, who gave his first major speech Wednesday night after being announced as former President Donald Trump's running mate. CBS News chief Washington correspondent Major Garrett joins with analysis.","summary":"Vice President Harris spoke Thursday morning, criticizing the Republican National Convention's messaging and her newly nominated opponent, Sen. JD Vance, who gave his first major speech Wednesday night after being announced as former President Donald Trump's running mate. CBS News chief Washington correspondent Major Garrett joins with analysis.","url":"https://www.cbsnews.com/video/jd-vance-rnc-speech-key-takeaways/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/18/a34b06a5-7233-42b7-ace7-69e07063e24e/thumbnail/1200x630/2c7ea024ccad6b707b0251db3e4ef253/cbsn-fusion-jd-vance-rnc-speech-key-takeaways-thumbnail.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d","video":null,"publish_date":"2024-07-18 23:23:00","author":null,"language":"en","catgory":"sports","source_country":"US","sentiment":0.615},{"id":252113540,"title":"Strategists say Biden has a big opportunity to upstage Trump’s convention speech","text":"President Joe Biden dropping out of the presidential race seems all but inevitable amid mounting pressure from party leaders, and some experts want to see him do it right before Donald Trump takes to the Republican National Convention stage tonight to steal the limelight. Trump is scheduled to give the RNC keynote address shortly after 9 p.m. and several experts say that could be the perfect time for Biden to make the big announcement. George State University law professor Anthony Michael Kreis wrote on X that Biden would be “an absolute icon,” if he bowed out right before Trump’s speech begins. Writer Parker Molloy says preempting Trump’s speech would, “just render the entire speech outdated right before he gives it.” “If Biden's going to drop out, he should 100% do it like 5 minutes before Trump speaks tonight,” Molloy wrote on X. National Review writer Jeff Blehar hoped it would happen smack dab in the middle of Trump’s speech. “Biden choosing to officially drop out during the middle of Trump's speech would be the revenge Trump deserves for planning in advance to run 90 minutes long,” Blehar wrote on X. “May as well make an impact instead of doing it on a random slow news day,” wrote another X user.","summary":"President Joe Biden dropping out of the presidential race seems all but inevitable amid mounting pressure from party leaders, and some experts want to see him do it right before Donald Trump takes to the Republican National Convention stage tonight to steal the limelight.\n\nTrump is scheduled to give the RNC keynote address shortly after 9 p.m. and several experts say that could be the perfect time for Biden to make the big announcement.\n\nGeorge State University law professor Anthony Michael Kreis wrote on X that Biden would be “an absolute icon,” if he bowed out right before Trump’s speech begins.\n\nWriter Parker Molloy says preempting Trump’s speech would, “just render the entire speech outdated right before he gives it.”\n\n“If Biden's going to drop out, he should 100% do it like 5 minutes before Trump speaks tonight,” Molloy wrote on X.\n\nNational Review writer Jeff Blehar hoped it would happen smack dab in the middle of Trump’s speech.\n\n“Biden choosing to officially drop out during the middle of Trump's speec","url":"https://www.alternet.org/strategists-biden-convention-speech/","image":"https://www.alternet.org/media-library/image.jpg?id=52895755&width=1200&height=600&coordinates=0%2C0%2C0%2C171","video":null,"publish_date":"2024-07-18 23:21:23","author":"Leigh Tauss,Raw Story","authors":["Leigh Tauss","Raw Story"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.25},{"id":252112092,"title":"JD Vance says the Republican Party is becoming pro-worker. But tonight, the RNC will feature a union buster","text":"The ascension of JD Vance, first to the Senate and now asDonald Trump’s running mate, is a story that’s as much about what the Republican Party does not represent as it is a story about the GOP’s evolution. Wednesday night at the Republican National Convention (RNC) in Milwaukeewas wholly oriented around Trump’s vice president. In Vance, Trump has chosed an economic populist as his partner — a strategic pick aimed at shoring up support in key areas of the Rust Belt, and other communities where manufacturing and energy are critical. Vance, a one-term senator from Ohio, has been in the Senate for just a year and a half. In that time, he staked out his position as a clear outlier from the conservative mainstream with actions including an appearance on a United Autoworkers picket line and support for a railworkers union’s bargaining efforts over paid sick leave. It’s clear that Donald Trump wants to capture some of that energy. Whether he can convince voters, while much of his party remains publicly skeptical of Vance’s positions, is another story. If the final night’s programming at the RNC is any indication, that dispute is not going away any time soon. Thurday night’s primetime speaker list features, among others like Hulk Hogan and Trump himself, a famous union-buster: World Wrestling Entertainment (WWE) co-founder Linda McMahon, with her husband. A two-time losing Senate candidate in the 2010s, McMahon is a prime example of the GOP’s internal struggle over labor issues. She’s not just a Trump supporter, she served in his administration as head of the Small Business Administration. In a second Trump term, she could be a key voice advising on issues of economic policy, and therein lies the problem for the populists. That problem? She’s overtly opposed to many of the policies and progress made by America’s labor movement, including raising the minimum wage, which she has said could even be lowered. McMahon is responsible for directing the WWE’s efforts to kill a union drive led by none other than former wrestler-turned-governor Jesse Helms, before his entrance into politics. She also fought back hard against one of the most pressing issues in sports: the public campaign to protect athletes from injury. During her Senate confirmation hearing in 2017, the Washington Post reported that McMahon “was instrumental in convincing state legislatures that professional wrestling should be treated as entertainment instead of as a sport. As a result, WWE bypassed safety regulations.” The Independent has contacted McMahon to inquire whether she still holds these views, and if she expects a political appointment if Trump is re-elected. Vance, 39, is one of the fastest-rising stars in the Republican Party. His selection as Trump’s running mate was a massive coup over two others from the party’s more labor-hostile wing: Senators Tim Scott and Marco Rubio. Both also spoke at the RNC this week. In Vance’s speech on Wednesday, he inferred that a Trump administration would stand up for union workers, while also taking a cue from populists on the left who have railed against corporate greed. “We need a leader who’s not in the pocket of big business, but answers to the working man, union and nonunion alike. A leader who won’t sell out to multinational corporations, but will stand up for American companies and American industry,” Vance said. “We’re done, ladies and gentlemen, catering to Wall Street. We’ll commit to the working man.” But in the end, it may be Vance who ends up evolving his views, rather than the rest of the GOP establishment. Signs of Vance’s shifting position were already playing out in Washington. A day before he was announced as Trump’s running mate, the Ohio senator quietly dropped his support for a bill he had co-sponsored, which would have lowered credit card transaction fees for merchants, including small businesses and restaurants. Despite the senator blaming Visa and Mastercard last year for their “stranglehold” on the credit card industry harming workers, Rep. Andy Barr, member of the House Financial Services Committee, told Politico this week that Vance was backing away from his “misguided” opinion.","summary":"Trump’s veep pick has staked out his position as a clear outlier from the conservative mainstream with pro-union actions. Will it last?","url":"https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-union-linda-mcmahon-rnc-b2582341.html","image":"https://static.independent.co.uk/2024/07/18/10/newFile-2.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/wxdVE4mY-4VHSaSK0.mp4","publish_date":"2024-07-18 23:18:12","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.386},{"id":252112266,"title":"‘The View’ Blasts Nikki Haley for Backing Trump at RNC: ‘She’s Not the Only One’","text":"In a heated argument on The View, the panel did not mince words for former South Carolina Governor Nikki Haley. Haley, who had previously been a vocal critic of Donald Trump during the GOP primaries, made headlines with her full-throated endorsement of the former president during her speech at the Republican National Convention (RNC). The co-hosts of The View, specifically Joy Behar, slammed Haley for what they saw as a blatant reversal of her earlier stance and a desperate bid to align herself with Trump’s base. The most scorching comments came from Behar, who described Haley’s endorsement as ‘pathetic’ and ‘disheartening.’ As per Mediaite, Behar argued, “Now she’s given permission for her to have people to vote for him when they might have stayed home and voted for Biden.” Sunny Hostin chimed in, questioning, “Are you surprised?” To which Behar answered, “No I’m not. But I mean, she’s not the only one. They all up there kissing the ring of dear leader.” Whereas, Whoopi Goldberg added, “Not the ring they’re kissing.” Hostin highlighted, “They all, though, Joy said, most of them, except, I think for Chris Christie, that they would get behind Donald Trump if he were the nominee and they are sticking to their word. They’re getting in line, they’re circling their wagons.” The discussion took a more personal turn as Behar and Hostin highlighted the apparent hypocrisy of other prominent Republicans who have similarly aligned with Trump despite past conflicts. Behar noted, “So DeSantis doesn’t care that he insinuated he was a pedophile doesn’t care? Cruz doesn’t care that he said his wife was ugly?” Hostin explained, “They care about their party and power before their country. And that is very, very clear.” Behar further added, “No, I think I think they’re addicted to their power. It’s an addiction. You have to have an addiction. I have an addiction to Scrabble, okay? And I understand an addiction from that point of view. You don’t want to give it up and they’re addicted. They shouldn’t have term limits. They should not be there forever and ever and ever.” As per EW, Alyssa Farah Griffin, who had once worked as a communications associate in Trump’s White House, also expressed her disappointment in Haley. Griffin had previously supported Haley when she was a challenger to Trump but felt let down by her recent actions. She said, \"If I may say, my most disappointing moment of Nikki Haley last night was she had an opportunity to say why America needs to stand with our allies on the world stage, to counteract [Trump's V.P. pick] J.D. Vance…And she didn't do it. I know that's something she deeply believes in, and it was a missed opportunity.\" Haley’s speech at the RNC was positioned as a call for unity within the party, with Haley stating, \"In the name of unity…I'll start by making one thing perfectly clear: Donald Trump has my strong endorsement, period. You don't have to agree with Trump 100 percent of the time to vote for him. Take it from me. I haven't always agreed with President Trump, but we agree more often than we disagree.\"","summary":"Behar remarked, &#34;I think they’re addicted to their power. It’s an addiction. You have to have an addiction. I have an addiction to Scrabble, okay?&#34;","url":"https://www.inquisitr.com/the-view-blasts-nikki-haley-for-backing-trump-at-rnc-shes-not-the-only-one","image":"https://dab57h0r8ahff.cloudfront.net/705791/uploads/62a98c60-44db-11ef-ba73-b1d3c1f3853b_1200_630.jpeg","video":null,"publish_date":"2024-07-18 23:16:00","author":"INQUISITR,Ishita Sen Gupta","authors":["INQUISITR","Ishita Sen Gupta"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.293},{"id":252112184,"title":"RNC Showcases Party Remade by Trump","text":"MILWAUKEE—The 2024 Republican National Convention has been a study in contrast and concord. Former President Donald Trump, a brash New York real estate mogul, may seem like a foil to Ivy League-educated Sen. JD Vance (R-Ohio) who hails from the Rust Belt. Amber Rose, another reconstructed critic of the president, and Teamsters leader Sean O’Brien also stood out from the RNC norm—at least that of Sen. Mitt Romney (R-Utah) or former President George W. Bush. Yet, for all the variety, it seems the Grand Old Party has unified after an assassination attempt on former President Trump. That unity is hard to separate from the former president and his “Make America Great Again” movement, one that has broken down old walls between ideologies. MAGA favorites like Kari Lake and Peter Navarro were greeted with loud applause in the Fiserv Forum. Only figures such as Senate Minority Leader Mitch McConnell (R-Ky.) and former House Speaker Kevin McCarthy (R-Calif.), unpopular among the former president’s base, faced hostility—in Mr. McCarthy’s case, from his foe and Trump ally Rep. Matt Gaetz (R-Fla.), who initiated the former speaker’s ouster last October. “I feel bad for that as a Kentuckian,” Harvey VanHook, a local Republican official in the state, told The Epoch Times of the boos aimed at Mr. McConnell. Mr. Romney and former President Bush, avatars of an earlier Republican Party, were among those conspicuously absent. Rep. Tim Burchett (R-Tenn.) told The Epoch Times that a previous generation of Republican leaders had embroiled the United States in wars, saying they “got us killed.” John Mowery, an Alaska delegate, told The Epoch Times that the former president’s “America First agenda” set him apart from the old establishment. “I think this is about creating stability in the party,” said North Dakota state Sen. Judy Estenson. She told The Epoch Times that as a delegate at the 2016 convention, she had used her vote to back Sen. Ted Cruz (R-Texas). Today, though, she thinks the former president has proven himself. In his July 17 acceptance speech, Mr. Vance meditated on trade, needless war, and illegal immigration, arguing that America is a nation, not merely an idea. The Marine veteran, Yale Law graduate, and conservative intellectual told his heartland story, connecting with the RNC crowd. For all that sets him apart from the former president, Mr. Vance looked every bit the MAGA heir, including through his comments critical of high finance. “When JD said something negative about Wall Street, I could just hear the country club Republicans looking for another party,” Mr. Burchett said. Franklin Graham of the Billy Graham Evangelistic Association, a speaker on July 18, may have been selected to assuage those concerns. The convention provided a contrast to President Joe Biden’s candidacy, which has been questioned by some Democrats. As Republicans who squabbled throughout this Congress coalesce around their leader, once-unified Democrats appear to show signs of a splinter ahead of their August convention, which could follow a virtual nomination procedure earlier in the month. During a July 18 press conference elsewhere in Milwaukee, Biden campaign manager Quentin Fulks stressed that the commander-in-chief “is and will be the Democratic nominee.” Yet, in question after question, reporters dwelled on confirmed or rumored defections among top Democrats. Near the perimeter of the RNC, trucks paid for by the Democratic National Committee drove around blaring advertising against Mr. Vance and former President Trump. Dueling political billboards lined the highways through town.","summary":"Republicans have roundly united behind the former president who has transformed the party under his platform.","url":"https://www.theepochtimes.com/us/rnc-showcases-party-remade-by-trump-5689363","image":"https://img.theepochtimes.com/assets/uploads/2024/07/16/id5687745-07152024-DSC01322-RNC-2024-Trump-Vance-Donalds-300x180.jpg","video":null,"publish_date":"2024-07-18 23:15:48","author":"Nathan Worcester","authors":["Nathan Worcester"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.019},{"id":252113884,"title":"Democratic megadonors push Biden to quit race, as Kamala Harris events fill up","text":"On a Tuesday in early July, 75 wealthy Democratic political donors gathered on a Zoom call to discuss the path forward for President Joe Biden after his calamitous debate performance against Donald Trump, according to a person on the call. Only one of the donors said they thought Biden should stay in the race, this person said. All the others made it very clear that they believed Biden needed to drop out of the race, if the party wanted to defeat Trump in November. People who spoke to CNBC for this story were granted anonymity to speak freely about a sensitive matter. Since then, big money donors who fund either the Biden campaign, his allied political action committees or the party at large have launched a lobbying campaign aimed at senior Democrats in both the House and Senate. Their goal is to convince lawmakers to publicly call on Biden to end his reelection campaign, according to over half a dozen people familiar with the matter. Many of these donors laid their positions out in stark terms: If Biden refused to drop out, they would not be giving money to help his reelection until polls showed that he was a clear favorite to beat Trump. Donors who have made these types of calls to Democrats on Capitol Hill include Hollywood executive Ari Emanuel, his brother Zeke Emanuel and Alan Jones, a senior managing director at Intermediate Capital Group and a longtime Democratic party donor, two people familiar with the matter explained. The effort set off a scramble by some of Biden’s allies to keep donors on the president’s team. Former Secretary of State Hillary Clinton, her husband former President Bill Clinton and Biden campaign co-chair and media mogul Jeff Katzenberg have all made pleas to donors, asking them to stick with Biden, according to people briefed on the matter. Biden has repeatedly said he has no plans to drop out of the race, despite over 20 members of Congress publicly calling on him to “pass the torch,” with many more doing so in private. “I think almost every donor at this point has publicly or privately expressed their deep concern to the campaign team, to former House Speaker Nancy Pelosi, Senate majority leader Chuck Schumer and House Minority Leader Hakeem Jeffries,” said one longtime Biden bundler. “While Biden doesn’t really care what donors think, the leadership does, because of the impact down ballot,” the bundler added. Pelosi, Schumer and Jeffries have each reportedly warned Biden about their members’ concerns and said that his long odds in November will likely drag down congressional candidates if he stays in the race. The Biden campaign did not reply to a request for comment. Representatives for Hillary and Bill Clinton and Zeke Emanuel, likewise, did not reply to requests for comment from CNBC. A press representative for Ari Emanuel declined to comment. Jones did not return emails seeking comment. Yet Biden’s fundraising collapse does not necessarily spell doom for the party. In an unexpected twist, events that feature Vice President Kamala Harris, Biden’s likely successor should he step aside, have started to sell out. An online seating chart for a concert event with Harris in Pittsfield, Mass. on July 27 shows it is almost entirely sold out. Tickets start at $100 and go up to just over $12,000, according to the invitation. Folk legend James Taylor and cello star Yo-Yo Ma are the headliners.","summary":"Wealthy Democratic political donors gathered on a Zoom call to discuss the path forward for President Joe Biden after the debate against Donald Trump.","url":"https://www.nbcnews.com/politics/2024-election/democratic-megadonors-push-biden-quit-race-kamala-harris-events-fill-rcna162633","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-07/240718-joe-biden-kamala-harris-2023-ac-707p-cebeb7.jpg","video":null,"publish_date":"2024-07-18 23:12:58","author":"Brian Schwartz,CNBC","authors":["Brian Schwartz","CNBC"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.45},{"id":252111912,"title":"Odds of Joe Biden Dropping Out of Race Hit All Time High","text":"The odds of President Joe Biden dropping out of the 2024 presidential election have reached an all time high, according to bookmakers.Calls for Biden to drop out of the race have been intensifying since a widely-panned performance against former President Donald Trump last month. While Biden has publicly vowed to remain the presumptive nominee, several recent reports have suggested that his stance may have shifted in recent days.Predictive betting website Polymarket listed the likelihood that \"Biden drops out of the presidential race\" at 90 percent at 6:07 p.m. on Thursday, the highest number since the proposition bet was introduced last September.The odds of Biden leaving the race previously shot up from 33 percent to 69 percent on Wednesday, just after the White House announced that the president had tested positive for COVID-19.Although Polymarket allows international users to place \"yes\" or \"no\" bets on propositions that predict world events, betting on politics is illegal for U.S. gamblers.Intense media focus on Biden's uncertain candidacy had faded somewhat following Saturday's failed assassination attempt on Trump and this week's Republican National Convention.However, the incumbent president's COVID diagnosis has seemingly placed him squarely back in the spotlight, with several additional sitting Democratic lawmakers adding their voices to public calls for the president to step aside in recent days.Newsweek reached out for comment to the Biden campaign via email on Thursday evening.This is a developing story and will be updated as more information becomes available.","summary":"Biden has faced growing pressure to drop his reelection bid since his June 27 debate with former President Donald Trump.","url":"https://www.newsweek.com/odds-joe-biden-dropping-out-race-hit-all-time-high-1927327","image":"https://d.newsweek.com/en/full/2432014/joe-biden-drop-out-election-betting-odds.jpg","video":null,"publish_date":"2024-07-18 23:12:31","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","source_country":"US","sentiment":-0.352},{"id":252111742,"title":"Republicans Break With MAGA Influencers Over Racist Attacks on Usha Vance","text":"Several Republican delegates have denounced the racist comments made by MAGA influencers against Senator JD Vance's wife, Usha Vance.The daughter of Indian immigrants, she was raised in San Diego before meeting her husband at Yale Law School. They were married in 2014 and later blessed by a Hindu pandit in a separate ceremony, The New York Times reported.Former President Donald Trump named JD Vance as his running mate on Monday. Usha Vance gave a brief speech and introduced her husband at the Republican National Convention in Milwaukee on Wednesday.After Trump made his vice presidential announcement, several far-right figures have voiced racist comments about Usha Vance online because of her Indian heritage and have assumed that her influence on Vance's political career could mean that the Republican Party will be softer on immigration.White supremacist Nick Fuentes, far-right activist Jaden McNeil and conservative commentator Stew Peters are among those who hurled the racist comments about her.Several Republican delegates spoke in favor of Usha Vance's speech and her marriage to JD Vance when interviewed by Newsweek at the RNC on Thursday.\"We're not here to be negative,\" Georgia delegate Pam Lightsey told Newsweek. \"We're here to take back our country, and [MAGA influencers] need to get on the train or watch it go by.\"Gwilym McGrew, delegate from Ventura County, California, said he thought Usha Vance seemed \"quite accomplished\" and that her speech was \"pretty good.\"When asked about the racist comments, he said, \"I think you could go anywhere online and find something said about anybody you know, by anybody else,\" before adding that he hadn't seen or heard any racist comments about Usha Vance while attending the RNC.Sharon Lloyd, delegate from Arkansas, told Newsweek that it was clear Usha Vance loved her husband.\"I like to see that kind of thing. I like to see a wife that adores her husband, and you could tell that she adored him and that he adored her,\" she said. \"And that's nice.\"When asked about the racist comments seen online, Lloyd said: \"I'm a Christian first, and I don't believe God sees color. If that's the woman [JD Vance] fell in love with and she fell in love with him, then more power to him. I just don't believe that race should make a point at all. That does not bother me at all.\"\"You fall in love with someone that has your likes and your dislikes, someone that you adore and that's obvious what has happened,\" she added. \"So I love it. I hate it that the conservatives are doing the racist thing. That's crazy.\"","summary":"Far-right influencers have made racist comments about JD Vance's wife, Usha, after Vance was named Trump's running mate.","url":"https://www.newsweek.com/republicans-break-maga-influencers-over-racist-comments-usha-vance-1927326","image":"https://d.newsweek.com/en/full/2431976/republicans-break-maga-influencers-usha-vance.jpg","video":null,"publish_date":"2024-07-18 23:11:22","author":"Anna Skinner","authors":["Anna Skinner"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.228},{"id":252112038,"title":"Harris hits the campaign trail under spotlight as Biden faces mounting pressure to drop out","text":"Biden, who is currently self-isolating in Delaware after testing positive for Covid-19 Wednesday, has persistently rejected calls to drop out. But his campaign has quietly begun assessing the viability of a Harris-led ticket, polling the vice president's chances in a head-to-head race against former President Donald Trump, a source told NBC News last week. A new national CBS/YouGov poll of likely voters shows the Republican presidential nominee with a 5-point lead over Biden, 52% to 47%, while in a hypothetical match-up, Trump leads Harris by 3 points, 51% to 48%. Both results of the poll, which was conducted after Saturday's attempted assassination of Trump, are within the margin of error. In her remarks Thursday, which were broadcast live by MSNBC, CNN and Fox News, Harris responded to Republican VP nominee JD Vance's speech Wednesday night at the Republican National Convention. \"He did not talk about Project 2025, their 900-page blueprint for a second Trump term,\" Harris said, referencing the policy plans developed by The Heritage Foundation, a conservative think tank. \"He did not talk about it because their plans are extreme, and they are divisive.\" \"In recent days, they've been trying to portray themselves as the party of unity. Here's the thing: If you claim to stand for unity, you need to do more than just use the word,\" Harris said. \"You cannot claim you stand for unity if you are pushing an agenda that deprives whole groups of Americans of basic freedoms, opportunity and dignity.\"","summary":"Biden is currently self-isolating in Delaware after testing positive for Covid-19 on Wednesday.","url":"https://www.cnbc.com/2024/07/18/spotlight-on-harris-while-biden-faces-pressure-to-drop-out.html","image":"https://image.cnbcfm.com/api/v1/image/108008532-17213300212024-07-18t190756z_1986166025_rc2ux8agpxyv_rtrmadp_0_usa-election-harris.jpeg?v=1721330060","video":null,"publish_date":"2024-07-18 23:10:46","author":"Josephine Rozzelle","authors":["Josephine Rozzelle"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.473},{"id":252111616,"title":"Trump and Vance will expand trade barriers beyond tech: analysts","text":"WASHINGTON -- Another Donald Trump presidency, but with J.D. Vance by his side this time, would harden the U.S.'s stance on economic nationalism as trade barriers expand beyond Chinese access to technology, corporate advisers and analysts said. Republican vice presidential candidate Vance's acceptance speech on Wednesday, in which he vowed to focus on the working man and not Wall Street, has shed light on a potential Trump-Vance administration. His blending of domestic economic policy and foreign policy is expected to have major implications for China. On Thursday, think tanks and corporate consultancies in Washington scrambled to assess the implications of the choice of the Ohio senator and his acceptance speech.","url":"https://asia.nikkei.com/Politics/U.S.-elections-2024/Trump-and-Vance-will-expand-trade-barriers-beyond-tech-analysts","image":"https://cms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com/images/9/9/6/2/47992699-3-eng-GB/Cropped-17213321852024-07-18T034403Z_1169155490_HP1EK7I0ADCMH_RTRMADP_3_USA-ELECTION-REPUBLICANS-CONVENTION.JPG","video":null,"publish_date":"2024-07-18 23:09:06","author":null,"language":"en","source_country":"jp","sentiment":0.428},{"id":252112904,"title":"Trump To Rally Unified Republicans In Convention Finale","text":"Donald Trump will get a hero's welcome Thursday as he accepts the Republican Party's presidential nomination in a speech capping a convention dominated by the recent attempt on his life.The 78-year-old will address the Republican National Convention in Milwaukee hoping to build momentum toward a November victory over US President Joe Biden and a second term in the White House.As a resurgent Trump -- who was found guilty on 34 felony counts in New York just seven weeks ago -- readies for a triumphant prime-time appearance, team Biden is in full crisis mode as pressure from within the incumbent's Democratic Party builds for him to end his reelection bid.Barack Obama has reportedly told allies that he believes Biden, his vice president for eight years, should \"seriously consider the viability of his candidacy,\" the Washington Post reported.Those comments came on top of leading Democratic lawmakers calling on the 81-year-old president to drop out in the wake of his disastrous debate performance against Trump last month, in which he appeared tired and confused.Senior Trump advisor Jason Miller told AFP Thursday that \"nothing fundamentally changes\" with the Republican's campaign should Biden pull the plug and a different candidate emerge.Miller also confirmed that Trump, who has appeared at the convention wearing a bandage over his wounded ear, will \"offer a very personal reflection of what happened on Saturday.\"Supporters have been lining up all week to applaud the former president for his bravery since the weekend attack by a gunman at a Pennsylvania rally.As some of his loyalists blamed Democrats' rhetoric for the attack, Trump said he had torn up a more aggressive version of his keynote address in favor of one to \"unite our country.\"Some of the delegates at the convention said they were keen to hear from Trump about the shock attack that very nearly ended in disaster.\"I'm just grateful we're going to hear from him,\" Teena Horlacher, a 50-year-old convention delegate from Utah, told AFP. \"It's a miracle that his life was spared, and I really believe it was God's hand.\" Trump has a 90-minute speaking slot, from 9:00 to 10:30 pm (0200 to 0330 GMT Friday), according to a source familiar with the schedule.Also set to address the convention are shirt-ripping 80s wrestling icon Hulk Hogan and Trump's longtime friend Dana White, who is chief executive of the Ultimate Fighting Championship.Trump has attended multiple UFC bouts as he seeks to lock in younger male votes.The schedule notably shows no speaking slot for former first lady Melania Trump, a break from tradition in modern-era US nominating conventions, where spouses routinely take the stage seeking to personalize the candidates.Trump has seen his polling lead expand since Biden's dismal debate performance threw his party into chaos. The Republican campaign has even been talking up Trump's chances in Democratic strongholds like Minnesota and Virginia, potentially forcing Biden funds and manpower away from defending his \"blue wall\" in Michigan, Pennsylvania and Wisconsin.Trump's keynote address will be watched by millions, closing the convention by promising what his team calls \"a new golden age for America.\"The four-day party convention opened Monday with a vote to confirm Trump as the party's nominee after he won almost every state's primary contest.It has been the first convention over which Trump has had total control, after a 2016 edition hampered by party divisions and a second appearance in 2020 reined in by the Covid-19 pandemic.The schedule was designed around his image, with themes for each day playing on his \"Make America Great Again\" rallying cry.The week also saw Trump name right-wing Senator J.D. Vance of Ohio as his running mate.The 39-year-old author of \"Hillbilly Elegy,\" a best-selling memoir about growing up poor in working-class America, is a former Trump critic who became one of his staunchest backers.Trump himself was a diminished figure after his 2020 election loss and a subsequent riot at the US Capitol by his supporters, but he has spent much of the last four years reshaping Republican politics.","summary":"Donald Trump will get a hero's welcome Thursday as he accepts the Republican Party's presidential nomination in a speech capping a convention dominated by the recent attempt on his life.","url":"https://www.ibtimes.com.au/trump-rally-unified-republicans-convention-finale-1849699","image":"https://d.ibtimes.com.au/en/full/1854202/son-former-us-president-donald-trump-donald-trump-jr-speaks-during-2024-republican-national.jpg","video":null,"publish_date":"2024-07-18 23:06:16","author":"Michael Mathes","authors":["Michael Mathes"],"language":"en","catgory":"politics","source_country":"au","sentiment":0.073},{"id":252111610,"title":"New Tesla Registrations in California Fall for 3rd Straight Quarter, But Model Y Still Best Seller","text":"Registrations of new Tesla vehicles in California fell 24% in the April to June period, marking the third consecutive quarter that the company posted a sales drop in the state where it was founded. High interest rates, stiff competition from other automakers and new interest in less-expensive hybrid cars has softened demand for Tesla’s premium vehicles. In addition, some potential customers have been shying away from buying Teslas due to CEO Elon Musk’s increasingly polarizing persona. Musk’s embrace of Republicans and outspoken comments have sparked concerns about Tesla’s brand. The world’s richest man publicly endorsed former President Donald Trump for the first time in the U.S. presidential race after the assassination attempt on Saturday. California remains Tesla’s biggest market, and Tesla’s Model Y remains the top-selling car in the state, according to the California New Car Dealers Association. However registrations fell from 68,827 in the second quarter of 2023 to 52,211 in the latest quarter. The battery electric vehicle market slipped only 1.3% during the same period, while sales of hybrid vehicles surged 22% in California. “Tesla’s allure seems to be wearing off, signaling potential trouble for the direct-to-consumer manufacturer,” the report said. Tesla has seen its registrations in California slump even as distant rivals such as Hyundai Motor, Kia Motors, BMW, Mercedes-Benz, Ford, and Rivian increased sales by double-digit percentage points. In 2021, Tesla moved its headquarters from California to Texas, and Musk said this week his other companies such as Space X and X will follow suit over his disagreement with Gov. Gavin Newsom’s approval of a bill on transgender kids. Tesla, which is set to report quarterly results on Tuesday, handed over more vehicles to customers in the second quarter than analysts had expected, although deliveries were lower than a year ago. Reuters contributed to this article.","summary":"Registrations of new Tesla vehicles in California fell 24% in the April to June period, marking the third consecutive quarter that the company posted a sales drop in the state where it was founded.","url":"https://timesofsandiego.com/business/2024/07/18/new-tesla-registrations-in-california-fall-for-3rd-straight-quarter-but-model-y-still-best-seller/","image":"https://timesofsandiego.com/wp-content/uploads/2021/12/Elon-Musk.jpg","video":null,"publish_date":"2024-07-18 23:04:03","author":"Chris Jennewein","authors":["Chris Jennewein"],"language":"en","source_country":"us","sentiment":-0.185}]}