{"offset":0,"number":50,"available":10066,"news":[{"id":366498776,"title":"US strikes on Venezuelan boats ‘an act of kindness’ – Trump","text":"US President Donald Trump has described the recent strikes on alleged drug cartel-operated vessels off Venezuela as “an act of kindness,” saying the operation helped save thousands of lives at home.\n\nThe US has destroyed at least four boats in international waters since September, as Trump continues to accuse Venezuela’s left-wing government of using “narco-terrorists” to smuggle drugs into the country.\n\nSpeaking at the US Navy’s 250th anniversary ceremony in Norfolk, Virginia, on Sunday, Trump praised the military for supporting efforts “to blow the cartel terrorists the hell out of the water.”\n\n“It’s a pretty tough thing we’ve been doing, but you have to think of it this way. Every one of those boats is responsible for the death of 25,000 American people and the destruction of families,” he said. “So when you think of it that way, what we are doing is actually an act of kindness.”\n\nTrump said the strikes eliminated a key sea route used to traffic fentanyl and other drugs into the US. “Nobody wants to go into the water anymore,” he said.\n\nVenezuelan President Nicolas Maduro has rejected the allegations of running cartels, saying his government has “eliminated all major trafficking networks and vanquished prominent gangs.”\n\nHe accused Washington of using the fight against cartels as a pretext to topple his government and seize Venezuela’s natural resources.","summary":"US President Donald Trump has claimed that strikes on alleged Venezuelan cartel boats neutralized a key smuggling route \nRead Full Article at RT.com","url":"https://www.rt.com/news/625963-strikes-on-venezuelan-boats-act/","image":"https://mf.b37mrtl.ru/files/2025.10/article/68e30ccf85f5400eb558a57f.jpg","video":null,"publish_date":"2025-10-06 00:34:56","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.411},{"id":366498128,"title":"Portland police chief touts 'crowd support' approach as ICE facility faces ongoing violence","text":"Portland Police Chief Bob Day defended his department’s reforms and \"crowd support\" policing even as federal agents faced violent anti-ICE protesters without help, after city leaders ordered police not to respond. Last week, Cammila Wamsley, director of Portland’s ICE office, said the facility has endured more than 100 straight nights of violence, with Portland police largely absent under direction from the mayor and city council. \"It’s frustrating for us to watch people be attacked on the street and know that we don’t have the authority to be able to really step in unless there’s some nexus to federal law,\" Wamsley said. She added that nightly protests have escalated beyond changes and signs, with bottle rockets striking the ICE building, rocks shattering windows, lasers targeting officers’ eyes and barricades blocking vehicles. JUSTICE DEPARTMENT PROBES PORTLAND POLICE BUREAU AFTER TRUMP ADMINISTRATION BIAS CLAIMS Despite these accounts, Day offered a very different picture in an opinion piece published by The Oregonian on Sunday, arguing that national media coverage of Portland and its police paint a misleading and outdated picture. Day said he is \"deeply proud\" of how Portlanders show up for one another continuously, and equally proud of his police department. \"Unfortunately, national portrayals often distort reality. Portland is 145 square miles, yet one city block has drawn outsized attention in news cycles. Viral clips — sometimes months or years old — paint a picture that is not consistent with the Portland we see every day,\" Day wrote. \"While this is frustrating, we are focused on what matters: keeping Portlanders safe.\" Day said the department and its partners have reduced violent crime by 17% and successfully facilitated numerous peaceful protests as part of the city’s commitment to free speech. ICE DIRECTOR SAYS PORTLAND FACILITY FACES VIOLENCE WITH 'LITTLE HELP FROM LOCAL POLICE' Regarding protests at the federal building, Day said his officers are making arrests and pursuing prosecutions. \"It’s important to note that the Federal Protective Service secures the building itself, while Portland Police manages the surrounding neighborhoods,\" he said. \"Recently, we have seen people with varying viewpoints come to the area with the intent to engage in violence and we are investigating several assaults; violence of any kind is unacceptable – we have and will continue to make arrests and pursue prosecutions. Free speech does not include freedom to commit crimes.\" \"There are also those who want to draw parallels about current events and 2020, when 100-plus nights of protests deeply impacted the city and Portland Police. But this isn’t 2020 for many reasons,\" Day continued. \"Since I became chief two years ago, I have witnessed significant change. Reforms in use of force, crowd management and accountability have reshaped how we operate. \"As we have shown with the numerous massive protests that have occurred this year, large demonstrations can occur peacefully, and when disturbances arise, we take targeted action that can quickly restore order,\" he continued. \"Five years ago, some city and state leadership left the police bureau isolated. Today, that has changed. The bureau is part of a united statewide effort, backed by strong leadership from the mayor, city council, city administrator, governor, our congressional delegation and fellow Portlanders.\" PORTLAND POLICE SERGEANT APPEARS TO CRITICIZE ASSAULT VICTIMS FOR ANTAGONIZING ANTI-ICE PROTESTERS Day also addressed the Trump administration’s plan to deploy the Oregon National Guard to Portland alongside other federal law enforcement agencies. \"One of the reasons given for this action has been that Portland Police are not responding to public disorder,\" Day wrote. \"Just because officers are not seen wearing tactical gear lining up before crowds does not mean we are not responding. In fact, research shows that such tactics often escalate crowd behavior.\" Instead, he explained, his department uses a layered approach to upholding public order, which begins with officers engaging with protest organizers before demonstrations begin. Day said the outreach has resulted in meaningful conversations and stronger relationships in the community. PORTLAND SET TO SEE TRUMP CRIME CRACKDOWN RECKONING AFTER 2020'S HUMILIATING VIOLENCE SPREE The next layer, he said, is the Rapid Response Team, trained to manage public order when criminal behavior occurs. Some of the responses may include making arrests. \"Our focus has shifted from ‘crowd control’ to ‘crowd support,’ with an emphasis on outreach, preparation and communication,\" Day said. \"We now use evidence-based policing and crowd psychology in managing large public gatherings. These innovations have helped us connect with communities in new ways, already paying dividends in safer, more respectful demonstrations.\" Day closed his essay on an optimistic note, urging Portlanders to focus on civic engagement and community service. \"Rather than focusing on what cannot be done, this is an opportunity to channel that energy into action — through volunteering, community service or civic engagement,\" he continued. \"Turning dissonance into action is far more productive. Showcasing our city in social media and other forms of communication has been telling the real story. PORTLAND MAYOR DOUBLES DOWN ON SANCTUARY STATUS AFTER VIOLENT ANTI-ICE RIOT \"Much like any major city, our challenges are significant, and we are addressing them,\" Day added. \"Yet I believe this is Portland’s opportunity — not to be defined by division, but to show resilience, unity and innovation.\" Anti-ICE protests have continued across the country in recent weeks, including in Portland and near Chicago. On Saturday, federal agents were rammed and boxed in by 10 cars near Chicago, where anti-ICE crowds have gathered for days and nearly a dozen people have been arrested. Earlier this summer, President Donald Trump deployed National Guard troops to Los Angeles in response to immigration enforcement protests. CLICK HERE TO DOWNLOAD THE FOX NEWS APP On Saturday, a federal judge in Oregon temporarily blocked the Trump administration from deploying the National Guard in Portland as part of a lawsuit brought by the state and city. Fox News Digital’s Stephen Sorace contributed to this report.","summary":"Portland Police Chief Bob Day responded to federal criticism of police handling of anti-ICE protests as Trump administration plans National Guard deployment.","url":"https://www.foxnews.com/us/portland-police-chief-touts-crowd-support-approach-ice-facility-faces-ongoing-violence","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/735ac323-portland-ice-protest-fox-news.jpg","video":"https://www.foxnews.com/video/6378415633112","publish_date":"2025-10-06 00:28:04","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.091},{"id":366496764,"title":"SNL returns to air with savage Trump parody","text":"James Austin Johnson reprised his uncanny Donald Trump impression in a cold open that cast the former president as NBC’s self-appointed censorship czar, dropping in to warn the show’s cast not to “go too far” with their jokes.\n\nAnd the White House has already responded to the skit, with a representative saying, per Variety, that “reacting to this would require me to waste my time watching it. And like the millions of Americans who have tuned out from ‘SNL,’ I have more entertaining things to do — like watch paint dry.”\n\nThe sketch began with Pete Hegseth (Colin Jost), here recast as Secretary of Defense, laying down a few eyebrow-raising “new rules” for the military. “No fatties, no facial hair, no body hair,” he ordered. “Just hot, shredded, hairless men who are definitely not gay.” He then declared that America was facing “the greatest threat to freedom and democracy the world has ever known.” The camera cut to Johnson’s Trump, who didn’t miss a beat: “Late night TV!”\n\nThat set the tone for what followed — a shot at FCC Chairman Brendan Carr’s recent pressure on Disney and ABC after Jimmy Kimmel joked about the death of conservative pundit Charlie Kirk. “I’m just here keeping an eye on SNL making sure they don’t do anything too mean about me,” Trump said, claiming he knows “late night TV like the back of my hands.” Cue the punchline: the orange makeup smeared across the back of his right hand. “Not looking great right now!”\n\nFrom there, Johnson’s Trump moved on to roasting SNL itself. “We all know they were never going to let [Jost] do the whole opening by himself,” he said, before adding, “I thought he would be with his friends at the Riyadh Comedy Festival.” He quickly followed that up with one of the darker jokes of the night: “That’s sad. We love the Saudis because they like to ‘saw these’ journalists in half. That’s the kind of thing that would kill over there.” The line referenced recent backlash against Bill Burr, Dave Chappelle, and other comics who accepted Saudi Arabia’s invitation to perform.\n\nTrump then shifted to another headline from the real world — a recently surfaced 2003 birthday letter to Jeffrey Epstein, which The Wall Street Journal reported was written by Trump, though he denies it. \n\n“All right, Colin, those Spirit Airlines jokes aren’t going to write themselves,” he said while shooing Jost away, before adding, “Oh, and Colin: ‘May every day be another wonderful secret.’ That was a quote from a poem I wrote to a horrible man I’ve never met before.”\n\nAs the sketch drew to a close, Johnson’s Trump couldn’t resist one last jab at the show itself. “But here we are, SNL season 51. Should have called it at 50, right?” he said. “It’s so sad to see something get old and confused yet still demand constant attention. Oh, well. But they better be on their best behaviour, otherwise they’re going to have to answer to my attack dog at the FCC, Brandon Carr.” When Mikey Day’s Carr corrected him—“It’s actually ‘Brendan,’ sir” — Trump snapped back, “It’s crazy that you think I care.”\n\nBefore wrapping, Trump offered a few final “updates” from his summer: “I took a little vacation time for golf and travel and stroke. Kidding! Or not. We’ll never know, will we?” Then came a new campaign promise no one asked for: “I ended every war, except the two main ones still happening and more vicious than ever. Now starting a new war in Venezuela soon.”\n\nHis final note summed up the sketch’s chaotic spirit: the new war, he said, will be paid for “with my scams.”\n\nThis story originally appeared on Decider and is republished here with permission","summary":"Saturday Night Live returned for a new season with a brutal opener that cast Donald Trump as the show’s self-appointed censor.","url":"https://www.news.com.au/entertainment/tv/snl-returns-to-air-with-savage-trump-parody/news-story/4dc97ad0300e2e641710395a12f9fc9d?from=rss-basic","image":"https://content.api.news/v3/images/bin/49bde6eba862a7f426d32d9e1abfa68d","video":null,"publish_date":"2025-10-06 00:22:34","author":"49 Comments","authors":["49 Comments"],"language":"en","source_country":"au","sentiment":-0.216},{"id":366498316,"title":"Melania Trump channels ‘Top Gun’ in leather bomber for naval station visit","text":"Melania Trump is in her “Top Gun” era.\n\nThe first lady channeled Charlotte “Charlie” Blackwood while visiting Naval Station Norfolk in Norfolk, Va., on Sunday as part of a Salute to the Fleet celebration in honor of its 250th anniversary.\n\nThe 55-year-old donned a brown leather bomber jacket for this weekend’s event, which she paired with a collared white shirt and dark wash denim jeans.\n\nShe completed her look with aviator shades and added a white baseball cap with “USA” embroidered across the front.\n\nThe look was reminiscent of Tom Cruise’s beloved “Top Gun” character US Navy aviator Lt. Pete “Maverick” Mitchell’s love interest, played by Kelly McGillis in the franchise.\n\nMelania was joined by President Donald Trump for their visit to the USS George H. W. Bush where they talked to sailors.\n\nThe duo were treated to a military demonstration while standing on the deck of the aircraft carrier before POTUS addressed the crowd of an estimated 10,000 people.\n\nIn his speech, Trump took aim at democratic lawmakers for the current government shutdown.\n\n“I want you to know that … we will get our service members every last penny. Don’t worry about it,” Trump said, eliciting cheers from the crowd.\n\nMeanwhile, Melania looked ecstatic to speak at the event, waving to attendees and smiling widely.\n\nAfter greeting sailors with a “hooyah,” which they returned, she said that it was an honor to be at present.\n\n“Generations of sailors have kept America free because of your presence on the high seas,” she gushed in her speech.\n\n“Your strength, bravery and sacrifice inspires us all,” she added.\n\nLast month, Melania flew across the pond to visit Windsor Palace with her husband and wore multiple show-stopping looks on the trip.\n\nIn addition to sporting a bright yellow off-the-shoulder Caroline Herrera gown with a lavender belt for dinner with the royals, she and Kate Middleton matched in suede jackets during the visit.","summary":"The first lady made an appearance at Naval Station Norfolk in Norfolk, Va., to celebrate the US Navy's 250th anniversary over the weekend.","url":"https://pagesix.com/2025/10/05/style/melania-trump-channels-top-gun-in-leather-bomber-for-naval-station-visit/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/10/112909737.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/g9kntnzR-guILbWnz.mp4","publish_date":"2025-10-06 00:17:54","author":"Antoinette Bueno,Breanna Bell,mliss1578","authors":["Antoinette Bueno","Breanna Bell","mliss1578"],"language":"en","category":"politics","source_country":"us","sentiment":0.588},{"id":366497172,"title":"Trump says first phase of his Gaza plan may be completed in coming week","text":"WASHINGTON, October 6. /TASS/. US President Donald Trump stated that the first phase of his plan to resolve the situation in the Gaza Strip could be completed within the coming week, he said in a post on the social network Truth Social.\n\n\"There have been very positive discussions with Hamas, and countries from all over the world (Arab, Muslim, and everyone else) this weekend, to release the hostages, end the war in Gaza but, more importantly, finally have long sought peace in the Middle East. These talks have been very successful, and proceeding rapidly,\" he said.\n\n\"The technical teams will again meet Monday, in Egypt, to work through and clarify the final details. I am told that the first phase should be completed this week, and I am asking everyone to move fast,\" Trump wrote, noting that any delay threatens \"massive bloodshed - something that nobody wants to see.\"\n\nOn September 29, the White House released Trump’s \"comprehensive plan\" aimed at resolving the conflict in the Gaza Strip. The document consists of 20 points and provides, in particular, for the introduction of temporary external administration in the Palestinian enclave and the deployment of international stabilization forces there. Israel has announced its agreement with the plan.\n\nA new round of indirect talks between Israel and the Palestinian movement Hamas will take place in Egypt on October 6.","summary":"The US President noted that the technical teams will meet on September 6 in Egypt to work through and \"clarify the final details\"","url":"https://tass.com/world/2025453","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20251006/1455417.jpg","video":null,"publish_date":"2025-10-06 00:17:22","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.185},{"id":366495766,"title":"Republicans Warn Of Pain Ahead As US Shutdown Faces Second Week","text":"Trump administration officials and top Republicans warned Sunday that Americans will increasingly feel the pain of an ongoing US government shutdown as most federal operations remained shuttered.With Democrats refusing to give in over their demands for continued government health care subsidies in the budget, the White House says plans are being finalized for the firing of thousands of federal workers.Shutdowns are a periodic feature of gridlocked Washington when the two parties cannot agree on budget priorities. All non-essential workers are temporarily furloughed, or left without pay, while the parties work out their differences.This time, the stakes are higher, with President Donald Trump telling reporters Sunday that the administration had already started to permanently fire -- not merely furlough -- government employees.\"It's taking place right now. It's all because of the Democrats. The Democrats are causing the loss of a lot of jobs,\" Trump said, blaming his rivals as he has done since the start of the impasse.The shutdown, in its fifth day, has shown no signs of ending, with a top Democrat saying there had been no talks between congressional leaders since Monday.Kevin Hassett, who directs the White House's National Economic Council, told CNN that there was hope for progress in talks in the coming week.Trump himself sounded resigned to the shutdown dragging on.Talks will center on addressing expiring Obamacare health subsidies. The Senate's Republican majority leader acknowledged the two sides were currently \"at a stalemate.\"\"It's going to get uncomfortable,\" Senator John Thune told Fox News show \"Sunday Morning Futures,\" adding that some behind-the-scenes discussions were addressing the potential extension of subsidies for Obamacare.How long could the shutdown last? \"Just as long as the Democrats want it to,\" Thune said.But Republicans control the levers of power in Washington, and Democrats have laid the failure to keep the lights on squarely at the feet of Trump's party.The minority Democrats seek to force Republicans to address the health care subsidies issue by blocking a Trump-backed temporary funding resolution that needs a handful of their votes.In March, when the threat of a shutdown last loomed, Democrats blinked first, voting for a six-month Republican resolution to keep the coffers stacked despite policy misgivings.Now, Democrats are demanding negotiations.\"If Republicans continue to refuse to extend the Affordable Care Act (Obamacare) tax credits, tens of millions of American taxpayers are going to experience dramatically increased premiums, co-pays and deductibles,\" House Minority Leader Hakeem Jeffries said on NBC's \"Meet the Press.\"Shutdown concerns run across party lines, according to a CBS News poll released Sunday. It showed just 28 percent of Americans support congressional Republicans' handling of the crisis, while congressional Democrats received 27 percent support.The shutdown's effect on the economy is rattling Americans, with 49 percent of respondents saying they were very concerned and 31 percent somewhat concerned, compared to just 20 percent saying they are not concerned.The country's last government shutdown, beginning in December 2018, occurred during Trump's first presidential term and lasted a record 35 days. The non-partisan Congressional Budget Office estimated that shutdown cost the US economy about $11 billion.","summary":"Trump administration officials and top Republicans warned Sunday that Americans will increasingly feel the pain of an ongoing US government shutdown as most federal operations remained shuttered.","url":"https://www.ibtimes.com/republicans-warn-pain-ahead-us-shutdown-faces-second-week-3785640","image":"https://d.ibtimes.com/en/full/4626030/us-president-donald-trump-his-republicans-congress-are-scrambling-end-government-shutdown-amid.jpg?w=1600&h=900&q=88&f=2ea036a7cec13d988d38cf61684c405e","video":null,"publish_date":"2025-10-06 00:12:10","author":"Michael Mathes","authors":["Michael Mathes"],"language":"en","category":"politics","source_country":"US","sentiment":-0.106},{"id":366499100,"title":"Trump says US hit another boat off Venezuela coast on Saturday - Reuters","text":"SummaryStrikes have killed 21 this month, according to the USTrump says US will now look to operations by landUS has not provided evidence of drug traffickingVenezuela seeks foreign support, sent letter to pope\n\nNAVAL STATION NORFOLK, Virginia, Oct 5 (Reuters) - U.S. forces hit another vessel allegedly carrying illegal drugs off the coast of Venezuela on Saturday evening, U.S. President Donald Trump said on Sunday, adding that the U.S. would also start looking at drug trafficking occurring on land.\n\nTrump made the comment during a speech at Naval Station Norfolk, next to the Harry S. Truman aircraft carrier. It was not immediately clear if he was referencing a strike announced Friday by U.S. Defense Secretary Pete Hegseth.\n\nAdvertisement · Scroll to continue\n\nThat strike, at least the fourth such attack in recent weeks, killed four people.\n\n\"In recent weeks, the Navy has supported our mission to blow the cartel terrorists the hell out of the water ... we did another one last night. Now we just can't find any,\" Trump said.\n\n\"They're not coming in by sea anymore, so now we'll have to start looking about the land because they'll be forced to go by land.\"\n\nVenezuela's communications ministry did not immediately respond to a request for comment, but President Nicolas Maduro published a video message on Telegram shortly after Trump’s announcement in which he blasted U.S. aggression against Venezuela and said the country counted with diplomatic support.\n\nAdvertisement · Scroll to continue\n\nGet the key points from this story with Reuters AI\n\n\"Our people have never and will never be afraid to defend their right to live and be free,\" Maduro said, without referencing Trump's latest comments. \"We will be ready to face any scenario.\"\n\nVenezuelan Foreign Minister Yvan Gil said earlier on Sunday his Russian counterpart Sergei Lavrov gave a \"full expression of support and solidarity\" to Caracas in a phone call between the two.\n\nOn Saturday, Gil said Maduro had sent a letter to Pope Leo XIV in which he asked for his support to \"consolidate peace in Venezuela.\"\n\nHegseth told Fox News in an interview broadcast on Sunday he has every authorization needed for the Caribbean strikes.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV2078595789 \nAbout ConnatixV2078595789 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Jonathan Ernst, Andrea Shalal and Julia Harte; Additional reporting by Deisy Buitrago in Caracas and Sarah Morland in Mexico City; editing by Diane Craft\n\nPurchase Licensing Rights","summary":"Trump says US hit another boat off Venezuela coast on Saturday  Reuters","url":"https://www.reuters.com/world/us/trump-says-us-hit-another-boat-off-venezuela-coast-saturday-2025-10-05/","image":"https://www.reuters.com/resizer/v2/5K2FZTCJV5IQFJ3FCZN34YOY5M.jpg?auth=057ca2cb748b5ebb26147ce64d4c8fbafd937ca3ccf9099a493279ec501c99a4&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-10-06 00:04:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"gb","sentiment":-0.406},{"id":366493442,"title":"A deserted rail station on Trump's route to peace where global interests collide","text":"US mediation became possible because of Russia's weakened position in the South Caucasus.\n\nFor years, the Kremlin worked towards re-opening the route that now bears an American president's name.\n\nAnd although Russia's proposal for its FSB border troops to guard the future road has been rejected, they still patrol the stretch of the Armenia‑Iran border that has been chosen for the Trump route. \n\nAs the BBC filmed on the ground, a Russian FSB patrol vehicle pulled up in front of us. A young man in uniform asked us about a drone filming the border from above. We said it was not ours and the Russian patrol moved on.\n\nArmenia's Syunik region is also a key hub for its exports, and businessmen and trucks from Iran are a familiar sight. Iranian construction companies are building a new bridge that will cross the future Tripp. \n\nThe Aras River that separates the Islamic Republic and Armenia is the very line the route is set follow.\n\nIt is unclear how the US and Iranian companies will co-exist in Armenia, given recent US involvement in the Israel‑Iran war. \n\nA senior adviser to Iran's supreme leader threatened to turn Tripp into \"a grave for Donald Trump's mercenaries\", but Iran's government has been more measured. \n\nIran is a friend and neighbour to both Caucasus nations and Armenia has told Tehran the project is not a threat to its interests.","url":"https://www.bbc.com/news/articles/c78nr234v5mo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/bf6a/live/1991bf20-9b01-11f0-928c-71dbb8619e94.jpg","video":null,"publish_date":"2025-10-06 00:03:52","author":"Grigor Atanesian","authors":["Grigor Atanesian"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.062},{"id":366499120,"title":"Judge appeals ruling by court to block sending troops to Portland","text":"Oct. 5 (UPI) -- The Justice Department has appealed a ruling by a lower court judge blocking the mobilization of 200 National Guard troops to Portland.\n\nA judge on Saturday ordered the Trump administration to stop its mobilization of the soldiers to protect the ICE building and officers in the city. There have been nightly protests since the troops were ordered to patrol.\n\nThe 9th U.S. Circuit Court of Appeals will rule on the case.\n\nCalif. Gov. Gavin Newsome called the Trump administration's move to send National Guard troops to Portland an abuse of law and power.\n\n\"The Trump administration is unapologetically attacking the rule of law itself and putting into action their dangerous words - ignoring court orders and treating judges, even those appointed by the President himself, as political opponents.\n\nHundreds of protestors marched at the Portland Immigration and Customs Enforcement office Saturday, the latest in a series of demonstrations in the city since the Trump administration announced it would deploy the troops. \n\nSen. Ron Wyden, D-Ore., criticized President Donald Trump in a social media post referring to the court's order to block the deployment that said Trump's \"determination is simply untethered from the facts.\" \n\nA White House spokesperson said that Trump \"exercised his authority to protect federal assets and personnel in Portland following violent riots and attacks on law enforcement.\"","summary":"The Justice Department has appealed a ruling by a lower court judge blocking the mobilization of 200 National Guard troops to Portland.","url":"https://www.upi.com/Top_News/US/2025/10/05/judge-appeals-troops-blocked-in-portland/4471759707783/","image":"https://cdnph.upi.com/sv/ph/og/upi/4471759707783/2025/1/e404925258ad42be7a6a992fef18ca50/v1.5/Judge-appeals-ruling-by-court-to-block-sending-troops-to-Portland.jpg","video":null,"publish_date":"2025-10-05 23:53:33","author":"Mark Moran","authors":["Mark Moran"],"language":"en","category":"politics","source_country":"US","sentiment":-0.112},{"id":366492068,"title":"Trump Announces White House UFC Fight Date","text":"President Donald Trump has finally announced the date of the much-anticipated Ultimate Fighting Championship (UFC) fight he plans to host at the White House. \n\nThe fight, born out of Trump’s seeming love for the sport and friendship with UFC CEO and President Dana White, will take place on June 14, 2026, marking the president’s 80th birthday, according to Reuters. \n\nTrump had previously revealed the fight would take place in 2026, but had not specified the date until Sunday, when he did so during his speech at Naval Station Norfolk to mark the 250th anniversary of the U.S. Navy. \n\nWhite had revealed this week that the fight, which will take place on the White House’s South Lawn, will cost around $700,000 to fix up the space after the event. \n\nThis is a breaking news story. Updates will follow. \n\nUS President Donald Trump (L), UFC CEO Dana White (C) and US former professional boxer Mike Tyson (R) attend a UFC 316 event, headlined by a rematch between Georgian mixed martial artist Merab Dvalishvili and US mixed martial artist Sean O’Malley at the Prudential Center in Newark, New Jersey on June 7, 2025.","summary":"President Donald Trump counts UFC CEO Dana White as a close friend and has attended fights during his second administration.","url":"https://www.newsweek.com/sports/trump-announces-white-house-ufc-fight-date-10831535","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/GettyImages-2218507332.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-05 23:53:04","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":0.012},{"id":366498318,"title":"Mr. President: Nix the tariff ‘dividend’ checks, shrink the deficit instead","text":"As if President Joe Biden’s COVID “stimulus” checks weren’t bad enough, his successor is floating the idea of “tariff rebates” — when Uncle Sam is already $37 trillion in the hole.\n\nPresident Donald Trump, whose 2020 checks at least had the justification of keeping the economy going despite the lockdowns, last week said he’s considering $2,000 tariff “dividend” checks for every American family, since tariff revenues “are going to be over a trillion dollars a year.”\n\nAt least he also said that paying down the national debt is the “No. 1” priority.\n\nIn some very different world, “tariff rebates” might make some sense, but the recent precedents already have the nation started down the road of every new prez sending out “free money” checks: That’s a habit Washington must break.\n\nWe’d let the president’s latest musing pass, except he’s said it before, after the Treasury took in $64 billion in tariff revenue during the first three months since Liberation Day.\n\nAnd that followed talk of a DOGE dividend, which happily has since died out.\n\nBut cynical politicians across America have seized on the gimmick; here in New York, Gov. Kathy Hochul is now sending out $400 checks on the theory it’ll help her win re-election next year — even as the state is staring at multibillion-dollar budget holes starting next year.\n\nBribing the voters with their own money is an insult, of course — and bribing some of them at the expense of other taxpayers is a recipe for ruin.\n\nIn DC or Albany, any and all “found money” should go to paying down debts run up in spending sprees of the last five years — or to cutting the tax rates that are still too high. \n\nTrump’s already addressing the “affordability” crisis with pro-growth policies to let Americans earn more, and to lower their energy bills; keep that up, sir, and move us toward a future where every fewer people need government checks to get by.","summary":"As if President Joe Biden's COVID \"stimulus\" checks weren’t bad enough, his successor is floating the idea of “tariff rebates” — when Uncle Sam is already $37 trillion in the hole.","url":"https://nypost.com/2025/10/05/opinion/mr-president-nix-the-tariff-dividend-checks-shrink-the-deficit-instead/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-1ihowe27e-1759704318946.jpg?quality=75&strip=all&1759690002&w=1200","video":null,"publish_date":"2025-10-05 23:52:58","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.665},{"id":366489608,"title":"\"Everybody's pretty much agreed to it,\" says Trump on Gaza peace plan","text":"Washington DC [US], October 6 (ANI): US President Donald Trump on Sunday (local time) said that there is no need to make changes to the Gaza peace plan, as all are on board.During his interaction with reporters before departing the White House, when Trump was asked about the Gaza plan, if there were going to be any changes, he said that the nitty grittys will be fixed in a couple of days.“We have very little, we don’t need flexibility because everybody’s pretty much agreed to it, but there’ll always be some changes. But the Hamas plan, I tell you, it’s amazing. You’re going to have peace, if you think about it, peace in the Middle East for the first time in, they say really 3,000 years. So, I’m very honored to be a big part of that. They’ve been fighting for a plan for years. We get the hostages back almost immediately. Negotiations are going on right now. Will probably take a couple of days and people are very happy about it. It’s a great deal for Israel and it’s a great deal for everybody. It’s a great deal for the entire Arab world, Muslim world,” he said.In a post on X, the White House said, “There have been very positive discussions with Hamas, and countries from all over the World (Arab, Muslim, and everyone else) this weekend, to release the Hostages, end the War in Gaza but, more importantly, finally have long sought PEACE in the Middle East.”\n\n“There have been very positive discussions with Hamas, and Countries from all over the World (Arab, Muslim, and everyone else) this weekend, to release the Hostages, end the War in Gaza but, more importantly, finally have long sought PEACE in the Middle East…” – President Trump pic.twitter.com/PE9ERVQwkv\n— The White House (@WhiteHouse) October 5, 2025\n\nIt is not immediately clear what he means by “first phase” and whether he is suggesting that hostages will begin being released this week, as per The Times of Israel.Israeli Prime Minister Benjamin Netanyahu said over the weekend that he was hopeful that hostages could be released during the Sukkot holiday, which begins on Monday evening and extends for one week, followed immediately by the Simhat Torah holiday, which marks the Hebrew calendar anniversary of Hamas’s October 7 attack, The Times of Israel reported. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/everybodys-pretty-much-agreed-to-it-says-trump-on-gaza-peace-plan-9616262.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-10-05 23:45:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.042},{"id":366496210,"title":"Trump warns Hamas faces ‘complete obliteration’ if group clings to power as US negotiators arrive in Egypt to push ceasefire deal","text":"President Donald Trump reiterated his warning that Hamas will face an aggressive offensive if the group does not agree to concede control of Gaza amid efforts to reach a ceasefire deal between the group and Israel.\n\nIn a text message, sent to CNN reporter Jack Tapper Saturday, the president said the consequences for Hamas would be “complete obliteration!” if the group insists on staying in power.\n\nTrump has already insinuated that Hamas could face a dire outcome when he unveiled a 20-point ceasefire plan with Israeli Prime Minister Benjamin Netanyahu last week. Both leaders said if Hamas did not agree to the terms, the U.S. would back Israel to “finish the job.” Trump also said Friday that “all hell” would break out if Hamas did not agree. \n\nTrump’s ultimatum arrives at a crucial moment as delegations head to Egypt for further negotiations Monday.\n\nSteve Witkoff and Jared Kushner, the president’s envoys, are expected to join the discussions in Cairo and help facilitate the release of Israeli hostages in Gaza, and Palestinian prisoners in Israel. \n\nHamas has not accepted the full terms of the 20-point deal, but has agreed to release the hostages in exchange for prisoners. Israel has sought to recover the remaining hostages, which are believed to be around 20 living people and 25 bodies of the deceased. \n\nUnder the proposed plan, hostages would be released within 72 hours of the agreement in exchange for 250 Palestinians serving life sentences and 1,700 people from Gaza who were jailed during the conflict, which began October 7, 2023. Israel will also hand over the bodies of 15 deceased Gazans for each deceased Israeli.\n\nBut it’s unclear if Monday will end with a solidified plan for the hostage-prisoner swap, with so many other terms of the deal uncertain.\n\nTrump has expressed an optimistic view of the negotiations, telling reporters Sunday evening that countries surrounding Israel have had “great meetings” with Hamas and it “looks like it’s working.”\n\n“The technical teams will again meet Monday, in Egypt, to work through and clarify the final details,” Trump wrote on Truth Social. “I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST.”\n\nIn the same post, the president repeated his warning to Hamas. \n\n“TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW — SOMETHING THAT NOBODY WANTS TO SEE!” Trump wrote.\n\nMonday’s negotiations are also expected to address Israeli troops pulling out of parts of Gaza – another major point of Trump’s proposed deal that Hamas has been fighting toward for two years. It’s unclear how much Israel is willing to withdraw.\n\nOther parts of the deal, especially those pertaining to Hamas’ power in Gaza, will need to be hammered out in time. Under Trump’s proposed deal, Hamas would have to give up governing authority in Gaza and lay down its weapons.\n\nThe two-year-long conflict began on October 7, 2023, when Hamas attacked Israel, killing approximately 1,200 people and taking hundreds of others hostage. In response, Israel has waged a bloody offensive in Gaza, killing more than 65,000 people, thousands of whom are children.\n\nIsrael’s war in Gaza, which the United Nations has classified as a genocide, has decimated parts of the Gaza Strip and devastated the lives of millions. People living in Gaza are on the brink of starvation, with few resources coming in. \n\nIsrael has defended its offensive, saying they are targeting Hamas, not Palestinians.","summary":"Under the terms of Trump’s 20-point ceasefire deal, Hamas would largely have to give up its control and power in Gaza","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-hamas-israel-ceasefire-talks-egypt-b2839830.html","image":"https://static.independent.co.uk/2025/10/05/23/10/SEI269201427.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/CEfwjXKO-4VHSaSK0.mp4","publish_date":"2025-10-05 23:42:49","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.39},{"id":366494618,"title":"Trump warns Hamas faces ‘complete obliteration’ if group clings to power as US negotiators arrive in Egypt to push ceasefire deal","text":"President Donald Trump reiterated his warning that Hamas will face an aggressive offensive if the group does not agree to concede control of Gaza amid efforts to reach a ceasefire deal between the group and Israel.\n\nIn a text message, sent to CNN reporter Jack Tapper Saturday, the president said the consequences for Hamas would be “complete obliteration!” if the group insists on staying in power.\n\nTrump has already insinuated that Hamas could face a dire outcome when he unveiled a 20-point ceasefire plan with Israeli Prime Minister Benjamin Netanyahu last week. Both leaders said if Hamas did not agree to the terms, the U.S. would back Israel to “finish the job.” Trump also said Friday that “all hell” would break out if Hamas did not agree.\n\nTrump’s ultimatum arrives at a crucial moment as delegations head to Egypt for further negotiations Monday.\n\nSteve Witkoff and Jared Kushner, the president’s envoys, are expected to join the discussions in Cairo and help facilitate the release of Israeli hostages in Gaza, and Palestinian prisoners in Israel.\n\nHamas has not accepted the full terms of the 20-point deal, but has agreed to release the hostages in exchange for prisoners. Israel has sought to recover the remaining hostages, which are believed to be around 20 living people and 25 bodies of the deceased.\n\nUnder the proposed plan, hostages would be released within 72 hours of the agreement in exchange for 250 Palestinians serving life sentences and 1,700 people from Gaza who were jailed during the conflict, which began October 7, 2023. Israel will also hand over the bodies of 15 deceased Gazans for each deceased Israeli.\n\nBut it’s unclear if Monday will end with a solidified plan for the hostage-prisoner swap, with so many other terms of the deal uncertain.\n\nTrump has expressed an optimistic view of the negotiations, telling reporters Sunday evening that countries surrounding Israel have had “great meetings” with Hamas and it “looks like it’s working.”\n\n“The technical teams will again meet Monday, in Egypt, to work through and clarify the final details,” Trump wrote on Truth Social. “I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST.”\n\nIn the same post, the president repeated his warning to Hamas.\n\n“TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW — SOMETHING THAT NOBODY WANTS TO SEE!” Trump wrote.\n\nMonday’s negotiations are also expected to address Israeli troops pulling out of parts of Gaza – another major point of Trump’s proposed deal that Hamas has been fighting toward for two years. It’s unclear how much Israel is willing to withdraw.\n\nOther parts of the deal, especially those pertaining to Hamas’ power in Gaza, will need to be hammered out in time. Under Trump’s proposed deal, Hamas would have to give up governing authority in Gaza and lay down its weapons.\n\nThe two-year-long conflict began on October 7, 2023, when Hamas attacked Israel, killing approximately 1,200 people and taking hundreds of others hostage. In response, Israel has waged a bloody offensive in Gaza, killing more than 65,000 people, thousands of whom are children.\n\nIsrael’s war in Gaza, which the United Nations has classified as a genocide, has decimated parts of the Gaza Strip and devastated the lives of millions. People living in Gaza are on the brink of starvation, with few resources coming in.\n\nIsrael has defended its offensive, saying they are targeting Hamas, not Palestinians.","url":"https://uk.news.yahoo.com/trump-warns-hamas-faces-complete-234249548.html","image":"https://s.yimg.com/ny/api/res/1.2/LxTnVROC35dcJdj9_hdp1Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/74342ecc53a6d3838af513090561478b","video":"","publish_date":"2025-10-05 23:42:49","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.39},{"id":366491948,"title":"Trump Announces Strikes on Another Alleged Drug Boat Off Venezuelan Coast","text":"U.S. forces carried out airstrikes on another vessel allegedly carrying illegal drugs off the coast of Venezuela on Saturday, President Donald Trump announced on Sunday.\n\n“In recent weeks, the Navy has supported our mission to blow the cartel terrorists the hell out of the water. ... We did another one last night. Now we just can’t find any,” Trump said during remarks at Naval Station Norfolk, flanked by two U.S. aircraft carriers.","summary":"'Now we'll have to start looking about the land because they'll be forced to go by land,' Trump said.","url":"https://www.theepochtimes.com/us/trump-announces-strikes-on-another-alleged-drug-boat-off-venezuelan-coast-5925011","image":"https://img.theepochtimes.com/assets/uploads/2025/10/05/id5924930-US-Navy-Trump-GettyImages-2239048750-300x180.jpg","video":null,"publish_date":"2025-10-05 23:34:04","author":"Joseph Lord","authors":["Joseph Lord"],"language":"en","category":"politics","source_country":"us","sentiment":-0.705},{"id":366490092,"title":"Trump Predicts Gaza Agreement Talks to Take a Few Days While Rubio Urges Israel to Halt Bombings","text":"United States President Donald Trump said talks on implementing a truce for Gaza will take days, while his foreign policy chief Marco Rubio warned Israel needs to stop bombing for a hostage release to happen.\n\n“They’re in negotiations right now as we speak. They’ve started the negotiations. It’ll last a couple of days,” Trump told reporters at the White House.\n\n“We’ll see how it turns out. But I’m hearing it’s going very well.”\n\nIn a text exchange with CNN, Trump said “yes” when asked if Israeli Prime Minister Benjamin Netanyahu was on board with ending the military campaign in Gaza.\n\nThe diplomatic push follows the positive response by Hamas to Trump’s 20-point roadmap for an end to the fighting and the release of captives in Gaza in exchange for Palestinians held in Israeli jails and administrative detention.\n\nBut Hamas left some issues up for further negotiation at talks in Egypt, as well as questions unanswered, such as whether it would be willing to disarm, a key demand from Israel to end the war.\n\nMeanwhile, Rubio called for a halt to Israeli bombing on Gaza.\n\n“I think the Israelis and everyone acknowledge you can’t release hostages in the middle of strikes, so the strikes will have to stop,” he told a CBS News talk show.\n\nHopes for peace in Gaza but Israeli strikes continue\n\nTrump’s plan has stirred hopes for peace among Palestinians, but there was no let-up in Israeli attacks on Gaza on the weekend as planes and tanks pounded areas across the enclave, killing at least 19 people, local health authorities said.\n\nShadi Mansour stood in the destruction left by an Israeli airstrike in the Gaza City suburb of Tuffah, which killed his son Ameer, 6, and 16 other people.\n\n“Is he a member of the resistance? Is he a fighter? All the targets of the Israeli army are children,” Mansour said.\n\nAhmed Assad, a displaced Palestinian man in central Gaza, said he had been hopeful when news broke of Trump’s plan, but said nothing had changed on the ground.\n\n“We do not see any change to the situation, on the contrary, we don’t know what action to take, what shall we do? Shall we remain in the streets? Shall we leave?” he questioned.\n\nIn a sign of Israeli optimism over the Trump plan, the shekel currency hit a three-year high against the dollar and Tel Aviv stocks reached an all-time high.\n\nDomestically, Netanyahu is caught between growing pressure to end the war — from hostage families and a war-weary public — and demands from hardline members of his coalition who insist there must be no let-up in Israel’s campaign in Gaza.\n\nHow could the peace negotiations unfold this time?\n\nAn official briefed on the talks said the negotiations will focus on hammering out a comprehensive deal before a ceasefire can be implemented.\n\n“This differs from earlier rounds of negotiations which followed a phased approach, where the first phase was agreed and then required more negotiations to reach subsequent phases in the ceasefire,” the official told Reuters news agency.\n\n“These subsequent rounds of negotiations is where things broke down previously and there is a conscious effort among mediators to avoid that approach this time around.”\n\nRubio told US broadcaster ABC that a timeline for finalising a deal to release the hostages was uncertain, but that talks “cannot take weeks or even multiple days. We want to see this happen very fast”.","summary":"Internewscast Journal\n\nInternewscast\n\n\nUnited States President Donald Trump said talks on implementing a truce for&#8230;\n\n\nThis Post: Trump Predicts Gaza Agreement Talks to Take a Few Days While Rubio Urges Israel to Halt Bombings first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/trump-predicts-gaza-agreement-talks-to-take-a-few-days-while-rubio-urges-israel-to-halt-bombings/","image":"https://images.sbs.com.au/dims4/default/8d6b543/2147483647/strip/false/crop/6244x2869+0+324/resize/1234x567!/format/jpeg/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F2f%2F38%2F417bc4fb4d67b6b67b3798973d35%2Fisrael-gaza-hamas-palestine","video":null,"publish_date":"2025-10-05 23:33:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.187},{"id":366495818,"title":"Hamas calls for swift hostage-prisoner swap as Trump urges quick talks","text":"Jerusalem/Cairo/Gaza City, Gaza Strip - Hamas on Sunday called for a swift start to a hostage-prisoner exchange with Israel, as negotiators from both sides headed to Egypt for crucial talks aimed at ending the nearly two-year war in Gaza.The diplomatic push follows Hamas' positive response to Donald Trump's roadmap for an end to the fighting and the release of captives in Gaza in exchange for Palestinians held in Israeli jails, with the U.S. leader urging both sides to 'move fast'.'There have been very positive discussions with Hamas, and Countries from all over the World (Arab, Muslim, and everyone else) this weekend, to release the Hostages, end the War in Gaza but, more importantly, finally have long sought PEACE in the Middle East,' Trump posted Sunday on his Truth Social platform.","summary":"The push follows Hamas' positive response to Trump's roadmap for an end to the fighting and the release of captives in exchange for Palestinians held in Israeli jails.","url":"https://www.japantimes.co.jp/news/2025/10/06/world/hamas-israel-gaza-talks/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/10/06/497898.jpg?v=3.1","video":null,"publish_date":"2025-10-05 23:30:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":0.22},{"id":366492532,"title":"Trump moves Calif. troops to Oregon","text":"SACRAMENTO, Calif. — President Donald Trump is sending California National Guard members to Oregon after a judge temporarily blocked his administration from deploying that state’s guard to Portland, and Gov. Gavin Newsom pledged Sunday to fight the move in court.\n\n“At the direction of the President, approximately 200 federalized members of the California National Guard are being reassigned from duty in the greater Los Angeles area to Portland, Oregon to support U.S. Immigration and Customs Enforcement and other federal personnel performing official duties, including the enforcement of federal law, and to protect federal property,” chief Pentagon Spokesman Sean Parnell said Sunday in an emailed statement.\n\nThe move comes a day after Illinois’ governor made a similar announcement about troops in his state being activated.\n\nOregon Gov. Tina Kotek said that 101 California National Guard members arrived in her state Saturday night by plane and more were on the way. Kotek said there had been no formal communication with the federal government about the deployment.\n\n“This action appears to (be) intentional to circumvent yesterday’s ruling by a federal judge,” Kotek said in a statement Sunday. “There is no need for military intervention in Oregon. There is no insurrection in Portland. No threat to national security. Oregon is our home, not a military target.”\n\nA spokesperson for Kotek said Sunday he could not verify the current location of the Guard members who arrived in Oregon on Saturday.\n\nNewsom, a Democrat, said in a statement that California personnel were on their way Sunday and called the deployment “a breathtaking abuse of the law and power.” He said these troops were “federalized” and put under the president’s control months ago over his objections, in response to unrest in Los Angeles.\n\n“The commander-in-chief is using the U.S. military as a political weapon against American citizens,” Newsom said. “We will take this fight to court, but the public cannot stay silent in the face of such reckless and authoritarian conduct by the president of the United States.”\n\nNewsom said earlier Sunday that about 300 guard members were being sent from California. Messages were sent to his office seeking to clarify the discrepancy.\n\nA Trump-appointed federal judge in Oregon on Saturday temporarily blocked the Trump administration’s plan to deploy the Oregon National Guard in Portland to protect federal property amid protests after Trump called the city “war-ravaged.” Oregon officials and Portland residents alike said that description was ludicrous.\n\nU.S. District Judge Karin Immergut, who was appointed by Trump during his first term, issued the order pending further arguments in a lawsuit brought by the state and city. She said the relatively small protests the city has seen did not justify the use of federalized forces and allowing the deployment could harm Oregon’s state sovereignty.\n\nPortland Mayor Keith Wilson said Sunday that the city continues to seek legal means to halt any National Guard deployment.\n\n“This action circumvents the court’s decision and threatens to inflame a community that has remained peaceful,” Wilson said. “Our legal team is coordinating with our partners and will immediately pursue all lawful steps to enforce the judge’s order and protect Portlanders’ rights.”\n\nThe U.S. Immigration and Customs Enforcement building in Portland has recently been the site of nightly protests.\n\nTrump has characterized both Portland and Chicago as cities rife with crime and unrest, calling the former a “war zone” and suggesting apocalyptic force was needed to quell problems in the latter. Since the start of his second term, he has sent or talked about sending troops to 10 cities.\n\nTrump authorized the deployment of 300 Illinois National Guard troops to protect federal officers and assets in Chicago on Saturday.\n\nIllinois Gov. JB Pritzker’s office said the situation in Chicago “does not require the use of the military and, as a result, the Governor opposes the deployment of the national guard under any status.” Pritzker didn’t receive any calls from federal officials about the deployment, his office said.","summary":"President Donald Trump is sending California National Guard members to Oregon after a judge temporarily blocked his administration from deploying that state's guard to Portland, and Gov. Gavin Newsom pledged Sunday to fight the move in court.","url":"https://www.bostonherald.com/2025/10/05/trump-moves-calif-troops-to-oregon/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/AP25278021364649.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-05 23:29:18","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.112},{"id":366490762,"title":"Dana White promises 'greatest fight card ever assembled' for potential White House UFC event in 2026","text":"UFC CEO Dana White has built even more intrigue around a potential fight card at the White House next year. White predicted he will have \"the greatest fight card ever assembled\" for the June 2026 event that could take place on the White House lawn. \"If you look at what we’re looking down the barrel of now, we’re about to go on a new network on Paramount. We need to deliver a massive, incredible card in January,\" White said after UFC 320 on Saturday night, per Yahoo Sports. \"Then in February, we’ll start looking at building the White House card, which I will right now tell you will be the greatest fight card ever assembled in the history of, at least, definitely this company.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM While White has addressed many questions about the first-of-its-kind destination, he said the idea is still in the preliminary stages. \"We’re still talking about the production and how everything’s gonna work at the White House,\" he said. \"We have not started negotiating any fights for the White House yet.\" UFC will move exclusively to Paramount in January after a $7.7 billion deal to leave ESPN, where it has aired for many years. UFC'S MICHAEL CHANDLER WANTS TO 'STEAL THE SHOW' AGAINST CONOR MCGREGOR AT WHITE HOUSE White added that superstar fighters have been lobbying to be part of the White House card, though no negotiations have begun. Among them is Conor McGregor, but White tempered expectations for his long-awaited return to the octagon. \"I made it clear Conor wants to fight on that card, and you can clearly see Conor is very fired up to fight on that card,\" White said. \"But nothing is done yet, and no fights are being negotiated with the White House.\" The UFC event is expected to be part of the United States’ 250th birthday celebration. White previously said it was President Donald Trump’s idea to host the fight at his residence in Washington, D.C. \"I didn’t ask – he brought it up to me,\" White said on Logan Paul’s \"Impaulsive\" podcast last month. \"When you walk around the White House with him, he’s so proud of the White House, and he loves it so much and he loves America. He believes that the White House belongs to the people of America,\" White continued. \"He wants to do more things like kids coming in doing Easter egg hunts, things around Christmas and special events. … That’s his thing. He wants to bring more Americans to the White House. His thing was, ‘This is your house.’ I was lucky he said, ‘We should do a fight here.’\" White also confirmed a rumor that fighters would walk out of the Oval Office before entering the octagon. \"This is a one-in-one, a once-in-a-lifetime opportunity that will never happen again,\" White added. CLICK HERE TO GET THE FOX NEWS APP White and Trump have been friends for years, with Trump attending numerous UFC fights. White also spoke at the Republican National Convention when Trump first ran for president nearly a decade ago. The Wall Street Journal reported earlier this month that weigh-ins will take place at the Lincoln Memorial. The event was initially planned for July 4, but logistical issues have pushed it to June, according to the report. Fox News’ Ryan Morik contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"UFC CEO Dana White predicted the June 2026 White House fight card will be the &quot;greatest ever assembled,&quot; with fighters lobbying to participate in the historic event.","url":"https://www.foxnews.com/sports/dana-white-promises-greatest-fight-card-ever-assembled-potential-white-house-ufc-event-2026","image":"https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png","video":"https://www.foxnews.com/video/6380231271112","publish_date":"2025-10-05 23:28:14","author":"Scott Thompson","authors":["Scott Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":0.133},{"id":366490766,"title":"White House spokesperson calls 'Saturday Night Live' a 'waste' of time after season premiere","text":"The White House dismissed NBC’s \"Saturday Night Live\" as a \"waste of time\" akin to watching paint dry when reached for comment about its recent season premiere. The long-running sketch comedy series began its 51st season Saturday night and once again featured cast member James Austin Johnson portraying President Donald Trump interrupting the cold open, joking that he could have the show canceled if it became too critical. \"I'm just here keeping my eye on ‘SNL.’ Making sure they don't do anything too mean about me,\" Johnson said as Trump. SNL SAYS TRUMP’S BEEN IN OFFICE ‘100 YEARS’ WHILE MOCKING PAPAL AMBITIONS AND EXECUTIVE ORDER FRENZY In another line, Johnson added, \"But they better be on their best behavior, otherwise they're going to have to answer to my attack dog at the FCC, Brendan Carr.\" He also closed out the sketch warning the show that \"Daddy’s watching.\" Despite the sketch mocking Trump, White House spokesperson Abigail Jackson dismissed the attack and the show in a comment to Entertainment Weekly, saying she has \"more entertaining\" things to do with her time. \"Reacting to this would require me to waste my time watching it,\" White House spokesperson Abigail Jackson said. \"And like the millions of Americans who have tuned out from SNL, I have more entertaining things to do—like watch paint dry.\" SNL COMPARES TRUMP TO JESUS IN EASTER SKETCH MOCKING ECONOMY AND FAITH: 'DONALD JESUS TRUMP' Fox News Digital reached out to NBC for comment. The opening sketch likely referenced late-night host and frequent Trump critic Jimmy Kimmel being suspended by ABC after broadcasting shows preempted his show for his controversial comments related to Charlie Kirk’s assassin. Federal Communications Commission (FCC) chair Brendan Carr also issued a veiled threat against the show before it was suspended. ABC restored Kimmel’s show less than one week later. SNL SKIT TAKES AIM AT TRUMP’S TARIFFS AND TESLA VANDALISM: 'MAKE AMERICA GREAT DEPRESSION AGAIN' \"Saturday Night Live\" has frequently mocked Trump in the show’s cold open since his 2024 election campaign. Though Trump has criticized the show in the past, his administration and 2024 campaign team have largely ignored \"SNL\" throughout his second term. One exception came in September 2024, when the Trump campaign fired back at a sketch that mocked assassination attempts against him. CLICK HERE TO GET THE FOX NEWS APP","summary":"White House spokesperson Abigail Jackson gave a brief response to Entertainment Weekly about NBC’s “Saturday Night Live&quot; after its 51st season premiere.","url":"https://www.foxnews.com/media/white-house-spokesperson-calls-saturday-night-live-waste-time-after-season-premiere","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/james-austin-johnson-trump-snl.jpg","video":"https://www.foxnews.com/video/6371567993112","publish_date":"2025-10-05 23:24:19","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"us","sentiment":-0.165},{"id":366496220,"title":"‘Don’t worry about it, it’s all coming’: Trump promises pay raises for sailors as he celebrates 250 years of US Navy during shutdown","text":"Donald Trump frequently went off-script and turned a commemoration of the U.S. Navy’s 250th anniversary into a politicized “rally” - his own words - on Sunday.\n\nThe president was in Virginia speaking to cadets and officers at Naval Station Norfolk where he used the celebration as a means to hammer his foes in Washington over a government shutdown that is approaching its second week, leaving thousands of federal workers and service members without pay. Cadets and other service members at Norfolk are due to stop receiving checks on October 15 if the shutdown endures.\n\nIn an address that lasted close to an hour, Trump endorsed pay raises for the military while attacking Democrats for the furloughing of both civilian and enlisted Americans who get their paychecks from the government. He described Democrats as “gnats” in response to the party’s refusal to support reopening the government without Republicans voting to extend health care plan subsidies.\n\n“I want you to know that despite the current Democrat induced shutdown, we will get our service members every last penny. Don’t worry about it,” Trump said.\n\nAt one point he even attempted to convince the crowd of mostly cadets to boo “Barack Hussein Obama” — his derisive way of referring to the 44th president, whose middle name became part of Trump’s own efforts to persuade Americans that Obama was not a natural-born citizen.\n\nThe effort failed, but Trump did manage to elicit cheers at moments in the speech, while attacking Democrats on issues like immigration and wandering off into unrelated topics, like his proclamation attempting to rename the Gulf of Mexico as the “Gulf of America”.\n\n“I wouldn’t say that Mexico is thrilled with me,” Trump sarcastically joked.\n\nOne loud cheer came when the president warned America’s perceived enemies to “leave America in peace or be blown up in fire and fury never seen before.”\n\nThe president seemed to be received positively by the crowd, even as he criticized the combined efforts of the U.S. armed forces over the past several decades. Afghanistan and Vietnam, Trump identified, were two conflicts that he blamed U.S. generals and top brass for losing due to their supposed embrace of “political correctness.”\n\nThat term was also deployed by Secretary of Defense Pete Hegseth in his speech to generals in Washington this past week, which critics of the administration argue is an attack on women and LGBT members of the armed services.\n\n“We won World War I and World War II. We won everything in between. We won everything before. And all of a sudden they decided to change the name. They went woke, then, too, you know. Woke is a long-term word,” Trump declared. A handful of shouts were heard from the crowd, turning heads, as the president spoke.\n\n“Let’s face it: this is a rally,” the president admitted at one point.\n\nTrump rambled over a wide range of topics from the stage. He complained about the FBI investigation that followed him through his 2016 election victory, claiming falsely that he caught Obama and his top officials rigging the election. He also snuck in a promotion for the UFC fight he plans to host on the White House lawn in the coming months.\n\nAnd pointing out the base’s comparative proximity to D.C., Trump took the opportunity to boast about his “takeover” of the nation’s capital by deploying hundreds of National Guard troops around the District of Columbia and flooding the streets with members of federal law enforcement, including ICE. He vowed imminent deployments of National Guard troops to Memphis and Chicago.\n\n“We’re doing it like nobody’s ever done it before. So I just want to tell you: you’re very close to D.C.; the restaurants are thriving. The restaurants were dying. They were closing, one after another. Now they’re opening up, they’re thriving.”\n\n“It’s a safe place now, our nation’s capital,” he added.\n\nThe president packed up and returned to the White House after his speech but passed out challenge coins to Navy brass at the event and also met with service members and posed for photos on board the USS George H.W. Bush.\n\nOn Monday, the White House is set to decide whether a deal with Democrats is possible to reopen the federal government and end a shutdown that will be entering its sixth day, the president’s economic adviser Kevin Hassett said Sunday. Republicans and Democrats left Washington over the weekend without a deal, and members of the House departed for a district work period set to last the entire coming week.\n\nIf a deal is not reached, Trump and other administration officials with the backing of some congressional Republicans have threatened to begin mass federal layoffs.\n\nIn the Senate, a handful of Democrats could break ranks to support ending the shutdown but for now, the party is in near-lockstep behind the strategy of withholding the votes necessary to break a filibuster until Republicans agree to extend subsidies for health care plans on the Affordable Care Act public exchanges. \n\nThose subsidies are due to end with the new year and spike premiums for many Americans.","summary":"Trump taunts Democrats as he politicizes Navy celebration, and tries to get cadets to boo former President Barack Obama","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-navy-speech-shutdown-pay-b2839810.html","image":"https://static.independent.co.uk/2025/10/05/23/31/SEI269176637.jpg?crop=6187,4124.7,x0,y0.2&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/zD7LTBDG-4VHSaSK0.mp4","publish_date":"2025-10-05 23:23:48","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.042},{"id":366494620,"title":"‘Don’t worry about it, it’s all coming’: Trump promises pay raises for sailors as he celebrates 250 years of US Navy during shutdown","text":"Donald Trump frequently went off-script and turned a commemoration of the U.S. Navy’s 250th anniversary into a politicized “rally” - his own words - on Sunday.\n\nThe president was in Virginia speaking to cadets and officers at Naval Station Norfolk where he used the celebration as a means to hammer his foes in Washington over a government shutdown that is approaching its second week, leaving thousands of federal workers and service members without pay. Cadets and other service members at Norfolk are due to stop receiving checks on October 15 if the shutdown endures.\n\nIn an address that lasted close to an hour, Trump endorsed pay raises for the military while attacking Democrats for the furloughing of both civilian and enlisted Americans who get their paychecks from the government. He described Democrats as “gnats” in response to the party’s refusal to support reopening the government without Republicans voting to extend health care plan subsidies.\n\n“I want you to know that despite the current Democrat induced shutdown, we will get our service members every last penny. Don’t worry about it,” Trump said.\n\nAt one point he even attempted to convince the crowd of mostly cadets to boo “Barack Hussein Obama” — his derisive way of referring to the 44th president, whose middle name became part of Trump’s own efforts to persuade Americans that Obama was not a natural-born citizen.\n\nThe effort failed, but Trump did manage to elicit cheers at moments in the speech, while attacking Democrats on issues like immigration and wandering off into unrelated topics, like his proclamation attempting to rename the Gulf of Mexico as the “Gulf of America”.\n\n“I wouldn’t say that Mexico is thrilled with me,” Trump sarcastically joked.\n\nOne loud cheer came when the president warned America’s perceived enemies to “leave America in peace or be blown up in fire and fury never seen before.”\n\nThe president seemed to be received positively by the crowd, even as he criticized the combined efforts of the U.S. armed forces over the past several decades. Afghanistan and Vietnam, Trump identified, were two conflicts that he blamed U.S. generals and top brass for losing due to their supposed embrace of “political correctness.”\n\nThat term was also deployed by Secretary of Defense Pete Hegseth in his speech to generals in Washington this past week, which critics of the administration argue is an attack on women and LGBT members of the armed services.\n\n“We won World War I and World War II. We won everything in between. We won everything before. And all of a sudden they decided to change the name. They went woke, then, too, you know. Woke is a long-term word,” Trump declared. A handful of shouts were heard from the crowd, turning heads, as the president spoke.\n\n“Let’s face it: this is a rally,” the president admitted at one point.\n\nTrump rambled over a wide range of topics from the stage. He complained about the FBI investigation that followed him through his 2016 election victory, claiming falsely that he caught Obama and his top officials rigging the election. He also snuck in a promotion for the UFC fight he plans to host on the White House lawn in the coming months.\n\nAnd pointing out the base’s comparative proximity to D.C., Trump took the opportunity to boast about his “takeover” of the nation’s capital by deploying hundreds of National Guard troops around the District of Columbia and flooding the streets with members of federal law enforcement, including ICE. He vowed imminent deployments of National Guard troops to Memphis and Chicago.\n\n“We’re doing it like nobody’s ever done it before. So I just want to tell you: you’re very close to D.C.; the restaurants are thriving. The restaurants were dying. They were closing, one after another. Now they’re opening up, they’re thriving.”\n\n“It’s a safe place now, our nation’s capital,” he added.\n\nThe president packed up and returned to the White House after his speech but passed out challenge coins to Navy brass at the event and also met with service members and posed for photos on board the USS George H.W. Bush.\n\nOn Monday, the White House is set to decide whether a deal with Democrats is possible to reopen the federal government and end a shutdown that will be entering its sixth day, the president’s economic adviser Kevin Hassett said Sunday. Republicans and Democrats left Washington over the weekend without a deal, and members of the House departed for a district work period set to last the entire coming week.\n\nIf a deal is not reached, Trump and other administration officials with the backing of some congressional Republicans have threatened to begin mass federal layoffs.\n\nIn the Senate, a handful of Democrats could break ranks to support ending the shutdown but for now, the party is in near-lockstep behind the strategy of withholding the votes necessary to break a filibuster until Republicans agree to extend subsidies for health care plans on the Affordable Care Act public exchanges.\n\nThose subsidies are due to end with the new year and spike premiums for many Americans.","url":"https://uk.news.yahoo.com/don-t-worry-coming-trump-232348987.html","image":"https://s.yimg.com/ny/api/res/1.2/dj4uEWWNvhbN71xmE7H99A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/5ca4218496cfdd35fa1871939ebf5e74","video":null,"publish_date":"2025-10-05 23:23:48","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.042},{"id":366498306,"title":"Harvard needs to answer for ‘hunting rats’ prof who shot near a synagogue","text":"A Harvard Law School visiting professor shot a potentially lethal pellet rifle, twice, near a Brookline, Mass., synagogue on the eve of Yom Kippur.\n\nThen, the overeducated alleged firearms enthusiast physically resisted guards attempting to detain him.\n\nAnd when authorities caught up with the shooter, Carlos Portugal Gouvea, 43, at his residence, he offered this novel excuse for unloading the weapon ahead of the Jewish Day of Atonement:\n\nHe said he was “hunting rats.”\n\nSeriously? In a residential neighborhood outside Boston?\n\nAt a house of God, just ahead of one of the holiest days of the Jewish calendar?\n\nJews at worship, terrorized by a prof who runs a think tank in his native Brazil focused on “social and environmental justice.”\n\nThe frightening incident unfolded Wednesday when two private security guards working at Temple Beth Zion in Brookline confronted Gouvea after hearing two loud shots and spotting him holding the pellet rifle, according to a police report. \n\nAs they approached the suspect, a “brief physical struggle” ensued with the guards. Gouvea then ran into his nearby residence before coming out moments later. He was handcuffed by cops and arrested.\n\nOfficers later found a shattered car window with a pellet lodged into the vehicle, according to a police report, demonstrating how close synagogue attendees came to grave injury. Or worse.\n\nGouvea is a Harvard Law School alumnus who earned a doctorate from the university in 2008 and also serves as an associate professor at the University of São Paulo Law School in Brazil. \n\nHe was arraigned Thursday in Brookline District Court, charged with illegally discharging a pellet gun, disorderly conduct, disturbing the peace and malicious damage of personal property. He pleaded not guilty to it all.\n\nAdding outrage to injury, a judge then sent the shooter on his way on his own recognizance. Despite the close call with violence, no bail was set. Gouvea was simply instructed to come back to court in early November.\n\nAs of now, Gouvea has not been fired from Harvard Law. He “has been placed on administrative leave as the school seeks to learn more about this matter,” Jeff Neal, spokesman for Harvard, told The Post.\n\nI suppose the worshipping public will just have to take comfort in the fact that the professor was a lousy shot. Will he be next time?\n\nWhy aren’t Jews adequately protected from potential harm?\n\nSynagogue attacks are serious business. On Thursday, two men were killed and three others seriously injured after a man drove into pedestrians near a synagogue near Manchester, England, and began stabbing people with a knife before being shot dead by police.\n\nMeanwhile, the administration of President Donald Trump has accused Harvard of failing to protect Jewish and Israeli students from harassment, and threatened to withdraw billions in federal funding unless major reforms were enacted. \n\nHarvard has countered with a lawsuit challenging the legality of the government’s actions, even as both sides near a possible settlement.\n\nBut Harvard’s blasé attitude towards the latest incident demonstrates that it’s business as usual.\n\nWe need answers now.","summary":"When authorities caught up with the shooter, Carlos Portugal Gouvea, he said he was \"hunting rats.\"","url":"https://nypost.com/2025/10/05/opinion/harvard-needs-to-answer-for-hunting-rats-prof-who-shot-near-a-synagogue/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/pedestrian-casts-shadow-harvard-university-112523690_f0db6e-e1759704866498.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/A0HFl0YW-RyIcpnTz.mp4","publish_date":"2025-10-05 23:22:42","author":"Andrea Peyser","authors":["Andrea Peyser"],"language":"en","source_country":"us","sentiment":-0.501},{"id":366488694,"title":"Is Sanae Takaichi Japan’s Margaret Thatcher — or its next Liz Truss?","text":"Under the slogan “#ChangeLDP”, Japan’s long-ruling Liberal Democratic Party (LDP) has elected Sanae Takaichi as its new leader. Pending a vote in the Diet’s lower house later this month, she is poised to become Japan’s next prime minister — and the first woman ever to hold the post.\n\nAt first glance, this appears historic. Takaichi is not only the LDP’s first female leader, but also one of the few postwar politicians to rise without inheriting a family seat. In a political culture dominated by male dynasties, her ascent seems to signal long-overdue change. In a country long criticised for gender inequality, it is a powerful image of progress.\n\nIn reality, however, Takaichi’s rise reflects a return to familiar politics. Her predecessor, Shigeru Ishiba, resigned after a year in office following electoral defeats. Those losses were not solely his doing. Ishiba had vowed to reform the LDP after scandals over ties to the Unification Church and slush funds, but he faced entrenched resistance. \n\nAs the party’s old factions re-emerged, senior figures rallied behind Takaichi’s leadership bid, reasserting the factional networks that have long defined Japanese conservatism. Takaichi has already signalled a return of the party’s old elite to the centre of power, while moving to end efforts to hold those involved in past scandals accountable.\n\nTakaichi’s victory signals a party operating in crisis mode. In recent months, the LDP has lost voters to new populist right-wing parties such as Sanseito. To stop the bleeding, it has shifted toward a harder conservative line. \n\nThis pattern of “crisis and compensation” is not new. In the 1970s, threatened by the left, conservatives adopted welfare and environmental policies to retain power. Today, facing challenges from the populist right, the LDP has leaned on nationalism, anti-immigration rhetoric and historical revisionism. \n\nA self-described social conservative, Takaichi opposes allowing married couples to retain separate surnames and rejects female succession to the imperial throne. She has expressed admiration for former British prime minister Margaret Thatcher, though whether her premiership will prove equally transformative remains to be seen.\n\nA close ally of the late Shinzo Abe, Takaichi is widely viewed as the torchbearer of his political legacy. Economically, she pledges to continue the expansionary fiscal and monetary policies of “Abenomics”, prioritising growth over fiscal restraint. \n\nWith Japan’s debt-to-GDP ratio exceeding 260%, Takaichi has remained vague about how she would sustainably finance her plans to ease economic pressures on households. \n\nPolitically, she seeks to complete Abe’s project of “taking Japan back” from the constraints of the postwar regime, by revising the pacifist constitution and strengthening national defence. \n\nIn foreign policy, Takaichi supports Abe’s vision of a “Free and Open Indo-Pacific”. She advocates deeper cooperation with the United States and within the Quad, comprised of the US, Australia, Japan and India. She also supports stronger regional partnerships to bolster deterrence. \n\nHer hawkish stance on China and North Korea aligns with this agenda. She has vowed to increase defence spending — a move likely welcomed by the Trump administration in the US, which has urged Tokyo to approach NATO’s 5% benchmark. Japan’s defence budget is currently about 1.8% of GDP.\n\nTakaichi also inherits a pending trade deal with Washington involving a Japanese investment package worth US$550 billion (A$832 billion), though many details remain unresolved. \n\nMeanwhile, her record of visiting the controversial Yasukuni Shrine — which honours Japan’s war dead, including convicted war criminals — risks undoing recent progress in relations with South Korea and inflaming tensions with China. Such moves could undercut Japan’s efforts to act as a stabilising force in regional security.\n\nDomestically, Takaichi’s greatest challenge will be to unite a fragmented LDP while addressing an increasingly frustrated electorate. Voters facing stagnant wages and rising living costs may have little patience for ideological battles. \n\nHer incoming cabinet will also face a divided Diet (Japan’s parliament), where the LDP lacks majorities in both chambers. Expanding the ruling coalition is one option, but the LDP’s long-time partner Komeito remains wary of constitutional revision and nationalist policies. Takaichi has already hinted at courting newer populist parties that share her support for an anti-espionage law and tighter immigration controls.\n\nIn many respects, Takaichi’s rise encapsulates the LDP’s enduring survival strategy — adaptation without reinvention. The party’s claim to renewal masks a deeper continuity: reliance on charismatic conservative figures to preserve authority amid voter fatigue and opposition weakness. Her leadership may consolidate the LDP’s right-wing base, but offers little sign of institutional reform or ideological diversity.\n\nSo whether her premiership brings transformation or merely reinforces old patterns remains uncertain. Her commitment to economic stimulus may buy time, but Japan’s deeper structural challenges — ageing demographics, inequality, and regional decline — demand creativity the LDP has long deferred. If Takaichi focuses instead on constitutional revision and identity politics, she risks alienating centrist voters and exhausting public patience for culture wars.\n\nA visit from US President Donald Trump later this month and series of regional summits will provide her first diplomatic test. It will also offer a glimpse of how she balances assertive foreign policy with domestic credibility. Much will depend on her ability to convince a sceptical electorate that her leadership represents more than another chapter in the LDP’s politics of survival.\n\nIf she succeeds, Takaichi could redefine Japanese conservatism and secure a lasting legacy as her country’s first female prime minister. If she fails, the comparison to “Japan’s Margaret Thatcher” may quickly fade — replaced by that of Liz Truss, another short-lived leader undone by party division and unmet expectations.","summary":"The rise of Japan’s first female leader is being hailed as a transformative moment for Japan. But in truth it may be more adaptation than reinvention.","url":"https://theconversation.com/is-sanae-takaichi-japans-margaret-thatcher-or-its-next-liz-truss-266478","image":"https://images.theconversation.com/files/694467/original/file-20251005-56-keqpy2.jpg?ixlib=rb-4.1.0&rect=0%2C375%2C6545%2C3272&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-10-05 23:20:41","author":"Associate Professor,Contemporary Japanese Politics & Society,International Relations,Sebastian Maslow,University of Tokyo","authors":["Associate Professor","Contemporary Japanese Politics & Society","International Relations","Sebastian Maslow","University of Tokyo"],"language":"en","category":"entertainment","source_country":"AU","sentiment":0.377},{"id":366488692,"title":"Labor retains big lead in Newspoll and all other federal polls","text":"Labor retains a large lead in three new national polls including Newspoll, while many more voters thought Labor’s 2035 emissions reduction target too ambitious rather than not ambitious enough.\n\nA national Newspoll, conducted September 29 to October 2 from a sample of 1,264, gave Labor a 57–43 lead, a one-point gain for the Coalition since the previous Newspoll, three weeks ago.\n\nPrimary votes were 37% Labor (up one), 28% Coalition (up one), 12% Greens (down one), 11% One Nation (up one) and 12% for all Others (down two). It’s the highest primary vote for Labor since June 2023, while the Coalition’s primary vote has recovered one point from a record low last time.\n\nAnthony Albanese’s net approval was up four points to -1, with 48% dissatisfied and 47% satisfied. Sussan Ley’s net approval slid three points to a new low of -20, and she has lost 11 points on net approval since August. Albanese led Ley as better PM by 52–30 (51–31 previously).\n\nOn house prices, 34% wanted them to increase relative to inflation, 30% stay the same and 30% decrease. About 40% of those who either owned their houses outright or with a mortgage wanted prices to increase, but 60% of renters wanted prices to decrease.\n\nHere is the graph of Albanese’s net approval in Newspoll. The plus signs show the individual polls and a trend line has been fitted.\n\nThe trendline shows Albanese’s ratings recovered from their lows before the May federal election, and have continued their recovery. However, his ratings are far below where they were at the start of Labor’s first term.\n\nDespite generally negative ratings for Albanese, Labor had its biggest win in a federal election since 1943, and they have continued to dominate the polls since that election, with the Coalition remaining uncompetitive in all polls.\n\nI believe Labor’s dominance is much more due to voters’ dislike for the alternative government than their liking for Labor and Albanese. Donald Trump is a key negative for the Coalition in Australia.\n\nWhile One Nation’s support is increasing and they are now ahead of the Greens in some polls, their increased support has come at the Coalition’s expense, leading to clear Labor leads on primary votes as well as two-party.\n\nEssential poll\n\nA national Essential poll, conducted September 24–28 from a sample of 1,001, gave Labor a 51–44 lead by respondent preferences including undecided. Primary votes were 35% Labor, 27% Coalition, 13% One Nation, 11% Greens, 8% for all Others and 6% undecided.\n\nThe all Others vote share is likely too low, with all Others getting 15% at the May election. By 2025 election preference flows, this poll would give Labor above a 55–45 lead.\n\nAlbanese’s net approval was down eight points since August to -2, while Ley’s net approval was down seven to -9.\n\nOn Australia’s recently announced 2035 emissions target of 62–70% below 2005 levels, 48% said it was about right, 39% too ambitious and just 13% not ambitious enough. By 67–33, respondents did not think it likely we would meet this target.\n\nBy 60–40, respondents thought it was important for Albanese to meet Donald Trump. By 58–17, they wanted Australia to be less like the US. By 44–22, they were generally pessimistic about the future.\n\nOn immigration, 53% thought the 2025/26 financial year cap of 185,000 places too high, 40% about right and just 7% too low. Respondents were tied 41–41 on whether immigration was generally positive or negative for Australia (a 42–42 tie in August 2024).\n\nBy 34–30, respondents supported Australia recognising Palestine, unchanged since August. By 63–19, they supported the social media ban on children under 16 years (67–17 in September 2024).\n\nYouGov poll\n\nThe Poll Bludger reported a national YouGov poll, conducted September 25–30 from a sample of 1,329, gave Labor a 56–44 lead. Primary votes were 34% Labor, 27% Coalition, 12% Greens, 12% One Nation, 8% independents and 7% others.\n\nAlbanese’s net approval was -4, while Ley’s net approval was -19. Albanese led Ley by 50–28 as better PM.","summary":"The latest federal opinion polling has put Labor clearly ahead of the struggling Liberals. Support for One Nation is stronger than for the Greens in some results.","url":"https://theconversation.com/labor-retains-big-lead-in-newspoll-and-all-other-federal-polls-266376","image":"https://images.theconversation.com/files/694472/original/file-20251005-56-yp1bf0.jpg?ixlib=rb-4.1.0&rect=0%2C554%2C6637%2C3318&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-10-05 23:15:32","author":"Adrian Beaumont,Election Analyst Psephologist at The Conversation; and Honorary Associate,School of Mathematics and Statistics,The University of Melbourne","authors":["Adrian Beaumont","Election Analyst Psephologist at The Conversation; and Honorary Associate","School of Mathematics and Statistics","The University of Melbourne"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.052},{"id":366495814,"title":"China hawks grow queasy over Trump’s push for deals with Beijing","text":"U.S. President Donald Trump rewrote Washington’s rules for dealing with China in his first presidency, embracing confrontation, launching a trade war and upending decades of policy. In his second term, China hawks in Washington fear that Trump is going soft.As Trump pursues a trade pact with the U.S.’s biggest economic and strategic rival, advocates of a tougher China policy fear they’re being sidelined inside the administration as the tech industry’s influence grows — alongside the president’s appetite for what he’s called 'a big deal.” That concern has grown more urgent as Trump looks toward a meeting with Chinese leader Xi Jinping that’s expected in the coming weeks. In the leadup, China has made a series of demands that would upend decades of U.S. policy, including looser curbs on investment in exchange for more inflows, and eroding U.S. support for Taiwan.","summary":"As Trump pursues a trade pact with the U.S.’s biggest economic and strategic rival, advocates of a tougher China policy fear they’re being sidelined inside the administration.","url":"https://www.japantimes.co.jp/news/2025/10/06/asia-pacific/politics/china-hawks-trump-deal/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/10/06/497904.jpg?v=3.1","video":null,"publish_date":"2025-10-05 23:15:00","author":"Ed Ludlow,Kate Sullivan,Shawn Donnan,Web Master","authors":["Ed Ludlow","Kate Sullivan","Shawn Donnan","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":0.371},{"id":366491320,"title":"‘Something Nobody Wants To See’: Trump’s ‘Move Fast’ Warning Amid Israel-Hamas Talks","text":"US President Donald Trump said over the weekend that “very positive discussions” have been taking place between Hamas and Arab and Muslim mediators, aimed at securing the release of hostages, ending the war in Gaza, and achieving “peace in the Middle East.” He shared the update in a post on Truth Social. Trump wrote that the talks have been “very successful, and proceeding rapidly,” and added that “technical teams” would meet again on Monday in Egypt to work through the final details. He urged everyone involved to “MOVE FAST,” noting that the “first phase” of the talks could be completed this week. It is not yet clear if this means hostages may begin to be released soon. Israeli Prime Minister Benjamin Netanyahu expressed hope that hostages could be freed during the upcoming Sukkot holiday, which begins Monday evening and lasts one week, immediately followed by Simhat Torah, marking the anniversary of Hamas’s October 7 attack. Trump concluded his post with a warning about the urgency of the situation, saying, “TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW — SOMETHING THAT NOBODY WANTS TO SEE!” The statement comes as leaders continue efforts to negotiate an end to hostilities in Gaza and secure the safe return of hostages amid ongoing tensions in the region. Senior Hamas leader Khalil al-Hayya arrived in Egypt on Sunday to lead a delegation for indirect talks with Israel. The negotiations, scheduled to start Monday in the Egyptian resort city of Sharm al-Sheikh, are focused on securing a ceasefire in Gaza and arranging a hostage-prisoner exchange, according to a report by AFP. This is Hayya’s first formal appearance since Israeli airstrikes in Doha last month reportedly targeted him and other Hamas leaders. Before traveling to Egypt, Hayya made a pre-recorded television statement from Qatar, which, along with Egypt and the United States, is playing a key role in mediating the talks. In a statement, Hamas said its delegation is working on “mechanisms for a ceasefire, the withdrawal of occupation forces, and a prisoner exchange.” Both Hamas and Israel have reportedly responded positively to US President Donald Trump’s proposed roadmap, which involves releasing Israeli hostages held in Gaza in exchange for Palestinian prisoners in Israeli jails. However, many details of the plan are still being worked out.","summary":"US President Donald Trump said “very positive discussions” are underway between Hamas and Arab and Muslim mediators to secure hostage releases and end the Gaza war. He urged negotiators to “move fast,” saying the first phase could be completed this week. Israeli Prime Minister Netanyahu also expressed hope hostages might be freed during the Sukkot holiday.","url":"https://www.timesnownews.com/world/middle-east/something-nobody-wants-to-see-trumps-move-fast-warning-amid-israel-hamas-talks-article-152947146","image":"https://images.timesnownews.com/thumb/msid-152947145,thumbsize-18062,width-1280,height-720,resizemode-75/152947145.jpg","video":null,"publish_date":"2025-10-05 23:14:07","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","category":"politics","source_country":"in","sentiment":-0.174},{"id":366491884,"title":"Trump does not let government shutdown interfere with Navy’s 250th anniversary","text":"US President Donald Trump did not let the government shutdown interfere with a stop in Norfolk, Virginia on Sunday to salute the Navy as it celebrates its 250th anniversary, using his speech to praise both the Navy and himself.\nTrump delivered remarks that by his own recognition bordered on making it more like a campaign event, generating some cheers from the crowd before closing with a recording of his theme song, “YMCA” by Village People.\n“Let’s face it, this is a rally,” Trump told the crowd of about 10,000 sailors in their dress-white uniforms.\nNavy planes flew overhead as the president began his speech, fuelling the crowd’s energy and prompting many of the sailors to chant “USA! USA! USA!”\nThe president spoke on a pier between two towering Navy vessels, an aircraft carrier and an amphibious assault ship. The carrier displayed a Navy fighter jet, which had the words “President Donald J. Trump ‘45-47’” printed on the fuselage right under the cockpit window.\nThe Republican president criticised his political opponents and attacked Democratic lawmakers as the shutdown entered its fifth day, causing military staff to work without pay until the government reopens.\n“I want you to know that despite the current Democrat-induced shutdown, we will get our service members every last penny. Don’t worry about it,” Trump said to cheers from the crowd.\nThe government shutdown that began on Wednesday has sparked partisan blame games as several thousand federal employees are furloughed and key infrastructure and energy projects in Democratic-run areas such as New York and Chicago have been put on hold.\nIt lurked in the background of the event as Trump praised a Navy that he said has “never failed to hunt, kill and win”.\n\nSenate Democrats rejected efforts to preserve a continuation of government operations when the new budget year started on Wednesday.\nThey cited the lapse in subsidies that could cause health insurance costs to climb rapidly for people who get coverage through the 2010 Affordable Care Act.\nDemocratic lawmakers also have sought to reverse cuts to Medicaid that Trump signed into law.\nDemocrats oppose Trump’s move to have his administration decline to spend congressionally approved funds, saying it undermines the budgeting process, among other concerns.\nMeanwhile, Trump has explored laying off federal workers at what he called “Democrat Agencies”.\nAmong those joining Trump for the festivities were First Lady Melania Trump, Defence Secretary Pete Hegseth, Navy Secretary John Phelan, Veterans Affairs Secretary Doug Collins and Texas Congressman Ronny Jackson, a former Navy rear admiral who was a White House doctor during Trump’s first term.\nAfter his arrival in Norfolk, Trump went to the USS George H.W. Bush and spoke to the sailors.\nThe Trumps then watched a military demonstration while standing on the deck of the aircraft carrier. Navy destroyers launched missiles and fired shells into the Atlantic Ocean, Navy SEALs descended from helicopters and fighter jets catapulted off.\n\nThe US president has increasingly sought to leverage support from within the military as he has escalated its role in American society, asking troops to patrol the streets of cities, including Los Angeles, Washington, Chicago, Memphis, Baltimore and Portland, Oregon.\nCalifornia Governor Gavin Newsom on Sunday said Trump was seeking to send his state’s National Guard to Portland after the administration’s previous moves to deploy troops in the Oregon National Guard were blocked in court.\nIn his June speech for the 250th anniversary of the Army, Trump similarly broke down presidential norms by calling protesters in Los Angeles “animals” and “a foreign enemy”, claims that left some in the audience feeling uneasy.\nThe sailors on Sunday were far more engaged and responsive to the president’s jokes and political quips than the military’s top brass were at a meeting on Tuesday at a base in Quantico, Virginia. They had been abruptly summoned by Hegseth from across the globe.\nIn his speech to the generals, Trump proposed using US cities as training grounds for the armed forces and he spoke of needing military might to combat what he called the “invasion from within”.\nHegseth declared an end to “woke” culture and announced new directives for troops that include “gender-neutral” or “male-level” standards for physical fitness.\nThe administration is seeking to reshape Pentagon culture and use military resources for the president’s priorities, including quelling domestic unrest and violent crime.\nTrump has also engaged the military in an armed conflict with drug cartels, leading to four strikes on boats in the Caribbean that Washington says were involved in trafficking.","summary":"US President Donald Trump did not let the government shutdown interfere with a stop in Norfolk, Virginia on Sunday to salute the Navy as it celebrates its 250th anniversary, using his speech to praise both the Navy and himself.\nTrump delivered remarks that by his own recognition bordered on making it more like a campaign event, generating some cheers from the crowd before closing with a recording of his theme song, “YMCA” by Village People.\n“Let’s face it, this is a rally,” Trump told the crowd...","url":"https://www.scmp.com/news/world/united-states-canada/article/3327941/trump-does-not-let-government-shutdown-interfere-celebrating-navys-250th-anniversary","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/06/83f136c6-e100-4a04-b9d3-7bc54d898258_80cd6d22.jpg","video":null,"publish_date":"2025-10-05 23:12:02","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":0.01},{"id":366486958,"title":"Rob Reiner Says U.S Will Become An ‘Autocracy’ If Trump Is Allowed to ‘Control the Media’ and ‘Commandeer the Election’: ‘We Have a Year’ to Stop Him","text":"During a recent appearance on MSNBC, Oscar-nominated director Rob Reiner issued a call to action against Donald Trump. He said it is “our job now” as influential voices to fight against the president’s insertion of the National Guard into major cities, as well as his attacks on free speech. He added that Trump’s efforts to […]","summary":"During a recent appearance on MSNBC, Oscar-nominated director Rob Reiner issued a call to action against Donald Trump. He said it is &#8220;our job now&#8221; as influential voices to fight against the president&#8217;s insertion of the National Guard into major cities, as well as his attacks on free speech. He added that Trump&#8217;s efforts to [&#8230;]","url":"https://variety.com/2025/film/news/rob-reiner-autocracy-trump-control-media-election-1236540712/","image":"https://variety.com/wp-content/uploads/2025/10/MixCollage-05-Oct-2025-03-52-PM-6119.jpg","video":null,"publish_date":"2025-10-05 23:09:11","author":"Jack Dunn","authors":["Jack Dunn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.546},{"id":366498424,"title":"Legault urges stronger U.S.-Canada ties amid trade tensions at summit","text":"QUÉBEC — Quebec Premier François Legault urged the need for strong collaboration between the states and provinces that despite current trade uncertainties between Canada and the United States.\n\n“The big elephant in the room is the uncertainty about the relationship between Canada and the United States, so, we really need to know where we’ll be in one year, in two years, in four years, in 10 years,” Legault told the Great Lakes St. Lawrence Governors and Premiers Leadership Summit being held in Quebec City on Sunday.\n\nThe biennial meeting, being held this year in Quebec City, brings together leaders and representatives from eight states and Ontario. It’s the group’s first meeting since the return of U.S. President Donald Trump to the White House.\n\nLegault could not sidestep the issue of tariffs — something he said hasn’t been good for either country.\n\nThe gathering comes as Prime Minister Mark Carney heads to Washington, D.C. on Monday and will meet with Trump on Tuesday.\n\nLegault touched on a number of strategic decisions will need to be taken on different subjects like critical minerals, defence spending, the digital economy and artificial intelligence. Canada and Quebec will have to consider diversifying to be less dependent on the United States, he said.\n\n“But that said geography will not change, the St. Lawrence and the Great Lakes will continue to be interdependent, and in the long term beyond temporary upheavals the only way forward is to always strengthen our ties and collaboration,” Legault said.\n\nLegault raised a number of issues and goals during an opening speech, including the strengthening economic partnerships and themes such as defence spending, critical minerals, an energy boom, aerospace, aluminum, and of course, the ever-present tariffs.\n\nLegault noted that Canada would like to renegotiate North America’s free trade pact — United States-Mexico-Canada Agreement (CUSMA) — as soon as possible because it’s due for review next July.\n\nAnd for the Quebec premier, it’s clear that in those negotiations no compromise can be made on supply management for the dairy industry, which Trump would like to see end.\n\nThe policy is controlling production of dairy products, eggs, chicken and turkey to prevent significant shifts in price while imposing restrictions on imports of those products to keep prices stable. U.S. farmers have long wanted a bigger piece of the Canadian market.\n\nThe other non-negotiable for Legault is the protection of the French language.\n\n“When we talk about what’s written on different products, it has to be bilingual,” Legault said. “I know Mr. Trump doesn’t like that, but we need that.”\n\nThere’s also the future of the digital economy and artificial intelligence, which means an explosion in demand for electricity and for all to benefit from the boom to follow, Legault said.\n\nThe meeting wraps up Monday with a Quebec City news conference that Legault and Ontario Premier Doug Ford, who Legault said wasn’t present on Sunday, are expected to attend.\n\nThis report by The Canadian Press was first published Oct. 5, 2025.\n\n— By Sidhartha Banerjee in Montreal\n\nThe Canadian Press","summary":"QUÉBEC — Quebec Premier François Legault urged the need for strong collaboration between the states and provinces that despite current trade uncertainties between Canada and the United States. &#8220;The big elephant in the room is the uncertainty about the relationship between Canada and the United States, so, we really need to know where we&#8217;ll be [&#8230;]","url":"https://toronto.citynews.ca/2025/10/05/legault-urges-stronger-u-s-canada-ties-amid-trade-tensions-at-summit/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/10/8de0b9e39c09dd3210e8aa3b30d495a7006e7695fcf9040d8f6d40d5aeaef90e.jpg","video":null,"publish_date":"2025-10-05 23:08:19","author":"News Staff,The Canadian Press","authors":["News Staff","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.072},{"id":366490100,"title":"Idaho Victim’s Mother Shares Why She’s Content Without Knowing the Motive","text":"Ethan Chapin’s mother might never know why Bryan Kohberger murdered her son.\n\nAnd she doesn’t need to. ‘It doesn’t change the outcome,’ Stacy Chapin told the Daily Mail in an exclusive interview. \n\n‘You can burn up so much energy and time on it, but it doesn’t bring Ethan back.’\n\nDespite admitting guilt and receiving a life sentence, the reasons behind Kohberger’s decision to invade a house in Moscow, Idaho, and murder Ethan Chapin, Xana Kernodle, Madison Mogen, and Kaylee Goncalves in November 2022 remain a baffling conundrum.\n\nInvestigators found no motive nor any connection between the killer and his victims.\n\nAnd Kohberger himself has offered no explanation – refusing the opportunity to speak at his sentencing.\n\nSome relatives of the victims have expressed dissatisfaction with the fact that the plea agreement did not require the killer to disclose his motivations.\n\nEven former President Donald Trump commented on this, expressing hope that Judge Steven Hippler would demand the explanation for these heinous acts during the sentencing.\n\nBut, for the mother of 20-year-old Ethan, she is not going to waste time searching for answers to questions that will never make sense.\n\n‘We always go back to the beginning: it doesn’t bring Ethan back,’ Stacy said.\n\n‘So we just have to spend time doing what’s good for our family.’\n\nWhile she respects the feelings of the other families, for Ethan’s father Jim and his triplet siblings Maizie and Hunter, understanding Kohberger’s motive would not alleviate the deep grief of their loss.\n\n‘Everybody has the right to feel how they want to feel, but I don’t know how knowing the motive changes anything,’ she said.\n\n‘Even if there had been a three-month trial, we wouldn’t have uncovered that. Kohberger was unlikely to testify and clarify his motives,’ she noted.\n\nFor the best part of three years, 30-year-old Kohberger fought the charges over the November 13, 2022, murders.\n\nA few weeks before the trial was set to begin, he confessed and negotiated a plea with prosecutors, thus avoiding the death sentence.\n\nThe Chapin family supported the deal, which ensured Kohberger would never be able to walk free from prison.\n\nHad the case gone to trial, Stacy said there would always have been a risk that one juror might not have found the evidence substantial enough and Kohberger would have been acquitted. \n\n‘And even if he had gotten the death penalty at trial, he would not have died in my husband and my lifetimes. So he would have been left for our kids to have to handle. And he would have had opportunities to appeal it,’ Stacy said.\n\n‘This way he is just put away. We do not have to hear from him ever again. For our family, that was the better option.’\n\nStacy, Jim, Maizie and Hunter all attended Kohberger’s change of plea hearing at Ada County Courthouse in Boise on July 2 in support of the agreement.\n\nIt marked the first and only time the Chapins came face-to-face with Ethan’s killer, as they watched him finally admit to his brutal crimes.\n\nThree weeks later, on July 23, Judge Hippler sentenced Kohberger to four life sentences with no possibility of parole for each count of first-degree murder and an additional 10 years for burglary.\n\nUnder the terms of the deal, Kohberger also waived his right to ever appeal. He is now being held in the Idaho Maximum Security Institution in Kuna where he will live out his dying days.\n\nStacy said the Chapins decided not to attend the sentencing hearing to give victim impact statements because they had nothing to say to her son’s killer.\n\n‘There was nothing left to say, I guess,’ she said, adding: ‘That was just us.’\n\nInstead, the family spent the day together at their home in Priest Lake, Idaho, honoring the athletic, outgoing 20-year-old.\n\nWhen asked how she wants her son to be remembered, Stacy said: ‘He was just an amazing kid. Going all the way back to them as three babies bouncing in their seats, he was always the easiest child.’\n\nShe added: ‘There’s nothing of those 20 years with Ethan that I would go back and change. He was that great of a kid. He was amazing. \n\n‘I’m thankful to have had him for those 20 years.’\n\nEthan had been in his freshman year at the University of Idaho, where he majored in sports management and was part of the Sigma Chi fraternity. He was in a relationship with Kernodle and was staying at her student home on the edge of the college campus on the night of Kohberger’s attack.\n\nFor the Chapin family, knowing Kohberger is now behind bars for life has brought some closure and has finally drawn a line under three years of agony.\n\n‘He’s put away. He’s where he belongs,’ Stacy said.\n\n‘In our family’s opinion, it’s over.\n\n‘We’ve been doing this now for almost three years. It will be three years in November, and it’s time for us to do something different. It’s time to move on.’\n\nWhile life will always look different for the Chapin family to before Ethan’s murder, with the court proceedings now behind them, Stacy feels they can finally move forward and focus on the future. \n\nStacy beams with pride when she speaks of the strength she has seen in Maizie and Hunter and their plans for adult life.\n\n‘My kids are amazing. They’re great. They are more resilient than we are,’ she said.\n\n‘We put them through counseling and the mental health pieces – whatever they needed to get through this.\n\n‘Now they’re like: “Okay, let’s move forward from this event.”‘\n\nMaizie and Hunter both attended UI with Ethan. They returned to their studies and college life in Moscow for the 2023 spring semester – mere weeks after Kohberger’s arrest.\n\nThis May, they both graduated.\n\nStacy proudly revealed that Hunter is now planning to become a firefighter while Maizie has started working at a hospital.\n\n‘They’re doing amazing,’ she said. ‘It feels like we are finally moving forward.’\n\nPart of moving forward also includes using the family’s tragic experience to be a voice for other families who will find themselves in similar situations in future. \n\nAfter the plea deal was struck and the gag order lifted in the case, Stacy connected with Othram – the forensic genetic genealogy lab which identified Kohberger as the source of the DNA found on the knife sheath left at the scene.\n\nThe Texas-based lab’s advanced technology meant that the killer was identified and arrested within six weeks of the murders, bringing some answers to the victims’ families and preventing Kohberger from tearing apart any other families.\n\nStacy, Jim and Maizie have since all visited Othram’s lab and met with the team, led by David and Kristen Mittelman.\n\nNow, they hope to work together to advocate for greater access to the lab’s capabilities so that more families can get answers about their loved ones’ cases quickly.\n\nThe Chapin family also runs the Ethan’s Smile Foundation which they launched in 2023 to provide scholarships in Ethan’s honor. \n\nAs of May 2025, the foundation has awarded $105,750 in scholarships to 83 students. Stacy, Jim, Maizie and Hunter all sit on the board. \n\nThe Chapins have other plans for the future too.\n\nFor Stacy and Jim, Ethan’s murder derailed the next chapter in their lives – a time when their kids were off at college, entering adult life, so as parents they were looking at the own next steps.\n\n‘Jim and I had just started – before this whole thing – trying to live a life that was without our kids and doing a little traveling and figuring out what’s next,’ she said.\n\nNow, it’s finally time to get those plans back on track.\n\n‘We’re there right now. We’re just in the process of getting our kids where they need to be and settled into their next lives – where we all feel like we’re moving forward,’ she said.\n\nStacy hasn’t decided where exactly those travel plans will take her and Jim yet – but there’s one thing top of the list.\n\n‘I’m just going to go sit on a beach somewhere,’ she laughed. ‘I don’t even know where. I’m like, “I’m out.”‘","summary":"Internewscast Journal\n\nInternewscast\n\n\nEthan Chapin&#8217;s mother might never know why Bryan Kohberger murdered her son.&#8230;\n\n\nThis Post: Idaho Victim&#8217;s Mother Shares Why She&#8217;s Content Without Knowing the Motive first appeared on Internewscast Journal","url":"https://internewscast.com/news/idaho-victims-mother-shares-why-shes-content-without-knowing-the-motive/","image":"https://internewscast.com/wp-content/uploads/2025/10/Mom-of-Idaho-victim-reveals-why-she-is-happy-NEVER.jpg","video":null,"publish_date":"2025-10-05 23:03:20","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.175},{"id":366489402,"title":"Warning that Trump scrapping diversity orders could hurt global economic growth","text":"Women's campaigner Mariella Frostrup has cautioned that Donald Trump’s decision to abolish diversity policies represents a \"major backward step\" for workplace gender equality. \n\nThe broadcaster warned that the US president's executive orders, aimed at ending diversity, equity, and inclusion (DEI) programmes, risk \"dragging everybody backwards\" and could undermine recent advancements in gender equality. \n\nFrostrup further suggested these actions threaten to impede economic growth both in the US and globally.\n\nThe journalist and TV presenter, who co-founded the Women in Work Summit, told the PA news agency: “It’s a major backward step and slowly erodes their position as a leader.\n\n“I always imagined America to be the land of the free and the brave and where possibility was there for anyone who worked hard enough.\n\n“I think none of those things are proving to be true about America right now.”\n\nShe said by rolling back these initiatives, the US will start “slipping backwards in terms of their voice in the world and their economic power”.\n\n“It won’t happen overnight. But I think these are policies that drag everybody backwards,” she cautioned.\n\nMs Frostrup said firms in the UK may follow suit, but added she was “optimistic that this is just turbulence and that we’re heading in the right direction”.\n\nHer comments came as the Women in Work annual report on gender equality revealed that despite progress in companies overall meeting benchmarks, nine out of 10 male chief executives are replaced by men.\n\nWhen a female chief executive stands down, she is just as likely to be replaced by a man as another woman, it found.\n\nThere has been a recent flurry of female bosses quitting from top listed companies and being replaced by men, such as Dame Emma Walmsley from drug firm GSK and Diageo’s Debra Crew.\n\nData from professional networking site LinkedIn shows that three-quarters of UK companies have a lower proportion of women in leadership than in their overall workforce.\n\nThe findings show women fall behind at every stage of their career, with progression stalling the most between ages 30 and 50 when caregiving responsibilities peak.\n\nMs Frostrup, who was appointed the Government’s menopause employment ambassador last year, told PA: “There are a lot of women out there who’ve stepped back because they’ve had children, or indeed because they’ve found menopause symptoms too hard to deal with.”\n\nShe said they need support to help them back into the workplace “in proper jobs with proper pay”.\n\nThe Women in Work report reveals the number of Britain’s largest 400 companies meeting gender equality benchmarks has jumped by nearly a fifth (19 per cent) over the past year.\n\nThe report found 121 companies are meeting benchmarks across 24 sectors, covering female representation on company boards (above 33 per cent), gender pay gap (mean or median hourly pay gap under 15 per cent) and transparent parental leave policies.\n\nTen of these firms have earned their place on the “trailblazers” list with equal executive boards, pay gaps under 1 per cent and transparent parental policies.\n\nThis is more than double the number that achieved this status last year.\n\nMs Frostrup said “I’ve got confidence and assurance that things are going in the right direction and will continue to move in that direction, because every single area of economic endeavour appears to be now understanding that it’s sound business sense to have inclusive and diverse workforces.”\n\nShe added: “Just having a woman at the top is not what makes the difference. It’s changing the culture all the way through.”","summary":"Mariella Frostrup says Trump’s policies mark a major backwards step","url":"https://www.independent.co.uk/news/world/americas/trump-diversity-economic-growth-women-mariella-frostrup-b2839581.html","image":"https://static.independent.co.uk/2025/10/03/22/25/GettyImages-2237887276.jpg?crop=2505,1670,x0.5,y0&trim=0,1,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/XNHjbrga-4VHSaSK0.mp4","publish_date":"2025-10-05 23:03:00","author":"Holly Williams","authors":["Holly Williams"],"language":"en","source_country":"gb","sentiment":-0.131},{"id":366483938,"title":"EU Stresses Need to Strengthen EU-Gulf Cooperation to Confront Regional, Int. Challenges","text":"Kuwait, October 06 (QNA) - The European Union's (EU) High Representative for Foreign Affairs and Security Policy, Vice-President of the European Commission, Kaja Kallas, emphasized, Sunday, the importance of strengthening European-Gulf cooperation in confronting regional and international challenges, stressing the need to opt for diplomatic solutions as to achieve security and stability in the Middle East.\n\nThis came at the second high-level forum on regional security and cooperation between the Gulf Cooperation Council (GCC) and the EU taking place in Kuwait, with the participation of foreign ministers and senior officials from both sides.\n\nThe forum precedes the 29th joint ministerial meeting to be held Monday.\n\nKallas added that the common issues between the GCC and the European Union demonstrate convergence of interests and potential for future cooperation.\n\n\"The world needs more diplomacy and cooperation instead of confrontation, in order to enhance dialogue and understanding to achieve regional and international stability,\" she continued.\n\nThe EU High Representative for Foreign Affairs and Security Policy stated that the discussions focused on diplomatic challenges and opportunities in the Middle East through three main issues: Iran, maritime security in the Red Sea, and the situation in Gaza.\n\nRegarding the situation in the Gaza Strip, Kallas said that it represents a major challenge to the international order. She added that supporting the Gaza peace plan announced by US President Donald Trump is a significant development, emphasizing that achieving lasting peace in the Middle East must be based on the two-state solution, which enjoys international consensus. (QNA)","summary":"Kuwait, October 06 (QNA) - The European Union's (EU) High Representative for Foreign Affairs and Security Policy, Vice-President of the European Commission, Kaja Kallas, emphasized, Sunday, the importance of strengthening European-Gulf cooperation in confronting regional and international challenges","url":"https://qna.org.qa/en/news/news-details?id=eu-stresses-need-to-strengthen-eu-gulf-cooperation-to-confront-regional-int-challenges&date=6/10/2025","image":"https://cdn.qna.org.qa/media/v0nfr511/qna_gcc_europe050102025-1.jpg?width=1200&height=900&v=1dc365e8d793970","video":null,"publish_date":"2025-10-05 23:02:55","author":"Us President Donald","authors":["Us President Donald"],"language":"en","source_country":"qa","sentiment":0.217},{"id":366490756,"title":"Trump tells troops 'every last penny' coming despite ongoing government shutdown affecting military pay","text":"At a ceremony marking the U.S. Navy's 250th anniversary, President Donald Trump sought to reassure service members affected by the ongoing government shutdown, pledging they would receive \"every last penny\" of their pay and promising an \"across-the-board\" raise once the impasse ends. \"I want you to know that despite the current Democrat-induced shutdown, we will get our servicemembers every last penny,\" Trump said. \"Don't worry about it, it's all coming,\" he added. TRUMP SAYS GOVERNMENT SHUTDOWN LAYOFFS ARE 'UP TO' DEMS AS STANDOFF CONTINUES While active-duty troops continue to report for duty, their paychecks are frozen until funding is restored. Non-essential civilian War Department employees, including thousands who support base operations and logistics, have been furloughed. Meanwhile, military support programs — including child care centers, on-base commissaries, and other family services — have been scaled back at several installations, forcing families to shoulder unexpected costs. During a Sept. 30 speech at Quantico, before the nation's top generals, Trump said he was backing a 3.8% pay raise for every servicemember. \"Something you weren't getting from the past administration,\" Trump added. SHUTDOWN EXPLAINED: WHO WORKS, WHO DOESN'T AND HOW MUCH IT COSTS The federal government shut down at 12:01 a.m. ET on Wednesday, halting pay for U.S. service members and hundreds of thousands of other federal employees. The shutdown, now stretching into its fifth full day, has left military families facing financial uncertainty, even as Trump assured troops that back pay and additional raises would be forthcoming once Congress approves a new spending bill. CLICK HERE TO GET THE FOX NEWS APP The Trump administration has placed the blame squarely on Democrats for the government shutdown, which is expected to trigger sweeping layoffs across the federal workforce. Before departing for Norfolk, Trump accused Democrats in a Truth Social post Friday evening of enabling the shutdown and attempting \"to destroy this wonderful celebration of the U.S. Navy’s Birthday.\" \"I believe, ‘THE SHOW MUST GO ON!’\" Trump wrote.","summary":"Government shutdown freezes military paychecks as President Donald Trump assures troops aboard USS Harry S. Truman they will get back pay and 3.8% raise.","url":"https://www.foxnews.com/politics/trump-tells-troops-every-last-penny-coming-despite-ongoing-government-shutdown-affecting-military-pay","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/trump-navy-birthday.png","video":"https://www.foxnews.com/video/6382075426112","publish_date":"2025-10-05 23:02:19","author":"Amanda Macias","authors":["Amanda Macias"],"language":"en","category":"politics","source_country":"us","sentiment":-0.11},{"id":366496212,"title":"Trump’s diversity orders a ‘major step back’ in gender equality, Frostrup warns","text":"Donald Trump’s move to abolish diversity policies has been a “major backward step” for gender equality in the workplace and threatens to drag down economic growth in the US and globally, women’s campaigner Mariella Frostrup has warned.\n\nThe broadcaster said the US president’s decision to issue executive orders to end diversity, equity and inclusion (DEI) programmes would “drag everybody backwards” and risk undoing recent progress on boosting gender equality.\n\nThe journalist and TV presenter, who co-founded the Women in Work Summit, told the PA news agency: “It’s a major backward step and slowly erodes their position as a leader.\n\n“I always imagined America to be the land of the free and the brave and where possibility was there for anyone who worked hard enough.\n\n“I think none of those things are proving to be true about America right now.”\n\nShe said by rolling back these initiatives, the US will start “slipping backwards in terms of their voice in the world and their economic power”.\n\n“It won’t happen overnight. But I think these are policies that drag everybody backwards,” she cautioned.\n\nMs Frostrup said firms in the UK may follow suit, but added she was “optimistic that this is just turbulence and that we’re heading in the right direction”.\n\nHer comments came as the Women in Work annual report on gender equality revealed that despite progress in companies overall meeting benchmarks, nine out of 10 male chief executives are replaced by men.\n\nWhen a female chief executive stands down, she is just as likely to be replaced by a man as another woman, it found.\n\nThere has been a recent flurry of female bosses quitting from top listed companies and being replaced by men, such as Dame Emma Walmsley from drug firm GSK and Diageo’s Debra Crew.\n\nData from professional networking site LinkedIn shows that three-quarters of UK companies have a lower proportion of women in leadership than in their overall workforce.\n\nThe findings show women fall behind at every stage of their career, with progression stalling the most between ages 30 and 50 when caregiving responsibilities peak.\n\nMs Frostrup, who was appointed the Government’s menopause employment ambassador last year, told PA: “There are a lot of women out there who’ve stepped back because they’ve had children, or indeed because they’ve found menopause symptoms too hard to deal with.”\n\nShe said they need support to help them back into the workplace “in proper jobs with proper pay”.\n\nThe Women in Work report reveals the number of Britain’s largest 400 companies meeting gender equality benchmarks has jumped by nearly a fifth (19%) over the past year.\n\nThe report found 121 companies are meeting benchmarks across 24 sectors, covering female representation on company boards (above 33%), gender pay gap (mean or median hourly pay gap under 15%) and transparent parental leave policies.\n\nTen of these firms have earned their place on the “trailblazers” list with equal executive boards, pay gaps under 1% and transparent parental policies.\n\nThis is more than double the number that achieved this status last year.\n\nMs Frostrup said “I’ve got confidence and assurance that things are going in the right direction and will continue to move in that direction, because every single area of economic endeavour appears to be now understanding that it’s sound business sense to have inclusive and diverse workforces.”\n\nShe added: “Just having a woman at the top is not what makes the difference. It’s changing the culture all the way through.”","summary":"Women’s campaigner Mariella Frostrup said she is ‘optimistic’ as a report shows a 19% rise in big UK firms meeting gender equality benchmarks.","url":"https://www.independent.co.uk/news/business/trump-tv-presenter-emma-walmsley-linkedin-gsk-b2839818.html","image":"https://static.independent.co.uk/2025/10/06/00/02160416-f321cc5d-54a7-42ba-a9b4-8abf1b5776d3.png?width=1200","video":null,"publish_date":"2025-10-05 23:01:00","author":"Holly Williams","authors":["Holly Williams"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.067},{"id":366488420,"title":"Trump’s diversity orders a ‘major step back’ in gender equality, Frostrup warns","text":"Donald Trump’s move to abolish diversity policies has been a “major backward step” for gender equality in the workplace and threatens to drag down economic growth in the US and globally, women’s campaigner Mariella Frostrup has warned.\n\nThe broadcaster said the US president’s decision to issue executive orders to end diversity, equity and inclusion (DEI) programmes would “drag everybody backwards” and risk undoing recent progress on boosting gender equality.\n\nThe journalist and TV presenter, who co-founded the Women in Work Summit, told the PA news agency: “It’s a major backward step and slowly erodes their position as a leader.\n\n“I always imagined America to be the land of the free and the brave and where possibility was there for anyone who worked hard enough.\n\n“I think none of those things are proving to be true about America right now.”\n\nShe said by rolling back these initiatives, the US will start “slipping backwards in terms of their voice in the world and their economic power”.\n\n“It won’t happen overnight. But I think these are policies that drag everybody backwards,” she cautioned.\n\nMs Frostrup said firms in the UK may follow suit, but added she was “optimistic that this is just turbulence and that we’re heading in the right direction”.\n\nHer comments came as the Women in Work annual report on gender equality revealed that despite progress in companies overall meeting benchmarks, nine out of 10 male chief executives are replaced by men.\n\nWhen a female chief executive stands down, she is just as likely to be replaced by a man as another woman, it found.\n\nThere has been a recent flurry of female bosses quitting from top listed companies and being replaced by men, such as Dame Emma Walmsley from drug firm GSK and Diageo’s Debra Crew.\n\nData from professional networking site LinkedIn shows that three-quarters of UK companies have a lower proportion of women in leadership than in their overall workforce.\n\nThe findings show women fall behind at every stage of their career, with progression stalling the most between ages 30 and 50 when caregiving responsibilities peak.\n\nMs Frostrup, who was appointed the Government’s menopause employment ambassador last year, told PA: “There are a lot of women out there who’ve stepped back because they’ve had children, or indeed because they’ve found menopause symptoms too hard to deal with.”\n\nShe said they need support to help them back into the workplace “in proper jobs with proper pay”.\n\nThe Women in Work report reveals the number of Britain’s largest 400 companies meeting gender equality benchmarks has jumped by nearly a fifth (19%) over the past year.\n\nThe report found 121 companies are meeting benchmarks across 24 sectors, covering female representation on company boards (above 33%), gender pay gap (mean or median hourly pay gap under 15%) and transparent parental leave policies.\n\nTen of these firms have earned their place on the “trailblazers” list with equal executive boards, pay gaps under 1% and transparent parental policies.\n\nThis is more than double the number that achieved this status last year.\n\nMs Frostrup said “I’ve got confidence and assurance that things are going in the right direction and will continue to move in that direction, because every single area of economic endeavour appears to be now understanding that it’s sound business sense to have inclusive and diverse workforces.”\n\nShe added: “Just having a woman at the top is not what makes the difference. It’s changing the culture all the way through.”","summary":"Women’s campaigner Mariella Frostrup said she is ‘optimistic’ as a report shows a 19% rise in big UK firms meeting gender equality benchmarks.","url":"https://www.standard.co.uk/business/business-news/women-trump-linkedin-gsk-b1251371.html","image":"https://static.standard.co.uk/2025/10/06/00/02160416-f321cc5d-54a7-42ba-a9b4-8abf1b5776d3.png?width=1200","video":null,"publish_date":"2025-10-05 23:01:00","author":"Holly Williams","authors":["Holly Williams"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.067},{"id":366491794,"title":"Trump On A Dollar? Treasury Is One Step Closer To Approving 2026 Trump Coin","text":"The Treasury Department's mock-up of the one-dollar coin with the image of President Donald Trump.\nCourtesy: Treasury Department\n\nTrump bucks may be closer than you think.\n\nThe U.S. Treasury Department has taken the next step toward introducing a 2026 commemorative $1 coin featuring President Donald J. Trump.\n\nThe Treasury’s move is in part due to bipartisan legislation passed by Congress in 2020, and signed by Trump in his first term, that the Treasury Secretary was given authority to issue one-dollar commemorative coins during the 2026 calendar year that would be “emblematic of the United States semiquincentennial.”\n\nThe department’s authority to mint collectible coins for special national occasions like this, are part of a long tradition of special-edition currency, ranging from honoring the Constitution to celebrating the U.S. hosted Olympic Games.\n\nAnd while other designs may be in the works, the renderings of President Trumps one-dollar coin were confirmed by U.S.Treasurer Brandon Beach “These first drafts honoring America’s 250th Birthday and @POTUS are real. Looking forward to sharing more soon…”\n\nThe Treasury Department's mock-up of the one-dollar coin with the image of President Donald Trump.\nCourtesy: Treasury Department\n\nMORE FOR YOU\n\nThe coin design shows President Trump’s side profile on the front with the words “Liberty” and “In God We Trust” along with the dates 1776 - 2026. On the back, is an image of Trump raising his fist in Bulter, Pennsylvania following his assassination attempt and the words “FIGHT FIGHT FIGHT”.\n\nIf finalized, the Trump coin would mark a rare occasion - a living American president featured on U.S. currency. Current U.S. law states a president may be featured on currency no sooner than two years following the president’s death. “No coin issued under this subsection may bear the image of a living former or current President, or of any deceased former President during the 2-year period following the date of the death of that President,” But when Congress passed the Circulating Collectible Coin Redesign Act in 2020, it’s unclear if the special $1 coins to celebrate 2026 could feature a sitting U.S. President.\n\nThe Coin Market: History and Economics\n\nCommemorative coins have historically stirred both patriotism and profit while becoming a barometer of public sentiment through collector enthusiasm and sales.\n\nThe 1986 Statue of Liberty coin sold nearly 15.5 million units, making it the best-selling commemorative coin of all time.\n\nThe 1982 George Washington half dollar sold 7.1 million coins.\n\nThe 1983 U.S. Olympic coins sold over 5 million units.\n\nThe 1987 U.S. bicentennial Constitution coin sales topped 4 million.\n\nGiven Trump’s loyal fan base, particularly among political supporters and collectors of presidential memorabilia, the demand for a Trump coin could outpace recent commemoratives and become the best selling commemorative coin of all time.\n\nEditorial StandardsReprints & Permissions","summary":"The U.S. Treasury Department has taken the next step toward introducing a 2026 commemorative $1 coin featuring President Donald J. Trump for America's 250th Anniversary.","url":"https://www.forbes.com/sites/dougmelville/2025/10/05/trump-on-a-dollar-treasury-is-one-step-closer-to-approving-2026-trump-coin/","image":"https://imageio.forbes.com/specials-images/imageserve/68e2d58c9ee95f36cfc36d5f/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-10-05 22:59:47","author":"Contributor,Doug Melville","authors":["Contributor","Doug Melville"],"language":"en","category":"politics","source_country":"US","sentiment":0.335},{"id":366492390,"title":"Israel strikes Gaza, killing 24 before Egypt talks on Trump ceasefire plan","text":"Israel and Hamas are preparing for indirect negotiations in Egypt, amid hopes for a possible agreement on ending the Gaza war based on Donald Trump’s 20-point ceasefire plan.\n\nPalestinian group Hamas said on Sunday that its delegation, headed by Khalil al-Hayya, had arrived in Sharm el-Sheikh and would begin the negotiations on Monday “on the mechanisms for a ceasefire, the withdrawal of [Israeli] occupation forces and a prisoner exchange”.\n\nThe Israeli delegation, led by top negotiator Ron Dermer, will leave on Monday for the talks, the office of Prime Minister Benjamin Netanyahu said. Hopes for a possible ceasefire in Gaza grew after Netanyahu said on Friday that he was hopeful a deal to release all the remaining captives could be announced this week.\n\nUnited States President Trump said the talks were advancing quickly. “These talks have been very successful, and proceeding rapidly. The technical teams will again meet Monday, in Egypt, to work through and clarify the final details,” he said in a social media post on Sunday. “I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST.”\n\nDespite a call from Trump for Israel to pause its Gaza offensive, the Israeli army has continued its bombing campaign. At least 24 Palestinians were killed by Israeli troops on Sunday, sources told Al Jazeera Arabic. Among the victims were four asylum seekers who were shot near an aid distribution centre north of Rafah, the Nasser Medical Complex said.\n\nAl Jazeera’s Hani Mahmoud, reporting from the town of az-Zuwayda in central Gaza, said attacks were continuing both in the areas where people have been displaced to and in Gaza City, where the majority of Israeli military assaults and the ground offensive have taken place in recent weeks.\n\n“The Palestinians were hoping for a good night’s sleep, but that didn’t happen,” Mahmoud said.\n\nGaza’s Government Media Office said more than 2,700 families, comprising more than 8,500 people, have been wiped off the civil registry in two years of conflict. At least 1,015 children under one year old have been killed, along with 1,670 medical staff, 254 journalists, and 140 civil defence rescue workers.\n\nUS Secretary of State Marco Rubio said on Sunday that the war in Gaza had not yet ended despite the situation being “the closest we’ve come to getting all of the hostages released”.\n\nRubio urged Israel to stop bombing Gaza ahead of the discussions in Egypt. “You can’t release hostages in the middle of strikes, so the strikes will have to stop,” he told US broadcaster CBS. “There can’t be a war going on in the middle of it.”\n\nAccording to Trump’s plan, Hamas would release the remaining captives and Israel would pull back troops in Gaza to the “yellow line”, where it was in August.\n\nDespite the terms of the deal clearly stipulating Israel’s withdrawal, Israeli media quoted Defence Minister Israel Katz, saying that Israel would remain in control of the Strip. “Hamas will be disarmed, the Gaza Strip will be demilitarised, and the [Israeli army] will remain in controlling areas to protect the communities,” he said.\n\nArab backing for Hamas in negotiations\n\nThe foreign ministers of Egypt, Jordan, Indonesia, Pakistan, Qatar, Saudi Arabia, Turkiye and the United Arab Emirates issued a joint statement on Sunday, in which they welcomed the steps taken by Hamas on Trump’s Gaza plan, including the release of all Israeli captives and the immediate launch of negotiations on implementation mechanisms.\n\n“The Foreign Ministers also welcomed President Trump’s call on Israel to immediately stop the bombing and to begin implementation of the exchange agreement, and they expressed appreciation for his commitment to establishing peace in the region,” the joint statement said.\n\nThey also welcomed Hamas for stating “its readiness to hand over the administration of Gaza to a transitional Palestinian Administrative Committee of independent technocrats”.\n\nIzzat al-Risheq, a senior member of Hamas’s political bureau, said the statement marked an “important support” for efforts to end the war. He also welcomed the “clear backing for the Palestinian position in the negotiations, [which] strengthens the chances of reaching a lasting ceasefire agreement”.\n\n“We look forward to further Arab and Islamic support in order to stop the aggression and genocide being inflicted on our people in the Gaza Strip, leading to an end of the occupation and the realisation of our Palestinian people’s aspirations to establish their independent state with Jerusalem as its capital,” al-Risheq said.\n\nTrump has dispatched two envoys to Egypt, according to the White House, sending his son-in-law Jared Kushner and his main Middle East negotiator, Steve Witkoff.\n\nThe US president has told Hamas that once it agrees to Israel’s initial military withdrawal line in Gaza, an immediate ceasefire would be triggered.\n\nThe talks are being held after Hamas agreed to release the Israeli captives and accept some other terms in Trump’s Gaza plan, but questions surround vexing issues, such as Israel’s withdrawal from the Strip and Hamas’s disarmament.\n\nAsked by reporters whether there was any flexibility on his 20-point Gaza plan, Trump suggested on Sunday that some changes would still be possible. “We don’t need flexibility because everybody has pretty much agreed to it. But there’ll always be some changes,” he said.","summary":"Israel and Hamas set to hold indirect talks on Monday to discuss a US-led initiative largely accepted by both sides.","url":"https://www.aljazeera.com/news/2025/10/5/israel-strikes-gaza-killing-24-before-egypt-talks-on-trump-ceasefire-plan?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-05T165547Z_60774460_RC2S5HAETVJ7_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA-1759701803.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-10-05 22:58:37","author":"Apps Support,Federica Marsi","authors":["Apps Support","Federica Marsi"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.518},{"id":366485956,"title":"Donald Trump suggests he 'could have stopped 9/11', but no one listened to his warnings","text":"Donald Trump has once again insisted that he predicted 9/11 and could have stopped the terrorist atrocity if anyone had heeded his warnings. \"Please remember I wrote about Osama bin Laden exactly one year ago, one year before he blew up the World Trade Center,\" Trump declared during a speech to hundreds of Navy personnel who gathered at Naval Station Norfolk for the Navy 250 Celebration on Sunday. \"I said, 'You've gotta watch Osama bin Laden.' And the fake news would never let me get away with that statement unless it was true. But, I said one year before to Pete Hegseth, I said one year before, in the book, I wrote - whatever the hell the title, I can't tell you, but I can tell you there's a page in there devoted to the fact that I saw somebody named Osama bin Laden, and I didn't like it, and 'You've gotta take care of him,'\" Trump insisted. READ MORE: Israel agrees to ceasefire in Gaza as Trump announces 'withdrawal line' in peace plan READ MORE: Top Putin allies break ranks with Kremlin on state TV over Ukraine war reality \"They didn't do it,\" he continued. \"A year later, he blew up the World Trade Center. So, I gotta take a little credit because nobody else is gonna give it to me. You know the old story - they don't give you credit, just take it yourself,\" he declared, reports the Mirror US . Trump didn't actually predict the assault, contrary to his assertions. In early 2000, more than 18 months before the September 11, 2001, terrorist strikes, he wrote a book entitled, \"The America We Deserve\" that referenced bin Laden only briefly. The publication also appeared considerably earlier than he has suggested - it wasn't released just prior to the attack. It did, however, identify bin Laden as a danger to American national security. \"I believe, 'THE SHOW MUST GO ON!'\" Trump posted on Friday night on Truth Social. Before leaving the White House for the base on Sunday, he penned another post, which reads, \"It will be a big day with the Navy. Leaving now. The United States has the greatest military, by far, in the World. This will be a show of Naval aptitude and strength. ENJOY WATCHING! It will be broadcast everywhere. President DJT.\" Accompanying the president to the Navy base were First Lady Melania Trump , Defense Secretary Pete Hegseth, Navy Secretary John Phelan, Veterans Affairs Secretary Doug Collins and U.S. Rep. Ronny Jackson (R-Texas), a former Navy rear admiral who served as a White House doctor during Trump's first term. Upon his arrival, he immediately went to the USS George H. W. Bush and spoke with sailors, handing many of them challenge coins. The Trumps then watched a military demonstration while standing on the deck of the aircraft carrier. Navy destroyers launched missiles and fired shells into the Atlantic Ocean as Navy SEALs descended from helicopters and fighter jets catapulted off. The government shutdown began on Wednesday and has sparked a series of partisan blame games as military personnel work without pay, several thousand federal employees are furloughed and key infrastructure and energy projects in Democratic-run areas, including New York and Chicago, have been put on hold. Trump accused the Democrats of enabling the shutdown in another post, claiming they were attempting \"to destroy this wonderful celebration of the U.S. Navy's Birthday.\" As the new budget year commenced on Wednesday, Senate Democrats blocked attempts to maintain government operations, pointing to the lapse in subsidies that could see health insurance costs soar for those covered under the 2010 Affordable Care Act. Democratic MPs have also pushed to overturn Medicaid reductions that Trump enacted with his \"big, beautiful bill\" in July. Prior to stepping aboard Marine One for his journey to Naval Station Norfolk, Trump once again held Democrats responsible for the mass redundancies anticipated during a government shutdown. The president slammed Democrats as he prepared to board Marine One en route to the Navy 250 Celebration in Norfolk, Virginia, home to Naval Station Norfolk, where he was scheduled to witness a naval sea power demonstration before delivering remarks later that afternoon. As he departed the White House on Sunday, a journalist questioned him about the redundancies. \"Well, I call them Democrat layoffs. They're Democrat layoffs. They're causing it,\" Trump replied. \"We're ready to go back.\" He continued by championing what he characterised as a \"record-setting economy\" where \"prices are way down. We're doing better than the country's ever done. And the Democrats hate seeing that. It's up to them. Anybody laid off, that's because of the Democrats,\" he declared.","summary":"Donald Trump repeated his false claim that he warned about Osama bin Laden a year before the 9/11 attacks, and said he deserves 'credit' for trying to stop the terrorist attack","url":"https://www.mirror.co.uk/news/us-news/donald-trump-suggests-could-stopped-36018419","image":"https://i2-prod.mirror.co.uk/article36018417.ece/ALTERNATES/s1200b/2_Trump-Navy-25278687763087.jpg","video":null,"publish_date":"2025-10-05 22:55:29","author":"Jeremiah Hassel,Paige Ingram","authors":["Jeremiah Hassel","Paige Ingram"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.224},{"id":366484254,"title":"Trump: UFC fights to take place at the White House in June","text":"President Donald Trump said on Sunday that a previously announced Ultimate Fighting Championship event at the White House will take place on June 14 next year, which will be the president’s 80th birthday.\n\nHe made the announcement during a speech at Naval Station Norfolk to mark the upcoming 250th anniversary of the U.S. Navy.\n\nTrump in July had announced that a UFC event would take place at the White House in 2026, but did not give a date.\n\nHe counts UFC President Dana White as a close friend and considers fans of the sport part of his political base, although their ties long predate Trump’s presidency.\n\nWhite this week told the Sports Business Journal that the UFC will spend $700,000 to replace the South Lawn grass at the White House after the event.\n\nSince becoming president, Trump has been a regular attendee at UFC fights, most recently attending one in New Jersey in June. But the relationship between Trump and White goes back to 2000, when the Trump Taj Mahal in Atlantic City was one of the few U.S. venues willing to host UFC events at the time.\n\nTKO Group Holdings, the parent company of UFC, did not immediately respond to a request for comment.","summary":"President Donald Trump said on Sunday that a previously announced Ultimate Fighting Championship event at the White House will take place on June 14 next year, which will be the president&#8217;s 80th birthday.","url":"https://www.staradvertiser.com/2025/10/05/sports/sports-breaking/trump-ufc-fights-to-take-place-at-the-white-house-in-june/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/10/web1_2025-09-06T002529Z_187856098_RC20MGA229KB_RTRMADP_3_USA-TRUMP.jpg","video":null,"publish_date":"2025-10-05 22:48:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":0.069},{"id":366486782,"title":"He slaughtered her son in cold blood. But mom of Idaho murder victim reveals why she is happy NEVER knowing Bryan Kohberger's motive","text":"Ethan Chapin's mother might never know why Bryan Kohberger murdered her son.\n\nAnd she doesn't need to. 'It doesn't change the outcome,' Stacy Chapin told the Daily Mail in an exclusive interview. \n\n'You can burn up so much energy and time on it, but it doesn't bring Ethan back.'\n\nEven after pleading guilty and being sentenced to a lifetime behind bars, what motivated Kohberger to break into an off-campus home in Moscow, Idaho, and stab Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves to death one night in November 2022 is an enduring mystery.\n\nInvestigators found no motive nor any connection between the killer and his victims.\n\nAnd Kohberger himself has offered no explanation - refusing the opportunity to speak at his sentencing.\n\nIt's something some of the victims' family members have voiced frustrations with, that the killer was not forced to reveal his motive as part of the plea deal he struck with prosecutors. \n\nEven President Donald Trump weighed in on the matter, saying he hoped Judge Steven Hippler would make him 'explain why he did these horrible murders' at his sentencing.\n\nBut, for the mother of 20-year-old Ethan, she is not going to waste time searching for answers to questions that will never make sense.\n\n'We always go back to the beginning: it doesn't bring Ethan back,' Stacy said.\n\n'So we just have to spend time doing what's good for our family.'\n\nWhile she doesn't want to contradict what other victims' families feel, for her, Ethan's father Jim and Ethan's triplet siblings Maizie and Hunter, knowing Kohberger's motive wouldn't change their incomprehensible loss.\n\n'Everybody has the right to feel how they want to feel, but I don't know how knowing the motive changes anything,' she said.\n\n'Even if we went to trial for three months, we wouldn't have learned that. It's not like [Kohberger] was going to take the stand and be like: \"Oh yeah, by the way, here's why I did it.\"'\n\nFor the best part of three years, 30-year-old Kohberger fought the charges over the November 13, 2022, murders.\n\nThen, just weeks before the start of his trial, he admitted his guilt and struck a controversial plea deal with prosecutors, saving him from the death penalty.\n\nThe Chapin family supported the deal, which ensured Kohberger would never be able to walk free from prison.\n\nHad the case gone to trial, Stacy said there would always have been a risk that one juror might not have found the evidence substantial enough and Kohberger would have been acquitted. \n\n'And even if he had gotten the death penalty at trial, he would not have died in my husband and my lifetimes. So he would have been left for our kids to have to handle. And he would have had opportunities to appeal it,' Stacy said.\n\n'This way he is just put away. We do not have to hear from him ever again. For our family, that was the better option.'\n\nStacy, Jim, Maizie and Hunter all attended Kohberger's change of plea hearing at Ada County Courthouse in Boise on July 2 in support of the agreement.\n\nIt marked the first and only time the Chapins came face-to-face with Ethan's killer, as they watched him finally admit to his brutal crimes.\n\nThree weeks later, on July 23, Judge Hippler sentenced Kohberger to four life sentences with no possibility of parole for each count of first-degree murder and an additional 10 years for burglary.\n\nUnder the terms of the deal, Kohberger also waived his right to ever appeal. He is now being held in the Idaho Maximum Security Institution in Kuna where he will live out his dying days.\n\nStacy said the Chapins decided not to attend the sentencing hearing to give victim impact statements because they had nothing to say to her son's killer.\n\n'There was nothing left to say, I guess,' she said, adding: 'That was just us.'\n\nInstead, the family spent the day together at their home in Priest Lake, Idaho, honoring the athletic, outgoing 20-year-old.\n\nWhen asked how she wants her son to be remembered, Stacy said: 'He was just an amazing kid. Going all the way back to them as three babies bouncing in their seats, he was always the easiest child.'\n\nShe added: 'There's nothing of those 20 years with Ethan that I would go back and change. He was that great of a kid. He was amazing. \n\n'I'm thankful to have had him for those 20 years.'\n\nEthan had been in his freshman year at the University of Idaho, where he majored in sports management and was part of the Sigma Chi fraternity. He was in a relationship with Kernodle and was staying at her student home on the edge of the college campus on the night of Kohberger's attack.\n\nFor the Chapin family, knowing Kohberger is now behind bars for life has brought some closure and has finally drawn a line under three years of agony.\n\n'He's put away. He's where he belongs,' Stacy said.\n\n'In our family's opinion, it's over.\n\n'We've been doing this now for almost three years. It will be three years in November, and it's time for us to do something different. It's time to move on.'\n\nWhile life will always look different for the Chapin family to before Ethan's murder, with the court proceedings now behind them, Stacy feels they can finally move forward and focus on the future. \n\nStacy beams with pride when she speaks of the strength she has seen in Maizie and Hunter and their plans for adult life.\n\n'My kids are amazing. They're great. They are more resilient than we are,' she said.\n\n'We put them through counseling and the mental health pieces - whatever they needed to get through this.\n\n'Now they're like: \"Okay, let's move forward from this event.\"'\n\nMaizie and Hunter both attended UI with Ethan. They returned to their studies and college life in Moscow for the 2023 spring semester - mere weeks after Kohberger's arrest.\n\nThis May, they both graduated.\n\nStacy proudly revealed that Hunter is now planning to become a firefighter while Maizie has started working at a hospital.\n\n'They're doing amazing,' she said. 'It feels like we are finally moving forward.'\n\nPart of moving forward also includes using the family's tragic experience to be a voice for other families who will find themselves in similar situations in future. \n\nAfter the plea deal was struck and the gag order lifted in the case, Stacy connected with Othram - the forensic genetic genealogy lab which identified Kohberger as the source of the DNA found on the knife sheath left at the scene.\n\nThe Texas-based lab's advanced technology meant that the killer was identified and arrested within six weeks of the murders, bringing some answers to the victims' families and preventing Kohberger from tearing apart any other families.\n\nStacy, Jim and Maizie have since all visited Othram's lab and met with the team, led by David and Kristen Mittelman.\n\nNow, they hope to work together to advocate for greater access to the lab's capabilities so that more families can get answers about their loved ones' cases quickly.\n\nThe Chapin family also runs the Ethan's Smile Foundation which they launched in 2023 to provide scholarships in Ethan's honor. \n\nAs of May 2025, the foundation has awarded $105,750 in scholarships to 83 students. Stacy, Jim, Maizie and Hunter all sit on the board. \n\nThe Chapins have other plans for the future too.\n\nFor Stacy and Jim, Ethan's murder derailed the next chapter in their lives - a time when their kids were off at college, entering adult life, so as parents they were looking at the own next steps.\n\n'Jim and I had just started - before this whole thing - trying to live a life that was without our kids and doing a little traveling and figuring out what's next,' she said.\n\nNow, it's finally time to get those plans back on track.\n\n'We're there right now. We're just in the process of getting our kids where they need to be and settled into their next lives - where we all feel like we're moving forward,' she said.\n\nStacy hasn't decided where exactly those travel plans will take her and Jim yet - but there's one thing top of the list.\n\n'I'm just going to go sit on a beach somewhere,' she laughed. 'I don't even know where. I'm like, \"I'm out.\"","summary":"Ethan Chapin's mother Stacy tells the Daily Mail why she won't waste time and energy trying to understand Bryan Kohberger's motive.","url":"https://www.dailymail.co.uk/news/article-15153053/bryan-kohberger-idaho-murders-motive-ethan-chapin-stacy.html","image":"https://i.dailymail.co.uk/1s/2025/10/01/16/100130933-0-image-m-11_1759333442997.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/14/7453812237482899732/1024x576_MP4_7453812237482899732.mp4","publish_date":"2025-10-05 22:41:08","author":"Editor,Rachel Sharp","authors":["Editor","Rachel Sharp"],"language":"en","source_country":"gb","sentiment":-0.302},{"id":366491324,"title":"Trump Boasts 'No Boats Left' as US Navy Strikes Another Drug Vessel Off Venezuela Coast","text":"US President Donald Trump has said American forces carried out another strike against a vessel allegedly carrying illegal drugs off the coast of Venezuela, as he signalled that military operations could expand to land-based drug trafficking routes. Speaking on Sunday at Naval Station Norfolk in Virginia, alongside the aircraft carrier USS Harry S. Truman, Trump said: \"In recent weeks, the Navy has supported our mission to blow the cartel terrorists the hell out of the water… we did another one last night. Now we just can't find any.\" He added that because traffickers were avoiding maritime routes, the United States would have to begin focusing on drugs being transported by land. \"They're not coming in by sea anymore, so now we'll have to start looking about the land because they'll be forced to go by land,\" he said. The President told the assembled sailors that US operations were having a major impact. \"We’re stopping drugs at a level that nobody’s ever seen. We’re so good at it that there are no boats. In fact, even fishing boats – nobody wants to go into the water anymore. Sorry to tell you that. We just can’t find any,\" he said, chuckling. Also Read: Trump's War on Drug Cartels Escalates as US Strikes Another Boat Off Venezuela Coast According to US officials, the strikes have so far killed at least 21 people and destroyed four boats accused of carrying illegal drugs. Video released by the Pentagon from a previous strike showed a small open speedboat engulfed in smoke and flames. The White House has said that these actions are intended to prevent drugs from reaching the United States, with Trump boasting that the policy is working and suggesting that operations could expand to land routes in response to traffickers’ changing behaviour. \"Let me tell you right now, that’s not going to work out well for them either,\" he said. It was not immediately clear whether the strike Trump referred to on Saturday night is the same as the attack reported on Friday by the Pentagon, which killed four unidentified individuals described as \"narco-terrorists.\" While the administration has defended the strikes, the use of lethal force against individuals in foreign or international waters who have not been intercepted or questioned has drawn criticism. Many Democrats and legal experts have questioned the legality of such operations, raising concerns about potential violations of international law. The operations come amid heightened US focus on the region, as the Trump administration seeks to disrupt drug trafficking networks in Latin America. However, the recent statements by Mr Trump signal an intention to broaden military efforts beyond maritime targets and onto land-based routes, reflecting an escalated approach to the issue. The strikes and the president’s remarks have sparked debate over the scope and legality of US military involvement in combating the flow of narcotics from Venezuela, while underlining the administration’s insistence that it is taking unprecedented action to protect US borders. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"According to US officials, the strikes have so far killed at least 21 people and destroyed four boats accused of carrying illegal drugs","url":"https://www.timesnownews.com/world/us/us-news/us-president-donald-trump-us-navy-strikes-drug-vessel-venezuela-coast-article-152947064","image":"https://images.timesnownews.com/thumb/msid-152947077,thumbsize-47522,width-1280,height-720,resizemode-75/152947077.jpg","video":null,"publish_date":"2025-10-05 22:39:53","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.35},{"id":366490750,"title":"Trump warns of 'massive bloodshed' if Hamas fails to agree to peace deal: 'MOVE FAST'","text":"President Donald Trump made a social media post about Hamas on Sunday evening, minutes before the deadline for a peace proposal passed. The deadline was 6 p.m. ET Sunday. In a message on Truth Social, Trump wrote that there had been \"very positive discussions with Hamas, and Countries from all over the World (Arab, Muslim, and everyone else) this weekend, to release the Hostages, end the War in Gaza but, more importantly, finally have long sought PEACE in the Middle East.\" \"These talks have been very successful, and proceeding rapidly,\" Trump said. \"The technical teams will again meet Monday, in Egypt, to work through and clarify the final details.\" Speaking to reporters on Sunday evening, Trump affirmed that the meetings were positive after he wrote that the first phase of the peace plan \"should be completed this week.\" TRUMP'S PEACE DEAL COULD END THE WAR IN GAZA OR NETANYAHU'S CAREER \"We had some very good meetings…and it looks like it's working,\" he said. \"So we'll wait for a little while, see how it all turns out.\" However, Trump's post warned that violence could follow if a deal was not reached. \"I am asking everyone to MOVE FAST,\" Trump emphasized. \"I will continue to monitor this Centuries old ‘conflict.’\" Trump added, \"TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW — SOMETHING THAT NOBODY WANTS TO SEE!\" ISRAEL’S ARMY WILL 'ADVANCE READINESS' FOR FIRST PHASE OF TRUMP PLAN TO RELEASE HOSTAGES Trump previously announced the deadline in an Oct. 3 post on Truth Social, delivering an ominous warning to Hamas about accepting the deal. \"If this LAST CHANCE agreement is not reached, all HELL, like no one has ever seen before, will break out against Hamas,\" Trump wrote. \"THERE WILL BE PEACE IN THE MIDDLE EAST ONE WAY OR THE OTHER. Thank you for your attention to this matter!\" The peace proposal was unveiled by Trump in late September. The plan calls for an end to Israel’s military operations, the disarmament of Hamas and the reconstruction of the Gaza Strip under a Palestinian governing body overseen by a U.S.-led international coalition. CLICK HERE TO GET THE FOX NEWS APP Israeli Prime Minister Benjamin Netanyahu's reportedly agreed to the 20-point plan, per Reuters. Fox News Digital's Caitlin McFall and Bonny Chu contributed to this report.","summary":"President Donald Trump posted on social media minutes before a Hamas peace proposal deadline, warning of massive bloodshed if talks fail.","url":"https://www.foxnews.com/politics/trump-warns-massive-bloodshed-hamas-fails-agree-peace-deal-move-fast","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/hamas_trump-split.jpg","video":"https://www.foxnews.com/video/6382076675112","publish_date":"2025-10-05 22:36:44","author":"Andrea Margolis","authors":["Andrea Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.133},{"id":366484242,"title":"Right-wing Sanae Takaichi set to be Japan’s first female prime minister","text":"TOKYO >> Japan’s ruling party picked hardline conservative Sanae Takaichi as its head on Saturday, putting her on course to become the country’s first female prime minister in a move set to jolt investors and neighbors.\n\nThe Liberal Democratic Party, which has ruled Japan for almost all of the postwar era, elected Takaichi, 64, to regain trust from a public angered by rising prices and drawn to opposition groups promising stimulus and clampdowns on migrants.\n\nA vote in parliament to choose a replacement for outgoing Shigeru Ishiba is expected on October 15. Takaichi is favored as the ruling coalition has the largest number of seats.\n\nInherits party in crisis\n\nTakaichi, the only woman among the five LDP candidates, prevailed in a runoff against the more moderate Shinjiro Koizumi, 44, who was bidding to become Japan’s youngest modern leader.\n\nA former economic security and internal affairs minister with an expansionary fiscal agenda for the world’s fourth-largest economy, Takaichi takes over a party in crisis.\n\nVarious other parties, including the expansionist Democratic Party for the People and the anti-immigration Sanseito, have been steadily luring voters, especially younger ones, away from the LDP.\n\nThe LDP and its coalition partner lost their majorities in both houses under Ishiba over the past year, triggering his resignation.\n\n“Recently, I have heard harsh voices from across the country saying we don’t know what the LDP stands for anymore,” Takaichi said in a speech before the runoff vote. “That sense of urgency drove me. I wanted to turn people’s anxieties about their daily lives and the future into hope.”\n\nTakaichi, who says her hero is Margaret Thatcher, Britain’s first female prime minister, offers a starker vision for change than Koizumi and is potentially more disruptive.\n\nAn advocate of late premier Shinzo Abe’s “Abenomics” strategy to boost the economy with aggressive spending and easy monetary policy, she has previously criticised the Bank of Japan’s interest rate increases.\n\nSuch a spending shift could spook investors in Japanese bonds, worried about one of the world’s biggest debt loads, and put downward pressure on the yen.\n\nNaoya Hasegawa, chief bond strategist at Okasan Securities in Tokyo, said Takaichi’s election had weakened the chances of the BOJ raising rates this month, which markets had priced at around a 60% chance before the vote.\n\nAt a press conference after her victory, Takaichi laid out various plans to cut taxes and increase subsidies but said she understood “the importance of fiscal prudence”. The BOJ’s monetary policy must account for the fragility of the economy and wage growth, she said.\n\nSticking with Trump trade deal\n\nTakaichi said she planned to honour an investment deal with President Donald Trump that lowered his punishing tariffs in return for Japanese taxpayer-backed investment, having previously mooted the possibility of redoing it.\n\nThe U.S. ambassador to Japan, George Glass, congratulated Takaichi, posting on X that he looked forward to strengthening the Japan-U.S. partnership “on every front.”\n\nBut her nationalistic positions — such as her regular visits to the Yasukuni shrine to Japan’s war dead, viewed by some Asian countries as a symbol of its past militarism — may rile neighbors like South Korea and China.\n\nSouth Korea will seek to “cooperate to maintain the positive momentum in South Korea-Japan relations”, President Lee Jae Myung’s office said in a statement.\n\nTakaichi also favors revising Japan’s pacifist postwar constitution and suggested this year that Japan could form a “quasi-security alliance” with Taiwan, the democratically governed island claimed by China.\n\nTaiwan President Lai Ching-te welcomed her election, saying she was a “steadfast friend of Taiwan”.\n\n“It is hoped that under the leadership of the new (LDP) President Takaichi, Taiwan and Japan can deepen their partnership in areas such as economic trade, security, and technological cooperation,” he said in a statement.\n\nIf elected prime minister, Takaichi said she would travel overseas more regularly than her predecessor to spread the word that “Japan is Back!”\n\n“I have thrown away my own work-life balance and I will work, work, work,” Takaichi said in her victory speech.\n\nWarnings for foreigners\n\nSome of her supporters viewed her selection as a watershed in Japan’s male-dominated politics. Takaichi has made a bold pledge to lift the number of women in cabinet to a par with Nordic countries.\n\n“The fact that a woman was chosen might be seen positively. I think it shows that Japan is truly starting to change and that message is getting across,” 30-year-old company worker Misato Kikuchi said outside Tokyo’s Shimbashi station.\n\nHowever, her other socially conservative positions — such as opposing changes to allowing married couples to have separate surnames — make her more popular among men than women, opinion polls show.\n\nHer conservative appeal, however, may help blunt the rise of Sanseito, which broke into the political mainstream in a July election, appealing to voters disillusioned with the LDP.\n\nEchoing Sanseito’s warnings about foreigners, she kicked off her first official campaign speech with an anecdote about tourists reportedly kicking sacred deer in her hometown of Nara.\n\nTakaichi, whose mother was a police officer, promised to clamp down on rule-breaking visitors and immigrants, who have come to Japan in record numbers in recent years.\n\n“We hope she will … steer Japanese politics in an ‘anti-globalism’ direction to protect national interests and help the people regain prosperity and hope,” Sanseito said in a statement.","summary":"TOKYO >> Japan&#8217;s ruling party picked hardline conservative Sanae Takaichi as its head on Saturday, putting her on course to become the country&#8217;s first female prime minister in a move set to jolt investors and neighbors.","url":"https://www.staradvertiser.com/2025/10/05/breaking-news/right-wing-sanae-takaichi-set-to-be-japans-first-female-prime-minister-2/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/10/web1_2025-10-04T104332Z_1677555327_RC2Y4HA7BS4A_RTRMADP_3_JAPAN-POLITICS.JPG","video":null,"publish_date":"2025-10-05 22:33:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":0.038},{"id":366485722,"title":"Illinois is investigating after ICE raid left ‘nearly naked’ children zip-tied, Gov JB Pritzker says","text":"Illinois Governor JB Pritzker is directing state agencies to investigate the treatment of children involved in a recent Trump administration immigration raid after witnesses claimed children were zip-tied, separated from parents, and detained for several hours. \n\nPritzker’s directive was issued Friday after reports emerged that armed federal immigration agents descended on an apartment building on the South Side of Chicago on September 30 and pulled men, women, and children from their beds in the middle of the night. \n\nIn an interview with CNN Sunday, the governor cited reports of “children who were zip-tied and held, some of them nearly naked” and “elderly people being thrown into a U-Haul for three hours and detained.” At least one U.S. citizen was detained, Pritzker added. \n\nFederal agents were “just picking up people who are brown and Black and then checking their credentials,” Mr. Pritzker added.\n\nWitnesses told WBEZ Chicago and the Chicago Sun Times that armed agents arrived at the five-story building with U-Hauls and broke down residents’ doors, dragging them out of bed. Some told CNN that a Black Hawk helicopter was flying above the apartment complex.\n\n“Imagine being a child awakened in the middle of the night by a Black Hawk helicopter landing in your neighborhood,” Pritzker said in a statement. “Imagine an armed stranger forcibly removing you from your bed, zip-tying your hands, separating you from your family, and detaining you in a dark van for hours. This didn’t happen in a country with an authoritarian regime – it happened here in Chicago.”\n\nPritzker said he was “appalled” by the reports and that “military-style tactics should never be used on children.”\n\nThe Independent has asked the Department of Homeland Security for comment.\n\nFederal agents and officers with the Department of Homeland Security, Border Patrol, the FBI, Bureau of Alcohol, Tobacco, Firearms, and Explosives were involved in the immigration raid. Authorities said the neighborhood where the raid was conducted was “known to be frequented by Tren de Aragua members and their associates.” \n\nEboni Watson, a resident of the building, told WLS that children appeared “terrified” during the raid.\n\n“The kids was crying. People was screaming. They looked very distraught,” Watson said. \n\n“I was out there crying when I seen the little girl come around the corner, because they was bringing the kids down, too, had them zip tied to each other,” Watson added.\n\nApproximately 37 people were arrested in the September 30 raid, some of whom had criminal records related to drug or weapons crimes, DHS said. \n\nPresident Donald Trump has directed immigration law enforcement and other federal authorities to conduct immigration raids in Chicago, a city he has long targeted due to its “sanctuary city” policies. Pritzker and Chicago Mayor Brandon Johnson have consistently opposed the administration’s tactics.\n\nPritzker told CNN that the administration was using aggressive tactics because they “want mayhem on the ground.”","summary":"Neighbors recalled witnessing law enforcement zip-tie children together and separate them from parents during a middle-of-the-night immigration raid","url":"https://www.independent.co.uk/news/world/americas/us-politics/chicago-immigration-raid-children-ziptied-b2839782.html","image":"https://static.independent.co.uk/2025/10/05/21/47/GettyImages-2231381197.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/up6cF69U-APg7GJgG.mp4","publish_date":"2025-10-05 22:32:49","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","source_country":"gb","sentiment":-0.263},{"id":366489600,"title":"California National Guard Members Reach Oregon After Judge Pauses Plan To Deploy State Troops","text":"About 100 California National Guard troops reached Oregon, the governor said on Sunday, hours after a judge blocked President’s deployment of the Oregon National Guard to Portland.\n“There is no need for military intervention in Oregon. There is no insurrection in Portland. No threat to national security. Oregon is our home, not a military target,” Governor Tina Kotek said in a statement Sunday.\nOn Saturday, US District Judge Karin Immergut, a Trump appointee, granted a temporary restraining order blocking Trump’s order sending the Oregon National Guard to the state’s largest city.\nShe said the President appeared to have federalised the Oregon National Guard “absent constitutional authority” and protests in Portland “did not pose a ‘danger of a rebellion’.” The judge said Oregon attorneys showed “substantial evidence that the protests at the Portland ICE facility were not significantly violent” leading up to the president’s directive.\nShe pointed out that recent incidents cited by the Trump administration of protesters clashing with federal officers “are inexcusable” and “they are nowhere near the type of incidents that cannot be handled by regular law enforcement forces”.\nThe judge added the incidents in Portland are “categorically different” from the violence seen in Los Angeles when the President federalised troops there.\nAccording to CNN, Donald Trump has ordered the deployment of federal troops in Democrat-led cities such as Chicago and Portland, arguing military deployments are necessary to protect federal immigration personnel and property amid “violent protests” carried out by “domestic terrorists.”\nMeanwhile, California Governor Gavin Newsom announced his plan to sue over the deployment.\nThe President’s order was defended by the White House, saying Trump “exercised his lawful authority to protect federal assets and personnel in Portland following violent riots and attacks on law enforcement”.\n“For once, Gavin Newscum should stand on the side of law-abiding citizens instead of violent criminals destroying Portland and cities across the country,” White House spokesperson Abigail Jackson said in a statement to CNN.\nLast month, a federal judge in California ruled that the Trump administration broke the law when it deployed thousands of federalised National Guard soldiers and Marines to suppress protests against ICE actions in Los Angeles. The decision barred troops from carrying out law enforcement in the state.","summary":"About 100 California National Guard troops reached Oregon hours after a judge blocked President's deployment of the Oregon National Guard to Portland.","url":"https://www.news18.com/world/california-national-guard-members-reach-oregon-after-judge-pauses-plan-to-deploy-state-troops-ws-l-9616253.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/Donald-Trump-REUTERS-Iran-Uranium-2025-09-a47b89e18b78a60a0a0c9925d2e649f0.jpg","video":null,"publish_date":"2025-10-05 22:32:26","author":"News18,Ranu Joardar","authors":["News18","Ranu Joardar"],"language":"en","source_country":"in","sentiment":-0.207},{"id":366498600,"title":"‘MOVE FAST’: Trump says talks with Hamas ‘very successful, and proceeding rapidly’ as deadline passes","text":"As President Donald Trump’s 6 p.m. Sunday deadline for Hamas to accept a peace deal to release all hostages arrived, the commander in chief said “talks have been very successful, and proceeding rapidly.”\n\n“There have been very positive discussions with Hamas, and Countries from all over the World (Arab, Muslim, and everyone else) this weekend, to release the Hostages, end the War in Gaza but, more importantly, finally have long sought PEACE in the Middle East,” Trump posted on X at 5:56 p.m. Eastern Time.\n\n“These talks have been very successful, and proceeding rapidly,” he continued.\n\n“The technical teams will again meet Monday, in Egypt, to work through and clarify the final details. I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST. I will continue to monitor this Centuries old ‘conflict.’\n\n“TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW – SOMETHING THAT NOBODY WANTS TO SEE!”\n\n⚡️‼️ Trump confident he’ll resolve the Israeli-Palestinian war this time:\n“I think it’s going to happen very quickly. Great meetings with Hamas.” pic.twitter.com/EnKQhLb24t\n— SilencedSirs◼️ (@SilentlySirs) October 5, 2025\n\nOn Friday, Trump issued an ultimatum to Hamas, warning the Islamic terrorists must accept his ceasefire framework by Sunday at 6 p.m. or completely lose the deal.\n\n“If this LAST CHANCE agreement is not reached, all HELL, like no one has ever seen before, will break out against Hamas,” Trump wrote.\n\nOn Saturday, Trump posted on Truth Social a Gaza map with representation of “withdrawal lines” to which Israel has agreed, nearly two years since the current conflict began.\n\n“After negotiations, Israel has agreed to the initial withdrawal line, which we have shown to, and shared with, Hamas,” the president wrote.\n\n“When Hamas confirms, the Ceasefire will be IMMEDIATELY effective, the Hostages and Prisoner Exchange will begin, and we will create the conditions for the next phase of withdrawal, which will bring us close to the end of this 3,000 YEAR CATASTROPHE. Thank you for your attention to this matter and, STAY TUNED!”\n\nIs the news we hear every day actually broadcasting messages from God? The answer is an absolute yes! Find out how!\n\nFollow Joe on X @JoeKovacsNews","summary":"'TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW – SOMETHING THAT NOBODY WANTS TO SEE!'","url":"https://www.wnd.com/2025/10/move-fast-trump-says-talks-hamas-very-successful/","image":"https://www.wnd.com/wp-content/uploads/2025/10/donald-trump-steve-witkoff-united-nations.jpg","video":null,"publish_date":"2025-10-05 22:32:18","author":"Joe Kovacs","authors":["Joe Kovacs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.079},{"id":366491322,"title":"Crowd Goes Wild As Trump Dances To ‘YMCA’ At US Navy's 250th Anniversary Event | Watch","text":"Crowd goes wild for the Trump dance as President Donald Trump visited Norfolk, Virginia, on Sunday to celebrate the US Navy’s 250th anniversary. Despite the ongoing government shutdown, Trump used the event to praise the Navy and himself, ending his speech with a dance to the Village People’s “YMCA,” drawing cheers and laughter from the estimated 10,000 attendees. The partial government shutdown, now in its fifth day, has left thousands of federal employees furloughed and delayed key projects in Democratic-run areas like New York and Chicago. Trump criticized Democrats for the shutdown, promising that service members would receive all their pay despite the stalemate. Senate Democrats cited concerns over healthcare subsidies, Medicaid cuts, and spending priorities in rejecting efforts to continue government operations. Military Celebration And Demonstrations Trump and First Lady Melania Trump visited the USS George HW Bush, meeting sailors, handing out challenge coins, and observing military demonstrations. Navy destroyers fired missiles, SEALs descended from helicopters, and fighter jets catapulted off the aircraft carrier, showing the Navy’s capabilities. Defense Secretary Pete Hegseth, Navy Secretary John Phelan, Veterans Affairs Secretary Doug Collins, and former White House doctor Rep. Ronny Jackson were also present. Trump’s Focus On Military Support Trump has increasingly leaned on military support, proposing the use of troops to patrol U.S. cities and describing American cities as potential training grounds. Officials, including Hegseth, are reshaping Pentagon culture with directives such as “male-level” physical fitness standards while ending so-called “woke” policies. The administration has also taken action against Caribbean drug cartels, carrying out four strikes on boats allegedly involved in trafficking. (With inputs from AP) Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Crowd goes wild for the Trump dance as President Donald Trump celebrated the US Navy’s 250th anniversary in Norfolk, Virginia, ending his speech with a dance to “YMCA.” He criticized Democrats over the ongoing government shutdown, promising service members would be paid in full.","url":"https://www.timesnownews.com/world/us/us-news/crowd-goes-wild-as-trump-dances-to-ymca-at-us-navys-250th-anniversary-event-watch-article-152947003","image":"https://images.timesnownews.com/thumb/msid-152947004,thumbsize-810920,width-1280,height-720,resizemode-75/152947004.jpg","video":null,"publish_date":"2025-10-05 22:26:51","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","category":"politics","source_country":"in","sentiment":0.418},{"id":366496384,"title":"Hassett says layoffs will come if Trump thinks shutdown talks 'are going nowhere'","text":"As the White House threatens mass layoffs of federal workers during the five-day-old government shutdown, White House economic adviser Kevin Hassett said Sunday that threat will materialize if President Donald Trump decides government shutdown negotiations are stalled.\n\n\"If the president decides that the negotiations are absolutely going nowhere, that there, you know, there will start to be layoffs,” Hassett said when asked on CNN’s \"State of the Union” when layoffs would occur.\n\n\"But I think that everybody is still hopeful that when we get a fresh start at the beginning of the week, that we can get the Democrats to see that it's just common sense to avoid layoffs like that,\" he added.\n\nAsked what constitutes a \"Democratic agency\" that Trump has threatened to cut, Hassett said it was a negotiating tactic to show Democrats who are refusing to vote to fund the government what impact a shutdown would have in their area. He added a Democratic agency would be \"shorthand for the agencies that generally are the favorites of the Democrats.\"\n\n\"Senate Democrats are marching in unison towards like destruction, like letting us off a hill, off a cliff. And so I think that in the end, that it's natural to put more pressure on the states where the senators are being intransigent, so the senators themselves see the costs that they're imposing on the American people. I think that's completely logical,” he said.\n\nMeanwhile, neither of the top leaders in the Senate expressed much confidence that a vote to fund the government would pass anytime soon. \n\nSenate Majority Leader John Thune said on Fox News’ \"Sunday Morning Futures” that \"there’s not a lot to negotiate,” saying the shutdown will last \"as long as the Democrats want it to go on. Right now, we're at a stalemate.”\n\n\"It's just as long as the Democrats want it to go on. I mean, they're the ones -- they have the controlling card right now,” Thune said when asked how long he thought the shutdown would last.\n\nMinority Leader Chuck Schumer said the two sides are stalled because Republicans refuse to negotiate.\n\n\"In every case, we sat down and talked with the Republicans, and there was a give and take. And then both sides didn't get everything they wanted, but we got it done,” Schumer said on CBS’ \"Face the Nation” of his experience when he was Senate majority leader.\n\n\"They have refused to talk to us even once … we've tried to talk to them for months and months and months and they said, ‘No.’”\n\nThe top House leaders appeared on NBC's \"Meet the Press” on Sunday and continued to criticize each other’s handling of negotiations, focusing more on behavior than the policy sticking points. \n\nHouse Minority Leader Hakeem Jeffries called Republicans behavior during the shutdown \"unhinged.”\n\n\"Well, that behavior is outrageous, it's unhinged, it's unreasonable, and it speaks for itself. The American people deserve better than lies, than attacks, than deep fake videos and the president spending all of his time on the golf course. We need serious leadership.”\n\nJeffries again pushed back on false claims from Republicans that Democrats were attempting to give Medicaid to migrants without legal status.\n\n\"Well, unfortunately, Republicans are lying because they're losing in the court of public opinion as it relates to what's going on right now. We are standing up for the health care of hardworking American taxpayers, of working class Americans, of middle class Americans and everyday Americans,\" Jeffries said. \"Now, federal law clearly prohibits the expenditure of taxpayer dollars to provide health care to undocumented immigrants, period, full stop, and no Democrat on Capitol Hill is trying to change that law.\"\n\nSpeaker of the House Mike Johnson appeared immediately after Jeffries on \"Meet the Press” and argued that Democrats were trying to focus on health care because it was a distraction from the real issue. \n\n\"Literally, everything my friend just said there was unnecessary, because what he's trying to talk about is a December funding issue, the health care provision, some of these Obamacare subsidies that expire December 31,” Johnson said. \"He is looking over entirely the fact that we have to keep the government open in order to have those bipartisan debates and discussions that he just referenced.”\n\nSchumer argued he didn’t believe Republicans were taking the shutdown seriously, highlighting Trump’s memes throughout the week and Johnson’s decision to send the House home next week. \n\n\"You actually need Johnson,” Schumer said. \"If you're going to negotiate any agreement, you need Johnson, Thune, Trump, Schumer and Jeffries, and the reason he sent them home is because he's more interested in protecting the Epstein files than protecting the American people from the health care crisis,” Schumer argued.\n\nAsked about his decision to not call the House back in the session and whether it had to do with a pending vote on releasing the Jeffrey Epstein files, Johnson continued to point the finger at Democrats.\n\n\"The reason the government is closed is because Chuck Schumer and 43 of his Democrat colleagues in the Senate have decided now to vote multiple times to keep the government closed. We need them to turn the lights back on so that everyone can do their work. The House did our work. We passed a bipartisan, clean continuing resolution to keep the government open,” Johnson said.\n\nHassett continued to put the onus on Democrats if they want to avoid threatened layoffs. \n\n\"What we want is we want the Democrats to come forward and to make a deal that's a clean continuing resolution that gives us seven more weeks to talk about these things. But the bottom line is that with Republicans in control, Republicans have a lot more power over the outcome than the Democrats. And the Democrats need to show some leadership,” Hassett warned.","summary":"The president's top economic adviser put the onus on Democrats.","url":"https://abcnews.go.com/Politics/hassett-layoffs-trump-thinks-shutdown-negotiations/story?id=126235602","image":"https://i.abcnewsfe.com/a/5c0b593e-f408-4e07-9064-6a6e3ed68444/hassett-20251005-ap-jh_1759691868987_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-10-05 22:22:06","author":"Lalee Ibssa","authors":["Lalee Ibssa"],"language":"en","source_country":"us","sentiment":-0.556},{"id":366487030,"title":"Should Investors Worry About the \"October Effect?\" History Offers a Compelling Answer.","text":"The tough times that have happened in October are enough to scare off anyone. From the panic of 1907 to Black Tuesday of 1929 and, more recently, Black Monday of 1987, the month of October has been ripe with financial crises and market crashes over time. And that's led investors to talk about the \"October effect,\" the idea that stocks are likely to decline during this month.\n\nThis may worry some investors right now, especially as valuations of S&P 500 companies have climbed -- along with the index, which recently reached a record high. The benchmark finished September, a month that's also been associated with stock market declines, on a positive note, gaining 3.5%, and this puts it on track for an annual increase of 14%.\n\nBut will the October effect interrupt this positive story? History offers a compelling answer.\n\nThe reason behind recent gains\n\nFirst of all, it's important to consider the reason behind the gains we've seen in recent weeks. Stocks have soared, led by technology and growth players, amid generally positive economic and political elements as well as industry-specific news.\n\nThe Federal Reserve lowered interest rates last month and signaled two more to come, moves that could cut borrowing costs for companies and support the wallets of consumers. President Donald Trump has negotiated with countries regarding import tariffs. This, along with encouraging comments from companies about their ability to manage tariffs, has eased investors' minds about tariff headwinds.\n\nFinally, tech companies' plans to increase spending in the high-growth area of artificial intelligence (AI) have also buoyed market sentiment, driving up their shares along with those of a great variety of companies positioned to benefit from AI. This market is forecast to grow from the billions today to the trillions early next decade. If this happens, many industries -- and early investors in AI players -- may benefit.\n\nThe risk ahead\n\nAll this has helped the S&P 500 soar in recent times, and that's great. However, the problem is that valuations have also surged. The S&P 500 Shiller cyclically-adjusted price-to-earnings (CAPE) ratio has reached beyond 35, something it's done only twice before since the benchmark launched with 500 companies more than 60 years ago. This is an inflation-adjusted picture of stock prices, as it considers companies' earnings per share over a 10-year period.\n\nS&P 500 Shiller CAPE Ratio data by YCharts. CAPE Ratio = cyclically-adjusted price-to-earnings ratio.\n\nHere's the risk: When stocks get too expensive, investors may consider them overvalued and hesitate to invest. If that sentiment prevails, the general market might decline. So, this could support a drop in stocks in October.\n\nNow, let's consider what history says about the October effect. A quick look at the past six years shows that the S&P 500 has actually given us a 50-50 split between winning and losing months.\n\nData source: Ycharts.\n\nAnd we might even consider October as more positive than negative since declines in recent years haven't been extreme, yet the winning months have been particularly strong.\n\nIs the October effect a real concern?\n\nAll this suggests that investors shouldn't worry too much about the October effect, as it's more of a subject for conversation than something that's really played out in a big way in recent years. It's also important to remember that stock market gains and losses don't just happen randomly but are linked to specific problems, such as the financial crisis of 2008, stemming from the subprime mortgage situation, to cite a somewhat recent crash.\n\nWhat does this mean for you as an investor? As mentioned, some stocks have become expensive, and this has been the case for a while. Eventually, this could result in declines, but it's impossible to predict when this will happen. Meanwhile, it's a great idea to invest as usual: Consider each company individually and buy shares of those that offer solid long-term prospects.\n\nAt the same time, any potential decline in stocks shouldn't be something to fear. Instead, a drop offers you, as a long-term investor, the opportunity to buy quality players at a good price. All this means that, regardless of which direction the S&P 500 takes in October, this month still could play a valuable role in your effort to build wealth over time.","summary":"October is often seen as a bad month for stocks.","url":"https://www.fool.com/investing/2025/10/05/should-investors-worry-about-the-october-effect-hi/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F836205%2Fgettyimages-pensive-investor-at-computer.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-10-05 22:10:00","author":"Adria Cimino","authors":["Adria Cimino"],"language":"en","source_country":"us","sentiment":-0.136}]}