{"offset":0,"number":50,"available":22347,"news":[{"id":395186406,"title":"Trump unleashed a 'Nazi problem' — and it won't stop anytime soon: Journalist","text":"President Donald Trump appears to have unleashed a \"Nazi problem\" in the U.S. that won't disappear anytime soon, according to one journalist. \n\nMehdi Hasan, founder of Zeteo News, penned a new op-ed for The Guardian in which he argued that the Trump administration has overtly adopted Nazi propaganda techniques. He cited the use of certain phrases that seem to harken back to Nazi slogans and imagery shared on government social media accounts. \n\nHasan also noted that multiple people in the Trump administration, from Ed Martin at the Department of Justice to Paul Ingrassia at the Government Services Administration, have ties to Nazi groups. \n\n\"To be clear: this isn’t about calling everyone the left disagrees with a Nazi, as Trump administration spokespersons like to claim; it’s about recognizing when actual Nazis are not just right in front of us but in power,\" Hasan wrote. \"So here’s a simple rule for Trump and his friends: if you don’t want to be called Nazis, stop hiring Nazis, quoting Nazis and posting Nazi imagery.\" \n\nHasan added that Nazi groups have seen the signals flying around the Trump campaign as well. He quoted the founder of a known white supremacist group who proclaimed, “Our side won the election,\" after Trump retook the White House in 2024. \n\n\"But don’t expect any of that to stop any time soon,\" Hasan continued. \"In his first term, the president praised neo-Nazis as 'very fine people' and then his acolytes spent years desperately denying he had ever done so. Today, there is very little denial, shame, or contrition. The United States government under Trump has made a deliberate, calculated, and shameful decision to embolden and enable Nazi-glorifying elements within his party; to elevate and amplify Nazi messaging.\" \n\nRead the entire op-ed by clicking here.","summary":"President Donald Trump appears to have unleashed a \"Nazi problem\" in the U.S. that won't disappear anytime soon, according to one journalist. \n\nMehdi Hasan, founder of Zeteo News, penned a new op-ed for The Guardian in which he argued that the Trump administration has overtly adopted Nazi propaganda techniques. He cited the use of certain phrases that seem to harken back to Nazi slogans and imagery shared on government social media accounts. \n\nHasan also noted that multiple people in the Trump administration, from Ed Martin at the Department of Justice to Paul Ingrassia at the Government Services Administration, have ties to Nazi groups. \n\n\"To be clear: this isn’t about calling everyone the left disagrees with a Nazi, as Trump administration spokespersons like to claim; it’s about recognizing when actual Nazis are not just right in front of us but in power,\" Hasan wrote. \"So here’s a simple rule for Trump and his friends: if you don’t want to be called Nazis, stop hiring Nazis, quoting Nazis and posting Nazi ","url":"https://www.rawstory.com/trump-2675007159/","image":"https://www.rawstory.com/media-library/trump-greeted-with-bad-news-from-the-new-york-times-as-davos-wraps-up.jpg?id=63071555&width=1200&height=1200&coordinates=158%2C0%2C158%2C0","video":null,"publish_date":"2026-01-23 01:29:03","author":"Robert Davis","authors":["Robert Davis"],"language":"en","source_country":"US","sentiment":-0.048},{"id":395183472,"title":"Proof the USA is hurtling towards an unthinkable endgame","text":"Deals of the Week\n2:26AMFriday, January 23rd, 2026\n\nTubi: watch for free\n\nSet your local weather \n\nBreaking News\n\nCourts & Law\n\nCourts & Law\n\nCourts & Law\n\nCourts & Law\n\nSouth Australia\n\nWestern Australia\n\nNorthern Territory\n\nBreaking News\n\nNorth America\n\nUS Politics\n\nSouth America\n\nMiddle East\n\nUK Politics\n\nHealth Problems\nMental Health\n\nInspiration\nWeight Loss\n\nSchool Life\n\nRestaurants & Bars\nFood Warnings\n\nRelationships\n\nThe Sealed Section\n\nFamily & Friends\n\nFashion Shows\n\nFashion Trends\n\nFace & Body\nCosmetic Surgery\n\nTrue Stories\n\nLifestyle Videos\n\nTravel Ideas\n\nShort Breaks\n\nFood & Drinks\n\nDestinations\n\nNorth America\n\nNew Zealand\n\nMiddle East\nCentral America\nSouth America\n\nTravel Advice\n\nTips & Tricks\n\nAccommodation\n\nAustralian Holidays\n\nNorthern Territory\n\nSouth Australia\n\nWestern Australia\n\nTravel Videos\nEntertainment\n\nCelebrity Life\n\nHook Ups & Break ups\nCelebrity Photos\nCelebrity Kids\nCelebrity Deaths\n\nCelebrity Style\n\nWhat To Watch\n\nMorning Shows\nCurrent Affairs\n\nUpcoming Movies\n\nMovies Reviews\n\nMusic Festivals\n\nBooks & Magazines\n\nGolden Globes\n\nEntertainment Videos\n\nSocial Media\n\nMobile Phones\n\nHome Entertainment\n\nArchaeology\n\nEnvironment\n\nClimate Change\nSustainability\nNatural Wonders\n\nMotoring News\n\nOn the Road\n\nTechnology Videos\n\nCost of Living\n\nHow to Save\n\nSalary Secrets\nPersonal Finance\n\nSuperannuation\n\nAustralian Culture\nPower & Influence\n\nInside Parliament\n\nGig Economy\n\nBreaking News\n\nManufacturing\n\nOther Industries\n\nAustralian Economy\nWorld Economy\nInterest Rates\nFederal Budget\n\nAustralian Markets\nWorld Markets\nAustralian Dollar\nCryptocurrency\n\nReal Estate\n\nSydney & NSW\nMelbourne & VIC\nAdelaide & SA\n\nCricket Live Scores\n\nSports Life\n\nAmerican Sports\n\nParalympics\n\nV8 Supercars\n\nHorse Racing\n\nExpert Opinion\n\nMore Sports\n\nSport Videos\n\nSales & Deals\n\nHome & Appliances\n\nHealth & Wellbeing\n\nNorth America\nUs Politics\n\nThe unrest in Minnesota is a disturbingly familiar scenario — and it could be the beginning of America’s unthinkable endgame\nA previously unthinkable scenario appears increasingly likely as the US tumbles through one of its darkest chapters in modern history.\nJamie Seidel\n\n@JamieSeidel\n\nJanuary 23, 2026 - 5:22AM\n234 Comments\n\nShare via Email\n\nShare on Facebook\n\nShare on Whatsapp\n\nListen to this article\n\n‘They’re going after people’: ‘Anti-ICE freaks’ in Minnesota wreak havoc in the state\n\nSky News host Caleb Bond has hit out at “anti-ICE freaks” in Minnesota who are “impeding” Immigration and Customs Enforcement...\nmorelessToggle full description view\n\nMinnesota is on the verge of martial law. \nIt’s a move that many fear can trigger civil war.\n“Local and state police have been ordered to stand down and surrender,” proclaimed Trump Administration Chief of Staff Stephen Miller.\n“Only federal officers are upholding the law.”\nBut the US Constitution does not allow the federal government to order state law enforcement officials to “surrender”.\n\nnews.com.au\n'I make $200k' ICE agent brags to onlookers\n\nmorelessToggle full description view\n\nUnless they are openly fighting federal forces. That scenario appears increasingly likely.\nFederal Immigration and Customs Enforcement (ICE) agents are roaming Minneapolis and Saint Paul’s streets, masked, heavily armed and in unmarked cars.\nProtesters are hounding them, recording their every move to document often violent ID checks, detentions, and arrests.\nDemonstrators for and against are marching and clashing.\n\nShots have been fired. People have died.\nNow, the Trump Administration has ordered the mobilisation of 1,500 Arctic warfare specialist paratroopers in Alaska as preparation for deployment.\nMinnesota’s Governor Tim Walz has activated his state’s National Guard units to stand alongside his state’s police.\nHave your say in the Great Aussie Debate here:\n\nIt’s a disturbingly familiar scenario.\nUS pro and anti slavery activists began their protests in 1854. Animosity soared. As did the violence. The US Supreme Court’s erratic decisions didn’t help.\nIt soon devolved to state versus state, then Union versus Confederacy. \nThen, shortly before dawn on April 12, 1861, the first shots of the US Civil War were fired.\nSecessionist South Carolina militia unleashed an assault on Union troops based at Fort Sumter.\nThe rest, as they say, is history.\n\nProtestors clash with federal agents outside the Bishop Henry Whipple Federal Building in Saint Paul, Minnesota. Picture: Octavio JONES / AFP\nThat history is now threatening to rhyme.\nThis time, the flashpoint is immigration. But the same root causes are there: an enormous economic divide, class power structures, deeply entrenched racism, and polarising cultural and religious beliefs.\nMinnesota is now a flashpoint.\nThe pot has been stirred.\nAll US President Donald Trump needs is a plausible excuse to send in his military.\nHe wants to do it.\nGovernor Walz knows it.\n“Do not take the bait. Do not allow them to invoke the Insurrection Act,” he warned late last week. “Do not allow them to declare martial law. Do not allow them to lie about the security and the decency of this state.”\n\nRenee Good was fatally shot by a federal agent in her car on January 7. Picture: Scott Olson/Getty Images/AFP\nOperation Metro Surge\nPresident Trump has repeatedly labelled Democrat-run states and cities “hellholes” and “lawless”. Over the past year, he’s tried hard to federalise control over state-based National Guard troops to give him a means to directly intervene in these states’ affairs.\nHe made his reasoning clear immediately after the killing of Renee Nicole Good by an ICE officer in Central Minneapolis.\n“The reason these incidents are happening is because the Radical Left is threatening, assaulting, and targeting our Law Enforcement Officers and ICE Agents on a daily basis,” Trump said in a public statement.\nThe 37-year-old mother of three had been following ICE agents in her car. The Department of Homeland Security insists she tried to run down its agents.\n\nPeople visit a memorial for Renee Good at the site where she was killed. Picture: Brandon Bell / Getty Images via AFP\nMinnesota officials dispute this account. They say they will investigate the case themselves. They call the federal intervention unconstitutional. And Governor Walz is urging citizens to continue filming ICE agent “atrocities”. \n“Help us create a database of the atrocities against Minnesotans, not just to establish a record for posterity but to bank evidence for future prosecution,” Governor Walz said.\nAn enraged Trump responded with a post to Truth Social:\n“If the corrupt politicians of Minnesota don’t obey the law and stop the professional agitators and insurrectionists from attacking the Patriots of I.C.E., who are only trying to do their job, I will institute the INSURRECTION ACT, which many Presidents have done before me, and quickly put an end to the travesty that is taking place in that once great State.”\n\nPresident Trump has repeatedly labelled Democrat-run states and cities ‘hellholes’ and ‘lawless’. Picture: CHARLY TRIBALLEAU / AFP\nBut the US Supreme Court has blocked his moves to take control of state-based National Guard units. It has ruled he has repeatedly failed to prove the necessary Constitutional prerequisites have been met.\nNow President Trump has an alternative.\nActive-duty paratroop battalions of the US Army’s 11th Airborne Division based near Anchorage, Alaska, have been placed on heightened alert.\nTheir skills would be ideal for a surprise attack on Greenland’s capital, Nuuk. But they’re being told to prepare to occupy Minneapolis’ icy streets instead.\nIt’s an idea President Trump outlined to an unprecedented gathering of all senior US military commanders in September.\nHe expressed a desire for a “quick reaction force that can help quell civil disturbances”. He added he wanted the military to be on standby for “rapid nationwide deployment”.\nTrump also said why.\n“San Francisco, Chicago, New York, Los Angeles — they’re very unsafe places, and we’re going to straighten them out one by one. And this is going to be a major part for some of the people in this room. That’s a war, too. It’s a war from within…”\nThe mobilisation of the 11th Airborne Division now gives him the rapid deployment force he wants.\n\nPolice officers take cover as they clash with protesters after an officer shot and killed a black man in Minneapolis, Minnesota back in 2021. Picture: Kerem Yucel / AFP\n“FEAR NOT, GREAT PEOPLE OF MINNESOTA, THE DAY OF RECKONING & RETRIBUTION IS COMING!”\n“The “enemy within” frame may rapidly become a self-fulfilling prophecy,” warns retired US Army Special Forces Colonel David Maxwell.\n“When a substantial minority of the population moves from grievance to toleration of violence, the probability of violent escalation, and the likelihood that political elites will exploit such fear, increases.”\nThat prophecy is looming large.\nAnd President Trump is prepared.\n“That’s what the oath says, foreign and domestic,” Trump told his generals in September.\n“Well, we also have domestic…”\nHe told the US Army, Air Force, and Navy commanders that he wanted their troops to use US cities as “training grounds” for anti-insurrection and occupation warfare.\nHe continues to lay the groundwork as to why.\n\nPresident Donald Trump has an alternative. Picture: AP Photo/Jose Luis Magana\n“Do the people of Minnesota really want to live in a community in which there are thousands of already convicted murderers, drug dealers and addicts, rapists, violent released and escaped prisoners, dangerous people from foreign mental institutions and insane asylums, and other deadly criminals too dangerous to even mention,” Trump posted to Truth Social last week.\nChief of Staff Miller has called the opposition Democratic Party a domestic extremist organisation. And many Trump Administration members - especially the President himself - have repeatedly called for the arrest, and even execution, of their political opponents.\n“Today’s political paralysis raises the risk of democratic collapse,” argues the Stimson Centre’s Burrows. “Trump’s rhetoric and actions continue to blur constitutional lines. With institutional legitimacy eroding, a second American Revolution is no longer unthinkable, but increasingly plausible.”\nThat plausibility became even stronger with Governor Walz’s move to mobilise his National Guard.\nIt raises the possibility of a military-versus-military clash on the streets of Minneapolis.\n“They remain ready in the event they are needed to help keep the peace, ensure public safety, and allow for peaceful demonstrations,” the governor said in a statement Friday.\nMeanwhile, the political rhetoric is getting even more heated.\n“The risk is that political and security elites will treat fellow citizens as enemies until they behave like enemies,” Colonel Maxwell warns. “This is a classic self-fulfilling prophecy: labelling a group as a security threat invites surveillance, exclusion, and coercion.”\n\nMinnesota Gov. Tim Walz and his wife, Gwen Walz, attend a vigil honoring Renee Good. Picture: Minnesota Public Radio via AP\nNational divorce\n“It is the Insurrection Act he seems keen to invoke, which would give him dictatorial-like powers like we’ve never seen used before in this country – not even in the civil war,” argues defence analyst and former US Air Force pilot Dr Janine Davison.\n“The Civil War was a war between states with militaries fighting on battlefields. A Trump-led deployment of federalised Guard and active-duty troops to quell a fabricated insurrection inside American cities, should only be understood as war on the American people.”\nProfessor of Political Science at Syracuse University, Ryan Griffiths, says the prospect of a “peaceful national divorce” as advocated by controversial Republican Senator Marjorie Green is unrealistic.\nJust not the national divorce bit.\n“There is no way to disentangle red and blue America without tremendous violence,” Professor Griffiths warns.\nAn October poll by PBS News/NPR/Marist found almost a third of all Americans say political violence may now be necessary to “get the country back on track”.\nWhatever that track may be.\nThat’s double the figure of a year earlier.\n“If Americans convince themselves that violence may be necessary to ‘set the country on track,’ they may be producing the very ‘enemy within’ that political leaders claim to fear,” warns Colonel Maxwell.\nThe division into “Red” and “Blue” states is also increasingly on the cards.\n\nGriffiths says the prospect of a ‘peaceful national divorce’ as advocated by controversial Republican Senator Marjorie Green is unrealistic. Picture: Octavio JONES / AFP\nSome 20 per cent of US citizens favoured the idea in 2023. A New York Times poll late last year shows that 64 per cent are now “interested” in the concept.\n“Should someone like California Gov. Gavin Newsom, Texas Gov. Greg Abbott or the sore loser of a 2028 election conclude that the system is rigged, and secession is the only solution, then the entire project gains legitimacy,” warns Professor Griffiths.\n“Without decisive action by political leaders to reduce the polarisation that threatens to tear the country apart, the United States is at risk of turning from one country into two”.\nBut Colonel Maxwell argues electoral interference from a ‘Dark Quad’ of nations including Russia, China, Iran and North Korea has moved the crisis beyond domestic politics.\n“What we see in America today are not political grievances requiring compromise to reduce,” he writes.\n“We see exaggerated grievances. We see those grievances magnified by our adversaries through social media in very effective ways that cause Americans to blame those with different political beliefs for the perceived ills of the nation.\n\nMore Coverage\n‘Blind for life’: Explosive ICE clip rocks US\nHeath Parkes-Hupton\nICE protesters push MAGA fan over the edge\nFrank Chung\n“All Americans must understand that calling fellow Americans the enemy or participating in political violence against fellow Americans or the US government and its institutions is exactly the effect the ‘Dark Quad’ is trying to achieve. \n“Anyone who does so is complicit in the enemy’s political warfare strategy either wittingly or at the least as a ‘useful idiot’.”\nJamie Seidel is a freelance writer | @jamieseidel.bsky.social\n\nJoin the conversation (234 Comments)\n\nAdd your comment to this story\n\nTo join the conversation, please\n log in. Don't have an account?\n\nJoin the conversation, you are commenting as\n\nMore related stories\nUS Politics\n‘At large’: Trump admin’s whopping blunder\nThe Trump administration’s excuse for treating a US citizen with no criminal record like dirt has collapsed in embarrassing fashion.\n\nUS Politics\nPic says it all about Trump’s Board of Peace\nThe US President was surrounded by an eclectic group of world leaders for the signing ceremony of his Board of Peace, with a few key allies noticeably absent\n\nPower & Influence\nPM’s savage Trump takedown rocks Aus\nA key ally’s savage take-down of US President Donald Trump has been widely discussed within the Albanese government.\n\nRegistration\n\nIn The Know Quiz\nNewsletters\nCompetitions\n\nWelcome to news.com.au\n\nCode of Conduct\n\nHelp and Support\n\nGeneral Feedback\nAdvertise with us\nStandards of Practice\n\nLicensing & Reprints\n\nOur News Network\n\nThe Daily Telegraph\n\nThe Courier Mail\n\nOur Partners\n\nrealestate.com.au\n\nCODE Sports\n\nA NOTE ABOUT RELEVANT ADVERTISING: We collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites. Find out more about our policy and your choices, including how to opt-out.Sometimes our articles will try to help you find the right product at the right price. We may receive payment from third parties for publishing this content or when you make a purchase through the links on our sites.\n\nPrivacy policy\nRelevant ads opt-out\nCookie policy\nTerms of use\nNationwide News Pty Ltd © 2026. All times AEDT (GMT +11). Powered by WordPress.com VIP\n\nMore stories before you go","summary":"A previously unthinkable scenario appears increasingly likely as the US tumbles through one of its darkest chapters in modern history.","url":"https://www.news.com.au/world/north-america/us-politics/the-unrest-in-minnesota-is-a-disturbingly-familiar-scenario-and-it-could-be-the-beginning-of-americas-unthinkable-endgame/news-story/ee7f517dba39306af2517fa9706c466e?from=rss-basic","image":"https://content.api.news/v3/images/bin/7db72ea01ac4ad436f6539d9adef2ae0","video":null,"publish_date":"2026-01-23 01:25:42","author":"Jamie Seidel","authors":["Jamie Seidel"],"language":"en","source_country":"au","sentiment":0.624},{"id":395183468,"title":"‘At large’: Trump admin’s whopping blunder","text":"The Donald Trump Show: Live in Switzerland – sorry, the World Economic Forum in Davos – continues. \n\nThe US president launched his Board of Peace on Thursday, Switzerland time. A host of leaders attended to give the body its seal of a approval. \n\nBut not one major American ally was among them. Instead the leaders of the likes of Argentina and Hungary greeted Mr Trump. \n\nWhile PMs and presidents of many countries close to the US had been invited to sit on the board there remain concerns about its remit, the fact warmonger Vladimir Putin could be on the board and a $US1 billion price tag for a permanent seat. Even China seems sceptical.\n\nIt comes after a rollercoaster of day at Davos for Donald Trump on Wednesday. He went into the Swiss ski resort demanding the US take over Greenland. Then he removed the threat of force to achieve that, then the threat of tariffs and finally said a deal was done which – seemingly – could see Greenland remain Danish after all.\n\nIt’s still unclear what Mr Trump has called a “framework” of a deal actually entails.\n\nIn the US, former special counsel Jack Smith, who led the federal prosecutions of Donald Trump during the Biden Administration is testifying to Congress. He has denied he had any animus towards Mr Trump.\n\nAnd Vice President J.D. Vance has defended ICE after it detained a five-year-old boy, who was present while agents arrested his father. It’s also emerged that ICE agents manhandled a US citizen, dragging him half-naked into sub-zero temperatures, while searching for a man who was already in prison.\n\nRead on for more updates.","summary":"The Trump administration’s excuse for treating a US citizen with no criminal record like dirt has collapsed in embarrassing fashion.","url":"https://www.news.com.au/world/north-america/us-politics/us-politics-live/live-coverage/3aaaa0cace949cd3c49c2a61d1754923?from=rss-basic","image":"https://content.api.news/v3/images/bin/785cbd30f4874e933134eb5d4f16cb03","video":null,"publish_date":"2026-01-23 01:25:42","author":"Brielle Burns,Samuel Clench","authors":["Brielle Burns","Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.205},{"id":395186368,"title":"Trump's 'bulldozing' will cost his party in November: WSJ editors","text":"The conservative Wall Street Journal editorial board warned President Donald Trump on Thursday that his \"bulldozing\" will cost his party its majority after the midterm elections. \n\nTrump has been on a warpath over the last week, threatening U.S. allies with invasion unless Denmark annexes Greenland to the U.S. and approving an operation to abduct Venezuelan dictator Nicolás Maduro. Those moves appear to be part of Trump's political brand, where he seems to steamroll his opponents with no recourse. But voters seem to be tiring of that, and Trump ought to take heed ahead of the midterm election, warned the Journal editors in a new editorial. \n\n\"It’s hard to know what Mr. Trump might do next, which feeds public anxiety,\" they wrote. \"But as his popularity ebbs, so does his political capital. His approval rating has sunk, his mass deportations are seen as excessive, tariffs are unpopular, and even GOP voters disliked his Greenland demands. Democrats took November’s races in Virginia and New Jersey in a rout. The GOP House majority is in peril, and the Senate is competitive. Mr. Trump’s attempts to gerrymander a safer House majority have backfired as Democrats have done the same.\"\n\n\"The ultimate check on power is an election, and on that score Mr. Trump’s bull-dozing governance may be building the opposition that costs his party its majority in November,\" they added. \n\nRead the entire editorial by clicking here.","summary":"The conservative Wall Street Journal editorial board warned President Donald Trump on Thursday that his \"bulldozing\" will cost his party its majority after the midterm elections. \n\nTrump has been on a warpath over the last week, threatening U.S. allies with invasion unless Denmark annexes Greenland to the U.S. and approving an operation to abduct Venezuelan dictator Nicolás Maduro. Those moves appear to be part of Trump's political brand, where he seems to steamroll his opponents with no recourse. But voters seem to be tiring of that, and Trump ought to take heed ahead of the midterm election, warned the Journal editors in a new editorial. \n\n\"It’s hard to know what Mr. Trump might do next, which feeds public anxiety,\" they wrote. \"But as his popularity ebbs, so does his political capital. His approval rating has sunk, his mass deportations are seen as excessive, tariffs are unpopular, and even GOP voters disliked his Greenland demands. Democrats took November’s races in Virginia and New Jersey in a rout. The ","url":"https://www.rawstory.com/trump-davos-2675007204/","image":"https://www.rawstory.com/media-library/donald-trump.jpg?id=63074198&width=1200&height=1200&coordinates=408%2C0%2C408%2C0","video":null,"publish_date":"2026-01-23 01:15:27","author":"Robert Davis","authors":["Robert Davis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.674},{"id":395181766,"title":"TikTok finalizes U.S. spinoff entity, ending battle over Chinese ownership","text":"TikTok’s Chinese owner, ByteDance, finalized a deal on Thursday to set up a majority American-owned joint venture company to avoid a U.S. ban on the popular social media app used by more than 200 million Americans.\n\nThe deal is a milestone for the short video app after years of battles that began in August 2020, when President Donald Trump first tried unsuccessfully to ban the app over national security concerns.\n\nTikTok USDS Joint Venture LLC will secure U.S. user data, apps and the algorithm through data privacy and cybersecurity measures, the company said.\n\nThe agreement provides for American and global investors, including cloud computing giant Oracle, private equity group Silver Lake and Abu Dhabi-based MGX, to hold a stake of 80.1% in the new joint venture, while ByteDance will retain 19.9%.","summary":"TikTok USDS Joint Venture LLC will secure U.S. user data, apps and the algorithm through data privacy and cybersecurity measures, the company said.","url":"https://globalnews.ca/news/11628201/tiktok-us-ownership-deal-finalized/","image":"https://globalnews.ca/wp-content/uploads/2025/10/0aba8361d70d888d570fb0a2a611d54026ef6e3bfd8d0fe11dc83ff2d7ce54e7_51b65f.jpg?quality=65&#038;strip=all","video":null,"publish_date":"2026-01-23 01:10:04","author":"Globalnews Digital,Reuters","authors":["Globalnews Digital","Reuters"],"language":"en","source_country":"ca","sentiment":0.103},{"id":395186364,"title":"Republicans barely block bid to rein in Trump's Venezuela military action","text":"The latest in a series of congressional efforts to rein in President Donald Trump’s military aggression against Venezuela failed Thursday as Republican lawmakers again defeated a war powers resolution by the tightest possible margin.\n\nHouse lawmakers voted 215-215 on H.Con.Res.68—introduced last month by Rep. James McGovern (D-Mass.)—which “directs the president to remove US armed forces from Venezuela unless a declaration of war or authorization to use military force for such purpose has been enacted.”\n\nUnlike in the Senate, where the vice president casts tie-breaking votes, a deadlock in the House means the legislation does not pass.\n\nEvery House Democrat and two Republicans—Reps. Don Bacon of Nebraska and Thomas Massie of Kentucky—voted in favor of the measure. Every other Republican voted against it. Rep. Tom McClintock (R-Calif.) did not vote.\n\nThe House vote came a week after Vice President JD Vance’s tie-breaking vote was needed to overcome a 50-50 deadlock on a similar resolution introduced last month by Sens. Tim Kaine (D-Va.), Rand Paul (R-Ky.), Adam Schiff (D-Calif.), and Senate Minority Leader Chuck Schumer (D-NY).\n\nThe War Powers Resolution of 1973—also known as the War Powers Act—was enacted during the Nixon administration toward the end of the US war on Vietnam, Cambodia, and Laos. The law empowers Congress to check the president’s war-making authority by requiring the president to report any military action to Congress within 48 hours. It also mandates that lawmakers approve any troop deployments lasting longer than 60 days.\n\nThursday’s vote followed this month’s US bombing and invasion of Venezuela and kidnapping of its president, Nicolás Maduro, and his wife on dubious “narco-terrorism” and drug trafficking allegations. Trump has also imposed an oil blockade on the South American nation, seizing seven tankers. Since September, the US has also been bombing boats accused of transporting drugs in the Caribbean Sea and Pacific Ocean.\n\n“If the president is contemplating further military action, then he has a moral and constitutional obligation to come here and get our approval,” McGovern said following the vote.\n\nHouse Foreign Affairs Committee Ranking Member Gregory Meeks (D-NY) lamented the resolution’s failure, saying, “The American people want us to lower their cost of living, not enable war.”\n\nRep. Mark Pocan (D-Wis.) said on Bluesky: “Only Congress has the authority to declare war. Today, I voted for a war powers resolution to ensure Trump cannot send OUR armed forces to Venezuela without explicit authorization from Congress.”\n\nCavan Kharrazian, senior policy adviser at the advocacy group Demand Progress, also decried the resolution’s failure.\n\n“We are deeply disappointed that the House did not pass this war powers resolution, though it’s notable that it failed only due to a tie,” he said.\n\n“As with the recent Senate vote, the administration expended extraordinary energy pressuring Republicans to block this resolution,” Kharrazian added. “That effort speaks for itself: With the American people tired of endless war, the administration knows that a Congress willing to enforce the law can meaningfully curtail illegal and escalatory military action. We urge members of Congress to continue fully exercising their constitutional authority over matters of war.”","summary":"The latest in a series of congressional efforts to rein in President Donald Trump’s military aggression against Venezuela failed Thursday as Republican lawmakers again defeated a war powers resolution by the tightest possible margin.\n\nHouse lawmakers voted 215-215 on H.Con.Res.68—introduced last month by Rep. James McGovern (D-Mass.)—which “directs the president to remove US armed forces from Venezuela unless a declaration of war or authorization to use military force for such purpose has been enacted.”\n\nUnlike in the Senate, where the vice president casts tie-breaking votes, a deadlock in the House means the legislation does not pass.\n\nEvery House Democrat and two Republicans—Reps. Don Bacon of Nebraska and Thomas Massie of Kentucky—voted in favor of the measure. Every other Republican voted against it. Rep. Tom McClintock (R-Calif.) did not vote.\n\nBy the tightest margin, Republicans blocked a War Powers Resolution to stop Trump's illegal military action to take Venezuela's oil.\n\nTrump is losing support in C","url":"https://www.rawstory.com/trump-venezuela-2675007226/","image":"https://www.rawstory.com/media-library/donald-trump-and-venezuela.jpg?id=62345043&width=1200&height=1200&coordinates=333%2C0%2C334%2C0","video":null,"publish_date":"2026-01-23 01:02:01","author":"Brett Wilkins,Common Dreams","authors":["Brett Wilkins","Common Dreams"],"language":"en","category":"politics","source_country":"US","sentiment":-0.228},{"id":395191588,"title":"Trump says Putin, Zelenskyy want to make a deal to end war","text":"p>ABOARD ​AIR FORCE ONE: President Donald Trump ‌said ⁠on Thursday ‌both Russian President Vladimir Putin and ​Ukrainian President Volodymyr Zelenskyy have ‌said ‌they would like to make ⁠a deal to end the ⁠nearly ⁠four-year-old war..Late-night talks between Russia's Putin and US envoys conclude.Earlier ‌in ‌the day, Trump met ‍Zelenskyy on the sidelines of the World Economic Forum in Switzerland.</p","url":"https://www.deccanherald.com/world/trump-says-putin-zelenskyy-want-to-make-a-deal-to-end-the-war-3871820","image":"https://media.assettype.com/deccanherald/2025-08-19/z2fsrboj/Representative-Image.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2026-01-23 01:01:06","author":null},{"id":395179952,"title":"Vance defends ICE during visit to Minneapolis following weeks of unrest","text":"US vice president JD Vance arrives for a news conference after a roundtable with local leaders and community members in Minneapolis. (EPA Images pic)\nMINNEAPOLIS: US vice president JD Vance delivered a broad defence of the thousands of federal agents leading an aggressive immigration enforcement operation in Minneapolis, saying that \"far-left agitators\" and uncooperative local officials are to blame for chaos on the streets.\nVance's visit to the city marked a renewed effort by President Donald Trump's administration to win public support for its immigration crackdown, amid signs that even some of the president's supporters are growing wary of the aggressive tactics on display in Minneapolis, where scores of heavily armed masked agents have flooded the streets.\nFlanked by federal officers and two Immigration and Customs Enforcement patrol cars bearing the slogan \"Defend the Homeland\", Vance repeated his assertion that Renee Good \"rammed\" her car into an ICE officer before he fatally shot the 37-year-old mother of three on Jan 7, sparking weeks of unrest.\n\"I think that Renee Good's death is a tragedy,\" he said. \"I also think that she rammed an ICE officer with her car.\"\nAnalyses of bystander video by Reuters and other outlets show Good's wheels were turned away from the officer, Jonathan Ross, and his legs were clear of the vehicle at the time he fired. It is unclear whether the car made contact with Ross, but he did not fall during the incident and can be seen walking afterward.\nDemocratic leaders in Minnesota have rejected Vance's account, and state authorities have launched an investigation into the shooting.\nFive-year-old boy detained\nIn an incident that provoked new outrage, school officials in the suburb of Columbia Heights said on Wednesday that immigration officers had detained a 5-year-old boy on Tuesday.\nVance accused the media of misrepresenting that incident, saying the boy was left behind when his father tried to flee from agents.\n\"What are they supposed to do?\" he said. \"Are they supposed to let a 5-year-old child freeze to death?\"\nThe child watched masked agents take his father from the driveway of their home before they pointed the boy to the back door of the house and motioned for him to knock, according to Rachel James, a city council member who said she witnessed the incident. The boy was eventually taken from the scene.\nA department of homeland security spokesperson said parents targeted by ICE operations are asked if they want their children taken with them or placed with a person they designate.\nThe department said the boy's father, Adrian Alexander Conejo Arias, was in the country illegally but did not provide details or mention any criminal history. A lawyer for the family said his clients, who are from Ecuador, were in the US legally and applied for asylum in 2024.\nThe lawyer denied that the father had tried to flee and said school officials had offered to take in the boy. The mother stayed inside the house at her husband's urging, the lawyer said, for fear that she, too, would otherwise be detained.\nCity on edge\nMinneapolis has been on edge as roving federal officers have rounded up suspects they assert are dangerous criminal immigration violators, while sometimes ensnaring law-abiding US citizens and immigrants.\nThey have been met with throngs of demonstrators conducting their own patrols, blowing warning whistles and shouting at the agents, with some officers responding by deploying pepper spray and other chemical irritants.\nDemocratic officials, including Minneapolis Mayor Jacob Frey, have accused the administration of deliberately trying to stoke unrest and said the presence of federal officers is causing chaos.\nVance said local officials' refusal to aid immigration agents was to blame. \"If we had a little cooperation from state and local law enforcement officers, I think the chaos would go way down,\" he said.\nSpeaking to reporters separately later in the day, Frey said city and state officials welcomed cooperation with federal law enforcement to catch violent criminals \"no matter where they're from\", but not \"hunting down a guy, a dad, who did nothing wrong\".\n\"If we're looking for an antidote to many of the issues that we've faced over the last several weeks, there's a very easy answer. And it's for this huge influx of federal agents, ICE and border patrol, to go home,\" the mayor said.\nHe disputed Vance's assertion that local police were standing by to leave federal officers vulnerable to harassment and interference, saying, \"We have responded. Where safety has been compromised, our officers have stepped in to help.\"\nFrey also defended city ordinances barring local police from directly assisting federal agents in immigration enforcement, a restriction he and other proponents of such \"sanctuary city\" policies have argued is vital to maintain the public's trust in local law enforcement.\nAddressing Vance's call for improved communication with state and local authorities, Frey said he had received no invitation from the vice president to meet during his Minneapolis visit.\n\"Give me a call,\" the mayor said. \"JD Vance can feel free to reach out.\"\nVance has taken a leading role in defending the Good shooting. Less than 24 hours after Good's death, Vance made a rare appearance in the White House briefing room, where he defended the officer, blamed Good and said the incident should be a political test ahead of the 2026 midterm elections that will determine control of Congress.\nThree arrested after church protest\nThe administration has shown no sign of backing down in Minneapolis. Officials said on Thursday they had arrested at least three people in connection with a demonstration that interrupted a Sunday service in a St Paul church, where civil rights leaders alleged a pastor is also a top local ICE official.\nThere are some 3,000 federal law enforcement officers in Minnesota, part of what the Department of Homeland Security has described as its largest immigration operation ever. The city is the latest Democratic-leaning jurisdiction that Trump has targeted with a federal show of force.\nVance said on Thursday that Trump does not see the need \"right now\" to follow through on his threat to invoke the Insurrection Act, a 19th-century law that gives the president the power to dispatch troops in the US to put down uprisings.\nTrump has said he launched the Minnesota operation in response to fraud allegations against some members of the state's sizable Somali American community. The president has described Somali immigrants as \"garbage\" and said they should be thrown out of the country.","summary":"The US vice president said ‘far-left agitators’ and uncooperative local officials are to blame for chaos on the streets.","url":"https://www.freemalaysiatoday.com/category/world/2026/01/23/vance-defends-ice-during-visit-to-minneapolis-following-weeks-of-unrest","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/49ed92e8-jd-vance-23012026.webp","video":null,"publish_date":"2026-01-23 01:00:33","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.428},{"id":395183718,"title":"National Park Service removes slavery exhibits from President's House amid pressure from Trump administration","text":"Exhibits honoring nine people who were enslaved at George Washington's house in Center City were dismantled by National Park Service employees Thursday afternoon, months after a Trump administration review put the memorial's future in doubt. \n\nExhibits on the exterior of the house at Sixth and Market streets, where Washington lived as president in Philadelphia, were stripped from the brick facade of the building. Monitors and text displays, which told the stories of the enslaved people and offered background on the slave trade, were gone by nightfall. The names of the nine people etched into the wall of the building remained unaltered. \n\nMORE: Divisive bill to ban city from burning its trash put on hold before a vote\n\n\"This historically outrageous and blatantly racist destruction began at around 3:30 p.m. today,\" Michael Coard, the criminal defense attorney who spearheaded the memorial's installation in 2010, said Thursday afternoon. \n\nIn May, U.S. Interior Secretary Doug Burgum ordered a review of any federal display that \"disparages Americans past or living.\" Exhibits across the country, including 20 at Smithsonian museums in Washington, were flagged by the White House as \"ideological\" displays subject to review and removal. The slavery exhibit in Philadelphia was not mentioned directly, but the New York Times reported in September it was on the chopping block. \n\nThe removal of the exhibits prompted Mayor Cherelle Parker’s administration to file a lawsuit Thursday as it reviews a 2006 agreement between the city and the federal government that could require advance notice for changes to the site, the Inquirer reported.\n\nCoard said his organization, Avenging the Ancestors Coalition, is reviewing its own response to the removal of the exhibits and plans to fight the decision. \n\nIn August, demonstrators rallied outside the memorial to protest the White House review and the possible threat to numerous displays at Independence National Historical Park. City Council unanimously passed a resolution in September condemning the president's attack on historical sites. \n\n\"We know that George Washington had slaves, it's a part of American history,\" Council President Kenyatta Johnson said in September. \"When we celebrate the 250th celebration of America, that should be part of the record as well. Donald Trump's approach to whitewash American history shouldn't be tolerated and will not be tolerated.\"\n\nCoard and ATAC celebrated the 15th anniversary of the memorial in December, and Coard recalled the lengthy effort to get the exhibits installed. He said he had never been taught in school about Washington owning slaves in Philadelphia and didn't learn about it until he was a practicing lawyer. \n\n\"This thing is here, so children 5, 10, 20 years from now won't have the gaps in history that I had from not knowing,\" Coard said in December. \"... It's an open-air library to tell you everything you need to know about George Washington here in Philly, about slavery here in Philly.\"\n\nPhillyVoice staff writer Michaela Althouse contributed to this report.","summary":"Exhibits honoring nine people who were enslaved at George Washington's house in Center City were dismantled Thursday. Michael Coard, who spearheaded the memorial's installation in 2010, called the move 'blatantly racist.'","url":"https://www.phillyvoice.com/national-park-service-slavery-exhibits-presidents-house/","image":"https://media.phillyvoice.com/media/images/PXL_20260122_222824440.2e16d0ba.fill-1200x630-c0.jpg","video":null,"publish_date":"2026-01-23 01:00:19","author":"Michael Tanenbaum,Michaela Althouse","authors":["Michael Tanenbaum","Michaela Althouse"],"language":"en","category":"politics","source_country":"us","sentiment":-0.123},{"id":395171902,"title":"US military and intelligence officials 'set to release UFO evidence' in 2026","text":"Growing speculation from those in the know hints that America might finally unveil authentic UFO evidence come 2026. Reports this week suggest that fresh whistleblower threats, mounting political pressure , and new legislation are all converging towards a major revelation about how the White House has been storing information on extraterrestrial craft. Experts speaking to the Daily Mail indicate that the sheer volume of military and intelligence personnel prepared to speak openly has reached a tipping point where maintaining secrecy could prove impossible. The prospect regained momentum following November 2025's release of The Age of Disclosure, a documentary showcasing 34 present and former US government, military and intelligence personnel - including Marco Rubio - suggesting a multi-decade concealment operation. The film thrust the matter straight onto President Donald Trump's priority list, according to director Dan Farah, whilst bolstering the leader's enduring pledge to declassify all government-held data on mysterious airborne activities and phenomena, reports the Mirror US . Meanwhile, in Congress, the fiscal year 2026 National Defense Authorization Act has demanded full disclosure of all UAP incidents stretching back to 2004 - mandating an investigation into whether crucial evidence has been excessively classified or intentionally withheld from parliamentarians. Filmmaker Mark Christopher Lee, renowned for his extraterrestrial-focused work, revealed to the Daily Mail that 2026 is particularly significant due to \"escalating congressional momentum, whistleblower activity, and cultural shifts that are building unstoppable pressure on government secrecy.\" Lee explained that \"the fiscal year 2026 National Defense Authorization Act includes key provisions mandating the Pentagon's All-Domain Anomaly Resolution Office to brief Congress on UAP intercepts since 2004, review over-classification of related data, and streamline reporting,\". According to Lee, whether crucial information surfaces depends on political will: \"With ongoing efforts like the proposed UAP Disclosure Act amendments and whistleblowers such as David Grusch continuing to advise congressional caucuses into 2026, the legislative push is intensifying.\" Grusch, a former US Air Force intelligence officer, has alleged the existence of covert programmes designed to retrieve and reverse-engineer downed UFOs. In The Age of Disclosure, Secretary of State Marco Rubio revealed: \"We've had repeated instances of something operating in the airspace over restricted nuclear facilities - and it's not ours.\" He further stated that presidents have \"been operating on a need-to-know basis\" regarding such incidents. The possible ramifications of such earth-shattering revelations are being examined internationally - with former Bank of England analyst Helen McCaw warning The Times that this fresh intelligence could trigger economic turmoil. \"The United States government appears to be partway through a multi-year process to declassify and disclose information on the existence of a technologically advanced non-human intelligence responsible for Unidentified Anomalous Phenomena (UAPs),\" she penned. \"We may have to acknowledge the existence of a power or intelligence greater than any government.\" McCaw cautioned that \"UAP disclosure is likely to induce ontological shock. There might be extreme price volatility in financial markets due to catastrophising or euphoria.\"","url":"https://www.dailystar.co.uk/news/weird-news/military-intelligence-officials-set-release-36595995","image":"https://i2-prod.dailystar.co.uk/article36595993.ece/ALTERNATES/s1200b/0_Satellite-image-UFO-spaceship-and-text-overlay-at-night-with-FBI-investigation-and-evidence-Surveillance-photo-and-area.jpg","video":null,"publish_date":"2026-01-23 01:00:00","author":"Maria Leticia Gomes","authors":["Maria Leticia Gomes"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.362},{"id":395179982,"title":"EU has ‘serious doubts’ about Trump’s ‘Board of Peace’","text":"The 'Board of Peace' was unveiled by US President Donald Trump at the World Economic Forum, with leaders from 19 countries signing its charter. (EPA Images pic)\nBRUSSELS: European leaders have serious doubts about the scope of President Donald Trump's \"Board of Peace\" but are ready to work with the United States and the newly founded body in Gaza, EU chief Antonio Costa said Friday.\n\"We have serious doubts about a number of elements in the charter of the Board of Peace related to its scope, its governance and its compatibility with the UN Charter,\" the European Council president said after an EU leaders' summit in Brussels.\n\"We are ready to work together with the US on the implementation of the comprehensive Peace Plan for Gaza, with a Board of Peace carrying out its mission as a transitional administration\".\nThe founding charter of Trump's body for resolving international conflicts has a US$1 billion price tag for permanent membership.\nAlthough originally meant to oversee Gaza's rebuilding, the board's charter does not seem to limit its role to the Palestinian territory and appears to want to rival the United Nations.\nSpanish Prime Minister Pedro Sanchez told reporters after the summit that his country had \"declined\" the invitation to participate in the body.\nTrump unveiled the new Board of Peace at the World Economic Forum in the Swiss ski resort of Davos Thursday, joined on stage by leaders and officials from 19 countries to sign its founding charter.\nKey US allies including France and Britain have expressed doubts.\nLondon expressed concerns about the inclusion of Russian President Vladimir Putin, whose forces are fighting in Ukraine after invading in 2022.\nFrance said the charter as it currently stood was \"incompatible\" with its international commitments, especially its UN membership.","summary":"Leaders express concerns about Russia’s inclusion and the board’s governance and its compatibility with the UN Charter.","url":"https://www.freemalaysiatoday.com/category/world/2026/01/23/eu-has-serious-doubts-about-trumps-board-of-peace","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/d9c789b5-board-of-peace-1.jpg","video":null,"publish_date":"2026-01-23 00:59:41","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.307},{"id":395190530,"title":"Trump opposes plan to use 401(k) savings for home down payments","text":"WASHINGTON — President Donald Trump said he opposes a plan endorsed by one of his top economic advisers that would allow Americans to use retirement savings from their 401(k) accounts to make down payments on homes.\n\n\"I'm not a huge fan. Other people like it,\" Trump told reporters Thursday, Jan. 22, aboard Air Force as he returned to Washington from Davos, Switzerland, where he attended the World Economic Forum. \"And one of the reasons I don't like it is that their 401(k)s are doing so well.\"\n\nTrump's comments marked an abrupt shift in White House policy after Kevitt Hassett, director of the National Economic Council in the White House, last week said the Trump administration was finalizing a plan for some 401(K) funds to go toward home down payments, as part of a series of new White House initiatives on housing.\n\nMore: Why does Trump want Fannie and Freddie to buy mortgage bonds?\n\n\"We're going to allow people to take money out of their 401(k)s and use that for down payment,\" Hassett told Fox Business in a Jan. 16 interview, adding that Trump planned to lay out the plan in Davos. \"We're still talking about the mechanics of it,\" he added.\n\nTrump never mentioned the plan, however, in his speech before the World Economic Forum. He instead touted a Jan. 20 executive order banning institutional investors from buying single-family homes in a push to lower housing costs for Americans.\n\nTrump has been rolling out several policy proposals and actions aimed at addressing affordability concerns as Americans continue to express cost-of-living concerns. But he seemed to rule out the 401(k) proposal for home down payments.\n\nMore: Trump says he wants to ban large-scale investors from buying homes\n\n\"The housing market's good, but the 401(k)s are doing much better than the housing market. I like keeping their 401(k)s in great shape,\" he said. \"You've got people telling me they're up 88%. And over the period of a year, over a full year, it's going to be close to 100%.\"\n\nHousing prices in 2025 rose by 1.7% from October 2024 to October 2025, according to the U.S. Federal Housing Finance Agency's most recent monthly report in December. The median home price nationally rose to $433,000 in November 2025, according to the real estate company Redfin.\n\nThe United States faces a severe housing shortage and a stagnant housing market. Pending sales of homes dropped nearly 6% in December from the previous year.\n\nContributing: Reuters\n\nReach Joey Garrison on X @joeygarrison.","url":"https://eu.usatoday.com/story/news/politics/2026/01/22/trump-rejects-401k-savings-home-down-payments-housing-costs/88308838007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/23/USAT/88309420007-20260121-t-122104-z-856730051-rc-2-o-5-jaa-99-st-rtrmadp-3-davosmeetingtrump.JPG?auto=webp&crop=1258,708,x0,y65&format=pjpg&width=1200","video":null,"publish_date":"2026-01-23 00:51:19","author":"Usa Today","authors":["Usa Today"],"language":"en","source_country":"us","sentiment":-0.18},{"id":395179996,"title":"Ringgit opens near five-year high vs US dollar after BNM holds OPR","text":"KUALA LUMPUR: The ringgit opened near a five-year high against the US dollar on Friday after Bank Negara Malaysia (BNM)’s Monetary Policy Committee (MPC) kept the Overnight Policy Rate (OPR) at 2.75%.\nThe local currency was at around 4.02 per US dollar at the start of trade, a level last seen on Jan 21, 2021, when it was quoted at 4.0280/4.0320.\nAt 8am, the ringgit strengthened to 4.0285/4.0440 against the greenback, compared with Thursday’s close of 4.0370/4.0415.\nBank Muamalat Malaysia Bhd chief economist Afzanizam Rashid said the MPC’s decision reinforced expectations of policy stability, supporting the local currency.\nHe said market sentiment has improved after United States President Donald Trump softened his stance on Greenland.\nIn addition, US Personal Consumption Expenditures inflation rose as expected to 2.8% in December from 2.7% previously, reinforcing expectations that the US Federal Reserve would keep interest rates unchanged next week, he said.\n“Meanwhile, the US Dollar Index fell 0.48% to 98.287 points, while spot gold prices continued to hit record highs at US$4,939.64 per ounce. As such, the ringgit could appreciate further today amid dollar weakness,” he added.\nIn early trade, the ringgit traded mixed against a basket of major currencies.\nIt rose against the Japanese yen to 2.5416/2.5516 from 2.5440/2.5469 on Thursday, but slipped against the British pound to 5.4381/5.4590 from 5.4273/5.4334 and eased against the euro to 4.7347/4.7529 from 4.7205/4.7257.\nAgainst regional peers, the local currency also traded mixed.\nIt strengthened versus the Philippine peso to 6.81/6.84 from 6.82/6.83, was little changed against the Indonesian rupiah at 238.4/239.4 from 238.9/239.3, but weakened against the Singapore dollar to 3.1458/3.1581 from 3.1441/3.1478 and slipped versus the Thai baht to 12.9592/13.0187 from 12.8587/12.8792.","summary":"The local note strengthens to 4.0285/4.0440 against the US dollar, reaching a level last seen on Jan 21, 2021.","url":"https://www.freemalaysiatoday.com/category/business/2026/01/23/ringgit-opens-near-five-year-high-vs-us-dollar-after-bnm-holds-opr","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/05/6b0661b7-ringgit.webp","video":null,"publish_date":"2026-01-23 00:50:15","author":"Bernama","authors":["Bernama"],"language":"en","category":"business","source_country":"my","sentiment":-0.16},{"id":395178668,"title":"Washington names top embassy official in Venezuela","text":"CARACAS: The United States has named a new head for its embassy in Venezuela, a US diplomatic source told AFP Thursday, just under three weeks after Washington toppled the oil-rich Latin American country’s leader.\n\nThe US embassy page listed Laura F. Dogu — a former ambassador to Nicaragua and Honduras — as the new charge d’affaires to Venezuela, where US-backed interim president Delcy Rodriguez has taken over from Nicolas Maduro. Maduro was seized by US troops in a lightning January 3 attack on the capital Caracas that President Donald Trump said leaves the United States able to “run” the country and control its oil industry.\n\nCaracas and Washington severed diplomatic ties after Maduro’s widely disputed claim to reelection in 2019, and the US embassy has been mostly deserted since then, barring a few local employees.\n\nHowever, John McNamara served as US charge d’affaires for Venezuela — based in neighboring Colombia — since last year.\n\nA charge d’affaires heads a diplomatic mission in the absence of a full ambassador.\n\nMcNamara travelled with other US diplomats to Caracas days after Maduro’s ouster to “conduct an initial assessment for a potential phased resumption of operations” at the embassy.","summary":"CARACAS: The United States has named a new head for its embassy in Venezuela, a US diplomatic source told AFP Thursday, just under three weeks after Washington toppled the oil-rich Latin American country’s leader.\n\n\nThe US embassy page listed Laura F. Dogu — a former ambassador to Nicaragua and Honduras — as the new charge d’affaires to Venezuela, where US-backed interim president Delcy Rodriguez has taken over from Nicolas Maduro. Maduro was seized by US troops in a lightning January 3 attack on the capital Caracas that President Donald Trump said leaves the United States able to “run” the country and control its oil industry.\n\n\nCaracas and Washington severed diplomatic ties after Maduro’s widely disputed claim to reelection in 2019, and the US embassy has been mostly deserted since then, barring a few local employees.\n\n\nHowever, John McNamara served as US charge d’affaires for Venezuela — based in neighboring Colombia — since last year.\n\n\nA charge d’affaires heads a diplomatic mission in the absence of a fu","url":"https://www.brecorder.com/news/40403634/washington-names-top-embassy-official-in-venezuela","image":"https://i.brecorder.com/large/2026/01/2304541859ae6e7.webp","video":null,"publish_date":"2026-01-23 00:48:09","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.362},{"id":395189520,"title":"China, Hong Kong stocks inch higher","text":"SHANGHAI: Mainland China and Hong Kong stocks moved between gains and losses before ending slightly higher on Thursday, as advances in aerospace and energy shares helped offset declines in non-ferrous metals after gold fell amid easing geopolitical worries.\n\nOn Wednesday, US President Donald Trump abruptly stepped back from threats to impose tariffs as leverage to seize Greenland, ruled out the use of force, and suggested that a deal was in sight to end a dispute over the Danish territory that risked the deepest rupture in transatlantic relations in decades.\n\nAt the close, the benchmark Shanghai Composite Index advanced 0.14 percent, while the blue-chip CSI300 Index inched up 0.01 percent.\n\nAerospace and energy shares were among the biggest winners, with sub-indexes tracking the two sectors jumping 3.41 percent and 2.33 percent, respectively.\n\nNon-ferrous metal shares fell, with a sub-index tracking the sector losing 0.78 percent. Western Region Gold plunged 4 percent.\n\nStock consolidation came after Shanghai and Shenzhen stock exchanges each took regulatory measures over the past week against hundreds of abnormal trading practices, such as price pumping and false orders. The bourses also launched probes into several listed companies over allegedly misleading statements.\n\nThe measures reflect regulators’ intention to slow the pace of market gains.\n\nWilliam Bratton, head of cash equity research for APAC at BNP Paribas Exane, said the firm remains positive on Chinese equities in 2026, favoring materials, industrials and technology over consumer sectors in line with earnings and economic data.\n\nBritain and China will aim to revive a “golden era” business dialogue when Prime Minister Keir Starmer visits Beijing next week, sources told Reuters, with top company executives from both sides invited to participate.\n\nIn Hong Kong, the benchmark Hang Seng Index climbed 0.17 percent, while the city’s tech shares rose 0.28 percent.","summary":"SHANGHAI: Mainland China and Hong Kong stocks moved between gains and losses before ending slightly higher on Thursday, as advances in aerospace and energy shares helped offset declines in non-ferrous metals after gold fell amid easing geopolitical worries.\n\n\nOn Wednesday, US President Donald Trump abruptly stepped back from threats to impose tariffs as leverage to seize Greenland, ruled out the use of force, and suggested that a deal was in sight to end a dispute over the Danish territory that risked the deepest rupture in transatlantic relations in decades.\n\n\nAt the close, the benchmark Shanghai Composite Index advanced 0.14 percent, while the blue-chip CSI300 Index inched up 0.01 percent.\n\n\nAerospace and energy shares were among the biggest winners, with sub-indexes tracking the two sectors jumping 3.41 percent and 2.33 percent, respectively.\n\n\nNon-ferrous metal shares fell, with a sub-index tracking the sector losing 0.78 percent. Western Region Gold plunged 4 percent.\n\n\nStock consolidation came after Sha","url":"https://www.brecorder.com/news/40403550/china-hong-kong-stocks-inch-higher","image":"https://i.brecorder.com/large/2026/01/2300463939144c8.webp","video":null,"publish_date":"2026-01-23 00:48:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.127},{"id":395189516,"title":"European shares rebound as Trump withdraws tariff threats","text":"FRANKFURT: European shares logged their biggest daily jump in nearly two months on Thursday in investor relief that US President Donald Trump dropped tariff threats on regional countries and ruled out the use of force to acquire Greenland.\n\nThe pan-European STOXX 600 climbed 1 percent to 608.86 points, and recovered some weekly losses after the renewed trade war tensions sparked a global selloff earlier this week.\n\nTrump said he withdrew the tariff threat following a meeting with NATO Secretary General Mark Rutte, during which they reached the framework of a deal for Greenland’s future.\n\nWhile details were scant, Trump’s comments were enough to spur a risk-on mode across global markets.\n\nConstruction stocks and banks led gains by 2 percent each.\n\nStill, analysts cautioned against complacency and urged investors to remain wary as tariff threats become an increasingly normalized negotiating tactic.\n\n“The hidden risk is complacency. Investors get conditioned to ignore threats because ‘it’ll get walked back,’ until the day it doesn’t get walked back,” said Matthew Tuttle, CEO of Tuttle Capital Management.\n\nTrump’s latest threats against Europe, less than a year after he slapped duties on the export-dependent region, shook confidence in the transatlantic relationship. EU leaders will rethink ties with the US at an emergency summit on Thursday, diplomats said.\n\nUpbeat earnings also buoyed sentiment in the region. Volkswagen advanced 6.5 percent and led German stocks higher after Europe’s largest carmaker reported better-than-expected net cash flow for 2025. The broader automobile sector added 2.3 percent.\n\nInvestors were also monitoring developments around Ukraine peace talks. Easing geopolitical tensions overall had investors selling defence stocks that fell 2 percent, marking their biggest single-day decline in over a month.\n\nOn the other hand, Ukraine-exposed stocks such as Austrian bank Raiffeisen gained 7 percent and airline Wizz Air added 9 percent.","summary":"FRANKFURT: European shares logged their biggest daily jump in nearly two months on Thursday in investor relief that US President Donald Trump dropped tariff threats on regional countries and ruled out the use of force to acquire Greenland.\n\n\nThe pan-European STOXX 600 climbed 1 percent to 608.86 points, and recovered some weekly losses after the renewed trade war tensions sparked a global selloff earlier this week.\n\n\nTrump said he withdrew the tariff threat following a meeting with NATO Secretary General Mark Rutte, during which they reached the framework of a deal for Greenland’s future.\n\n\nWhile details were scant, Trump’s comments were enough to spur a risk-on mode across global markets.\n\n\nConstruction stocks and banks led gains by 2 percent each.\n\n\nStill, analysts cautioned against complacency and urged investors to remain wary as tariff threats become an increasingly normalized negotiating tactic.\n\n\n“The hidden risk is complacency. Investors get conditioned to ignore threats because ‘it’ll get walked back","url":"https://www.brecorder.com/news/40403551/european-shares-rebound-as-trump-withdraws-tariff-threats","image":"https://i.brecorder.com/large/2026/01/2300472454865a6.webp","video":null,"publish_date":"2026-01-23 00:48:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.005},{"id":395189518,"title":"Wall Street inches toward record on tariff relief","text":"NEW YORK: Wall Street’s main indexes rose toward record highs on Thursday after President Donald Trump dialed back his threat of tariffs on European countries, while a new batch of economic data underscored a resilient US economy.\n\nThe gains follow the S&P 500’s biggest one-day percentage gain in two months on Wednesday when Trump stepped back from imposing tariffs as leverage to seize Greenland and said a deal was in sight to end a dispute over the Danish territory.\n\nTrump’s tariff threats had sent shivers through global markets on Tuesday, though buyers quickly returned to stock markets following his U-turn.\n\nTech stocks were at the forefront of the rally, with Alphabet, Tesla and Apple all up nearly 1 percent, while Meta gained 3 percent.\n\nThe small-cap Russell 2000 index gained 1.3 percent to a record high.\n\n“It’s the TACO trade follow on from yesterday,” said Dustin Thackeray, head of portfolio management at Crewe Advisors, referring to traders’ acronym for “Trump Always Chickens Out” - what some say is the US president’s tendency to ramp up threats only to later back down.\n\n“There’s definitely a lot going on in the geopolitical realm, and I don’t think that’s going to slow down anytime soon, especially as it a midterm year,” said Thackeray.\n\nThe CBOE Volatility Index, also known as Wall Street’s fear gauge, slid to 15.52 points, moving further from a two-month peak touched on Tuesday.\n\nAt 11:27 a.m. ET, the Dow Jones Industrial Average rose 410.16 points, or 0.84 percent, to 49,487.39, the S&P 500 gained 47.41 points, or 0.69 percent, to 6,922.96 and the Nasdaq Composite gained 238.25 points, or 1.03 percent, to 23,463.07.\n\nUS consumer spending increased solidly in November and October, likely keeping the economy on track for a third straight quarter of strong growth, the personal consumption expenditures index showed.\n\nSeparate data showed initial claims for state unemployment benefits increased less than expected last week, while the US economy grew by a slightly more-than-expected 4.4 percent in the third quarter of 2025.\n\nThe data lands ahead of the US central bank’s rate decision next week, where it is widely expected to stand pat on interest rates amid still-sticky inflation and evidence of economic resilience.","summary":"NEW YORK: Wall Street’s main indexes rose toward record highs on Thursday after President Donald Trump dialed back his threat of tariffs on European countries, while a new batch of economic data underscored a resilient US economy.\n\n\nThe gains follow the S&amp;P 500’s biggest one-day percentage gain in two months on Wednesday when Trump stepped back from imposing tariffs as leverage to seize Greenland and said a deal was in sight to end a dispute over the Danish territory.\n\n\nTrump’s tariff threats had sent shivers through global markets on Tuesday, though buyers quickly returned to stock markets following his U-turn.\n\n\nTech stocks were at the forefront of the rally, with Alphabet, Tesla and Apple all up nearly 1 percent, while Meta gained 3 percent.\n\n\nThe small-cap Russell 2000 index gained 1.3 percent to a record high.\n\n\n“It’s the TACO trade follow on from yesterday,” said Dustin Thackeray, head of portfolio management at Crewe Advisors, referring to traders’ acronym for “Trump Always Chickens Out” - what som","url":"https://www.brecorder.com/news/40403552/wall-street-inches-toward-record-on-tariff-relief","image":"https://i.brecorder.com/large/2026/01/23004805e852d2a.webp","video":null,"publish_date":"2026-01-23 00:48:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.151},{"id":395189512,"title":"Malaysian stocks edge higher","text":"BENGALURU: Malaysian equities inched higher, while the ringgit was steady on Thursday after the country’s central bank kept its interest rate unchanged, expecting robust growth this year.\n\nElsewhere, currencies appreciated on the day, with the Indonesian rupiah extending gains after the Indonesian central bank held rates and stressed rupiah stabilisation efforts on Wednesday, pulling the currency from record low levels.\n\nThe ringgit was at 4.0420 per US dollar, while Kuala Lumpur stocks advanced 0.6 percent to within a few points of a seven-year peak. The currency, among Asia’s strongest, appreciated nearly 0.5 percent so far this month after a 9 percent gain in 2025.\n\nStrong economic growth and record-high trade performance last year highlighted Malaysia’s strong economic fundamentals, while reducing pressure on the central bank to ease rates any further.\n\nBank Negara Malaysia (BNM) left its overnight policy rate unchanged at 2.75 percent, as expected, and forecast economic growth in 2025 at the upper end of its outlook range.\n\n“The rate hold was widely anticipated. There were no major shifts in rhetoric in the policy statement either, which retained the ‘appropriate and supportive’ stance, benign inflation view and acknowledgment of both upside and downside risks to growth,” ANZ economist Krystal Tan said.\n\nJeff Ng, head of Asia macro strategy at SMBC, said, “Looks like BNM can afford to wait and see without committing to a dovish or hawkish tone.”\n\nStocks in the region raced towards record highs on Thursday after US President Donald Trump softened his stance on EU tariff threats and ruled out seizing Greenland from an ally by force, reviving appetite for riskier assets.\n\nThe MSCI gauge of Asian emerging stocks surged 0.7 percent, with equities in South Korea securing a record closing high, Taiwan ended a few points shy of its all-time high.\n\nEast Asian benchmarks rose as the pause in geopolitical tensions allowed markets to return to artificial intelligence-linked asset optimism.\n\n“The rebound is strongest in pockets, which were earlier in good momentum, notably in semiconductor markets such as South Korea and Taiwan,” Rajat Agarwal, Asia equity strategist at Societe Generale, said.\n\n“In addition to the developments on the greenback, the renewed confidence on global AI spending and demand from industry leaders is certainly helping these markets.”\n\nStocks across Southeast Asia advanced: Singapore and Indonesia resumed their move towards lifetime highs scaled earlier this month.","summary":"BENGALURU: Malaysian equities inched higher, while the ringgit was steady on Thursday after the country’s central bank kept its interest rate unchanged, expecting robust growth this year.\n\n\nElsewhere, currencies appreciated on the day, with the Indonesian rupiah extending gains after the Indonesian central bank held rates and stressed rupiah stabilisation efforts on Wednesday, pulling the currency from record low levels.\n\n\nThe ringgit was at 4.0420 per US dollar, while Kuala Lumpur stocks advanced 0.6 percent to within a few points of a seven-year peak. The currency, among Asia’s strongest, appreciated nearly 0.5 percent so far this month after a 9 percent gain in 2025.\n\n\nStrong economic growth and record-high trade performance last year highlighted Malaysia’s strong economic fundamentals, while reducing pressure on the central bank to ease rates any further.\n\n\nBank Negara Malaysia (BNM) left its overnight policy rate unchanged at 2.75 percent, as expected, and forecast economic growth in 2025 at the upper en","url":"https://www.brecorder.com/news/40403553/malaysian-stocks-edge-higher","image":"https://i.brecorder.com/large/2026/01/230049219ed7287.webp","video":null,"publish_date":"2026-01-23 00:48:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":0.134},{"id":395178678,"title":"Iran warns ‘finger on trigger’ as Trump says it wants talks","text":"PARIS: The commander of Iran’s Revolutionary Guards on Thursday warned Washington that the force had its “finger on the trigger” in the wake of mass protests, as US President Donald Trump said the Islamic republic still appeared interested in talks.\n\nTrump has repeatedly left open the option of new military action against Iran after Washington backed and joined Israel’s 12-day war in June aimed at degrading Iranian nuclear and ballistics programmes.\n\nA fortnight of protests starting in late December shook the clerical leadership under supreme leader Ayatollah Ali Khamenei, but the movement has petered out in the face of a crackdown that activists say has left thousands dead, accompanied by an unprecedented internet blackout.\n\nThe prospect of immediate American action against Tehran appears to have receded over the last week, with both sides insisting on giving diplomacy a chance even as US media report Trump is still studying options.\n\nAddressing the World Economic Forum in Davos, Trump said the US struck Iranian uranium enrichment sites last year to prevent Tehran from making a nuclear weapon. Iran denies its nuclear programme is aimed at seeking the bomb.\n\n“Can’t let that happen,” he said, adding: “And Iran does want to talk, and we’ll talk.”\n\nIn a standoff marked by seesawing rhetoric, Trump had on Tuesday warned Iran’s leaders the US would “wipe them off the face of this earth” if there was any attack on his life in response to a strike targeting Khamenei.\n\nGuards commander General Mohammad Pakpour warned Israel and the United States “to avoid any miscalculations, by learning from historical experiences and what they learned in the 12-day imposed war, so that they do not face a more painful and regrettable fate”.\n\n“The Islamic Revolutionary Guard Corps and dear Iran have their finger on the trigger, more prepared than ever, ready to carry out the orders and measures of the supreme commander-in-chief — a leader dearer than their own lives,” he said, referring to Khamenei.\n\nHis comments came in a written statement quoted by state television marking the national day in Iran to celebrate the Guards, a force whose mission is to protect the 1979 Islamic revolution from internal and external threats.\n\nActivists accuse the Guards of playing a frontline role in the deadly crackdown on protests. The group is sanctioned as a terrorist entity by countries including Australia, Canada and the United States, and campaigners have long urged similar moves from the EU and UK.\n\nPakpour took over as Guards commander last year after his predecessor Hossein Salami was one of several key military figures killed in an Israeli strike during the 12-day war, losses which revealed Israel’s deep intelligence penetration of the Islamic republic.","summary":"PARIS: The commander of Iran’s Revolutionary Guards on Thursday warned Washington that the force had its “finger on the trigger” in the wake of mass protests, as US President Donald Trump said the Islamic republic still appeared interested in talks.\n\n\nTrump has repeatedly left open the option of new military action against Iran after Washington backed and joined Israel’s 12-day war in June aimed at degrading Iranian nuclear and ballistics programmes.\n\n\nA fortnight of protests starting in late December shook the clerical leadership under supreme leader Ayatollah Ali Khamenei, but the movement has petered out in the face of a crackdown that activists say has left thousands dead, accompanied by an unprecedented internet blackout.\n\n\nThe prospect of immediate American action against Tehran appears to have receded over the last week, with both sides insisting on giving diplomacy a chance even as US media report Trump is still studying options.\n\n\nAddressing the World Economic Forum in Davos, Trump said the US struck","url":"https://www.brecorder.com/news/40403574/iran-warns-finger-on-trigger-as-trump-says-it-wants-talks","image":"https://i.brecorder.com/large/2026/01/230131545f0f4f9.webp","video":null,"publish_date":"2026-01-23 00:48:08","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.32},{"id":395179166,"title":"‘Trump whisperer’ Rutte steers NATO around Greenland crisis","text":"AMSTERDAM/BRUSSELS - As tensions over Greenland between Donald Trump and Europe neared boiling point this week, NATO boss Mark Rutte cemented his reputation as a 'Trump whisperer' after the U.S. president dropped his tariff threats following a meeting in Davos.Trump said he and Rutte agreed on a 'framework of a future deal' on the entire Arctic Region, which would be 'a great one for the United States of America, and all NATO Nations.'While details were scant, the outcome was a ​diplomatic win for Rutte that steered the fraying transatlantic alliance back from the precipice, diplomats and political analysts said.","summary":"The NATO chief's strategy with Donald Trump is not subtle — it is built on lavishing praise on the U.S. president even as other European leaders grow increasingly critical.","url":"https://www.japantimes.co.jp/news/2026/01/23/world/trump-whisperer-mark-rutte/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2026/01/23/518846.JPG?v=3.1","video":null,"publish_date":"2026-01-23 00:46:00","author":"Andrew Gray,Anthony Deutsch,John Irish,Lili Bayer,Web Master","authors":["Andrew Gray","Anthony Deutsch","John Irish","Lili Bayer","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":0.297},{"id":395181394,"title":"Carney says Canadian values key to sovereignty, pushes back on Trump's remarks","text":"While Carney did not mention Trump by name, he was widely seen as taking a stand against the Trump administration's use of tariffs and threats to conduct foreign policy.\n\nThat message drew a rebuke from Trump, who said in his own address to the WEF on Wednesday that Carney should be \"grateful.\"\n\nIn a statement issued Thursday, Conservative Leader Pierre Poilievre praised the speech but said Carney needs to follow it up with action.\n\n\"We have had enough words. Now, we need results,\" he said, calling on the government to \"unblock our resources,\" approve pipelines, strengthen the military and crack down on foreign interference. \n\n\"So far, Mr. Carney has been lucky that he’s been judged by his rhetoric and his stated intentions, by the number of his trips and meetings overseas,\" Poilievre said. \"Because nearly a year into his term, the rhetoric has changed, but reality has not. There is an illusion of purpose, but no results to back it up.\"\n\nCarney said in his speech Thursday that Canada can serve as a \"beacon\" to the rest of the world as authoritarianism spreads.\n\n\"In a time of rising populism and ethnic nationalism, Canada can show how diversity is a strength, not a weakness. In a time of democratic decline, we can show how rights can be protected and equal freedoms endure,\" Carney said.\n\nCanada-U.S. relations will continue to be a top priority for the government as the Canada-U.S.-Mexico Agreement on trade, or CUSMA, comes up for review this year.\n\nThe cabinet retreat is being held at The Citadelle of Quebec, a military base and the secondary official residence of the Governor General. The fortress was built in the 1800s by the British to protect the city from the threat of an American attack.\n\nCarney's speech drew heavily on Canada's history and its British, French and Indigenous roots.\n\nCarney and his cabinet will hear from experts in government, finance, community services, advanced technology and global affairs during the two-day cabinet retreat.\n\nSpeakers attending the retreat on Thursday included Mayor of Quebec City Bruno Marchand, Food Banks Canada CEO Kirstin Beardsley and Scotiabank's head of resilience economics Rebekah Young.\n\nMinisters will also hear from Royal Bank of Canada chief economist Frances Donald and head of BlackRock Investment Institute Jean Boivin.\n\n“What they should be focused on is what's the game plan for getting Canadians ready for what's going to be a very rough year, with the prospect of more tariffs, more pain and (trade) negotiations that are clearly going to be taking place under the barrel of a tariff gun,” said Fen Osler Hampson, an international affairs professor at Carleton University.\n\nJennifer Welsh, director of McGill University’s Max Bell School of Public Policy, said ministers will have to discuss how exactly they intend to diversify Canada’s trade relationships and build the economy.\n\n“So what should be the priorities and what do international partnerships mean? How are we going to actually pursue them and realize them?” she said.\n\nOsler Hampson said cabinet should also take time in Quebec to discuss making faster headway on major projects.\n\n“We're not going to be selling much to the world unless we build our infrastructure, build our ports, build our rail, build pipelines,” he said. \"That’s got to happen sooner rather than later if there are going to be jobs for those who are going to be thrown out of work.”\n\nCarney cited several of his government's priorities in his speech, such as boosting defence spending, developing an artificial intelligence strategy, advancing major projects and passing Criminal Code reforms.\n\nMany cabinet members dodged reporters' questions while walking into the meeting on Thursday afternoon.\n\nSpeaking to reporters, Finance Minister François-Philippe Champagne said the central theme of the cabinet retreat is affordability and it's been the Carney government's \"key objective and mission.\"\n\nChampagne said the group would also discuss the economy and creating jobs. He said the prime minister's recent trip abroad shows that Canada is the \"partner of choice\" because it is seen as stable and predictable.\n\nThe minister said the topic of \"resilience\" will also be on the agenda. While he said Canada \"will always be a partner with the United States,\" he noted that Carney has been working to forge new relationships and strategic partnerships around the world.\n\nParliament is set to return Monday. Carney's Liberal government is two seats shy of a majority, after two Conservatives crossed the floor in the fall and the departure of Toronto MP Chrystia Freeland earlier this month.\n\nThis report by The Canadian Press was first published Jan. 22, 2026.\n\n— With files from David Baxter, Kyle Duggan, Anja Karadeglija and Alessia Passafiume","summary":"Carney also rebuked Trump's remarks at the World Economic Forum. \"Canada and the United States have built a remarkable partnership in the economy, in security and in rich cultural exchange. But Canada doesn't live because of the United States,\" he said. \"Canada thrives because we are Canadian.\"","url":"https://www.nationalobserver.com/2026/01/22/news/carney-says-canadian-values-key-sovereignty-pushes-back-trumps-remarks","image":"https://www.nationalobserver.com/sites/default/files/img/2026/01/22/carneyinqc-012226-cpjacquesboissinot.jpg","video":null,"publish_date":"2026-01-23 00:41:29","author":"Catherine Morrison,The Canadian Press","authors":["Catherine Morrison","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.025},{"id":395174482,"title":"Kyrgyzstan reports cotton output for 2025","text":"News Terminal\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGreen Economy\n\n\n\n\n\n\n\n\n\n\nConstruction\n\n\n\n\n\n\n\n\n\n\n\n\nNuclear Program\n\n\n\n\n\n\n\n\nCentral Asia\n\n\n\n\n\n\n\n\nTurkmenistan\n\n\n\n\n\n\nThe Balkans\n\n\n\n\nThe Baltics\n\n\n\n\nSouth Caucasus\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAzernews.az\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKyrgyzstan reports cotton output for 2025\n\n\n23 January 2026 04:41 (UTC +04:00)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe data indicate that while cotton output declined markedly in 2025, improved yields helped maintain production efficiency, underscoring stable underlying productivity in the sector.\n\n\n\nAccess to paid information is limited\n\n\nIf You already have a account, please log in\n\n\n\n\n\n\n\nSubscription to paid content\n\nGain access to all that Trend has to offer, as well as to premium, licensed content via subscription or direct purchase through a credit card.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10 news item\n\n\n\n\n\nSubscribe to paid news for 3 months\n\n\n\nSee all packages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKyrgyzstan reports cotton output for 2025\n\n\n04:41 (UTC+04)\n\n\n\nPutin and US Envoy Steven Witkoff talks conclude\n\n\n04:30 (UTC+04)\n\n\n\nKazakhstan reports drop of crude oil/petroleum products exports to Singapore\n\n\n04:01 (UTC+04)\n\n\n\nKazakhstan reveals data on electricity production by biomass power plants in 2025\n\n\n03:43 (UTC+04)\n\n\n\nKazakhstan's exports of crude oil/petroleum products to South Korea decline\n\n\n03:01 (UTC+04)\n\n\n\nIran's imports flow from Turkmenistan drop in 9M2025\n\n\n02:25 (UTC+04)\n\n\n\nKazakhstan's exports of crude oil, petroleum products to U.S. drop\n\n\n02:02 (UTC+04)\n\n\n\nKazakhstan shares data on electricity production by small HPPs in 2025\n\n\n01:27 (UTC+04)\n\n\n\nTajikistan reveals share of foreign trade with SPECA member states\n\n\n00:47 (UTC+04)\n\n\n\nTajikistan and EIB discuss attracting investment into energy projects\n\n\n00:40 (UTC+04)\n\n\n\nDeath toll rises to 67 in Pakistan\n\n\n00:36 (UTC+04)\n\n\n\nIran's non-oil exports to Turkmenistan see notable rise in 9M2025\n\n\n00:29 (UTC+04)\n\n\n\nKyrgyzstan's melon and gourd output reaches new heights in 2025\n\n\n22 January 23:57 (UTC+04)\n\n\n\nPresident Ilham Aliyev makes post about meetings held within framework of World Economic Forum (PHOTO)\n\n\n22 January 23:16 (UTC+04)\n\n\n\nRecep Tayyip Erdoğan holds phone call with Masoud Pezeshkian\n\n\n22 January 23:03 (UTC+04)\n\n\n\nKazakhstan unveils electricity generation by solar power plants in 2025\n\n\n22 January 23:02 (UTC+04)\n\n\n\nIran’s non-oil trade with Uzbekistan hits high note in 9M2025\n\n\n22 January 22:56 (UTC+04)\n\n\n\nPresident of congress of deputies of Kingdom of Spain comes to Azerbaijan on visit (PHOTO)\n\n\n22 January 22:25 (UTC+04)\n\n\n\nKazakhstan discloses wind power plants generation figures for 2025\n\n\n22 January 22:04 (UTC+04)\n\n\n\nAzerbaijan steps up its electricity imports from Georgia\n\n\n22 January 21:54 (UTC+04)\n\n\n\nAzerbaijan-US trade turnover sees mixed results in 2025\n\n\n22 January 21:06 (UTC+04)\n\n\n\nFootage of President Ilham Aliyev's participation in signing ceremony of Board of Peace Charter and meeting with U.S. President posted on his social media accounts (VIDEO)\n\n\n22 January 21:03 (UTC+04)\n\n\n\nIran's non-oil export growth to Kazakhstan stalls in 9M2025\n\n\n22 January 20:55 (UTC+04)\n\n\n\nFootage of President Ilham Aliyev's participation in World Economic Forum in Davos posted on his social media accounts (VIDEO)\n\n\n22 January 20:12 (UTC+04)\n\n\n\nProduction from Iran's joint gas field with Qatar hits new milestone\n\n\n22 January 20:08 (UTC+04)\n\n\n\nAzerbaijan's SOCAR, Swiss SICPA SA ink services agreement\n\n\n22 January 19:55 (UTC+04)\n\n\n\nIran's imports of products from Kazakhstan hit rough patch in 9M2025\n\n\n22 January 19:53 (UTC+04)\n\n\n\nIran targets for significant fuel exports for upcoming fiscal year\n\n\n22 January 19:10 (UTC+04)\n\n\n\nAzerbaijan, EU chart path to development of economic relations\n\n\n22 January 19:08 (UTC+04)\n\n\n\nAzerbaijan increases oil and petroleum product supplies to Romania\n\n\n22 January 18:57 (UTC+04)\n\n\n\nSpeaker of Azerbaijani Parliament meets with NATO deputy SecGen\n\n\n22 January 18:55 (UTC+04)\n\n\n\nKyrgyzstan expands textile trade reach in Turkmenistan's exchange\n\n\n22 January 18:45 (UTC+04)\n\n\n\nTajikistan powers ahead with solar expansion in partnership with ACWA Power\n\n\n22 January 18:13 (UTC+04)\nGreen Economy\n\n\n\nAzerbaijan channels billions into industrial sector in 2025\n\n\n22 January 18:12 (UTC+04)\n\n\n\nUzbekistan’s bank deposits reach new high as of January 2026\n\n\n22 January 17:58 (UTC+04)\n\n\n\nAzerbaijan's Baku hosts NATO Mobile Training Team’s course\n\n\n22 January 17:53 (UTC+04)\n\n\n\nIran boosts electricity purchases from Azerbaijan in 11M2025\n\n\n22 January 17:52 (UTC+04)\n\n\n\nKazakhstan's exports of natural gas condensate increase\n\n\n22 January 17:50 (UTC+04)\n\n\n\nKazakhstan,Türkiye discuss prospects for strengthening co-op in oil/gas sector\n\n\n22 January 17:45 (UTC+04)\n\n\n\nUzbekistan sees growth in natural gas exports in 2025\n\n\n22 January 17:40 (UTC+04)\n\n\n\nMEDİA Agency sounds alarm over deepfake statements impersonating Azerbaijani president\n\n\n22 January 17:32 (UTC+04)\n\n\n\nPresident Ilham Aliyev’s remarks made in Davos in spotlight of global media outlets (PHOTO)\n\n\n22 January 17:22 (UTC+04)\n\n\n\nAzerbaijan set to perform first robotic kidney transplant in Caucasus region\n\n\n22 January 17:10 (UTC+04)\n\n\n\nUzbekistan maps out nation's budget priorities for 2026\n\n\n22 January 17:06 (UTC+04)\n\n\n\nAzerbaijan sheds light on oil exports to Spain through Dec. 2025\n\n\n22 January 16:59 (UTC+04)\n\n\n\nAZAL partners with Accelya to advance its NDC retail strategy\n\n\n22 January 16:58 (UTC+04)\n\n\n\nUzbekistan reports strong growth in trade with China in 2025\n\n\n22 January 16:58 (UTC+04)\n\n\n\nUzbekistan expands ATM and kiosk network by over 30% in 2025\n\n\n22 January 16:33 (UTC+04)\n\n\n\nKyrgyzstan approves new rules for budget lending\n\n\n22 January 16:06 (UTC+04)\n\n\n\nUzbekistan, Türkiye eye new mining investment opportunities\n\n\n22 January 15:52 (UTC+04)\n\n\n\nPresident Ilham Aliyev and President Donald Trump held meeting in Davos (PHOTO/VIDEO)\n\n\n22 January 15:38 (UTC+04)\n\n\n\nSincere dialogue between President Ilham Aliyev and President Donald Trump in Davos (VIDEO)\n\n\n22 January 15:30 (UTC+04)\n\n\n\nRafah crossing to open next week in both directions - Ali Shaath\n\n\n22 January 15:09 (UTC+04)\n\n\n\nTurkmenistan sees robust growth in trade with SPECA nations\n\n\n22 January 15:07 (UTC+04)\n\n\n\nThis is not just Board of Peace, this is Board of Action – Marco Rubio\n\n\n22 January 15:00 (UTC+04)\n\n\n\nSigning ceremony for Board of Peace charter held in Davos\n\n\n22 January 14:42 (UTC+04)\n\n\n\nIran set to make quantum leap with new computer rollout in 2026\n\n\n22 January 14:31 (UTC+04)\n\n\n\nIran wants to negotiate – U.S. President\n\n\n22 January 14:30 (UTC+04)\n\n\n\nLeaders of Azerbaijan and Armenia have become my friends - Trump\n\n\n22 January 14:26 (UTC+04)\n\n\n\nIran, Egypt highlight importance of maintaining regional peace and stability\n\n\n22 January 14:23 (UTC+04)\n\n\n\nU.S. Embassy congratulates Azerbaijan's Qarabağ FC on victory\n\n\n22 January 14:23 (UTC+04)\n\n\n\nTurkmenistan, Japan discuss economic cooperation plans for 2026\n\n\n22 January 14:21 (UTC+04)\n\n\n\nEverybody wants to be part of Board of Peace – Trump\n\n\n22 January 14:17 (UTC+04)\n\n\n\nPresident Ilham Aliyev attended signing ceremony of Board of Peace Charter in Davos (PHOTO/VIDEO)\n\n\n22 January 14:14 (UTC+04)\n\n\n\nAzerbaijan discusses mine action co-op avenues with NATO (PHOTO)\n\n\n22 January 14:07 (UTC+04)\n\n\n\nIran’s nuclear co-op with Russia at its highest level, VP says\n\n\n22 January 14:06 (UTC+04)\nNuclear Program\n\n\n\nUzbekistan’s gold exports reach $9.9 bln in 2025\n\n\n22 January 14:01 (UTC+04)\n\n\n\nIranian VP calls on IAEA to take stand on attacks against country's nuclear sites\n\n\n22 January 14:00 (UTC+04)\nNuclear Program\n\n\n\nChina’s gas demand and power use set to accelerate in 2026\n\n\n22 January 13:55 (UTC+04)\n\n\n\nUzbekistan sees impressive boost in electricity production in 2025\n\n\n22 January 13:41 (UTC+04)\n\n\n\nItaly scales up oil imports from Azerbaijan in 2025\n\n\n22 January 13:31 (UTC+04)\n\n\n\nUzbekistan sees modest growth in POS terminals in 2025\n\n\n22 January 13:30 (UTC+04)\n\n\n\nGECF LNG exports slightly down in December 2025 amid global growth\n\n\n22 January 13:21 (UTC+04)\n\n\n\nGeorgia set to roll out central procurement body in 2026\n\n\n22 January 13:20 (UTC+04)\n\n\n\nEuropean LNG imports surge in December 2025 amid pipeline shortfalls\n\n\n22 January 13:19 (UTC+04)\n\n\n\nEU pipeline gas imports fall in 2025 despite regional variations\n\n\n22 January 13:15 (UTC+04)\n\n\n\nEU gas consumption rises amid colder winter, gas-fired power surges – GECF\n\n\n22 January 13:12 (UTC+04)\n\n\n\nEIB commits €50Mi to first-ever Ukrainian infrastructure equity fund\n\n\n22 January 13:08 (UTC+04)\n\n\n\nYelo Bank’s advantageous gold loan campaign continues!\n\n\n22 January 13:05 (UTC+04)\n\n\n\nUzbekistan, Japan step up cooperation on solar, agri-processing in Syrdarya region\n\n\n22 January 12:52 (UTC+04)\n\n\n\nBulgaria signs agreement to take stake in Black Sea oil & gas exploration\n\n\n22 January 12:50 (UTC+04)\n\n\n\nTurkmenistan, India discuss economic and trade cooperation\n\n\n22 January 12:50 (UTC+04)\n\n\n\nAzerbaijan on brink of non-oil export milestone, CAERC official says\n\n\n22 January 12:30 (UTC+04)\n\n\n\nILO spotlights Azerbaijan's labor market shifts and digital transformation (Exclusive)\n\n\n22 January 12:24 (UTC+04)\n\n\n\nKazakhstan plans to build four new pharmaceutical plants\n\n\n22 January 12:21 (UTC+04)\n\n\n\nFitch affirms Kyrgyzstan’s long-term debt ratings at \"B\"\n\n\n22 January 12:03 (UTC+04)\n\n\n\nAzerbaijan processes thousands of export orders via “Azexport.az” portal\n\n\n22 January 11:36 (UTC+04)\n\n\n\nFAO aims to boost cooperation with Turkmenistan\n\n\n22 January 11:34 (UTC+04)\n\n\n\nCAERC monitors thousands of projects through new management module\n\n\n22 January 11:27 (UTC+04)\n\n\n\nAzerbaijan launches unified electronic portal for state program reporting\n\n\n22 January 11:25 (UTC+04)\n\n\n\nADB reviews results of cooperation with Uzbekistan in 2025 (Exclusive)\n\n\n22 January 10:52 (UTC+04)\n\n\n\nU.S. plans to organize first bilateral business mission in Azerbaijan\n\n\n22 January 10:40 (UTC+04)\n\n\n\nSOCAR acquires stake in one largest oil & gas fields in West Africa (PHOTO)\n\n\n22 January 10:34 (UTC+04)\n\n\n\nExpressbank has digitalized deposit placement with “SİMA İmza”\n\n\n22 January 10:18 (UTC+04)\n\n\n\nUzbekneftegaz, Air Products discuss next steps in strategic cooperation\n\n\n22 January 10:17 (UTC+04)\n\n\n\nPASHA Financial Holding launches as a unified powerhouse: new strategy and leadership for Bir ecosystem\n\n\n22 January 10:16 (UTC+04)\n\n\n\nBSEC-URTA, ESPORG discuss dev't of secure truck parking along Middle Corridor\n\n\n22 January 10:13 (UTC+04)\n\n\n\nAzerbaijani oil moves down in price\n\n\n22 January 09:50 (UTC+04)\n\n\n\nAzerbaijani currency to world currency rates for January 22\n\n\n22 January 09:31 (UTC+04)\n\n\n\nKazakhstan sets up special commission to probe incident at Tengiz oil field\n\n\n22 January 09:02 (UTC+04)\n\n\n\nCEOs of Georgian companies Orbi Group and Block Group attended a Christmas Party at the White House\n\n\n22 January 09:00 (UTC+04)\n\n\n\nAgricultural sector of Kyrgyzstan - production, diversification, and food security risks\n\n\n22 January 09:00 (UTC+04)\n\n\n\nUzbekistan's Navoi Mining reveals strategic plans for 2026 (Exclusive)\n\n\n22 January 08:12 (UTC+04)\n\n\n\nKazakhstan's Turkestan region to set up hybrid mini power plant (Exclusive)\n\n\n22 January 08:02 (UTC+04)\n\n\n\nIran sees decline in product imports from Georgia in 9M2025\n\n\n22 January 07:50 (UTC+04)\n\n\n\nKazTransOil reports drop in oil transshipment at Aktau port in Kazakhstan\n\n\n22 January 07:17 (UTC+04)\n\n\n\nKyrgyzstan reveals sugar beet harvest figures in 2025\n\n\n22 January 07:08 (UTC+04)\n\n\n\nTajikistan’s fiscal deficit remains stable, IMF says\n\n\n22 January 06:19 (UTC+04)\n\n\n\nKyrgyzstan unveils latest potato harvest results for 2025\n\n\n22 January 06:09 (UTC+04)\n\n\n\nTurkmengas announces tender for procurement of equipment and materials\n\n\n22 January 05:53 (UTC+04)\n\n\n\nU.S. leads foreign money transfers to Georgia in December 2025\n\n\n22 January 05:12 (UTC+04)\n\n\n\nKyrgyzstan records increase in vegetable production in 2025\n\n\n22 January 05:01 (UTC+04)\n\n\n\nUAE seals urea, flour, textile deals with local businesses at Turkmen exchange\n\n\n22 January 04:04 (UTC+04)\n\n\n\nRice production in Kyrgyzstan hits new heights in 2025\n\n\n22 January 03:11 (UTC+04)\n\n\n\nIran lists industrial and manufacturing enterprises eligible for working capital support\n\n\n22 January 02:13 (UTC+04)\n\n\n\nKyrgyzstan rolls out latest tobacco production figures for 2025\n\n\n22 January 01:57 (UTC+04)\n\n\n\nTurkmennebit announces tender for industrial and drilling equipment\n\n\n22 January 01:12 (UTC+04)\n\n\n\nPresident Ilham Aliyev meets with Chief Executive Officer of Vitol in Davos (PHOTO/VIDEO)\n\n\n22 January 01:06 (UTC+04)\n\n\n\nPresident Ilham Aliyev shares post on victory of Qarabağ football club (PHOTO)\n\n\n22 January 00:59 (UTC+04)\n\n\n\nIran’s crude oil production and demand forecasts remain stable in 2026, IEA says\n\n\n22 January 00:48 (UTC+04)\n\n\n\nQarabağ's player named man of match against Eintracht Frankfurt\n\n\n22 January 00:36 (UTC+04)\n\n\n\nMoody’s shares projections for Azerbaijan’s real GDP growth in 2026\n\n\n22 January 00:08 (UTC+04)\n\n\n\nMoody’s notes Middle Corridor’s growing role in Eurasian trade\n\n\n22 January 00:05 (UTC+04)\n\n\n\nIran's crude oil production set for major boost\n\n\n22 January 00:02 (UTC+04)\n\n\n\nKyrgyzstan records impressive growth in corn output for 2025\n\n\n21 January 23:57 (UTC+04)\n\n\n\nQarabağ defeats Eintracht Frankfurt\n\n\n21 January 23:49 (UTC+04)\n\n\n\nAzerbaijan sheds light on income from electricity exports in 2025\n\n\n21 January 23:08 (UTC+04)\n\n\n\nIEA: Iran’s crude oil supply remains stable amid sanctions and political tensions\n\n\n21 January 22:39 (UTC+04)\n\n\n\nPresident Ilham Aliyev meets with European Commissioner for Enlargement Marta Kos in Davos (PHOTO/VIDEO)\n\n\n21 January 22:26 (UTC+04)\n\n\n\nPresident Ilham Aliyev participates in panel session as part of World Economic Forum (PHOTO/VIDEO)\n\n\n21 January 22:20 (UTC+04)\n\n\n\nAzerbaijan breaks down its oil export performance in 2025\n\n\n21 January 22:07 (UTC+04)\n\n\n\nIran’s imports from Azerbaijan see sharp decline in 9M2025\n\n\n21 January 21:36 (UTC+04)\n\n\n\nbp starts subsea intervention campaign in Caspian\n\n\n21 January 21:14 (UTC+04)\n\n\n\nKyrgyzstan announces latest legume production figures for 2025\n\n\n21 January 21:06 (UTC+04)\n\n\n\nAzerbaijan, U.S. hold second meeting on strategic partnership charter\n\n\n21 January 20:53 (UTC+04)\n\n\n\nAzerbaijan discloses international rail freight traffic figures for 2025\n\n\n21 January 20:49 (UTC+04)\n\n\n\nIMF notes Turkmenistan's fiscal reform and inflation management progress (Exclusive)\n\n\n21 January 20:26 (UTC+04)\n\n\n\nAzerbaijan's foreign trade turnover gains foothold in 2025\n\n\n21 January 20:07 (UTC+04)\n\n\n\nAzerbaijan’s petroleum coke, bitumen exports drive revenue growth in 2025\n\n\n21 January 19:52 (UTC+04)\n\n\n\nUzbekistan’s overseas travel hits new heights in 2025\n\n\n21 January 19:27 (UTC+04)\n\n\n\nArmenian PM links drop in diesel prices to improved ties with Azerbaijan\n\n\n21 January 19:18 (UTC+04)\n\n\n\nKyrgyzstan pulls back curtain on latest barley harvest data\n\n\n21 January 19:11 (UTC+04)\n\n\n\nArmenia, Azerbaijan plan to connect energy systems under peace initiative – Pashinyan\n\n\n21 January 19:09 (UTC+04)\n\n\n\nIran sees surge in stock exchange sales in 9M2025\n\n\n21 January 18:56 (UTC+04)\n\n\n\nU.S. radically cuts ballooning trade deficit through tariffs – Trump\n\n\n21 January 18:45 (UTC+04)\n\n\n\nAzerbaijan’s int'l maritime freight volume drops in 2025\n\n\n21 January 18:35 (UTC+04)\n\n\n\nU.S. economy set to grow at twice the rate projected by IMF last April – Trump\n\n\n21 January 18:30 (UTC+04)\n\n\n\nAzerbaijan turns S. Caucasus into renewables hub — ‘win-win’ partnership for investors\n\n\n21 January 18:16 (UTC+04)\nGreen Economy\n\n\n\nU.S. secured commitments for record-breaking $18 trillion - Trump\n\n\n21 January 18:16 (UTC+04)\n\n\n\nUzbekistan records 7.7% GDP growth in 2025\n\n\n21 January 18:13 (UTC+04)\n\n\n\nIranian president identifies systemic neglect of vulnerable as primary root of unrest\n\n\n21 January 18:09 (UTC+04)\n\n\n\nAzerbaijan's revenues from natural gas export hike in 2025\n\n\n21 January 18:07 (UTC+04)\n\n\n\nTajikistan to receive ADB support for floating solar development\n\n\n21 January 18:05 (UTC+04)\nGreen Economy\n\n\n\nU.S. supports world of nuclear energy, says Trump\n\n\n21 January 18:01 (UTC+04)\n\n\n\nUzbekistan’s oil production hits new low in 2025\n\n\n21 January 17:46 (UTC+04)\n\n\n\nUzbekistan expands mining capacity with new Navoi project\n\n\n21 January 17:36 (UTC+04)\n\n\n\nAzerbaijan and Israel discuss economic cooperation prospects\n\n\n21 January 17:33 (UTC+04)\n\n\n\nAzerbaijan's SOCAR achieves major fuel efficiency milestone in carbamide output\n\n\n21 January 17:28 (UTC+04)\n\n\n\nUzbekistan sees steady surge in bank card circulation\n\n\n21 January 17:23 (UTC+04)\n\n\n\nIran’s trade with EAEU gains momentum in 8M2025, deputy minister says\n\n\n21 January 17:09 (UTC+04)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerms of use\n\n\n\n\nNews terminal\n\n\n\n\n\n\n\n\n\n© 2026 Trend News Agency\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForgot password?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPassword reset","summary":"The data indicate that while cotton output declined markedly in 2025, improved yields helped maintain production efficiency, underscoring stable underlying productivity in the sector.","url":"https://www.trend.az/business/4144728.html","image":"https://www.trend.az/media/2024/12/19/trend_cotton_main.png","video":null,"publish_date":"2026-01-23 00:41:00","author":null,"language":"en","source_country":"az","sentiment":-0.067},{"id":395157540,"title":"\"Go F**k Yourself!\": Brawl Nearly Breaks Out During Jack Smith's Hearing","text":"Former Special Counsel Jack Smith's congressional testimony on Thursday took an unexpected turn when a brawl nearly erupted. The showdown featured former Metropolitan Police Officer Michael Fanone and conservative activist Ivan Raiklin.\n\nThe confrontation happened during a break in Smith's appearance before the House Judiciary Committee. Video captured Fanone and Raiklin squaring off as former Capitol Police officers scrambled to pull Fanone back. \n\n Ranklin shouted to Fanone.\n\nFormer Capitol Police Officer Harry Dunn, who was also at the Capitol that day, jumped in to separate the two men while uniformed officers formed a barrier between them. Fanone, pointing directly at Raiklin, unleashed a barrage of accusations.\n\n Fanone shouted.\n\n🚨 JUST IN: CHAOS erupts during Jack Smith's hearing as former J6 Capitol Police officer Michael Fanone goes off on Ivan Ranklin and an altercation breaks out\nThings are getting TENSE. Fanone ended up leaving.\n\"This guy has threatened my family!\" pic.twitter.com/igXBWz64sW\n— Eric Daugherty (@EricLDaugh) January 22, 2026\n\nThere was nearly a physical altercation during a break in the House Judiciary Committee’s Jack Smith hearing pic.twitter.com/LMhcxEQDdJ\n— Nolan D. McCaskill (@NolanDMcCaskill) January 22, 2026\n\nThe chaos prompted additional U.S. Capitol Police to flood the hearing room to restore order, with several officers speaking directly to Raiklin. Shortly after the altercation, Raiklin exited the room, though it’s not clear from reports whether he was kicked out or left on his own accord.\n\nRaiklin later posted a video to X and floated the idea of suing Fanone for defamation because of his accusations, which have gone viral on social media:\n\nWho thinks I should sue Mr. Fanone for defamation? pic.twitter.com/ZyoctE0fR1\n— Ivan Raiklin (@IvanRaiklin) January 22, 2026\n\nBut the fireworks didn't end there. \n\nLater during the hearing, Fanone interrupted Texas Republican Rep. Troy Nehls as he spoke. Nehls had been arguing that Capitol Police leadership, not President Trump, deserved the blame for what unfolded on January 6.\n\n“I would like to quickly address the police officers of January 6th. Mr. Don, Mr. Fanone, Mr. Gonell, Mr. Hodges. I'm a member of the new select committee to actually examine, actually examine what happened that day,” Rep. Nehls began. “ And I can tell you, gentlemen, that the fault does not lie with Donald Trump. It lies with Yogananda Pittman and the US Capitol leadership team.”\n\nAs Nehls continued to speak, Fanone fake-coughed into his hands and shouted,\n\nJ6 disgrace Michael Fanone caughs and yells, “Go f*** yourself!” at Rep. Troy Nehls (R-TX) during the J6 committee hearing.\nThis is really who Democrats call their hero of J6? Someone who can’t even behave like an adult at a congressional hearing.\nSad!pic.twitter.com/PZVv4RL3FH\n— Paul A. Szypula 🇺🇸 (@Bubblebathgirl) January 22, 2026\n\nSmith testified before the committee to discuss his now-defunct investigations into Trump’s questioning of the results of the 2020 election and his handling of classified documents. \n\nSmith used his testimony to claim his investigation wasn’t biased, insisting that Trump “willfully broke the law — the very laws he took an oath to uphold.” He claimed his investigation adhered to Justice Department policy and denied any partisan motive, asserting he would have made the same decision no matter the defendant’s party. Republicans on the committee were unconvinced and challenged that claim head-on, arguing that Smith’s words and actions told a very different story.","url":"https://www.zerohedge.com/political/go-fk-yourself-brawl-nearly-breaks-out-during-jack-smiths-hearing","image":"/s3/files/styles/16_9_max_700/public/2026-01/2026-01-22_19-14-38.jpg?itok=_U-hMxbE","video":null,"publish_date":"2026-01-23 00:40:00","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","source_country":"us","sentiment":-0.638},{"id":395157280,"title":"THE ECONOMIST: Netflix sweetens offer to fend of Paramount as battle for Warner Bros only gets fiercer","text":"Since October last year, Netflix and Paramount have been chasing Warner Bros Discovery like a pair of Wile E. Coyotes in pursuit of a Road Runner. Paramount, recently acquired by the Ellison family, was initially the favourite to capture the prize. But last month Netflix dropped a giant cartoon anvil on the Ellisons when it announced that it had signed a deal with Warner’s management to acquire most of the company.\n\nThe chase is not over. Paramount is loudly trying to persuade Warner shareholders to defy management and accept its bid, which it argues is “superior to Netflix’s in every dimension”.\n\nOn January 20, Netflix responded by improving its own offer, which values Warner at $US83 billion ($121b), from a mixture of cash and stock to one that is purely cash. It hopes this will speed up Warner’s approval process; a shareholder vote is expected by April.\n\nThings could change before then. In the past week both bidders have been on lobbying trips to Europe to try to persuade regulators that they would make the better suitor.\n\nAs the smaller of the two firms, Paramount seems to have an easier case in terms of antitrust. Netflix’s full-year results this week served as a reminder of its might: 325 million global subscribers, revenue growing at 16 per cent a year and an operating margin of nearly 30 per cent. Combined with Warner, it would tower over its Hollywood rivals.\n\nYet Netflix pointedly noted in its letter to shareholders this week that competition in video now extends far beyond Hollywood. Including YouTube and the like, Netflix accounts for less than 10 per cent of TV viewing in most of its big markets. It also argues that its deal would be better for American jobs than that of Paramount, which is planning a $US6 billion “cost-synergy opportunity” if it gets the chance to merge its studio with Warner’s.\n\nAnd although the Ellisons’ friendliness with Donald Trump may give them an edge in America, this may not help their case in Europe, which the president has antagonised with his efforts to nab Greenland.\n\nRather than rely on regulators to give Netflix a red light, Paramount looks likely to improve its own bid. It is currently offering $US30 per share for all of Warner, whereas Netflix is offering $US27.75 for just its streaming platform and studios, allowing Warner shareholders to hang on to the firm’s TV and cable networks.\n\nWhose deal is better depends on how those declining TV networks are valued. Paramount insists that its offer adds up to more. But to persuade Warner shareholders to defy advice from their management, it will probably need to raise its price.\n\nNetflix will then face a dilemma. Its all-cash switch this week shows its seriousness about acquiring Warner. But unlike Paramount, which can draw on the Ellisons’ family fortune in Oracle tech stocks, Netflix has its own shareholders to worry about.\n\nMany of them are not convinced by the Warner project: Netflix’s market value has fallen by nearly a third since it began circling the company in October (see chart). Shelling out even more could test their patience.\n\nNetflix may raise its bid by another dollar or two per share, suspects Robert Fishman of MoffettNathanson, a firm of analysts. But whereas Paramount needs Warner’s scale to remain competitive in streaming, for Netflix the Warner transaction is mostly a giant content deal.\n\nNetflix has a history of being prepared to walk away when content prices get too high: last year it allowed the Ellisons to outbid it with a Looney Tunes offer of $US7.7b for seven years of Ultimate Fighting Championship rights.\n\nExpect more twists and turns in the race towards the shareholder vote in April. For now, writes Mr Fishman, “The most likely next step … is more bids to come.” Anxious times for Netflix and Paramount, but good news for the Road Runner.","summary":"THE ECONOMIST: Netflix tells shareholders that competition in video now extends far beyond Hollywood, switching its offer to all cash.","url":"https://thewest.com.au/business/the-economist/the-economist-netflix-sweetens-offer-to-fend-of-paramount-as-battle-for-warner-bros-only-gets-fiercer-c-21395932","image":"https://images.thewest.com.au/publication/C-21395932/7e4956378fee19904b707eafdbb8f5a5bb376f6a-16x9-x0y75w800h450.jpg?imwidth=1200","video":null,"publish_date":"2026-01-23 00:39:14","author":"Lseg Workspace","authors":["Lseg Workspace"],"language":"en","source_country":"au","sentiment":-0.022},{"id":395161578,"title":"Poilievre on Carney’s Davos speech: Canada needs ‘to do things, not just say them’","text":"U.S. Commerce Secretary Howard Lutnick accused Prime Minister Mark Carney of making “political noise” at the World Economic Forum, while Conservative Party Leader Pierre Poilievre says Canada needs “to do things, not just say them.” \n\nMeanwhile, Greenland’s prime minister says he still doesn’t know what’s “concrete” in U.S. President Donald Trump’s plan for the island, and Carney gave another speech on Canadian “values” in Quebec City.\n\nHere’s a look at what happened on Thursday, Jan. 22:\n\nCanada needs ‘to do things, not just say them’: Poilievre\n\nPierre Poilievre released a statement Thursday afternoon, offering the prime minister faint praise for his “well-crafted and eloquently delivered speech” delivered Tuesday in Davos. \n\n“So far, Mr. Carney has been lucky that he’s been judged by his rhetoric and his stated intentions, by the number of his trips and meetings overseas,” the Conservative Party leader said. “Because nearly a year into his term, the rhetoric has changed, but reality has not. There is an illusion of purpose, but no results to back it up.\n\n“We need to do things, not just say them,” he added. \n\nPoilievre also announced that the Conservatives would introduce a motion to pass the Canadian Sovereignty Act when Parliament returns next week. \n\nHunter Crowther, CTVNews.ca national digital producer\n\nCarney’s Davos speech was ‘political noise’\n\nU.S. Commerce Secretary Howard Lutnick called Prime Minister Mark Carney’s Wednesday speech at the World Economic Forum “political noise” and criticized Canada’s recent deal with China.\n\nSpeaking on Bloomberg TV, Lutnick said Canada has “the second-best deal in the world” and accused Carney of complaining.\n\nLutnick also cautioned that Ottawa’s recent deal with China could upend negotiations on the Canada-U.S.-Mexico Agreement on trade, which is up for review this year.\n\nIn his speech at the WEF summit in Davos, Switzerland -- which was applauded internationally -- Carney warned that the old world order is dead and urged middle powers to band together as larger ones try to pressure them through economic coercion.\n\nEuropean leaders have continued to cite the speech throughout the Davos forum and have repeated Carney’s warning about a fundamental rupture in long-standing trade and defence relationships.\n\nUnited States Trade Representative Jamieson Greer told Fox News there is a “new world order” and European officials are starting to acknowledge it.\n\nThe Canadian Press\n\nTrump says Greenland ‘structure’ in progress\n\nAs he returned to the U.S. from Davos, Switzerland, Trump said the “Greenland structure is being worked on,” without providing additional details.\n\nHe made the remark on Truth Social. The framework of the deal, as he had described it yesterday, would be “amazing” for the United States, he added.\n\nEarlier today, Greenland’s Prime Minister Jens-Frederik Nielson said his foreign affairs officials were in communication with their American counterparts. Though he was not familiar with the “concrete” elements of Trump’s plan.\n\nLuca Caruso-Moro, CTVNews.ca journalist\n\nCarney: Canada can be a ‘beacon’\n\nCarney, in a separate speech on Thursday, says while Canada can’t solve all the world’s problems, the country can be “a beacon, an example to a world that’s at sea.”\n\n“We can show that another way is possible. That the arc of history isn’t destined to be warped towards authoritarianism and exclusion, it can still bend towards progress and justice,” Carney said in his first domestic remarks since his widely lauded speech at the World Economic Forum.\n\n“In a time of rising populism and ethnic nationalism, Canada can show how diversity is a strength, not a weakness. In a time of democratic decline, we can show how rights can be protected and equal freedoms endure,” he said. \n\nThe speech kicked off a two-day “cabinet planning forum” in Quebec City, ahead of Parliament’s return on Monday.\n\nStill receiving global attention over his delivery in Davos, Carney’s Thursday address – also written in large part by the prime minister – echoed similar sentiments, but tailored towards a Canadian audience.\n\nRachel Aiello, CTV National News correspondent. Read the full story here. \n\n‘Canada does not live because of the U.S.’: Carney\n\nIn a speech in Quebec City Thursday, Carney touched on the relationship between Canada and the U.S. and also responded to U.S. President Donald Trump’s jab at Carney in Davos. \n\nAt the World Economic Forum on Wednesday, Trump said in his speech that Canada “should be grateful,” and “Canada lives because of the United States.”\n\n“Remember that, Mark,” Trump said.\n\nCarney responded on Thursday, speaking on Canada’s deep partnership with the U.S. in security, culture and economy, but added that “Canada doesn’t live because of the United States – Canada thrives because we’re Canadian.”\n\nCarney also spoke of the new international partnerships his administration made in addition to domestic economic securities.\n\n“We’ve made great progress over the past year, now we have to redouble our efforts with the provinces and territories.”\n\nLynn Chaya, CTVNews.ca journalist\n\nTrump ‘a little bit ahead of himself’: retired major general\n\nCTV News military analyst David Fraser, a retired major general for the Canadian Armed Forces, called it “a little bit strange” that Trump was dealing with NATO Secretary-General Mark Rutte instead of political leaders from Denmark or Greenland.\n\nFraser, who previously commanded NATO forces in southern Afghanistan, said in an interview with CTV News Channel that “this is about territorial integrity and sovereignty, and Denmark has been very clear, that’s a red line.”\n\nFraser emphasized that Greenland’s sovereignty is not for NATO to negotiate, it’s a matter for the Greenlander and Danish governments.\n\n“I think Trump is getting a little bit ahead of himself,” Fraser said. He added when it comes to the Greenland negotiations, it feels like they’re not involved in the conversation.\n\n“Again, it’s just what Donald Trump wants.”\n\nJoe Van Wonderen, CTVNewsToronto.ca journalist\n\nGreenland PM doesn’t know what’s ‘concrete’ in deal\n\nGreenland’s Prime Minister Jens-Frederik Nielsen says he is still unaware of “what is concrete in that deal” heralded by Trump following the U.S. president’s meeting with NATO Secretary-General Mark Rutte.\n\nSpeaking to reporters in Greenland’s capital Nuuk, Nielsen said Greenlandic foreign ministers have met with U.S. counterparts and agreed to form a “high-level” working group.\n\n“We cannot cross the red lines,” he added, referring to respect for territorial integrity, international law, and Greenland’s sovereignty.\n\nHow Greenland is treated will have ramifications on the “world order,” he added. “That’s nothing to gamble on.”\n\n“I want a respectful and good dialogue,” Greenland’s Prime Minister said, adding that there is already a defence agreement with the U.S. through Denmark. Greenland is a semiautonomous territory of Denmark, and Neilson said that Greenland is already a part of NATO’s framework.\n\nLuca Caruso-Moro, CTVNews.ca journalist and Joe Van Wonderen, CTVNewsToronto.ca journalist\n\n‘We want to be Greenlandic’\n\nJuno Berthelsen, a member of Greenland’s parliament, says he has not yet seen details of Trump’s framework for a future deal regarding his country.\n\nHe welcomed the development insofar as it represents a retreat from Trump’s “rhetoric about use of force and invasion,” but reiterated Greenlanders need to be consulted on any eventual agreement.\n\nIs Trump’s framework a ‘next best solution’?\n\n“We don’t want to be Americans, we don’t want to be Danish. We want to be Greenlandic, or Kalaallit Inuit as we’re called in our own language,” he told CTV News Channel. “Nothing about us, without us.”\n\nLuca Caruso-Moro, CTVNews.ca journalist\n\nGreenlanders may accept U.S. security\n\nOne Greenlander living in Iqaluit told CTV News Channel on Thursday that Greenlanders were opposed to U.S. annexation but might welcome American security efforts.\n\n“If (Greenland’s government) hasn’t been involved, and decisions are being made over their heads,” Aaju Peter said, adding Greenlanders will feel that they are not being included.\n\nPeter said that it was up to Greenland and Denmark to determine the island’s future, rather than NATO.\n\n“The Greenlanders are willing to talk about security in the Arctic and they’re open to a future dialogue with high-level officials who will work together with Greenland and Denmark. and if the U.S. wanted to be part of it, then they’re welcome to be part of that,” Peter said, adding that it had to be done “respectfully.”\n\nJoe Van Wonderen, CTVNewsToronto.ca journalist\n\nInuit stand together: Lampe\n\nThe Inuit government in northern Labrador is standing in solidarity with Greenland as U.S. President Donald Trump threatens to take control of the Danish territory.\n\nNunatsiavut President Johannes Lampe says the people of Greenland, the majority of whom are Inuit, have a right to determine their own future.\n\nIn a news release, Lampe says any attempt to impose outside control over Greenland is an attack on Inuit freedom and self-determination.\n\nHe says Inuit in Nunatsiavut and Greenland are linked by strong bonds rooted in culture and history.\n\nThe Canadian Press. Read the full story here.\n\nZelenskyy announces trilateral meetings between U.S., Ukraine and Russia\n\nZelenskyy has announced two days of trilateral meetings between the U.S., Ukraine and Russia in the Emirates starting Friday.\n\nThe trilateral meetings will follow the American negotiating team’s visit to Moscow the day before.\n\n“Russians have to be ready for compromises because, you know, everybody has to be ready, not only Ukraine,” Zelenskyy said, “and this is important for us.”\n\nBoard of Peace logo focuses on Americas\n\nTrump initially billed his Board of Peace focused on Gaza. Then he said it could play alongside the UN as a global broker. \n\nBut the logo featured at the Davos event depicts North America and only parts of South America.\n\nThe White House and State Department in Trump’s second presidency also been highly focused on the Western Hemisphere, complete with Trump dubbing his approach the “Donroe Doctrine” as a play on the Monroe Doctrine established under the fifth U.S. president.\n\nZelenskyy criticizes Europe\n\nUkrainian President Volodymyr Zelenksyy just wrapped his speech on the main stage at Davos. The speech focused heavily on his country’s ongoing war with Russia and his talks with Trump. He criticized European leaders, some of whom he said are strong only in words, not in action. He did not name names.\n\n“You can’t build the new world order out of words,” said the Ukrainian president, later adding a united Europe is “truly invincible.”\n\nHe repeated previous sentiments that Europe must defend Ukraine against Russian aggression today, because “tomorrow, you may need to defend your way of life.”\n\nLuca Caruso-Moro, CTVNews.ca journalist\n\nTrump-Zelenskyy meeting ends after about an hour\n\nA meeting between President Volodymyr Zelenskyy and President Donald Trump has ended, Ukrainian presidential spokesman Serhii Nykyforov said.\n\nThe meeting between the two leaders at Davos lasted about an hour.\n\n“They had a brief one-on-one conversation at the end,” Nykyforov added.\n\nZelenskyy’s media adviser Dmytro Lytvyn said: “We didn’t count how long the meeting lasted, but it was good.”\n\nThe two leaders stayed off camera, and there was no photo op nor questions taken. \n\nTrump and Zelenskyy in Davos together\n\nThe Ukrainian president passed reporters on his way into a meeting with Trump at the World Economic Forum.\n\nTrump said earlier today that ending the Russia-Ukraine war remains a priority.\n\n“We’re working to end the horrible killing in Ukraine,” Trump said at the launch of his Board of Peace.\n\nU.S. representatives will meet with Russian President Vladimir Putin later Thursday, Trump said after the event.\n\nZelenskyy arrives for Davos talks\n\nUkrainian President Volodymyr has arrived at the Congress Center ahead of his panel discussion.\n\nHe walked past the media without answering questions.\n\nPutin meets with Palestinian President Abbas in Moscow\n\nRussian President Vladimir Putin on Thursday hosted Palestinian President Mahmoud Abbas in Moscow for talks.\n\nThe Russian leader noted that “back in 1988, the Soviet Union recognized the Palestinian state, and we maintain the same position today.”\n\n“Our approach to the issues of Palestine and the Middle East settlement is principled, not opportunistic. We believe that only forming and proper functioning of the Palestinian state can lead to a final settlement of the Middle East conflict,” Putin said.\n\nPutin said the two will discuss the situation in Gaza and “on the Israeli-Palestinian track,” including Trump’s Board of Peace.\n\nMoscow is considering an invitation to join, according to Putin, who has proposed sending $1 billion to the board from Russian assets frozen in the U.S.\n\n“First and foremost in order to support the Palestinian people, allocate these funds for rebuilding Gaza, generally on solving problems of Palestine,” Putin told Abbas. \n\n“I think it is quite possible,” Putin added. “We have discussed such options before with the representatives of the U.S. administration, and today a meeting and a conversation on this topic is planned in Moscow.”\n\nPutin is due to meet Thursday with Steve Witkoff and Jared Kushner.\n\nChina refutes Trump wind power claim\n\nChina on Thursday refuted Trump’s claim that it doesn’t use wind power turbines at home while dominating the international market for them.\n\nTrump blasted wind energy in a speech Wednesday in Davos, saying “stupid people” were buying windmills from China, which doesn’t use them at home.\n\nForeign Ministry spokesperson Guo Jiakun said China had 600 million kilowatts of wind power capacity as of the end of November, adding that Chinese exports of wind and solar power equipment had helped other countries reduce their carbon emissions.\n\n“China’s efforts in addressing climate change and promoting the development and application of global renewable energy are evident to all,” he said in Beijing.\n\nIsrael does not immediately comment on Rafah crossing\n\nIsrael’s Prime Minister Benjamin Netanyahu’s office and the Israeli military did not have immediate comment on the possible opening of the Rafah crossing.\n\nKushner, Trump tout Gaza development potential\n\nJared Kushner, Trump’s son-in-law who has been involved in Middle East negotiations, gave a slide deck presentation at the Board of Peace launch that included real estate development plans by zones.\n\n“We do not have a plan B,” Kushner said, adding that people in Middle East build cities in two or three years.\n\nTrump, during his closing remarks, noted his own experiences in real estate. \n\nHe described Gaza as “this beautiful piece of property” and suggested his push for peace between Israel and Hamas “all began with the location.”\n\nRafah border crossing to open next week\n\nAli Shaath, head of new technocratic government in Gaza, announced the Rafah border crossing will open in both directions next week. \n\nIsrael said in early December it would open the crossing between Gaza and Egypt, but has yet to do so.\n\nShaath spoke by video message to leaders at the forum.\n\nMarco Rubio praises board, emphasizes Gaza mission\n\nThe U.S. secretary of state praised the Board of Peace as “a group of leaders that is about action” and credited Trump for bringing it together.\n\n“He’s not limited by some of the things that have happened in the past, and he’s willing to talk to or engage with anyone in the interest of peace,” Rubio said.\n\nRubio stressed the body’s job “first and foremost” is “making sure that this peace deal in Gaza becomes enduring.” \n\nThen, Rubio said, it can look elsewhere.\n\nWith details of the board’s operations still unclear, Rubio described it is a work in progress.\n\n“Many others who are going to join, you know, others either are not in town today or they have to go through some procedure internally in their own countries, in their own country, because of constitutional limitations, but others will join,” Rubio said.\n\nBoard of Peace takes shape with few details about mandate, membership\n\nTrump inaugurated his newly created Board of Peace with a handful of founding members but offered few details about its mandate and how the panel will work or might pursue efforts to end global conflicts.\n\nTrump hailed the board as “something very, very unique for the world.”\n\nSpeaking at a ceremony to sign the board’s charter, Trump said it could work with the United Nations to resolve wars not only in the Middle East, where the Israel-Hamas war in Gaza was the genesis of the concept. \n\nBut he did not provide specifics about how the board would cooperate with the UN.\n\nA number of countries, many of them close U.S. allies, have expressed concerns Trump might want the board to supplant or rival the UN and have either refused to sign on or remained noncommittal.\n\nTrump and others signing Board of Peace documents\n\nThe U.S. president concluded his remarks and he and leaders from Board of Peace nations are signing documents.\n\nThe White House billed the ceremony as a sort of charter launch, but no charter draft has been publicly released. Nor is a complete membership list clear yet.\n\nSome invitees are still considering whether to join.\n\nTrump affirms global ambition for his Board of Peace\n\nTrump reaffirmed the Board of Peace will start with a focus on Gaza but then look globally.\n\n“I think we can spread out to other things as as we succeed with Gaza, we’re going to be very successful in Gaza,” he said, adding, “We can do numerous other things. Once this board is completely formed, we can do pretty much whatever we want to do.\n\n“He promised again to work “in conjunction with the United Nations,” though he still criticized the UN for not doing enough historically.\n\n“I think the combination of the Board of Peace with the kind of people we have here, coupled with the United Nations, can be something very, very unique for the world,” Trump said.\n\nTrump suggests Middle East problems can end easily\n\nThe U.S. president says the Israel-Hamas war in Gaza “is really coming to an end” and Hezbollah’s presence in Lebanon amounts to “remnants.”\n\nOn Gaza, Trump said, “They’re down to little fires. We can put them out very easily.”\n\nTrump acknowledged Hezbollah remains in Lebanon, but he downplayed the group’s strength.\n\n“These are remnants. I call them remnants,” Trump said.\n\nTrump mentions UN as a partner\n\nIn his opening remarks praising the launch of his Board of Peace, Trump made a point to mention the United Nations.\n\nHe said “many nations” have been part of establishing the body.\n\nThen he added, “We’ll work with many others, including the United Nations.”\n\nTrump has been highly critical of the UN and withdrawn the U.S. from multiple international organizations, and he has expressed ambitions recently that the new international board can replicate if not compete with the as an international broker.\n\nTrump has arrived for Board of Peace launch\n\nThe U.S. president will pitch his new international body with heads of government and top diplomats from multiple continents.\n\nSecretary of State Marco Rubio and U.S. envoy Steve Witkoff also are with Trump.\n\nThe board initially was billed as part of the peace process for Israel and Gaza but Trump has since expanded his ambitions for the group, saying it can play a role mediating other international conflicts.\n\nMerz supports talks between Denmark, Greenland and U.S.\n\nChancellor Friedrich Merz of Germany, one of the European countries that had faced Trump’s threat of tariffs over Greenland, said he supports talks between Denmark, Greenland and the U.S. but reaffirmed the Danish kingdom’s sovereignty.\n\n“It is good news that we are making steps into that right direction,” Merz said at Davos. “I welcome President Trump’s remarks from last night — this is the right way to go.”\n\nRubio, Witkoff, Kushner lead Board of Peace’ U.S. delegation with Trump\n\nTrump’s core foreign policy advisers are expected to join him at the “Board of Peace” event, with Trump’s son-in-law Jared Kushner in the room alongside Secretary of State Marco Rubio and U.S. envoy Steve Witkoff.\n\nWitkoff and Kushner have been at the center of multiple international negotiations, with Kushner involved especially in Middle East despite not having an official White House role as he did in the first Trump presidency.\n\nTrump and other leaders set to launch Board of Peace\n\nThe U.S. president will host presidents, prime ministers and top diplomats from more than a dozen countries to tout his international Board of Peace.\n\nThe list of attendees, according to a World Economic Forum schedule, is heavy on the Middle East and South America. But it remains short on major U.S. allies from Europe and the full membership list still isn’t clear.\n\nAmong the heads of government: Argentina President Javier Milei and Indonesia President Prabowo Subianto, both Trump allies; Paraguay’s conservative President Santiago Peña; Uzbekistan President Shavkat Mirziyoyev; Pakistan Prime Minister Shehbaz Sharif; Armenian Prime Minister Nikol Pashinyan and Azerbaijan President Ilham Aliyev. \n\nPashinyan and Aliyev agreed to their own peace deal at the White House last year.\n\nAttendees also include ministers and diplomats from Saudi Arabia, Bahrain, Turkey and Morocco, among others.\n\nZelenskyy arrives in Davos\n\nUkrainian President Volodymyr Zelenskyy has arrived in Davos to meet with Trump.\n\nZelenskyy is expected to make a speech and also participate in a panel discussion titled, “International Advisory Council for Ukraine’s Recovery.”\n\nOn the sidelines of the event, Zelenskyy is expected to meet with representatives of energy companies.\n\nElon Musk to speak at Davos in newly scheduled session\n\nTech billionaire Elon Musk is set to speak at Davos on Thursday in a newly scheduled session.\n\nThe World Economic Forum, which Musk previously criticized, confirmed it will be the Tesla owner’s first time attending the elite event in the Swiss Alps.\n\nHis address is billed as a conversation with Laurence Fink, BlackRock’s CEO and interim co-chair of the forum.\n\nMusk is embroiled in a war of words with Ryanair CEO Michael O’Leary that began with a dispute over installing Starlink systems on Ryanair planes. O’Leary on Wednesday dismissed the tech titan’s suggestion he would buy the budget airline.\n\nAsian shares rise, tracking Wall Street gains as Trump backs off Greenland\n\nAsian shares mostly advanced on Thursday, tracking Wall Street, after Trump walked back from imposing tariffs on eight European countries over Greenland and ruled out using military force to take control of the territory.\n\nThe future for the S&P 500 was up 0.4% on Thursday, while that for the Dow Jones Industrial Average increased 0.3%.\n\nTokyo’s Nikkei 225 climbed 1.9% to 53,760.85, with technology stocks among those leading the gain. SoftBank Group jumped 11% and chipmaker Tokyo Electron rose 3.7 per cent.\n\nRutte stresses keeping Ukraine as priority\n\nThe NATO chief is urging allies to “keep our eyes on the ball of Ukraine” after a standoff over Greenland that rattled the alliance appeared to ease a day earlier.\n\nRutte, speaking at the Ukraine breakfast, didn’t address a question about whether Greenland, which Trump has coveted, would remain a part of Denmark under the “framework of a future deal” announced by the president.\n\nRutte noted European plans to free up funds for Ukraine’s defense and U.S.-led talks about a peace deal, but said those efforts wouldn’t bear fruit immediately and Russia continues to launch drone and missile attacks on Ukraine.\n\n“What we need is to keep our eyes on the ball of Ukraine. Let’s not drop that ball,” Rutte said.\n\nTrump seeks to spotlight his proposed ‘Board of Peace’\n\nTrump wants to spotlight his proposed “Board of Peace” at Davos on Thursday, looking to create momentum for a project that has been overshadowed this week by Greenland.\n\nThe new board initially was envisioned as a small group of world leaders overseeing the Gaza ceasefire, but has morphed into something far more ambitious. Skepticism about its membership and mandate has led some traditional U.S. allies to take a pass so far.\n\nTrump expressed confidence in his idea ahead of what the White House said would be a “charter announcement” on the sidelines of the forum in the Swiss Alps.\n\nDanish PM says she won’t negotiate on sovereignty\n\nDanish Prime Minister Mette Frederiksen said Thursday that her country can’t negotiate on its sovereignty.\n\nShe has been “informed that this has not been the case” following the announcement of a new framework with NATO on Arctic security without the U.S. using force to take over Greenland.\n\nIn a statement, the Danish leader said security in the Arctic is a matter for all of NATO and “good and natural” that it be discussed between the U.S. president and NATO Secretary General Mark Rutte. \n\nFrederiksen said she has spoken with Rutte “on an ongoing basis,” including before and after he met Trump in Davos.\n\nTrump mulling a ‘tariff-free zone’ for Ukraine\n\nU.S. envoy Steve Witkoff says Trump is considering ideas like a “tariff-free zone” for Ukraine that could help industry develop in the war-torn country.\n\n“The president has talked about a tariff free zone from Ukraine that I think would be game changing,” Witkoff told the Ukraine breakfast on the sidelines of Davos.\n\nWitkoff made the comments before heading later Thursday to Moscow, where the administration has been working to wrest a peace deal to end the war between Russia and Ukraine.\n\nWitkoff said he would travel next to Abu Dhabi, where there would be working groups on issues like “military-to-military” and “prosperity” discussions.\n\nEurope breathes sigh of relief\n\nEurope is breathing a sigh of relief Thursday following a dramatic reversal by U.S. President Donald Trump over Greenland the day before at the World Economic Forum in Davos, Switzerland, where he scrapped the tariffs that he threatened to impose on eight European nations to press for U.S. control over Greenland.\n\nTrump said there is a new framework with NATO on Arctic security without the U.S. using force to take over Greenland. Still, there were many unanswered questions about what this Greenland deal means.\n\nThe Associated Press was inside an event Thursday morning billed as a breakfast discussing the war in Ukraine and featuring NATO Secretary General Mark Rutte.\n\nThe Associated Press","url":"https://www.ctvnews.ca/world/article/live-updates-poilievre-on-carneys-davos-speech-canada-needs-to-do-things-not-just-say-them/","image":"https://www.ctvnews.ca/resizer/v2/ODEWA4XELRB3LOM6C4XGGF7DKA.jpg?auth=c3d5f2798195f7af1d6a8a6510588dca3c6c0b4b4f87aba357d803ccfcb34be2","video":null,"publish_date":"2026-01-23 00:39:11","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.133},{"id":395186392,"title":"Trump slams his own plan to let people buy homes with retirement accounts","text":"President Donald Trump was all set to unveil a new plan to allow Americans to dip into their 401(k) retirement accounts to make down payments on houses, and he had some key figures in the GOP on his side like Sen. Josh Hawley (R-MO).\n\nBut all of a sudden, he is now against the idea.\n\nThe plan was one of several ideas Trump is mulling to try to, at least temporarily and in certain narrow circumstances, bring down the cost of living in the United States, as his administration has been plagued with similar ongoing inflation woes to the Biden administration before him.\n\nIn an Air Force One press gaggle on Thursday, though, Trump sang a different tune, according to CBS News' Jennifer Jacobs.\n\n\"I'm not a huge fan of it,\" said Trump. \"Other people like it. They're talking about taking money out to put a deposit down on a home. And one of the reasons I don't like it is that their 401(k)s are doing so well. 401(k)s are up 80, 90% in some cases. And you know, you're talking about a lot of people. I like keeping their 401(k)s in great shape. I like keeping their 401(k)s. And I'm not a huge fan of that, putting down a deposit.\"\n\nOther plans Trump and his officials have floated as trial balloons include the adoption of 50-year mortgages, which experts warn could actually make homes more expensive, and new restrictions on large investment firms from buying up single-family homes, which experts say has an extremely negligible impact on home prices.","summary":"President Donald Trump was all set to unveil a new plan to allow Americans to dip into their 401(k) retirement accounts to make down payments on houses, and he had some key figures in the GOP on his side like Sen. Josh Hawley (R-MO).\n\nBut all of a sudden, he is now against the idea.\n\nThe plan was one of several ideas Trump is mulling to try to, at least temporarily and in certain narrow circumstances, bring down the cost of living in the United States, as his administration has been plagued with similar ongoing inflation woes to the Biden administration before him.\n\nIn an Air Force One press gaggle on Thursday, though, Trump sang a different tune, according to CBS News' Jennifer Jacobs.\n\n\"I'm not a huge fan of it,\" said Trump. \"Other people like it. They're talking about taking money out to put a deposit down on a home. And one of the reasons I don't like it is that their 401(k)s are doing so well. 401(k)s are up 80, 90% in some cases. And you know, you're talking about a lot of people. I like keeping their 4","url":"https://www.rawstory.com/trump-housing-2675007100/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-attends-a-cabinet-meeting-at-the-white-house-in-washington-d-c-u-s-december-2-2025-reuters-br.jpg?id=62266092&width=1200&height=1200&coordinates=833%2C0%2C834%2C0","video":null,"publish_date":"2026-01-23 00:37:40","author":"Matthew Chapman","authors":["Matthew Chapman"],"language":"en","source_country":"US","sentiment":-0.458},{"id":395161568,"title":"‘We were the frontline’: Canadian veterans outraged by Trump’s NATO comments","text":"U.S. President Donald Trump is facing backlash from Canadian veterans after suggesting NATO allies did little during the war in Afghanistan, comments veterans say ignore their painful sacrifices.\n\nIn an interview with Fox News on Tuesday, Trump said the United States had “never needed” its NATO partners and characterized allied contributions in Afghanistan as minor, saying they “stayed a little back, a little off the front lines.”\n\nHis remarks didn’t sit well with Canadian veterans who were part of the Afghan conflict, which represented the country’s largest overseas deployment since the Second World War. More than 40,000 Canadian Armed Forces members served in the region between 2001 and 2014. In total, 158 Canadians were killed and thousands more were injured.\n\n‘We were the frontline’\n\nRetired corporal Bruce Moncur, who served in 2006 as part of Operation Medusa, said he is “enraged” by Trump’s comments. “We were the frontline,” he said Tuesday. “We took over Kandahar from the Americans because of their war in Iraq. We alleviated those forces so they could move to Iraq. We were as frontline as frontline can get.”\n\nMoncur’s time in Afghanistan came to an end when his platoon was mistakenly attacked by U.S. troops. \n\n“An American A-10 Warthog fired on our position without looking at his coordinates,” Moncur said. “It strafed myself and my entire platoon, essentially wiping out my platoon and killing (Private) Mark Anthony Graham.”\n\nMoncur said five per cent of his brain was removed following the attack. He re-learned how to walk, read, and write, effectively ending his military career. He is now a fifth-grade teacher in Thompson, Man.\n\nOut of his 40-member platoon, Moncur estimates 35 soldiers were either killed or wounded during their time in Afghanistan.\n\n‘Wolves don’t mind the opinions of sheep’\n\nRetired corporal Trevor Street of Maple Ridge B.C., served two tours in Afghanistan and said Trump’s comments speak to his ignorance about the conflict. \n\n“To allude to this idea that Canadians shied away from fighting or played no major part in fighting it just doesn’t line up with the objective facts.”\n\nStreet called Trump’s statement “insulting” but added he was trying not to take it too seriously. “Wolves don’t mind the opinions of sheep, he said. \n\nStreet also believes now is the time to use the added attention on Canadian veterans to advocate for new federal support on behalf of the Veterans Transition Network, which provides housing and counselling for those who did so much in Afghanistan, and beyond. “I have a very Canadian attitude about this. You know, you take a negative and you turn it into a positive,” Street said.","url":"https://www.ctvnews.ca/canada/article/we-were-the-frontline-canadian-veterans-outraged-by-trumps-nato-comments/","image":"https://www.ctvnews.ca/resizer/v2/322NC7BRH5EKJKSZFXD45HB35I.jpeg?auth=07bc701a6f278361c510859b9e05171adf733500c31ed3e91cc182ff75cccf66","video":null,"publish_date":"2026-01-23 00:37:37","author":"Andrew Johnson","authors":["Andrew Johnson"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.429},{"id":395160364,"title":"Trump, 79, Labels Peace ‘Destructive’ in Bizarre Comments","text":"President Donald Trump described peace as being “destructive for everyone” as he returned to the U.S following his appearance at the World Economic Forum in Davos, Switzerland.\n\nAsked about his controversial \"Board of Peace\" for Gaza and its $1 billion fee for permanent membership, Trump said, “Some of the countries have already put up much more than that. And that’s a lot of money, but it’s nothing compared to the value of peace.”\n\nThe Daily Beast has contacted the White House for comment.","summary":"Mandel Ngan/AFP via Getty ImagesPresident Donald Trump described peace as being “destructive for everyone” as he returned to the U.S following his appearance at the World Economic Forum in Davos, Switzerland.\n\nAsked about his controversial \"Board of Peace\" for Gaza and its $1 billion fee for permanent membership, Trump said, “Some of the countries have already put up much more than that. And that’s a lot of money, but it’s nothing compared to the value of peace.”\n\n“Peace is so destructive for everyone, even countries that aren’t involved,” he continued, before adding, “It’s so destructive for everybody when you have wars.” \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-79-labels-peace-destructive-in-bizarre-comments/","image":"https://www.thedailybeast.com/resizer/v2/EGW2EDH6ANA2TGTS3IN5OANLEE.jpg?smart=true&auth=74098a4150591c28e89f6b678723e7db9aad5d18978c2d076117d941c1796644&width=1440&height=1080","video":null,"publish_date":"2026-01-23 00:37:29","author":"Catherine Bouris","authors":["Catherine Bouris"],"language":"en","category":"politics","source_country":"us","sentiment":-0.063},{"id":395173898,"title":"Former Trump official doesn't know how Republicans 'sleep at night'","text":"President Donald Trump’s former deputy press secretary Sarah Matthews blasted Republicans trying to deny the facts of Trump’s attempted coup of the 2020 election.\n\nSome GOP lawmakers at the Thursday testimony of former special investigator Jack Smith attempted to arbitrarily absolved Trump of any wrongdoing, despite evidence of correspondence between Trump and Republican allies and footage of attacks on the U.S. Capitol. Some attempted to make the argument that Trump did not really believe he had lost the election, so his machinations to “find” more votes and other tactics were in earnest.\n\nMatthews, who worked with Trump, flushed those claims.\n\n“Trump knew that he lost, and he had been told by multiple advisers, both in the White House, on the campaign and state officials, that he lost, so that this was a propaganda effort by his part to try to find these votes,” Matthews told MS NOW anchor Ari Melber. “For example, in Georgia, spreading these conspiracy theories about Dominion voting machines. He knew that he lost, but he was willing to cling to anything and any excuse in order to try to stay in power.”\n\nMelber brought up Thursday Republican attacks on former Trump aide Cassidy Hutchinson, who provided incriminating testimony to the January 6 Committee on Trump’s scheme. Matthews similarly Blasted Republicans who attacked her without evidence. \n\n“Any attack on Cassidy Hutchinson is pathetic, because I know her to be someone of good character, and she is extremely brave for coming forward with what she knew and testifying before the January 6th committee,” said Matthews. “She faced death threats as a result and had to go into hiding. So, I think that it's really rich for a lot of these members of Congress to sit there and attack her when there is no basis to their attacks against her.”\n\n“Cassidy told the truth at great cost,” continued Matthews, “and I think that those who are sitting in those positions of power, who are two or three times her age, should really look at themselves in the mirror and consider what they're doing and how they go to sleep at night, because honestly, I don't know how they do it.”\n\nShe further hammered Republicans for “know[ing] that Trump lost a free and fair election and that he tried to overthrow it as a result.”\n\n - YouTube youtu.be","summary":"President Donald Trump’s former deputy press secretary Sarah Matthews blasted Republicans trying to deny the facts of Trump’s attempted coup of the 2020 election.\n\nSome GOP lawmakers at the Thursday testimony of former special investigator Jack Smith attempted to arbitrarily absolved Trump of any wrongdoing, despite evidence of correspondence between Trump and Republican allies and footage of attacks on the U.S. Capitol. Some attempted to make the argument that Trump did not really believe he had lost the election, so his machinations to “find” more votes and other tactics were in earnest.\n\nMatthews, who worked with Trump, flushed those claims.\n\n“Trump knew that he lost, and he had been told by multiple advisers, both in the White House, on the campaign and state officials, that he lost, so that this was a propaganda effort by his part to try to find these votes,” Matthews told MS NOW anchor Ari Melber. “For example, in Georgia, spreading these conspiracy theories about Dominion voting machines. He knew that ","url":"https://www.alternet.org/trump-2675007194/","image":"https://www.alternet.org/media-library/sarah-matthews-testifying-before-the-january-6-select-committee-on-july-21-2022-us-house.jpg?id=51643731&width=1200&height=600&coordinates=0%2C62%2C0%2C63","video":null,"publish_date":"2026-01-23 00:36:37","author":"Adam Lynch","authors":["Adam Lynch"],"language":"en","category":"politics","source_country":"US","sentiment":-0.237},{"id":395161572,"title":"Ukraine’s Zelenskyy says his repeated warnings to Europe feel like ‘Groundhog Day’","text":"DAVOS, Switzerland — Ukrainian President Volodymyr Zelenskyy blasted his European allies Thursday for what he portrayed as the continent’s slow, fragmented and inadequate response to Russia’s invasion nearly four years ago and its continued international aggression.\n\nAddressing the World Economic Forum in Davos, Switzerland, Zelenskyy listed a litany of grievances and criticisms of Europe that he said have left Ukraine at the mercy of Russian President Vladimir Putin amid an ongoing U.S. push for a peace settlement.\n\n“Europe looks lost,” Zelenskyy said in his speech, urging the continent to become a global force. He contrasted Europe’s response with Washington’s bold steps in Venezuela and Iran.\n\nThe former comic actor referred to the movie “Groundhog Day,” in which the main character must relive the same day over and over again.\n\n“Just last year, here in Davos, I ended my speech with the words: Europe needs to know how to defend itself. A year has passed. And nothing has changed. We are still in a situation where I must say the same words again,” Zelenskyy said.\n\nHe said that Ukrainians, too, seem caught in that reality in the war, “repeating the same thing for weeks, months and, of course, for years. And yet that is exactly how we live now. It’s our life.”\n\nEuropean countries, which see their own future defense at stake in the war on its eastern flank, have provided financial, military and humanitarian support for Kyiv, but not all members of the 27-nation European Union are helping. Ukraine also has been frustrated by political disagreements within Europe over how to deal with Russia, as well as the bloc’s at times slow-moving responses.\n\nA meeting with Trump\n\nHis speech came after he met behind closed doors for about an hour in Davos with U.S. President Donald Trump, who described the talks as “very good.” Zelenskyy called them “productive and meaningful.”\n\nSpeaking to reporters aboard Air Force One as he flew back to Washington from Davos, Trump said his meeting with Zelenskyy went well, adding that the Ukrainian president told him he wants to make a deal to end the war.\n\n“I had a good meeting, but I’ve had numerous good meetings with President Zelenskyy and it doesn’t seem to happen,” he said.\n\nTrump noted that both Putin and Zelenskyy want to reach a deal and that “everyone’s making concessions” to try to end the war.\n\nHe said the sticking points in talks remain the same as they’ve been during talks held during the past six or seven months, noting “boundaries” was a key issue. “The main hold-up is the same things that’s been holding it up for the last year,” he said.\n\nTrump said he and Zelenskyy talked about how Ukrainians were surviving the cold winter without heat.\n\n“It’s really tough for the people of Ukraine,” Trump said, noting that it was “amazing” how residents have been able to persevere through the winter facing relentless Russian strikes. “It’s no way to live,” he said.\n\nRussia’s bigger army has managed to capture about 20% of Ukraine since hostilities began in 2014 and its full-scale invasion of 2022. But the battlefield gains along the roughly 1,000-kilometer (600-mile) front line have been costly for Moscow, and the Russian economy is feeling the consequences of the war and international sanctions.\n\nUkraine is short of money and, despite significantly boosting its own arms manufacturing, still needs Western weaponry. It is also short-handed on the front line. Its defense minister last week reported some 200,000 troop desertions and draft-dodging by about 2 million Ukrainians.\n\nZelenskyy is also striving to keep the world’s attention focused on Ukraine despite other conflicts.\n\nZelenskyy cites inaction on key decisions\n\nHe chided Europe for being slow to act on key decisions, spending too little on defense, failing to stop Russia’s ”shadow fleet\" of oil tankers that are breaking international sanctions, and balking at using its frozen assets in Europe to finance Ukraine, among other things.\n\nEurope, he said, “still feels more like a geography, history, a tradition, not a real political force, not a great power.”\n\n“Some Europeans are really strong, it’s true, but many say we must stand strong, and they always want someone else to tell them how long they need to stand strong, preferably until the next election,” he said.\n\nThe Trump administration is pushing for a peace settlement, with its envoys shuttling between Kyiv and Moscow in a flurry of negotiations that some worry could force Ukraine into an unfavorable deal.\n\nA meeting in Moscow\n\nTrump’s special envoy Steve Witkoff and his son-in-law Jared Kushner arrived in Moscow late Thursday and sat for talks with Putin for more than 3 hours, according to the Kremlin.\n\nOne major issue remains to be resolved in negotiations, Witkoff said at Davos, without saying what it was. Zelenskyy said the future status of land in eastern Ukraine currently occupied by Russia is unresolved but that peace proposals are “nearly ready.”\n\nPostwar security guarantees, should a deal be reached, are agreed between the U.S. and Ukraine, although they would require each country’s ratification, he said.\n\nZelenskyy said two days of trilateral meetings involving the U.S., Ukraine and Russia are due to begin Friday in the United Arab Emirates.\n\n“Russians have to be ready for compromises because, you know, everybody has to be ready, not only Ukraine, and this is important for us,” he said.\n\nTrump and Zelenskyy have had a fraught relationship, and the American president has at times also rebuked Putin.\n\nZelenskyy said he thanked Trump for providing U.S.-made Patriot air defense systems that can help stop Russian missiles that are repeatedly hitting Ukraine’s power grid, causing hardship for civilians denied light, heating and running water. He said he asked Trump for more of them.\n\nAfter Trump cut support for Ukraine, other NATO countries began buying weapons from the U.S. to donate to Kyiv under a special financial arrangement.\n\nBy Kamila Hrabchuk And Kostya Manenkov.\n\nHrabchuk reported from Kyiv, Ukraine. Josh Boak on Air Force One, Meg Kinnard in Houston and Ali Swenson from Washington contributed to this report.","url":"https://www.ctvnews.ca/world/russia-ukraine-war/article/zelenskyy-slams-european-response-to-russias-war-as-ukraine-is-caught-in-its-own-groundhog-day/","image":"https://www.ctvnews.ca/resizer/v2/Y4VKIS2L4MBOWLFF4S62FBQQBE.jpg?auth=599bb338334c73393f3386c488606711b1de32861d1dc0eaf887daa7053d9617","video":null,"publish_date":"2026-01-23 00:34:41","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.172},{"id":395155166,"title":"It’s Time to Talk About Donald Trump’s Logorrhea","text":"There are many conclusions to be drawn from this astonishing statistic, including the obvious one, that our leader loves the sound of his own voice, and the slightly less obvious corollary that he has no one around him willing or able to tell him to shut up. It’s also true that, in rambling on so much, Trump reveals just about everything one could ever want to know about him—his lack of discipline, his ignorance, his vanity, insecurity, and crudeness, and a mean streak that knows no limits. “It is remarkable how a man cannot summarize his thoughts in even the most general sort of way without betraying himself completely,” Thomas Mann wrote a century ago in his novel “The Magic Mountain,” set in a sanitarium perched above the Swiss mountain town of Davos, where Trump spent the better part of this week proving to the stunned attendees of the annual World Economic Forum the continuing relevance of Mann’s observation.\n“Sometimes, you need a dictator,” Trump soliloquized on Wednesday, during a reception for business leaders. A few hours earlier, in an address that lasted a full hour and a half, the President had announced that he would not invade Greenland, despite his recent threats; explained that “stupid people” buy windmills; and admitted that he had decided to raise tariffs on Switzerland, because its prime minister, “a woman,” had “rubbed me the wrong way.” The speech, during which Trump four times referred to Iceland when he meant Greenland, was more than twice the combined length of the addresses of the French President, Emmanuel Macron, and the German Chancellor, Friedrich Merz. On Tuesday, speaking to the White House press corps to mark the actual anniversary of his return to the White House, Trump had discoursed on everything from his mother telling him he could have been a Major League baseball player and explaining to him what a mental asylum was to his hatred for Somalia and its “very low-I.Q. people.” That one lasted a hundred and four minutes.\nTrump, of course, was rude, untruthful, and excessively, if not quite so egregiously, long-winded in his first term, too. The difference today, as he presides over a cowed American government, whose checks and balances no longer function as they used to, is that his Administration is far more willing and able to turn his fantastical words into tangible realities. The President, it now seems clear, has the world’s most consequential case of untreated logorrhea. (Dictionary definition of this condition: “Excessive and often incoherent talkativeness.”)\nAnd I’m not just referring to the week’s crisis over Greenland and the future of the NATO alliance, a crisis which began and (sort of) ended with many words being uttered by Trump about his “psychological” need to own the vast and strategically located Danish territory. Consider, for example, Trump’s “Board of Peace,” which he débuted before leaving Davos on Thursday morning. In Trump 1.0, perhaps this would have been no more than one of his Twitter controversies, in which he posted some crazy graphic of himself leading a rump group of world powers to overthrow the United Nations as the new permanent chairman of the global board of directors. In Trump 2.0, his alternate reality is not just a social-media post or the subject of an over-my-dead-body fight with his latest panicked national security adviser, but an in-person photo op featuring the President, a real-life logo copied from the U.N.’s, and a random assortment of world leaders who were willing to buy a seat on Trump’s committee for a cool billion dollars. (Belarus and Qatar, yes; Britain, France, Germany, and every other major U.S. ally in Europe, no.) I highly recommend watching the fully livestreamed event, a show one might caption “Donald Trump and his pretend League of (Lesser) Superheroes, with himself as a bizarro Superman in charge of the world.”\nMy favorite moment was when—after bragging about how “everybody wants to be a part of” the board that every other major world leader, with the possible exception of the war-mongering pariah Vladimir Putin, refused to join—he claimed that the group he himself had dreamed up was some distinguished independent organization that had solicited his chairmanship. “I was very honored when they asked me to do it,” he said. For all I know, he believed it.\nPerhaps just as revealing, when Trump reached the fulsome self-praise section of his speech, he explained that he was such an incredible peacemaker that he had even managed to end wars in places where he had not known they were happening. Imagine admitting this about yourself. Another quote from “The Magic Mountain” sprang to mind: “I know I am talking nonsense, but I’d rather go rambling on….”\nBut the stunned reaction of so many Europeans to a week living in the full-on Trump talk cycle ought to remind us that there’s something to be said for the plainer interpretation of Trump’s out-of-control behavior, even if years of intensive exposure in the U.S. have inured us to it.\n“This is a wake-up call, a bigger one than we’ve ever had,” Christine Lagarde, the head of the European Central Bank, said.\n“The time has come to stand up against Trump,” Anders Fogh Rasmussen, a former prime minister of Denmark and secretary-general of NATO, said.\nIt was only a few days before his speech in Davos, on the eve of his visit to Switzerland, that Trump was revealed to have sent a text to the prime minister of Norway, complaining that, because Norway had denied him the Nobel Peace Prize, he was under no obligation to proceed peacefully in his desire to take over Greenland. The message, surely a first in diplomatic annals, began: “Dear Jonas, Considering your Country decided not to give me the Nobel Peace Prize for having stopped 8 Wars PLUS, I no longer feel an obligation to think purely of Peace, although it will always be predominant, but can now think about what is good and proper for the United States of America.”\nLars-Christian Brask, a deputy speaker of the Danish parliament, no doubt spoke for many in Europe when he responded to this evidence of Trump’s “mad and erratic behavior” by asking on television whether the President was still capable of running the United States.\nWhat struck me was how calm, reasonable, and puzzled Brask’s tone was as he said it. But it’s going to be a long three more years; there’s almost certainly going to be a lot of shouting before this is all over. How many polite ways, after all, are there to ask whether the President of the United States has lost his mind? ♦","summary":"How many polite ways are there to ask whether the President of the United States is losing it?","url":"https://www.newyorker.com/news/letter-from-trumps-washington/its-time-to-talk-about-donald-trumps-logorrhea","image":"https://media.newyorker.com/photos/6972b41a5f8ae58970d60e60/16:9/w_2560,h_1440,c_limit/Glasser_TRUMP-DAVOS.jpg","video":null,"publish_date":"2026-01-23 00:33:08","author":"Susan B. Glasser","authors":["Susan B. Glasser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.063},{"id":395165816,"title":"Jack Smith defends Trump prosecutions during contentious hearing","text":"Jan. 22 (UPI) -- President Donald Trump broke federal laws and rightfully was prosecuted, former Special Counsel Jack Smith said while testifying before the House Judiciary Committee on Thursday.\n\nThe committee held a public hearing to ensure transparency in the matter, so that the general public is better informed of the prior efforts to prosecute Trump for organizing a protest against the 2020 election that turned into a riot at the Capitol and over his handling of classified documents.\n\nCommittee chairman Jim Jordan, R-Ohio, accused Smith of politicizing the Justice Department and using statements that he knew were false to press legal claims against Trump.\n\n\"It was always about politics and to get President Trump,\" Jordan said of the Biden administration. \"They were willing to do almost anything.\"\n\nRep. Darrell Issa, R-Calif., accused Smith of targeting Trump and others because they were President Joe Biden's and Vice President Kamala Harris' \"political enemies.\"\n\n\"They were the enemy of the president,\" Issa said. \"And you were their arm, weren't you?\"\n\nSmith denied engaging in politicized lawfare against the president and instead said Trump knowingly violated federal laws when organizing the protest that devolved into a riot on Jan. 6, 2021.\n\nThe president \"willfully broke the very laws that he took an oath to uphold,\" Smith said.\n\n\"If asked whether to prosecute a former president based on the same facts today, I would do so regardless of whether that president was a Republican or a Democrat,\" he told the committee.\n\nSmith said he is \"not a politician\" and that he has \"no partisan loyalties.\"\n\nHe also denied accusations of spying on lawmakers and others when committee members raised the matter of Smith secretly examining the phone records of nine Republican senators while investigating the Capitol riot that began as a protest against the 2020 election.\n\nSmith told the committee that the phone records were germane to the investigation and defended a $20,000 payment made to a confidential source.\n\nSome Republican committee members suggested the payment was an improper use of taxpayer dollars, but Smith said the payment was for a source that reviewed photographic and video evidence of the event.\n\n\"No one should be above the law in our country,\" he told the committee. \"The law required that he be held to account, so that is what I did.\"\n\nSmith said the only regret he had about the dual prosecutions was that he did not do more to express his appreciation for the staff that assisted him at the time.\n\nHis investigative team collected enough evidence to support his charges against Trump, Smith said, adding that the president \"was by a large measure the most culpable and most responsible person in this conspiracy.\"\n\nSome Democratic Party members of the committee expressed their support for Smith and his efforts to investigate and prosecute Trump.\n\nRanking Member Jamie Raskin, D-Md., called Smith one of the country's \"great prosecutors,\" and some of the committee's other Democrats told Smith that they agreed that Trump had broken federal laws.\n\nWhile Smith's testimony was underway, the president on social media called him a \"deranged animal\" who should not be allowed to practice law\n\n\"Deranged Jack Smith is being decimated before Congress,\" Trump said. \"It was over when they discussed his past failures and unfair prosecutions.\"\n\nHe accused Smith of destroying \"many lives under the guise of legitimacy\" and said his law license would have been revoked and \"far worse\" would have been done if he were a Republican.\n\n\"Hopefully, the attorney general is looking at what he's done, including some of the corrupt witnesses that he was attempting to use against me,\" the president continued.\n\n\"The whole thing was a Democrat scam,\" he added. \"A big price should be paid by them for what they have put our country through!\"\n\nWhen committee members informed Smith of Trump's comments, he declined to respond to them and instead said that he expected the Justice Department to punish him in some way.\n\nSmith largely declined to answer questions regarding a separate case against Trump over the president's handling of classified documents.\n\nHe said an ongoing court case on the matter prevents him from discussing it.\n\nSmith earlier testified before the committee for eight hours on Dec. 17, which the committee later made public, along with a 255-page transcript of his testimony.\n\nSmith secured two indictments against Trump in 2023. One accused Trump of keeping classified documents after his first term, and the other accused him of plotting to overthrow the 2020 election.\n\nHe dropped both cases after Trump won in 2024 because the Justice Department has a policy against prosecuting a sitting president.\n\nTrump denied any wrongdoing and has called the indictments \"witch hunts\" and repeatedly has called for the prosecution of Smith since he took office last year.","summary":"President Donald Trump broke federal laws, former Special Counsel Jack Smith said while testifying before the House Judiciary Committee on Thursday.","url":"https://www.upi.com/Top_News/US/2026/01/22/jack-smith-testify-house-donald-trump-investigations/3571769095474/","image":"https://cdnph.upi.com/sv/ph/og/upi/3571769095474/2026/1/8fb32610caad0d5dcd4b6b60c5192ee8/v1.5/Jack-Smith-defends-Trump-prosecutions-during-contentious-hearing.jpg","video":null,"publish_date":"2026-01-23 00:32:52","author":"Lisa Hornung","authors":["Lisa Hornung"],"language":"en","category":"politics","source_country":"us","sentiment":-0.421},{"id":395161550,"title":"Vance’s message in Minnesota: Local officials must co-operate with the immigration crackdown","text":"MINNEAPOLIS — Insisting that he was in Minnesota to calm tensions, Vice-President JD Vance on Thursday blamed “far-left people” and state and local law enforcement officials for the chaos that has unfolded during the White House’s aggressive deportation campaign.\n\nThe Republican vice-president said, “We’re doing everything that we can to lower the temperature,” adding that Minnesota leaders should “meet us halfway.”\n\nThe U.S. Justice Department is investigating top Democrats in the state, including Gov. Tim Walz and Minneapolis Mayor Jacob Frey, over whether they have obstructed or impeded immigration enforcement through their public criticism of the administration. Walz and Frey have described the investigation as an attempt to bully the political opposition.\n\nFederal officers stood in a row behind Vance as he spoke, and there were two U.S. Immigration and Customs Enforcement vehicles emblazoned with the slogan “Defend the Homeland.”\n\nHis visit follows weeks of aggressive rhetoric from the White House, including U.S. President Donald Trump, who has threatened to invoke the Insurrection Act — and send in military forces — to crack down on unrest. Asked about that option, Vance said, “Right now, we don’t think that we need that.”\n\nTrump dispatched thousands of federal agents to Minnesota earlier this month after reports of child care fraud by Somali immigrants. Minneapolis-area officials, including Frey, as well as the police, religious leaders and the business community, have pushed back. And outrage grew after an agent fatally shot Renee Good, a U.S. citizen and mother of three, during a confrontation this month.\n\nWalz said the federal government was to blame for the turmoil.\n\n“Take the show of force off the streets and partner with the state on targeted enforcement of violent offenders instead of random, aggressive confrontation,” he wrote on social media.\n\nFrey, speaking from city hall, accused immigration officials of racial profiling, an accusation that Vance had rejected during his visit.\n\n“They are detaining people that have done nothing wrong,” Frey said. “They are going after people exclusively based on the fact that they look like they are Somali or Latino, and no reason beyond that.”\n\nHe said the enforcement measures in the city and an influx of some 3,000 federal officers seemed designed as political retaliation, as opposed to getting criminals off the street.\n\n“This is more about, tragically, terrorizing people than it is about safety, than it is even about immigration,” Frey said.\n\nVance defends actions by ICE agents\n\nVance has played a leading role in defending the agent who killed Good, and he previously said her death was “a tragedy of her own making.” On Thursday, he repeated claims that Good “rammed” an agent with her car, an account that has been disputed based on videos of the incident.\n\nMinnesota faith leaders, backed by labor unions and hundreds of Minneapolis-area businesses, are planning a day of protests on Friday. Nearly 600 local businesses have announced plans to shut down, while hundreds of “solidarity events” are expected across the country, according to MoveOn spokesperson Britt Jacovich.\n\nVance defended ICE agents who detained a 5-year-old boy as he was arriving home from preschool.\n\n“When they went to arrest his illegal alien father, the father ran,” Vance said. “So the story is that ICE detained a 5-year-old. Well, what are they supposed to do?”\n\nThe boy, who was taken by federal agents along with his father to a detention facility in Texas, was the fourth student from his Minneapolis suburb to be detained by immigration officers in recent weeks.\n\nAsked about reporting that federal authorities are asserting sweeping power to forcibly enter people’s homes without a judge’s warrant, Vance said warrants would still be part of immigration enforcement. But Vance did not specify which kind of warrant he was referring to.\n\n“Nobody is talking about doing immigration enforcement without a warrant,” Vance said. “We’re never going to enter somebody’s house without some kind of warrant, unless of course somebody is firing at an officer and they have to protect themselves.”\n\nThe Associated Press reported on Wednesday that federal immigration officers were asserting sweeping power to forcibly enter houses without a judicial warrant, according to an internal ICE memo, in what is a reversal of long-standing guidance meant to respect constitutional limits on government searches.\n\nInstead, the officers can use administrative warrants. Those are issued by ICE officials, as opposed to warrants signed off on by an independent judge.\n\nVance visited Ohio earlier in the day\n\nDuring a stop in Toledo, Ohio, on Thursday morning, Vance acknowledged that immigration agents have made mistakes, while declining to be specific.\n\n“Of course there have been mistakes made, because you’re always going to have mistakes made in law enforcement,” he said when asked about Trump’s comments earlier this week that ICE “is going to make mistakes sometimes.”\n\nBut Vance said the blame didn’t lie with the federal government.\n\n“The number one way where we could lower the mistakes that are happening, at least with our immigration enforcement, is to have local jurisdictions that are cooperating with us,” he said.\n\nVance also praised the arrest of protesters who disrupted a church service in Minnesota on Sunday and said he expects more prosecutions to come. The protesters entered the church chanting “ICE out” and “Justice for Renee Good.”\n\n“They’re scaring little kids who are there to worship God on a Sunday morning,” Vance said. He added, “Just as you have the right to protest, they have a right to worship God as they choose. And when you interrupt that, that is a violation of the law.”\n\nVance took the opportunity to criticize hometown Democratic Rep. Marcy Kaptur while he was in her Toledo-centred district. A crowded slate of Republicans — including former ICE Deputy Director Madison Sheahan — is vying to take on the longest-serving woman in Congress this fall.\n\nVance’s stop in Ohio was focused primarily on bolstering the administration’s positive economic message on the heels of Trump’s appearance at the World Economic Forum in Davos, Switzerland, and he showed support for Republicans like gubernatorial contender Vivek Ramaswamy and U.S. Sen. Jon Husted.\n\nConvincing voters that the nation is in rosy financial shape has been a persistent challenge for Trump during the first year of his second term. Polling has shown that the public is unconvinced that the economy is in good condition and majorities disapprove of Trump’s handling of foreign policy.\n\nVance urged voters to be patient with the economy, saying Trump had inherited a bad situation from Democratic U.S. President Joe Biden.\n\n“You don’t turn the Titanic around overnight,” Vance said. “It takes time to fix what is broken.”\n\nBy Michelle L. Price, Julie Carr Smyth And Steve Peoples.\n\nCarr Smyth reported from Columbus, Ohio, and Peoples from New York. Associated Press writers Jack Brook and Sarah Raza contributed from Minneapolis.","url":"https://www.ctvnews.ca/world/article/vances-message-in-minnesota-local-officials-must-co-operate-with-the-immigration-crackdown/","image":"https://www.ctvnews.ca/resizer/v2/GTA3ETXZQFD5NFNIS5EM54NOYQ.jpg?auth=352cfc064e67b4ab244f5108e8ea675983dee43985db8a715232573e8e1d5d3e","video":null,"publish_date":"2026-01-23 00:32:27","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.688},{"id":395161782,"title":"The deal to secure TikTok’s future in the US has finally closed","text":"The joint venture acquiring TikTok’s US assets has been formally established and has announced its leadership team, according to the company, one day before the deadline set by President Donald Trump for the app’s US assets to be spun off by Chinese parent company ByteDance. The transaction’s close concludes a yearslong effort to secure TikTok’s long-term future in the United States and address concerns that it posed a national security risk. “The majority American owned Joint Venture will operate under defined safeguards that protect national security through comprehensive data protections, algorithm security, content moderation, and software assurances for U.S. users,” the group said in a statement on Thursday. The joint venture will be led by CEO Adam Presser, who previously led TikTok’s efforts to secure Americans’ user data in the United States, and Chief Security Officer Will Farrell, who led privacy and security for the effort. It will be overseen by a board that includes TikTok US CEO Shou Chew; Kenneth Glueck, Executive Vice President in the Office of the Chief Executive Officer at Oracle; and representatives of investment firm Susquehanna International Group and private equity firm Silver Lake, Emirati investment firm MGX, among others. The US TikTok saga began when Trump, during his first term, vowed to ban the app. It ramped up in 2024 when then-President Joe Biden signed a law requiring that the US version of the app be spun off from its parent company, ByteDance, or be banned in the United States. During his second term, Trump has repeatedly delayed enforcement of the law as he sought a deal to transfer control of the app’s US operations to American ownership. When he approved the deal last fall, Trump gave the parties a January 23 deadline to finalize the transaction. TikTok signed the deal last month. The deal will likely be good news to TikTok’s more than 200 million American users, many of whom rely on the app for entertainment, news and, in some cases, even their livelihoods. The agreement transferred control of TikTok’s US user data and most of its US operations to a new joint venture, 50% of which will be owned by a consortium of investors comprised of tech company Oracle, private equity firm Silver Lake and Emirati-backed investment firm MGX. Just over 30% of the joint venture will be held by “affiliates of certain existing investors in ByteDance,” and 19.9% will be retained by ByteDance, according to a memo Chew sent to employees last month. The new entity plans to retrain TikTok’s algorithm on US user data, and Oracle will oversee storage of Americans’ data. The US joint venture will also be responsible for content moderation for US users. However, the ByteDance-controlled global TikTok entity will continue to manage e-commerce, advertising and marketing on the new US platform, according to Chew’s memo. That means American users’ experience on the app is unlikely to change in a visible way, although the algorithm that determines what videos are served to their feeds could shift as the new ownership group takes control. Trump last year designated the spinoff deal as a “qualified divestiture” under the sale-or-ban law. But questions remain about whether the arrangement fully addresses the core national security concerns that motivated US lawmakers to pass the law on a bipartisan basis in the first place. US officials had worried that ByteDance could be forced to manipulate the algorithm on behalf of the Chinese government to influence or generate dissent among Americans. The TikTok ban-or-sale law prohibited “any cooperation with respect to the operation of a content recommendation algorithm” between ByteDance and a new potential American ownership group. “Interoperability enables the Joint Venture to provide U.S. users with a global TikTok experience, ensuring U.S. creators can be discovered and businesses can operate on a global scale,” the joint venture group said in its statement. Under the deal finalized Thursday, the new joint venture will continue to license the TikTok algorithm from ByteDance before retraining and reviewing it. Whether Beijing would approve the deal had also remained uncertain up until the deal’s close. TikTok had become a leverage point in broader US-China trade negotiations; an earlier version of the deal was derailed last year after Trump announced a new round of tariffs. The Chinese government still has not directly addressed the final deal structure.","url":"https://edition.cnn.com/2026/01/22/tech/tiktok-us-deal-closes","image":"https://media.cnn.com/api/v1/images/stellar/prod/16-tiktokapp-bej-20260122212850523.JPG?c=16x9&q=w_800,c_fill","video":null,"publish_date":"2026-01-23 00:32:02","author":"Clare Duffy","authors":["Clare Duffy"],"language":"en","source_country":"us","sentiment":-0.169},{"id":395186198,"title":"School Assembly News Headlines For January 23: Top National, International & Other News","text":"News Headlines for School Assembly, January 23rd: From Donald Trump referring to himself as a “dictator” at the WEF in Switzerland to the Indian Education Ministry establishing a three-member committee to review student suicide cases at IIT Kanpur, here are the top news highlights for today.\nTop National News:\n– The Supreme Court on Wednesday questioned whether the Election Commission of India (ECI) possesses “untrammelled powers” to bypass established rules during its ongoing Special Intensive Revision (SIR) of electoral rolls.\n– Amid reports of terror threat on Republic Day in the national capital, the Delhi Police issued alert posters featuring a picture of Mohammed Rehan, an Al-Qaeda in the Indian Subcontinent (AQIS) terrorist from Delhi.\n– The Odisha government has imposed a statewide ban on all tobacco and nicotine-containing products, such as gutkha, pan masala, zarda, khaini, and more.\nTop International News:\n– US President Donald Trump referred to himself as a “dictator” at the World Economic Forum in Switzerland, while defending his leadership style and policy approach.\n– Russian President Vladimir Putin has publicly distanced Moscow from US President Donald Trump’s push to acquire Greenland, saying the issue does not concern Russia even as it fuels tensions between Washington, Denmark and NATO allies.\nTop Sports News:\n– Defending champion Jannik Sinner made light work of home favourite James Duckworth to headline a dominant day for the top seeds at the Australian Open, as Novak Djokovic, Iga Swiatek and Madison Keys all moved safely into the next round.\nTop Business News:\n– Indian IT services companies are moving fast enough on artificial intelligence (AI) and are not lagging behind global peers, Rishad Premji, executive chairman of Wipro, said at the World Economic Forum (WEF) in Davos.\nTop Education News:\n– The Ministry of Education has established a three-member committee to review the ‘Framework Guidelines for Emotional and Mental Wellbeing of Students in Higher Education Institutions’ at IIT Kanpur.","summary":"School Assembly News Headlines For January 23: Check top national, international, education, business and sports news for school assembly.","url":"https://www.news18.com/education-career/school-assembly-news-headlines-on-january-23-top-national-international-sports-business-education-updates-9850087.html","image":"https://images.news18.com/ibnlive/uploads/2025/10/School-Assembly-News-2-2025-10-c69e3e76f60a878535e3039acfe2bb8a.jpg","video":null,"publish_date":"2026-01-23 00:30:54","author":"Education.careers Desk,News18,Sukanya Nandy","authors":["Education.careers Desk","News18","Sukanya Nandy"],"language":"en","source_country":"in","sentiment":0.177},{"id":395172972,"title":"MPs’ fury as Trump claims Nato troops avoided front line in Afghanistan","text":"Donald Trump has provoked outrage among MPs and veterans after claiming Nato troops stayed away from the front line in Afghanistan.\n\nThe US president made his comments in an interview with Fox News in which he reiterated his suggestion that Nato would not support America if asked.\n\nHe said: “We’ve never needed them. They’ll say they sent some troops to Afghanistan ... and they did, they stayed a little back, a little off the front lines.”\n\nHis remarks drew condemnation from across the political spectrum, with critics pointing to the 457 British deaths in Afghanistan and highlighting Mr Trump’s avoidance of military service in Vietnam.\n\nCalvin Bailey, a Labour MP and former RAF officer who served alongside US special operations units in Afghanistan, said Mr Trump’s claim “bears no resemblance to the reality experienced by those of us who served there”.\n\nBen Obese-Jecty, a Tory MP, who served in Afghanistan as a captain in the Royal Yorkshire Regiment, said it was “sad to see our nation’s sacrifice, and that of our Nato partners, held so cheaply by the president of the United States”.\n\nTan Dhesi, chairman of the Commons Defence Committee, said the president’s comments were “appalling and an insult to our brave British servicemen and women, who risked life and limb to help our allies, with many making the ultimate sacrifice”.\n\nDame Emily Thornberry, the Foreign Affairs Committee chairwoman, described them on the BBC’s Question Time as “so much more than a mistake”, and “an insult” to the families of those who had died.\n\nMr Trump has previously been criticised for avoiding being conscripted to fight in Vietnam thanks to being diagnosed with bone spurs in his heels - a claim that has been subject to significant doubt.\n\nFormer soldier, author and journalist Stephen Stewart said: “Trump’s comments are as offensive as they are inaccurate.\n\n“It’s hugely ironic that someone who allegedly dodged the draft for the Vietnam War should make such a disgraceful statement.\n\n“He has desecrated the memory of hundreds of British soldiers who made the ultimate sacrifice in Afghanistan, people who we called friends and comrades.\n\n“If he was a man of honour, he would get down on bended knees to ask forgiveness from the families of the fallen.”\n\nSir Ed Davey, the Liberal Democrat leader, said in a post on X: “Trump avoided military service 5 times.\n\n“How dare he question their sacrifice. Farage and all the others still fawning over Trump should be ashamed.”\n\nThe UK suffered the second highest number of military deaths in the Afghanistan conflict, behind the US, which saw 2,461 deaths.\n\nIn total, America’s allies suffered 1,160 deaths in the conflict, around a third of the total coalition deaths.\n\nMr Bailey also pointed to the high number of deaths per capita suffered by Denmark, which sent troops to fight alongside the British in Helmand province but has now had to fend off Mr Trump’s bid to annex Greenland.\n\nHe said: “As I reminded the US forces I served with on the 4th of July in 2008, we were there because of a shared belief, articulated at America’s founding, that free people have inalienable rights and should not live under tyranny.\n\n“That belief underpinned the response to 9/11, and it is worth reflecting on now.”\n\nAmerica remains the only country to have invoked the collective security provisions of Nato’s Article 5, with the alliance to provide support to the US after the terrorist attacks of September 11 2001.","url":"https://uk.news.yahoo.com/mps-fury-trump-claims-nato-003011117.html","image":"https://s.yimg.com/ny/api/res/1.2/DXWS4sy6y0BF_IAMqbWK.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNTA0O2NmPXdlYnA-/https://media.zenfs.com/en/the_telegraph_818/025229edcd4e5c9876cb503017415ffc","video":null,"publish_date":"2026-01-23 00:30:11","author":"Telegraph Reporters","authors":["Telegraph Reporters"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.229},{"id":395174440,"title":"Putin and US Envoy Steven Witkoff talks conclude","text":"BAKU, Azerbaijan, January 23. The meeting\nbetween Russian President Vladimir Putin and US President Donald\nTrump’s special envoy, Steven Witkoff, concluded after more than\nthree and a half hours, Trend reports, citing the Kremlin press service.\n\nAccording to the information, the American side was represented\nat the meeting by businessman Jared Kushner, White House Senior\nAdviser, and Federal Acquisition Service Commissioner Josh\n\nThe Russian delegation included Presidential Aide Yuri Ushakov,\nSpecial Presidential Representative for Investment and Economic\nCooperation with Foreign Countries, and Head of the Russian Direct\nInvestment Fund Kirill Dmitriev.\n\nA meeting between Russian President Vladimir Putin, US\nPresidential Special Envoy Steven Witkoff, and businessman Jared\nKushner has begun in Moscow, Trend reports.\n\nThe talks are being broadcast live.\n\nRepresenting Russia are Presidential Aide Yuri Ushakov and\nSpecial Presidential Envoy Kirill Dmitriev.","summary":"","url":"https://www.trend.az/world/russia/4145019.html","image":"/imagen/4145019","video":null,"publish_date":"2026-01-23 00:30:00","author":"Ingilab Mammadov","authors":["Ingilab Mammadov"],"language":"en","category":"politics","source_country":"az","sentiment":0.071},{"id":395179172,"title":"Trump touts ‘total access’ Greenland deal as NATO asks allies to step up","text":"DAVOS, Switzerland/NUUK - U.S. President Donald Trump said on Thursday he had secured total and permanent access to Greenland in a deal with NATO, whose head said allies would have to step up their commitment to Arctic security to ward off threats from Russia and China.News of a framework deal came as Trump backed off tariff threats and ruled out taking Greenland by force, bringing a degree of respite in what was brewing to be the biggest rupture in transatlantic ties in decades.But the details of any agreement were unclear, and Denmark insisted its sovereignty over the island ​was not up for discussion. EU foreign policy chief Kaja Kallas said relations between the bloc and the U.S. had 'taken a big blow' in the past week, as EU leaders met for an emergency ‍summit.","summary":"News of a framework deal came as the U.S. president backed off tariff threats and ruled out taking Greenland by force.","url":"https://www.japantimes.co.jp/news/2026/01/23/world/trump-greenland-total-access/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2026/01/23/518844.jpg?v=3.1","video":null,"publish_date":"2026-01-23 00:23:00","author":"Jacob Gronholt-Pedersen,Mark John,Susan Heavey,Web Master","authors":["Jacob Gronholt-Pedersen","Mark John","Susan Heavey","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.126},{"id":395186384,"title":"Fury as elementary school warns ICE trying to lure parents by using food flyers as bait","text":"A Minnesota school's chilling warning to parents sparked outrage on Thursday from observers who accused the Trump administration's immigration agents of stopping at nothing to \"inflict cruelty and suffering.\"\n\nOn Thursday, Anne Sullivan STEAM School in Minneapolis sent out a dark warning to parents and faculty as President Donald Trump's immigration crackdown leads to fierce backlash and escalating protests.\n\n\"Hello Sullivan Families, we have learned that ICE is sending out flyers offering food support to families. For your safety, do not respond to these offers. If your family is in need of support, please contact the school and we will connect you with one of our School Social Workers,\" the message said.\n\nSteve McPherson, a writer and guitar teacher, shared the message on Bluesky and tore into the Trump administration.\n\n\"There is no level to which these heartless s--t-for-brains won't stoop to inflict cruelty and suffering,\" he wrote.\n\nMcPherson said the message came from the middle school's Signal chat, sent via Talking Points and confirmed by the school's administration.\n\n\"‬This is the end stage of capitalism/fascism i hope we survive,\" lamented the Bluesky user arcadus.\n\n\"There is no reforming this. No amount of 'training' is going to change who they are,\" ‪wrote user Chris Weatherly.\n\nThe user meehawl called it, \"Predator behavior.\"\n\nTrump deployed approximately 2,000 Immigration and Customs Enforcement and Border Patrol agents to Minneapolis in what the Department of Homeland Security called its largest operation ever. The crackdown escalated dramatically after an ICE agent fatally shot 37-year-old Renee Good on Jan. 7, sparking widespread protests and national outrage. \n\nPublic backlash has been severe, with recent polling showing 52-57% of Americans disapprove of ICE, with a plurality supporting abolishing the agency entirely.","summary":"A Minnesota school's chilling warning to parents sparked outrage on Thursday from observers who accused the Trump administration's immigration agents of stopping at nothing to \"inflict cruelty and suffering.\"\n\nOn Thursday, Anne Sullivan STEAM School in Minneapolis sent out a dark warning to parents and faculty as President Donald Trump's immigration crackdown leads to fierce backlash and escalating protests.\n\n\"Hello Sullivan Families, we have learned that ICE is sending out flyers offering food support to families. For your safety, do not respond to these offers. If your family is in need of support, please contact the school and we will connect you with one of our School Social Workers,\" the message said.\n\nSteve McPherson, a writer and guitar teacher, shared the message on Bluesky and tore into the Trump administration.\n\n\"There is no level to which these heartless s--t-for-brains won't stoop to inflict cruelty and suffering,\" he wrote.\n\nMcPherson said the message came from the middle school's Signal chat, se","url":"https://www.rawstory.com/ice-minnesota/","image":"https://www.rawstory.com/media-library/u-s-border-patrol-officer-stands-guard-as-protests-against-immigration-and-customs-enforcement-ice-draw-hundreds-to-the-ice-h.jpg?id=61682949&width=1200&height=1200&coordinates=916%2C0%2C917%2C0","video":null,"publish_date":"2026-01-23 00:19:11","author":"Daniel Hampton","authors":["Daniel Hampton"],"language":"en","source_country":"US","sentiment":-0.448},{"id":395179204,"title":"‘Will act accordingly’: US threatens action against Haitian council  - Guyana Inquirer – Daily Guyana News","text":"The United States has issued a warning to Haiti’s Transitional Presidential Council, writing that it would consider action should the temporary governing body compromise the Caribbean nation’s security.\n\nIn a sternly worded social media post on Thursday, the US embassy in Haiti maintained that its goal was the “establishment of baseline security and stability”.\n\n“The US would regard any effort to change the composition of the government by the non-elected Transitional Presidential Council at this late stage in its tenure (set to expire on February 7) to be an effort to undermine that objective,” Deputy Secretary of State Christopher Landau wrote.\n\nHe added that the US would respond if such changes to the council were to occur. His statement, however, failed to identify the precise circumstances that prompted the warning.\n\n“The US would consider anyone supporting such a disruptive step favoring the gangs to be acting contrary to the interests of the United States, the region, and the Haitian people and will act accordingly,” Landau said.\n\nHaiti continues to struggle with the ravages of widespread gang violence, instability and corruption in its government.\n\nBut the US threat is likely to send shudders throughout the region, particularly in the aftermath of the January 3 attack on Venezuela.\n\nThe administration of President Donald Trump has repeatedly advanced the notion that the entire Western Hemisphere falls under its sphere of influence, as part of a policy it dubbed the “Donroe Doctrine”, a riff on the 19th-century Monroe Doctrine.\n\nTrump has referenced that premise to justify the use of US military force to abduct Venezuelan President Nicolas Maduro, as well as to claim the US needs to control Greenland.\n\nA political crisis\n\nLocated some 11,000 kilometres (800 miles) southeast of the US, Haiti has long struggled with instability. It is considered the poorest country in the Western Hemisphere, as it continues to suffer from the legacy of foreign intervention, dictatorship and natural disasters.\n\nBut in 2021, the country faced a new crisis when President Jovenel Moise was assassinated in his home in the capital, Port-au-Prince.\n\nFederal elections have not been held since, leading to a crisis of confidence in the government. The last federally elected officials saw their terms expire in 2023.\n\nExperts say the lack of leadership has allowed Haiti’s gangs to flourish, and since the Moise assassination, they have taken control of vast stretches of the territory, including up to 90 percent of the capital.\n\nThe resulting violence has forced more than 1.4 million Haitians from their homes. Millions more suffer from food insecurity, as thoroughfares are often restricted by gang-led roadblocks.\n\nThis week, a United Nations report found that, between January and November of last year, an estimated 8,100 people were killed in the violence. That marks an escalation from 2024, when the yearly total was 5,600.\n\nBut efforts have been made to restore the country’s stability. The Transitional Presidential Council was designed as a temporary governing structure to set the framework for new federal elections. Established in 2024, it has nine members who rotate to serve as chair.\n\nVery quickly, however, the council faced criticism for its membership – largely selected from the country’s business and political elite – and allegations of corruption swirled. Infighting has also broken out among the members.\n\nThe US too has added to the tensions on the council. In November, it announced visa restrictions against an unnamed government official, later identified in the media as one of the council’s members, economist Fritz Alphonse Jean.\n\nWhile the council had been slated to hold tiered elections starting last November, it failed to meet that benchmark, and the first vote has been postponed to August.\n\nIn the meantime, the council’s mandate is set to dissolve on February 7, and the panel’s future remains unclear.\n\nUN calls for action\n\nIn this week’s report on Haiti, UN Secretary-General Antonio Guterres linked Haiti’s ongoing humanitarian crisis to the vacuum in its government.\n\n“Violence has intensified and expanded geographically, exacerbating food insecurity and instability, as transitional governance arrangements near expiry and overdue elections remain urgent,” Guterres said.\n\nAnother UN representative – Carlos Ruiz-Massieu, who leads the UN Integrated Office in Haiti (BINUH) – was also emphatic about the immediate need for transparent democratic processes and unified governance.\n\n“Let us be clear: the country no longer has time to waste on prolonged internal struggles,” he said.\n\nStill, in a speech on Wednesday to the UN Security Council, Ruiz-Massieu added that there have been “encouraging” signs ahead of this year’s scheduled elections. He applauded efforts to increase voter registration, including in Haiti’s diaspora, and encourage political participation among women.\n\nBut Ruiz-Massieu underscored that security concerns, including gang violence, could impede the democratic process, and that there was more work to be done before elections could be held.\n\n“Achieving this goal will require sustained coordination among relevant institutions, predictable financing of the electoral process and security conditions that allow all voters and candidates to participate without fear,” he said.\n\nThe UN also signalled it would bolster its multinational security support mission in Haiti with more troops later this year.","url":"https://guyanainquirer.com/will-act-accordingly-us-threatens-action-against-haitian-council/","image":"https://guyanainquirer.com/app/uploads/2026/01/AP26020818719651-1769108817-ZjYVrr.jpg","video":null,"publish_date":"2026-01-23 00:19:03","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":0.064},{"id":395156560,"title":"‘Will act accordingly’: US threatens action against Haitian council  - Antigua Tribune – Daily Antigua &amp;","text":"The United States has issued a warning to Haiti’s Transitional Presidential Council, writing that it would consider action should the temporary governing body compromise the Caribbean nation’s security.\n\nIn a sternly worded social media post on Thursday, the US embassy in Haiti maintained that its goal was the “establishment of baseline security and stability”.\n\n“The US would regard any effort to change the composition of the government by the non-elected Transitional Presidential Council at this late stage in its tenure (set to expire on February 7) to be an effort to undermine that objective,” Deputy Secretary of State Christopher Landau wrote.\n\nHe added that the US would respond if such changes to the council were to occur. His statement, however, failed to identify the precise circumstances that prompted the warning.\n\n“The US would consider anyone supporting such a disruptive step favoring the gangs to be acting contrary to the interests of the United States, the region, and the Haitian people and will act accordingly,” Landau said.\n\nHaiti continues to struggle with the ravages of widespread gang violence, instability and corruption in its government.\n\nBut the US threat is likely to send shudders throughout the region, particularly in the aftermath of the January 3 attack on Venezuela.\n\nThe administration of President Donald Trump has repeatedly advanced the notion that the entire Western Hemisphere falls under its sphere of influence, as part of a policy it dubbed the “Donroe Doctrine”, a riff on the 19th-century Monroe Doctrine.\n\nTrump has referenced that premise to justify the use of US military force to abduct Venezuelan President Nicolas Maduro, as well as to claim the US needs to control Greenland.\n\nA political crisis\n\nLocated some 11,000 kilometres (800 miles) southeast of the US, Haiti has long struggled with instability. It is considered the poorest country in the Western Hemisphere, as it continues to suffer from the legacy of foreign intervention, dictatorship and natural disasters.\n\nBut in 2021, the country faced a new crisis when President Jovenel Moise was assassinated in his home in the capital, Port-au-Prince.\n\nFederal elections have not been held since, leading to a crisis of confidence in the government. The last federally elected officials saw their terms expire in 2023.\n\nExperts say the lack of leadership has allowed Haiti’s gangs to flourish, and since the Moise assassination, they have taken control of vast stretches of the territory, including up to 90 percent of the capital.\n\nThe resulting violence has forced more than 1.4 million Haitians from their homes. Millions more suffer from food insecurity, as thoroughfares are often restricted by gang-led roadblocks.\n\nThis week, a United Nations report found that, between January and November of last year, an estimated 8,100 people were killed in the violence. That marks an escalation from 2024, when the yearly total was 5,600.\n\nBut efforts have been made to restore the country’s stability. The Transitional Presidential Council was designed as a temporary governing structure to set the framework for new federal elections. Established in 2024, it has nine members who rotate to serve as chair.\n\nVery quickly, however, the council faced criticism for its membership – largely selected from the country’s business and political elite – and allegations of corruption swirled. Infighting has also broken out among the members.\n\nThe US too has added to the tensions on the council. In November, it announced visa restrictions against an unnamed government official, later identified in the media as one of the council’s members, economist Fritz Alphonse Jean.\n\nWhile the council had been slated to hold tiered elections starting last November, it failed to meet that benchmark, and the first vote has been postponed to August.\n\nIn the meantime, the council’s mandate is set to dissolve on February 7, and the panel’s future remains unclear.\n\nUN calls for action\n\nIn this week’s report on Haiti, UN Secretary-General Antonio Guterres linked Haiti’s ongoing humanitarian crisis to the vacuum in its government.\n\n“Violence has intensified and expanded geographically, exacerbating food insecurity and instability, as transitional governance arrangements near expiry and overdue elections remain urgent,” Guterres said.\n\nAnother UN representative – Carlos Ruiz-Massieu, who leads the UN Integrated Office in Haiti (BINUH) – was also emphatic about the immediate need for transparent democratic processes and unified governance.\n\n“Let us be clear: the country no longer has time to waste on prolonged internal struggles,” he said.\n\nStill, in a speech on Wednesday to the UN Security Council, Ruiz-Massieu added that there have been “encouraging” signs ahead of this year’s scheduled elections. He applauded efforts to increase voter registration, including in Haiti’s diaspora, and encourage political participation among women.\n\nBut Ruiz-Massieu underscored that security concerns, including gang violence, could impede the democratic process, and that there was more work to be done before elections could be held.\n\n“Achieving this goal will require sustained coordination among relevant institutions, predictable financing of the electoral process and security conditions that allow all voters and candidates to participate without fear,” he said.\n\nThe UN also signalled it would bolster its multinational security support mission in Haiti with more troops later this year.","url":"https://antiguatribune.com/will-act-accordingly-us-threatens-action-against-haitian-council/","image":"https://antiguatribune.com/app/uploads/2026/01/AP26020818719651-1769108817-2xzx6x.jpg","video":null,"publish_date":"2026-01-23 00:18:35","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ag","sentiment":0.064},{"id":395189588,"title":"Federal judge appears skeptical of Trump’s authority to rebuild White House ballroom","text":"A U.S. judge has cast significant doubt on the legality of President Donald Trump’s administration’s plans to construct a $400m ballroom at the White House, questioning whether it had the authority to proceed without congressional approval. The proposed 90,000-square-foot facility is slated for the site of the recently demolished East Wing.\n\nDuring a hearing concerning a lawsuit brought by the National Trust for Historic Preservation, U.S. District Judge Richard Leon expressed strong reservations. \n\nHe questioned whether President Trump possessed the statutory power to dismantle the East Wing and build a ballroom in its place without explicit oversight or authorization from the US Congress.\n\nJudge Leon sharply rebuked a lawyer for the administration, stating, \"Come on, be serious,\" after comparisons were drawn to minor renovations, such as the installation of a swimming pool during the Gerald Ford administration in the 1970s.\n\nThe judge indicated he would issue a ruling in the coming weeks on the National Trust's request for a preliminary injunction, which aims to halt construction work.\n\nThe National Trust initiated legal action against Trump and several federal agencies in December, arguing that the project has advanced without the necessary approvals, environmental review, or congressional authorization. The group contends that federal law prohibits construction on federal parkland in Washington without express congressional authority. \n\nIt further argues that the National Park Service violated federal law by issuing an environmental assessment instead of a full impact statement, and by releasing it only after the 120-year-old East Wing had already been demolished.\n\nWhile Judge Leon declined to issue a temporary restraining order in December, the White House and other federal defendants are urging the court to deny a preliminary injunction, which would force an end to construction while the lawsuit continues.\n\nThe administration has defended the project's legality, asserting it follows a long tradition of presidential renovations, including Franklin D. Roosevelt's original construction of the East Wing. In a court filing, the administration stated the ballroom is essential for state functions, its design is still evolving, and above-ground construction is not planned until April, rendering an injunction unnecessary. Justice Department lawyer Jacob Roth affirmed at Thursday's hearing that the ballroom plans serve the public interest.\n\nEarlier this month, the National Capital Planning Commission held its first public hearing on the ballroom plans, following the White House's submission of an application to both the NCPC and the Commission of Fine Arts last month.","summary":"The judge sharply rebuked a lawyer for the administration, stating, ‘Come on, be serious,’ after comparisons were drawn to minor renovations","url":"https://www.independent.co.uk/news/world/americas/us-politics/white-house-ballroom-judge-trump-lawsuit-b2906052.html","image":"https://static.independent.co.uk/2025/12/30/22/39/GettyImages-2243854169.jpg?crop=3958,2638.7,x0,y0.2&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/ox7QO3eM-OhrQWqOm.mp4","publish_date":"2026-01-23 00:17:43","author":"Mike Scarcella","authors":["Mike Scarcella"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.293},{"id":395157544,"title":"Massive Fraud Infuriates Minnesotans, Lawmakers, But Top Official Sees No Quick Fix","text":"Authored by Janice Hisle via The Epoch Times (emphasis ours),\n\nST. PAUL, Minn.—Erin Campbell, Minnesota’s top financial officer, told a state anti-fraud committee at the state Capitol on Jan. 21: “Unfortunately, there’s not a ‘silver bullet’ to stop the type of fraud that we’ve seen in our public-assistance programs.”\n\nThe lack of a quick fix is largely because “state government is about as complex as it gets,” Campbell told the Fraud Prevention and State Agency Oversight Policy Committee.\n\nThat bipartisan committee of eight state representatives began meeting nearly a year ago to tackle large-scale defrauding of the state’s public-assistance programs. That was about 10 months before investigative reports and a viral video drew focus to Minnesota’s massive problem with fraudsters. The scandal has been building for years.\n\nSince 2022, federal prosecutors have charged nearly 100 suspects—mostly of Somali descent—in Minnesota fraud cases; officials estimate that fraud losses, now being probed as far back as 2018, could exceed $9 billion. President Donald Trump’s administration froze funding for some programs and mobilized investigations from multiple federal agencies, ranging from the Treasury Department to the IRS and the Justice Department.\n\nCampbell, commissioner of Minnesota Management and Budget, told the lawmakers’ committee that her employees “work as hard as we can to support agencies” that are expected to follow the “systems of financial management” that her office creates.\n\nThose systems involve “statutes, processes, policies, culture, agencies, practices, and [information technology] ... that have been developed over decades,” she said.\n\nThus, addressing fraud requires “layers” of coordinated changes, she said, such as analyzing data, upgrading technology, and changing state laws that govern program eligibility.\n\nHowever, noting that the state government has swelled to 59,000 employees, state Rep. Isaac Schultz said: “This is outrageous for the people of Minnesota, that our state government, at its largest size in state history, can’t take care of this mess.”\n\n“I can’t understate it—how frustrated Minnesotans are right now with the level of fraud and the lack of accountability that we’ve seen,” he said.\n\nCampbell said that 75 employees on her team face the gargantuan task of supporting the statewide government, with its $65-billion budget and hundreds of state agencies, boards, and commissions, “while we’re making 2.5 million payments every year.”\n\nThus, Campbell said, her office lacks “the capacity ... or the appropriate line of sight” to identify and tackle fraud in individual state agencies.\n\nWhen other state agencies see signs of fraud, it’s up to them to pause payments and refer cases to law enforcement agencies or the state attorney general for criminal investigations, Campbell said. Her office lacks authority to hold other agency heads accountable if procedures aren’t followed, she said.\n\nThe governor does have that power, Campbell and others agreed.\n\nWhen Schultz asked whether Gov. Tim Walz, a Democrat, had “ever directed you or members of your team to stifle the reports of whistleblowers,” Campbell replied, “Absolutely not.”\n\nThat is one accusation that Walz has faced from whistleblowers. Three Republicans who serve on the fraud committee—Reps. Kristin Robbins, Walter Hudson, and Marion Rarick—testified about that at a congressional hearing in Washington earlier this month. Walz has defended his record and has denounced fraudsters. He is scheduled to testify about fraud Feb. 10 to the U.S. Committee on Oversight and Accountability.\n\nThe Democratic leader of the Minnesota anti-fraud committee, Rep. Dave Pinto, said that, on his side of the political aisle, “We all share just a sense of fury” over taxpayer dollars being stolen instead of benefiting “people in need.”\n\nSchultz said he was glad to hear bipartisan agreement that “this is a real and significant problem that deserves federal, and state, and local level attention.”\n\n“Minnesotans are sick of this and for too long it’s been hidden inside this state Capitol ... but not any longer,” Schultz said.\n\nAfter the hearing, another Democrat, Rep. Emma Greenman, told The Epoch Times she expects to see a set of proposals to address fraud soon after the Legislature reconvenes next month. “Some of which, hopefully, we are working on with our folks across the aisle,” she said.\n\nIf not, “then we'll do it ourselves,” Greenman said.\n\nAlso in an interview after the hearing, the Republican who heads the committee, Robbins, said Republicans and Democrats appear to be approaching the fraud problem from different angles.\n\n“I think our side is more driven for finding accountability and their side is more like, ‘fix the errors,’” Robbins told The Epoch Times.\n\nRobbins noted that she repeatedly asked Campbell and other budget-management employees “What do you need?” to ensure tighter financial controls across agencies.\n\n“They didn’t have an answer,” Robbins said. “So I don’t know that they want to hold people accountable.”\n\nStill, however, there appears to be universal agreement on one point, Robbins said: “We want to stop the fraud.”\n\nDemocrats and Republicans joined forces last year on several anti-fraud measures, including a whistleblower-protection bill, Robbins pointed out. That history gives her hope that representatives of both parties can find common ground to further clamp down on fraud.\n\n“I mean, everybody’s constituents are furious about this,” she said. “Nobody wants fraud.”","url":"https://www.zerohedge.com/political/massive-fraud-infuriates-minnesotans-lawmakers-top-official-sees-no-quick-fix","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2026-01/image%2874%29.jpg?itok=Hnim1OFC","video":null,"publish_date":"2026-01-23 00:15:00","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.443},{"id":395170266,"title":"Woman charged with assaulting cabin crew on flight to Perth","text":"A﻿ woman will face court today charged with assaulting a member of the cabin crew on a flight from Canberra to Perth last month.\n\nThe 52-year-old woman from the ACT was allegedly behaving erratically towards another passenger as the plane prepared for take-off on December 13.\n\nWhen a crew member intervened to check on her, the woman allegedly ﻿forcefully grabbed their arm and head, which caused minor injuries.\n\nREAD MORE: Enormous bruise spotted on Donald Trump's hand\n\nAFP officers boarded the plane when it landed in Perth and escorted the woman, who was allegedly argumentative and aggressive towards them, off the flight.\n\nThe woman was charged with assaulting crew of an aircraft and behaving in an offensive and disorderly manner on an aircraft.\n\nThe offences each carry a fine of $16,500.\n\nThe woman is due to appear in Perth Magistrates Court today﻿.","summary":"A﻿ woman will face court today charged with assaulting a member of the cabin crew on a flight from Canberra to Perth last month.","url":"https://www.9news.com.au/national/act-woman-charged-with-assaulting-cabin-crew-on-flight-to-perth-news/7844afca-d630-42d8-8942-3582c4bc0d54","image":"https://imageresizer.static9.net.au/Kz0qcwbVyjKC99meVAydoOao_wg=/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F9f18d97c-b0b6-4ceb-97cf-d21a54cfbd14","video":null,"publish_date":"2026-01-23 00:13:36","author":"9News,Rebecca Masters","authors":["9News","Rebecca Masters"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.705},{"id":395182880,"title":"EU pretends it's business as usual with Trump, but beneath the surface fears remain","text":"We need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nDaft.ie Property\nAllianz Home\nThe 42 Sport\nTG4 Entertainment\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nFrench Prime Minister Emmanuel Macron at the special European Council summitAlamy \n\nEU pretends it's business as usual with Trump, but beneath the surface fears remain\n\nAlthought the immediate crisis has subsided, EU leaders still met in Brussels last night to decide a coordinated response to Trump’s threats — but not everyone was happy about it. \n\n12.13am, 23 Jan 2026\n\nShare options\n\nJane Matthews\n\nreports from Brussels \n\nUS PRESIDENT DONALD Trump had European Union leaders scrambling this week in response to his mounting threats over Greenland, only to take his foot off the accelerator at the final moment. \n\nLast night, as the leaders of the EU’s 27 member states made their way into the emergency meeting that had been called to address the crisis, expressions were gloomy, perhaps in part because the whole affair ended up feeling somewhat pointless.\n\nWhile a lot of the leaders may have privately thought this, Slovak Prime Minister Robert Fico took his grievances public, sharing a video from his plane on the way to the meeting. \n\nIn it, he dubbed last night “simply a super expensive dinner in Brussels”.\n\nIndeed, officials in the European Council were keen to stress that the events of this week would not become the norm. Council President António Costa would not be making a habit of rushing to convene a meeting every time there is a threat from the United States. \n\nBut while the stakes of tonight’s meeting were greatly lowered after Trump said he would not be using military force to “take” Greenland, European leaders still opted to meet, debrief and plan for the next Trump-related crisis. \n\nTrump holds up a signed Board of Peace charter during the Annual Meeting of the World Economic Forum in Davos, Switzerland, Thursday, Jan. 22, 2026Alamy\n\nWhat was expected to be a short dinner ended up stretching into the early hours, a reflection of the scale of the issues the EU still had to deal with in the face of the most significant crises in the transatlantic relationship in years. \n\nAs well as discussing tariffs and Greenland, many of the European leaders had signalled on the way into the meeting that they were eager to also discuss an EU response to Donald Trump’s so-called ‘Board of Peace‘.\n\nTaoiseach Micheál Martin somewhat underplayed the state of affairs when he stopped to speak to journalists on the red carpet before the summit dinner.\n\nIt’s been a “challenging few weeks in respect of the Greenland situation”, the Taoiseach said.\n\n“But I welcome the developments of yesterday. First of all, the announcement by President Trump that force would not be used in respect of Greenland. And secondly, that the threat of tariffs on certain EU member states were to be lifted.”\n\nAdvertisement\n\nFrench President Emmanuel Macron (and yes, he was still in his Davos shades) was blunter in his assessment, saying he welcomed Trump’s climbdown, “even though, we remain vigilant.” \n\nSo what next for the EU-US relationship? \n\nOn the trade front, the first thing is that despite anger at Trump, the ratification process for the US trade deal that was agreed in the summer will now go ahead in the coming days as initially planned. \n\nEU member states (Ireland and our open economy chief among them) will be breathing a sigh of relief that we did not have to invoke the trade ‘bazooka’, aka the Anti-Coercion Instrument.\n\nNever before used, the tool has been described as the “nuclear option”, allowing the EU to, among other things, restrict imports and exports to the bloc entirely.\n\nJust how significant the ‘bazooka’ was in Trump’s climbdown is hard to say, but no doubt the counter-threat did have some effect. \n\nWhat was likely much more impactful was the engagement between Trump and Nato chief Mark Rutte. \n\nGoing into last night’s meeting, much confusion remained over what exactly was included in the framework deal agreed by the pair in relation to Greenland, with Greenlandic Prime Minister Jens-Frederik Nielsen saying he himself did not know.\n\nIt’s understood that European Council President António Costa briefed EU leaders on the details of the deal last night after he was briefed by Rutte.\n\nIn a late-night press conference after the EU leaders’ meeting, Costa reaffirmed that only Greenland and Denmark can decide on matters concerning Greenland and Denmark.\n\nCouncil President António Costa\n\n“Looking ahead, we remain ready to engage constructively with the United States on all issues of common interest, including on creating the conditions for a just and lasting peace in Ukraine,” Costa said. \n\nAddressing Trump’s ‘Board of Peace’, Costa said the EU has “serious doubts” about the scope of the organisation and its compatibility with the United Nations. \n\nCosta’s comments at the closing press conference gave no hint of the panic that ran through EU institutions this week. \n\nBut despite his calm demeanour, there is no doubt that the EU will not want to relive another week like this. \n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nJane Matthews\n\nView 25 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “EU pretends it's business as usual with Trump, but beneath the surface fears remain”.\n\nRecipient's Email\n\nFeedback on “EU pretends it's business as usual with Trump, but beneath the surface fears remain”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nDonald Trump\nEuropean Council\n\nNews in 60 seconds\n\nThe Morning Lead\nMultiple apps encouraging Irish users to swap women's faces onto pornographic images and videos\n\nStephen McDermott\n\nUS negotiators meet Putin for high-stakes Ukraine talks\n\nFinal death toll from Spain's rail disaster is 45 after two more bodies found\n\nThe Traitors\nThere was major drama in The Traitors UK this evening, heading into the final weekend\n\nTaser deployed four times before fatal shooting of George Nkencho, inquest hears\n\nHere's what happened today: Thursday\n\nMoney matters\nSpotted a new deduction from your payslip? It's probably your new pension\n\nAir Force One\nDonald Trump departs Shannon Airport on journey home from Davos\n\nNiall O'Connor\n\nFive children arrested in connection with alleged sexual assault of girl in Dublin\n\nÁras an Uachataráin\nPresident Connolly cancels engagements scheduled for today after husband took ill at event\n\nboard of peace\nTrump has unveiled his 'Board of Peace' in Davos - here's what we know\n\nmore from us\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nGender Pay Gap Report '25\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nGender Pay Gap Report '25\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2026 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Althought the immediate crisis has subsided, EU leaders still met in Brussels last night to decide a coordinated response to Trump’s threats — but not everyone was happy about it.","url":"https://www.thejournal.ie/emergency-eu-council-greenland-trump-6935694-Jan2026/","image":"https://img2.thejournal.ie/article/6935694/river/?height=400&version=6935810","video":null,"publish_date":"2026-01-23 00:13:25","author":null,"language":"en","source_country":"ie","sentiment":0.224},{"id":395184956,"title":"‘Will act accordingly’: US threatens action against Haitian council  - Grenada Chronicle – Daily Grenada And","text":"The United States has issued a warning to Haiti’s Transitional Presidential Council, writing that it would consider action should the temporary governing body compromise the Caribbean nation’s security.\n\nIn a sternly worded social media post on Thursday, the US embassy in Haiti maintained that its goal was the “establishment of baseline security and stability”.\n\n“The US would regard any effort to change the composition of the government by the non-elected Transitional Presidential Council at this late stage in its tenure (set to expire on February 7) to be an effort to undermine that objective,” Deputy Secretary of State Christopher Landau wrote.\n\nHe added that the US would respond if such changes to the council were to occur. His statement, however, failed to identify the precise circumstances that prompted the warning.\n\n“The US would consider anyone supporting such a disruptive step favoring the gangs to be acting contrary to the interests of the United States, the region, and the Haitian people and will act accordingly,” Landau said.\n\nHaiti continues to struggle with the ravages of widespread gang violence, instability and corruption in its government.\n\nBut the US threat is likely to send shudders throughout the region, particularly in the aftermath of the January 3 attack on Venezuela.\n\nThe administration of President Donald Trump has repeatedly advanced the notion that the entire Western Hemisphere falls under its sphere of influence, as part of a policy it dubbed the “Donroe Doctrine”, a riff on the 19th-century Monroe Doctrine.\n\nTrump has referenced that premise to justify the use of US military force to abduct Venezuelan President Nicolas Maduro, as well as to claim the US needs to control Greenland.\n\nA political crisis\n\nLocated some 11,000 kilometres (800 miles) southeast of the US, Haiti has long struggled with instability. It is considered the poorest country in the Western Hemisphere, as it continues to suffer from the legacy of foreign intervention, dictatorship and natural disasters.\n\nBut in 2021, the country faced a new crisis when President Jovenel Moise was assassinated in his home in the capital, Port-au-Prince.\n\nFederal elections have not been held since, leading to a crisis of confidence in the government. The last federally elected officials saw their terms expire in 2023.\n\nExperts say the lack of leadership has allowed Haiti’s gangs to flourish, and since the Moise assassination, they have taken control of vast stretches of the territory, including up to 90 percent of the capital.\n\nThe resulting violence has forced more than 1.4 million Haitians from their homes. Millions more suffer from food insecurity, as thoroughfares are often restricted by gang-led roadblocks.\n\nThis week, a United Nations report found that, between January and November of last year, an estimated 8,100 people were killed in the violence. That marks an escalation from 2024, when the yearly total was 5,600.\n\nBut efforts have been made to restore the country’s stability. The Transitional Presidential Council was designed as a temporary governing structure to set the framework for new federal elections. Established in 2024, it has nine members who rotate to serve as chair.\n\nVery quickly, however, the council faced criticism for its membership – largely selected from the country’s business and political elite – and allegations of corruption swirled. Infighting has also broken out among the members.\n\nThe US too has added to the tensions on the council. In November, it announced visa restrictions against an unnamed government official, later identified in the media as one of the council’s members, economist Fritz Alphonse Jean.\n\nWhile the council had been slated to hold tiered elections starting last November, it failed to meet that benchmark, and the first vote has been postponed to August.\n\nIn the meantime, the council’s mandate is set to dissolve on February 7, and the panel’s future remains unclear.\n\nUN calls for action\n\nIn this week’s report on Haiti, UN Secretary-General Antonio Guterres linked Haiti’s ongoing humanitarian crisis to the vacuum in its government.\n\n“Violence has intensified and expanded geographically, exacerbating food insecurity and instability, as transitional governance arrangements near expiry and overdue elections remain urgent,” Guterres said.\n\nAnother UN representative – Carlos Ruiz-Massieu, who leads the UN Integrated Office in Haiti (BINUH) – was also emphatic about the immediate need for transparent democratic processes and unified governance.\n\n“Let us be clear: the country no longer has time to waste on prolonged internal struggles,” he said.\n\nStill, in a speech on Wednesday to the UN Security Council, Ruiz-Massieu added that there have been “encouraging” signs ahead of this year’s scheduled elections. He applauded efforts to increase voter registration, including in Haiti’s diaspora, and encourage political participation among women.\n\nBut Ruiz-Massieu underscored that security concerns, including gang violence, could impede the democratic process, and that there was more work to be done before elections could be held.\n\n“Achieving this goal will require sustained coordination among relevant institutions, predictable financing of the electoral process and security conditions that allow all voters and candidates to participate without fear,” he said.\n\nThe UN also signalled it would bolster its multinational security support mission in Haiti with more troops later this year.","url":"https://grenadachronicle.com/will-act-accordingly-us-threatens-action-against-haitian-council/","image":"https://grenadachronicle.com/app/uploads/2026/01/AP26020818719651-1769108817-ME1bdV.jpg","video":null,"publish_date":"2026-01-23 00:13:21","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gd","sentiment":0.064},{"id":395179948,"title":"Trump says bruise on his left hand came after hitting a table","text":"A bruise is visible on the back of US President Donald Trump’s left hand during the World Economic Forum summit in Davos. (AFP pic)\nWASHINGTON: Photographs of fresh bruising on Donald Trump's hand raised eyebrows on Thursday, but the 79-year-old US president dismissed renewed speculation over his health, saying he had simply hit a table.\nTrump has been seen with frequent bruising on his right hand since returning to the White House last year, often concealing it with bandages and makeup.\nThe White House has said it is due to a combination of frequent handshaking and the aspirin he takes for his cardiovascular health, which can lead to proneness for bruising.\nHowever, photos on Thursday at the World Economic Forum in Davos, Switzerland showed dark bruises in a similar location - but this time on Trump's left hand.\nThe images, taken while Trump was at an inaugural ceremony for his global \"Board of Peace\" initiative, quickly spread on social media.\n\"I clipped it on the table,\" Trump told journalists on Air Force One when asked about the bruising, adding: \"I would say, take aspirin if you like your heart, but don't take aspirin if you don't want to have a little bruising.\"\nThe White House had earlier downplayed any concerns, giving the same explanation for the bruise.\nPhotos from early in the \"Board of Peace\" event and yesterday show no bruising on the left hand.\nSpeculation has swirled about Trump's fitness given his age - he is the oldest person to take office as president - the hand bruising, swelling in his legs, and several apparent moments of dozing off during public events.\nThe administration disclosed last summer that Trump's leg swelling had been diagnosed as a symptom of chronic venous insufficiency - a common condition in which faulty vein valves allow blood to pool, causing swelling, cramping and skin changes.\nIt can be managed with medication or targeted procedures.\nAn unannounced hospital visit last year added to suspicions of secrecy around his health.\nWeeks afterward, Trump's doctor said MRI imaging had shown the president to be in \"excellent\" cardiovascular health.","summary":"The 79-year-old US president dismisses renewed health concerns over the same injury previously visible on his right hand.","url":"https://www.freemalaysiatoday.com/category/world/2026/01/23/trump-says-bruise-on-his-left-hand-came-after-hitting-a-table","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/dcaea25d-trump-bruise-hand.jpg","video":null,"publish_date":"2026-01-23 00:10:54","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":-0.35},{"id":395183198,"title":"Sorry MAGA, Turns Out People Still Like ‘Woke’ Art","text":"He was joking (don’t come for him!), but his quip highlights a pretty stark dichotomy. Last year, as everyone from President Donald Trump down harped on about the perils of DEI, the biggest cultural breakthroughs—Sinners, KPop Demon Hunters, Heated Rivalry, One Battle After Another—all showcased diversity in fresh ways. And it succeeded. These works weren’t just popular among leftists or critics, they were bona fide cultural phenomena.\nSinners, a horror movie set in the Jim Crow South, used vampires as a metaphorical device to explore systemic racism and cultural theft—and director Ryan Coogler scored a feat in his deal with Warner Bros. that gives him the rights to the film in 25 years. KPop Demon Hunters, a story by a female Korean-Canadian director who’d been waiting over a decade for her chance to direct a feature, placed a huge emphasis on authenticity and brought the already-massive subculture around K-pop even more into the mainstream. Heated Rivalry, a small Canadian television production picked up by HBO, had an extremely subversive take on hockey by chronicling the horny-yet-poignant love story between two closeted pro players. And One Battle After Another—decried by conservative commentators who felt it lionized left-wing violence—offered complicated views on motherhood and activism while skewering ICE-like agent Colonel Steven J. Lockjaw and his desperate attempts to fit in with other racists.\nIn a year when the White House issued multiple executive orders doing away with DEI programs in the federal government, the successes of those projects felt like a form of resistance. Corporate media followed Trump’s suit, with Warner Bros. Discovery, Amazon, Paramount Global, and Disney all reportedly scaling back on their diversity efforts. Skydance, founded by David Ellison, son of billionaire Trump supporter Larry Ellison, acquired Paramount, which briefly removed Jimmy Kimmel from the air due to his joke about Charlie Kirk supporters and gave CBS News a seemingly conservative makeover. Meanwhile, shows that offered red meat in the form of farmers, grumpy MAGA adherents, cowboys, and Christian values were greenlit and promoted.\n“There is a feeling from ... this administration that the only stories that matter are stories of straight white men, and that is just simply not the case,” says Jenni Werner, executive artistic director of the New Harmony Project, which develops theater, film, and TV projects and says it is committed to anti-oppressive and anti-racist values.\n“Audiences want to feel transformed. You want to be able to sit down and watch something, whether it's in your home or in a theater, that takes you into a new place and maybe gives you a new understanding of something.” She adds that she has faith that artists will keep making “boundary-pushing work,” even if it keeps getting harder.\nEven before Trump’s second term, trying to get out-of-the-box stories made in Hollywood has been a slog. According to UCLA’s Hollywood Diversity Report, released in December, nearly 80 percent of directors of theatrical movies in 2024 were white, along with about 75 percent of leading actors.\nThe report also suggests this discrepancy is leaving money on the table, noting that BIPOC moviegoers “were overrepresented as ticket buyers for films that had casts of more than 20 percent BIPOC.” Sinners grossed $368 million at the box office, a feat that puts it in the “horror hall of fame,” per The New York Times.\nLess diversity also means less buzz, the UCLA report says.\n“If a show features some kind of underrepresented story, such as a women-centered story, the median total interactions for these shows were talked about on social media more than five times than shows without,” said Michael Tran, sociologist and coauthor of the diversity report, in a press release about the research.\nWith media conglomeration increasingly turning the industry into one big network in a MAGA hat, it’s hard to know if Hollywood will get the message. (To that end: Paramount Skydance is currently on a quest to outbid Netflix and take over Warner Bros.)\nIn December, I asked Wicked director Jon Chu, who had just signed a three-year deal with Paramount Skydance, whether he was worried about Ellison’s DEI crackdown. Chu’s decision to cast Cynthia Erivo, a Black woman, as Elpheba was just one of the controversial calls he has made in a career that has championed diversity. His response, essentially, was that money talks.\n“The thing about the box office, which I love about movie theaters, is that reviewers can say whatever they want, people in a conference room can say whatever they want, business affairs can say whatever the fuck they want,” he said. “But when you put it in a movie theater, if it makes money, if it creates a cultural phenomenon, it becomes a fact, then there's nothing you can say about it. There’s no more argument.”\nUpdate, January 22 at 7:15 pm: A previous version of this article had the two Ellisons reversed. We've corrected the error.","summary":"From Black vampires gobbling up Oscar nominations to gay pro hockey players dominating the culture, diverse stories broke through in an environment that’s increasingly hostile to them.","url":"https://www.wired.com/story/sorry-maga-turns-out-people-still-like-woke-art/","image":"https://media.wired.com/photos/69725087e6598106e5d4e52e/16:9/w_2400,h_1350,c_limit/rev-1-GRC-TRL2-001r_High_Res_JPEG%20(2).jpg","video":null,"publish_date":"2026-01-23 00:09:06","author":"Manisha Krishnan","authors":["Manisha Krishnan"],"language":"en","source_country":"US","sentiment":0.054},{"id":395189590,"title":"Could ICE raids in Maine swing its key Senate race?","text":"Maine’s senate race is undergoing upheaval as Donald Trump and his administration put a thumb on the scale in a manner that could cost one of the most senior Republicans in Congress their seat.\n\nSen. Susan Collins, a five-term Republican, is hoping to once again secure victory for her party and help them protect the majority in the upper chamber this fall. Typically, she’d be doing so in her usual fashion: As a maverick but reliably red centrist Republican known for breaking with her party on some issues but generally remaining a loyal member of the Senate GOP caucus.\n\nThis year, however, things are different. After spurning the president on a War Powers resolution meant to constrain further hostilities with Venezuela, Collins finds herself running with Trump’s anti-endorsement: He urged his Republican voters to leave Collins and four other GOP senators at the altar this election season and beyond, in a Truth Social post. Days after the Senate GOP leader insisted he didn’t mean it, Trump doubled down, calling her a “disaster”.\n\nAnd this week, Homeland Security officials confirmed that a surge of ICE operations will soon begin in Collins’s home state — provoking a furious response from her two declared Democratic opponents, one of whom is the state’s current governor, Janet Mills.\n\nDubbed “Operation Catch of the Day”, it will target Maine’s Somali-American community based largely in Lewiston, according to CBS News, as well as other locations in the state where the administration says undocumented immigrants from other African nations are located. It follows the Trump administration and the president leaning into a wave of targeted enforcement against Minnesota’s Somali-American community and Trump’s own heavy criticism of Somali-Americans, which has been called overtly racist by Democrats. A DHS official who spoke to Fox News said that the administration wanted to arrest 1,400 people in the state.\n\nAcross the country, a larger-scale ICE surge in Minneapolis has become the site of rising tensions and angry demonstrations after an ICE agent shot and killed a woman in her car, Renee Good, during a confrontation on a street. Thousands of people have begun protesting the ICE presence, including in Maine.\n\nOn Thursday, both Mills and Collins’s Democratic-caucusing independent colleague in the U.S. Senate, Angus King, briefed reporters in Portland, Maine, about the ICE surge. Both raised concerns about reports of an ICE memo supposedly rationalizing agents entering homes and businesses without warrants to detain suspected targets for immigration enforcement. Collins was conspicuously absent and has been since the enforcement surge was announced.\n\nMills said that she was also concerned that the surge would not target individuals with criminal backgrounds, and would instead involve broad sweeps to pick up anyone with problems in their immigration background.\n\n\"We take allegations of criminal activity seriously, no matter who the person is. I don't sense that there's any greater incidence of crime among non-citizens than there is among citizens; in fact, I think probably the opposite,\" Mills said at a news conference. \"But that's not what we're hearing about.”\n\nKing issued a forceful statement on Wednesday, condemning what he called “the most dangerous assault on our economy, our democratic system, and our people since the Civil War,” perpetrated (he said) by the White House. He pledged to vote against ICE funding once it reaches the Senate.\n\nCollins also released a statement with a notable amount of nuance to it on Wednesday, her first on the situation since telling HuffPost a week ago that she didn’t “see the rationale for a large number of ICE agents to come in.”\n\n“There are people in Maine and elsewhere who have entered this country illegally and who have engaged in criminal activity. They could be subject to arrest and deportation pursuant to the laws of the United States, and people who are exercising the right to peacefully gather and protest their government should be careful not to interfere with law enforcement efforts while doing so,” said the senator.\n\n“I have advocated for providing body cameras and de-escalation training for ICE personnel. At this time of heightened tensions, these steps could help improve trust, accountability, and safety,” Collins went on. “Our proposed funding bill for the Department of Homeland Security includes $20 million for body cameras and $2 million for de-escalation training, which could help protect both ICE agents and the general public. I hope that Congress will adopt these measures quickly.”\n\nAs a centrist Republican, Collins has always been in a tough spot — one that grew immeasurably tougher under the rise of Donald Trump. But before now, Republican leaders and Trump himself have always been willing to give her some slack on the rope to work outside of the party lines. Senate Majority Leader John Thune has said that Collins is the “only” Republican who can win in the state, and the Senate Leadership Fund (Thune’s Senate GOP campaign PAC) said this week that it is dumping $42m into Collins’s race to boost her, meaning that Washington has far from given up her seat.\n\nShe’ll be running against powerful anti-Trump headwinds in her home state, where, according to an Economist/YouGov tracking poll, the president’s net approval rating is more than 18 points underwater.\n\nAnd Donald Trump has made very, very clear in recent days that, despite Thune’s insistence to the direct contrary, he actually does not care if Collins wins her seat again this year. His ICE raids in her home state, weeks after a tough vote that comforted Democrats with her drift from GOP doctrine, signal that the president is completely fine with centering an uncomfortable national fight in Collins’s backyard, and giving her opponents ammunition at a very bad time.","summary":"Susan Collins is a barnacle who has clung to her seat for six terms. But Donald Trump is dumping a national issue in her backyard, and giving her opponent a chance to deal with it, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/maine-ice-susan-collins-senate-b2906043.html","image":"https://static.independent.co.uk/2026/01/22/23/34/GettyImages-2255281227.jpg?crop=1024,682.7,x0,y13.7&trim=13,0,14,0&width=1200","video":"https://cdn.jwplayer.com/videos/QfesMdo5-OhrQWqOm.mp4","publish_date":"2026-01-23 00:06:53","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.124},{"id":395164292,"title":"Donald Trump Has Yet Another Hand Bruise — And A Sketchy Excuse","text":"President Donald Trump appeared to have a new bruise on the back of his left hand Thursday during a signing ceremony for his newly formed Board of Peace in Davos, Switzerland.\n\nThe purple, blue and red mark was visible as he addressed world leaders about the new group, which is intended, among other things, to oversee the rebuilding of the Gaza Strip following the war there. Trump didn’t mention the bruise during his address, unlike his recent near-miss with a binder clip.\n\nWhite House press secretary Karoline Leavitt later told reporters that the bruise occurred after the president struck his hand on a corner of the signing table during the event.\n\nMS Now reviewed footage of the event, but was unable to find a moment where Trump bashed his hand. However, photos and videos from the beginning of the event don’t show the bruising on the left hand. In addition, White House officials noted that the bruise did not appear on Trump’s hand during photos taken on Wednesday.\n\nA White House official told Fox News that the president is more prone to bruising because he takes a daily aspirin, a regimen previously disclosed by his physicians. \n\nTrump’s hands have long been a target of interest. Once upon a time, much of the focus was on whether or not they’re “small.”\n\nFormer Florida senator and current Secretary of State Marco Rubio even made jokes about Trump’s hand size during a 2016 presidential debate, saying, “If they’re small, something else must be small.” \n\nMost of the current interest is less about their size and more about their health status. It started last February, when the White House claimed that a bruise on the back of Trump’s right hand was caused by “shaking hands all day, every day.”\n\nIn July, Leavitt offered a different explanation, claiming that a “thorough evaluation” discovered Trump had “chronic venous insufficiency,” and stressed that it was “a benign and common condition” in people over the age of 70.\n\nA month later, Leavitt once again blamed handshaking for a new bruise on Trump’s left hand.\n\nLast month, Trump showed up at a Cabinet meeting with two large Band-Aids on his right hand, but the fact that he appeared to doze off during the meeting got the most attention.\n\nThe White House’s explanations for the bruises have inspired a lot of skepticism ― especially after he had two “routine yearly check-ups” in a single year.\n\nLast month, CNN’s Jake Tapper suggested that there is “something going on with his health that they’re not telling us.”\n\nIn October, Stephen Colbert joked that Trump’s hand injuries were caused by his notorious obsession with McDonald’s.\n\n“Yes, he needs his McDonald’s fresh and piping hot,” Colbert said. “And he apparently pulls his Filet-O-Fish straight out of the fryer, which is why his hand looks like that.”","url":"https://www.huffpost.com/entry/donald-trump-bruise-sketchy-excuse_n_697296c1e4b08d1cc2443895?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/6972973b140000d23964cd6a.jpeg?cache=PR6Mju2D4H&ops=1778_1000","video":null,"publish_date":"2026-01-23 00:06:19","author":"David Moye","authors":["David Moye"],"language":"en","category":"politics","source_country":"us","sentiment":-0.349}]}