{"offset":0,"number":50,"available":11132,"news":[{"id":361382310,"title":"ABC pulls 'Jimmy Kimmel Live' off air 'indefinitely' over Charlie Kirk comments","text":"ABC on Wednesday night pulled the \"Jimmy Kimmel Live!\" late-night show off the air \"indefinitely\" after controversial comments by its host about the killing of conservative activist Charlie Kirk.\n\nThe announcement came hours after the head of the Federal Communications Commission suggested that the broadcast licence of ABCv — which is a subsidiary of Disney — was at risk, and shortly after Nexstar Media Group said its stations affiliated with ABC would \"preempt 'Jimmy Kimmel Live!' for the foreseeable future beginning with tonight's show.\"\n\nA person familiar with the situation told CNBC that Jimmy Kimmel is not fired. That person said that Disney plans to speak with him about what he should say when he goes back on the air.\n\nIn his opening monologue for Monday night's show, Kimmel suggested that Tyler Robinson, the man accused of fatally shooting Kirk last week at a Utah university, was aligned with President Donald Trump's Make America Great Again movement.\n\n\"The MAGA Gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,\" Kimmel said.\n\n\"In between the finger-pointing, there was grieving,\" he added.\n\nAn ABC spokesman on Wednesday night said, \"'Jimmy Kimmel Live' will be pre-empted indefinitely.\"\n\nHours earlier, FCC Chair Brendan Carr told conservative podcaster Benny Johnson that Kimmel's comments were \"truly sick,\" and that there was a \"strong case\" for action against ABC and Disney.\n\n\"This is a very, very serious issue right now for Disney. We can do this the easy way or the hard way,\" Carr said. \"These companies can find ways to take action on Kimmel, or there is going to be additional work for the FCC ahead.\"\n\n\"They have a license granted by us at the FCC, and that comes with it an obligation to operate in the public interest,\" Carr said.\n\nABC's pre-emption of Kimmel's show is the latest dramatic example of a media figure suffering backlash for their public comments about Kirk's assassination.\n\nMSNBC fired political analyst Matthew Dowd last week after he said on-air about the killing that \"hateful thoughts lead to hateful words, which then lead to hateful actions.\"\n\nThe Washington Post fired an opinion columnist, Karen Attiah, after she said there were \"racial double standards\" in social media reactions to Kirk's slaying.\n\nTrump on Wednesday crowed about Kimmel's show being pre-empted, and suggested that NBC cancel its own shows, \"The Tonight Show with Jimmy Fallon,\" and \"Late Night with Seth Myers.\" \n\n\"Great News for America: The ratings challenged Jimmy Kimmel Show is CANCELLED. Congratulations to ABC for finally having the courage to do what had to be done,\" Trump wrote in a Truth Social post.\n\n\"Kimmel has ZERO talent, and worse ratings than even Colbert, if that's possible. That leaves Jimmy and Seth, two total losers, on Fake News NBC. Their ratings are also horrible. Do it NBC!!!\" Trump wrote.\n\nSenate Minority Leader Chuck Schumer condemned ABC's action.\n\n\"America is meant to be a bastion of free speech,\" Schumer, D-N.Y., wrote in a tweet.\n\n\"Everybody across the political spectrum should be speaking out to stop what's happening to Jimmy Kimmel.This is about protecting democracy,\" the senator wrote.\n\nNexstar, which is seeking FCC approval for a $6.2 billion merger with Tegna, in its statement said, \"Nexstar strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets,\" Nextstar said.\n\nAndrew Alford, the president of Nexstar's broadcasting division, said, \"Mr. Kimmel's comments about the death of Mr. Kirk are offensive and insensitive at a critical time in our national political discourse, and we do not believe they reflect the spectrum of opinions, views, or values of the local communities in which we are located.\"\n\n\"Continuing to give Mr. Kimmel a broadcast platform in the communities we serve is simply not in the public interest at the current time, and we have made the difficult decision to preempt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue,\" Alford said.\n\nAlex Sherman\n\nThis is breaking news. Please refresh for updates.","summary":"Jimmy Kimmel suggested that Tyler Robinson, the man accused of killing Charlie Kirk, was aligned with President Donald Trump's MAGA movement.","url":"https://www.cnbc.com/2025/09/17/charlie-kirk-jimmy-kimmel-abc-disney.html","image":"https://image.cnbcfm.com/api/v1/image/108177213-1753461500023-gettyimages-2214501535-177377_MLII4477.jpeg?v=1758149175","video":null,"publish_date":"2025-09-18 00:39:30","author":"Dan Mangan","authors":["Dan Mangan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.111},{"id":361381550,"title":"Brothers testify about box left with them by man accused of trying to assassinate Trump","text":"By DAVID FISCHER\n\nFORT PIERCE, Fla. (AP) — A pair of North Carolina brothers testified Wednesday about a box left with them by a man accused of trying to assassinate President Donald Trump at his Florida golf course last year.\n\nSamuel and Lazaro Plata described in Spanish through translators how Ryan Routh left the container filled with pipes, bullets, wires and other items at Lazaro Plata’s home in Greensboro, North Carolina, in April 2024 — about five months before the alleged attempt.\n\nBoth men have known Routh for about 30 years and had previously worked at his roofing business. They contacted authorities last September after seeing news of Routh’s arrest.\n\nWednesday was the fifth day of testimony in the trial of Ryan Routh, who prosecutors said spent weeks plotting to kill Trump before aiming a rifle through the shrubbery as Trump played golf on Sept. 15, 2024, at his West Palm Beach country club.\n\nRouth has pleaded not guilty to charges of attempting to assassinate a major presidential candidate, assaulting a federal officer and several firearm violations.\n\nU.S. District Judge Aileen Cannon had initially blocked off more than three weeks for trial at the Fort Pierce federal courthouse. But prosecutors have said they should be able to rest their case by Thursday or Friday, and Routh’s witnesses have been subpoenaed to appear by Friday.\n\nBoth brothers testified that they never opened the box until after Routh’s arrest. Lazaro Plata testified that he didn’t have any reason to think there was anything suspicious about Routh leaving the container.\n\nAn FBI agent testified that he found a 12-page letter in the box addressed to “Dear World.” Prosecutors only wanted the first few lines included as evidence.\n\n“This was an assassination attempt on Donald Trump but I failed you,” the handwritten letter said. “I tried my best and gave it all the gumption I could muster. It is up to you now to finish the job; and I will offer $150,000 to whomever can complete the job.”\n\nRouth had asked that the entire letter be allowed into evidence, arguing that the first few lines lacked context. He was specifically interested in a line that referred to shredding Trump’s plane. Routh said the letter doesn’t say anything about a golf course, the location of the alleged attack.\n\nCannon sided with prosecutors, saying the rest of the letter was irrelevant or hearsay.\n\nRouth has indicated he plans to call a firearms expert, as well as two character witnesses. He hasn’t said whether he plans to testify himself. He tried to use the Plata brothers as de facto character witnesses during cross examination, asking questions like, “Did I teach your whole family how to roof and do construction?” and “Have I ever got into a physical fight?”\n\nThe judge gave Routh some leeway but eventually brought the questions to an end.\n\nAlso Wednesday, Ronnie Jay Oxendine testified that he sold Routh the SKS rifle used in the alleged assassination attempt, according to local news outlets. Oxendine was convicted of a weapons charge in July and was testifying against Routh as part of his plea agreement.\n\nRecounting the incident at the Trump International Golf Club, a Secret Service agent testified last week that he spotted Routh before Trump came into view. Routh aimed his rifle at the agent, who opened fire, causing Routh to drop his weapon and flee without firing a shot.\n\nLaw enforcement obtained help from a witness who testified that he saw a person fleeing the area after hearing gunshots. The witness was then flown in a police helicopter to a nearby interstate where Routh was arrested, and the witnesses said he confirmed it was the person he had seen.\n\nJust nine weeks earlier, Trump had survived an attempt on his life while campaigning in Pennsylvania. That gunman had fired eight shots, with one bullet grazing Trump’s ear. The gunman was then fatally shot by a Secret Service counter sniper.","summary":"Both men have known Routh for about 30 years and previously worked at his business.","url":"https://www.bostonherald.com/2025/09/17/trump-shooting-attempt-trial-day-5/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Trump_Shooting_Attempt_35340_2aad3e-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-18 00:04:04","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.627},{"id":361379260,"title":"Trump’s economic magic trick is coming undone","text":"The essence of President Donald Trump’s pitch to the American people last year was simple: they could have it both ways. They could have a powerful, revitalised economy and “mass deportations now”. They could build new factories and take manufacturing jobs back from foreign competitors as well as expel every person who, in their view, didn’t belong in the United States. They could live in a “golden age” of plenty – and seal it away from others outside the country with a closed, hardened border.\n\nTrump told Americans there were no trade-offs. As the saying goes, they could have their cake and eat it, too. Even better, eating the cake would, on its own, produce more cake – no need for new ingredients or the skill, time and labour necessary to make something new.\n\nIn reality, this was a fantasy. Americans could have a strong, growing economy, which requires immigration to bring in new people and fill demand for labour, or they could finance a deportation force and close the border to everyone but a small, select few. It was a binary choice. Theirs could be an open society or a closed one, but there was no way to get the benefits of the former with the methods of the latter.\n\nMillions of Americans embraced the fantasy. Now, about eight months into Trump’s second term, the reality of the situation is inescapable. As promised, Trump began a campaign of mass deportation. Our cities are crawling with masked federal agents, snatching anyone who looks “illegal” to them – a bit of racial profiling that has, for now, been sanctioned by the Supreme Court. The jobs, however, haven’t arrived. There are fewer manufacturing jobs than there were in 2024, thanks in part to the president’s tariffs and, well, his immigration policies.","summary":"The US president promised mass deportations would make Americans more prosperous. It was a fantasy.","url":"https://www.brisbanetimes.com.au/world/north-america/trump-s-economic-magic-trick-is-coming-undone-20250918-p5mw0v.html","image":"https://static.ffx.io/images/$zoom_0.7364567246147153%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_359%2C$y_402/t_crop_custom/q_86%2Cf_auto/d76478098bd1285e3ac896aa0a165e6db524c931","video":null,"publish_date":"2025-09-17 23:57:11","author":"Jamelle Bouie","authors":["Jamelle Bouie"],"language":"en","category":"politics","source_country":"au","sentiment":0.223},{"id":361381586,"title":"Rudy Giuliani is ordered to pay $1.36 million in legal bills","text":"By MICHAEL R. SISAK\n\nNEW YORK (AP) — It’s another blow to Rudy Giuliani’s withered wallet: A judge has ordered the former New York City mayor to pay $1.36 million in legal fees he racked up during investigations into his efforts to overturn President Donald Trump’s 2020 election loss.\n\nJudge Arthur Engoron made the ruling Tuesday in a lawsuit brought by lawyer Robert Costello and the law firm Davidoff Hutcher & Citron LLP. In granting summary judgment for Costello and the firm, Engoron rejected Giuliani’s claim that he never received any bills for legal fees.\n\nWith interest, Giuliani owes nearly $1.6 million. He must also pay lawyer costs that Costello and the firm incurred in fighting to recoup his unpaid legal fees, the judge ruled.\n\nEngoron, a Democrat, is the same Manhattan judge who last year ordered Trump to pay a massive civil penalty after finding that he had engaged in fraud by exaggerating his wealth for decades. The fine ballooned to more than $500 million with interest before an appeals court overturned it last month.\n\nGiuliani’s spokesperson said the ex-mayor will appeal.\n\n“The idea that Judge Arthur Engoron is permitted to sit on a case involving President Donald Trump’s good friend and former personal lawyer, Mayor Rudy Giuliani, flies in the face of justice and demonstrates the partisan political nature of this decision,” Giuliani spokesperson Ted Goodman said.\n\nMessages seeking comment were left for Costello and Davidoff Hutcher & Citron.\n\nThe decision is the latest financial setback for Giuliani, once celebrated as “America’s mayor” for his leadership after the Sept. 11, 2001, attacks.\n\nIn recent years, the Republican has filed for bankruptcy; been threatened with jail for failing to pay money owed to his third ex-wife, Judith; and reached an undisclosed settlement to keep his homes and belongings, including prized World Series rings, after he was ordered to pay $148 million to two former Georgia elections workers he defamed.\n\nLast month, Giuliani, 81, sustained a fractured vertebra and other injuries in a car crash in New Hampshire. Soon after, Trump announced he was awarding Giuliani the Presidential Medal of Freedom, the nation’s highest civilian honor.\n\nCostello and Davidoff Hutcher & Citron LLP sued Giuliani in 2023, accusing him of paying only a fraction of nearly $1.6 million in legal fees for their work representing him in investigations related to his alleged election interference.\n\nGiuliani was disbarred in New York and Washington for repeatedly making false statements about the 2020 election, and he was criminally charged in Georgia and Arizona in connection with efforts to undo Trump’s loss to Democrat Joe Biden. Giuliani has denied wrongdoing.\n\nCostello and the law firm alleged Giuliani paid them just $214,000, leaving a $1.36 million tab. Giuliani’s last payment was $10,000 on Sept. 14, 2023, about a week after Trump hosted a $100,000-a-plate fundraiser for Giuliani at his Bedminster, New Jersey, golf club.\n\nCostello was Giuliani’s lawyer from November 2019 to July 2023. He represented Giuliani in matters ranging from an investigation into his business dealings in Ukraine, which resulted in an FBI raid on his home and office in April 2021, to state and federal probes of his work in the wake of Trump’s 2020 election loss.\n\nCostello and the firm said in their lawsuit that they also helped represent Giuliani in various civil lawsuits filed against him and in disciplinary proceedings that ultimately led to his disbarment. The lawyer and the law firm accused Giuliani of breaching a retainer agreement by failing to pay invoices in full in a timely fashion.\n\nCostello, a former federal prosecutor, has since left Davidoff Hutcher & Citron LLP and was hired last in September 2024 as a lawyer for Republican-controlled Nassau County on Long Island.\n\nLast year, Trump’s lawyers called Costello as a witness at the president’s hush money criminal trial in an effort to attack the credibility of a key prosecution witness, former Trump lawyer and fixer Michael Cohen. Costello irritated the judge, Juan M. Merchan, by making comments under his breath, rolling his eyes and calling called the whole exercise “ridiculous.”","summary":"With interest, Giuliani owes nearly $1.6 million.","url":"https://www.bostonherald.com/2025/09/17/giuliani-legal-fees/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Rudy_Giuliani-Car_Accident_51409_02f9cf.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-17 23:56:36","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.381},{"id":361380632,"title":"Jimmy Kimmel’s ABC Suspension Widely Denounced as Attack on Free Speech: ‘A Wild Overreaction’","text":"Public figures including Ben Stiller, Chris Hayes and California Gov. Gavin Newsrom denounced Jimmy Kimmel’s suspension from ABC on Wednesday, calling it a “wild overreaction” and an attack on free speech.\n\n“This is the most straightforward attack on free speech from state actors I’ve ever seen in my life and it’s not even close,” said MSNBC’s “All In” host Hayes.\n\nEmmy-winning comedian and “The Paper” breakout Alex Edelman quipped, “This is the actual cancel culture everyone claims to hate so much.”\n\nAnd Stiller, meanwhile, said simply, “This isn’t right.”\n\nABC suspended Jimmy Kimmel on Wednesday, “indefinitely” pulling his late night program from the air after the host incorrectly indicated Monday that alleged Charlie Kirk assassin Tyler Robinson was part of a “MAGA gang.”\n\nResponse to the move was swift online, with many in Hollywood, political and media circles saying the decision was infringing on Kimmel’s rights.\n\nGov. Newsom said that the string of such politically triggered instances “aren’t coincidences” and that Donald Trump and his supporters are “censoring you in real time.”\n\nIt didn’t take long for Trump himself to chime in on the development. Soon after the cancellation of “The Late Show With Stephen Colbert” in July, the president took to Truth Social to say, “I hear Jimmy Kimmel is next. Has even less talent than Colbert!” Months later, Trump is celebrating the Kimmel suspension (though, Trump said Kimmel is “CANCELLED”).\n\n“Great News for America: The ratings challenged Jimmy Kimmel Show is CANCELLED,” Trump said on Truth Social Wednesday. “Congratulations to ABC for finally having the courage to do what had to be done. Kimmel has ZERO talent, and worse ratings than even Colbert, if that’s possible. That leaves Jimmy and Seth, two total losers, on Fake News NBC. Their ratings are also horrible. Do it NBC!!! President DJT”\n\nFCC Chairman Brendan Carr, who earlier Wednesday urged ABC to handle the Kimmel situation before the government had to get involved, likewise joined the fray. \n\n“I want to thank Nexstar for doing the right thing,” he said on X. “Local broadcasters have an obligation to serve the public interest. While this may be an unprecedented decision, it is important for broadcasters to push back on Disney programming that they determine falls short of community values. I hope that other broadcasters follow Nexstar’s lead.”\n\nMany pointed to the hypocrisy of Kimmel’s suspension in the wake of Brian Kilmeade’s recent comments on Fox News. The same day as Kirk’s assassination, Kilmeade and co-host Lawrence Jones went on “Fox & Friends,” where they discussed the killing of Iryna Zarutska in Charlotte, North Carolina. \n\n“You can’t give them a choice,” Jones said of the homeless. “Either you take the resources that we’re gonna give you, or you decide that you’re gonna be locked up in jail. That’s the way it has to be now.”\n\n“Or involuntary lethal injection or something,” Kilmeade said. “Just kill ’em.”\n\nWhile Kimmel’s comments bought him a suspension, Kilmeade got off with an apology.\n\nCatch a full roundup of online responses as they come below:\n\n View this post on Instagram","summary":"Ben Stiller, California Gov. Gavin Newsom and MSNBC host Chris Hayes were among the initial voices condemning the move on social media\n\n\nThe post Jimmy Kimmel&#8217;s ABC Suspension Widely Denounced as Attack on Free Speech: &#8216;A Wild Overreaction&#8217; appeared first on TheWrap.","url":"https://www.thewrap.com/jimmy-kimmel-live-abc-suspension-reactions-free-speech-attack/","image":"https://www.thewrap.com/wp-content/uploads/2025/09/Jimmy-Kimmel.jpg","video":null,"publish_date":"2025-09-17 23:56:27","author":"Benjamin Lindsay","authors":["Benjamin Lindsay"],"language":"en","source_country":"US","sentiment":-0.267},{"id":361379422,"title":"Jimmy Kimmel's show pulled off the air after Charlie Kirk comments","text":"The ABC television network said the \"Jimmy Kimmel Live!\" show was to be taken off the air \"indefinitely\" after the host made controversial comments about the assassination of conservative activist Charlie Kirk.\n\nKimmel had suggested that Tyler Robinson, the man arrested for allegedly shooting and killing Kirk, had actually been a supporter of President Donald Trump and the \"Make America Great Again\" movement.\n\n'We have made the difficult decision to pre-empt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue.'\n\n\"The MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,\" Kimmel said during the opening monologue of the show on Monday.\n\n\"In between the finger-pointing, there was grieving,\" he added.\n\nHowever, most of the evidence that has been released from the case has supported the suspicion that Robinson was motivated to allegedly kill Kirk over the activist's opposition to the LGBTQ agenda. Robinson had been in a romantic relationship with a trans-identifying male.\n\nOn Wednesday, Nexstar Media Group announced that the show would be pre-empted indefinitely from the ABC stations they own.\n\n\"Nexstar strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets,\" reads a statement from the company. \n\nSoon afterward, ABC said they had pulled the show from all stations indefinitely.\n\nRELATED: Kimmel, Colbert cry over Trump's election victory: 'It was a terrible night'\n\nNexstar broadcasting division president Andrew Alford called the comments \"offensive and insensitive\" in a statement explaining the company's decision.\n\n\"Continuing to give Mr. Kimmel a broadcast platform in the communities we serve is simply not in the public interest at the current time, and we have made the difficult decision to pre-empt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue,\" he added.\n\nKimmel had also claimed in August that the president was behind the end of \"The Late Show\" that was hosted by Stephen Colbert, a frequent Trump critic.\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"The ABC television network said the \"Jimmy Kimmel Live!\" show was to be taken off the air \"indefinitely\" after the host made controversial comments about the assassination of conservative activist Charlie Kirk.\n\nKimmel had suggested that Tyler Robinson, the man arrested for allegedly shooting and killing Kirk, had actually been a supporter of President Donald Trump and the \"Make America Great Again\" movement.\n\n'We have made the difficult decision to pre-empt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue.'\n\n\"The MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,\" Kimmel said during the opening monologue of the show on Monday.\n\n\"In between the finger-pointing, there was grieving,\" he added.\n\nHowever, most of the evidence that has been released from the case has supported the suspicion that Robinson was motivated","url":"https://www.theblaze.com/news/jimmy-kimmel-pulled-charlie-kirk","image":"https://www.theblaze.com/media-library/jimmy-kimmel-s-show-pulled-off-the-air-after-charlie-kirk-comments.jpg?id=61615173&width=1200&height=600&coordinates=0%2C166%2C0%2C166","video":null,"publish_date":"2025-09-17 23:55:00","author":"Carlos Garcia","authors":["Carlos Garcia"],"language":"en","source_country":"US","sentiment":-0.424},{"id":361381562,"title":"House turns back effort to censure Rep. Ilhan Omar over remarks about Charlie Kirk","text":"By LISA MASCARO\n\nThe House declined late Wednesday to punish one of its own over commentary in the aftermath of Charlie Kirk’s assassination, but the effort showed the reach of President Donald Trump’s push for political retribution and set the stage for more to come.\n\nThe 214-213 roll call shelved a resolution from GOP Rep. Nancy Mace of South Carolina to censure Democratic Rep. Ilhan Omar of Minnesota and have her removed from two House committees: Education and the Workforce, and Budget. The two have feuded viciously on social media.\n\nMace has said Omar, an immigrant who criticized Kirk’s views of gun ownership and race relations in the aftermath of George Floyd’s 2020 death in Minneapolis, should be deported to her home country of Somalia.\n\nOmar said Mace is pushing a false narrative to raise money “and boost her run for Governor.”\n\n“Is this what civility looks like in the Republican-controlled House of Representatives?” implored Democratic Leader Hakeem Jeffries.\n\n“We live in an era of intense political violence as we have seen with the recent assassinations of Speaker Emerita Melissa Hortman and Turning Point USA founder Charlie Kirk,” he said, referring to the shooting of lawmakers in Minnesota.\n\nThe legacy of Kirk’s personal and political influence runs wide and deep on Capitol Hill — House Speaker Mike Johnson is among those who considered the young conservative leader a friend — and, in the week since Kirk was assassinated, he has been memorialized in ways large and small.\n\nA candlelight vigil was held late Monday evening inside the Capitol’s Statuary Hall, and a House resolution in his honor is expected to be swiftly approved. One lawmaker, Rep. Anna Paulina Luna, R-Fla., who wrote that she owes “my entire political career to Charlie Kirk,” is seeking to place a statue of Kirk in the Capitol “to honor his legacy.”\n\nAt the same time, Republicans have unleashed a series of legislative proposals echoing Trump’s call for action against what he characterizes as the “radical left” — those challenging his views, and those of the slain conservative leader.\n\nRep. Chip Roy of Texas to set up a select committee to conduct a “full scale investigation of the coordinated network of leftists attacking us.”\n\nGOP Sen. Ted Cruz of Texas has promoted his bill to add rioting to the list of prosecutable offenses under racketeering laws, and GOP Sen. Mike Lee of Utah wants Congress to revive a Cold War-era law that would “prohibit the U.S. government from engaging in domestic, political propaganda.” He’s calling it the Charlie Kirk Act.\n\nGOP Rep. Buddy Carter of Georgia, offered another resolution focused on reprimanding Omar, while Mace also proposed the Education Department strip federal funding from schools that fail “to act against staff who excuse or glorify the murder of Charlie Kirk.”\n\nMany of those putting forward the proposals, including Roy, Carter and Mace, are all running for higher office in their states, showing the importance of carrying Trump’s message to their broader base of voters and supporters.\n\n“In the wake of Charlie Kirk’s assassination, policymakers must do all they can to stop radical left-wing violence,” wrote the Heritage Foundation’s political arm, Heritage Action, in supporting Roy’s proposal for a new committee to delve into “the forces behind the radical left’s assault on America.”\n\nIt’s not the first time Congress has taken action against Omar or other lawmakers.\n\nIn 2023, Omar was stripped of her assignment to the House Foreign Affairs Committee, and the last Congress set a new standard for meting out censures and punishments.\n\nThis time, when Mace offered her resolution to go after Omar, Democratic Rep. Greg Casar of Texas put up a swift response: A counter-effort to reprimand Republican Rep. Cory Mills of Florida with a censure over allegations involving his personal and professional conduct.\n\nMills was among four Republicans to join Democrats in rejecting the resolution against Omar.\n\nMore recently, the House appears to have been cooling these efforts. Lawmakers rejected a resolution to censure Rep. LaMonica McIver, D-N.J., and remove her from a committee assignment as she faces federal charges stemming from a visit to an immigration detention facility.","summary":"Republicans want investigations into various groups and entities in the aftermath of Kirk's slaying.","url":"https://www.bostonherald.com/2025/09/17/charlie-kirk-congress/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/School_Shooting_Minneapolis_62736.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-17 23:40:24","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.13},{"id":361381060,"title":"Apple explores test production of foldable iPhones in Taiwan","text":"Apple has held discussions with suppliers for a possible test production of foldable iPhones in Taiwan, aiming to mass produce the device in India for release in 2026, the Nikkei said on Thursday.\n\nThe iPhone maker is targeting to produce about 95 million phones in its next lineup coming in 2026, an over 10% rise from this year, the report said, citing sources. Apple believes that releasing a long-awaited foldable model could be key to reaching the goal.\n\nThe talks aim to tap the engineering resources and ecosystem of Apple suppliers in Taiwan to build a mini pilot line for equipment testing and fine-tuning the parameters and manufacturing steps for making a foldable iPhone, the Nikkei report said.\n\nOnce steps are figured out, the process would be replicated in India to mass-produce the phones, according to the report. Suppliers have identified a potential site in a northern Taiwanese city for the mooted pilot line.\n\nApple did not immediately respond to a Reuters request for comment on the report.\n\nAt its annual product launch event earlier this month, Apple introduced an upgraded line of iPhones, alongside a slimmer iPhone Air, and held prices steady amid President Donald Trump’s tariffs that have hurt the company’s profit.","summary":"Apple has held discussions with suppliers for a possible test production of foldable iPhones in Taiwan, aiming to mass produce the device in India for release in 2026, the Nikkei said on Thursday.","url":"https://www.staradvertiser.com/2025/09/17/breaking-news/apple-explores-test-production-of-foldable-iphones-in-taiwan/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/web1_2025-09-17T204902Z_211875699_RC2MOGA55310_RTRMADP_3_APPLE-PRODUCTION-CHINA.JPG","video":null,"publish_date":"2025-09-17 23:40:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":-0.468},{"id":361379944,"title":"Jimmy Kimmel Live pulled ‘indefinitely’ for joke about Charlie Kirk’s killer after FCC threat","text":"Disney and ABC have pulled Jimmy Kimmel Live! off air “indefinitely” after FCC chairman Brendan Carr threatened to pull the broadcast licenses of any station that aired his show over comments Kimmel made about the man charged with killing Charlie Kirk. \nThe decision, according to Variety, was made after television giant Nexstar announced that its local ABC affiliates would pre-empt airings of Jimmy Kimmel Live!, just hours after Carr issued that threat. Nexstar is one of the biggest owners of television stations across the country. We’ve reached out to the FCC for comment on what specifically is objectionable from Kimmel’s show and which FCC regulations he may have violated.\nNexstar is also waiting on Carr to approve a pending $6.2 billion merger with rival broadcaster Tegna, according to comments made by CEO Perry Sook during a recent investment call. \nEarlier today, Carr suggested to MAGA influencer Benny Johnson earlier today that he would consider pulling the broadcast licenses of television stations that air ABC, after late night host Jimmy Kimmel claimed on his show that the “MAGA gang” was “trying to desperately categorize this kid who murdered Charlie Kirk as anything other than one of them”.\nIn the interview, which Johnson posted on X, Carr also offered ABC and its parent company Disney an easier way out: punish Kimmel themselves.\n“This is a very, very serious issue right now for Disney. We can do this the easy way or the hard way,” he said. “These companies can find ways to take action on Kimmel or there is going to be additional work for the FCC ahead. They have a license granted by us at the FCC, and that comes with it an obligation to operate in the public interest.”\nCarr, a Trump appointee, has spent his tenure at the FCC attacking legacy media outlets for alleged bias against conservatives, regularly threatening to pull broadcast licenses over coverage he dislikes. He’s exploited the FCC’s merger approval process to gain leverage over entertainment companies, particularly Paramount and Skydance, who agreed to let a “bias” watchdog scrutinize the programming they aired. Carr also previously threatened to investigate Disney for its diversity policies.\nDuring the manhunt for Kirk’s killer last week, heated speculation arose over possible ideological motives. While Republicans immediately asserted the shooter was on the political left, online speculation over the weekend suggested Robinson might be tied to the far-right groyper movement that had long harassed Kirk — a trend that Kimmel brought up briefly in his monologue on Tuesday night.\n“We had some new lows over the weekend with the MAGA gang trying to desperately categorize this kid who murdered Charlie Kirk as anything other than one of them,” said Kimmel, who then moved on to discuss President Donald Trump’s Friday press conference. \nJohnson characterized the comment in an X post as Kimmel “claiming Charlie Kirk’s assassin was a MAGA Conservative.” Carr told him that was enough for the FCC to work with. “There are calls for Kimmel to be fired,” Carr added later. “I think you could certainly see a path forward for suspension over this.”\nThe previous day, Carr had opposed Attorney General Pam Bondi’s recent call to distinguish “free speech” from “hate speech” and prosecute the latter, part of a larger Republican attempt to classify criticism or mockery of Kirk as unlawful. “I think you can draw a pretty clear line, and the Supreme Court has done this for decades, that our First Amendment, our free speech tradition, protects almost all speech,” he said at a summit hosted by Politico.\nSo speech about Kirk flies on the internet, apparently. But broadcast TV is subject to greater government oversight thanks to the FCC’s licensing of spectrum. Kimmel’s comment, Carr claimed, fell under the offense of “news distortion”, which he said was enough to pull the license of stations that broadcast it.\n“We have a rule on the books that interprets a public interest standard that says news distortion is something that is prohibited. Likewise, we have a rule that addresses broadcast hoaxes, and so again, over the years, the FCC has stepped back from enforcing it, and I don’t think it’s been to the benefit of anybody. Just look at the credibility of these legacy media,” Carr said. (Pulling station licenses for airing a late-night show would be virtually unprecedented — it’s a penalty that’s been used rarely in egregious circumstances.) \nDisney itself doesn’t hold a broadcast license, so Carr issued his clearest threats to local ABC affiliates. “Disney needs to see some change here, but the individual licensed stations that are taking [Disney’s] content, it’s time for them to step up and say this, you know, garbage — to the extent that that’s what comes down the pipe in the future — isn’t something that we think serves the needs of our local communities,” he said.\nNexstar needs the FCC to loosen regulatory restrictions in order to proceed with its proposed merger with Tegna, which would make it the largest owner of broadcast stations in the country. Under current FCC rules, a single company cannot directly own television stations that reach more than 39 percent of American viewers. The merger would bring it to 80 percent.\nIn an investor conference call last month, Newscast Studio reported that Sook expressed his belief that Carr and the Trump administration would repeal those rules for them. “We feel very, very positive about moving forward with the regulatory approval process,” Sook said. “We’re meeting this deregulatory moment where it is, and we will work together with regulators as they consider modifying and repealing outdated rules and regulations.”\nEarlier, Carr noted all the other media outlets he’d threatened with legal recourse were now doing amazing jobs at complying with being fairer to conservatives. \n“I mean, look, NPR has been defunded. PBS has been defunded. [Stephen] Colbert is retiring. Joy Reid is out at MSNBC,” Carr crowed. “Terry Moran is gone from ABC and is now admitting that they are biased. CBS has now made some commitments to us that they’re going to return to more fact based journalism, and so I think you see some lashing out from people like Kimmel, who are frankly talentless and are looking for ways to get attention.”","summary":"Disney and ABC have pulled Jimmy Kimmel Live! off air “indefinitely” after FCC chairman Brendan Carr threatened to pull the broadcast licenses of any station that aired his show over comments Kimmel made about the man charged with killing Charlie Kirk.  The decision, according to Variety, was made after television giant Nexstar announced that its [&#8230;]","url":"https://www.theverge.com/news/780471/disney-abc-jimmy-kimmel-live-charlie-kirk","image":"https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/gettyimages-2235240617.jpg?quality=90&strip=all&crop=14.6,0.88605842447736,75.8,58.606656697543","video":null,"publish_date":"2025-09-17 23:32:03","author":"Tina Nguyen","authors":["Tina Nguyen"],"language":"en","category":"politics","source_country":"us","sentiment":0.034},{"id":361377168,"title":"Jimmy Kimmel Live pulled off air indefinitely by ABC over controversial host's Charlie Kirk comments","text":"Controversial late-night talk show host Jimmy Kimmel has been pulled off the air 'indefinitely' by ABC over his divisive comments regarding the assassination of Charlie Kirk. \n\nThe veteran host's Jimmy Kimmel Live! will be removed from the network 'for the foreseeable future,' a spokesperson announced on Wednesday. \n\nThis drastic move comes after Kimmel, 57, shared a controversial statement about Kirk's murder suspect Tyler Robinson, 22, insinuating he was a conservative. \n\nHowever, investigators say Robinson held far-left ideologies and was dating his transgender roommate.\n\nThe TV personality's unproven suggestion that Robinson was a proponent of the MAGA movement caught instant flak from Federal Communications Commission boss Brendan Carr. \n\nOn Wednesday, Carr told conservative podcaster Benny Johnson he was considering an investigation into Kimmel and his network ABC over the jarring remarks. \n\n'When you look at the conduct that has taken place by Jimmy Kimmel, it appears to be some of the sickest conduct possible,' Carr told Johnson.\n\n'As you've indicated, there are avenues here for the FCC, so there... are some ways in which I need to be a little bit careful because we could be called ultimately to be a judge on some of these claims that come up.'\n\nKimmel's comments about Robinson came during his Monday night monologue.\n\n'We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it,' the host said. \n\nJimmy Kimmel Live! has been a network staple for more than 22 years. \n\nIn response to Kimmel's remarks, Carr floated the idea of suspending the host - one of several prospective 'remedies' for the situation, he said. \n\nAt one point, Johnson asked Carr what kind of action he thought should be taken, proposing an on-air apology from Kimmel.\n\n'I think what you said there strikes me as a very reasonable, minimal step that can be taken,' Carr replied. \n\nABC's decision to pull the show came shortly after its affiliate group, Nexstar, also announced it would stop airing it effective immediately. \n\n'Nexstar strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets,' the company wrote on Wednesday. \n\nNexstar’s broadcasting division President Andrew Alford blasted Kimmel's comments as 'offensive and insensitive' in the wake of the Turning Point USA co-founder's gory assassination, which occurred at a Utah Valley University rally on September 10. \n\nSoon after the Donald Trump ally, 31, was fatally shot in the neck on the Orem campus - in front of an audience of 3,000 horrified spectators - Kimmel reacted to his death online. \n\n'Instead of the angry finger-pointing, can we just for one day agree that it is horrible and monstrous to shoot another human?' Kimmel wrote.\n\n'On behalf of my family, we send love to the Kirks and to all the children, parents and innocents who fall victim to senseless gun violence.'\n\nBut he seemingly changed his tune during the Monday night monologue that ultimately got his show pulled. \n\nIn reaction to Nextstar's move to axe Kimmel, both Johnson and Carr posted celebratory sentiments on X.","summary":"Controversial late-night talk show host Jimmy Kimmel has been suspended by ABC over his divisive comments regarding the assassination of Charlie Kirk.","url":"https://www.dailymail.co.uk/news/article-15109273/Jimmy-Kimmel-Live-suspended-Charlie-Kirk-comments.html","image":"https://i.dailymail.co.uk/1s/2025/09/18/00/102234439-0-image-a-23_1758150706009.jpg","video":null,"publish_date":"2025-09-17 23:31:45","author":"Editor,Sonya Gugliara","authors":["Editor","Sonya Gugliara"],"language":"en","source_country":"gb","sentiment":-0.098},{"id":361384940,"title":"DNC Launches College Voter Registration Push Days After Charlie Kirk Assassination at UVU Campus","text":"Less than a week after Turning Point USA founder Charlie Kirk was horrifically assassinated at Utah Valley University, Democrats decided to launch a voter registration push on college campuses across the country.\n\nThe Democratic National Committee (DNC) on Monday announced an initiative for National Voter Registration Week of Action, which will include 50 events across 27 states and at least 30 colleges campuses in red and blue states, as well as farmers’ markets and stadium events.\n\n“…Democrats are meeting new voters where they are and building the Democratic infrastructure we need to win up and down the ballot in 2025, 2026, and beyond,” the DNC said in a press release. \n\nThe initiative is the “first time in years” the DNC has directly supported voter registration events around National Voter Registration Day, according to NewsNation\n\n“It comes as the DNC has fallen behind the Republican Party in registering voters. The New York Times recently reported the GOP registered 4.5 million more voters than Democrats between the 2020 and 2024 elections, within the 30 states that keep voter registration records by political party,” per the report. \n\nDNC officials told the outlet some of the events this week will have increased security following the assassination of Kirk, and after a false bomb threat at DNC’s D.C. headquarters on September 11. \n\nDNC Chair Ken Martin released a video to X on Wednesday condemning the assassination of Kirk as a “despicable cowardly act” before blaming President Donald Trump for inflaming political tensions. \n\nKirk, 31, was shot and killed on September 10 during the first stop of his “American Comeback Tour” at Utah Valley University. The conservative firebrand and devout follower of Jesus Christ is survived by his wife Erika and his two young children. \n\nThe suspect in Kirk’s assassination has been arrested and identified as 22-year-old Tyler Robinson. Authorities have since uncovered that Robinson was a radical leftist who was in a romantic relationship with a man who identifies as transgender.\n\nKirk has been largely credited with using his massive grassroots organization to mobilize the youth vote for Donald Trump in the 2024 presidential election, with exit polls showing tremendous rightward-shift among Gen-Z voters.","summary":"Less than a week after Turning Point USA founder Charlie Kirk was horrifically assassinated at Utah Valley University, Democrats decided to launch a voter registration push on college campuses across the country. \n\n\nThe post DNC Launches College Voter Registration Push Days After Charlie Kirk Assassination at UVU Campus appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/17/dnc-launches-college-voter-registration-push-days-after-charlie-kirk-assassination-at-uvu-campus/","image":"https://media.breitbart.com/media/2025/09/Trent-Nelson_The-Salt-Lake-Tribune_Getty-Images-640x335.jpg","video":null,"publish_date":"2025-09-17 23:31:31","author":"Katherine Hamilton","authors":["Katherine Hamilton"],"language":"en","source_country":"US","sentiment":0.036},{"id":361382444,"title":"In Britain, Trump basks in a display of regal splendor with King Charles III at Windsor Castle (World)","text":"President Donald Trump relished the glow of a British royal spectacle as he opened a two-day state visit Wednesday, calling the hours of pageantry with King Charles III “one of the highest honors of my life” while also making time for a quiet tribute at Queen Elizabeth II’s tomb.\n\nThe grandeur-loving president soaked up all the revelry, from the largest guard of honor in living memory — with 120 horses and 1,300 troops — to carriage rides, an air show and a Windsor Castle state dinner.\n\nAfter the pomp comes the real work Thursday, when Trump and British Prime Minister Keir Starmer meet to talk trade, technology and geopolitical issues.\n\nNo U.S. president, or any other world leader, has had the honor of a second U.K. state visit; Trump's first was in 2019, during his previous term. The display of regal splendor was meant to bolster ties with Trump at a time when his America First policies are putting pressure on trade and security arrangements around the globe.\n\n“This was the second state visit, and that’s the first, and maybe that’s going to be the last time, I hope it is actually,” Trump joked during the evening banquet.\n\nThe visit began with Prince William and his wife, Kate, meeting the presidential helicopter in the private Walled Garden on the vast Windsor estate, then walking Trump and first lady Melania Trump over to be greeted by Charles and Queen Camilla. A gigantic royal standard, the flag used for official celebration days, flew from the Royal Tower.\n\nThe guests traveled to the castle in a procession of horse-drawn carriages, past ranks of soldiers, sailors and aviators. The king and the Republican president chatted in the Irish State Coach during the short journey to the castle quadrangle, where both inspected an honor guard of soldiers in red tunics and bearskin hats.\n\nThey continued to chat and joke as the day progressed, with the king occasionally putting his hand on Trump’s back. The president stepped in front of Charles during a review of troops after the king gestured for him to do so. The king's invitation avoided a violation of protocol, which was not the case in 2019, when Trump stepped in front of Queen Elizabeth.\n\nPart of the day was spent at St. George’s Chapel on the castle grounds, where Trump placed a wreath in honor of Elizabeth, who died in 2022.\n\nA full day of pomp and circumstance\n\nThe president and Charles toured the Royal Collection Display in an ornate room where officials laid out five tables of artifacts on U.S.-British relations.\n\nAmong the items were 18th-century watercolors and documents on the United States seeking independence from King George III. There were materials from the first trans-Atlantic cable, including messages between Queen Victoria and President James Buchanan, as well as a 1930s hot dog picnic that a young Elizabeth wrote about, and a large glass vessel that President Dwight D. Eisenhower gave the queen during a 1957 state visit.\n\nThe president later walked a red carpet on the castle's East Lawn to watch the Beating Retreat, a military parade ceremony that featured 200-plus musicians, dates to the 1600s and was once used to call patrolling soldiers back to their castle at day's end.\n\nA scheduled flyover by F-35 jets from the U.K. and U.S. militaries was scrapped because of poor weather conditions. But the Red Arrows, the Royal Air Force’s aerobatics display team, thundered overhead, leaving streaks of red, white and blue smoke in their wake.\n\nCharles and Camilla presented the president and first lady with a handbound leather volume celebrating the 250th anniversary of the Declaration of Independence, as well as the Union flag that flew above Buckingham Palace on the day of Trump’s inauguration in January. The royals also gave first lady Melania Trump a silver and enamel bowl and a personalized handbag by British designer Anya Hindmarch.\n\nTrump gave Charles a replica of an Eisenhower sword, and Camilla received a vintage Tiffany & Co. gold, diamond and ruby brooch.\n\nSerious talks coming\n\nThe history, tradition and celebrity of the royal family give it a cachet that means presidents and prime ministers covet joining them. In his talks with Trump, Starmer will promote a new U.K.-U.S. technology agreement. The British government hopes the deal, and billions in investment from U.S. tech companies, will help show that the trans-Atlantic bond remains strong despite differences over Ukraine, the Middle East and the future of NATO.\n\nAhead of the banquet, Trump and Charles walked together, leading a procession. Trump wore white tie, while his wife was in a yellow gown. Charles was in white tie with a blue sash, and Camilla in a blue gown with a tiara.\n\nBeefeaters in traditional red uniforms and ruff collars lined the entrance to the castle’s St. George’s Hall for the dinner, which featured 100 staff members attending to 160 guests. The grand Waterloo table was set with 1,462 pieces of silver sparkling in the light from 139 candles and elaborate floral arrangements handpicked from the castle grounds.\n\nThe guests included Apple’s Tim Cook, Nvidia CEO Jensen Huang, Open AI’s Sam Altman and golfer Nick Faldo. Also appearing was publishing mogul Rupert Murdoch, whom Trump recently sued for $10 billion over The Wall Street Journal's report on a sexually suggestive letter purportedly written by Trump for disgraced financier Jeffrey Epstein.\n\nThe menu featured Hampshire watercress panna cotta with Parmesan shortbread and quail egg salad, along with Norfolk chicken ballotine. Dessert was vanilla ice cream bombe with a raspberry sherbet interior and lightly poached Victorian plums.\n\nTrump avoids alcohol, but the bar offerings included a cocktail known as a trans-Atlantic whiskey sour infused with marmalade, Warre’s 1945 Vintage Port — Trump is the 45th and 47th American president — and Hennessy 1912 cognac Grande Champagne. That was the year Trump’s mother, Mary Anne MacLeod, was born in Scotland.\n\nThe musical playlist included the theme from the James Bond movies and pop and rock staples, as well as top show tunes, often featured at Trump’s campaign rallies.\n\nIn his toast, Charles saluted Trump’s British roots and his recent visits to the U.K. In a nod to the president’s favorite sport, he said, “I understand that British soil makes for rather splendid golf courses.”\n\nTrump mostly stuck to his prepared remarks and was on his best behavior, declaring, “This is truly one of the highest honors of my life” and sneaking in only one dig about his predecessor, Democratic President Joe Biden, by saying the U.S. was “sick” a year ago. He also touched on Britain's contributions to literature, history and the arts and said “special” does not begin to do justice to his country's relationship with the U.K.\n\n“Together we’ve done more good for humanity than any two countries in all of history,” Trump said.\n\nTrump being in Windsor doesn't stop protests\n\nThousands of demonstrators marched through central London on Wednesday to protest Trump’s visit. Some held banners that said “No to the racism, no to Trump.” Though the activities were smaller than during Trump's visit in June 2019, they included mini versions of the giant Trump baby blimp, an orange-tinted caricature of the president in a diaper that made a big impression during those demonstrations six years ago.\n\nIn Windsor, protesters projected an image of Trump and Epstein on a tower at the castle, a reminder of the president’s relationship with the late American financier. Police said they arrested four people.","summary":"President Donald Trump relished the glow of a British royal spectacle as he opened a two-day state visit Wednesday, calling the hours of pageantry with King Charles III &ldquo;one of the highest honors of my life&rdquo; while also making time for a quiet tribute at Queen Elizabeth II&rsquo;s tomb.\n...","url":"https://www.castanet.net/news/World/572982/In-Britain-Trump-basks-in-a-display-of-regal-splendor-with-King-Charles-III-at-Windsor-Castle","image":"https://www.castanet.net/content/2025/9/946bca88007e14071e17b8521fc3e22efb070b2b6c98f3493d5e569e7f258a74.jpg","video":null,"publish_date":"2025-09-17 23:28:00","author":"Danica Kirka","authors":["Danica Kirka"],"language":"en","source_country":"ca","sentiment":0.148},{"id":361378066,"title":"Borg discusses cocaine, overdoses, quitting tennis in memoir, AP interview","text":"“Stupid decision to be involved with this kind of thing. It really destroys you,” he told the AP about drugs. “I was happy to get away from tennis, to get away from that life. But I had no plan what to do. … I had no people behind me to guide me in the right direction.”\n\nBorg name-drops Trump, Arafat, Warhol, Hefner, Tina Turner in his memoir\n\nIn all, Borg paints the picture of quite a life.\n\nThere was a water-skiing shoulder injury before 1977 U.S. Open. Death threats during the 1981 U.S. Open. Getting paid in cash … and getting robbed at gunpoint. A woman claiming he was the father of her son. Coin-throwing by spectators in Rome that led him to never return.\n\nThis is not the typical sports autobiography: There is a reference to getting a message to Yasser Arafat and, five pages later, the phrase “Andy Warhol was someone easy to like” appears. There are name-drops of Donald Trump, Nelson Mandela, Tina Turner and “my old friend Hugh Hefner,” among many, many others.\n\n“People will be very surprised what really happened,” Borg told the AP. “For me to come out (after) all these years, all I went through — I went through some difficult times — (it’s) a relief for me to do this book. I feel so much better. … No secrets anymore.”","summary":"Björn Borg starts his new memoir, &#8220;Heartbeats,&#8221; with a story about being rushed to a Dutch hospital in the 1990s after overdosing on &#8220;alcohol, drugs, pills &#8212; my preferred ways of self-medication,&#8221; and the Swedish tennis great closes it by revealing that he was diagnosed with prostate cancer. &#8220;It&#8217;s good,&#8221; Borg, 69, said in a [&#8230;]","url":"https://torontosun.com/sports/tennis/borg-discusses-cocaine-overdoses-quitting-tennis-in-memoir-ap-interview","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/09/Björn-Borg-AP-Interview-Tennis.jpg?quality=100&strip=all","video":null,"publish_date":"2025-09-17 23:27:47","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"CA","sentiment":0.001},{"id":361384914,"title":"ABC, Disney, Nexstar Pull Jimmy Kimmel Over TV Host's Comments on Charlie Kirk Assassination","text":"ABC, Disney, and broadcast affiliate Nexstar are pulling Jimmy Kimmel from all of their stations in response to the left-wing TV host’s shocking remarks about the assassination of Turning Point USA founder Charlie Kirk. Kimmel’s comments are “offensive and insensitive at a critical time in our national political discourse,” Nexstar said, stressing its desire to “move toward the resumption of respectful, constructive dialogue.”\n\nABC and Disney’s ABC said Jimmy Kimmel Live! will be “pre-empted indefinitely” following the late-night television host’s Monday monologue about Charlie Kirk, a spokesperson told NBC News.\n\nNexstar Media Group also announced on Wednesday that “the company’s owned and partner television stations affiliated with the ABC Television Network will preempt Jimmy Kimmel Live! for the foreseeable future beginning with tonight’s show.”\n\n“Nexstar strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets,” the company added in its statement.\n\nAndrew Alford, President of Nexstar’s broadcasting division, said that Kimmel’s “comments about the death of Mr. Kirk are offensive and insensitive at a critical time in our national political discourse, and we do not believe they reflect the spectrum of opinions, views, or values of the local communities in which we are located.”\n\n“Continuing to give Mr. Kimmel a broadcast platform in the communities we serve is simply not in the public interest at the current time, and we have made the difficult decision to preempt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue,” Alford added.\n\nAs Breitbart News reported, FCC Chairman Brendan Carr threatened action against Kimmel, as well as Disney and ABC, after the TV host said that Kirk’s assassin may have been part of the “MAGA gang” and mocked President Donald Trump’s responses to Kirk’s murder, which included ordering American flags flown at half-staff.\n\nAs Breitbart News reported, Kirk’s suspected assassin, Tyler Robinson, left behind a message for his transgender roommate and partner, in which he admitted shooting the Turning Point USA founder and said, “I had enough of his hatred.”\n\nFox News host Greg Gutfeld reacted to Kimmel’s incendiary remarks, stating that the late-night television host is “done” for.\n\n“He didn’t imply it. He said it,” Gutfeld said of Kimmel. “I might have to watch Kimmel tonight to see what he has to say about this, because if he doesn’t address what he did, he’s done.”\n\n“This is a great case study, though, of cognitive dissonance,” he added. “You know, how can such a smart, successful man be so wrong? How can he live in this kind of denial? It’s because he knows he’s wrong.”\n\n“And if you strip that away, what’s left? If you wrestle him away from this delusion that he’s stuck with for years about Trump supporters, about Trump, about Republicans in general, what’s left, what’s underneath that. The realization that you are the bad guy in the movie,” Gutfeld said.\n\n“You’re not a defender of democracy. You’re a defender of destructive delusions,” Gutfeld added. “I mean, I hate to tell you, buddy, but the guy who shot and killed Charlie Kirk was more likely a fan of yours than he was MAGA.”\n\nAlana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.","summary":"ABC, Disney, and broadcast affiliate Nexstar are pulling Jimmy Kimmel from all of their stations in response to the left-wing TV host's shocking remarks about the assassination of Turning Point USA founder Charlie Kirk. Kimmel's comments are \"offensive and insensitive at a critical time in our national political discourse,\" Nexstar said, stressing its desire to \"move toward the resumption of respectful, constructive dialogue.\"\n\n\nThe post ABC, Disney, Nexstar Pull Jimmy Kimmel Over TV Host&#8217;s Comments on Charlie Kirk Assassination appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/17/abc-disney-nexstar-pull-jimmy-kimmel-over-tv-hosts-comments-on-charlie-kirk-assassination/","image":"https://media.breitbart.com/media/2025/09/Jimmy-Kimmel-640x335.jpeg","video":null,"publish_date":"2025-09-17 23:23:39","author":"Alana Mastrangelo","authors":["Alana Mastrangelo"],"language":"en","source_country":"US","sentiment":-0.32},{"id":361376408,"title":"Three Officers and Suspect Die in Pennsylvania Shooting","text":"Support Our Cause\n\nSupport Our Cause\n\n Search for:\n\n HomeLocal newsThree Officers and Suspect Die in Pennsylvania Shooting\n\nLocal news \n\nThree Officers and Suspect Die in Pennsylvania Shooting\n\n \n\n Up next \n\n \n\n \n\nNew Rules: COVID Vaccines Might Now Need a Prescription\n\n Published on 18 September 2025\n\n Internewscast \n\nthree \n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\nIE 11 is not supported. For the best experience, please visit our site using a different browser.\n\nNow Playing\n\nThree officers killed, suspect dead in Penn. shooting\n\nPresident Trump’s unprecedented second state visit\n\nWhy CDC employees are afraid under RFK Jr.’s leadership\n\nThis group says it can help reduce hate-fueled violence\n\nVideo statement shared after Black student found hanging\n\nBody found in car registered to singer D4vd identified\n\nFederal Reserve cuts interest rates by 0.25%\n\nPatel struggles to recall Charleston church shooting\n\nSpirit flight warned to avoid Air Force One’s path\n\nBurglar in scuba gear seen on camera in Disney Springs\n\n‘No absolute First Amendment right to say anything’\n\nShapiro: ‘Call out political violence’\n\nMonarez: RFK Jr. accused CDC of ‘killing children’\n\nMonarez says RFK Jr. wanted to change vaccine schedule\n\nShe says RFK Jr. directed her not to speak to Congress\n\nMan narrowly avoids being hit by speeding car\n\nCassidy questions why tide changed on CDC director\n\nFormer CDC director testifies on why she was fired\n\nFormer CDC director testifies weeks after her firing\n\nGaza City siblings return rubble of their home\n\nThree officers killed, suspect dead in Penn. shootingSept. 17, 2025\n\nNow Playing\n\nThree officers killed, suspect dead in Penn. shooting\n\nPresident Trump’s unprecedented second state visit\n\nWhy CDC employees are afraid under RFK Jr.’s leadership\n\nThis group says it can help reduce hate-fueled violence\n\nVideo statement shared after Black student found hanging\n\nBody found in car registered to singer D4vd identified\n\nNightly News\n\nNightly News\n\nNightly News\n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\n You May Also Like \n\n \n\nLocal news \n\nZelenskyy: Ukraine Anticipates $3.5 Billion in US Military Aid to Support Resistance Against Russia \n\n KYIV – Ukraine anticipates that by next month, a fund will have…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nCleveland Public Library Loses $400,000 in Payment Diversion Scheme \n\n Scams can strike any of us without warning. Recently, the Cleveland Public…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nSources Report: Five Officers Shot in Pennsylvania Incident, Three Critically Injured \n\n Five police officers were shot in York County, Pennsylvania, on Wednesday afternoon,…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nGeorgia Governor Brian Kemp Responds to Hyundai Facility Investigation \n\n ATLANTA () — During a groundbreaking event for a new Rivian plant…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nIndiana Man Arrested for Allegedly Abusing Cat on Camera, According to Court Documents \n\n MUNCIE, Ind. — A Muncie man was arrested after he allegedly harmed…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\n“Tampa Bay Firearm Instructors Discuss How Open Carry Laws Impact You” \n\n Residents in Florida are being advised by gun instructors to become familiar…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nRecent Developments: Trump’s State Visit to the UK \n\n WINDSOR – U.S. President Donald Trump is visiting the United Kingdom for…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nPilot reprimanded for approaching Air Force One too closely: ‘Stay Alert’ \n\n (The Hill) — A Spirit Airlines pilot received a warning from air…\n\nInternewscast\nSeptember 17, 2025\n\nWCSO Seeks Man Wanted for Felony Offenses \n\n Courtesy of the WCSO WASHINGTON COUNTY, Tenn. (WJHL) — Authorities in Washington…\n\nInternewscast\nSeptember 17, 2025\n\nWho Has Secured a Spot in the 2026 World Cup in the USA? \n\n You can watch the first episode of “Quest For The Cup” in…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nTrump Enjoys the Splendor of Windsor Castle in Historic Second State Visit to the UK \n\n WINDSOR, England (AP) — On Wednesday, President Donald Trump found himself immersed…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nPresident Trump’s Unprecedented Second State Visit \n\n IE 11 is not supported. For an optimal experience visit our site…\n\nInternewscast\nSeptember 17, 2025\n\n \n\nLocal news \n\nNew Rules: COVID Vaccines Might Now Need a Prescription \n\n SAVANNAH, Ga. () — Medical professionals at Memorial Health suggest people may… \n\nInternewscast\nSeptember 18, 2025 \n\n \n\nLeading Israeli Newspaper ‘Times of Israel’ Criticizes Charlie Kirk \n\n On September 13, 2025, the Times of Israel, a prominent Israeli newspaper,… \n\nInternewscast\nSeptember 18, 2025 \n\n \n\nJimmy Kimmel’s Show Halted Indefinitely Following Remarks by Charlie Kirk \n\n Disney’s ABC has decided to take Jimmy Kimmel’s late-night talk show off… \n\nInternewscast\nSeptember 18, 2025 \n\n \n\nHarry and Meghan Snubbed as Royal Family Welcomes Trump \n\n Prince Harry and Meghan Markle have been keeping a low profile in… \n\nInternewscast\nSeptember 18, 2025 \n\n \n\n \nInternewscast Journal\n\nPrivacy Policy\n\nDMCA Notice\n\nTerms and Conditions\n\nSupport Our Cause\n\n \n\n Copyright 2023. All Right Reserverd.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIE 11 is not supported. For the best experience, please visit our&#8230;\n\n\nThis Post: Three Officers and Suspect Die in Pennsylvania Shooting first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/three-officers-and-suspect-die-in-pennsylvania-shooting/","image":"https://internewscast.com/wp-content/uploads/2025/09/Three-officers-killed-suspect-dead-in-Penn-shooting.jpg","video":null,"publish_date":"2025-09-17 23:18:54","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.283},{"id":361375358,"title":"Jimmy Kimmel Live! pulled off air ‘indefinitely’ after Charlie Kirk comments, ABC confirms","text":"Jimmy Kimmel Live! has been taken off air “indefinitely” after the host made controversial comments about Charlie Kirk and US President Donald Trump after the prominent MAGA figure was assassinated in Utah.\n\nKirk died after being shot at a speaking event at Utah Valley University campus.\n\nFollowing his assassination, which authorities believe was politically motivated, a manhunt for a suspect was launched, which led to the arrest of Tyler Robinson, a 22-year-old man from Utah.\n\nKimmel, during an episode’s opening monologue, suggested that Mr Robinson was “MAGA”.\n\nIn Monday night’s edition of the ABC show, Kimmel said: “We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid (Tyler Robinson) who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.”\n\nKimmel went on to criticise Mr Trump’s response to Kirk’s death, saying the US President was acting like “a four-year-old”.\n\nFollowing the assassination, Mr Trump ordered flags to be flown at half mast in honour of the Turning Point USA founder’s death, also announcing that he would award Kirk posthumously with the Presidential Medal of Freedom.\n\n“This is not how an adult grieves the murder of somebody he called a friend. This is how a four-year-old mourns a goldfish, OK?” Kimmel said.\n\nOutrage was quick, and ABC, who is owned by Disney, pulled Kimmel’s show on Wednesday evening.\n\n“Jimmy Kimmel Live! will be pre-empted indefinitely,” an ABC spokesman told NBC News on Wednesday.\n\nNexstar Media Group, who owns stations which aired Jimmy Kimmel Live!, also confirmed the show was off air.\n\n“Nexstar strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets,” Nextstar said.\n\nFollowing Kirk’s assassination, Kimmel took to Instagram to call out the shooting. .\n\n“Instead of the angry finger-pointing, can we just for one day agree that it is horrible and monstrous to shoot another human?” Kimmel wrote on Instagram.\n\n“On behalf of my family, we send love to the Kirks and to all the children, parents and innocents who fall victim to senseless gun violence.”\n\nMore to come...","summary":"Jimmy Kimmel Live! has been taken off air ‘indefinitely’ after the host made controversial comments about Charlie Kirk and US President Donald Trump after the alleged Utah assassination.","url":"https://thewest.com.au/news/world/jimmy-kimmel-live-pulled-off-air-indefinitely-after-charlie-kirk-comments-abc-confirms-c-20057326","image":"https://images.thewest.com.au/publication/C-20057326/ac6cc46b5378fa1446ca6f1affc33a9849f87b9f-16x9-x0y0w3000h1688.jpg?imwidth=1200","video":null,"publish_date":"2025-09-17 23:18:34","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","source_country":"au","sentiment":-0.432},{"id":361382312,"title":"Cracker Barrel stock falls as company reports mixed earnings after rebrand controversy","text":"Cracker Barrel responded to the criticism, saying the company could have \"done a better job sharing who we are and who we'll always be.\" The chain said the man from the original logo, Uncle Herschel, would still be featured on the menu and part of the Cracker Barrel \"family.\"\n\nPresident Donald Trump even weighed in on the situation, saying Cracker Barrel \"should go back to the old logo, admit a mistake based on customer response (the ultimate Poll) and manage the company better than ever before.\"\n\nThe same day, the company announced a stunning reversal, shutting down the rebrand and retaining its original branding.\n\n\"We thank our guests for sharing your voices and love for Cracker Barrel. We said we would listen, and we have. Our new logo is going away and our 'Old Timer' will remain,\" the company said in a statement.\n\nMasino said on the Wednesday call that four locations with the modern designs are already being reverted to the traditional \"Old Timer\" signage.\n\n\"That's why our team pivoted quickly to switch back to our 'Old Timer' logo and has already begun executing new marketing, advertising and social media initiatives leaning into Uncle Herschel and the nostalgia around the brand with more to come,\" Masino said on the Wednesday call.\n\nShe added that the company is launching \"Front Porch Feedback\" on Thursday to build on what Cracker Barrel has received over recent weeks. The new tool will allow reward members to comment directly to team members after every visit, Masino said.\n\nThe company also announced it was suspending all of its restaurant remodels.\n\nShares of the company rose after the reversal, mostly restoring its losses. Since its first announcement, Cracker Barrel lost and regained almost $100 million in market value.\n\n\"Cracker Barrel is not just an old country store or a restaurant,\" Masino said. \"It's the front porch of America, and we take that very seriously.\"","summary":"Cracker Barrel reported fourth-quarter earnings after the bell on Wednesday.","url":"https://www.cnbc.com/2025/09/17/cracker-barrel-q4-2025-earnings.html","image":"https://image.cnbcfm.com/api/v1/image/108191579-1756325780992-gettyimages-2232416729-dji_20250827140040_0492_d_xhdlqvmk.jpeg?v=1758150985","video":null,"publish_date":"2025-09-17 23:15:47","author":"Laya Neelakandan","authors":["Laya Neelakandan"],"language":"en","source_country":"US","sentiment":-0.021},{"id":361382452,"title":"ABC suspends Jimmy Kimmel's late-night show indefinitely over his remarks about Charlie Kirk’s death (Entertainment)","text":"ABC has suspended Jimmy Kimmel’s late-night show indefinitely after comments that he made about Charlie Kirk's killing led a group of ABC-affiliated stations to say it would not air the show\n\nKimmel, the veteran late-night comic, made several comments about the reaction to Kirk's assassination on his show Monday and Tuesday nights. He said that “many in MAGA land are working very hard to capitalize on the murder of Charlie Kirk.”\n\nABC, which has aired Kimmel's late-night show since 2003, moved swiftly after Nexstar Communications Group said it would pull the show starting Wednesday. Kimmel's comments about Kirk's death “are offensive and insensitive at a critical time in our national political discourse,” said Andrew Alford, president of Nexstar's broadcasting division. Nexstar operates 23 ABC affiliates.\n\nThere was no immediate comment from Kimmel.\n\nPresident Donald Trump celebrated ABC's move on the social media site Truth Social, writing: “Congratulations to ABC for finally having the courage to do what had to be done.”\n\nHe also targeted two other late-night hosts, Jimmy Fallon and Seth Meyers, and said they should be canceled too, calling them “two total losers.”\n\nKimmel’s contract is up at the end of next season, which ends in May 2026.\n\nOn Twitter Wednesday night, White House deputy chief of staff Taylor Budowich posted: “Welcome to Consequence Culture. Normal, common sense Americans are no longer taking the b———- and companies like ABC are finally willing to do the right and reasonable thing.\"\n\nIn his monologue on Monday, Kimmel said that “we hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.”\n\nKimmel said that Trump's response to Kirk's death “is not how an adult grieves the murder of someone he called a friend. This is how a 4-year-old mourns a goldfish, OK?” He also said that FBI chief Kash Patel has handled the investigation into the murder “like a kid who didn't read the book, BS'ing his way through an oral report.”\n\nHe returned to the topic on Tuesday night, mocking Vice President JD Vance's performance as guest host for Kirk's podcast.\n\nHe said Trump was “fanning the flames” by attacking people on the left. “Which is it, are they a bunch of sissy pickleball players because they're too scared to be hit by tennis balls, or a well-organized deadly team of commandos, because they can't be both of those things.”\n\nAuthorities say Tyler Robinson, 22, who is charged with killing Kirk, grew up in a conservative household in southern Utah but was enmeshed in “leftist ideology.” His parents told investigators he had turned politically left and pro-LGBTQ rights in the last year. Utah records show he was registered as a voter, but not affiliated with either political party. His voter status is inactive, meaning he did not vote in two regular general elections. He told his transgender partner that he targeted Kirk because he “had enough of his hatred.”\n\nKimmel, like CBS late-night host Stephen Colbert, has consistently been critical of President Donald Trump and many of his policies on his ABC show. CBS said this past summer that it was canceling Colbert's show at the end of this season for financial reasons, although some critics have wondered if his stance on Trump played a role.\n\nNEW: Disney’s ABC has permanently suspended Jimmy Kimmel Live following the late-night host’s recent comments about Charlie Kirk’s assassination\n\n“We had some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as… pic.twitter.com/Q0002bBSjy\n— HOT SPOT (@HotSpotHotSpot) September 17, 2025","summary":"ABC has suspended Jimmy Kimmel&rsquo;s late-night show indefinitely following comments he made about Charlie Kirk&rsquo;s killing.\n\nThe network&#39;s decision came Nexstar announced its ABC affiliates would pre-empt &ldquo;Jimmy Kimmel Live!&rdquo; indefinitely over his comments.\n\n&ldquo;Mr. Kim...","url":"https://www.castanet.net/news/Entertainment/572970/ABC-suspends-Jimmy-Kimmel-s-late-night-show-indefinitely-over-his-remarks-about-Charlie-Kirk-s-death","image":"https://www.castanet.net/content/2025/9/c3b89a17aecd7548b202d051c1450dbfe87a0c3f39eb8fd40aaa6fae7a65f5ab.jpg","video":null,"publish_date":"2025-09-17 23:15:00","author":"Richard Shotwell","authors":["Richard Shotwell"],"language":"en","source_country":"ca","sentiment":-0.203},{"id":361378534,"title":"ABC suspends Jimmy Kimmel’s late-night show indefinitely over his remarks about Charlie Kirk’s death","text":"NEW YORK (AP) — ABC has suspended Jimmy Kimmel’s late-night show indefinitely following comments he made about Charlie Kirk’s killing.\n\nThe network’s decision Wednesday came Nexstar announced its ABC affiliates would pre-empt “Jimmy Kimmel Live!” indefinitely over his comments.\n\n“Mr. Kimmel’s comments about the death of Mr. Kirk are offensive and insensitive at a critical time in our national political discourse, and we do not believe they reflect the spectrum of opinions, views, or values of the local communities in which we are located,” said Andrew Alford, President of Nexstar’s broadcasting division.\n\nA spokesperson for Kimmel did not immediately return a call for comment.\n\nIn his monologue on Tuesday, Kimmel said that “we hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.”\n\nKimmel, like CBS late-night host Stephen Colbert, has consistently been critical of President Donald Trump and many of his policies on his ABC show. CBS said this past summer that it was cancelling Colbert’s show at the end of this season for financial reasons, although some critics have wondered if his stance on Trump played a role.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"NEW YORK (AP) — ABC has suspended Jimmy Kimmel’s late-night show indefinitely following comments he made about Charlie Kirk’s killing. The network&#8217;s decision Wednesday came Nexstar announced...","url":"https://wsvn.com/entertainment/abc-suspends-jimmy-kimmels-late-night-show-indefinitely-over-his-remarks-about-charlie-kirks-death/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/09/250904_Jimmy_Kimmel_Deco.jpg?quality=60&strip=color","video":null,"publish_date":"2025-09-17 23:14:17","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":-0.11},{"id":361376404,"title":"Harry and Meghan Snubbed as Royal Family Welcomes Trump","text":"Prince Harry and Meghan Markle have been keeping a low profile in Montecito while the rest of his family enjoyed a lavish State banquet with visiting President Donald Trump and First Lady Melania at Windsor Castle.\n\nFollowing Harry’s recent prominent visit to London and Meghan enjoying the spotlight with the release of her second season on Netflix, the Duke and Duchess of Sussex have chosen to remain out of the public eye at their California residence, as reported by the Daily Mail.\n\nKnown for their affinity towards the limelight, the couple has been unusually silent in Montecito, a significant distance from the activity at Windsor Castle.\n\nWhile his brother, the Prince of Wales, feasted on elegantly presented boneless chicken wrapped in zucchini, Harry and Meghan were not spotted among the attendees.\n\nTheir retreat is a departure for the Sussexes who have made a habit of upstaging big royal moments with events of their own. \n\nThe former Suits star, aged 44, has notably been absent from social media, except for an Instagram post celebrating her husband’s 41st birthday on Monday. The couple has not been seen in their local surroundings since Harry’s return.\n\nTypically regular figures in the upscale coastal town, Meghan and Harry have seemingly withdrawn from public view as the Daily Mail attempted to locate them in Montecito this week.\n\nSwank delicatessen Pierre La Fond, where Meghan has previously been photographed, was a Sussex-free zone, as were other favorites such as Lucky’s Steakhouse and upscale boutique Wendy Foster.\n\nEven at the sugar sand Miramar Beach – where the pair have been spotted walking their dogs and enjoying surf classes – they were off the radar.\n\nThe timing has fueled speculation on whether Harry and Meghan may have been snubbed or are deliberately keeping out of sight to avoid Trump’s wrath. \n\nAccording to royal commentator Richard Fitzwilliams, that’s because the pair are wary of stealing the spotlight from President Trump who has the power to make life difficult for them should he be angered.\n\n‘I’d be surprised if the Sussexes do anything this week that might annoy,’ Fitzwilliams told Daily Mail.\n\n‘The British put on such a ceremonial show. I mean I’ve been watching this. It is amazing and it’s intentionally amazing and intentionally designed to impress President Trump.\n\n‘If the Sussexes made a move that distracted us, as they have from time to time when there been important royal events, it would be not only be outrageous, but it would draw Trump’s eye.’\n\nTrump and the Sussexes have had an antagonistic relationship that dates back to 2016 when Meghan – then a cast member on Suits – called him ‘misogynistic’ and ‘divisive’ during a talk show appearance and expressed support for failed Democratic candidate Hillary Clinton.\n\nThree years later, Trump responded in kind when he described the Duchess of Sussex as ‘nasty’ in an interview ahead of his 2019 state visit to the UK.\n\nThe president later clarified that he ‘wasn’t referring to her as “she’s nasty” – I said she was nasty about me.\n\n‘And essentially, I didn’t know she was nasty about me. So, I said, but you know what, she’s doing a good job, I hope she enjoys her life,’ Trump added. \n\nOn that occasion, Prince Harry took part in the hosting duties but Meghan was again conspicuous by her absence – citing the recent birth of Prince Archie, now six, for not attending.\n\nThen, in 2020 living in California, the couple spoke out during the election, hinting at support for President Biden while Harry issued a warning about ‘hate speech, misinformation, and online negativity’.\n\nTrump responded again, this time in a White House press conference in which he said of Meghan ‘I’m not a fan of hers’ while wishing Harry ‘a lot of luck, because he’s going to need it.’\n\nAlthough the bad blood settled down during the four years of the Biden administration, Harry’s revelations in autobiography Spare that he had taken drugs caused a potential visa problem – with the Heritage Foundation filing a freedom of information request in 2024 that sought to discover whether Harry had disclosed his narcotic use while applying for a US visa.\n\nThat resulted in a newly inaugurated Trump being asked in February whether he would deport Harry if he was found to have lied during immigration proceedings.\n\nThe president, who has made no secret of his distaste for Meghan, replied: ‘I don’t want to do that. I’ll leave him alone. He’s got enough problems with his wife. She’s terrible.’\n\nFitzwilliams says that while Trump is unlikely to want to damage his close relationship with King Charles and the Prince of Wales, his unpredictability means that the Sussexes can’t be sure that he won’t change his mind.\n\nIn his speech at the Royal dinner, he acknowledged the King’s son William, but Harry got nary a word. \n\nMeghan took pains in a recent interview with Bloomberg not to be drawn on her thoughts about the president – despite being asked three times.\n\n‘Meghan, she actually showed sense in not answering political questions,’ Fitzwilliams told Daily Mail.\n\n‘The reason President Trump wants to leave Harry alone, of course, is that he doesn’t want any glitches with King Charles because can you just imagine what would happen if they tried to throw him out.\n\n‘He would contest it in court and this would be a member of the British Royal Family involved in court case in America and it would harm Trump’s links with the royals because it’s the last thing King Charles would want.\n\n‘I shouldn’t think William would want that either. I mean they might be landed with him back there.’\n\nWhile wary of upsetting President Trump, Fitzwilliams said the couple would be less concerned about troubling the rest of the royals – pointing to an interview Harry gave to the Guardian last weekend during his successful trip to Ukraine.\n\n‘Suddenly you decide that you’re going to give an interview saying, “I regret nothing” to a Republican newspaper [the Guardian leans left and is anti-monarchy].\n\n‘I mean, it’s utterly weird.’\n\nNevertheless, Fitzwilliams said he is certain the couple will continue to lay low during the current state visit, noting that along with the risk of upsetting Trump, Harry is aware that along with glittering pageantry, serious issues are being discussed.\n\nHe said: ‘I really, really think it’s very unlikely they would say or do anything [this week]. \n\n‘This is a decision that would be taken because Harry knows serious national issues are being discussed.\n\nThis wouldn’t be the first time the couple has been snubbed by a US president: Daily Mail revealed that Harry and Meghan in 2022 tried to hitch a ride home with Joe Biden on Air Force One after Queen Elizabeth’s funeral and were refused.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPrince Harry and Meghan Markle have been keeping a low profile in&#8230;\n\n\nThis Post: Harry and Meghan Snubbed as Royal Family Welcomes Trump first appeared on Internewscast Journal","url":"https://internewscast.com/news/harry-and-meghan-snubbed-as-royal-family-welcomes-trump/","image":"https://internewscast.com/wp-content/uploads/2025/09/Harry-and-Meghan-left-out-in-the-cold-as-Royal.jpg","video":null,"publish_date":"2025-09-17 23:11:00","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.027},{"id":361381584,"title":"ABC suspends Jimmy Kimmel’s late-night show indefinitely over his remarks about Charlie Kirk’s death","text":"By DAVID BAUDER, AP Media Writer\n\nNEW YORK (AP) — ABC has suspended Jimmy Kimmel’s late-night show indefinitely after comments that he made about Charlie Kirk’s killing led a group of ABC-affiliated stations to say it would not air the show.\n\nKimmel, the veteran late-night comic, made several comments about the reaction to Kirk’s assassination on his show Monday and Tuesday nights. He said that “many in MAGA land are working very hard to capitalize on the murder of Charlie Kirk.”\n\nABC, which has aired Kimmel’s late-night show since 2003, moved swiftly after Nextstar Communications Group said it would pull the show starting Wednesday. Kimmel’s comments about Kirk’s death “are offensive and insensitive at a critical time in our national political discourse,” said Andrew Alford, president of Nexstar’s broadcasting division. Nexstar operates 23 ABC affiliates.\n\nThere was no immediate comment from Kimmel.\n\nOn X Wednesday night, White House deputy chief of staff Taylor Budowich posted: “Welcome to Consequence Culture. Normal, common sense Americans are no longer taking the b———- and companies like ABC are finally willing to do the right and reasonable thing.”\n\nIn his monologue on Monday, Kimmel said that “we hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.”\n\nKimmel said that Trump’s response to Kirk’s death “is not how an adult grieves the murder of someone he called a friend. This is how a 4-year-old mourns a goldfish, OK?” He also said that FBI chief Kash Patel has handled the investigation into the murder “like a kid who didn’t read the book, BS’ing his way through an oral report.”\n\nHe returned to the topic on Tuesday night, mocking Vice President JD Vance’s performance as guest host for Kirk’s podcast.\n\nHe said Trump was “fanning the flames” by attacking people on the left. “Which is it, are they a bunch of sissy pickleball players because they’re too scared to be hit by tennis balls, or a well-organized deadly team of commandos, because they can’t be both of those things.”\n\nKimmel, like CBS late-night host Stephen Colbert, has consistently been critical of President Donald Trump and many of his policies on his ABC show. CBS said this past summer that it was canceling Colbert’s show at the end of this season for financial reasons, although some critics have wondered if his stance on Trump played a role.","summary":"Nexstar announced its ABC affiliates would pre-empt “Jimmy Kimmel Live!” indefinitely over his comments.","url":"https://www.bostonherald.com/2025/09/17/jimmy-kimmel-show-suspended/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/2025_Creative_Arts_Emmy_Awards_-_Night_Two_13056_fe4d68.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-17 23:07:09","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.115},{"id":361376194,"title":"Fox News Politics Newsletter: Kash clashes with the Senate","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Gun seller takes stand in Trump assassination attempt trial with key testimony about rifle purchase -DHS blames political rhetoric for surge in assaults on ICE agents after Charlie Kirk murder -House Dem warns both sides on 'road to ruin' as political divide deepens over Kirk assassination Kash clashes with the Senate FBI Director Kash Patel is testifying before House lawmakers on Wednesday in a hearing focused on the bureau's dramatic reforms in the second Trump administration and the recent assassination of Charlie Kirk. Patel is facing questions in five-minute rounds from Republicans and Democrats on the House Judiciary Committee as part of an annual oversight hearing, marking the director's second appearance in as many days on Capitol Hill after he testified before the Senate one day prior. House Judiciary Committee Chairman Jim Jordan, R-Ohio, raised what he said was a weaponization of the FBI against conservatives, reviving concerns his committee regularly brought up during FBI Director Christopher Wray's tenure. Jordan praised Patel for what he said was a course correction…Read more White House PROFESSOR VEEP: Donald Trump's first vice president snags new job Capitol Hill POLITICAL SHOWDOWN: Patel spars with House Democrats on allegations he's involved in Epstein 'cover-up': 'Categorically false' INFANT HEALTH POLICY: Rand Paul clashes with top Democrat over CDC pushing vaccines on infants BROKEN HOUSE: 'Squad' member, Nancy Mace clash on social media: 'You belong in rehab' Across America GROOMING CRACKDOWN: Pentagon unveils new 'clean shaven' standards, only allows medical exemptions for one year GOP COLLISION: Republican who defied Trump over 2020 election results launches battleground state governor bid MAYOR VS FAITH: Whitmer quiet on Muslim mayor telling critic of terrorist sympathizer he's 'not welcome' Charlie Kirk BIGGER THAN EVER: 'This is the turning point:' TPUSA says campus chapter requests surge over 54,000 after Kirk's assassination SPEECH SHIELD: Liberal professors’ group backs faculty speech after Charlie Kirk assassination, silent on condemning attack 'SOMBER' REFLECTION: Utah Valley University mourns Charlie Kirk as campus reopens after assassination: 'Extremely traumatic' LEGACY IN MOTION: Arizona highway could honor Charlie Kirk after assassination rocks conservative movement HATE IN SCHOOLS: Celebratory, dismissive reactions to Charlie Kirk’s death putting educators under scrutiny FREE SPEECH FIGHT: Mamdani labeled Kirk a 'far-right extremist' who should be canceled from speaking in NYC Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-kash-clashes-senate","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/kash-patel-testifying.jpg","video":null,"publish_date":"2025-09-17 23:07:04","author":null,"language":"en","source_country":"US","sentiment":-0.334},{"id":361377730,"title":"Cybersecurity firm Netskope raises $908.2 million in US IPO","text":"NEW YORK : Cybersecurity firm Netskope raised $908.2 million in an initial public offering in the United States, the cloud-based cybersecurity company said on Wednesday. \n\nThe Santa Clara, California-based company sold about 47.8 million shares at $19 apiece, at the higher end of its target range, which it had previously raised to $17 to $19 per share, confirming an earlier report by Reuters.\n\nThis gives the company a valuation of $7.26 billion, compared with the $7.5 billion it fetched in a 2021 funding round led by investment firm ICONIQ. \n\nInvestor interest in U.S. IPOs has revived as a series of recent solid debuts helped relieve residual anxiety over President Donald Trump's tariffs, which delayed several listings in April. \n\nA slew of companies — from crypto and fintechs to biotechs and coffee bars — have gone public post-Labor Day, signaling pent-up investor appetite for new issues. \n\nEarlier on Wednesday, ticket reseller marketplace StubHub started trading on the New York Stock Exchange, in a closely watched debut by a company tied to consumer discretionary spend.\n\nNetskope, founded in 2012, develops cloud security software that helps businesses safeguard apps, websites and data from cyber threats. \n\nCybersecurity has become an increasingly pivotal part of corporate budgets worldwide, as frequent threats from digital attacks continue to threaten operational continuity and confidential data. \n\nNetskope's net loss narrowed to $170 million on revenue of $328 million in the six months ended July 31, compared with a net loss of $207 million on revenue of $251 million a year earlier.\n\nMorgan Stanley and J.P. Morgan are the lead underwriters for the offering. Netskope will start trading on the Nasdaq under the \"NTSK\" symbol.","summary":"","url":"https://www.channelnewsasia.com/business/cybersecurity-firm-netskope-raises-9082-million-in-us-ipo-5355121","image":"https://dam.mediacorp.sg/image/upload/s--9Ik12sKN--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-09-17T233801Z_2_LYNXNPEL8G13I_RTROPTP_3_NETSKOPE-IPO.JPG?itok=XA-pE","video":null,"publish_date":"2025-09-17 23:03:26","author":null,"language":"en","source_country":"sg","sentiment":0.001},{"id":361376800,"title":"Starmer to host Trump for final day of second state visit to Britain","text":"Sir Keir Starmer will host Donald Trump at his grace and favour country home on Thursday, as the Prime Minister continues his campaign to woo the US president during his unprecedented second state visit to Britain.\n\nThe Prime Minister is hoping to keep the focus of the visit on an influx of American investment into the UK, all while both his Government and the Trump administration are plagued by scandals related to the paedophile financier Jeffrey Epstein.\n\nOvernight, Sir Keir announced the prospect of some £150 billion flowing into the UK from big US firms such as Blackstone and Palantir.\n\nAs Sir Keir and Mr Trump meet at Chequers – the Prime Minister’s estate in Buckinghamshire – they also plan to sign a technology prosperity deal, touted as offering major investment by US tech firms in Britain, that will help to develop its AI capabilities.\n\nQuestions have, however, begun to arise over what American companies may want in return, with suggestions a tax on digital services – which largely impacts on US companies – could be reduced or eliminated.\n\nHopes that a deal aimed at reducing steel tariffs on British imports to the US could be hammered out during the state visit, meanwhile, appear to have fallen by the wayside, media reports have suggested.\n\nThursday afternoon’s press conference with the two leaders could prove to be the moment of most jeopardy for ensuring the state visit concludes smoothly, as questions about Lord Peter Mandelson and Mr Trump’s links to the late Epstein will likely arise.\n\nDifferences of opinion over the situation in the Middle East may also prove difficult for the two men.\n\nSir Keir has delayed his plans to recognise a Palestinian state until after Mr Trump’s visit concludes to avoid open disagreement over the matter, the Times reported.\n\nOn Wednesday evening, Mr Trump was the guest of honour at a lavish state banquet in Windsor Castle, hosted by the King.\n\nThere he paid a heartfelt tribute to America’s relationship with the UK, saying the word “special does not begin to do it justice”, and claimed the nations were “two notes in one chord”.\n\nAmong those at the banquet were the chiefs of major American firms, including big names from the tech world Sam Altman of OpenAI, Tim Cook of Apple, and Jensen Huang, the founder of Nvidia.\n\nMedia mogul Rupert Murdoch was also a guest, despite being sued by the US president over a report linking him to Epstein.\n\nOn Wednesday, thousands marched through London in protest against the US president’s state visit.\n\nYouGov polling suggests nearly half of the British population (45%) believe it was wrong to invite Mr Trump for the visit, while 30% think it was right to do so.","summary":"Sir Keir is hoping to keep the focus of the visit on investment, as questions about Jeffrey Epstein continue to loom large.","url":"https://www.standard.co.uk/news/politics/keir-starmer-trump-prime-minister-britain-jeffrey-epstein-b1248324.html","image":"https://static.standard.co.uk/2025/09/18/00/6dd35f499813a10d2811ec7c082e1c61Y29udGVudHNlYXJjaGFwaSwxNzU4MjM1MTU2-2.81647943.jpg?width=1200","video":null,"publish_date":"2025-09-17 23:01:12","author":"David Lynch","authors":["David Lynch"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.193},{"id":361376406,"title":"Humorous Anecdote: King Reveals How US President Nixon Once Attempted to Organize a Wedding","text":"King Charles joked how ‘royal-obsessed’ President Richard Nixon tried to arrange a wedding between him and his daughter. \n\nOn Wednesday, during the State Banquet where the Royal Family hosted Donald Trump at Windsor Castle, his Majesty gave a warm and witty speech. \n\nIn contemplating the ‘unmatched alliance’ between the United States and the United Kingdom, and describing the nations as the ‘closest of kin’, his Majesty humorously mentioned a visit from the former Republican leader, Richard Nixon, during the 1970s.\n\nRetelling of how Nixon was ‘obsessed’ with the British Royal Family, the King revealed the then-President tried to arrange a marriage between him and his daughter, Tricia. \n\n‘Had the media succeeded in the 1970s in their own attempt at deepening the special relationship, I might have been married off within the Nixon family!’ he joked.\n\nBeforehand, the King warmly welcomed the Trumps to Windsor Castle, highlighting the two countries’ ‘enduring bond’, ‘anchored by a deep friendship’.\n\n‘This unique and important occasion reflects the enduring bond between out two great nations,’ King Charles told the banquet.\n\n‘Anchored by the deep friendship between our people, this relationship which, with good reason, we are our predecessors have long called “special”, has made us safer and stronger through the generations.\n\n‘Our people have fought and died together for the values we hold dear…we have innovated, traded and created together, fueling our cultures and economies through myriad forms of exchange, \n\n‘We have celebrated together, mourned together and stood together in the best and worst of times.’\n\nThe King also did not shy away from referring the War of Independence, saying how ‘remarkable’ the US and UKs relationship has become. \n\n‘My five times Great Grandfather, King George III, for his part, did not spare his worlds when he spoke of the revolutionary leaders,’ the monarch said.\n\n‘Today, however, we celebrate a relationship between our two countries that surely neither Washington nor King George III could have possibly imagined. The ocean may still divide us, but in so many other ways we are now the closest of kin.’\n\nHighlighting cultural, scientific, defence, security, intelligence, military and environmental links between the UK and US, the King concluded by toasting our ‘remarkable bond’ and ‘shared commitment to independence and liberty’.\n\nThe MAGA leader was seated between his ‘friend’ King Charles III and Princess Kate, who was wearing a couture gown by British designer Phillipa Lepley. \n\nCamilla wore a Royal blue silk marocain embroidered dress by Fiona Clare, a sapphire and diamond tiara, and the King’s Family Order. \n\nBefore the banquet, Mr Trump smiled from ear-to-ear as he stood next to his wife, Melania, as well as King Charles and Queen Camilla. \n\nAlongside the Prince and Princess of Wales, the Duchess of Gloucester, and Sophie, the Duchess of Edinburgh were among royals present. \n\nDuring this state visit, Trump was joined by his daughter Tiffany and her business executive husband, Michael Boulos. \n\nTrump was also previously accompanied by his youngest daughter, as well as all of his children, during his first state visit in 2019. \n\nIn his speech to tonight’s banquet, the US President described it as the ‘one of the highest honours of’ his life. \n\nHe drew laughter from the hall as he joked that he hoped he would be the only US president to have two state visits. \n\nHe went on to praise the King for his ‘remarkable son’ Prince William, as well as his knowledge of guests’ names. \n\nDescribing Brits as ‘lion-hearted people’, he appeared to veer off-script discussing the country’s beauty – and of the King.\n\nThe Prince of Wales was also singled out for praise, with Trump saying he had got to know him and believed he would be ‘an unbelievable success in the future’.\n\nAnd of the Princess of Wales? ‘Princess Catherine so radiant, and so healthy and so beautiful,’ he said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nKing Charles joked how &#8216;royal-obsessed&#8217; President Richard Nixon tried to arrange a wedding&#8230;\n\n\nThis Post: Humorous Anecdote: King Reveals How US President Nixon Once Attempted to Organize a Wedding first appeared on Internewscast Journal","url":"https://internewscast.com/news/humorous-anecdote-king-reveals-how-us-president-nixon-once-attempted-to-organize-a-wedding/","image":"https://internewscast.com/wp-content/uploads/2025/09/King-jokes-obsessed-US-President-Nixon-tried-to-arrange-a.jpg","video":null,"publish_date":"2025-09-17 23:00:47","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.439},{"id":361376202,"title":"West Hollywood faces fierce backlash for lowering flags to honor Charlie Kirk","text":"West Hollywood issued a statement Sunday after the California city faced backlash for lowering flags to half-staff in response to a presidential proclamation to pay tribute to Turning Point USA founder Charlie Kirk. After Kirk was assassinated during a campus event at Utah Valley University last week, President Donald Trump issued a proclamation ordering the U.S. flags on the White House and all public buildings and grounds to be lowered to half-staff to honor the conservative activist. The California city was criticized after following this order, as well as lowering the Transgender Flag and Pride Progress Flag at Matthew Shepard Square. A sign was erected in the square in protest of the decision. NFL GREAT'S NJ HOMETOWN REFUSED TO LOWER FLAGS IN HONOR OF CHARLIE KIRK, ITS NEIGHBORS ROSE TO THE OCCASION \"Shame on West Hollywood for lowering our flags in honoring a racist, transphobic, homophobic, Nazi-loving monster,\" the sign read. The City of West Hollywood defended its decision in a statement released to the WeHo Times, a local news outlet, saying that lowering these flags was in response to the presidential proclamation and not an endorsement of Kirk’s views. \"The City’s action should not be interpreted as an expression of alignment with, or endorsement of, Mr. Kirk’s political views or actions. Rather, the action was undertaken in accordance with the City’s Policy for Recognitions and Memorials, which acknowledges that the City follows the direction of the President in determining when flags in the City are flown at half-staff,\" the statement read. FEMA EMPLOYEE PLACED ON LEAVE FOR SAYING FLAGS SHOULDN'T BE AT HALF-STAFF FOR 'RACIST HOMOPHOBE' CHARLIE KIRK It continued, \"The discussion that has emerged within the community about when and whether the City should follow established policy is important. The City values this dialogue, and we recognize the importance of ensuring that community values are reflected in the City’s actions. In the coming weeks, the West Hollywood City Council will discuss this matter and will consider updates to the City’s policy regarding the lowering of flags to ensure that it appropriately reflects the values of the West Hollywood community.\" Fox News Digital reached out to the City of West Hollywood for comment. At the same time, a New Jersey city faced criticism from its citizens, including New York Jets great Nick Mangold, over its decision to not lower its flags despite the presidential proclamation. CUBS HONOR 'LIFELONG' FAN CHARLIE KIRK WITH 'MOMENT OF REFLECTION' AFTER UTAH ASSASSINATION The City of Madison defended its decision in a statement explaining that its policy is to follow \"the State of New Jersey’s daily flag status\" which kept the flags at \"full staff.\" CLICK HERE TO GET THE FOX NEWS APP \"The Borough of Madison condemns all forms of political violence and rejects hate in every form. We remain committed to bringing people together around our shared values and ideals,\" the statement continued.","summary":"The City of West Hollywood received backlash after lowering flags to half-staff following Turning Point USA founder Charlie Kirk&apos;s assassination last week.","url":"https://www.foxnews.com/media/west-hollywood-faces-fierce-backlash-lowering-flags-honor-charlie-kirk","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/charlie-kirk-speech-flag.jpg","video":"https://www.foxnews.com/video/6379064804112","publish_date":"2025-09-17 23:00:31","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.034},{"id":361384486,"title":"Exclusive: Melania Trump 'absolutely' thrilled to attend joint outing with Princess Kate","text":"For the first time, First Lady Melania Trump and the Princess of Wales will be teaming up for a joint engagement. It's a highly anticipated collaboration that did not occur during President Donald Trump's first term — but one the First Lady, HELLO! has learned, is looking forward to. The office of the First Lady told HELLO! that the upcoming engagement with the Princess is \"absolutely\" a highlight for Mrs. Trump on this second state visit to the United Kingdom. \n\nOn Thursday, Melania will join Kate at Frogmore Gardens to meet Chief Scout, Dwayne Fields, and members of the Scouts' Squirrels program as they learn about nature to earn their \"Go Wild\" badge. During the outing, the pair are expected to participate in leaf stamping and bug house identification. \n\nWhen the First Lady and her husband visited the UK at the invitation of Queen Elizabeth in 2019, Catherine attended the state banquet at Buckingham Palace, but she and Mrs. Trump did not carry out an engagement just the two of them. This time around, the Prince and Princess of Wales have played a key role. \n\nOn the first official day of the unprecedented state visit, Prince William and Kate greeted the American President and First Lady on the grounds of Windsor Castle and accompanied them to meet King Charles. The Waleses also participated in the carriage procession through the Windsor Estate on Wednesday, and in the evening, attended the glittering state banquet for the President and First Lady. \n\nThe President has spoken fondly of Prince William in the past. The month after he was elected the 47th president of the United States, President Trump and the Prince of Wales had a \"warm, friendly meeting\" in Paris, where they were in town for the re-opening ceremony of Notre-Dame.\n\n\"Good man, this one,\" the President said as he and William posed for photos at the UK Ambassador's residence in the French capital. \"He's doing a fantastic job.\" President Trump later shared with the New York Post that he and William had a \"great talk\" and called the Prince a \"good looking guy.\" \"He looked really, very handsome last night,\" President Trump said of the heir to the throne. \"Some people look better in person? He looked great. He looked really nice, and I told him that.\"\n\nWhile in Scotland this past July, the President remarked that his second state visit to the UK was \"gonna be great and being with Charles and Camilla and everybody, I've gotten to know because of four years and now six months, gotten to know a lot of the family members. They're great people. They're really great people. And in that sense, I think that the UK is very lucky.\"","summary":"Melania Trump's joint engagement with Princess Kate during her second state visit to the United Kingdom is absolutely a highlight for the first lady, HELLO! was told.","url":"https://www.hellomagazine.com/royalty/856265/melania-trump-kate-middleton-joint-engagement-absolutely-highlight-first-lady-state-visit-2025/","image":"https://58v76y8z87lo.hellomagazine.com/horizon/landscape/127fbe1e938e-gettyimages-2235357909.jpg","video":null,"publish_date":"2025-09-17 23:00:00","author":"Alexandra Hurtado","authors":["Alexandra Hurtado"],"language":"en","category":"politics","source_country":"gb","sentiment":0.595},{"id":361381070,"title":"ABC pulls ‘Jimmy Kimmel Live!’ indefinitely after Kirk comments","text":"Walt Disney-owned ABC said today that it was pulling “Jimmy Kimmel Live” off the air, after remarks by the show’s late-night host about Charlie Kirk’s assassination sparked harsh criticism by the head of the Federal Communications Commission.\n\nThe decision comes as President Donald Trump has repeatedly pressured broadcasters to stop airing content he has found objectionable and called on the FCC to pull licenses from stations.\n\n“‘Jimmy Kimmel Live’ will be pre-empted indefinitely,” an ABC spokesperson said, without elaborating.\n\nEarlier, Nexstar Media Group Inc, which describes itself as the nation’s largest local television and media company, said it would stop airing the show on its 32 ABC affiliates, citing Kimmel’s comments.\n\n“Mr. Kimmel’s comments about the death of Mr. Kirk are offensive and insensitive at a critical time in our national political discourse,” said Andrew Alford, president of Nexstar’s broadcasting division.\n\nKimmel made remarks on Monday night about the Sept. 10 assassination of Kirk.\n\n“We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,” Kimmel said on his Monday night show.\n\nKimmel also criticized Trump’s mourning of Kirk, pointing to a video of Trump’s comments on the White House lawn. “This is how a 4-year-old mourns a goldfish,” Kimmel said.\n\nKimmel did not respond to a Reuters request for comment today.\n\nTrump has frequently credited Kirk for driving more young voters and voters of color in support of his successful 2024 presidential campaign. Kirk was a co-founder at age 18 of Turning Point USA, an organization dedicated to advancing conservative causes on college campuses and among young voters.\n\nEarlier today, FCC Chair Brendan Carr had urged local broadcasters to stop airing “Jimmy Kimmel Live” on ABC.\n\nHe suggested the commission could open an investigation as a result and that broadcasters could potentially be fined or lose their licenses if there was a pattern of distorted comment.\n\n“This is a very, very serious issue right now for Disney. We can do this the easy way or the hard way,” Carr said in a podcast interview with conservative Benny Johnson that aired today. “Disney needs to see some change here, but the individual licensed stations that are taking their content, it’s time for them to step up and say this, you know, garbage to the extent that that’s what comes down the pipe in the future isn’t something that we think serves the needs of our local communities.”\n\nTrump has repeatedly sued, berated and threatened media companies whose coverage he disputes with legal or other action.\n\nCarr, a Trump appointee whose agency regulates broadcast television licenses essential to networks like ABC, has echoed Trump’s concerns about media bias.\n\nCarr celebrated the July cancellation of CBS’s “The Late Show with Stephen Colbert,” a frequent platform for anti-Trump satire.\n\nAt the time, CBS parent Paramount Global was seeking U.S. regulators’ approval for a merger with Skydance Media, which was ultimately granted, forming Paramount Skydance.\n\n“Next up will be an even less talented Jimmy Kimmel,” Trump said after Colbert’s dismissal.\n\nThe White House did not immediately respond to a request for comment.\n\nViewership of late-night shows has been on the decline, as has much of traditional TV, as viewers shift to to streaming and social media.\n\n“Jimmy Kimmel Live” averaged 1.57 million viewers per episode during the broadcast season that ended in May, according to Nielsen. “The Late Show with Stephen Colbert” was the most-watched late-night show during that time with an average of 1.9 million viewers.","summary":"Walt Disney-owned ABC said today that it was pulling &#8220;Jimmy Kimmel Live&#8221; off the air, after remarks by the show&#8217;s late-night host about Charlie Kirk&#8217;s assassination sparked harsh criticism by the head of the Federal Communications Commission.","url":"https://www.staradvertiser.com/2025/09/17/breaking-news/abc-pulls-jimmy-kimmel-live-indefinitely-after-kirk-comments/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/web1_20250917_brk_jki01.jpg","video":null,"publish_date":"2025-09-17 23:00:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":0.025},{"id":361374662,"title":"“Jimmy Kimmel Live!” Pulled by ABC 'Indefinitely' After Host's Comments About Charlie Kirk","text":"Jimmy Kimmel's late-night show has been indefinitely pulled.\n\n On Wednesday, Sept. 17, it was announced that Disney's ABC would be pulling Jimmy Kimmel Live! indefinitely, an ABC spokesperson confirmed to PEOPLE. Variety reports the removal is due to his recent remarks about Charlie Kirk.\n\n The network’s decision follows Nexstar Media's decision to preempt airings of the program. Nexstar Media is the largest local broadcast and digital media company in the U.S. that owns more than 200 television stations in 116 markets.\n\n Nexstar said its “owned and partner television stations affiliated with the ABC Television Network will preempt Jimmy Kimmel Live! for the foreseeable future, beginning with tonight’s show,” per Variety, adding that it “strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets.”\n\n The media company’s decision came two days after Kimmel mentioned Kirk in his monologue. Kirk was shot and killed during a speaking event at Utah Valley University on Sept. 10. He was 31.\n\n During Kimmel’s Monday, Sept. 15 monologue, he directly addressed President Donald Trump’s “Make America Great Again” supporters, saying, “We hit some new lows over the weekend with the MAGA gang trying to characterize this kid who killed Charlie Kirk as anything other than one of them.”\n\n PEOPLE reached out to representatives for Kimmel and Nextstar.\n\n The news comes amid Kimmel's ongoing feud with President Donald Trump, who predicted that the longtime ABC host would be the next late-night casualty after CBS canceled The Late Show With Stephen Colbert in July 2025.\n\n Prior to Trump warning of a late-night exodus, Kimmel himself had repeatedly hinting at ending his show. He told the Los Angeles Times in February 2024 that the three-year contract he signed in 2022 would probably be his last, joking, \"I hate to even say it, because everyone’s laughing at me now — each time I think that, and then it turns out to be not the case.”\n\n “I still have a little more than two years left on my contract, and that seems pretty good,\" he added at the time. \"That seems like enough.”\n\n Kimmel, who has hosted Jimmy Kimmel Live! since 2003, has frequently found himself in the president's crosshairs, whether for monologue jokes or jabs he took at Trump while hosting the Oscars.\n\n Following The Late Show's cancellation, the president took to his Truth Social account, claiming, \"The word is, and it’s a strong word at that, Jimmy Kimmel is NEXT to go in the untalented Late Night Sweepstakes and, shortly thereafter, [Jimmy] Fallon will be gone.\"\n\n \"These are people with absolutely NO TALENT, who were paid Millions of Dollars for, in all cases, destroying what used to be GREAT Television,\" Trump wrote. \"It’s really good to see them go, and I hope I played a major part in it!\"\n\n Kimmel expressed frustration of his own toward the president while on summer vacation with his family, sharing a photo of his family at an anti-Trump protest on July 17 with a pointed message.\n\n \"May every day be another wonderful secret,\" Kimmel's Instagram caption read, referencing a line from a cryptic letter that Trump allegedly wrote to sex offender Jeffrey Epstein, as reported by The Wall Street Journal.\n\n In the photo, he and his wife, Live! co-head writer Molly McNearney, are pictured in anti-Trump shirts with their children, Jane and Billy. Each member of the family is holding a sign, with phrases including, \"Don't bend the knee,\" \"Make America Good Again,\" and \"I wish we had a better president!\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n When Kimmel learned of The Late Show's cancellation — which came three days after Colbert tore into his parent company, Paramount, for offering up $16 million to settle a lawsuit with the president — the ABC host took to Instagram Stories to stand up for his friend and late-night rival.\n\n Reposting a clip from Colbert's announcement, Kimmel wrote, \"Love you Stephen.\"\n\n He then called out the network behind the decision, adding, \"F--- you and all your Sheldons, CBS,\" seemingly referring to the network's Big Bang Theory and Young Sheldon series.\n\n Back in 2022, Kimmel admitted that he'd previously considered quitting his late-night show if he wasn't allowed to make fun of Trump.\n\n \"There was one time, right around the beginning of this whole Trump thing… maybe not quite [eight years ago],\" Kimmel said on Stitcher's Naked Lunch podcast. \"I said, listen, I get it, you're right. I have lost half of my fanbase, maybe more. Ten years ago, among Republicans, I was the most popular talk show. At least, according to the research they did.\"\n\n \"I get it if [blocking Trump jokes is] what they want to do,\" Kimmel continued. \"I said, 'If that's what you want to do, I don't begrudge you for it, but I'm not going to do that. If you want someone else to host the show, that's fine with me. I'm just not going to do it like that.' \"","summary":"The decision comes a week after Kirk was fatally shot","url":"https://people.com/jimmy-kimmel-live-pulled-by-abc-indefinitely-after-comments-about-charlie-kirk-11777916","image":"https://people.com/thmb/eOKXV3NNpM5lRR17kKDAiCcDC-Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(740x196:742x198)/jimmy-kimmel-charlie-kirk-091725-f9782776cf884d09aa3552d30edb7bf2.jpg","video":null,"publish_date":"2025-09-17 22:58:27","author":"Charna Flam,Colleen Kratofil,Meredith Kile","authors":["Charna Flam","Colleen Kratofil","Meredith Kile"],"language":"en","category":"politics","source_country":"US","sentiment":-0.337},{"id":361375680,"title":"Donald Trump soaks up the glory of his second UK state visit","text":"A required part of this site couldn’t load. This may be due to a browser\n extension, network issues, or browser settings. Please check your\n connection, disable any ad blockers, or try using a different browser.","summary":"But after spending time with the King, the US president may face a tricky final day as he holds talks with Sir Keir Starmer","url":"https://www.ft.com/content/d344311f-aa55-44b9-a52d-2ce72b8b6256","image":null,"video":null,"publish_date":"2025-09-17 22:52:42","author":null,"language":"en","category":"politics","source_country":"GB","sentiment":-1},{"id":361376184,"title":"Cruz doubles down against groups funding Charlie Kirk protests; FBI director backs bill during hearing","text":"Sen. Ted Cruz, R-Texas, blasted organizations and individuals allegedly funding protests at various Charlie Kirk memorials, in addition to backing \"violent\" and \"extreme\" anti-ICE and anti-Israel demonstrations. In July, Cruz introduced legislation that would allow the Department of Justice (DOJ) to impose Racketeer Influenced and Corrupt Organizations Act (RICO) charges on individuals and organizations allegedly behind funding violent protests. \"I urge the FBI and the Department of Justice follow the money,\" Cruz told Fox News Digital. \"This violence we're seeing, the assassination of Charlie Kirk, was horrific. \"It was a politically motivated assassination. STUDENT EXPELLED AFTER BEING CAUGHT ON VIDEO ACTING OUT CHARLIE KIRK'S ASSASSINATION AT TEXAS STATE VIGIL \"This follows a string of politically motivated violence, including the Black Lives Matter and Antifa riots of several years ago,\" Cruz continued. \"Including the antisemitic riots on college campuses that played out over the last couple of years. Including the pro-open-borders riots in American cities.\" Since the assassination of the conservative activist Kirk last week, local and campus police have arrested a number of students and demonstrators who have disrupted vigils and memorial events. Cruz’s bill, the Financial Underwriting of Nefarious Demonstrations and Extremist Riots (STOP FUNDERs) Act, also addresses the violent anti-ICE riots that took place in California and the antisemitic protests that have plagued college campuses since the Oct. 7, 2023, attack on Israel by Hamas. TED CRUZ SAYS HATE SPEECH 'ABSOLUTELY' PROTECTED BY FIRST AMENDMENT FOLLOWING CHARLIE KIRK'S ASSASSINATION At a heated Senate Judiciary hearing this week with FBI Director Kash Patel as the lead witness, Patel agreed with Cruz’s legislative targeting alleged funding groups. Cruz questioned Patel during Tuesday's hearing, asking if the FBI would benefit from \"Congress passing into law the STOP FUNDERs Act and if rioting was added to the list of predicate offenses for RICO.\" Patel responded during the hearing in agreement with Cruz's assertion about the bill. President Donald Trump himself and White House Deputy Chief of Staff Stephen Miller have also spoken out about groups funding extreme demonstrations. KASH PATEL FACES HOUSE GRILLING AFTER TENSE SENATE CLASHES OVER KIRK ASSASSINATION \"They have organized drop points for weapons, organized drop points for gas masks, organized drop points for all the materials necessary to launch a riot,\" Miller told reporters Monday. \"I think the key point the president has been making is somebody is paying for all of this. This is not happening for free.\" CLICK HERE TO GET THE FOX NEWS APP Cruz has been outspoken in condemning the assassination of Kirk, and when asked if the accused assassin should receive the death penalty, Cruz told Fox News Digital, \"The death penalty is absolutely merited. \"I am glad they're seeking the death penalty,\" Cruz added. \"The very worst crimes deserve the ultimate punishment.\"","summary":"FBI head Kash Patel supports Sen. Ted Cruz&apos;s bill targeting protest funding groups disrupting Charlie Kirk memorials and &quot;violent&quot; and &quot;extreme&quot; demonstrations against ICE and Israel.","url":"https://www.foxnews.com/politics/cruz-doubles-down-targeting-groups-funding-charlie-kirk-protests-fbi-director-backs-bill-during-hearing","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/ted-cruz-charlie-kirk.jpg","video":"https://www.foxnews.com/video/6379695068112","publish_date":"2025-09-17 22:44:14","author":"Preston Mizell","authors":["Preston Mizell"],"language":"en","source_country":"US","sentiment":-0.128},{"id":361375948,"title":"Boos fill Wembley Arena after Richard Gere calls out Donald Trump as he visits UK","text":"Richard Gere gave a moving speech at tonight’s Palestine benefit concert (Picture: Xavi Torrent/Getty Images)\n\nRichard Gere spoke on stage at tonight’s Together for Palestine concert in Wembley, and on mentioning US President Donald Trump a chorus of boos rang out through the London arena.\n\nAs the siege in Gaza approaches its second anniversary, benefit concert Together for Palestine aims to raise vital funds – at the time of writing the figure is just under £1.5million – and awareness for those affected in Gaza and beyond.\n\nThe Pretty Woman actor, 76, talked about the feeling of love and community in the room, which he said was the kernel of every ‘great movement’ in history.\n\nHe also called out ‘enablers’ of the genocide in Gaza, and on mentioning Donald Trump – who touched down in the UK this week for his second state visit – the sold-out arena erputed into boos. \n\n‘Of course, Netanyahu has to go. All the enablers have to go, also,’ he said to rapturous cheers, before directing attention towards the US President. \n\n‘There’s one man who could stop this thing in one day… He says he can stop wars in one day, my president Trump,’ the Hollywood actor continued. \n\n He talked about the power of community in starting the world’s greatest movements (Picture: Brian Eno/Youtube)\n\n He also called out Donald Trump and ‘enablers’ of the genocide in Gaza (Picture: Brian Eno/Youtube)\n\nHushing the booing crowd with his hand, Richard said: ‘In one day he could stop all this craziness. Netanyahu needs the US, needs Trump so badly. One day, if he wants a Nobel Peace prize this is the way to get it.\n\n‘This caravan we’re all in together, is one of responsibility.’ \n\nThis comes after the Republican touched down in the UK this week and was greeted with anti-Trump protests. \n\nHe’s been wined and dined by the King at Windsor Castle, as 20 miles away 5,000 protestors took to London’s streets with placards calling him, among other things, a ‘nonce’, ‘Fascist’ and a ‘d**k-tator’.\n\nGere, who was one of many to take to the stage in tonight’s Together for Palestine concert, began his speech talking about the ‘incredible’ sense of community in the room. \n\n‘What an incredible feeling here in this house. The last time I was here I was on stage and I introduced Dire Straits for the concerts for Nelson Mandela,’ he began. \n\n‘I think it’s only right the second time I come it’s for our Palestinian brothers and sisters. I look out here and I see this is London. I can see this is a community. I live outside of New York and we get the news and see what’s going on in Gaza. We don’t know what to do. \n\n‘The way to change it is through community. There’s a sense we’re all so deeply connected. The energy that you all generate here doesn’t stay confined; of genuine peace and non-violence and joy and dancing and singing and eating good food, living. \n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n Paloma Faith debuted a new song she wrote after attending a pro-Palestine march with her daughter (Picture: Brian Eno/Youtube)\n\n‘This energy goes out into the world. That’s how all the great movements on this planet started. Embracing everyone, even the bad guys. \n\n‘We’re all in this caravan together. Not one of despair: one of love and compassion and dancing. But the caravan of love is also the caravan of truth and responsibility and sacrifice. \n\n‘Standing up, speaking the truth with generosity of spirit and love, because that’s how you change things. You speak up, stand up and let love and inclusion be generated.’ \n\nThe Primal Fear actor also said that he’s ‘one of the old dogs’ in the room, but he’s ‘never seen’ in his time anything like what’s going on in Gaza. \n\nOver 65,000 Palestinians are confirmed to have been killed by Israel’s bombardment of Gaza since October 7, 2023, according to the Health Ministry, which is part of the Hamas-run government.\n\nThe figures are seen as a reliable estimate by independent experts and the UN, who also found Israel was committing genocide in the Palestinian enclave yesterday. Israel denies the allegation.\n\n‘What we are witnessing in Gaza is not only an unprecedented humanitarian catastrophe, but what the UN Commission of Inquiry has now concluded is a genocide,’ a statement read.\n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n‘States must use every available political, economic, and legal tool at their disposal to intervene. Rhetoric and half measures are not enough. This moment demands decisive action.’\n\nElsewhere at Together for Palestine, Paloma Faith debuted a song she wrote a few months ago about her experience of going to a pro-Palestine march with her young daughter.\n\nPinkPantheress also took to the stage, and said: ‘We have a responsibility to use our platforms. Neutrality or silence could not be an option. Use your voice, and when your voice goes hoarse, wave your flag and wear your keffiyeh.’ \n\n Together for Palestine donations \n\n So far, Together for Palestine has raised just under £1.5million, at the time of writing. \nAll donations and ticket proceeds from the evening will go to Choose Love, with all funds going to support Palestinian-led organisations providing life-saving humanitarian aid, such as Taawon, Palestine Children’s Relief Fund, and Palestinian Medical Relief Society.\nDonate here. \n\nFlorence Pugh came on for a brief statement, and said: ‘Silence in the face of such suffering is not neutrality, it’s complicity.’\n\nOther stars who supported the night by taking to the stage to speak or perform include Louis Theroux, Amelia Dimoldenberg, Jamie xx, Jameela Jamil, King Krule, Sampha, Greentea Peng, James Blake, Sampha, Bastille, Portishead, and Benedict Cumberbatch. \n\nMeanwhile, Francesca Albanese, the United Nations Special Rapporteur on the occupied Palestinian territories, took to the stage to elongated cheers. \n\n‘Relinquish an inch of your privilege, so that an entire people don’t have to lose everything,’ she said in a moving speech. \n\nPalestinian singer Elyanna also performed her song Olive Branch, which she said was a ‘symbol for love, for hope, for peace’. \n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"'All the enablers have to go.'","url":"https://metro.co.uk/2025/09/17/boos-ring-wembley-richard-gere-calls-donald-trump-genocide-enablers-24193405/","image":"https://metro.co.uk/wp-content/uploads/2025/09/GettyImages-2212638566-e1758147101404.jpg?quality=90&strip=all","video":null,"publish_date":"2025-09-17 22:43:45","author":"Kitty Chrisp","authors":["Kitty Chrisp"],"language":"en","category":"politics","source_country":"gb","sentiment":0.254},{"id":361380620,"title":"ABC Pulls ‘Jimmy Kimmel Live’ Indefinitely for Saying Charlie Kirk Assassin Was Part of ‘MAGA Gang’","text":"ABC will pull “Jimmy Kimmel Live!” indefinitely over recent comments by the late night host about Charlie Kirk’s death. \n\nKimmel knocked Republicans in his Monday monologue over trying to politicize Kirk’s death after they speculated over the weekend about Kirk’s alleged gunman Tyler Robinson’s political affiliations. \n\n“We hit some new lows over the weekend with the MAGA gang trying to characterize this kid who killed Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,” Kimmel said.\n\nAuthorities have since said that Robinson’s political beliefs were largely in line with leftist causes, prompting conservative media to attack Kimmel. \n\nOn Wednesday, Nexstar Media Group, which has more than 200 owned or partner stations in 116 U.S. markets reaching 220 million people, said it would preempt the late night show’s broadcast indefinitely, calling Kimmel’s remarks “offensive and insensitive at a critical time in our national political discourse.”\n\n“We do not believe they reflect the spectrum of opinions, views, or valuesof the local communities in which we are located,” Andrew Alford, president of Nexstar’s broadcasting division, said in a statement. “Continuing to give Mr. Kimmel a broadcast platform in the communities we serve is simply notin the public interest at the current time, and we have made the difficult decision to preempt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue.”\n\nNexstar’s comments as the company agreed to acquired Tegna for $6.2 billion, including debt and estimated transaction fees and expenses, which is expected to close by the second half of 2026, subject to Tegna shareholder and regulatory approvals.\n\nShortly after, ABC took matters into its own hands, with a network spokesperson telling TheWrap the show’s broadcast would be “pre-empted indefinitely.” \n\nPersonal representatives for Kimmel and “Jimmy Kimmel Live!” did not immediately return TheWrap’s request for comment. \n\nKimmel has frequently been a target of President Donald Trump, who previously suggested he would be “next up” after CBS announced that The Late Show with Stephen Colbert will end in May 2026. \n\nColbert’s cancellation came amidst the FCC’s lengthy review of Paramount and Skydance’s $8 billion merger, which officially closed in August. CBS has argued the move was “purely financial” and Skydance has said it was “not involved” in the decision. \n\nWhen asked by podcaster Benny Johnson about whether Kimmel’s remarks could fuel action by the FCC, chairman Brendan Carr said the agency has “remedies we can look at” and that it can “do this the easy way or the hard way.”\n\n“These companies can find ways to change conduct and take action, frankly, on Kimmel, or there’s going to be additional work for the FCC ahead,” he said.\n\nCarr said Kimmel’s comments were “some of the sickest conduct possible” and urged companies like Disney, which owns ABC, and Comcast, which owns NBC and Kimmel competitor “The Tonight Show,” to either take action or risk a federal probe into violations of the FCC’s public-interest guidelines, which could result in suspension of broadcast licenses.\n\n“I think it’s past time that a lot of these licensed broadcasters themselves push back on Comcast and Disney, and say ’We are going to preempt — we are not going to run Kimmel anymore until you straighten this out,’” Carr said. “It’s time for them to step up and say this garbage — to the extent that that’s what comes down the pipe in the future — isn’t something that serves the needs of our local communities.”","summary":"The move comes after Nexstar Media Group said it would preempt the late night show indefinitely, calling Kimmel's remarks \"offensive and insensitive\"\n\n\nThe post ABC Pulls &#8216;Jimmy Kimmel Live&#8217; Indefinitely for Saying Charlie Kirk Assassin Was Part of &#8216;MAGA Gang&#8217; appeared first on TheWrap.","url":"https://www.thewrap.com/abc-pulls-jimmy-kimmel-live-charlie-kirk-comments/","image":"https://www.thewrap.com/wp-content/uploads/2025/09/Jimmy-Kimmel-on-Trumps-ridiculous-NYT-lawsuit.jpg","video":null,"publish_date":"2025-09-17 22:40:53","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.189},{"id":361376352,"title":"Kate Middleton Glistens in Princess Diana's Tiara at State Banquet","text":"Kate Middleton’s latest look is good as gold.\n\nThe Princess of Wales donned an all-gold ensemble as she arrived at Windsor Castle with her husband Prince William Sept. 17, where King Charles III and Queen Camilla hosted a state banquet for President Donald Trump and First Lady Melania Trump.\n\nCrafted by British designer Phillippa Lepley, the silk couture gown featured an evening coat with gold lace detailing and hand-embroidered roses, as well as French knots and satin-stitched blooms.\n\nTo top off her outfit, Kate, 43, wore the iconic Lover's Knot tiara, a known favorite of her late mother-in-law Princess Diana. The stunning headpiece, which features 19 arches and 28 drop-shaped pearls, is believed to have been created in 1914 for Queen Mary and was eventually passed down to Queen Elizabeth II, according to Town & Country magazine.\n\nAs for William, the 43-year-old attended the royal affair wearing a black Windsor tailcoat with red accents and gold buttons over a white shirt and white tie. The heir apparent to the British throne completed his wardrobe with a large blue sash and several miniature medals on his lapel.","summary":"Kate Middleton’s latest look is good as gold.\nThe Princess of Wales donned an all-gold ensemble as she arrived at Windsor Castle with her husband Prince William Sept. 17, where King Charles III...","url":"https://www.eonline.com/news/1422720/kate-middleton-wears-princess-dianas-tiara-at-state-banquet?cmpid=rss-syndicate-genericrss-us-top_stories","image":"https://akns-images.eonline.com/eol_images/Entire_Site/20250917/406f96a3-9a85-4203-a375-73b6994bbbc5_1758148220.jpg?fit=around%7C1200:1200&output-quality=90&crop=1200:1200;center,top","video":null,"publish_date":"2025-09-17 22:34:16","author":"Alexander McQueen","authors":["Alexander McQueen"],"language":"en","category":"politics","source_country":"US","sentiment":0.469},{"id":361376196,"title":"4 House Republicans vote with Dems to block resolution censuring Ilhan Omar for Charlie Kirk comments","text":"The House of Representatives voted along bipartisan lines on Wednesday to table a resolution to censure Rep. Ilhan Omar, D-Minn., over comments about Charlie Kirk. Four House Republicans voted with Democrats to table the legislation, effectively blocking it from receiving its own House-wide vote. A vote to table is a procedural mechanism allowing House members to vote against consideration of a bill without having to vote on the bill itself. The measure was blocked in a narrow 214 to 213 vote. The four Republicans who voted to table the measure are Reps. Mike Flood, R-Neb., Tom McClintock, R-Calif., Jeff Hurd, R-Colo., and Cory Mills, R-Fla. Mills had been facing his own retaliatory censure led by House progressives, but that effort was dropped when Omar's censure failed. ABC REPORTER CALLS CHARLIE KIRK ASSASSIN'S TEXT MESSAGES WITH TRANSGENDER PARTNER ‘VERY TOUCHING’ McClintock told Fox News Digital that while he condemned Omar's response to Kirk's death, he voted against moving forward with the censure based on First Amendment grounds. \"Ilhan Omar’s comments regarding the assassination of Charlie Kirk are vile and contemptible. They deserve the harshest criticism of every man and woman of good will. But this disgusting and hateful speech is still speech and is protected by our First Amendment,\" he said. \"Censure is formal punishment by the House and we have already gone too far down this road. Omar’s comments were not made in the House and even if they were, they broke no House rules. A free society depends on tolerating ALL speech — even hateful speech — confident that the best way to sort good from evil is to put the two side by side and trust the people to know the difference.\" Rep. Nancy Mace, R-S.C., moved to force a vote on the resolution Tuesday by introducing it as \"privileged,\" a mechanism that requires House leaders to deal with a measure within two legislative days. It's part of the continued fallout from Omar's remarks made days after Kirk's assassination, which conservatives have accused of disparaging the conservative activist's legacy. She specifically faced backlash over an interview with progressive news outlet Zeteo, where she criticized Kirk's past commentary and Republicans' reaction to the shooting. She later accused Republicans of taking her words out of context, and she called Kirk's death \"mortifying.\" She previously told Zeteo days after Kirk's assassination that he had \"downplayed slavery and what Black people have gone through in this country by saying Juneteenth shouldn't exist.\" SCRUTINY INTENSIFIES OVER SECURITY LAPSES SURROUNDING THE CHARLIE KIRK SHOOTING \"There are a lot of people who are out there talking about him just wanting to have a civil debate,\" the \"Squad\" member said. \"There is nothing more effed up, you know, like, than to completely pretend that, you know, his words and actions have not been recorded and in existence for the last decade or so.\" She later posted on X amid the backlash, \"While I disagreed with Charlie Kirk vehemently about his rhetoric, my heart breaks for his wife and children. I don’t wish violence on anyone. My faith teaches me the power of peace, empathy, and compassion. Right-wing accounts trying to spin a false story when I condemned his murder multiple times is fitting for their agenda to villainize the left to hide from the fact that Donald Trump gins up hate on a daily basis.\" Kirk was shot and killed during a college campus speaking event in Utah. Mace introduced her resolution on the House floor Tuesday by reading it on the House floor. \"Charlie Kirk was a lifelong advocate for freedom of speech, civil political discourse and the political engagement of youth,\" Mace read aloud. \"One day after the assassination of Charlie Kirk, Representative Ilhan Omar gave an interview on Zeteo's town hall with Mehdi Hassan, in which she smeared Charlie Kirk and implied he was to blame for his own murder.\" CLICK HERE TO GET THE FOX NEWS APP Mace also accused Omar of reposting a video that said, \"Don't be fooled, these people don't give a single s--- about Charlie Kirk. They're just using his death to further their Christo-fascist agenda.\" Other progressives leaped to Omar's defense, including Rep. Delia Ramirez, D-Ill., who posted on X, \"Babe, those are not direct quotes from Ilhan Omar. According to the APA, if you use a direct quotation, it must sustain your claim. The quotes you used are not Ilhan’s words, they are not in context and do not prove your point. Read before you tweet.\" It's one of several measures targeting Omar over her comments. Rep. Buddy Carter, R-Ga., who is running for Senate, introduced his own measure to strip Omar of her committee assignments on Monday.","summary":"House lawmakers voted to table a resolution censuring Rep. Ilhan Omar over her comments about Charlie Kirk days after his death.","url":"https://www.foxnews.com/politics/house-republicans-vote-dems-block-resolution-censuring-ilhan-omar-charlie-kirk-comments","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/ilhan-omar-capitol-speaking.jpg","video":"https://www.foxnews.com/video/6379692837112","publish_date":"2025-09-17 22:33:47","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"US","sentiment":-0.249},{"id":361370294,"title":"South Park’s latest episode abruptly cancelled just hours before airing","text":"South Park creators Trey Stone and Matt Parker issued a rare statement on Wednesday, just hours before the latest episode of their headline-making 27th season was supposed to air, saying the new episode wouldn’t make it to screens because they “didn’t get it done in time.”\n\n“Apparently when you do everything at the last minute sometimes you don’t get it done. This one’s on us. Thanks to Comedy Central and South Park fans for being so understanding. Tune in next week,” the duo wrote.\n\nIt’s particularly questionable given the anticipation surrounding the upcoming fifth episode, which would’ve been the first to go to air since Charlie Kirk’s assassination in Utah last week.\n\nThe latest season of South Park has spurred significant controversy, with the notoriously-unrestrained show going after US President Donald Trump and MAGA culture like it never has before, with Kirk himself mocked in an episode just weeks before he was killed at a university in the US state.\n\nPremiering on August 6, the episode titled “Got a Nut” showed main character Eric Cartman embody Kirk’s mannerisms, style and haircut, becoming a “master debater” who tours universities to challenge progressives.\n\nThe depiction mirrored Kirk’s polarising reputation as a viral influencer who frequently engages in heated disputes peddling his progressive values, which have over the years seen him condemn “woke” culture, speak out against critical race theory, gender identity and climate change.\n\nWhile Kirk’s feature was actually quite a mild depiction by South Park’s ruthless standards, Mr Trump has copped a brutal portrayal in the new season, which showed the President involved in a romantic relationship with Satan. The latest episode saw Satan fall pregnant with Mr Trump’s baby. \n\nSouth Park, which has been airing new episodes biweekly since its July 23 premiere, is expected to have a delayed return next Wednesday, September 24. \n\nFurther reports indicate South Park will take an extended break before airing its sixth episode on October 15, with the remaining four episodes dropping biweekly until December 10.\n\nStone and Parker are yet to comment on Kirk’s death, though the “Got A Nut” episode has been yanked from repeat viewing on Comedy Central. It remains available to stream on Paramount+.\n\nDespite coming off as a joke in the long-running satire, Kirk laughed off his portrayal in one of his last media interviews with Fox News Digital, describing his characterisation in the show as a “badge of honour”.\n\n“I think it’s kind of funny and it kind of goes to show the cultural impact and the resonance that our movement has been able to achieve,” Kirk told Fox News Digital in July ahead of the episode airing.\n\n“They’re professional comedians. They’re probably gonna roast me, and I think that’s fine, and that’s what it’s all about, being in public life and, you know, making a difference, and I’m gonna have a good spirit about it. I’ll watch it. I’m going to laugh at it.\n\n“From a religious standpoint, we’re all sinners. We all fall short of the glory of God. \n\n“Like from a more practical life standpoint, we’re all broken people. Stop taking yourself so seriously. That’s probably one of the problems that we’ve had in our politics is that people can’t take a joke.”\n\nUtah local Tyler Robinson, 22, has since been arrested over Kirk’s shooting, charged with aggravated murder.","summary":"The controversial show’s creators issued a rare statement announcing the latest episode wouldn’t go to air, just hours before it was meant to.","url":"https://www.news.com.au/entertainment/tv/south-parks-latest-episode-cancelled-just-hours-before-airing/news-story/c576119fd9a5c0c3da8fa1c15f4d08e0?from=rss-basic","image":"https://content.api.news/v3/images/bin/a95d8f39701f63909579ab1bbd9ddf9f","video":null,"publish_date":"2025-09-17 22:31:44","author":"Lexie Cartwright","authors":["Lexie Cartwright"],"language":"en","category":"politics","source_country":"au","sentiment":-0.158},{"id":361370296,"title":"Kate wows in jaw-dropping golden gown","text":"Donald Trump was the guest of honour at a lavish white-tie state banquet at Windsor Castle on Wednesday evening, UK time, after a whirlwind day of pomp and ceremony with the royal family.\n\nThe US president and First Lady, Melania Trump, were hosted by the King and Queen for the evening’s opulent dinner at the historic estate.\n\nMORE: King Charles’ savvy $33bn side hustle\n\nThey were joined by around 160 other guests – including senior royals such as the Prince and Princess of Wales – for the event within St George’s Hall.\n\nPrince William and Kate shared a portrait of their own on social media before making their entrance, captioning it simply “ready for The State Banquet”, adding an American and British flag.\n\nThe princess is known for her sartorial slam-dunks but Wednesday night’s couture gown by Phillipa Lepley – coupled with the glittering Queen Mary’s Lover’s Knot Tiara – could quite easily be her best look yet.\n\nMORE: ‘Scandalous’: Royal Family’s $260m payday slammed\n\nEven President Trump, who sat next to Kate at the dinner, seemed dazzled by his close encounter with the Princess.\n\n“His Majesty has also raised a remarkable son in His Royal Highness, the Prince of Wales. Really amazing. We’ve gotten to know you and I think you’re going to have an unbelievable success in future,” he said during his speech. \n\n“Melania and I are delighted to visit again with Prince William and to see Her Royal Highness, Princess Catherine, so radiant and so healthy, it’s so beautiful. It’s really a great honour, thank you.”\n\nFour courses are being served on the Waterloo Table, which is said to be the longest in Britain and took 10 people around four days to set up.\n\nThe King’s speech\n\nAddressing those present during the banquet, King Charles spoke of the “enduring bond” between both nations, a relationship that has made them “safer and stronger through the generations.” \n\nBut the King, a lifelong conservationist, also included what appeared to be a pointed message aimed squarely at the US President, who has made deep funding cuts to his country’s National Parks system.\n\nKing Charles said that “we also have a precious opportunity to safeguard and to restore the wonders and beauty of Nature for the generations who follow us. We share the ambition, and determination, to preserve our majestic lands and waters; above all, to ensure that we have clean water, clean air and clean food.”\n\n“Our legacy for the next 250 years and beyond is to ensure that our children, grandchildren, and those who come after them, can experience the awe and magnificence of the natural treasures found in the countryside, on the coasts, in the seas and in the National Parks established by your predecessors and mine,” he said. \n\nIn footage shared by the Palace, the King and Queen were seen inspecting the final layout just a couple of hours ahead of the dinner.\n\nSeasonal flowers hand-picked from the Windsor Castle gardens and Windsor Great Park have been placed in elaborate displays along the table – and it’s expected they will be donated to a floral charity, of which Camilla is patron, after the banquet.\n\nThe menu, prepared by royal chefs, was written in French as per tradition (it’s considered the language of diplomacy) and a bespoke cocktail symbolising the enduring the “special relationship” between the UK and the US has been crafted for the occasion.\n\nHowever, Mr Trump himself is unlikely to give it a try – he’s a well-known teetotaller.\n\nIt follows a whirlwind itinerary on Wednesday as the Trumps kickstarted their state visit.\n\nThe President and First Lady arrived at Windsor around midday on Wednesday, where they were greeted by the Prince and Princess of Wales before taking part in a carriage procession which also included the King and Queen and a handful of US dignitaries.\n\nFollowing the military display, the King and Queen led the Trumps into Windsor Castle for a private lunch and then an inspection of a carefully curated special exhibition of artefacts relating to the US and the UK’s history.\n\nAway from the cameras, and following a tour of St George’s Chapel, the couple was then led to the late Queen’s tomb where they paid their respects and laid a wreath.\n\nFor weeks, the town of Windsor has been gearing up for the historic occasion, with the royal family rolling out the red carpet to host Mr Trump on his second state visit – an unprecedented honour for a US president.","summary":"President Trump raved about “beautiful, radiant” Princess Kate after the pair were sat next to each other at today’s lavish state banquet.","url":"https://www.news.com.au/entertainment/celebrity-life/royals/royal-family-host-lavish-state-banquet-for-donald-and-melania-trump-at-windsor-castle/news-story/65909991be721e85514feff712d3cc9d?from=rss-basic","image":"https://content.api.news/v3/images/bin/7e68b29d9b7652df1a4a17d6fd900fe4","video":null,"publish_date":"2025-09-17 22:31:44","author":"Bronte Coy,Nick Bond","authors":["Bronte Coy","Nick Bond"],"language":"en","source_country":"au","sentiment":0.767},{"id":361384136,"title":"Watch day one of Donald Trump’s historic UK state visit in three minutes","text":"Day one of Donald Trump’s state visit to the UK, which included a royal welcome and a lavish banquet, has concluded.\n\nOn his first official day, he paid a visit to St George's Chapel to lay a wreath at Queen Elizabeth II’s grave and witnessed a guard of honour and carriage procession. \n\nThe spectacle continued late into the evening with a luxury state banquet at St George’s Hall, which was attended by 160 guests.\n\nBoth the US president and the King gave speeches, with the pair both praising the UK and US’ “special relationship”.","summary":"Day one of Donald Trump’s state visit to the UK, which included a royal welcome and a lavish banquet, has concluded.","url":"https://www.independent.co.uk/tv/news/trump-uk-state-visit-day-one-video-b2828686.html","image":"https://static.independent.co.uk/2025/09/17/20/41/SEI266560167.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/wwkqublb-LkahLqdO.mp4","publish_date":"2025-09-17 22:28:23","author":"Holly Bishop","authors":["Holly Bishop"],"language":"en","category":"politics","source_country":"gb","sentiment":0.559},{"id":361376498,"title":"Obama says US faces ‘political crisis’ after killing of Charlie Kirk","text":"Former US President Barack Obama has warned of a \"political crisis of the sort that we haven't seen before\" in the wake of the killing of Charlie Kirk.\n\nAt an event in Pennsylvania on Tuesday, Obama said he did not know Kirk and disagreed with many of his views, but called the killing \"horrific and a tragedy\".\n\nHe criticised Donald Trump's remarks towards his political opponents and pointed to previous Republican presidents who, he said, emphasised national unity in moments of high tension, US media report.\n\nIn response, the White House called Obama the \"architect of modern political division\".\n\nKirk, 31, died of a single gunshot wound while speaking at Utah Valley University in Orem on 10 September.\n\nOn Tuesday, Tyler Robinson, 22, was formally charged with Kirk's murder, weapons offences and other charges. Prosecutors said they would seek the death penalty.\n\nUtah County Attorney Jeffrey Gray said Robinson had sent text messages which allegedly said he shot Kirk because he \"had enough of his hatred\".\n\nBefore Robinson was captured, top Trump allies pinned blame for the killing on left-wing activists and rhetoric from Democratic lawmakers and their supporters.\n\nAttorney General Pam Bondi has suggested that the administration will crack down on \"hate speech\" – although there is no specific US hate speech law. Vice-President JD Vance has led calls to expose people who celebrated or condoned Kirk's killing or were critical of him after his slaying.\n\n\"Call them out, and hell, call their employer,\" Vance said as he guest-hosted Kirk's podcast.\n\nSpeaking in Erie, Pennsylvania, Obama said: \"I think at moments like this, when tensions are high, then part of the job of the president is to pull people together.\"\n\nHe urged Americans to \"respect other people's right to say things that we profoundly disagree with\".\n\nObama praised Utah Governor Spencer Cox, a conservative Republican who he said had shown \"that it is possible for us to disagree while abiding by a basic code of how we should engage in public debate\".\n\nHe also endorsed the response of Pennsylvania Governor Josh Shapiro, a Democrat, whose official residence was firebombed earlier this year in what police called a targeted attack.\n\nThe former president contrasted those reactions with comments made by Trump and his allies.\n\nObama said that he did not use a 2015 mass shooting by a white supremacist at a black church in South Carolina to go after his political enemies, and pointed out that after the 11 September 2001 attacks, President George W Bush \"explicitly went out of his way to say, 'We are not at war against Islam'.\"\n\n\"And so when I hear not just our current president, but his aides, who have a history of calling political opponents 'vermin', enemies who need to be 'targeted,' that speaks to a broader problem that we have right now and something that we're going to have to grapple with, all of us,\" Obama told the crowd, according to reports.\n\nIn a statement to the BBC, a White House spokesperson rejected the allegations and accused Obama of stoking division while he was president.\n\n\"Obama used every opportunity to sow division and pit Americans against each other,\" the spokesperson said.\n\n\"His division has inspired generations of Democrats to slander their opponents as 'deplorables,' or 'fascists,' or 'Nazis.'\"\n\nAfter leaving office, US presidents generally tend to temper criticism of their successors, however in recent months Obama has hit out at Trump's moves against universities and judges, and has also criticised Democratic party leaders for failing to push back harder against White House policies.","summary":"Former US President Barack Obama has warned of a \"political crisis of the sort that we haven't seen before\" in the wake of the killing of Charlie Kirk.","url":"https://www.myjoyonline.com/obama-says-us-faces-political-crisis-after-killing-of-charlie-kirk/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/09/image-1547.png","video":null,"publish_date":"2025-09-17 22:28:00","author":"Abubakar Ibrahim,Bbc 28pm","authors":["Abubakar Ibrahim","Bbc 28pm"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.208},{"id":361378864,"title":"Fani Willis’s declined appeal is latest bump for ‘backfired’ Trump prosecution: Joe Concha","text":"“Fani Willis, two years ago, had Donald Trump lined up for a prison jumpsuit. Open and shut case, it’s Fulton County, Georgia, she thought she could go RICO on him. Now she’s going to join Trump in being a, probably, a McDonald’s employee, the only place that may employ her. And meanwhile, Trump and Melania, where are they today? Getting feted by the king of England in a horse-drawn carriage,” Concha said on Wednesday during Fox Business’s Kudlow. \n\nConcha also said the myriad of legal battles “almost helped Trump in the end,” as Trump would talk about “the deep state” and “own the news cycle” for up to 45 minutes. The candidate, now president, would highlight how his charges were “BS,” and two years later, none of the legal battles are having any effect while Trump is in the White House with a Republican-controlled Congress.\n\n“This thing backfired in the biggest way possible,” Concha said.\n\nWillis was removed from the case following revelations that she had concealed a romantic relationship with special prosecutor Nathan Wade, whom she hired in 2021. Defense attorneys alleged the relationship constituted a conflict of interest and undermined public confidence in the prosecution.\n\nWade testified before Congress in October and said Willis had started preparations for Trump’s prosecutions before she took office in January 2021. He confirmed Willis began outreach for a Trump-related search committee “sometime” after the 2020 election, but before she took office.\n\nTrump poked fun at Willis and Wade in an edited video he uploaded on X. The video shows Wade romantically thinking of Willis as Marvin Gaye’s “Let’s Get It On” plays. The original video features Wade giving a lengthy pause when asked if he ever went to a cabin with Willis, eventually saying “no.”","summary":"Washington Examiner’s Joe Concha said the latest setback in prosecuting President Donald Trump further illustrates how the legal battles “almost helped” Trump. The Georgia Supreme Court declined to hear an appeal from Fulton County District Attorney Fani Willis on Tuesday, leaving in place a lower-court ruling that disqualified her from prosecution. Concha noted “how times [&#8230;]","url":"https://www.washingtonexaminer.com/news/3812712/fani-williss-declined-appeal-is-latest-bump-for-backfired-trump-prosecution-joe-concha/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP24170779612010.jpg?w=696","video":null,"publish_date":"2025-09-17 22:20:52","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.354},{"id":361378548,"title":"Here’s how Santa Clara plans to spend the first $100 million of Measure I money","text":"Santa Clara is gearing up to spend its first tranche of Measure I funds — a $400 million bond passed by voters last November that will help repair some of the city’s long-overdue infrastructure needs, including its historic aquatic center.\n\nCity officials plan to spend the money in several phases, with the first phase utilizing about 25% of the funds. The Santa Clara City Council on Tuesday unanimously approved the project list for the first $100 million, with the largest share of the money going to parks, libraries and aquatics facilities.\n\nCity Manager Jovan Grogan called the bond “a once in a generation opportunity to invest in our infrastructure.”\n\nMeasure I marked the first time since 1959 that the city had a general facilities bond on the ballot, despite unsuccessful attempts at a similar initiative in 2018 and 2022. City officials estimated last year that Santa Clara had more than $600 million in unfunded infrastructure needs.\n\nThe $400 million bond will be funded by levying roughly $19 per $100,000 of assessed property value each year — from 2025 to 2060. Homeowners are expected to pay about $128 annually, while the 20 largest commercial property owners in the city will pay roughly $154,000 on average.\n\nCity officials said that the first bond sale of $100 million will occur in the first quarter of 2026. A second phase, which will be larger than the first, is expected to occur in 2028, and the remaining funds will be doled out after 2030.\n\nElizabeth Klotz, an assistant city manager who oversees Santa Clara’s parks and recreation department, said that projects on the list were categorized based on community impact and readiness.\n\n“This really reflects the community’s priorities in updating and modernizing our public facilities,” she said.\n\nThe $100 million is being utilized in the following ways:\n\n$27,370,000 for streets and transportation including street resurfacing, ADA sidewalk improvements, bicycle wayfinding and rehabilitation of sections of the San Tomas Aquino Creek Trail.\n$12,285,450 for fire stations and emergency response including the replacement of two fire stations, security upgrades and the renovation of the fire training tower.\n$805,000 for police facilities including feasibility studies for a Real Time Intelligence Center and a new police training facility, as well as new perimeter fencing and security gates at the Emergency Operations facility.\n$38,438,750 for parks, libraries and aquatics facilities including the renovation of the George F. Haines International Swim Center, Central Park Library restroom remodeling and renovation of playgrounds at Warburton and Henry Schmidt parks.\n$16,585,300 for storm drain systems improvements.\n$1,150,000 for historic buildings and beautification, which will go to replacing the roof at the Triton Museum.\n\nThe project with the largest price tag in the first phase is the $24.2 million set aside for the International Swim Center.\n\nThe nearly 60-year-old facility, which bears the name of the late renowned U.S. Olympic swimming coach, was closed by the city in January 2024 over safety concerns. Its main three user-groups — Santa Clara Swim Club, Santa Clara Artistic Swimming and Santa Clara Diving — have spent the last 20 months pushing the city to fix the historic facility, which was once home to some of the greatest Olympic swimmers of the 20th century.\n\nCity officials said the first phase will include replacing the pool decks, plumbing, boilers and gutter system for all three pools. The dive tower, which was deemed structurally unsafe, will also be replaced. Some of the money also will go to designing a new administrative building and repairing the bleachers. Construction is expected to begin in February 2026.\n\nWith construction costs rising and the implementation of new tariffs from President Donald Trump, Councilmember Albert Gonzalez on Tuesday pressed city officials to work quickly.\n\n“Time is not our friend,” he said. “It’s important for us to utilize the funding that we’re getting from the community, they’re entrusting us with that, that we can utilize it as best we can. If we can spend it sooner, we can get more from those dollars.”\n\nGrogan said the city is keeping its eye on tariffs, noting that “it absolutely has a possibility to increase costs.”\n\n“We will need to be flexible to address that,” he said. “Of course, when we can buy from the U.S. to avoid tariffs we will absolutely do that.”","summary":"Voters passed the $400 million infrastructure bond last November.","url":"https://www.mercurynews.com/2025/09/17/heres-how-santa-clara-plans-to-spend-the-first-100-million-of-measure-i-money/","image":"https://www.mercurynews.com/wp-content/uploads/2022/04/GENERIC-SANTACLARACITY-2.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-17 22:19:32","author":"Grace Hase","authors":["Grace Hase"],"language":"en","source_country":"us","sentiment":-0.123},{"id":361371010,"title":"Trump gushes over 'radiant and healthy' Kate in powerful tribute to King Charles at lavish state banquet","text":"President Donald Trump praised 'radiant' and 'healthy' Princess Kate as he delivered a toast Wednesday night to King Charles at a lavish state banquet at Windsor Castle. \n\nThe president of the United States found himself sandwiched between the king and Kate Middleton, while First Lady Melania Trump and Queen Camilla sat across from their husbands. \n\nHe spoke highly of both royals. \n\n'I tell you I just stood in line and shook about 150 hands, and the king knew every single person and every single company,' Trump said. 'And some of them had bad names like XYZ-Q3. And he knew every one of them.' \n\n'Or at least I think he did, because nobody was complaining,' Trump said to laughs. 'I was very impressed with that.' \n\nOn a more serious note, Trump said the unprecedented second state dinner he was receiving from the British royal family was 'one of the highest honors of my life.'\n\n'Such respect for you and such respect for your country,' Trump told the king. 'For many decades, his majesty the king has epitomized the fortitude, nobility and the spirit of the British monarchy and the British people.' \n\nTrump said Charles had 'dedicated himself to preserving the glory and unique character of this kingdom' and gave a hat-tip to the king's environmental work. \n\nThe president also acknowledged Charles' work as a father, telling him he's raised a 'remarkable son.' \n\nTrump told Prince William, who was seated across the grand table, that 'we've gotten to know you' and the future king will have an 'unbelievable success in the future.' \n\n'Melania and I are delighted to visit again with Prince William and to see Her Royal Highness, Princess Catherine, so radiant and so healthy and so beautiful,' Trump said. \n\nThe princess is now in remission after being treated with chemotherapy for cancer. \n\nThe president gave a nod to Camilla at the end of his speech, too. \n\n'On behalf of all Americans, I offer a toast to one of the great friendships. To two great countries and to His Majesty, King Charles III, a very, very special man and also a very, very special queen,' Trump said. \n\nAt the top of his remarks, Trump relished how he was the first American president to get a second state from the British monarchy.\n\nHis first took place in 2019 with Queen Elizabeth II at Buckingham Palace. \n\n'It's a lot of presidents,' Trump commented. 'And this was the second state visit - and that's the first - and maybe that's going to be the last time.'\n\n'I hope it is actually,' the president said to laughs. \n\nFor the second visit, the palace made sure Trump was treated to even grander displays of pomp - a carriage ride, two musical military demonstrations and a red, white and blue flyover. \n\nBoth Kate and Melania Trump wore dresses with gold tones, with the first lady sporting an off-shoulder yellow gown with sleeves and a pink belt. \n\nKate opted for a gold lace gown and spectacular crown, paired with a royal blue sash. \n\nThe only one of Trump's children to travel with him on the U.K. trip was Tiffany Trump, who sported an off-shoulder midnight blue gown. \n\nCamilla also sported a bold blue. \n\nTiffany was seated next to Apple's Tim Cook - as the number of tech titans invited to the dinner displayed Trump's newfound popularity in Silicon Valley. \n\n Also invited - Nvidia CEO Jensen Huang and OpenAI's Sam Altman. \n\nTiffany brought along her husband, Michael Boulos, who was cut from the guest list during the 2019 state dinner at Buckingham Palace as the couple hadn't gotten married yet. \n\nDespite Trump expressing his displeasure with some of the tycoon's media companies, Rupert Murdoch snagged an invite - along with his wife Elena. \n\nThe founder of Newsmax, Christopher Ruddy, was also on hand. \n\nOn the menu Wednesday night: Hampshire watercress panna cotta with parmesan shortbread and quail egg salad, organic Norfolk chicken ballotine wrapped in courgettes with a thyme and savory infused jus, and vanilla ice cream bombe with Kentish raspberry sorbet interior with lightly poached Victoria plums. \n\nThe 160 guests - invited by the White House, the British government and the palace - were seated at one large table that was 57.51 yards long. \n\nOne hundred and thirty-nine candles decorated the table with flowers brought in from the gardens of Buckingham Palace and the Saville Garden in Windsor Great Park.","summary":"President Donald Trump praised 'radiant' and 'healthy' Princess Kate as he delivered a toast Wednesday night to King Charles at a lavish state banquet at Windsor Castle.","url":"https://www.dailymail.co.uk/news/article-15108549/donald-trump-kate-middleton-tribute-toast.html","image":"https://i.dailymail.co.uk/1s/2025/09/17/22/102231725-0-image-a-8_1758143480952.jpg","video":null,"publish_date":"2025-09-17 22:17:18","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":0.77},{"id":361371014,"title":"The history behind Kate's glitzy tiara: The Princess of Wales dazzles in Diana's Lovers' Knot as she attends state banquet with President Trump","text":"The history behind Kate's glitzy tiara: The Princess of Wales dazzles in Diana's Lovers' Knot as she attends state banquet with President Trump\n\nKate donned her favourite tiara for the state banquet on Wednesday evening \n\nREAD MORE: A feast for the eyes! Inside the glitzy state banquet for the Trumps at St George's Hall - with 1,452 pieces of cutlery polished by hand\n\nBy GINA KALSI, FEMAIL REPORTER\n\nPublished: 21:57 BST, 17 September 2025 | Updated: 23:15 BST, 17 September 2025\n\nThe Princess of Wales commanded the room as she stepped out in the famous Lovers' Knot tiara for President Trump's state banquet in Windsor Castle on Wednesday evening. \n\nKate, 43, and her husband Prince William, 43, joined the US politician, his wife Melania and other members of the Trump family at Windsor Palace alongside King Charles, 76, and Queen Camilla, 77. \n\nAnd the mother-of-three looked breathtakingly elegant in a structured Phillipa Lepley silk crepe gown underneath a hand-embroidered gold Chantilly lace evening coat, which she paired with a matching clutch bag.\n\nShe also donned the late Queen Elizabeth II's and the King's Royal Family Order. Over her frock, she sported a blue sash, representing that she is a Dame Grand Cross of the Royal Victorian Order.\n\nShe was all smiles as she walked alongside Prince William into Windsor's historic St George's Hall, where significant events are currently being held while Buckingham Palace undergoes renovation. \n\nThe mother-of-three wore her chocolate brown tresses down in a wavy style, with Princess Diana's Lovers' Knot tiara placed gently on top of her head for the glitzy occasion. \n\nAlthough Kate has four tiaras on at her disposal, the pearl embroidered Lovers' Knot appears to be a firm favourite. Of the Princess of Wales' 15 appearances in a tiara, she has opted to wear the Lovers' Knot for 10 of them. \n\nThe future queen has worn it to several state banquets, including when President Trump and the First Day visited the country during the first time he was in office in 2019. \n\nKate wore her chocolate brow tresses down in a wavy blow-dry, with Princess Diana 's Lovers' Knot tiara placed gently on top of her head for the glitzy occasion\n\nThe glittering heirloom was kept in a safe at Buckingham Palace after Diana's death in 1997, before it was handed to Kate.\n\nThe pearl crown was created in 1914 by the House of Garrard for Queen Mary as she wanted a similar tiara owned by her grandmother, Princess Augusta of Hesse. \n\nAccording to the Court Jeweller, when Mary commissioned the piece, she 'sacrificed a tiara from her own jewellery collection, the Ladies of England Tiara, to make it.'\n\nThe Lovers' Knot was also adored by Princess Diana, who wore it to the opening of parliament in 1981, shortly after marrying Charles. Kate's mother-in-law was pictured in the stunning piece several times over her lifetime, frequently wearing it to evening events. \n\nIt is often rare to see royals wearing tiaras before 5pm, as the glitzy, jewelled headpieces are generally reserved for formal events, which is one of the reasons why the heirlooms are dusted off and often pictured at state banquets. \n\nHowever, the one exception to the rule is at a royal wedding. As ceremonies are usually held at 11am, ladies in the royal fold are often excused from regulation and allowed to wear sparkling crowns on their big day. \n\nTiaras are also usually on loan to a royal for an entire lifetime. Princess Kate currently has four tiaras at her disposal: the Lovers' Knot, the Lotus Flower, the Strathmore Rose and the Cartier Halo. \n\nBut while the Lovers' Knot gets polished significantly more than the rest of the tiaras in the royal vault, one has not seen the light of day since the Princess of Wales' wedding day in 2011 - the Cartier Halo.\n\nAlthough the Kate has four tiaras on at her disposal, the pearl embroidered Lovers' Knot (pictured) is a firm favourite \n\nKate (pictured alongside William) Looked breathtakingly elegant in a structured Phillipa Lepley silk crepe gown underneath a hand-embroidered gold Chantilly lace evening coat\n\nIn 1936, George VI commissioned a French jewellery house to the tiara with diamonds and platinum he had purchased for the Queen Mother before he became King.\n\nShe was pictured in the glimmery piece shortly after she received it, before it was then passed down to her daughter, Queen Elizabeth, on her 18th birthday in 1944.\n\nHowever, the late monarch has never worn the Cartier Halo tiara publicly. According Tatler, experts believe Elizabeth did not wear it out publicly as she was given it at a time where Britain was at war and therefore did not find it appropriate to wear such a piece. \n\nOn Wednesday evening, Queen Camilla opted to wear the Belgian sapphire tiara, a dazzling diamond bandeau that dates back to 1932. \n\nShe paired the standout piece with a royal blue silk marocain embroidered dress by Fiona Clare and sported the King's Family Order. \n\nIn November 2022, just two months after Queen Elizabeth's death, Camilla wore her late mother-in-law's Belgian sapphire tiara during a state banquet held for South Africa's leader, Cyril Ramaphosa.\n\nCamilla teamed the piece with her elegant Bruce Oldfield gown and completed the look with a diamond-trimmed pendant, containing a photograph of the former monarch.\n\nThe Belgian sapphire tiara was acquired to complement a Victorian-era sapphire necklace and earrings that were gifted by Elizabeth's father, King George VI, on her wedding day in 1947.\n\nOn Wednesday evening, Queen Camilla opted to wear the Belgian sapphire tiara, a dazzling diamond bandeau that dates back to 1932\n\nIn 1963, Queen Elizabeth purchased a nineteenth-century sapphire necklace that once belonged to Princess Louise of Saxe-Coburg and Gotha. As per her request, it was set on a frame and turned into a tiara. \n\nBREAKING NEWS\n\nMelania Trump bares her shoulders in a daring yellow gown at lavish banquet during UK state visit\n\nIn a warm and witty speech during the banquet, the King welcomed the Trumps to Windsor Castle, highlighting the two countries' 'unparalleled partnership'. \n\nThe US President and First Lady Melania were joined by his daughter Tiffany Trump and her business executive husband, Michael Boulos. \n\nCharles said: 'This unique and important occasion reflects the enduring bond between our two great nations. Anchored by the deep friendship between our people, this relationship which, with good reason, we are our predecessors have long called 'special', has made us safer and stronger through the generations.\n\n'Our people have fought and died together for the values we hold dear… we have celebrated together, mourned together and stood together in the best and worst of times.'\n\nThe King did not shy away from referring the War of Independence, saying:' My five times Great Grandfather, King George III, for his part, did not spare his worlds when he spoke of the revolutionary leaders.\n\n'Today, however, we celebrate a relationship between our two countries that surely neither Washington nor King George III could have possibly imagined. The ocean may still divide us, but in so many other ways we are now the closest of kin.'\n\nHe also amusingly referred to how in the 1970s President Richard Nixon, who was said to be 'obsessed' with the British Royal Family, tried to arrange a marriage between him and his daughter, Tricia.\n\n'Had the media succeeded in the 1970s in their own attempt at deepening the special relationship, I might have been married off within the Nixon family!' he joked.\n\nHighlighting cultural, scientific, defence, security, intelligence, military and environmental links between the UK and US, the King concluded by toasting our 'remarkable bond' and 'shared commitment to independence and liberty'.\n\nCamilla wore her elegant Bruce Oldfield gown and completed the look with a diamond-trimmed pendant, containing a photograph of the former monarch\n\nPictured: Queen Camilla, King Charles, US President Donald Trump and First Lady Melania Trump on Wednesday evening \n\nTrump opened his speech by saying 'this is truly one of the highest honours of my life'. He drew laughter from the hall as he joked that he hoped he would be the only US president to have two state visits. \n\nHe then praised the King for raising a 'remarkable son' in Prince William, and how Charles knew all of the guests' names - even those 'with bad names like \"XYZ-Q3\"'.\n\nIn a speech that appeared to slightly go off-script, the President talked about the beauty of Britain - and of the King.\n\nIn particular he praised his work with wounded veterans which, he said, 'was like no-one else'.\n\nThe Prince of Wales was also singled out for praise, with Trump saying he had got to know him and believed he would be 'an unbelievable success in the future'.\n\nAnd of the Princess of Wales? 'Princess Catherine so radiant, and so healthy and so beautiful,' he said.\n\nTrump also praised the 'lion-hearted people' of the UK.\n\nThe Maga leader was seated between his 'friend' King Charles III and Kate, who was wearing a couture gown by British designer Phillipa Lepley. \n\nBREAKING NEWS\n\nCharles salutes the nations' 'remarkable bond' in speech to 160 guests at Windsor\n\nTechnocrats among the delegation of US executives included Apple CEO Tim Cook, and Open AI's Sam Altman was sat next to Tory leader Kemi Badenoch.\n\nTrump's team did not, apparently, make any special requests as regards to the menu - which came as surprise to some of the White House press pack - which featured Hampshire watercress panna cotta, organic Norfolk chicken ballotine and vanilla ice bombe with a Kentish raspberry sorbet interior. \n\nKing Charles and Queen Camilla personally inspected the banquet table in St George's Hall. The royal couple surveyed the scene shown in footage posted on the official monarchy's social media.\n\nPink, purple and yellow blooms could be seen adorning the extravagant floral displays.\n\nThe monarch and Camilla shook hands with Household staff who were behind the meticulous planning and staging of the grand affair.\n\nAnd there were also several thoughtful touches such as a vintage port from 1945, the closest year to the president's birth (there was no vintage when he was born in 1946), and a 1912 cognac, the year of his mother, Mary's birth.\n\nMusic ranged from a James Bond medley to Elton John's Tiny Dancer and classical favourites, as well as Scottish dances in honour of the President's family origins.\n\nThe banquet, which had been laid out in the Great Hall, was nothing short of spectacular. Staff had started putting the 42.32 metre - or 51.75 yard - long table together a week ago.\n\nIt boasted 139 candles, 1,452 pieces of cutlery, all lovingly polished by hand, and seated 160 guests, each with five glasses by their setting. The last of the stunning seasonal flower displays picked from the local estate was set up just hours before they arrived.\n\nRoyalsWindsor CastlePrince William\n\nShare or comment on this article:\nThe history behind Kate's glitzy tiara: The Princess of Wales dazzles in Diana's Lovers' Knot as she attends state banquet with President Trump\n\nAdd comment","summary":"The Princess of Wales wore her chocolate tresses down in a wavy blow-dry, with Princess Diana 's Lovers' Knot tiara placed gently on top of her head for the glitzy occasion at Windsor Castle.","url":"https://www.dailymail.co.uk/femail/article-15108571/Kate-middleton-state-banquet-tiara-princess-diana-lovers-knot.html","image":"https://i.dailymail.co.uk/1s/2025/09/17/21/102229967-0-image-m-37_1758142627964.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/17/8085320905688922247/1024x576_MP4_8085320905688922247.mp4","publish_date":"2025-09-17 22:15:54","author":"Editor,Gina Kalsi","authors":["Editor","Gina Kalsi"],"language":"en","source_country":"gb","sentiment":0.448},{"id":361384908,"title":"Behar: There Is 'No End to the Incompetency' of Trump's Cabinet","text":"Wednesday on ABC’s “The View,” Joy Behar told her co-hosts that there is “no end to the incompetency of President Donald Trump’s cabinet officials.\n\nBehar said, “I’m sorry, I feel as though —”\n\nCo-host Whoopi Goldberg said, “Take a breath. Take a deep breath, Joy, take a breath.”\n\nBehar said, “I’m telling you I feel like we’re trapped in a bad movie, like you’ve got these incompetent people running the government and we’re like a bunch of sitting ducks. You’ve got the puppy killer. You’ve got the Signal-gate guy, what’s his name, Hegseth. You’ve got the brain worm. I mean, there’s no end to the incompetency that we are experiencing as Americans.”\n\nShe added, “So I can almost not even talk about individual situations like this, because the overall picture and the elephant in the room is that we’re screwed.”\n\nGoldberg said, “You know, we’re not screwed because —”\n\nBehar said, “I know you say that every day.”\n\nGoldberg said, “I say it every day, and yet we are still standing.”\n\nBehar said, “Just barely.”\n\nGoldberg said, “Yeah, but we’re up. Listen, lots of us have been down. We know where down is. It takes a lot to ruin a country. It takes a lot to ruin a country because people wake up and they start to go, you know what, I don’t like what I’m seeing.”\n\nFollow Pam Key on X @pamkeyNEN","summary":"Wednesday on ABC's \"The View,\" Joy Behar told her co-hosts that there is \"no end to the incompetency of President Donald Trump's cabinet officials.\n\n\nThe post Behar: There Is &#8216;No End to the Incompetency&#8217; of Trump&#8217;s Cabinet appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/09/17/behar-there-is-no-end-to-the-incompetency-of-trumps-cabinet/","image":"https://media.breitbart.com/media/2024/11/behar-640x335.jpg","video":null,"publish_date":"2025-09-17 22:11:57","author":"Pam Key","authors":["Pam Key"],"language":"en","category":"politics","source_country":"US","sentiment":-0.217},{"id":361378868,"title":"Blue states defy RFK Jr on vaccine policy with their own guidelines","text":"“Our states are united in putting science, safety, and transparency first — and in protecting families with clear, credible vaccine guidance. The West Coast Health Alliance stands united in protecting public health and always putting safety before politics,” Govs. Gavin Newsom (D-CA), Tina Kotek (D-OR), Bob Ferguson (D-WA), and Josh Green (D-HI) said in a joint statement.\n\nThe alliance broke from Kennedy’s updated CDC guidelines by recommending that all pregnant women and all children between the ages of 6 months and 2 years receive a COVID-19 vaccine.\n\nKennedy announced on May 27 that the CDC rescinded federal COVID-19 vaccine recommendations for all pregnant women and healthy children. In late August, the Food and Drug Administration approved the COVID-19 vaccine for people over the age of 65 but limited approval for younger people to only those with underlying conditions, a move that could leave millions of people in limbo for approval.\n\nNewsom’s office said in its press release on the alliance’s recommendations that Kennedy’s oversight of the Department of Health and Human Services is dismantling “science-based oversight.” However, HHS communications director Andrew Nixon said the department follows “Gold Standard Science,” referencing President Donald Trump’s May executive order.\n\n“Democrat-run states that pushed unscientific school lockdowns, toddler mask mandates, and draconian vaccine passports during the COVID era completely eroded the American people’s trust in public health agencies,” Nixon said in a statement to the Washington Examiner. “ACIP remains the scientific body guiding immunization recommendations in this country, and HHS will ensure policy is based on rigorous evidence and Gold Standard Science, not the failed politics of the pandemic.”\n\nThe CDC’s Advisory Committee on Immunization Practices, or ACIP, is set to meet this week to discuss the measles, mumps, rubella, and varicella, or MMRV, vaccines, the Hepatitis B vaccine, and the COVID-19 vaccine, according to a draft agenda.\n\nCDC NAMES FIVE NEW VACCINE BOARD MEMBERS DAYS AHEAD OF PIVOTAL MEETING\n\nThe alliance’s vaccine recommendations align with the CDC’s regarding who should receive the respiratory syncytial virus, or RSV, and flu vaccines. A complete list of the alliance’s published vaccine recommendations is available here.\n\nThe alliance says its recommendations for the three vaccines for the 2025-2026 virus season align with guidance from the American Academy of Pediatrics, the American College of Obstetricians and Gynecologists, and the American Academy of Family Physicians.\n\n“As a physician, I swore an oath to do no harm — and we know vaccines are among the most powerful tools to prevent illness and save lives,” Oregon Health Authority Director Sejal Hathi said in a statement. “At a time when Washington is undermining our most basic public health safeguards, Oregon is charting a different course. Our actions today affirm that here, public health is about protecting people, not playing politics.”\n\nMONAREZ WARNS OF VACCINE CHANGES POSSIBLE WITHOUT A PERMANENT DIRECTOR IN PLACE\n\nIt is still unclear whether insurance companies in the four states would be required to cover vaccines for groups not covered by HHS’s federal recommendations.\n\nThe alliance published its recommendations on the same day that former CDC Director Susan Monarez, who clashed with Kennedy over vaccine policies, testified before the Senate Committee on Health, Education, Labor, and Pensions.","summary":"California, Oregon, Washington, and Hawaii have joined together to issue their own independent vaccine recommendations ahead of flu season, breaking from the Centers for Disease Control and Prevention guidelines and what they call a federal &#8220;assault on science.&#8221; Governors of the four blue states formed the West Coast Health Alliance to collaborate on deviating from [&#8230;]","url":"https://www.washingtonexaminer.com/policy/healthcare/3812323/california-oregon-washington-hawaii-rfk-vaccine-guidelines/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/newsom-2.jpg?w=696","video":null,"publish_date":"2025-09-17 22:10:23","author":"Molly Parks","authors":["Molly Parks"],"language":"en","source_country":"US","sentiment":-0.241},{"id":361374136,"title":"Kate Middleton and Melania Trump took different approaches to white-tie fashion for a state banquet at Windsor Castle","text":"President Donald Trump and Melania Trump's state visit to the UK is in full swing.After warm greetings on the grounds of Windsor Castle with King Charles III, Queen Camilla, Prince William, and Kate Middleton, the president and first lady attended a banquet with the royals at St George's Hall on Wednesday evening.Tiffany Trump and her husband, Michael Boulos, were also guests at the dinner, along with tech CEOs, including Tim Cook and Sam Altman.The Trumps and the royal family were dressed to the nines for the white-tie banquet, and the first lady and the Princess of Wales arrived in arguably the most eye-catching ensembles of the night.Kate chose a floor-length Phillipa Lepley gown for the occasion.The cream silk dress hugged her figure, and she wore a gold overlay atop the simple gown. The lacy garment had long sleeves and a high neckline, bringing glamour and texture to the look.She paired the dress with a blue sash, medals on her lapel, and the Cambridge Lover's Knot Tiara, which originally belonged to Queen Mary. Carrying a pearl-encrusted clutch, Kate looked every bit the princess.Meanwhile, Melania Trump took a bolder approach to her fashion in a brightly colored gown that was hard to miss.Designed by Carolina Herrera, the yellow dress had a sleek silhouette. The gown had an off-the-shoulder neckline and a column skirt with a slit on the side for a daring edge.A chunky purple belt sat on Melania Trump's waist, and she completed the look with green, dangly earrings, adding even more color.The vivid dress struck a markedly different tone than the outfit Melania Trump arrived in the UK wearing. Dressed in head-to-toe Dior, she paired a gray blazer and skirt with a wide-brimmed purple hat, subtly matching her husband's tie.In general, the first lady has stuck to more subdued ensembles in her husband's second term, which has helped her maintain a low profile. It's unclear if the bright dress for the state banquet indicates another shift for Melania Trump in her approach to first lady fashion, or if it's just an exception to the tone she has struck in recent months.Only time will tell if Melania Trump's personal style is taking another turn, but it's safe to say she and Kate both wore memorable looks for the state banquet.","summary":"Melania Trump and Kate Middleton both wore eye-catching dresses for a state banquet at Windsor Castle, though the first lady chose a bolder color.","url":"https://www.businessinsider.com/melania-trump-kate-middleton-state-banquet-outfits-2025-9","image":"https://i.insider.com/68cb3062183847aa39d6fc26?width=1200&format=jpeg","video":null,"publish_date":"2025-09-17 22:09:26","author":"Samantha Grindell Pettyjohn","authors":["Samantha Grindell Pettyjohn"],"language":"en","category":"politics","source_country":"us","sentiment":0.393},{"id":361376178,"title":"House clears path for vote honoring Charlie Kirk, denouncing 'political extremism'","text":"The House voted Wednesday to advance a resolution honoring slain conservative activist Charlie Kirk, clearing the way for floor debate later this week. Lawmakers voted in favor of advancing the measure and a bill to avert a government shutdown in a joint mechanism known as a \"rule vote.\" The rule was adopted in a 216-210 vote along party lines. Rep. Thomas Massie, R-Ky., who is known to be opposing the federal funding bill, was the lone lawmaker from either side to vote \"present.\" Massie explained to Fox News Digital that he vehemently supports the Kirk resolution but opposed an unrelated provision in the rule that blocks Congress' ability from weighing in on tariff policy. ABC REPORTER CALLS CHARLIE KIRK ASSASSIN'S TEXT MESSAGES WITH TRANSGENDER PARTNER ‘VERY TOUCHING’ \"I’m a cosponsor of the Kirk resolution, and obviously I will vote for it, but shamefully they turned off Congress’ ability to vote on tariffs with this rule,\" Massie said. Rule votes are procedural hurdles that commonly tie together unrelated pieces of legislation that, if adopted, allow House lawmakers to debate each measure individually before respective votes. The current rule's adoption means House lawmakers could vote on the resolution to honor Kirk on either Thursday or Friday. A vote on the measure to avert a government shutdown, a short-term extension of current federal funding levels called a continuing resolution or CR, is expected Friday morning. It is not surprising that no Democrats supported the rule's adoption on Wednesday; rule votes traditionally fall along party lines and have rarely seen bipartisan crossover, even if the legislation they include has wide support from both Republicans and Democrats. And while Democrats are largely expected to buck the GOP-led government funding patch, the resolution to honor Kirk's legacy is expected to get healthy bipartisan support. The Turning Point USA founder was assassinated last week during a college campus speaking event in Utah. The resolution to honor him, led by Speaker Mike Johnson, R-La., lauded Kirk as \"one of the most prominent voices in America, engaging in respectful, civil discourse across college campuses, media platforms and national forums, always seeking to elevate truth, foster understanding and strengthen the Republic.\" SCRUTINY INTENSIFIES OVER SECURITY LAPSES SURROUNDING THE CHARLIE KIRK SHOOTING It also said Kirk's \"commitment to civil discussion and debate stood as a model for young Americans across the political spectrum, and he worked tirelessly to promote unity without compromising on conviction.\" It called his killing \"a sobering reminder of the growing threat posed by political extremism and hatred in our society.\" Both Democrats and Republicans have released statements condemning political violence in the wake of Kirk's killing. CLICK HERE TO GET THE FOX NEWS APP The latter measure that advanced on Wednesday evening, the CR, will keep government agencies funded at current levels through Nov. 21 if it's passed by the House and Senate and signed into law by President Donald Trump. That bill includes a combined $88 million in added security funds for Congress, the judicial branch and the executive branch. Conversations about boosting lawmaker security, in particular, had been ongoing but took on new urgency after Kirk's death.","summary":"A procedural vote Wednesday opened floor debate on a resolution honoring Charlie Kirk and a short-term funding bill to keep the government open.","url":"https://www.foxnews.com/politics/house-clears-path-vote-honoring-charlie-kirk-denouncing-political-extremism","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/johnson-kirk-vigil-1.jpg","video":"https://www.foxnews.com/video/6379692743112","publish_date":"2025-09-17 22:05:09","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"US","sentiment":-0.218},{"id":361369040,"title":"Tyler Robinson Update: Sheriff Reveals Why Alleged Kirk Shooter Surrendered","text":"Tyler Robinson, the Utah man accused of assassinating conservative activist Charlie Kirk, agreed to surrender only under assurances it would be peaceful because he feared being shot by police, a sheriff said Wednesday.Robinson appeared quiet and somber when he arrived with his parents at the Washington County Sheriff's Office last Thursday, a day after Kirk was fatally shot at Utah Valley University, Sheriff Nate Brooksby said.\"He didn't want a big SWAT team at his parent's house or his apartment,\" Brooksby said. \"He was truly fearful about being shot by law enforcement.\"Brooksby said Robinson surrendered voluntarily after learning authorities were searching for him. The sheriff said Robinson was fearful of being killed by police and asked to avoid a SWAT standoff.\"He knew it was inevitable that he would be caught,\" Brooksby said Wednesday. \"If at the end of the day we accomplish him surrendering peacefully on his own, I'm going to make some concessions to make that happen.\"Prosecutors on Tuesday charged Robinson, 22, with capital murder in the killing of Kirk and said they will seek the death penalty, citing DNA evidence and incriminating text messages linking him to the shooting. Robinson, who appeared for his first court hearing, was assigned an attorney by a judge after the public defender's office received a request for representation. His family has declined to comment since his arrest.The Sept. 10 assassination at Utah Valley University shocked the nation, deepened political divides and left the campus in mourning. Students returning for the first day of classes this week gathered silently near the barricaded courtyard where Kirk was fatally shot while speaking to students. The school set up care stations with counseling, candy and stuffed animals.\"The way that we treat each other in our words can ultimately lead to things like this,\" said Matthew Caldwell, 24, a student at the university.The attack has reverberated far beyond campus. President Donald Trump has vowed to crack down on what he calls the \"radical left,\" while former President Barack Obama said Trump has further divided the nation. In Washington, the House Oversight Committee called executives from Discord, Steam, Twitch and Reddit to testify on how they are policing online extremism.Court documents revealed a note left in Robinson's apartment in which he declared, \"I had the opportunity to take out Charlie Kirk and I'm going to take it.\" Texts to his romantic partner, who lived with him, confirmed he was the shooter. \"I am, I'm sorry,\" Robinson wrote after being asked directly if he pulled the trigger. Prosecutors said his DNA was later found on the rifle.Authorities are investigating whether Robinson had help planning the attack. His partner, identified as transgender, shared the incriminating texts with investigators but did not initially go to law enforcement. Robinson remained at large for more than a day until his parents recognized him in a photo released by authorities and persuaded him to surrender. Utah Valley University is reviewing campus security procedures, President Astrid S. Tuminez said.A motive remains unclear. Prosecutors say Robinson texted his partner that he had \"enough of [Kirk's] hatred,\" adding, \"Some hate can't be negotiated out.\" Investigators are examining whether Kirk's outspoken anti-transgender views played a role.Kirk, 31, a father of two, was widely credited with mobilizing young evangelicals through his group Turning Point USA and helping Trump recapture the White House in 2024.Robinson's mother told investigators her son had become increasingly left-leaning over the past year, growing more supportive of gay and transgender rights. She and her husband recognized him in surveillance images of the shooter and confronted him. Robinson reportedly said he wanted to kill himself.Texts later released by authorities showed Robinson describing efforts to retrieve his rifle from a \"drop point\" that had been locked down after the shooting. He told his partner to delete the messages.\"To be honest I had hoped to keep this secret till I died of old age,\" he wrote. \"I am sorry to involve you.\"The case has heightened scrutiny on online radicalization, campus security and the nation's political climate as Robinson awaits trial.This article includes reporting by the Associated Press.","summary":"Robinson appeared quiet and somber when he arrived with his parents at the Washington County Sheriff's Office last Thursday.","url":"https://www.newsweek.com/tyler-robinson-update-why-charlie-kirk-shooter-surrendered-2131600","image":"https://d.newsweek.com/en/full/2724797/robinson-court.jpg?w=1600&h=900&q=88&f=694dd73c69af9020e429556fb0af8e0c","video":null,"publish_date":"2025-09-17 22:03:47","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","source_country":"US","sentiment":-0.349},{"id":361373472,"title":"Acting CDC director says agency too involved in Americans' health decisions","text":"In an email welcoming CDC staff back to the office weeks after a gunman fired bullets at the agency’s headquarters, acting Centers for Disease Control and Prevention Director Jim O’Neill wrote Tuesday that the agency had lost the trust of Americans and was experiencing \"mission creep\" that has led it to be too involved in Americans’ health decisions.\n\nIn the email, dated Tuesday and obtained by ABC News, O’Neill told CDC staff he hoped their \"return is going smoothly\" and noted \"enhanced security and repairs to the Roybal campus\" in Atlanta, Georgia.\n\nHe praised CDC's accomplishments from decades ago, including its combating of malaria and HIV, and noted its work this year on the measles outbreak in Texas and an Ebola outbreak in Africa.\n\nBut O'Neill made clear that Health and Human Services Secretary Robert F. Kennedy Jr. is now demanding a different approach from the CDC -- one by which the agency reduces its role in Americans’ lives.\n\n\"Mission creep has distracted us from our core mission over the years,\" O’Neill wrote. \"Not every health decision is the government’s business, and CDC need not duplicate the work of other divisions.\"\n\nO’Neill, the HHS deputy secretary whom Kennedy appointed to be CDC’s acting director after Susan Monarez’s dismissal last month, said the agency had \"lost the American public trust and faith\" during the pandemic but that HHS’ new leadership is \"working hard to refocus and earn that trust back.\"\n\n\"Rigorous science, transparency about data and reasoning, and treating our fellow citizens as adults who can make their own informed decisions will be well received whenever we can offer them,\" he added.\n\nTechnically, the CDC only offers guidance and does not have the ability to mandate people’s behavior; things such as school vaccine mandates, for instance, are decided upon and implemented at the state level.\n\nFiona Havers, a former CDC official who worked on vaccine policy, told ABC News, “CDC has always treated Americans like adults by providing them with the science-based evidence and guidance they need to make their own decisions.\"\n\nIn his email, O’Neill urged staff to \"think big. What is the 2026 equivalent of eradicating malaria? What might a CDC, unconstrained by WHO, look like? Where can I apply the principle of radical transparency to my work?\"\n\nPresident Donald Trump signed an executive order in January withdrawing the United States from the World Health Organization (WHO).\n\nO’Neill’s email came on the eve of Monarez’s highly anticipated public hearing Wednesday in front of the Senate health committee, during which she alleged that Kennedy demanded that she approve \"in advance\" modified vaccine recommendations by an independent panel that Monarez testified were unsupported by scientific evidence or other data.\n\nMonarez also testified in her opening statement that Kennedy directed her to \"dismiss career officials responsible for vaccine policy without cause.\"\n\nMonarez testified, \"I was fired for holding the line on scientific integrity.\"\n\nAn HHS spokesperson later said Monarez’s testimony had \"factual inaccuracies and left out important details,\" and described her dismissal as a consequence of her acting \"maliciously to undermine the President’s agenda and was fired as a result.\"","summary":"Acting director Jim O’Neill wrote in part that the CDC was experiencing \"mission creep\" that has led it to be too involved in Americans' health decisions.","url":"https://abcnews.go.com/Politics/cdcs-acting-director-tells-staff-treat-americans-adults/story?id=125668513","image":"https://i.abcnewsfe.com/a/3e8005cb-aa82-41e3-bd9a-b20eb01bc2c8/jim-o-neill-ht-jt-250917_1758124501454_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-09-17 21:59:49","author":"Will McDuffie","authors":["Will McDuffie"],"language":"en","category":"politics","source_country":"US","sentiment":0.023},{"id":361380572,"title":"Democrats are investigating Trump crypto advisor David Sacks over a possible SGE violation","text":"Senator Elizabeth Warren (D-MA) and Representative Melanie Stansbury (D-N.M.) are leading a group of congressional Democrats in investigating White House Special Advisor David Sacks for possibly serving in his position for longer than he's allowed. Sacks, a former PayPal executive and venture capitalist at Craft Ventures, was originally picked by President Donald Trump to be the \"White House A.I. & Crypto Czar\" in 2024.\n\n\"Any effort to stay beyond the time limits imposed on you as a Special Government Employee (SGE) would raise additional ethics concerns for you and the Trump Administration,\" the group writes in a letter to Sacks,\"particularly as it moves to implement recently enacted cryptocurrency legislation and put in place new rules for the crypto industry.\"\n\nBesides being friendly with the Trump campaign and allies like Elon Musk, Sacks was given his position because of his knowledge of the crypto and AI industries as an investor. That poses an obvious conflict of interest, something that's only waived during the 130-day limit that SGEs are supposed to serve. As Warren and the other Democrats backing the investigation note, though, it's possible Sacks has been working in his role for longer than that.\n\n\"If you have worked every calendar day since the presidential inauguration, your 130th day of work in this role was May 29, 2025,\" the group writes. \"If you have worked every business day, your 130th day was July 25, 2025. As of the date of this letter, it is the 167th business day of this Administration.\"\n\nAs part of the investigation, Sacks is expected to offer a more detailed account of when and how he works in his advisory role, including if he answers government emails while working in Silicon Valley. Congressional Democrats are trying to verify if norms have been violated to make sure that they won't be violated in the future, but there are larger ethical concerns to contend with, too.\n\nThe second Trump administration has been friendly to the crypto industry, likely thanks in part to the influence of Sacks. Trump signed an executive order calling for the creation of a federal Bitcoin stockpile and signed the GENIUS Act into law in July, establishing a regulatory framework for stablecoins, a type of cryptocurrency typically tied to the value of the US dollar. Continuing to serve in his role without leaving his position at Craft Ventures or disclosing his investments would only raise more questions about how Sacks stands to benefit from advising on regulation.","summary":"Senator Elizabeth Warren (D-MA) and Representative Melanie Stansbury (D-N.M.) are leading a group of congressional Democrats in investigating White House Special Advisor David Sacks for possibly serving in his position for longer than he&#39;s allowed. Sacks, a former PayPal executive and venture capitalist at Craft Ventures, was originally picked by President Donald Trump to be the &quot;White House A.I. &amp; Crypto Czar&quot; in 2024.\n\n\n&quot;Any effort to stay beyond the time limits imposed on you as a Special Government Employee (SGE) would raise additional ethics concerns for you and the Trump Administration,&quot; the group writes in a letter to Sacks,&quot;particularly as it moves to implement recently enacted cryptocurrency legislation and put in place new rules for the crypto industry.&quot;\n\n\nBesides being friendly with the Trump campaign and allies like Elon Musk, Sacks was given his position because of his knowledge of the crypto and AI industries as an investor. That poses an obvious conflict of","url":"https://www.engadget.com/general/democrats-are-investigating-trump-crypto-advisor-david-sacks-over-a-possible-sge-violation-215758087.html?src=rss","image":"https://s.yimg.com/ny/api/res/1.2/qr895Rfy632kW3WBUiWCMw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAw/https://s.yimg.com/os/creatr-uploaded-images/2025-09/19ae9ee0-940f-11f0-bf7f-84a5bea311bb","video":null,"publish_date":"2025-09-17 21:58:03","author":"Ian Carlos Campbell","authors":["Ian Carlos Campbell"],"language":"en","category":"politics","source_country":"US","sentiment":-0.169}]}