{"offset":0,"number":50,"available":14819,"news":[{"id":269065548,"title":"Fbi Probes Bomb Threats To Lawmakers Trump Nominees","text":"US President Joe Biden says his administration is working with the FBI to address \"swatting\" and bomb threats targeting lawmakers and several of president-elect Donald Trump&apos;s cabinet picks. Seth Magaziner, a Democrat in the House of Representatives, says he was targeted by a bomb threat at home. It came a day after six Democratic lawmakers from Connecticut reported similar threats to their homes over Thursday&apos;s Thanksgiving Day holiday. Law enforcement in each case found no evidence of explosive devices, the lawmakers said. Pete Hegseth, Trump&apos;s choice to become US defence secretary, and Lee Zeldin, Trump&apos;s pick to lead the Environmental Protection Agency, were among nominees targeted with bomb threats and swatting attempts on Tuesday and Wednesday. Swatting is a false report made to police to induce chaos and fear by drawing a potentially heavy, armed response by officers at someone&apos;s home. Law enforcement experts say it&apos;s a form of harassment that is increasingly being used to target prominent figures. \"House Democrats will not be deterred or intimidated from serving the people by violent threats,\" Democratic House leader Hakeem Jeffries said in a statement. Trump was wounded in an assassination attempt in Pennsylvania in July. In a separate incident in September, a man was charged with attempted assassination after allegedly positioning himself with a rifle outside one of Trump&apos;s Florida golf courses. Biden, speaking on Friday to reporters in Nantucket, Massachusetts, where he is spending the Thanksgiving holiday, said he expected to speak to Trump again during the transition. Australian Associated Press","url":"https://www.canberratimes.com.au/story/8834176/fbi-probes-bomb-threats-to-lawmakers-trump-nominees/?cs=14232","image":"/images/transform/v1/crop/frm/silverstone-feed-data/9d5ae9b3-1eba-4d7a-9858-bb76ced4d615.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2024-11-30 01:14:30","author":"Jeff Mason And Rich McKay","authors":["Jeff Mason And Rich McKay"],"language":"en","category":"politics","source_country":"au","sentiment":-0.407},{"id":269065532,"title":"Fbi Probes Bomb Threats To Lawmakers Trump Nominees","text":"US President Joe Biden says his administration is working with the FBI to address \"swatting\" and bomb threats targeting lawmakers and several of president-elect Donald Trump&apos;s cabinet picks. Seth Magaziner, a Democrat in the House of Representatives, says he was targeted by a bomb threat at home. It came a day after six Democratic lawmakers from Connecticut reported similar threats to their homes over Thursday&apos;s Thanksgiving Day holiday. Law enforcement in each case found no evidence of explosive devices, the lawmakers said. Pete Hegseth, Trump&apos;s choice to become US defence secretary, and Lee Zeldin, Trump&apos;s pick to lead the Environmental Protection Agency, were among nominees targeted with bomb threats and swatting attempts on Tuesday and Wednesday. Swatting is a false report made to police to induce chaos and fear by drawing a potentially heavy, armed response by officers at someone&apos;s home. Law enforcement experts say it&apos;s a form of harassment that is increasingly being used to target prominent figures. \"House Democrats will not be deterred or intimidated from serving the people by violent threats,\" Democratic House leader Hakeem Jeffries said in a statement. Trump was wounded in an assassination attempt in Pennsylvania in July. In a separate incident in September, a man was charged with attempted assassination after allegedly positioning himself with a rifle outside one of Trump&apos;s Florida golf courses. Biden, speaking on Friday to reporters in Nantucket, Massachusetts, where he is spending the Thanksgiving holiday, said he expected to speak to Trump again during the transition. Australian Associated Press","url":"https://www.canberratimes.com.au/story/8834176/fbi-probes-bomb-threats-to-lawmakers-trump-nominees/?cs=14264","image":"/images/transform/v1/crop/frm/silverstone-feed-data/9d5ae9b3-1eba-4d7a-9858-bb76ced4d615.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2024-11-30 01:14:30","author":"Jeff Mason And Rich McKay","authors":["Jeff Mason And Rich McKay"],"language":"en","category":"politics","source_country":"au","sentiment":-0.407},{"id":269065402,"title":"Rogan says the 'greatest media psy-op in history' was waged against Trump: 'They've distorted who he is'","text":"Joe Rogan argued that the establishment media that once was friendly to President-elect Donald Trump has since been engaged in a years-long \"psy-op\" to convince Americans he is dangerous. \"The Joe Rogan Experience\" is one of the world’s most popular podcasts, and Rogan is seen as having been one of the key players in the 2024 election, for interviewing Trump and then endorsing his bid for the presidency in the 11th hour. The podcaster has since mocked the media for losing their credibility with voters and alienating lifelong liberals like himself. On Thursday's episode, with comedians Shane Gillis, Mark Normans, and Ari Shaffir, Rogan recalled how friendly people in entertainment and the media once were to Trump, playing clips from his 2012 appearance on \"The View\" where he was cheered, as well as when he went on Oprah in and she asked him about running for president. Since then, \"The View\" has become a frequent source for apocalyptic takes about Trump, and Oprah shredded him while campaigning with Vice President Kamala Harris. Rogan argued that the abrupt shift in tone toward Trump has been shocking in retrospect, \"What we saw is the greatest media psy-op in history.\" HARRIS DISAPPEARS FROM SPOTLIGHT, VACATIONS IN HAWAII AFTER ELECTION LOSS The podcast host continued to hammer legacy media. \"What you’re seeing with Trump, regardless of his flaws, is a massive concentrated psy-op,\" Rogan said. \"They’ve distorted who he is to the point where most people think that way. Most people think that way. They’ve had narratives.\" \"What is a psy-op? I keep hearing that,\" Normand said. \"Psychological operation,\" Rogan explained. \"Where they’ve decided to distort people’s perceptions of things.\" Shaffir replied that older liberals are shocked to hear that former President Obama oversaw more deportations than Trump. \"They go, ‘That doesn’t make sense.’ And you go, ‘Right, focus on what’s giving you the reality of the world,’\" he said. JOE ROGAN ENDORSES DONALD TRUMP ON THE EVE OF THE ELECTION Rogan then turned to his producer, Jamie, and asked him to show a \"wild\" quote from former Secretary of State Hillary Clinton from 2008 where she was \"saying some wild MAGA-type s---\" about \"illegal immigrants.\" Clinton could be heard in the recording declaring, \"I think we got to have tough conditions. Tell people to come out of the shadows. If they’ve committed a crime, deport them, no questions asked.\" \"She’s a Republican,\" Shaffir joked. In the recording, Clinton continued, \"If they’ve been working and are law-abiding, we should say, ‘Here are the conditions for you staying. You have to pay a stiff fine because you came here illegally. You have to pay back taxes and you have to try to learn English. And you have to wait in line.’\" The guests expressed their shock at Clinton’s past comments. \"’You have to wait in line,’ And everybody’s cheering,\" Rogan said. \"2008. Hillary Clinton was more MAGA than Trump. But how about that? More MAGA than Trump. It’s all a f---ing illusion. It’s all a f---ing illusion. All of them, when convenient, have said the exact same things.\" CLICK HERE TO GET THE FOX NEWS APP Rogan argued that this election shows that the tide has turned, however. \"They had control of the media up until now. This election was the first time they didn’t really have control of the media anymore,\" Rogan argued. When asked why this is, the podcaster replied, \"Because of us, because of podcasts. Because of social media, because of X.\"","summary":"Podcaster Joe Rogan argued that the media engaged in &quot;massive, concentrated psy-op&quot; to &quot;distort people&apos;s perceptions&quot; of Trump once he went from celebrity to politician.","url":"https://www.foxnews.com/media/rogan-says-greatest-media-psy-op-history-waged-against-trump-theyve-distorted-who-he-is","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/03/931/523/Joe-Rogan2.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-30 01:09:49","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"us","sentiment":-0.22},{"id":269065004,"title":"Prime Minister Justin Trudeau And Donald Trump Meeting In Florida Source Says 9883987","text":"OTTAWA — Prime Minister Justin Trudeau is meeting with U.S. president-elect Donald Trump at his Mar-a-Lago estate, a source has confirmed to The Canadian Press.\n\nTrudeau's plane landed in West Palm Beach, Fla., Friday evening, not far from where Trump's transition team is based at his Mar-a-Lago estate. \n\nThe source, who is not authorized to speak publicly about the events, confirmed Public Safety Minister Dominic LeBlanc is also in attendance.\n\nThe first in-person meeting between the two leaders comes at the end of a rocky week in which Trump threatened to impose stiff tariffs on all imports from Canada.\n\nEarlier in the day, Trudeau said he believes the president-elect's tariff threats against Canada and Mexico should be taken seriously.\n\nTrump said on social media on Monday night he would slap a 25 per cent tariff on imports from the U.S.'s closest neighbours unless the two countries stop illegal border crossings and prevent illicit drugs such as fentanyl from entering the U.S.\n\n\"One of the things that is really important to understand is that Donald Trump, when he makes statements like that, he plans on carrying them out. There's no question about it,\" Trudeau said when speaking with reporters in Queens County, P.E.I., on Friday.\n\nBut the prime minister said Canada can get through what is expected to be a tumultuous four years by taking the same approach to working with Trump as it did during his first term as president.\n\nTrudeau said his government started assembling its outreach plan for the next U.S. administration at the start of the year, when they began a \"Team Canada\" effort by pulling together premiers, business and labour leaders to network with officials and politicians across the U.S. \n\nCanada's ambassador to the U.S., Kirsten Hillman, Industry Minister François-Philippe Champagne and Trade Minister Mary Ng have been leading that effort.\n\nTrudeau activated a similar response during Trump's first term in the White House, dispatching Canadians of all political stripes to remind American officials that the two nations' economies are joined at the hip and that trade conflicts would cause blowback for American businesses and consumers as well.\n\nTrudeau said Friday he plans to remind Trump repeatedly that such tariffs would hamper the president's own political goals as well.\n\n\"Our responsibility is to point out in this way, he would be actually not just be harming Canadians,\" Trudeau said. \"He'd actually be raising prices for American citizens as well and hurting American industry and businesses.\"\n\nTrudeau called Trump on Monday night after the social media post and talked up the mutual dependence of the two economies.\n\nThe prime minister convened a meeting with the premiers on Wednesday at their request to discuss the incoming U.S. administration's approach on trade and its concerns about the Canadian border.\n\nDuring a debate in Parliament this week over Trump's tariff threat, Deputy Prime Minister Chrystia Freeland pointed to a long list of industry leaders she has met with since the U.S. election: steel, automotive, pension funds, oil and gas, nuclear, aluminum, electricity, banks and even AI companies.\n\n\"This is Team Canada,\" she said.\n\nBut the last time the Trudeau Liberals assembled such an effort, they were a relatively new majority government. They also had a lot of help from key conservative figures, such as former Conservative leader Rona Ambrose and, importantly, the late former prime minister Brian Mulroney, who personally knew Trump and his former commerce secretary Wilbur Ross.\n\nAsa McKercher, the Hudson Chair in Canada-U.S. Relations at St. Francis Xavier University, said those relationships are now lacking.\n\n\"Remember the video of Mr. Mulroney singing to Mr. Trump at his birthday party? We have nothing like that this time,\" McKercher said.\n\n“The centre of the Trump administration is Mr. Trump himself, and so having a good in with Mr. Trump is really important.\"\n\nWhile Trudeau and Trump are familiar with each other, there is a question about just how united a front Trudeau can rally this time around. His government has less political capital, as his Liberal party trails behind in public opinion polls and is running out of time before the next election, which has to happen in the next 11 months.\n\nAfter Trudeau's meeting with the premiers, Ontario Premier Doug Ford's office sent a statement to media criticizing Ottawa for being \"slow to react\" and \"stuck on its back foot.\" Several premiers have also said Trump's complaints are legitimate.\n\n\"The Team Canada approach is good, but it's really a Liberal party, Canadian diplomatic kind of thing,\" said McKercher.\n\n\"This government is on life support. Investors know it, the opposition knows that. The Americans know it, too. Canada doesn't have a strong hand to play necessarily in terms of building bridges if the Trudeau government's out in eight months or nine months.\"\n\nSebastian Skamski, a press secretary for Conservative Leader Pierre Poilievre, said Trudeau's office has not reached out seeking help from Poilievre to network with the incoming U.S. administration.\n\nFreeland was asked whether she would bring Poilievre into the fold at a Nov. 8 news conference, and said she would not speak for him. She said she has, however, spoken with some Conservatives and New Democrats, though she did not name any.\n\nAt the same press conference, Foreign Affairs Minister Mélanie Joly said, \"The question is whether Pierre Poilievre will want to be partisan and defend Canada's interests.\"\n\nThis report by The Canadian Press was first published Nov. 29, 2024.\n\nKyle Duggan, The Canadian Press","url":"https://www.oakvillenews.org/national-news/prime-minister-justin-trudeau-and-donald-trump-meeting-in-florida-source-says-9883987","image":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2024/11/2c0a4697e9d9c6d01ca2112c8f5f1629fdb5d53824b0c08020fd51423328c654.jpg","video":null,"publish_date":"2024-11-30 01:09:31","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.02},{"id":269065006,"title":"Rcmp Looks To Redeploy 25 Per Cent Of Eastern Region Workforce Including To Border 9885811","text":"OTTAWA — The RCMP says it's looking to redeploy up to one-quarter of its eastern region workforce to areas considered an operational priority, including to the Canada-U.S. border. \n\nU.S. president-elect Donald Trump pledged this week to impose 25-per-cent tariffs on Canadian and Mexican imports until more is done to stem illegal border crossings and drug trafficking. \n\nThe threat spurred calls from premiers and opposition leaders for the federal Liberal government to do more to secure Canada's border.\n\nAmong the voices was Alberta Premier Danielle Smith, who says she is considering creating a provincial border patrol.\n\nThe eastern region for the RCMP includes Quebec and the four Atlantic provinces. Only Quebec and New Brunswick border the U.S. in this region.\n\nCpl. Martina Pillarova, an RCMP spokesperson, said the temporary redeployment is aimed not only at supporting border integrity, but other federal policing priorities as well.\n\nPillarova added that this sort of move is not out of the ordinary. \"Please note that so far, the situation has remained stable at the border and our operations are proceeding normally.\"\n\nU.S. Customs and Border Protection credits its own enhanced enforcement with a substantial drop in the number of encounters with migrants at the Canadian border. \n\nBut there has also been a significant drop in migration since changes were made to the Safe Third Country Agreement last year to close a loophole that allowed asylum claims outside regular ports of entry. \n\nThe agreement states Canada and the U.S. are considered safe places, and asylum seekers need to make a refugee claim in the first country in which they arrive.\n\nBefore the changes happened in March 2023, RCMP in Quebec recorded more than 12,000 interceptions in the first three months of last year.\n\nU.S. Customs and Border Protection reported a 69 per cent drop in recent months in the number of encounters with migrants at the Canadian border in what it calls the Swanton Sector, which covers Vermont and portions of New York's border with Quebec and Ontario. \n\nThere were around 1,025 encounters in October, down from about 3,300 in June.\n\nOn the Canadian side, the RCMP says it made 950 interceptions of people trying to cross the border outside regular crossings between January and October. \n\nB.C. and Quebec were the provinces seeing the most interceptions, with 449 and 393 respectively. \n\nThe RCMP has not recorded any interceptions at the Alberta-Montana border this year. \n\nU.S. border guards recorded 100 encounters with people in the Havre Sector, which includes the Alberta-Montana border, between October 2023 and September of this year. \n\nThis report by The Canadian Press was first published Nov. 29, 2024.\n\nDavid Baxter, The Canadian Press","url":"https://www.oakvillenews.org/national-news/rcmp-looks-to-redeploy-25-per-cent-of-eastern-region-workforce-including-to-border-9885811","image":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2024/11/269c73323607223a95da68cab62c065cb6e4f39894e44bfeee326b888ea95fbd.jpg","video":null,"publish_date":"2024-11-30 01:09:31","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.078},{"id":269065028,"title":"Justin Trudeau in Florida to meet Donald Trump","text":"The trip was not included on Trudeau's public itinerary for Friday. The two men will have dinner, the source said. \n\nTrudeau has often underscored that the two countries were able to successfully renegotiate a major trade pact during Trump's first term, though the relationship between the two leaders has occasionally been rocky. \n\nOn Friday, speaking at an event in Prince Edward Island, Trudeau said the two countries \"rolled up our sleeves and were able to create jobs on both sides of the border\".\n\nHe said looked forward to having many \"great\" conversations with Trump.\n\nThe Florida visit is the latest move by Canada as it seeks to avoid the tariffs. \n\nIt remains unclear whether the incoming Trump administration will actually move ahead with the threatened tariffs, as analysts note that the president-elect has been known to use such threats in the past as a negotiating tactic to achieve his goals.\n\nTrump - who has also threatened the same levy against Mexico - has signalled that they would remain in place until both countries work to secure their shared borders with the US.\n\nTrudeau said on Friday that \"when Trump makes statements like that, he plans on carrying them out\". \n\nHe said his goal was to point out the tariff would not just harm Canadians but also raise prices for Americans and hurt that country's economy. \n\nAfter the phone call with Trump, Trudeau held an emergency meeting on Wednesday with the leaders of Canada's provinces and territories over how to manage the US-Canada relationship. \n\nCanada is one of America's largest trading partners and it sends about 75% of its total exports to the US. \n\nTrudeau is promising to present a united \"Team Canada\" approach to working with the US to make the case against the levy. \n\nSeveral leaders of Canadian provinces have criticised Trump's plan, saying it would be devastating to the country's economy, including the oil and gas and automotive industries. \n\nMexican President Claudia Sheinbaum also had a phone call with Trump this week. \n\nCanada’s oil patch rattled by Trump's tariff threat 'It's going to be hard': US firms race to get ahead of Trump tariffs\n\nThe number of crossings at the US-Canada border is significantly lower than that at the southern border, according to US Border Patrol data on migrant encounters.\n\nDuring the 2024 fiscal year, there were around 23,700 apprehensions at the northern land border, while the southern border saw more than 1.53 million apprehensions.\n\nBut Canadian officials have said in recent days there is still joint work to be done to improve border security.","summary":"Prime Minister Justin Trudeau has flown to Florida to have dinner with the president-elect following his tariff threat.","url":"https://www.bbc.com/news/articles/cy8787nxl7do","image":"https://ichef.bbci.co.uk/news/1024/branded_news/1df4/live/9d8a3e00-aeae-11ef-a1a5-65f1fed016ca.jpg","video":null,"publish_date":"2024-11-30 01:06:16","author":"Jessica Murphy","authors":["Jessica Murphy"],"language":"en","category":"politics","source_country":"gb","sentiment":0.053},{"id":269064332,"title":"Nippon Steel Endgame","text":"In less than a month, the Committee on Foreign Investment in the United States (CFIUS) is scheduled to issue its findings regarding Nippon Steel’s proposed acquisition of U.S. Steel for nearly $15 billion.CFIUS’s job is to help the U.S. president determine whether a proposed foreign investment in the United States could harm national security and, if so, what changes to the deal might be necessary or if it should be blocked entirely. While U.S. President Joe Biden has vowed to keep U.S. Steel “domestically owned and operated,” there are multiple ways this promise could be kept. There is also a possibility that incoming President-elect Donald Trump in January will try to revisit Biden’s decision.Regardless, the endgame for Nippon Steel’s bid appears near and the results could have a significant positive or negative impact on U.S.-Japan relations, depending on the outcome. The next key step belongs to CFIUS in late December.","url":"https://www.japantimes.co.jp/commentary/2024/11/28/japan/nippon-steel-endgame/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/11/29/436984.jpg?v=3.1","video":null,"publish_date":"2024-11-30 01:03:35","author":"James L. Schoff","authors":["James L. Schoff"],"language":"en","source_country":"jp","sentiment":0.003},{"id":269064328,"title":"Canada Trudeu Trump Tariffs","text":"Canadian Prime Minister Justin Trudeau is meeting with U.S. President-elect Donald Trump on Friday, according to people familiar with their plans, as the incoming American leader threatens to implement fresh tariffs on neighboring countries unless they halt the flow of illegal drugs and undocumented migrants across borders.Trudeau landed in West Palm Beach, Florida, on Friday evening, people familiar with the plans said, speaking on condition of anonymity to share details on the meeting.Trump earlier this week vowed to hit Canada and Mexico as well as China with additional tariffs, casting the levies as necessary to secure U.S. borders, a top concern of voters in November’s presidential election. The president-elect said he would impose additional 10% tariffs on goods from China and 25% tariffs on all products from Mexico and Canada if they failed to act.","url":"https://www.japantimes.co.jp/news/2024/11/30/world/politics/canada-trudeu-trump-tariffs/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/11/30/437302.JPG?v=3.1","video":null,"publish_date":"2024-11-30 01:03:35","author":"The Japan Times","authors":["The Japan Times"],"language":"en","source_country":"jp","sentiment":0.055},{"id":269064326,"title":"Boj Ueda Rate Hike Timing","text":"TOKYO/BENGALURU - Bank of Japan Gov. Kazuo Ueda said the timing of the next interest rate hike was 'approaching' as the economy was moving in line with the central bank's forecasts, the Nikkei newspaper reported, leaving open the chance of a December rate increase.He, however, also said the BOJ wanted to scrutinize developments in the U.S. economy as there was a 'big question mark' on its outlook, such as the fallout from President-elect Donald Trump's proposed tariff hikes, according to the Nikkei.'We can say it's approaching in the sense that economic data are on track to meet our forecasts,' Ueda told Nikkei in an interview conducted on Thursday and published Saturday, when asked whether the timing of the next rate hike was nearing.","url":"https://www.japantimes.co.jp/business/2024/11/30/economy/boj-ueda-rate-hike-timing/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/11/30/437301.JPG?v=3.1","video":null,"publish_date":"2024-11-30 01:03:35","author":"Leika Kihara,Roushni Nair","authors":["Leika Kihara","Roushni Nair"],"language":"en","source_country":"jp","sentiment":-0.202},{"id":269063024,"title":"Fbi Probes Bomb Threats To Lawmakers Trump Nominees","text":"US President Joe Biden says his administration is working with the FBI to address \"swatting\" and bomb threats targeting lawmakers and several of president-elect Donald Trump&apos;s cabinet picks. Seth Magaziner, a Democrat in the House of Representatives, says he was targeted by a bomb threat at home. It came a day after six Democratic lawmakers from Connecticut reported similar threats to their homes over Thursday&apos;s Thanksgiving Day holiday. Law enforcement in each case found no evidence of explosive devices, the lawmakers said. Pete Hegseth, Trump&apos;s choice to become US defence secretary, and Lee Zeldin, Trump&apos;s pick to lead the Environmental Protection Agency, were among nominees targeted with bomb threats and swatting attempts on Tuesday and Wednesday. Swatting is a false report made to police to induce chaos and fear by drawing a potentially heavy, armed response by officers at someone&apos;s home. Law enforcement experts say it&apos;s a form of harassment that is increasingly being used to target prominent figures. \"House Democrats will not be deterred or intimidated from serving the people by violent threats,\" Democratic House leader Hakeem Jeffries said in a statement. Trump was wounded in an assassination attempt in Pennsylvania in July. In a separate incident in September, a man was charged with attempted assassination after allegedly positioning himself with a rifle outside one of Trump&apos;s Florida golf courses. Biden, speaking on Friday to reporters in Nantucket, Massachusetts, where he is spending the Thanksgiving holiday, said he expected to speak to Trump again during the transition. Australian Associated Press","url":"https://www.goulburnpost.com.au/story/8834176/fbi-probes-bomb-threats-to-lawmakers-trump-nominees/?cs=14264","image":"/images/transform/v1/crop/frm/silverstone-feed-data/9d5ae9b3-1eba-4d7a-9858-bb76ced4d615.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2024-11-30 00:58:31","author":"Jeff Mason And Rich McKay","authors":["Jeff Mason And Rich McKay"],"language":"en","category":"politics","source_country":"au","sentiment":-0.407},{"id":269064662,"title":"How long has Mayor Johnson known about alleged misconduct by ex-communications director?","text":"Given the nature and volume of complaints made against his just recently terminated communications director, it seems almost impossible that Mayor Brandon Johnson had not been aware of Ronnie Reese’s alleged toxic behavior more than a year ago (“Johnson’s ex-communications director faced misconduct complaints before firing”).\n\nIf the mayor was not aware, he certainly should have been.\n\nReese had workplace authority over women who made complaints, and these allegations sound like a textbook example of sexual harassment for which taxpayers may ultimately pay a civil settlement or judgment.\n\nGiven the number and nature of complaints made, as well as Reese being a close friend of Johnson’s, it begs the question as to why there was so much patience with Reese’s reported reprehensible behavior.\n\nIndeed, extensive, detailed information was provided by the employees purportedly being victimized by Reese.\n\nIt defies logic to believe Johnson was not aware of his close friend’s alleged history of sexual harassment, homophobia and xenophobia. The mayor’s failure to take action against the reported workplace hostility is deeply concerning.\n\nTerry Takash, Western Springs\n\nChicagoans pay dearly for political corruption\n\nConsidering all the taxes we pay as Chicagoans, you may rightly wonder where the money is going and why Chicago has a $1 billion deficit. I know where the money is, and after you rest for a moment from paying all the taxes, you will know, too.\n\nAs a lifelong Chicagoan, every time I read about the deficit, I am disgusted. In the Sun-Times, we read about former politician Michael Madigan, who made a lifelong career and art out of quid pro quo. We read about former Ald. Ed Burke, another public “servant” who used his position to fleece the city.\n\nOver many years, I’ve read about too many Chicago white-collar crooks who’ve rampantly taken funds from our city. These funds are never recovered, and our taxes unfairly continue to go up.\n\nThe burden of constant corruption in Chicago is the big drain on all of us that is never addressed adequately, and so it grows. In 2023, for the fourth year in a row, according to a report from the University of Illinois at Chicago, Chicago was the most corrupt city in the nation.\n\nChicagoans are forced to pay for that corruption at the gas pump, grocery store, on our cars and transportation, and with high property taxes. While crime runs rampant in our city and taxes are taken from every source, the city always needs more money, and Chicago taxpayers are the victims.\n\nChicagoans pay high taxes for road work on Chicago streets that often is not done right the first time, so it must be done again using the same contractor.\n\nWe pay high taxes for city workers who should be fired for not doing their jobs, but it’s very difficult to fire them, even if they should have been fired years ago. \n\nWe pay high taxes because four in 10 Chicago Public School educators are “chronically absent” (which translates to four in 10 not doing their job when yearly pay for Chicago educators is way above the national average), but CPS standardized test scores are still down, according to the Illinois report card. However, the Chicago Teachers Union is threatening to strike.\n\nNow Mayor Johnson wants to raise property taxes, which he promised he would not do when he ran for mayor. How can Chicagoans avoid being hit with yet more taxes, since corruption is not going away, and campaign promises mean nothing? Moving out of state is the only option we have, and thousands are doing just that.\n\nJean Scott, Irving Park\n\nPut pension amendment on ballot\n\n“Short-sighted decisions have had serious long-term consequences,” Mayor Brandon Johnson said during his annual budget address.\n\nHe’s right. But is he listening?\n\nChicago has been bound by decade-long deals that have been disastrous for the city budget. Yet, Chicago is on its way to making three more mistakes that will hit residents for years to come.\n\nFirst, Chicago Mayor Brandon Johnson wants to give away billions of dollars — that the city doesn’t have — to help build new stadiums for the Chicago Bears and the White Sox. The city is still paying off decades of debt from the last renovations that are historically poor investments.\n\nAs lovely as new lakefront stadiums would be, taxpayers should not pay for them. Other private companies — like the Cubs and Google — support infrastructure projects without leaning on taxpayers. Chicago must say “no” to taxpayer-funded stadiums.\n\nAnother pending, long-term financial misstep would be City Hall skipping an extra pension payment to help balance the deficit.\n\nRelying on one-off payments to address a structural budget problem might work once, but it won’t address future deficits. It’ll likely worsen the city’s pension crisis; as the debt grows, the city’s credit, public workers’ retirement security and taxpayers’ wallets are increasingly at risk.\n\nThe only meaningful way to solve Chicago’s pension and budget crisis is by amending the Illinois Constitution to allow future public pension growth to be managed. Johnson should join his predecessors and local leaders in calling for state lawmakers to put a pension amendment on the ballot.\n\nAs to the third mistake, city leaders must reconsider enacting a long-term plan to reconstruct DuSable Lake Shore Drive. The current $4 billion proposal fails to prioritize public transportation and lacks bus lanes.\n\n If Chicago is going to renovate a major highway, it must be thinking years ahead. Chicagoans can’t afford more of the same.\n\nUltimately, Johnson must take his own advice and make the hard decisions needed to correct Chicago’s problems instead of hoping the next generation can afford to fix it. Young Chicagoans don’t need any more bad deals; the costs always outlive the benefits.\n\nMicky Horstman, communications associate, Illinois Policy Institute, and social mobility fellow, Young Voices\n\nCity leaders, step up and lead\n\nFacing a budget crisis, Chicago’s mayor and aldermen call each other names. They blame each other. Together, they refuse to confront knowledgeably a worsening budget crisis that threatens the residents and visitors of the nation’s “Second City.”\n\nNo one accepts responsibilities. In dysfunction, they compete to be “first city.”\n\nThese elected officeholders do not understand that leadership is based on respect and cooperation. Frightening to a new resident and career-long student of cities, they refuse to meet transparent needs with appropriate budget principles.\n\nOver-reacting to symbolic numbers — $300 million — isolated from real needs, they fail to confront the needs of public schools, police and fire departments, 311 and related services, and the broken state of city streets and sidewalks. Three hundred million is not a soccer ball to be batted in neglect.\n\nBrandon Johnson’s proposal for that increase can be seen as moderate, compared with tax revenue and overall budget. Compare that with other income, expenditures, other major cities and costs of ignoring needs.\n\nIn Lincoln Park, we have no police patrolling or parking enforcement. Streets and sidewalks are broken and dangerous. Scooters illegally block walkways, as I mentioned in a previous letter to the editor. The city’s 311 service never answers.\n\nAmazingly to an urban historian, the Chicago City Council is not aware property taxes are the most stable and durable source of city finances. This is City Government 101.\n\nCity Hall is also unaware that taxation can and should be progressive. The “burden,” or civic responsibility, can be apportioned in relationship to different levels of value, not apportioned unequally. That is, residents can and should be taxed with respect to their ability to pay.\n\nMy 43rd Ward Ald. Timmy Knudsen errs when he writes: “As we all know, when taxes are set too high, the related asset can be devalued.” The opposite can be true. The council must understand finance and arithmetic — and their collective and individual responsibilities. They cannot oppose tax increases at the same time they admit mounting needs.\n\nCan the aldermen and the mayor learn about their city and its needs, and draw on established means of budgeting and governing? In other words, can they both learn and earn their salaries?\n\nHarvey J. Graff, Lincoln Park, professor emeritus of English and History, Ohio State University\n\nTrump is no Honest Abe\n\nDonald Trump is fond of comparing himself — favorably, of course — to our greatest president, Abraham Lincoln. After you pick yourself off the floor, allow me to shine a light on two instances of the two men’s approach to policy and intent.\n\nTrump has put together a cabinet of individuals wildly ill-suited to their posts but who have in the past demonstrated complete and total servility to his every whim and utterance.\n\nNow let us rewind 164 years for what Lincoln did upon winning his first term. He caused the collective jaw of the political spectrum to drop by assembling as his cabinet a “team of rivals” — fierce opponents from both sides of the aisle who would bring to the table diverse viewpoints and varied talents to ensure not what was best for Lincoln but for America.\n\nIt was an audacious, unheard of move — and it worked. A better America resulted.\n\nThe concept of charity toward one’s rivals — in Donald Trump’s world “rival” means “scum” — is one Trump will never grasp. At the conclusion of the Civil War in 1865 when the South had been defeated, Union generals and members of Lincoln’s own cabinet were demanding that every Confederate officer be made to pay dearly for what the country had suffered.\n\nIn answer to cries for blood, these were Lincoln’s closing words in his second inaugural address: “With malice toward none with charity for all … let us strive on to finish the work we are in to bind up the nation’s wounds, to care for him who shall have borne the battle and for his widow and his orphan ...”\n\nOh, to have a man capable of penning such words in the White House again. If that is too tall an order — alas, today it is — I would settle for a man of simple decency and goodwill toward his fellow creatures, rather than the morally bankrupt vessel the majority of American voters chose to lead us.\n\nRob Hirsh, West Ridge\n\nRepublicans in name only\n\nA few modifications to Regina Gomory’s letter to the editor Nov. 25 about “all three branches of government in Republican hands.” The GOP was run by Republicans.\n\nNow it’s run by RINOs (Republicans in name only). It has become a cult of personality, and that personality is a sociopathic narcissist. Like all narcissists, he will find scapegoats to blame for his train wrecks, and his cult followers will, of course, believe him.\n\nRobert Rowells, Elmwood Park","url":"https://chicago.suntimes.com/letters-to-the-editor/2024/11/29/mayor-brandon-johnson-ex-communications-director-ronnie-reese-complaints-budget-deficit-trump","image":"https://cst.brightspotcdn.com/dims4/default/fc75b37/2147483647/strip/true/crop/6620x3779+0+318/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8f%2Fcb%2Fdb9e27c449748e086c8dbd6e5509%2Fcoun","video":null,"publish_date":"2024-11-30 00:53:09","author":"Letters to the Editor","authors":["Letters to the Editor"],"language":"en","source_country":"us","sentiment":-0.19},{"id":269061826,"title":"Canada Is Pausing Private Refugee Sponsorship Applications Until 2026 1","text":"MORE POLITICS NEWS \n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Canada pledges $50M for Palestinian humanitarian needs ahead of Gaza aid conference\n\n Trudeau says no question Trump is serious on tariff threat\n\n Trudeau appears unwilling to expand proposed rebate, despite pressure to include seniors\n\n Trudeau Liberals' two-month GST holiday bill passes the House, off to the Senate\n\n Federal government posts $13B deficit in first half of the fiscal year\n\n 'A little candy today for pain down the road': Former Bank of Canada governor on GST holiday, rebate cheques\n\n Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives\n\n NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power.\n\n 'Not the result we wanted': Trudeau responds after surprise Conservative byelection win in Liberal stronghold\n\n Conservative candidate Don Stewart winning the closely-watched Toronto-St. Paul's federal byelection, and delivering a stunning upset to Justin Trudeau's candidate Leslie Church in the long-time Liberal riding, has sent political shockwaves through both parties.\n\n 'We will go with the majority': Liberals slammed by opposition over proposal to delay next election\n\n The federal Liberal government learned Friday it might have to retreat on a proposal within its electoral reform legislation to delay the next vote by one week, after all opposition parties came out to say they can't support it.\n\n Budget 2024 prioritizes housing while taxing highest earners, deficit projected at $39.8B\n\n In an effort to level the playing field for young people, in the 2024 federal budget, the government is targeting Canada's highest earners with new taxes in order to help offset billions in new spending to enhance the country's housing supply and social supports.\n\n 'One of the greatest': Former prime minister Brian Mulroney commemorated at state funeral\n\n Prominent Canadians, political leaders, and family members remembered former prime minister and Progressive Conservative titan Brian Mulroney as an ambitious and compassionate nation-builder at his state funeral on Saturday.\n\n opinion | \n\n Don Martin: Gusher of Liberal spending won't put out the fire in this dumpster\n\n A Hail Mary rehash of the greatest hits from the Trudeau government’s three-week travelling pony-show, the 2024 federal budget takes aim at reversing the party’s popularity plunge in the under-40 set, writes political columnist Don Martin. But will it work before the next election?\n\n opinion | \n\n Don Martin: The doctor Trudeau dumped has a prescription for better health care\n\n Political columnist Don Martin sat down with former federal health minister Jane Philpott, who's on a crusade to help fix Canada's broken health care system, and who declined to take any shots at the prime minister who dumped her from caucus.\n\n opinion | \n\n Don Martin: Trudeau's seeking shelter from the housing storm he helped create\n\n While Justin Trudeau's recent housing announcements are generally drawing praise from experts, political columnist Don Martin argues there shouldn’t be any standing ovations for a prime minister who helped caused the problem in the first place.\n\n opinion | \n\n Don Martin: Poilievre has the field to himself as he races across the country to big crowds\n\n It came to pass on Thursday evening that the confidentially predictable failure of the Official Opposition non-confidence motion went down with 204 Liberal, BQ and NDP nays to 116 Conservative yeas. But forcing Canada into a federal election campaign was never the point.\n\n opinion | \n\n Don Martin: How a beer break may have doomed the carbon tax hike\n\n When the Liberal government chopped a planned beer excise tax hike to two per cent from 4.5 per cent and froze future increases until after the next election, says political columnist Don Martin, it almost guaranteed a similar carbon tax move in the offing.\n\n CTVNews.ca Top Stories\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n 'Mayday! Mayday! Mayday!': Details emerge in Boeing 737 incident at Montreal airport\n\n New details suggest that there were communication issues between the pilots of a charter flight and the control tower at Montreal's Mirabel airport when a Boeing 737 made an emergency landing on Wednesday.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Cucumbers sold in Ontario, other provinces recalled over possible salmonella contamination\n\n A U.S. company is recalling cucumbers sold in Ontario and other Canadian provinces due to possible salmonella contamination.\n\n John Herdman resigns as head coach of Toronto FC\n\n John Herdman, embroiled in the drone-spying scandal that has dogged Canada Soccer, has resigned as coach of Toronto FC.\n\n Musk joins Trump and family for Thanksgiving at Mar-a-Lago\n\n Elon Musk had a seat at the family table for Thanksgiving dinner at Mar-a-Lago, joining President-elect Donald Trump, Melania Trump and their 18-year-old son.\n\n Billboard apologizes to Taylor Swift for video snafu\n\n Billboard put together a video of some of Swift's achievements and used a clip from Kanye West's music video for the song 'Famous.'\n\n Weekend weather: Parts of Canada could see up to 50 centimetres of snow, wind chills of -40\n\n Winter is less than a month away, but parts of Canada are already projected to see winter-like weather.\n\n Questrade lays off undisclosed number of employees\n\n Questrade Financial Group Inc. says it has laid off an undisclosed number of employees to better fit its business strategy.\n\n RCMP looks to redeploy 25 per cent of eastern region workforce, including to border\n\n The RCMP says it's looking to redeploy up to one-quarter of its eastern region workforce to areas considered an operational priority, including to the U.S. border.\n\n Manitoba Metis Federation to be first Metis group with modern treaty with Canada\n\n The Manitoba Metis Federation will be the first Metis group to sign a modern treaty with the federal government.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Oath to monarch now optional in Yukon after council refused pledge to King\n\n Municipal leaders in the Yukon now have the option of taking an oath to the Constitution or to King Charles III during their swearing-in ceremonies, after a new council in one community refused to pledge allegiance to the monarch.\n\n 'Mayday! Mayday! Mayday!': Details emerge in Boeing 737 incident at Montreal airport\n\n New details suggest that there were communication issues between the pilots of a charter flight and the control tower at Montreal's Mirabel airport when a Boeing 737 made an emergency landing on Wednesday.\n\n Machete used to kill Edmonton man may have been picked up by passerby: police\n\n Police are searching for the weapon used to kill an Edmonton man last month.\n\n Democratic lawmakers from Connecticut report Thanksgiving bomb threats against their homes\n\n Six Democratic members of Congress from Connecticut were targeted by bomb threats on their homes Thursday, the lawmakers or their offices said.\n\n Palestinian woman and two children crushed to death outside bakery in Gaza\n\n Three Palestinians, including two children and a woman, were crushed to death on Friday while in line outside a bakery in central Gaza.\n\n Customers at this Starbucks can sip coffee and observe a quiet North Korean village\n\n Coffee drinkers can sip their beverages and view a quiet North Korean mountain village from a new Starbucks at a South Korean border observatory.\n\n Musk joins Trump and family for Thanksgiving at Mar-a-Lago\n\n Elon Musk had a seat at the family table for Thanksgiving dinner at Mar-a-Lago, joining President-elect Donald Trump, Melania Trump and their 18-year-old son.\n\n Death toll in Uganda landslides rises to 20 as search for more casualties presses on\n\n More bodies buried under the mud were retrieved in eastern Uganda on Friday and an injured person died in a hospital, bringing the death toll to 20.\n\n U.K. intelligence chief accuses Russia of 'staggeringly reckless' sabotage campaign\n\n The head of Britain's foreign intelligence service said Friday that Russia is conducting a 'staggeringly reckless' sabotage campaign against Ukraine's Western allies, and that his spies are working to stop the consequences from spiraling out of control.\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Canada is pausing private refugee sponsorships from groups of five or more people and community organizations to help clear a backlog of applications.\n\n Canada pledges $50M for Palestinian humanitarian needs ahead of Gaza aid conference\n\n Canada announce $50 million in humanitarian aid for Palestinians in both the Gaza Strip and the West Bank, and calls Israel to not undermine the UNRWA.\n\n Study reveals ‘strong genetic connection’ between period pain and depression\n\n Up to 90 per cent of people who menstruate experience pain during their periods. For some, that pain is severe and linked with symptoms of depression.\n\n British lawmakers give initial approval to a bill to allow terminally ill adults to end their lives\n\n British lawmakers gave initial approval on Friday to a bill to help terminally ill adults end their lives in England and Wales, following an impassioned debate that saw people sharing personal stories of loss and suffering.\n\n B.C. man lied about cancer diagnosis while dodging $330K debt, court hears\n\n A construction contractor from B.C.'s Lower Mainland has been ordered to repay a $330,000 loan from a friend who gave him leeway for years, despite her own financial suffering, all because she was under the false impression he had brain cancer.\n\n As Australia bans social media for children, Quebec is paying close attention\n\n As Australia moves to ban social media for children under 16, Quebec is debating whether to follow suit.\n\n No more ID? Air Canada rolls out facial recognition tech at Vancouver airport\n\n Air Canada is rolling out facial recognition technology at the gate, making it the first Canadian airline to deploy the software in a bid to make the boarding process smoother.\n\n Competition Bureau suing Google, wants company to sell off two advertising services\n\n The Competition Bureau is suing Google over alleged anticompetitive conduct in the tech giant's online advertising business and wants the company to sell off two of its services and pay a penalty.\n\n Entertainment \n\n Dwayne Johnson reveals he wears a bodysuit in live-action 'Moana': 'We got caught'\n\n Dwayne 'The Rock' confirmed he wears a bodysuit in the live-action version of 'Moana,' which will hit theaters in 2026, after photos published of Johnson on set.\n\n Billboard apologizes to Taylor Swift for video snafu\n\n Billboard put together a video of some of Swift's achievements and used a clip from Kanye West's music video for the song 'Famous.'\n\n Nick Cannon says he's seeking help for narcissistic personality disorder\n\n Nick Cannon has spoken out about his recent diagnosis of narcissistic personality disorder, saying 'I need help.'\n\n Questrade lays off undisclosed number of employees\n\n Questrade Financial Group Inc. says it has laid off an undisclosed number of employees to better fit its business strategy.\n\n Canada Bread owner sues Maple Leaf over alleged bread price-fixing\n\n Canada Bread owner Grupo Bimbo is suing Maple Leaf Foods for more than $2 billion, saying it lied about the company's involvement in an alleged bread price-fixing conspiracy.\n\n Black Friday shopping fuelling plenty of sales across Canadian retailers\n\n Canadian shoppers have been visiting malls and logging onto retailer websites for Black Friday. Shopify says the average cart in Canada totalled $220.63.\n\n Lifestyle \n\n Pastor fights off Thanksgiving would-be burglar with jiu-jitsu training\n\n When a would-be burglar broke in to a California church on Thanksgiving day, he encountered an unexpected obstacle: A pastor, trained in martial arts and determined to defend his house of worship.\n\n Notre Dame Cathedral unveils its new interior 5 years after devastating fire\n\n After more than five years of frenetic, but sometimes interrupted, reconstruction work, Notre Dame Cathedral showed itself anew to the world Friday, with rebuilt soaring ceilings and creamy good-as-new stonework erasing sombre memories of its devastating fire in 2019.\n\n The Vienna sausage stand is more than just a snack stall. Now it has a UNESCO heritage recognition\n\n The Vienna sausage stand is a place where the street sweeper, the manager, the tourist and the celebrity converge for the same tasty snack. Now it also has the official stamp of approval as part of Austria’s heritage.\n\n John Herdman resigns as head coach of Toronto FC\n\n John Herdman, embroiled in the drone-spying scandal that has dogged Canada Soccer, has resigned as coach of Toronto FC.\n\n Linebacker remains in stable condition, hours after U.S. university announces his death\n\n Alabama A&M linebacker Medrick Burnett Jr. remains hospitalized with a head injury suffered in an October game, the school said hours after announcing that he had died.\n\n Canadian men climb four places to No. 31, reach all-time high in FIFA world rankings\n\n Canada will finish out the year at a career-high in the FIFA rankings after climbing four places to No. 31.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Hyundai recalling hundreds of thousands of cars and SUVs in Canada, U.S.\n\n Hyundai is recalling hundreds of thousands of SUVs and small cars in the U.S. and Canada because the rearview camera image may not show up on the screens.\n\n Trump's tariffs would devastate auto sector, raise consumer costs: industry leader\n\n An auto industry leader says U.S. president-elect Donald Trump's threat of tariffs on Canadian goods would have devastating effects for the sector, forcing both Canadian and U.S. consumers to pay higher prices.\n\n Local Spotlight \n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n 'My dear Carmel': Lost letters returned to 103-year-old Guelph, Ont. woman\n\n A young history buff was able to reunite a Guelph, Ont. woman with letters written by her husband almost 80 years ago.\n\n 'We have to do something': Homeless advocates in Moncton reaching out for help over holidays\n\n Twice a week, Joanne and Jeff Jonah fill up their vehicle full of snacks and sandwiches and deliver them to the homeless in downtown Moncton, N.B.\n\n 100-year-old Winnipeg man walks blocks to see his wife\n\n It's considered lucky to live to be 100, but often when you hit that milestone, you're faced with significant mobility issues. Not Winnipeg's Jack Mudry. The centenarian regularly walks five blocks to get where he wants to go, the care home where his wife Stella lives.\n\n Video shows B.C. cat bursting through pet door to confront raccoons\n\n Several hungry raccoons were chased off a B.C. couple’s deck this week by one over-confident house cat – who was ultimately lucky to saunter away unscathed.\n\n Trailer Park Boys host Canadian premiere of new movie in Dartmouth\n\n Sunday night was a big night for the Trailer Park Boys, as Ricky, Julian and Bubbles hosted an advanced screening of their new movie in Dartmouth, N.S.\n\n Deer spotted wearing high-visibility safety jacket in Northern B.C.\n\n Andrea Arnold is used to having to slow down to let deer cross the road in her Northern B.C. community. But this weekend she saw something that made her pull over and snap a photo.\n\n From cellphones to dentures: Inside Halifax Transit’s lost and found\n\n Every single item misplaced on a bus or ferry in the Halifax Regional Municipality ends up in a small office at the Halifax Transit Bridge Terminal in Dartmouth, N.S.\n\n Torontonians identify priorities, concerns in new city survey\n\n A new public opinion survey has found that 40 per cent of Torontonians don’t feel safe, while half reported that the quality of life in the city has worsened over the last year.\n\n Vancouver \n\n Suspect arrested after tense incident near Surrey school, police say\n\n Police in Surrey say they called in the heavily armed Emergency Response Team to arrest a man who allegedly had a gun Friday morning.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Man facing 10 charges after Richmond, B.C., crime spree\n\n A Metro Vancouver man has been charged with nine counts of breaking and entering and one count of mischief after a five-day crime spree last November.\n\n BREAKING | \n\n Feds announce $758 million in funding for new Line 2 TTC subway trains\n\n The TTC will get funding from the federal government to replace aging trains on Line 2, Deputy Prime Minister Chrystia Freeland has announced.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Officer's inaccurate testimony 'will undoubtedly tarnish the image of the Toronto Police Service:' police tribunal\n\n A Toronto cop who 'derailed' a criminal investigation by 'inaccurately' testifying that he saw drugs in plain view inside a suspect’s car has been demoted for two years after pleading guilty to discreditable conduct, a decision from the police tribunal read.\n\n Oil and gas drilling projected to reach 10-year high, but Trump tariffs pose threat\n\n Canada's oil and gas well drilling sector is poised to employ more people next year than it has in a decade, but the job growth could be derailed if president-elect Donald Trump makes good on his tariffs threat.\n\n Calgary fighters thankful to enter ring under safe conditions after Ultra Boxing event cancelled\n\n A group of Calgary fighters are thankful to be able to enter the ring under a properly sanctioned event this weekend after the organization they were training under was suspended by Boxing Alberta for two years due to safety concerns.\n\n Blue Jackets extend points streak to 5 games with a chippy 5-2 win over the Flames\n\n Adam Fantilli scored twice and the Columbus Blue Jackets extended their points streak to five games with a 5-2 win over the Calgary Flames in a chippy game that included six fighting majors.\n\n 'We will always be a downtown store': Steve's Music Store moving from Rideau Street after 42 years\n\n A staple of the Rideau Street corridor, Steve's Music Store, is packing up and moving out after 42 years in business. The store will not be closing, its manager says, but rather moving to a new location that is yet unannounced.\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n Efforts to free cargo ship stuck in St. Lawrence River near Morrisburg, Ont. continue\n\n Crews are working tirelessly to free the Tim S. Dool, a large cargo ship that ran aground on a shoal along the St. Lawrence River near Morrisburg, Ont. on Saturday.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Judge hears from ex-employees of Montreal billionaire Robert Miller in sex abuse lawsuit\n\n A Quebec Superior Court justice will deliberate before deciding whether to authorize a class-action lawsuit against Quebec electronics billionaire Robert Miller, accused of paying minors for sex.\n\n Santé Quebec launch brings uncertainty to province's health-care system\n\n Sante Quebec is launching on Sunday amid concerns over budget cuts and the impact on services.\n\n Massage therapist charged in connection with sexual assault at Mill Woods clinic\n\n An Edmonton massage therapist has been charged with sexual assault in connection with an incident earlier this year.\n\n Armed convenience store robber sought by Edmonton police\n\n Police are searching for the man who robbed a convenience store in southwest Edmonton last weekend.\n\n Alberta company to pay $12K for contravening Water Act\n\n An Alberta company pleaded guilty to contravening the Water Act earlier this week and was ordered to pay $12,000, inclusive of a victim fine surcharge.\n\n Man charged after Halifax high school placed in hold and secure\n\n A man has been charged after a high school in Halifax was placed in hold and secure Friday morning.\n\n Teen arrested in connection with weapons call at Fredericton High School\n\n Fredericton Police Force arrested a 14-year-old boy Thursday in relation to a weapons call at Fredericton High School.\n\n P.E.I. steps in to help buy mobile park to allow residents to stay in homes\n\n Residents of Evergreen Village mobile home park in Summerside, P.E.I., who have had an eviction notice looming over their heads may be able to stay in their homes after all.\n\n True North officially buys Portage Place Mall\n\n True North Real Estate Development (TNRED) has officially purchased Portage Place Mall.\n\n Manitoba Metis Federation to be first Metis group with modern treaty with Canada\n\n The Manitoba Metis Federation will be the first Metis group to sign a modern treaty with the federal government.\n\n 'All these women matter': human rights complaint filed against city over refusal to search landfills\n\n Family members of three slain Indigenous women have filed a human rights complaint over the city’s refusal to search Brady Road and Prairie Green Landfills, saying not enough was done to bring home their remains.\n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n Sask. NDP says Scott Moe, staff stayed in Toronto hotel at rate over $800 per night\n\n The Saskatchewan NDP says Premier Scott Moe and three Saskatchewan Party staff members stayed at a hotel in Toronto last June that cost each of them $818.74 per night for a three-night stay.\n\n Jury sequestered to find verdict in sexual assault trial against Regina chiropractor\n\n Justice Janet McMurtry sequestered a 12-person jury to determine a verdict against Regina-based chiropractor Ruben Manz.\n\n Kitchener \n\n Family of Guelph, Ont. man killed in B.C. crash pushing for case review\n\n The family of a Guelph, Ont. man who was killed in a car crash in British Columbia is pushing for a review of the case, after learning about the charge that a driver involved is now facing.\n\n Erick Buhr to represent himself during sentencing for second-degree murder in death of his grandmother, Viola Erb\n\n Erick Buhr will represent himself as he prepares for sentencing after being convicted of second-degree murder in the death of his grandmother, Viola Erb.\n\n Region of Waterloo considers reducing, and even cutting, some services to keep tax increase down\n\n The Region of Waterloo is considering reducing or eliminating some services in an effort to lower the potential 2025 tax increase.\n\n Saskatoon \n\n Saskatoon temporary smudge location to be taken down\n\n While the City of Saskatoon says it granted a temporary permit for smudging and a ceremonial open fire, that expired at 6p.m. Tuesday night.\n\n 'A huge value addition': Sask. scientists develop way to make canola meal more profitable\n\n Researchers at the University of Saskatchewan are looking at making the canola crop more profitable.\n\n Missing 60-year-old Sask. man found dead\n\n The Saskatchewan RCMP says 60-year-old Clayton Cameron, reported missing earlier this week, has been found dead.\n\n Northern Ontario \n\n Man fined $10K for abandoning homemade barge in Lake Nipissing\n\n A man from Lavigne, Ont., has been fined $10,000 for abandoning a homemade barge in Lake Nipissing.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Heavy police presence on road in Iroquois Falls\n\n Members of the public are being asked to avoid the area of Nellie Lake Road West in Iroquois Falls.\n\n Crown witness describes chaotic night after bush party shooting\n\n Crown witness Reece Davidson, 21, told the jury that he was at the bush bash off of Pack Road in southwest London with a bunch of his young friends on July 30, 2021.\n\n Residents keep up the fight against human waste fertilizer storage site\n\n Residents living near a planned storage facility containing dried human waste fertilizer took their fight to the streets of Strathroy Friday.\n\n 'The only thing you could see were his eyes': Employees pepper sprayed at south London business\n\n Around 4 p.m. on Thursday, police were called to a report of an assault in progress at a business int he 600 block of Wilkins St. near Wellington Road.\n\n Former Ont. teacher charged with sexually assaulting a teen nearly 50 years ago\n\n A senior from Clearview Township faces charges in connection with an investigation into a sexual assault involving a teen nearly 50 years ago.\n\n Jury delivers verdict in Midland landlord's second-degree murder case\n\n The Midland man facing second-degree murder for the death of his tenant in 2021 was found not guilty on Friday.\n\n 50 cm of snow across central Ontario expected this weekend\n\n Environment Canada has released snow squall warnings and watches for our region.\n\n Breaking | \n\n Guilty on all counts: Windsor man convicted of careless driving in Retrofest double fatal collision\n\n The Windsor man charged in connection to the double fatal Retrofest collision has been convicted on all counts.\n\n 'All the indicators are fantastic': Devonshire Mall braces for record breaking crowds this Black Friday weekend\n\n Thousands of shoppers are expected to head to Devonshire Mall in full force this weekend in search of holiday savings and the best Black Friday deals.\n\n Model railroad program inspiring next generation\n\n Model railroading is a popular hobby. It can be as simple as a train on a small oval track or a complex rail system with detailed scenery.\n\n Vancouver Island \n\n Supreme Court clears way for B.C. to include other governments in opioid lawsuit\n\n B.C. Attorney General Niki Sharma says a Supreme Court of Canada victory has cleared a \"pathway\" for governments across the country to go after opioid makers and distributors for damages arising from the opioid crisis.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n How changing catch-and-release fishing practices can boost salmon survival\n\n A study has found catch-and-release sportfishing practices that leave salmon with injuries, particularly to their eyes, cause higher mortality than earlier research suggested.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Kelowna, B.C., to host the Memorial Cup in the spring of 2026\n\n The Western Hockey League's Kelowna Rockets will host the Memorial Cup in the spring of 2026, the Canadian Hockey League said Wednesday.\n\n 545 vehicles impounded in 332 days: BC Highway Patrol pleads for drivers to slow down\n\n Mounties with the BC Highway Patrol in Kelowna say they've impounded more than 545 vehicles for excessive speed and aggressive driving so far this year. That works out to more than 1.6 per day.\n\n Lethbridge \n\n City of Lethbridge launches 'Goosinator' tool to manage waterfowl at lakes\n\n While it may look colourful and cartoonish to humans, a new tool is designed to represent a predator for geese and other species at Henderson Lake to improve water quality.\n\n Western Slam basketball tournament tips off in Lethbridge\n\n The inaugural Western Slam tournament got underway Thursday evening at the VisitLethbridge.com Arena.\n\n Unattended candle led to fire inside Lethbridge home: officials\n\n An investigation is underway after a fire at a Lethbridge home on Friday.\n\n Sault Ste. Marie \n\n Two arrested following shooting on Manitoulin Island\n\n The Manitoulin detachment of the Ontario Provincial Police have two people in custody following a shooting incident in Wikwemikong Unceded Territory on Thursday.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Northern MPP calls for Sept 30 to be stat holiday in Ontario\n\n Kiiwetinoong MPP Sol Mamakwa wants to make Sept. 30 a statutory holiday in Ontario.\n\n Newfoundland's LGBTQ2S+ bar paid drag queens $37.50. Tara Nova called them out.\n\n If the screaming crowd in the twinkling Majestic Theatre in downtown St. John's was any indication, Newfoundland drag queen Tara Nova will never have to accept $37.50 for a show again.\n\n 'Who profits on hunger?': Inuit send pleading emails to minister about food costs\n\n People in Nunavut and northern Labrador have been writing to Canadian government officials this year to say grocers were charging exorbitant prices despite receiving a federal subsidy.\n\n As N.L. firm pivots, scientists say Canada's green hydrogen dreams are far-fetched\n\n A Newfoundland energy company's embrace of data centres is raising doubts about eastern Canadian hopes of harnessing the region's howling winds to supply Germany with power from green hydrogen.\n\n Stay Connected","url":"https://www.ctvnews.ca/politics/canada-is-pausing-private-refugee-sponsorship-applications-until-2026-1.7128786","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/11/29/ukrainian-refugees-arrive-to-winnipeg-1-7128802-1732924204903.jpg","video":null,"publish_date":"2024-11-30 00:52:34","author":"David Baxter","authors":["David Baxter"],"language":"en","source_country":"ca","sentiment":-0.023},{"id":269061822,"title":"Prime Minister Trudeau To Meet Donald Trump At Mar A Lago 1","text":"MORE POLITICS NEWS \n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Canada pledges $50M for Palestinian humanitarian needs ahead of Gaza aid conference\n\n Trudeau says no question Trump is serious on tariff threat\n\n Trudeau appears unwilling to expand proposed rebate, despite pressure to include seniors\n\n Trudeau Liberals' two-month GST holiday bill passes the House, off to the Senate\n\n Federal government posts $13B deficit in first half of the fiscal year\n\n 'A little candy today for pain down the road': Former Bank of Canada governor on GST holiday, rebate cheques\n\n Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives\n\n NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power.\n\n 'Not the result we wanted': Trudeau responds after surprise Conservative byelection win in Liberal stronghold\n\n Conservative candidate Don Stewart winning the closely-watched Toronto-St. Paul's federal byelection, and delivering a stunning upset to Justin Trudeau's candidate Leslie Church in the long-time Liberal riding, has sent political shockwaves through both parties.\n\n 'We will go with the majority': Liberals slammed by opposition over proposal to delay next election\n\n The federal Liberal government learned Friday it might have to retreat on a proposal within its electoral reform legislation to delay the next vote by one week, after all opposition parties came out to say they can't support it.\n\n Budget 2024 prioritizes housing while taxing highest earners, deficit projected at $39.8B\n\n In an effort to level the playing field for young people, in the 2024 federal budget, the government is targeting Canada's highest earners with new taxes in order to help offset billions in new spending to enhance the country's housing supply and social supports.\n\n 'One of the greatest': Former prime minister Brian Mulroney commemorated at state funeral\n\n Prominent Canadians, political leaders, and family members remembered former prime minister and Progressive Conservative titan Brian Mulroney as an ambitious and compassionate nation-builder at his state funeral on Saturday.\n\n opinion | \n\n Don Martin: Gusher of Liberal spending won't put out the fire in this dumpster\n\n A Hail Mary rehash of the greatest hits from the Trudeau government’s three-week travelling pony-show, the 2024 federal budget takes aim at reversing the party’s popularity plunge in the under-40 set, writes political columnist Don Martin. But will it work before the next election?\n\n opinion | \n\n Don Martin: The doctor Trudeau dumped has a prescription for better health care\n\n Political columnist Don Martin sat down with former federal health minister Jane Philpott, who's on a crusade to help fix Canada's broken health care system, and who declined to take any shots at the prime minister who dumped her from caucus.\n\n opinion | \n\n Don Martin: Trudeau's seeking shelter from the housing storm he helped create\n\n While Justin Trudeau's recent housing announcements are generally drawing praise from experts, political columnist Don Martin argues there shouldn’t be any standing ovations for a prime minister who helped caused the problem in the first place.\n\n opinion | \n\n Don Martin: Poilievre has the field to himself as he races across the country to big crowds\n\n It came to pass on Thursday evening that the confidentially predictable failure of the Official Opposition non-confidence motion went down with 204 Liberal, BQ and NDP nays to 116 Conservative yeas. But forcing Canada into a federal election campaign was never the point.\n\n opinion | \n\n Don Martin: How a beer break may have doomed the carbon tax hike\n\n When the Liberal government chopped a planned beer excise tax hike to two per cent from 4.5 per cent and froze future increases until after the next election, says political columnist Don Martin, it almost guaranteed a similar carbon tax move in the offing.\n\n CTVNews.ca Top Stories\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n 'Mayday! Mayday! Mayday!': Details emerge in Boeing 737 incident at Montreal airport\n\n New details suggest that there were communication issues between the pilots of a charter flight and the control tower at Montreal's Mirabel airport when a Boeing 737 made an emergency landing on Wednesday.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Questrade lays off undisclosed number of employees\n\n Questrade Financial Group Inc. says it has laid off an undisclosed number of employees to better fit its business strategy.\n\n Cucumbers sold in Ontario, other provinces recalled over possible salmonella contamination\n\n A U.S. company is recalling cucumbers sold in Ontario and other Canadian provinces due to possible salmonella contamination.\n\n Billboard apologizes to Taylor Swift for video snafu\n\n Billboard put together a video of some of Swift's achievements and used a clip from Kanye West's music video for the song 'Famous.'\n\n Musk joins Trump and family for Thanksgiving at Mar-a-Lago\n\n Elon Musk had a seat at the family table for Thanksgiving dinner at Mar-a-Lago, joining President-elect Donald Trump, Melania Trump and their 18-year-old son.\n\n John Herdman resigns as head coach of Toronto FC\n\n John Herdman, embroiled in the drone-spying scandal that has dogged Canada Soccer, has resigned as coach of Toronto FC.\n\n Weekend weather: Parts of Canada could see up to 50 centimetres of snow, wind chills of -40\n\n Winter is less than a month away, but parts of Canada are already projected to see winter-like weather.\n\n RCMP looks to redeploy 25 per cent of eastern region workforce, including to border\n\n The RCMP says it's looking to redeploy up to one-quarter of its eastern region workforce to areas considered an operational priority, including to the U.S. border.\n\n Manitoba Metis Federation to be first Metis group with modern treaty with Canada\n\n The Manitoba Metis Federation will be the first Metis group to sign a modern treaty with the federal government.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Oath to monarch now optional in Yukon after council refused pledge to King\n\n Municipal leaders in the Yukon now have the option of taking an oath to the Constitution or to King Charles III during their swearing-in ceremonies, after a new council in one community refused to pledge allegiance to the monarch.\n\n 'Mayday! Mayday! Mayday!': Details emerge in Boeing 737 incident at Montreal airport\n\n New details suggest that there were communication issues between the pilots of a charter flight and the control tower at Montreal's Mirabel airport when a Boeing 737 made an emergency landing on Wednesday.\n\n Machete used to kill Edmonton man may have been picked up by passerby: police\n\n Police are searching for the weapon used to kill an Edmonton man last month.\n\n Democratic lawmakers from Connecticut report Thanksgiving bomb threats against their homes\n\n Six Democratic members of Congress from Connecticut were targeted by bomb threats on their homes Thursday, the lawmakers or their offices said.\n\n Palestinian woman and two children crushed to death outside bakery in Gaza\n\n Three Palestinians, including two children and a woman, were crushed to death on Friday while in line outside a bakery in central Gaza.\n\n Customers at this Starbucks can sip coffee and observe a quiet North Korean village\n\n Coffee drinkers can sip their beverages and view a quiet North Korean mountain village from a new Starbucks at a South Korean border observatory.\n\n Musk joins Trump and family for Thanksgiving at Mar-a-Lago\n\n Elon Musk had a seat at the family table for Thanksgiving dinner at Mar-a-Lago, joining President-elect Donald Trump, Melania Trump and their 18-year-old son.\n\n Death toll in Uganda landslides rises to 20 as search for more casualties presses on\n\n More bodies buried under the mud were retrieved in eastern Uganda on Friday and an injured person died in a hospital, bringing the death toll to 20.\n\n U.K. intelligence chief accuses Russia of 'staggeringly reckless' sabotage campaign\n\n The head of Britain's foreign intelligence service said Friday that Russia is conducting a 'staggeringly reckless' sabotage campaign against Ukraine's Western allies, and that his spies are working to stop the consequences from spiraling out of control.\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Canada is pausing private refugee sponsorships from groups of five or more people and community organizations to help clear a backlog of applications.\n\n Canada pledges $50M for Palestinian humanitarian needs ahead of Gaza aid conference\n\n Canada announce $50 million in humanitarian aid for Palestinians in both the Gaza Strip and the West Bank, and calls Israel to not undermine the UNRWA.\n\n Study reveals ‘strong genetic connection’ between period pain and depression\n\n Up to 90 per cent of people who menstruate experience pain during their periods. For some, that pain is severe and linked with symptoms of depression.\n\n British lawmakers give initial approval to a bill to allow terminally ill adults to end their lives\n\n British lawmakers gave initial approval on Friday to a bill to help terminally ill adults end their lives in England and Wales, following an impassioned debate that saw people sharing personal stories of loss and suffering.\n\n B.C. man lied about cancer diagnosis while dodging $330K debt, court hears\n\n A construction contractor from B.C.'s Lower Mainland has been ordered to repay a $330,000 loan from a friend who gave him leeway for years, despite her own financial suffering, all because she was under the false impression he had brain cancer.\n\n As Australia bans social media for children, Quebec is paying close attention\n\n As Australia moves to ban social media for children under 16, Quebec is debating whether to follow suit.\n\n No more ID? Air Canada rolls out facial recognition tech at Vancouver airport\n\n Air Canada is rolling out facial recognition technology at the gate, making it the first Canadian airline to deploy the software in a bid to make the boarding process smoother.\n\n Competition Bureau suing Google, wants company to sell off two advertising services\n\n The Competition Bureau is suing Google over alleged anticompetitive conduct in the tech giant's online advertising business and wants the company to sell off two of its services and pay a penalty.\n\n Entertainment \n\n Dwayne Johnson reveals he wears a bodysuit in live-action 'Moana': 'We got caught'\n\n Dwayne 'The Rock' confirmed he wears a bodysuit in the live-action version of 'Moana,' which will hit theaters in 2026, after photos published of Johnson on set.\n\n Billboard apologizes to Taylor Swift for video snafu\n\n Billboard put together a video of some of Swift's achievements and used a clip from Kanye West's music video for the song 'Famous.'\n\n Nick Cannon says he's seeking help for narcissistic personality disorder\n\n Nick Cannon has spoken out about his recent diagnosis of narcissistic personality disorder, saying 'I need help.'\n\n Oil and gas drilling projected to reach 10-year high, but Trump tariffs pose threat\n\n Canada's oil and gas well drilling sector is poised to employ more people next year than it has in a decade, but the job growth could be derailed if president-elect Donald Trump makes good on his tariffs threat.\n\n Questrade lays off undisclosed number of employees\n\n Questrade Financial Group Inc. says it has laid off an undisclosed number of employees to better fit its business strategy.\n\n Canada Bread owner sues Maple Leaf over alleged bread price-fixing\n\n Canada Bread owner Grupo Bimbo is suing Maple Leaf Foods for more than $2 billion, saying it lied about the company's involvement in an alleged bread price-fixing conspiracy.\n\n Lifestyle \n\n Pastor fights off Thanksgiving would-be burglar with jiu-jitsu training\n\n When a would-be burglar broke in to a California church on Thanksgiving day, he encountered an unexpected obstacle: A pastor, trained in martial arts and determined to defend his house of worship.\n\n Notre Dame Cathedral unveils its new interior 5 years after devastating fire\n\n After more than five years of frenetic, but sometimes interrupted, reconstruction work, Notre Dame Cathedral showed itself anew to the world Friday, with rebuilt soaring ceilings and creamy good-as-new stonework erasing sombre memories of its devastating fire in 2019.\n\n The Vienna sausage stand is more than just a snack stall. Now it has a UNESCO heritage recognition\n\n The Vienna sausage stand is a place where the street sweeper, the manager, the tourist and the celebrity converge for the same tasty snack. Now it also has the official stamp of approval as part of Austria’s heritage.\n\n John Herdman resigns as head coach of Toronto FC\n\n John Herdman, embroiled in the drone-spying scandal that has dogged Canada Soccer, has resigned as coach of Toronto FC.\n\n Linebacker remains in stable condition, hours after U.S. university announces his death\n\n Alabama A&M linebacker Medrick Burnett Jr. remains hospitalized with a head injury suffered in an October game, the school said hours after announcing that he had died.\n\n Canadian men climb four places to No. 31, reach all-time high in FIFA world rankings\n\n Canada will finish out the year at a career-high in the FIFA rankings after climbing four places to No. 31.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Hyundai recalling hundreds of thousands of cars and SUVs in Canada, U.S.\n\n Hyundai is recalling hundreds of thousands of SUVs and small cars in the U.S. and Canada because the rearview camera image may not show up on the screens.\n\n Trump's tariffs would devastate auto sector, raise consumer costs: industry leader\n\n An auto industry leader says U.S. president-elect Donald Trump's threat of tariffs on Canadian goods would have devastating effects for the sector, forcing both Canadian and U.S. consumers to pay higher prices.\n\n Local Spotlight \n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n 'My dear Carmel': Lost letters returned to 103-year-old Guelph, Ont. woman\n\n A young history buff was able to reunite a Guelph, Ont. woman with letters written by her husband almost 80 years ago.\n\n 'We have to do something': Homeless advocates in Moncton reaching out for help over holidays\n\n Twice a week, Joanne and Jeff Jonah fill up their vehicle full of snacks and sandwiches and deliver them to the homeless in downtown Moncton, N.B.\n\n 100-year-old Winnipeg man walks blocks to see his wife\n\n It's considered lucky to live to be 100, but often when you hit that milestone, you're faced with significant mobility issues. Not Winnipeg's Jack Mudry. The centenarian regularly walks five blocks to get where he wants to go, the care home where his wife Stella lives.\n\n Video shows B.C. cat bursting through pet door to confront raccoons\n\n Several hungry raccoons were chased off a B.C. couple’s deck this week by one over-confident house cat – who was ultimately lucky to saunter away unscathed.\n\n Trailer Park Boys host Canadian premiere of new movie in Dartmouth\n\n Sunday night was a big night for the Trailer Park Boys, as Ricky, Julian and Bubbles hosted an advanced screening of their new movie in Dartmouth, N.S.\n\n Deer spotted wearing high-visibility safety jacket in Northern B.C.\n\n Andrea Arnold is used to having to slow down to let deer cross the road in her Northern B.C. community. But this weekend she saw something that made her pull over and snap a photo.\n\n From cellphones to dentures: Inside Halifax Transit’s lost and found\n\n Every single item misplaced on a bus or ferry in the Halifax Regional Municipality ends up in a small office at the Halifax Transit Bridge Terminal in Dartmouth, N.S.\n\n Torontonians identify priorities, concerns in new city survey\n\n A new public opinion survey has found that 40 per cent of Torontonians don’t feel safe, while half reported that the quality of life in the city has worsened over the last year.\n\n Vancouver \n\n Suspect arrested after tense incident near Surrey school, police say\n\n Police in Surrey say they called in the heavily armed Emergency Response Team to arrest a man who allegedly had a gun Friday morning.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Man facing 10 charges after Richmond, B.C., crime spree\n\n A Metro Vancouver man has been charged with nine counts of breaking and entering and one count of mischief after a five-day crime spree last November.\n\n BREAKING | \n\n Feds announce $758 million in funding for new Line 2 TTC subway trains\n\n The TTC will get funding from the federal government to replace aging trains on Line 2, Deputy Prime Minister Chrystia Freeland has announced.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Officer's inaccurate testimony 'will undoubtedly tarnish the image of the Toronto Police Service:' police tribunal\n\n A Toronto cop who 'derailed' a criminal investigation by 'inaccurately' testifying that he saw drugs in plain view inside a suspect’s car has been demoted for two years after pleading guilty to discreditable conduct, a decision from the police tribunal read.\n\n Friday stabbing in Calgary’s southeast sends at least 1 to hospital in serious condition\n\n At least one person was hospitalized late Friday afternoon following a stabbing in southeast Calgary.\n\n Oil and gas drilling projected to reach 10-year high, but Trump tariffs pose threat\n\n Canada's oil and gas well drilling sector is poised to employ more people next year than it has in a decade, but the job growth could be derailed if president-elect Donald Trump makes good on his tariffs threat.\n\n Calgary fighters thankful to enter ring under safe conditions after Ultra Boxing event cancelled\n\n A group of Calgary fighters are thankful to be able to enter the ring under a properly sanctioned event this weekend after the organization they were training under was suspended by Boxing Alberta for two years due to safety concerns.\n\n 'We will always be a downtown store': Steve's Music Store moving from Rideau Street after 42 years\n\n A staple of the Rideau Street corridor, Steve's Music Store, is packing up and moving out after 42 years in business. The store will not be closing, its manager says, but rather moving to a new location that is yet unannounced.\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n Efforts to free cargo ship stuck in St. Lawrence River near Morrisburg, Ont. continue\n\n Crews are working tirelessly to free the Tim S. Dool, a large cargo ship that ran aground on a shoal along the St. Lawrence River near Morrisburg, Ont. on Saturday.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Judge hears from ex-employees of Montreal billionaire Robert Miller in sex abuse lawsuit\n\n A Quebec Superior Court justice will deliberate before deciding whether to authorize a class-action lawsuit against Quebec electronics billionaire Robert Miller, accused of paying minors for sex.\n\n Santé Quebec launch brings uncertainty to province's health-care system\n\n Sante Quebec is launching on Sunday amid concerns over budget cuts and the impact on services.\n\n Massage therapist charged in connection with sexual assault at Mill Woods clinic\n\n An Edmonton massage therapist has been charged with sexual assault in connection with an incident earlier this year.\n\n Armed convenience store robber sought by Edmonton police\n\n Police are searching for the man who robbed a convenience store in southwest Edmonton last weekend.\n\n Alberta company to pay $12K for contravening Water Act\n\n An Alberta company pleaded guilty to contravening the Water Act earlier this week and was ordered to pay $12,000, inclusive of a victim fine surcharge.\n\n Man charged after Halifax high school placed in hold and secure\n\n A man has been charged after a high school in Halifax was placed in hold and secure Friday morning.\n\n Teen arrested in connection with weapons call at Fredericton High School\n\n Fredericton Police Force arrested a 14-year-old boy Thursday in relation to a weapons call at Fredericton High School.\n\n P.E.I. steps in to help buy mobile park to allow residents to stay in homes\n\n Residents of Evergreen Village mobile home park in Summerside, P.E.I., who have had an eviction notice looming over their heads may be able to stay in their homes after all.\n\n True North officially buys Portage Place Mall\n\n True North Real Estate Development (TNRED) has officially purchased Portage Place Mall.\n\n Parts of southwestern Manitoba under extreme cold warning, temperatures could feel like -40\n\n Much of southwestern Manitoba is under an extreme cold warning as the wind chill could make temperatures feel close to minus 40.\n\n Manitoba Metis Federation to be first Metis group with modern treaty with Canada\n\n The Manitoba Metis Federation will be the first Metis group to sign a modern treaty with the federal government.\n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n Sask. NDP says Scott Moe, staff stayed in Toronto hotel at rate over $800 per night\n\n The Saskatchewan NDP says Premier Scott Moe and three Saskatchewan Party staff members stayed at a hotel in Toronto last June that cost each of them $818.74 per night for a three-night stay.\n\n Jury sequestered to find verdict in sexual assault trial against Regina chiropractor\n\n Justice Janet McMurtry sequestered a 12-person jury to determine a verdict against Regina-based chiropractor Ruben Manz.\n\n Kitchener \n\n Family of Guelph, Ont. man killed in B.C. crash pushing for case review\n\n The family of a Guelph, Ont. man who was killed in a car crash in British Columbia is pushing for a review of the case, after learning about the charge that a driver involved is now facing.\n\n Erick Buhr to represent himself during sentencing for second-degree murder in death of his grandmother, Viola Erb\n\n Erick Buhr will represent himself as he prepares for sentencing after being convicted of second-degree murder in the death of his grandmother, Viola Erb.\n\n Region of Waterloo considers reducing, and even cutting, some services to keep tax increase down\n\n The Region of Waterloo is considering reducing or eliminating some services in an effort to lower the potential 2025 tax increase.\n\n Saskatoon \n\n Saskatoon temporary smudge location to be taken down\n\n While the City of Saskatoon says it granted a temporary permit for smudging and a ceremonial open fire, that expired at 6p.m. Tuesday night.\n\n 'A huge value addition': Sask. scientists develop way to make canola meal more profitable\n\n Researchers at the University of Saskatchewan are looking at making the canola crop more profitable.\n\n Missing 60-year-old Sask. man found dead\n\n The Saskatchewan RCMP says 60-year-old Clayton Cameron, reported missing earlier this week, has been found dead.\n\n Northern Ontario \n\n Man fined $10K for abandoning homemade barge in Lake Nipissing\n\n A man from Lavigne, Ont., has been fined $10,000 for abandoning a homemade barge in Lake Nipissing.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Heavy police presence on road in Iroquois Falls\n\n Members of the public are being asked to avoid the area of Nellie Lake Road West in Iroquois Falls.\n\n Crown witness describes chaotic night after bush party shooting\n\n Crown witness Reece Davidson, 21, told the jury that he was at the bush bash off of Pack Road in southwest London with a bunch of his young friends on July 30, 2021.\n\n Residents keep up the fight against human waste fertilizer storage site\n\n Residents living near a planned storage facility containing dried human waste fertilizer took their fight to the streets of Strathroy Friday.\n\n 'The only thing you could see were his eyes': Employees pepper sprayed at south London business\n\n Around 4 p.m. on Thursday, police were called to a report of an assault in progress at a business int he 600 block of Wilkins St. near Wellington Road.\n\n Man airlifted with critical injuries after Haliburton crash\n\n One person was airlifted to a trauma centre with serious injuries after a collision in Haliburton on Friday.\n\n Former Ont. teacher charged with sexually assaulting a teen nearly 50 years ago\n\n A senior from Clearview Township faces charges in connection with an investigation into a sexual assault involving a teen nearly 50 years ago.\n\n Jury delivers verdict in Midland landlord's second-degree murder case\n\n The Midland man facing second-degree murder for the death of his tenant in 2021 was found not guilty on Friday.\n\n Breaking | \n\n Guilty on all counts: Windsor man convicted of careless driving in Retrofest double fatal collision\n\n The Windsor man charged in connection to the double fatal Retrofest collision has been convicted on all counts.\n\n 'All the indicators are fantastic': Devonshire Mall braces for record breaking crowds this Black Friday weekend\n\n Thousands of shoppers are expected to head to Devonshire Mall in full force this weekend in search of holiday savings and the best Black Friday deals.\n\n Model railroad program inspiring next generation\n\n Model railroading is a popular hobby. It can be as simple as a train on a small oval track or a complex rail system with detailed scenery.\n\n Vancouver Island \n\n Supreme Court clears way for B.C. to include other governments in opioid lawsuit\n\n B.C. Attorney General Niki Sharma says a Supreme Court of Canada victory has cleared a \"pathway\" for governments across the country to go after opioid makers and distributors for damages arising from the opioid crisis.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n How changing catch-and-release fishing practices can boost salmon survival\n\n A study has found catch-and-release sportfishing practices that leave salmon with injuries, particularly to their eyes, cause higher mortality than earlier research suggested.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Kelowna, B.C., to host the Memorial Cup in the spring of 2026\n\n The Western Hockey League's Kelowna Rockets will host the Memorial Cup in the spring of 2026, the Canadian Hockey League said Wednesday.\n\n 545 vehicles impounded in 332 days: BC Highway Patrol pleads for drivers to slow down\n\n Mounties with the BC Highway Patrol in Kelowna say they've impounded more than 545 vehicles for excessive speed and aggressive driving so far this year. That works out to more than 1.6 per day.\n\n Lethbridge \n\n City of Lethbridge launches 'Goosinator' tool to manage waterfowl at lakes\n\n While it may look colourful and cartoonish to humans, a new tool is designed to represent a predator for geese and other species at Henderson Lake to improve water quality.\n\n Western Slam basketball tournament tips off in Lethbridge\n\n The inaugural Western Slam tournament got underway Thursday evening at the VisitLethbridge.com Arena.\n\n Unattended candle led to fire inside Lethbridge home: officials\n\n An investigation is underway after a fire at a Lethbridge home on Friday.\n\n Sault Ste. Marie \n\n Two arrested following shooting on Manitoulin Island\n\n The Manitoulin detachment of the Ontario Provincial Police have two people in custody following a shooting incident in Wikwemikong Unceded Territory on Thursday.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Northern MPP calls for Sept 30 to be stat holiday in Ontario\n\n Kiiwetinoong MPP Sol Mamakwa wants to make Sept. 30 a statutory holiday in Ontario.\n\n Newfoundland's LGBTQ2S+ bar paid drag queens $37.50. Tara Nova called them out.\n\n If the screaming crowd in the twinkling Majestic Theatre in downtown St. John's was any indication, Newfoundland drag queen Tara Nova will never have to accept $37.50 for a show again.\n\n 'Who profits on hunger?': Inuit send pleading emails to minister about food costs\n\n People in Nunavut and northern Labrador have been writing to Canadian government officials this year to say grocers were charging exorbitant prices despite receiving a federal subsidy.\n\n As N.L. firm pivots, scientists say Canada's green hydrogen dreams are far-fetched\n\n A Newfoundland energy company's embrace of data centres is raising doubts about eastern Canadian hopes of harnessing the region's howling winds to supply Germany with power from green hydrogen.\n\n Stay Connected","url":"https://www.ctvnews.ca/politics/prime-minister-trudeau-to-meet-donald-trump-at-mar-a-lago-1.7128663","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/11/29/trump-trudeau-1-7128719-1732921496780.jpg","video":null,"publish_date":"2024-11-30 00:52:34","author":"Stephanie Ha","authors":["Stephanie Ha"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.023},{"id":269061824,"title":"Questrade Lays Off Undisclosed Number Of Employees 1","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n 20 Of The Best Gift Ideas For Men Under $200\n\n 13 Of The Best Self-Care Gifts You Can Find On Amazon Canada\n\n 19 Of The Best Tech Gifts Under $100\n\n Our Guide To The Best Cookware Sets In Canada In 2024 (And Where To Get Them)\n\n Our Guide To The Best Space Heaters In Canada In 2024 (And Where To Get Them)\n\n Our Guide to the Best Portable Induction Cooktops in Canada in 2024 (And Where to Get Them)\n\n 21 Of The Best Gift Ideas For Women Under $300\n\n 19 Of The Best Stocking Stuffers For Teenagers\n\n 15 Useful Amazon Products That Make Great Stocking Stuffers\n\n Our Guide To The Best Self Tanners You Can Get In Canada\n\n 20 Anti-Aging Skincare Products That Reviewers Can’t Stop Talking About\n\n 12 Budget-Friendly Makeup Brushes And Tools Worth Adding To Your Kit\n\n 75+ Of The Best Amazon Canada Black Friday Sales, Deals, And Discounts For 2024\n\n The Good Stuff: Our Favourite Black Friday Deals On Amazon Canada\n\n Amazon Canada's Black Friday Week Is On: This Smart Thermometer Will Make Holiday Cooking So Much Easier (And It’s 20% Off Right Now)\n\n CTVNews.ca Top Stories\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n 'Mayday! Mayday! Mayday!': Details emerge in Boeing 737 incident at Montreal airport\n\n New details suggest that there were communication issues between the pilots of a charter flight and the control tower at Montreal's Mirabel airport when a Boeing 737 made an emergency landing on Wednesday.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Cucumbers sold in Ontario, other provinces recalled over possible salmonella contamination\n\n A U.S. company is recalling cucumbers sold in Ontario and other Canadian provinces due to possible salmonella contamination.\n\n John Herdman resigns as head coach of Toronto FC\n\n John Herdman, embroiled in the drone-spying scandal that has dogged Canada Soccer, has resigned as coach of Toronto FC.\n\n Musk joins Trump and family for Thanksgiving at Mar-a-Lago\n\n Elon Musk had a seat at the family table for Thanksgiving dinner at Mar-a-Lago, joining President-elect Donald Trump, Melania Trump and their 18-year-old son.\n\n Billboard apologizes to Taylor Swift for video snafu\n\n Billboard put together a video of some of Swift’s achievements and used a clip from Kanye West’s music video for the song “Famous.”\n\n Trudeau says no question Trump is serious on tariff threat\n\n Prime Minister Justin Trudeau says incoming U.S. president Donald Trump's threats on tariffs should be taken seriously.\n\n Questrade lays off undisclosed number of employees\n\n Questrade Financial Group Inc. says it has laid off an undisclosed number of employees to better fit its business strategy.\n\n RCMP looks to redeploy 25 per cent of eastern region workforce, including to border\n\n The RCMP says it's looking to redeploy up to one-quarter of its eastern region workforce to areas considered an operational priority, including to the U.S. border.\n\n Manitoba Metis Federation to be first Metis group with modern treaty with Canada\n\n The Manitoba Metis Federation will be the first Metis group to sign a modern treaty with the federal government.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Oath to monarch now optional in Yukon after council refused pledge to King\n\n Municipal leaders in the Yukon now have the option of taking an oath to the Constitution or to King Charles III during their swearing-in ceremonies, after a new council in one community refused to pledge allegiance to the monarch.\n\n 'Mayday! Mayday! Mayday!': Details emerge in Boeing 737 incident at Montreal airport\n\n New details suggest that there were communication issues between the pilots of a charter flight and the control tower at Montreal's Mirabel airport when a Boeing 737 made an emergency landing on Wednesday.\n\n Machete used to kill Edmonton man may have been picked up by passerby: police\n\n Police are searching for the weapon used to kill an Edmonton man last month.\n\n Democratic lawmakers from Connecticut report Thanksgiving bomb threats against their homes\n\n Six Democratic members of Congress from Connecticut were targeted by bomb threats on their homes Thursday, the lawmakers or their offices said.\n\n Palestinian woman and two children crushed to death outside bakery in Gaza\n\n Three Palestinians, including two children and a woman, were crushed to death on Friday while in line outside a bakery in central Gaza.\n\n Customers at this Starbucks can sip coffee and observe a quiet North Korean village\n\n Coffee drinkers can sip their beverages and view a quiet North Korean mountain village from a new Starbucks at a South Korean border observatory.\n\n Musk joins Trump and family for Thanksgiving at Mar-a-Lago\n\n Elon Musk had a seat at the family table for Thanksgiving dinner at Mar-a-Lago, joining President-elect Donald Trump, Melania Trump and their 18-year-old son.\n\n Death toll in Uganda landslides rises to 20 as search for more casualties presses on\n\n More bodies buried under the mud were retrieved in eastern Uganda on Friday and an injured person died in a hospital, bringing the death toll to 20.\n\n U.K. intelligence chief accuses Russia of 'staggeringly reckless' sabotage campaign\n\n The head of Britain's foreign intelligence service said Friday that Russia is conducting a 'staggeringly reckless' sabotage campaign against Ukraine's Western allies, and that his spies are working to stop the consequences from spiraling out of control.\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n Canada is pausing private refugee sponsorship applications until 2026\n\n Canada is pausing private refugee sponsorships from groups of five or more people and community organizations to help clear a backlog of applications.\n\n Canada pledges $50M for Palestinian humanitarian needs ahead of Gaza aid conference\n\n Canada announce $50 million in humanitarian aid for Palestinians in both the Gaza Strip and the West Bank, and calls Israel to not undermine the UNRWA.\n\n Study reveals ‘strong genetic connection’ between period pain and depression\n\n Up to 90 per cent of people who menstruate experience pain during their periods. For some, that pain is severe and linked with symptoms of depression.\n\n British lawmakers give initial approval to a bill to allow terminally ill adults to end their lives\n\n British lawmakers gave initial approval on Friday to a bill to help terminally ill adults end their lives in England and Wales, following an impassioned debate that saw people sharing personal stories of loss and suffering.\n\n B.C. man lied about cancer diagnosis while dodging $330K debt, court hears\n\n A construction contractor from B.C.'s Lower Mainland has been ordered to repay a $330,000 loan from a friend who gave him leeway for years, despite her own financial suffering, all because she was under the false impression he had brain cancer.\n\n As Australia bans social media for children, Quebec is paying close attention\n\n As Australia moves to ban social media for children under 16, Quebec is debating whether to follow suit.\n\n No more ID? Air Canada rolls out facial recognition tech at Vancouver airport\n\n Air Canada is rolling out facial recognition technology at the gate, making it the first Canadian airline to deploy the software in a bid to make the boarding process smoother.\n\n Competition Bureau suing Google, wants company to sell off two advertising services\n\n The Competition Bureau is suing Google over alleged anticompetitive conduct in the tech giant's online advertising business and wants the company to sell off two of its services and pay a penalty.\n\n Entertainment \n\n Dwayne Johnson reveals he wears a bodysuit in live-action 'Moana': 'We got caught'\n\n Dwayne 'The Rock' confirmed he wears a bodysuit in the live-action version of 'Moana,' which will hit theaters in 2026, after photos published of Johnson on set.\n\n Billboard apologizes to Taylor Swift for video snafu\n\n Billboard put together a video of some of Swift’s achievements and used a clip from Kanye West’s music video for the song “Famous.”\n\n Nick Cannon says he's seeking help for narcissistic personality disorder\n\n Nick Cannon has spoken out about his recent diagnosis of narcissistic personality disorder, saying 'I need help.'\n\n Questrade lays off undisclosed number of employees\n\n Questrade Financial Group Inc. says it has laid off an undisclosed number of employees to better fit its business strategy.\n\n Canada Bread owner sues Maple Leaf over alleged bread price-fixing\n\n Canada Bread owner Grupo Bimbo is suing Maple Leaf Foods for more than $2 billion, saying it lied about the company's involvement in an alleged bread price-fixing conspiracy.\n\n Black Friday shopping fuelling plenty of sales across Canadian retailers\n\n Canadian shoppers have been visiting malls and logging onto retailer websites for Black Friday. Shopify says the average cart in Canada totalled $220.63.\n\n Lifestyle \n\n Pastor fights off Thanksgiving would-be burglar with jiu-jitsu training\n\n When a would-be burglar broke in to a California church on Thanksgiving day, he encountered an unexpected obstacle: A pastor, trained in martial arts and determined to defend his house of worship.\n\n Notre Dame Cathedral unveils its new interior 5 years after devastating fire\n\n After more than five years of frenetic, but sometimes interrupted, reconstruction work, Notre Dame Cathedral showed itself anew to the world Friday, with rebuilt soaring ceilings and creamy good-as-new stonework erasing sombre memories of its devastating fire in 2019.\n\n The Vienna sausage stand is more than just a snack stall. Now it has a UNESCO heritage recognition\n\n The Vienna sausage stand is a place where the street sweeper, the manager, the tourist and the celebrity converge for the same tasty snack. Now it also has the official stamp of approval as part of Austria’s heritage.\n\n John Herdman resigns as head coach of Toronto FC\n\n John Herdman, embroiled in the drone-spying scandal that has dogged Canada Soccer, has resigned as coach of Toronto FC.\n\n Linebacker remains in stable condition, hours after U.S. university announces his death\n\n Alabama A&M linebacker Medrick Burnett Jr. remains hospitalized with a head injury suffered in an October game, the school said hours after announcing that he had died.\n\n Canadian men climb four places to No. 31, reach all-time high in FIFA world rankings\n\n Canada will finish out the year at a career-high in the FIFA rankings after climbing four places to No. 31.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Hyundai recalling hundreds of thousands of cars and SUVs in Canada, U.S.\n\n Hyundai is recalling hundreds of thousands of SUVs and small cars in the U.S. and Canada because the rearview camera image may not show up on the screens.\n\n Trump's tariffs would devastate auto sector, raise consumer costs: industry leader\n\n An auto industry leader says U.S. president-elect Donald Trump's threat of tariffs on Canadian goods would have devastating effects for the sector, forcing both Canadian and U.S. consumers to pay higher prices.\n\n Local Spotlight \n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n 'My dear Carmel': Lost letters returned to 103-year-old Guelph, Ont. woman\n\n A young history buff was able to reunite a Guelph, Ont. woman with letters written by her husband almost 80 years ago.\n\n 'We have to do something': Homeless advocates in Moncton reaching out for help over holidays\n\n Twice a week, Joanne and Jeff Jonah fill up their vehicle full of snacks and sandwiches and deliver them to the homeless in downtown Moncton, N.B.\n\n 100-year-old Winnipeg man walks blocks to see his wife\n\n It's considered lucky to live to be 100, but often when you hit that milestone, you're faced with significant mobility issues. Not Winnipeg's Jack Mudry. The centenarian regularly walks five blocks to get where he wants to go, the care home where his wife Stella lives.\n\n Video shows B.C. cat bursting through pet door to confront raccoons\n\n Several hungry raccoons were chased off a B.C. couple’s deck this week by one over-confident house cat – who was ultimately lucky to saunter away unscathed.\n\n Trailer Park Boys host Canadian premiere of new movie in Dartmouth\n\n Sunday night was a big night for the Trailer Park Boys, as Ricky, Julian and Bubbles hosted an advanced screening of their new movie in Dartmouth, N.S.\n\n Deer spotted wearing high-visibility safety jacket in Northern B.C.\n\n Andrea Arnold is used to having to slow down to let deer cross the road in her Northern B.C. community. But this weekend she saw something that made her pull over and snap a photo.\n\n From cellphones to dentures: Inside Halifax Transit’s lost and found\n\n Every single item misplaced on a bus or ferry in the Halifax Regional Municipality ends up in a small office at the Halifax Transit Bridge Terminal in Dartmouth, N.S.\n\n Torontonians identify priorities, concerns in new city survey\n\n A new public opinion survey has found that 40 per cent of Torontonians don’t feel safe, while half reported that the quality of life in the city has worsened over the last year.\n\n Vancouver \n\n Suspect arrested after tense incident near Surrey school, police say\n\n Police in Surrey say they called in the heavily armed Emergency Response Team to arrest a man who allegedly had a gun Friday morning.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Man facing 10 charges after Richmond, B.C., crime spree\n\n A Metro Vancouver man has been charged with nine counts of breaking and entering and one count of mischief after a five-day crime spree last November.\n\n BREAKING | \n\n Feds announce $758 million in funding for new Line 2 TTC subway trains\n\n The TTC will get funding from the federal government to replace aging trains on Line 2, Deputy Prime Minister Chrystia Freeland has announced.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Officer's inaccurate testimony 'will undoubtedly tarnish the image of the Toronto Police Service:' police tribunal\n\n A Toronto cop who 'derailed' a criminal investigation by 'inaccurately' testifying that he saw drugs in plain view inside a suspect’s car has been demoted for two years after pleading guilty to discreditable conduct, a decision from the police tribunal read.\n\n Oil and gas drilling projected to reach 10-year high, but Trump tariffs pose threat\n\n Canada's oil and gas well drilling sector is poised to employ more people next year than it has in a decade, but the job growth could be derailed if president-elect Donald Trump makes good on his tariffs threat.\n\n Calgary fighters thankful to enter ring under safe conditions after Ultra Boxing event cancelled\n\n A group of Calgary fighters are thankful to be able to enter the ring under a properly sanctioned event this weekend after the organization they were training under was suspended by Boxing Alberta for two years due to safety concerns.\n\n Blue Jackets extend points streak to 5 games with a chippy 5-2 win over the Flames\n\n Adam Fantilli scored twice and the Columbus Blue Jackets extended their points streak to five games with a 5-2 win over the Calgary Flames in a chippy game that included six fighting majors.\n\n 'We will always be a downtown store': Steve's Music Store moving from Rideau Street after 42 years\n\n A staple of the Rideau Street corridor, Steve's Music Store, is packing up and moving out after 42 years in business. The store will not be closing, its manager says, but rather moving to a new location that is yet unannounced.\n\n BREAKING | \n\n Prime Minister Trudeau to meet Donald Trump at Mar-a-Lago\n\n Prime Minister Justin Trudeau has landed in West Palm Beach, Fla., on Friday evening to meet with U.S.-president elect Donald Trump, sources confirm to CTV News.\n\n Efforts to free cargo ship stuck in St. Lawrence River near Morrisburg, Ont. continue\n\n Crews are working tirelessly to free the Tim S. Dool, a large cargo ship that ran aground on a shoal along the St. Lawrence River near Morrisburg, Ont. on Saturday.\n\n Hit man offered $100,000 to kill Montreal crime reporter covering his trial\n\n Political leaders and press freedom groups on Friday were left shell-shocked after Montreal news outlet La Presse revealed that a hit man had offered $100,000 to have one of its crime reporters assassinated.\n\n Judge hears from ex-employees of Montreal billionaire Robert Miller in sex abuse lawsuit\n\n A Quebec Superior Court justice will deliberate before deciding whether to authorize a class-action lawsuit against Quebec electronics billionaire Robert Miller, accused of paying minors for sex.\n\n Santé Quebec launch brings uncertainty to province's health-care system\n\n Sante Quebec is launching on Sunday amid concerns over budget cuts and the impact on services.\n\n Massage therapist charged in connection with sexual assault at Mill Woods clinic\n\n An Edmonton massage therapist has been charged with sexual assault in connection with an incident earlier this year.\n\n Armed convenience store robber sought by Edmonton police\n\n Police are searching for the man who robbed a convenience store in southwest Edmonton last weekend.\n\n Alberta company to pay $12K for contravening Water Act\n\n An Alberta company pleaded guilty to contravening the Water Act earlier this week and was ordered to pay $12,000, inclusive of a victim fine surcharge.\n\n Man charged after Halifax high school placed in hold and secure\n\n A man has been charged after a high school in Halifax was placed in hold and secure Friday morning.\n\n Teen arrested in connection with weapons call at Fredericton High School\n\n Fredericton Police Force arrested a 14-year-old boy Thursday in relation to a weapons call at Fredericton High School.\n\n P.E.I. steps in to help buy mobile park to allow residents to stay in homes\n\n Residents of Evergreen Village mobile home park in Summerside, P.E.I., who have had an eviction notice looming over their heads may be able to stay in their homes after all.\n\n True North officially buys Portage Place Mall\n\n True North Real Estate Development (TNRED) has officially purchased Portage Place Mall.\n\n Manitoba Metis Federation to be first Metis group with modern treaty with Canada\n\n The Manitoba Metis Federation will be the first Metis group to sign a modern treaty with the federal government.\n\n 'All these women matter': human rights complaint filed against city over refusal to search landfills\n\n Family members of three slain Indigenous women have filed a human rights complaint over the city’s refusal to search Brady Road and Prairie Green Landfills, saying not enough was done to bring home their remains.\n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n Sask. NDP says Scott Moe, staff stayed in Toronto hotel at rate over $800 per night\n\n The Saskatchewan NDP says Premier Scott Moe and three Saskatchewan Party staff members stayed at a hotel in Toronto last June that cost each of them $818.74 per night for a three-night stay.\n\n Jury sequestered to find verdict in sexual assault trial against Regina chiropractor\n\n Justice Janet McMurtry sequestered a 12-person jury to determine a verdict against Regina-based chiropractor Ruben Manz.\n\n Kitchener \n\n Family of Guelph, Ont. man killed in B.C. crash pushing for case review\n\n The family of a Guelph, Ont. man who was killed in a car crash in British Columbia is pushing for a review of the case, after learning about the charge that a driver involved is now facing.\n\n Erick Buhr to represent himself during sentencing for second-degree murder in death of his grandmother, Viola Erb\n\n Erick Buhr will represent himself as he prepares for sentencing after being convicted of second-degree murder in the death of his grandmother, Viola Erb.\n\n Region of Waterloo considers reducing, and even cutting, some services to keep tax increase down\n\n The Region of Waterloo is considering reducing or eliminating some services in an effort to lower the potential 2025 tax increase.\n\n Saskatoon \n\n Saskatoon temporary smudge location to be taken down\n\n While the City of Saskatoon says it granted a temporary permit for smudging and a ceremonial open fire, that expired at 6p.m. Tuesday night.\n\n 'A huge value addition': Sask. scientists develop way to make canola meal more profitable\n\n Researchers at the University of Saskatchewan are looking at making the canola crop more profitable.\n\n Missing 60-year-old Sask. man found dead\n\n The Saskatchewan RCMP says 60-year-old Clayton Cameron, reported missing earlier this week, has been found dead.\n\n Northern Ontario \n\n Man fined $10K for abandoning homemade barge in Lake Nipissing\n\n A man from Lavigne, Ont., has been fined $10,000 for abandoning a homemade barge in Lake Nipissing.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Heavy police presence on road in Iroquois Falls\n\n Members of the public are being asked to avoid the area of Nellie Lake Road West in Iroquois Falls.\n\n Crown witness describes chaotic night after bush party shooting\n\n Crown witness Reece Davidson, 21, told the jury that he was at the bush bash off of Pack Road in southwest London with a bunch of his young friends on July 30, 2021.\n\n 'The only thing you could see were his eyes': Employees pepper sprayed at south London business\n\n Around 4 p.m. on Thursday, police were called to a report of an assault in progress at a business int he 600 block of Wilkins St. near Wellington Road.\n\n $20 million investment from WSIB to help Fanshawe College prepare up and coming first responders for mental stress\n\n Fanshawe College and the Workplace Safety Insurance Board (WSIB) have announced a $20 million investment from WSIB to establish the WSIB Centre of Excellence in Immersive Technologies and Simulation for Workplace Safety. It is the largest single research grant in Fanshawe’s history.\n\n Former Ont. teacher charged with sexually assaulting a teen nearly 50 years ago\n\n A senior from Clearview Township faces charges in connection with an investigation into a sexual assault involving a teen nearly 50 years ago.\n\n Jury delivers verdict in Midland landlord's second-degree murder case\n\n The Midland man facing second-degree murder for the death of his tenant in 2021 was found not guilty on Friday.\n\n 50 cm of snow across central Ontario expected this weekend\n\n Environment Canada has released snow squall warnings and watches for our region.\n\n Breaking | \n\n Guilty on all counts: Windsor man convicted of careless driving in Retrofest double fatal collision\n\n The Windsor man charged in connection to the double fatal Retrofest collision has been convicted on all counts.\n\n 'All the indicators are fantastic': Devonshire Mall braces for record breaking crowds this Black Friday weekend\n\n Thousands of shoppers are expected to head to Devonshire Mall in full force this weekend in search of holiday savings and the best Black Friday deals.\n\n Model railroad program inspiring next generation\n\n Model railroading is a popular hobby. It can be as simple as a train on a small oval track or a complex rail system with detailed scenery.\n\n Vancouver Island \n\n Supreme Court clears way for B.C. to include other governments in opioid lawsuit\n\n B.C. Attorney General Niki Sharma says a Supreme Court of Canada victory has cleared a \"pathway\" for governments across the country to go after opioid makers and distributors for damages arising from the opioid crisis.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n How changing catch-and-release fishing practices can boost salmon survival\n\n A study has found catch-and-release sportfishing practices that leave salmon with injuries, particularly to their eyes, cause higher mortality than earlier research suggested.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Kelowna, B.C., to host the Memorial Cup in the spring of 2026\n\n The Western Hockey League's Kelowna Rockets will host the Memorial Cup in the spring of 2026, the Canadian Hockey League said Wednesday.\n\n 545 vehicles impounded in 332 days: BC Highway Patrol pleads for drivers to slow down\n\n Mounties with the BC Highway Patrol in Kelowna say they've impounded more than 545 vehicles for excessive speed and aggressive driving so far this year. That works out to more than 1.6 per day.\n\n Lethbridge \n\n City of Lethbridge launches 'Goosinator' tool to manage waterfowl at lakes\n\n While it may look colourful and cartoonish to humans, a new tool is designed to represent a predator for geese and other species at Henderson Lake to improve water quality.\n\n Western Slam basketball tournament tips off in Lethbridge\n\n The inaugural Western Slam tournament got underway Thursday evening at the VisitLethbridge.com Arena.\n\n Unattended candle led to fire inside Lethbridge home: officials\n\n An investigation is underway after a fire at a Lethbridge home on Friday.\n\n Sault Ste. Marie \n\n Two arrested following shooting on Manitoulin Island\n\n The Manitoulin detachment of the Ontario Provincial Police have two people in custody following a shooting incident in Wikwemikong Unceded Territory on Thursday.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Northern MPP calls for Sept 30 to be stat holiday in Ontario\n\n Kiiwetinoong MPP Sol Mamakwa wants to make Sept. 30 a statutory holiday in Ontario.\n\n Newfoundland's LGBTQ2S+ bar paid drag queens $37.50. Tara Nova called them out.\n\n If the screaming crowd in the twinkling Majestic Theatre in downtown St. John's was any indication, Newfoundland drag queen Tara Nova will never have to accept $37.50 for a show again.\n\n 'Who profits on hunger?': Inuit send pleading emails to minister about food costs\n\n People in Nunavut and northern Labrador have been writing to Canadian government officials this year to say grocers were charging exorbitant prices despite receiving a federal subsidy.\n\n As N.L. firm pivots, scientists say Canada's green hydrogen dreams are far-fetched\n\n A Newfoundland energy company's embrace of data centres is raising doubts about eastern Canadian hopes of harnessing the region's howling winds to supply Germany with power from green hydrogen.\n\n Stay Connected","url":"https://www.ctvnews.ca/business/questrade-lays-off-undisclosed-number-of-employees-1.7128755","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/11/29/questrade-1-7128771-1732923442713.jpg","video":null,"publish_date":"2024-11-30 00:52:34","author":"Ian Bickis","authors":["Ian Bickis"],"language":"en","source_country":"ca","sentiment":0.552},{"id":269061820,"title":"Oil And Gas Drilling Projected To Reach 10 Year High But Trump Tariffs Pose Threat 1","text":"Canada's oil and gas well drilling sector is poised to employ more people next year than it has in a decade, but the job growth could be derailed if president-elect Donald Trump makes good on his tariffs threat.\n\n\r\n The Canadian Association of Energy Contractors (CAOEC) — which represents drilling and service rig companies across Western Canada, as well as offshore drilling rigs in Atlantic Canada — on Friday said Trump's recent threat of 25-per-cent tariffs across the board on goods coming into the U.S. from Canada and Mexico should be taken \"very seriously.\"\n\n\r\n CAOEC president and CEO Mark Scholz said while his organization hasn't formally crunched the numbers, punitive tariffs would be a blow to the sector.\n\n\r\n \"I think what we do know is that there would be some impact on jobs,\" Scholz told reporters at an event in Calgary.\n\n\r\n \"So let's set politics aside, let's get to work because we have a serious issue at hand.\"\n\n\r\n Energy sector growth\n\n\r\n Trump's threatened tariffs come at a time when Canada's energy sector is experiencing growth. \n\n\r\n CAOEC expects a total of 6,604 wells to be drilled in Western Canada in 2025. That represents a 7.3 per cent increase from 2024 and would be the most activity in the Western Canadian oilpatch since the commodity price crash of 2014/15, which led to years of industry contraction.\n\n\r\n The organization also expects the number of jobs in the sector to grow by seven per cent year over year in 2025, to 41,800.\n\n\r\n \"These represent mortgage-paying, blue-collar jobs for Canadians that will help build strong communities,\" Scholz said.\n\n\r\n Driving the anticipated uptick in drilling activity is the Trans Mountain pipeline expansion, which opened earlier this year and has given Canadian oil companies increased export capacity.\n\n\r\n Natural gas drilling is also expected to rise due to the pending startup of LNG Canada, the country's first major liquefied natural gas export facility.\n\n\r\n Top export to U.S.\n\n\r\n Energy products represent Canada's top export to the United States. According to Statistics Canada, 81 per cent of Canada's total crude oil production in 2023 was exported, and nearly all of that volume (97 per cent) went to the U.S.\n\n\r\n In the days and weeks following Trump's election victory, most experts believed oil and gas would be exempt from any tariffs the new U.S. administration might propose — largely because the two countries' energy markets are so integrated that imposing tariffs on Canadian oil would drive up energy prices for U.S. consumers.\n\n\r\n But Trump's threat this week of across-the-board tariffs on all goods has made Canada's energy sector jittery.\n\n\r\n \"What's important to communicate is there'll be an impact on the price of energy for Americans,\" Scholz said.\n\n\r\n \"This is an area where I think Canada needs to share that information, to reach out to our colleagues and our friends and neighbours in the United States so that they understand how mutually beneficial trade is — particularly when it comes to energy.\"\n\n\r\n The CAOEC also called Friday for the federal government to abandon specific policies the oil and gas sector believes will put Canada's energy sector at a disadvantage to its U.S. competition under a Trump administration.\n\n\r\n These policies include the proposed federal cap on greenhouse gas emissions from the oil and gas sector, as well as the federal impact assessment act and recent anti-greenwashing legislation.\n\n\r\n Relations between Canada's energy sector and the federal government have been rocky in recent years, with the industry accusing the government of imposing a de facto production cap by setting what companies say are unrealistic and unachievable climate targets.\n\n\r\n But Scholz said when it comes to Trump's tariffs threat, the industry and all levels of government must present a united front.\n\n\r\n \"The Prime Minister has called for a Team Canada approach on this, and we are all in,\" he said.\n\n\r\n \"So we're going to support the Prime Minister, we're going to support the premiers ... it's important that we get this right.\"\n\n\r\n This report by The Canadian Press was first published Nov. 29, 2024.","url":"https://calgary.ctvnews.ca/oil-and-gas-drilling-projected-to-reach-10-year-high-but-trump-tariffs-pose-threat-1.7128824","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/11/29/oil-derrick-backlit-by-northern-lights-1-7128825-1732924460558.jpeg","video":null,"publish_date":"2024-11-30 00:52:34","author":"Amanda Stephenson","authors":["Amanda Stephenson"],"language":"en","source_country":"ca","sentiment":-0.063},{"id":269061438,"title":"Watch Rand And Ron Paul Release A Hilarous Parody Video On Talking Politics During The Holidays N2182621","text":"Let's have a little fun since it's a holiday weekend. \n\nI need to throw one thing here to set it up first. In case you missed it, Senator Rand Paul (R-KY) mixed it up earlier in the week on CBS News' \"Face The Nation,\" ably slapping down legacy media and Democrat (but I repeat myself) criticisms that Trump cabinet nominee Pete Hegseth lacks the requisite experience to run the Defense Department.\n\nRead more: Rand Paul Reminds Critics of Hegseth's Planning to Ditch Military DEI Why It Matters\n\nAs readers might have noticed, some politicians have already been letting their hair down over the official start of the holiday season, with President-elect Donald Trump releasing a funny video parodying \"Christmas Vacation.\"\n\nRead more: Trump Drives Dems Insane With Funniest ‘Christmas Vacation’ Parody You’ve Ever Seen\n\nSen. Paul's wife, Kelley shared a photo of the whole family gathered to celebrate Thanksgiving this year:\n\nThen on Friday, Rand Paul released a hilarious video/skit meant to parody the yearly \"controversy\" over talking politics with your family members during the holidays. He described it as showing what \"another typical Paul family Thanksgiving\" is really like.\n\nMy guess is that these OG budget hawks were inspired by DOGE, which Elon Musk and Vivek Ramaswamy hope to head up in the new administration.\n\nMaybe too, the skit was partly inspired by Sen. Paul and his dad having a conversation under the Liberty Tree, which \"sits on Ron and Carol Paul's property in Texas\":\n\nEither way, kicking back and enjoying the company of our loved ones is what this time of year is all about for Americans--whatever your surname--especially when what you come up with is funnier than most of what passes for comedy these days on the late night shows and \"Saturday Night Live.\"\n\nOne note to add: We're running an incredible Black Friday sale on VIP membership. Joining VIP gives you access to a great variety of additional stories and podcasts here at RedState; VIP Gold gives you that access across all Townhall Media sites; and VIP Platinum gives you all that plus access to a catalog of feature-length films and a credit to the new Townhall store. And if you sign up now, you'll get an incredible 74 percent discount just by using the promo code POTUS47.","url":"https://redstate.com/beccalower/2024/11/29/watch-rand-and-ron-paul-release-a-hilarous-parody-video-on-talking-politics-during-the-holidays-n2182621","image":"https://media.townhall.com/cdn/hodl/2022/11/3e1873eb-275d-4c47-bf3f-0fcf2f7d3d3a.jpg","video":null,"publish_date":"2024-11-30 00:49:34","author":"Becca Lower","authors":["Becca Lower"],"language":"en","category":"politics","source_country":"us","sentiment":0.191},{"id":269061316,"title":"Middle East","text":"Syria’s regime is on the verge of losing its northern city of Aleppo to Syrian opposition groups led by Hayat Tahrir al-Sham (HTS). The regime could lose this key city because of its weakness and because Iran’s backing has also weakened due to the blows that Iran and its axis of proxies have suffered at the hands of Israel.This is an important crossroads in the region, as HTS could deal the Bashar al-Assad regime its largest blow in years. Up until several days ago, the regime believed its backers in Moscow and Tehran could keep it safe. It watched as Israel eliminated thousands of Hezbollah fighters, but it assumed this wouldn’t spillover to Damascus.It's worth looking back several years to understand how important this moment is. The Iranian IRGC Quds Force leader Qasem Soleimani was key to bringing Russia into Syria to support the Syrian regime’s war against its own people during the Syrian civil war back in 2015. That war began in 2011 and increased in 2012. The regime was on the ropes. Russia had been focused on Ukraine in 2014 when Russia invaded Crimea and some areas in eastern Ukraine, during the first Russian invasion of Ukraine. This was a more limited version of what Russia has done since 2022.What happened in 2015-2016 in Syria“Soleimani personally commanded the battle for Aleppo in December 2015, and in the summer before, travelled to Moscow in order to recruit Russia to intervene militarily in the war against the rebels,” former IDF Brigadier-General Udi Dekel wrote at the Institute for National Security Studies in 2020. Indeed, Soleimani was key to helping the regime reconquer Aleppo from the rebels in 2016. Russia and Iran were there as well, with Hezbollah also moving forces to Syria in 2012, mostly via Quasayr in northern Lebanon. Rebels led by the Islamist group Hayat Tahrir al-Sham drive along a street in al-Rashideen, Aleppo province, Syria November 29, 2024. (credit: REUTERS/Mahmoud Hasano)After 2016, the Syrian regime went on to take over more areas from the rebels. The rebels ended up divided, some of them became proxies of Turkey and others moved to Idlib to live under HTS.HTS has a long backstory, years ago it was linked to Al Qaeda before rebranding itself several times. In 2020, the group made moves to try to ingratiate itself with the West and even tried outreach to the US. Nevertheless, it remains a more extreme faction of the Syrian rebels. It is also the only real independent faction these days with serious forces on the ground, and showed this week what it was capable of, brushing aside Syrian regime forces and conquering dozens of villages, marching into Aleppo. For many observers, this is a reminder of how the weakened Iraqi army fled Mosul in 2014. Now the Syrian regime is fleeing. Back in 2015-2016, the Syrian regime had thousands of Hezbollah members to help and it had Iran’s backing and Russian warplanes. Now the regime seems powerless - in part because Moscow is focused on Ukraine, and because Israel has smashed Hezbollah and so they cannot send forces via Qusayr to help.Israel has not only bombed border crossings between Syria and Lebanon to prevent Hezbollah rearming, but thousands of Hezbollah fighters are dead. Hezbollah’s command and control is also eviscerated. This leaves Syria’s regime alone, in a way.Syria is still divided. Turkey occupies part of northern Syria, and has used the former Syrian rebel groups to fight Kurds, primarily the US-backed Syrian Democratic Forces (SDF) who control eastern Syria. Meanwhile HTS controls Idlib in northern Syria. The Syrian regime controls the major cities in western Syria; Hama, Homs, Damascus. Aleppo is now vulnerable. Stay updated with the latest news! Subscribe to The Jerusalem Post Newsletter Subscribe Now This shows the unintended consequences of Iran’s policy. This and Iran-backed Hamas led to the October 7 attack. Iran then asked Hezbollah to attack Israel that day and Hezbollah began its attacks the day after. Israel had to focus on Hamas during most of the last year. Only in September, Israel shifted focus to fight Hezbollah, which has now lost many fighters and a portion of its arsenal.Last Wednesday, a ceasefire began, which lets Hezbollah have some breathing space. But it is in no way capable of helping Damascus. Hezbollah’s new leader Naim Qassem is also not Hassan Nasrallah, who was a friend of Soleimani. Now they are both dead.Other Iranian-backed figures are also dead. Abu Mahdi al-Muhandis was killed alongside Soleimani in a US airstrike in Baghdad in 2020. The major Iranian axis players are now removed from the border. This has weakened the Syrian regime. History had other plans for the Syrian regimeThe Syrian regime thought history was going its way up until a week ago. It had normalized ties with Egypt and several key Gulf states. Iran’s diplomats were making major inroads in the region, including in Egypt and the Gulf. Iran had joined BRICS and was working closely with Russia and was sending them drones. Iran had also prodded militias in Iraq and Yemen to attack Israel, believing it was isolated.Now, Iran may be on the ropes. Syria’s regime is the jewel in Iran’s crown. Its weakness makes Iran vulnerable. Iran uses Syria to move weapons to Hezbollah, and Israel has vowed not to let Hezbollah rearm.Iraqi militias, backed by Iran, are also key to Iran’s strategy. They may move to Syria now to help the regime in the Aleppo battle. These militias include Kataib Hezbollah, Asaib Ahl al-Haq, Harakat Hezbollah al-Nujaba and others. They have influence in the middle Euphrates river valley, which is called the MERV. US forces and the SDF are on the eastern side of the MERV, the latter being the main group that controls eastern Syria and is backed by the US in the fight against ISIS.The crisis in Aleppo could force the Syrian regime to strip defenses elsewhere in the country. This could help ISIS, or could lead Iraqi militias to move into areas of Syria, which could end up threatening the Golan Heights.They could also end up threatening US forces in Syria, as they have in the past. This is important and comes as US President-elect Donald Trump is preparing to take office, who had sought to withdraw US forces from Syria in 2018 and 2019.This means many fronts are in play in the region. What began on October 7 with the Hamas attack and Iran mobilizing militias for a seven front war on Israel, could backfire on them. However, they have still been trying to harm Israel. There were shooting attacks in the West Bank on Friday. Iran has sought to move weapons to the West Bank to help its proxies there. Israel thwarted one Iranian-backed smuggling attempt over the past week.This means Iran is still trying to set things aflame. However, they must now watch what is happening in Aleppo.","url":"https://www.jpost.com/middle-east/article-831353","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/636737","video":null,"publish_date":"2024-11-30 00:49:29","author":"Seth J. Frantzman","authors":["Seth J. Frantzman"],"language":"en","category":"politics","source_country":"il","sentiment":0.066},{"id":269060578,"title":"Canadian PM Justin Trudeau meeting with Trump at Mar-a-Lago after tariff threat","text":"Canadian Prime Minister Justin Trudeau jetted off to Florida on Friday to meet with Donald Trump, days after the president-elect threatened to impose new tariffs on Canada. \n\nA Royal Canadian Air Force plane used by Trudeau arrived at Palm Beach International Airport at about 5:30 p.m. Friday. \n\nTrudeau, 52, will reportedly be having dinner with Trump, 78, at his Mar-a-Lago estate, according to CBC News and the Associated Press.\n\nCanada’s Public Safety Minister Dominic LeBlanc is also traveling with Trudeau, the outlets reported. \n\nThe Canadian prime minister’s press office and the Trump-Vance transition team did not immediately respond to The Post’s requests for comment. \n\nOn Monday, Trump vowed to impose a 25% tariff on imports from Canada unless the country cracked down on illegal immigration and drug smuggling.\n\n“On January 20th, as one of my many first Executive Orders, I will sign all necessary documents to charge Mexico and Canada a 25% Tariff on ALL products coming into the United States, and its ridiculous Open Borders,” Trump declared.\n\nThe president-elect noted that the tariff will “remain in effect until such time as Drugs, in particular Fentanyl, and all Illegal Aliens stop this Invasion of our Country!”\n\nTrudeau spoke with Trump by phone shortly after the threat in what he described as a “good call.” \n\n“We obviously talked about … how the intense and effective connections between our two countries flow back and forth. We talked about some of the challenges we can work on together,” Trudeau told reporters.\n\nTrudeau met with the premiers of Canada’s 10 provinces on Wednesday to discuss US relations and strategy in the aftermath of Trump’s tariff threat.\n\nTrump’s warning was widely understood by his allies to be a bargaining tactic. \n\nThe 45th president promised to levy additional tariffs on Mexico and China as well — over border security and drug trafficking concerns — and on Wednesday, Trump revealed that Mexican President Claudia Sheinbaum phoned him to say that she has “agreed to stop Migration through Mexico, and into the United States.”","summary":"Trudeau, 52, will reportedly be having dinner with Trump, 78, at his Mar-a-Lago estate.","url":"https://nypost.com/2024/11/29/us-news/canadian-pm-justin-trudeau-meets-with-trump-after-tariff-threat/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/94501683.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/V8HPO1lj-RyIcpnTz.mp4","publish_date":"2024-11-30 00:45:10","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.349},{"id":269060064,"title":"Diversity Equity Inclusion Dei Walmart Social Justice Gay Rights Donald Trump Ford Toyota Harley Davidson Wokeism 11732852384128","text":"When Walmart, the world’s biggest retailer, and one of the biggest employers in the US with more than 1.6 million employees, says that it is rolling back a majority of its diversity, equity and inclusion initiatives (DEI), it can mean only one thing – that the idea of using “positive discrimination” as a tool of social justice is dead.","url":"https://www.livemint.com/opinion/online-views/diversity-equity-inclusion-dei-walmart-social-justice-gay-rights-donald-trump-ford-toyota-harley-davidson-wokeism-11732852384128.html","image":"https://www.livemint.com/lm-img/img/2024/11/29/1600x900/g1a9937a478bc0e6a2f0697675705d338340a70db5a39eabb416dd2b21e4a38aeb078236c5d4bc5047e950d6274a94c78086fc037db690c4af4f0630a7db44308_1280_1732857514837_1732857529722.jpg","video":null,"publish_date":"2024-11-30 00:44:30","author":"Mint","authors":["Mint"],"language":"en","source_country":"in","sentiment":-0.402},{"id":269060066,"title":"Rush To Value Up May Be Asia Stocks Best Defense Against Trump 11732926389994","text":"A Japan-inspired strategy of seeking to boost shareholder returns, corporate governance and market valuations is spreading like a wildfire across Asia. From Seoul to New Delhi, governments and regulators are hurrying to implement their own versions of Japan’s decade-long program of structural reforms that helped drive its benchmark index to a record high this year. While these initiatives vary, they are often collectively referred by the term coined by South Korea: “Value Up.” The timing looks to be fortuitous for investors: Donald Trump’s election victory this month and his adversarial trade policies threaten to undermine Asia’s economic growth and corporate earnings. There are already some signs “value up” can counter this threat. “When I present to my clients, I tell them that there are five great themes in Asia” and one of them is corporate reforms to enhance shareholder returns, said Sat Duhra, a fund manager at Janus Henderson Investors in Singapore, who manages $1 billion. “This is one factor that can help Asian markets.” The swelling tide of “value up” can be traced back to Japan’s effort to improve corporate governance that began more than a decade ago. Despite a lack of success early on, investors began to take notice from 2022 when Tokyo Stock Exchange started to pressure companies to boost shareholders returns via a range of measures. Two years later, Japanese firms are returning more cash to investors. They have also boosted the number of women on boards, become more open to working with activist investors, and unwound some of their cross-shareholdings. The Nikkei 225 Stock Average climbed to a record in March, finally shaking off three decades of inertia. Korea unveiled its own “Corporate Value Up Program” in February this year, aiming to emulate Japan’s success and also counter what’s known as the “Korea discount” where its companies have lower valuations than their global peers. Chinese regulators released guidelines this month to enhance corporate valuations, while Indian authorities directed state-owned enterprises to boost dividends. Singapore, Malaysia and Thailand are all reported to be considering similar initiatives. The reforms are a “timely initiative from the regulators,” said Vikas Pershad, a fund manager at M&G Investments Singapore Ltd. “This is a good example of how more regulation can be helpful, and I am optimistic,” he said, adding that he had made this a talking point with his clients. The need for some sort of sea change in how Asian companies treat shareholder returns appears obvious in retrospect. The MSCI Asia gauge has climbed 30% since the end of November 2014, but that pales beside the 190% surge in the S&P 500 Index over the same period. One example of successful corporate reform in Asia that aligns with the “value up” approach can be found in Indian Prime Minister Narendra Modi’s efforts to revamp state-owned enterprises. Since being introduced in 2019, these reforms have led to increased dividend payouts and higher earnings. They have also boosted SOE’s share of India’s overall market capitalization to near the highest level in six years. Elsewhere in the region, the early results of “value up” look less impressive. Korea’s benchmark Kospi index has dropped more than 7% this year even as the authorities have introduced a number of new measures to enhance shareholder returns. The Korea Value-up Index — which tracks “best-practice” companies on criteria such as their capital efficiency — has fallen about 5% since it was introduced two months ago. “Some markets can make this work, but in others it just won’t be a driver to get inflows,” Janus Henderson’s Duhra said. In terms of some of the smaller countries, “it’s sort of clutching at straws. Just because markets have not been doing as well as some others, they say: ‘Let’s try and find a way of getting investors interested.’” Still, some fund managers see opportunities in the “value-up” trade. “It’s very important of investors to notice and to look for those opportunities because after we talk about macro, it’s about companies delivering on earnings and improving returns,” said Vicki Chi, a money manager for Asian equities at Robeco in Hong Kong. “We are very actively seeking and continuing to position for these opportunities in our portfolios.” In Singapore, where a government task force has been appointed to review ways to boost market valuations, SGMC Capital Pte is optimistic about the potential long-term rewards for “value up” programs. The Straits Times Index has gained more than 15% this year, outperforming the regional Asian benchmark and putting it near a record high. “These initiatives can help unlock hidden value,” said Mohit Mirpuri, a fund manager at SGMC Capital. “Encouraging companies to narrow the price-to-book gap signals a stronger commitment to market efficiency and investor trust.” With assistance from Winnie Hsu, Ram Anand, John Cheng and Joy Lee. This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/news/world/rush-to-value-up-may-be-asia-stocks-best-defense-against-trump-11732926389994.html","image":"https://images.livemint.com/img/2018/12/28/1600x900/News_-_world_1545994908237.jpg","video":null,"publish_date":"2024-11-30 00:44:30","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.223},{"id":269060070,"title":"Donald Trump to Meet With Canadian Prime Minister Trudeau: What We Know","text":"Canadian Prime Minister Justin Trudeau arrived in Palm Beach, Florida, to meet with President-elect Donald Trump, senior government sources told the Associated Press.Trudeau's plane landed this evening at Palm Beach International Airport, the same airport Trump uses for his visits to his Mar-a-Lago estate, where he has been holding recent transition team meetings.According to CBC News, Trudeau is scheduled to have dinner with Trump at Mar-a-Lago on Friday night and will reportedly stay overnight at the residence, departing early the next morning.Newsweek reached out to Trump's transition team for comment.Trudeau's visit comes as Trump has threatened to impose a 25 percent tariff on goods from Canada and Mexico unless the countries curb what he described as the flow of drugs and migrants across their borders. Trump made the remarks on Monday, warning that imposing such tariffs would be among his first executive orders.Trudeau expressed confidence in resolving the issue through dialogue with Trump. Speaking to reporters in Prince Edward Island earlier on Friday, he said, \"We're going to work together to address some of these concerns. But ultimately, it's through constructive conversations with President Trump that we'll stay on the right track for all Canadians.\"Trump's comments lumped Canada with Mexico in addressing border concerns despite illegal migration numbers at the northern border being far lower than those at the southern border. Canadian officials called the comparison unfair but said they are prepared to invest further in border security if needed.Trudeau and Mexican President Claudia Sheinbaum separately called Trump earlier this week following his announcement. They described the conversations as friendly and constructive. Sheinbaum said Thursday she remains optimistic that a tariff war with the United States can be avoided.Despite these calls, Trudeau chose to follow up in person to address the matter directly with Trump.Trump's threat recalls his first-term tariff measures, which prompted retaliatory actions from other countries. In 2018, Canada responded to U.S. tariffs on Canadian steel and aluminum with billions of dollars in duties on American goods.The Canadian government is already exploring similar measures should Trump proceed with sweeping tariffs on Canadian products, a senior official told the Associated Press this week.Canada is the leading export destination for 36 U.S. states, with nearly $2.7 billion in goods and services crossing the border daily. It is also the largest foreign supplier of steel, aluminum, and uranium to the United States.","summary":"Trudeau reportedly traveled to Mar-a-Lago to dine with President-elect Donald Trump on Friday.","url":"https://www.newsweek.com/donald-trump-justin-trudeau-meeting-florida-1993631","image":"https://d.newsweek.com/en/full/2533281/donald-trump-justin-trudeau.jpg","video":null,"publish_date":"2024-11-30 00:43:54","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.025},{"id":269062412,"title":"Letters: ‘Irreparable harm’ | Grade inflation | Blocking homes | Pivot from justice | Rule of law | Lacking authority","text":"‘Irreparable harm’ not\nlikely at Oakland airport\n\nRe: “Oakland airport name change is blocked” (Page A1, Nov. 14).\n\nFor all who may be unaware, that body of water inside the Golden Gate is called San Francisco Bay. That geographic name is not owned by the city and county of San Francisco, and it is free to be used at will. Any attempt to block the use of a geographic name is a fool’s errand. \n\nBoth the introduction and the consideration of these frivolous lawsuits have eliminated what tenuous confidence once existed in the judiciary.\n\nCastro Valley\n\nStudents don’t have\n‘right’ to grade inflation\n\nRe: “Grade inflation is spreading from high schools to college” (Page A6, Nov. 13).\n\nKarin Klein’s essay on grade inflation demonstrates that “grade grubbing” harms learning.\n\nAs a Mt. Diablo Unified School District teacher in the 1980s, I was overtly pressured to pass seniors who had done absolutely nothing in my class. A couple of years later, as a teaching assistant in the English Department at UC Berkeley, I was “strongly encouraged” to pass a student who couldn’t write an essay without grammatical errors in every sentence.\n\nGrade inflation was already well on its way due to pressure to move students on and up through the system. However, in today’s college environment, when students and their parents spend hundreds of thousands of dollars, going into debt for a college education, the student is the consumer with presumed “rights” to be satisfied with the product.\n\nKathryn Jordan\n\nDenying new homes\nis immoral, illegal\n\nRe: “California city sued over ‘unlawful ban on new housing’” (Nov. 5).\n\nBlocking housing construction, especially for our most vulnerable residents like the homeless, during a housing crisis and shortage should be seen as an utterly disgraceful act and ought to be litigated more.\n\nWhile I know that people tend to be stingy about what happens around their house, this stinginess has reached a point where the city of Woodside attempted to declare itself a mountain lion habitat to avoid building homeless shelters.\n\nI don’t think this problem will be fixed by just suing cities; this is the result of decades of politics of homeownership, exclusion and politicians burying their heads in the sand. We have to fix this problem alongside the litany of others that we have to face.\n\nYusuke Mori\n\nNation seems to have\npivoted from justice\n\nRe: “Justice Dept. ends pursuit of Trump” (Page A1, Nov. 26).\n\nOf all the injustices cascading from this election, this one made me sick.\n\nDonald Trump openly trampled the Constitution by trying to falsify the election results in 2020. Our justice system is so broken that he now will never be tried. He can claim total vindication. Case closed. I can’t stand it.\n\nI fear for the pivot point we have reached here in my country.\n\nBarbara Morita\n\nSchool is out on\nthe rule of law\n\nRe: “Justice Dept. ends pursuit of Trump” (Page A1, Nov. 26).\n\nTo all the students I taught American history: Remember how I emphasized the rule of law? To understand our democratic system of government it was basic to know that no one, not even the president of the United States, was above the law.\n\nGuess I was wrong. Sorry, guys.\n\nNancy Thornton\n\nBiden lacks authority\nto OK use of missiles\n\nRe: “Ukraine gets OK for use of missiles” (Page A1, Nov. 18).\n\nOne wonders where, at this time, Joe Biden gets the moral authority to let Ukraine attack Russia with U.S.-supplied long-range missiles. Let us hope that Vladimir Putin doesn’t respond with his arsenal of super long-range hypersonic missiles targeting the United States.\n\nBiden should stay low and be kept out of any key policy decisions. He was rejected in a coup by his own party. He has proven his incompetence in leadership many times. His limited cognitive understanding of his actions and his advisers are leading us closer to World War III. The sooner he and his corrupt administration are out, the better it will be for all of us.\n\nChris Kniel","summary":"East Bay Times Letters to the Editor for Dec. 1, 2024","url":"https://www.mercurynews.com/2024/11/29/letters-1950/","image":"https://www.mercurynews.com/wp-content/uploads/2024/11/EBT-L-OAKAIR-1114-3.jpg?w=1024&h=680","video":null,"publish_date":"2024-11-30 00:30:14","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.447},{"id":269056326,"title":"Volodymyr Zelensky Prepared To End Ukraine War","text":"The valiant Ukrainian President says that his country must join the NATO defence alliance if it were to cede land in a peace agreement, The Sun reports. \n\n“If we want to stop the hot phase of the war, we need to take under the NATO umbrella the territory of Ukraine that we have under our control,” he told Sky News. \n\n“We need to do it fast. And then on the (occupied) territory of Ukraine, Ukraine can get them back in a diplomatic way.”\n\nMr Zelensky said it was key that NATO should “immediately” cover all of the land Kyiv controls, so Vladimir Putin does not use the peace to prepare for another invasion.\n\nHis Russian counterpart has previously ruled out his country agreeing to letting Ukraine join NATO.\n\nMr Putin wants Ukraine to be neutral and even said in June that Ukraine needed to drop its NATO bid for peace talks to begin.\n\nMr Zelensky said in the new interview that Ukraine would later try and return any Ukrainian land Russia continues to hold in a “diplomatic way”.\n\nIt was not clear what exactly that meant or how Ukraine would get Russia to return the land.\n\nMr Putin is expected to demand all the land he currently holds, including the regions of Crimea, Luhansk, Donetsk, Zaporizhzhia, Kherson, and parts of Kharkiv.\n\nMr Zelensky also said he wanted to work with President-elect Donald Trump directly as the Republican has pledged to achieve peace quickly into his term.\n\n“I want to work with him directly because there are different voices from people around him,” Mr Zelensky said. \n\n“And that’s why we need not to (allow) anybody around to destroy our communication.”\n\nMr Trump has not made clear how he plans to achieve peace, but analysts believe it will likely mean Ukraine cedes territory to Russia.\n\nThe bombshell from Mr Zelenksy marks the first time he has said Ukraine could cede land to Russia, with the Ukrainian previously adamant he would even recapture Crimea.\n\nBut, with the election of Mr Trump and Russia seizing two football fields-worth of land a minute in the east, Ukraine is under pressure.\n\nEarlier this year, Mr Zelensky presented a peace plan to the Ukrainian parliament and Western allies.\n\nHe released a five-step “victory plan” that included Ukraine joining NATO and increased military support from the alliance.\n\nMr Zelensky also discussed the plan with Mr Trump and spoke with the President-elect via phone after his landslide win.\n\nElon Musk – a surprise guest in the three-way discussion – also reportedly chimed in saying he would continue to supply Starlink satellites to Ukraine.\n\n“Nothing of what Zelensky and his aides heard from Trump and his team in private has been alarming or made us feel that Ukraine is going to be the one who pays the price,” a well-placed source said. \n\nMr Zelensky’s new comments also come just days after Mr Putin threatened to turn Kyiv to “dust” with his new Oreshnik hypersonic missiles.\n\nMr Putin vowed to launch more after America gave Kyiv permission to fire long range US ATACMS missiles and British Storm Shadow weapons at targets inside Russia.\n\nUkraine launched its first ATACMS missiles into Russia on November 11 and Storm Shadow rockets just two days later.\n\nFollowing Mr Trump’s election, reports emerged that he would freeze the conflict in place and establish a demilitarised zone down the locked front line, the Wall Street Journal reported.\n\nKyiv would not join NATO for 20 years, but the US would continue to arm Ukraine to the teeth to prevent Putin from invading again.\n\nWho would police the demilitarised zone remains unclear, according to the sources, but it wouldn’t involve American troops or an international body.\n\nRussia is making gains taking Ukrainian land in the east at a rate of two football fields a minute.\n\nBut, the meat grinder is costing Putin thousands of troops with the dictator sending 2000 to their deaths on one day alone.\n\nThat figure from earlier this week marks Russia’s deadliest day of the war so far, beating the previous record set only days before.\n\nMr Putin’s approach is miserably failing with over 738,000 Russian soldiers now dying under his orders.\n\nUK Defence Secretary John Healey has warned the 600-mile (965km) frontline is now at the most unstable it has been since February 2022.\n\nThis story appeared in The Sun and has been reproduced with permission\n\nOriginally published as Volodymyr Zelensky ‘prepared to end Ukraine War’","url":"https://www.heraldsun.com.au/business/work/leaders/volodymyr-zelensky-prepared-to-end-ukraine-war/news-story/a54340a16ae1f1bbcbc1bf79b1937640?expand_comments=true","image":"https://content.api.news/v3/images/bin/6036056f4844c97382a8ca0f6ac5d970","video":null,"publish_date":"2024-11-30 00:24:29","author":null,"language":"en","category":"politics","source_country":"au","sentiment":0.104},{"id":269056064,"title":"Sp 500 And Dow Post Gains And Close Out Best Month Of 2024","text":"The Dow rose 7.5% in November, easily its best month of 2024. The Walt Disney Co. has the biggest percentage gain for the month at 22.1%, but the price-weighted index also got a boost from Goldman Sachs, up 17.5% to $608.57 and Salesforce, up more than 13% to $329.99.\n\nThe S&P 500 gained 5.7% this month, driven by Tesla and other stocks that received a boost from Donald Trump's win in the presidential election. Discover Financial Services leads a list of financials stocks that had a good November, up nearly 23% for the month despite a small loss Friday. Investors believe the credit card company's merger with Capital One has a greater chance of going through under a Trump administration and overall the financial services industry faces less restrictive oversight.\n\nTesla shares rose 3.7% Friday and posted a monthly increase of more than 38%. The electric vehicle maker is expected to benefit from CEO Elon Musk's support of Trump.\n\nMusk also gave a boost to Hasbro shares after he triggered takeover speculation when he asked in a post on X how much the toy and game company was worth. Hasbro, which owns the role-playing game Dungeon & Dragons, rose 2%.\n\nBond yields fell, with the yield on the 10-year Treasury slipping to 4.19%.","url":"https://news.net/news/sp-500-and-dow-post-gains-and-close-out-best-month-of-2024/","image":"https://dymlcaxjpm5z9.cloudfront.net/wp-content/uploads/2024/02/29151917/Wall-Street-11-January-2024-scaled.jpg","video":null,"publish_date":"2024-11-30 00:23:30","author":null,"language":"en","source_country":"au","sentiment":-0.101},{"id":269056032,"title":"Inflation Rose To 2 3 In Europe That Wont Stop The Central Bank From Cutting Interest Rates","text":"High central bank benchmark rates combat inflation by influencing borrowing costs throughout the economy. Higher rates make buying things on credit - whether a car, a house or a new factory - more expensive and thus reduce demand for goods and take pressure off prices. However, higher rates can also dampen growth.\n\nGrowth worries got new emphasis after surveys of purchasing managers compiled by S&P Global showed the eurozone economy was contracting in October. On top of that come concerns about how U.S. trade policy under incoming President Donald Trump, including possible new tariffs, or import taxes on imported goods, might affect Europe's export-dependent economy. Trump takes office Jan. 20.\n\nThe eurozone's economic output is expected to grow 0.8% for all of this year and 1.3% next year, according to the European Commission's most recent forecast.\n\nAll that has meant the discussion about the Dec. 12 ECB meeting has focused not on whether the Frankfurt-based bank's rate council will cut rates, but by how much. Market discussion has included the possibility of a larger than usual half-point cut in the benchmark rate, currently 3.25%.\n\nInflation in Germany, the eurozone's largest economy, held steady at 2.4%. That \"will strengthen opposition against a 50 basis point cut,\" said Carsten Brzeski, global chief of macro at ING bank, using financial jargon for a half-percentage-point cut.","url":"https://news.net/news/inflation-rose-to-2-3-in-europe-that-wont-stop-the-central-bank-from-cutting-interest-rates/","image":"https://dymlcaxjpm5z9.cloudfront.net/wp-content/uploads/2024/08/31134242/Euro-Currency-31-August-2024.jpg","video":null,"publish_date":"2024-11-30 00:23:30","author":"David McHugh","authors":["David McHugh"],"language":"en","source_country":"au","sentiment":0.07},{"id":269055622,"title":"Crypto boss Justin Sun eats banana art he bought for US$6.2 million","text":"Crypto entrepreneur Justin Sun on Friday fulfilled a promise he made after spending $6.2 million on an artwork featuring a banana duct-taped to a wall — by eating the fruit.\n\nAt one of Hong Kong’s priciest hotels, Sun chomped down on a banana in front of dozens of journalists and influencers after giving a speech hailing the work as “iconic” and drew parallels between conceptual art and cryptocurrency.\n\n“It’s much better than other bananas,” Sun said after getting his first taste.\n\n“It’s really quite good.”\n\nTitled “Comedian”, the conceptual work created by Italian artist Maurizio Cattelan was sold at a Sotheby’s auction in New York last week, with Sun among seven bidders.\n\nSun said he felt “disbelief” in the first 10 seconds after he won the bid, before realising “this could become something big”.\n\nIn the 10 seconds after that, he decided he would eat the banana.\n\n“Eating it at a press conference can also become a part of the artwork’s history,” he said Friday.\n\nThe debut of the edible creation at the 2019 Art Basel show in Miami Beach sparked controversy and raised questions about whether it should be considered art — Cattelan’s stated aim.\n\nAnd Sun on Friday compared conceptual art like “Comedian” to NFT art and decentralised blockchain technology.\n\n“Most of its objects and ideas exist as (intellectual property) and on the internet, as opposed to something physical,” he said.\n\n‘Apolitical’ investment\n\nSun this week also became an advisor to World Liberty Financial, a crypto initiative backed by US president-elect Donald Trump, following a US$30 million investment.\n\nHe earlier wrote on social media platform X that he was “excited to help make crypto great again in the US” with Trump’s leadership.\n\nOn Friday Sun denied that the investment — which made him the largest investor in the project — was an attempt to influence Trump or American politics.\n\n“We are apolitical,” Sun told AFP in an interview.\n\n“Me (serving) as advisor also contribute a lot of value… I can be a great bridge for traditional financial and the (decentralised finance) industry.”\n\nThe 34-year-old crypto businessman was last year charged by the US Securities and Exchange Commission with fraud and securities law violation in relation to his crypto project Tron.\n\nSun has rejected the allegations and the case is ongoing.\n\nAt a function room at the Peninsula hotel in Hong Kong, two men dressed as auction house staff stood in front of a featureless wall with the yellow banana offering the only splash of colour.\n\nSun said he only recently decided to bid for the artwork, adding he had “dumb questions” such as whether the banana had decayed and how to value the work.\n\nThe artwork owner is given a certificate of authenticity that the work was created by Cattelan as well as instructions about how to replace the fruit when it goes bad.\n\nSun told AFP that his artwork may well benefit from the same kind of speculative craze usually associated with crypto.\n\n“I think (the price) probably is going to go up even more in the future, just like Bitcoin,” he said.\n\nSupport HKFP | Policies & Ethics | Error/typo? | Contact Us | Newsletter | Transparency & Annual Report | Apps\n\nHelp safeguard press freedom & keep HKFP free for all readers by supporting our team","summary":"Crypto entrepreneur Justin Sun on Friday fulfilled a promise he made after spending $6.2 million on an artwork featuring a banana duct-taped to a wall &#8212; by eating the fruit. At one of Hong Kong&#8217;s priciest hotels, Sun chomped down on a banana in front of dozens of journalists and influencers after giving a speech [&#8230;]","url":"https://hongkongfp.com/2024/11/30/crypto-boss-justin-sun-eats-banana-art-he-bought-for-us6-2-million/","image":"https://hongkongfp.com/wp-content/uploads/2024/11/justin-sun.jpg","video":null,"publish_date":"2024-11-30 00:16:23","author":"AFP","authors":["AFP"],"language":"en","source_country":"hk","sentiment":0.248},{"id":269058228,"title":"Canada's Trudeau Arrives In Florida To Meet Trump Amid Tariff Threats","text":"Canadian Prime Minister Justin Trudeau arrived in Palm Beach, Florida, on Friday for what Canadian and American media said was a meeting with US President-elect Donald Trump at his Mar-a-Lago luxury estate.Flight trackers first spotted a jet broadcasting the prime minister's callsign en route to the southern US state, in a visit that comes days after Trump threatened the United States' northern neighbor with import tariffs once he takes office.According to the website Flightradar, the Canadian leader's plane landed at Palm Beach International Airport late in the afternoon.Canadian public broadcaster CBC said Trudeau would be dining with Trump, and that his public safety minister, Dominic LeBlanc was accompanying him on the trip.The prime minister's office did not immediately confirm the unannounced trip.Trump sent shockwaves across Canada when he announced pending import tariffs against neighbors Canada and Mexico and also rival China in social media posts on Monday.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");More than three-quarters of Canadian exports, or Can$592.7 billion ($423 billion), went to the United States last year, and nearly two million Canadian jobs are dependent on trade.A government source told AFP that Canada is considering possible retaliatory tariffs against the United States.Some have suggested Trump's tariff threat may be bluster, or an opening salvo in future trade negotiations. But Trudeau rejected those views when he spoke with reporters earlier in Prince Edward Island province.\"Donald Trump, when he makes statements like that, he plans on carrying them out,\" Trudeau said. \"There's no question about it.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Canadian Prime Minister Justin Trudeau arrived in Palm Beach, Florida, on Friday for what Canadian and American media said was a meeting with US President-elect Donald Trump at his Mar-a-Lago luxury estate.","url":"https://www.ndtv.com/world-news/canada-pm-justin-trudeau-arrives-in-florida-to-meet-donald-trump-amid-tariff-threats-7137838","image":"https://c.ndtvimg.com/2024-11/giln20ik_justin-trudeau-pti_625x300_02_November_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-11-30 00:13:39","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.015},{"id":269053402,"title":"Trump Jamie Dimon N2648433","text":"Incoming President Donald Trump and JPMorgan Chase CEO Jamie Dimon have quietly been in talks for months through secret back channels, serving as the “sounding board” for the 47th president’s pending economic agenda. \n\nFour sources close to the incoming Trump Administration confirmed that the president-elect and Dimon discussed issues before and after the election, such as reducing government spending, tax policy, trade, and banking regulations. The GOP insiders told the New York Post that Trump’s aides regularly set up phone calls to “create a bit of daylight” between Trump and Dimon and prevent any information from reaching the press. The calls between Trump and the Wall Street mogul were “no-holds-barred conversations.” \n\nDimon was floated as a potential pick as Trump’s Treasury secretary at the time. However, despite calling Dimon a “highly overrated Globalist” in the past, Trump said he respected the banking CEO and dismissed rumors that he would serve in the Trump Administration. \n\nTrump wrote on Truth Social, \"I thank Jamie for his outstanding service to our Country!” In response, Dimon replied, “I haven't had a boss in 25 years, and I'm not about ready to start.\" \n\nInstead, Trump nominated Key Square founder Scott Bessent as his pick for Treasury secretary.\n\nWhile Dimon did not publicly endorse Trump for president, he said Wall Street bankers were “dancing in the street” after the Republican’s sweeping defeat over failed Democrat candidate Vice President Kamala Harris. He also applauded Trump’s new Department of Government Efficiency (DOGE), headed by billionaire Elon Musk and Ohio businessman Vivek Ramaswamy, saying that the U.S. was long overdue for a department that makes the “government more efficient.” \n\nDimon respected Trump’s threats of tariffs on the country’s trading partners, saying that they “will bring people to the table” if “done wisely.” The Post reported that out of revenge, the Biden Administration blacklisted Dimon from White House invites after appearing to support Trump’s agenda.","url":"https://townhall.com/tipsheet/saraharnold/2024/11/29/trump-jamie-dimon-n2648433","image":"https://media.townhall.com/cdn/hodl/2018/258/59e56f14-4cb5-41f0-b151-e6f2041c2e4a.jpg","video":null,"publish_date":"2024-11-30 00:12:31","author":"Sarah Arnold","authors":["Sarah Arnold"],"language":"en","category":"politics","source_country":"us","sentiment":-0.158},{"id":269058344,"title":"Canadian PM Justin Trudeau visits Trump at Mar-a-Lago amid steep tariff threats: report","text":"Canadian Prime Minister Justin Trudeau has flown to Florida to meet with President-elect Donald Trump at his Mar-a-Lago club after Trump threatened to impose sweeping tariffs on Canadian products. A person familiar with the matter said Trudeau will have dinner with Trump. The official was not authorized to speak publicly about the matter and spoke on condition of anonymity. Canadian Public Safety Minister Dominic LeBlanc accompanied Trudeau on the trip. Trudeau's visit comes days after Trump threatened to impose 25% tariffs on Canada and Mexico on the first day of his presidency over failures by both nations to curb the flow of illegal immigrants and illicit drugs from those countries into the United States. Fox News Digital has reached out to Trump's representatives. MEXICAN PRESIDENT MIGHT BE CHANGING VIEW ON US AS TRUMP WIN SENDS WARNING TO RULING SOCIALISTS \"Right now a Caravan coming from Mexico, composed of thousands of people, seems to be unstoppable in its quest to come through our currently Open Border,\" he wrote Monday on Truth Social. \"On January 20th, as one of my many first Executive Orders, I will sign all necessary documents to charge Mexico and Canada a 25% Tariff on ALL products coming into the United States, and its ridiculous Open Borders.\" On Wednesday, Trump spoke with Mexican President Claudia Sheinbaum Pardo. He said Sheinbaum agreed to \"stop Migration through Mexico, and into the United States,\" following a productive discussion over the phone. Sheinbaum has promised to raise tariffs on U.S. goods if Trump followed through with his threat. Trump has previously urged America's neighbors to the north and south to do more to prevent illegal migration into the U.S. and to combat the flow of illegal drugs, in particular fentanyl. Shortly after Trump's tariff promises, Canadian officials said the country places the \"highest priority\" on border security. CLICK HERE TO GET THE FOX NEWS APP \"Our relationship today is balanced and mutually beneficial, particularly for American workers,\" Canada’s Deputy Prime Minister, Chrystia Freeland, and Public Safety Minister Dominic LeBlanc said in a joint statement. \"Today, Canada buys more from the United States than China, Japan, France, and the U.K. combined. Canada is essential to US domestic energy supply, and last year 60 percent of U.S. crude oil imports originated in Canada.\" The Associated Press contributed to this report.","summary":"President-elect Trump and Canadian Prime Minister Justin Trudeau were meeting on Friday at Trump&apos;s Florida&apos;s estate amid threats of trade wars.","url":"https://www.foxnews.com/politics/canadian-pm-justin-trudeau-visits-trump-mar-a-lago-steep-tariff-threats-report","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/trumptrudeau.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-30 00:07:56","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","category":"politics","source_country":"us","sentiment":0.187},{"id":269058334,"title":"'Squad' member shares anti-Israel Thanksgiving message about indigenous killed by settlers for their land","text":"Rep. Rashida Tlaib, D-Mich., a member of the far-left group \"The Squad\" in Congress, used the American holiday of Thanksgiving to take another swipe at Israel. \"This Thanksgiving, we mourn the Indigenous people killed by European settlers and the United States in order to steal their land,\" the Instagram post, which was credited to pro-Palestinian organization, read. \"From here to Palestine, we stand in solidarity with all Indigenous people as they fight for freedom on their own land.\" RASHISA TLAIB RIPPLED FOR HOLDING ‘WAR CRIMINAL’ SIGN DURING NETANYAHU'S SPEECH: ‘ABSOLUTE DISGRACE’ Tlaib, a Muslim Palestinian American, has a long history of attacking the Jewish state. In November 2023, the House of Representatives voted to censure Tlaib as a formal public rebuke of her anti-Israel comments made in the wake of the Oct. 7 terrorist attacks. Last month she called Israeli Prime Minister Benjamin Netanyahu a \"genocidal maniac\" and claimed he is \"burning Palestinians alive, bombing hospitals, starving people, and killing aid workers.\" She has been heavily critical of the Biden-Harris administration's handling of the Israel-Hamas War in Gaza. In the lead up to the 2024 presidential election, Tlaib refused to endorse Vice President Kamala Harris. Instead, she urged Michiganders to get out and vote with no mention of Harris. Tlaib also posted on X Thursday, \"Today I’m thankful for #12thDistrictStrongresidents who sent me to Congress and inspire me to fight for justice. Let’s honor Indigenous communities: the Peoria, Anishinabewaki, Bodwéwadmi, Myaamia, Meškwahki·aša·hina, Wyandot, Peoria and Mississauga peoples whose land we’re on.\" ZOOM CALL REVEALS ‘SQUAD’ DEMOCRAT'S MESSAGE TO ANTI-JEWISH AGITATORS AT UNIVERSITY ENCAMPMENT Several other liberal figures called on conservatives and supporters of President-elect Donald Trump to give thanks to illegal immigrants on Thanksgiving, suggesting they acknowledge the migrants who harvested and packed their entrées enjoyed on Thursday. One meme also circulated on X, depicting a pilgrim accepting a roasted turkey from a Native American with the caption, \"Thanksgiving: Celebrating the day Americans fed undocumented immigrants from Europe.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Rep. Rashida Tlaib used Thanksgiving to declare &quot;solidarity with all Indigenous people as they fight for freedom on their own land,&quot; specifically including Palestinians.","url":"https://www.foxnews.com/media/squad-member-shares-anti-israel-thanksgiving-message-about-indigenous-killed-settlers-land","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/05/1200/675/Tlaib.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-30 00:07:04","author":"Kendall Tietz","authors":["Kendall Tietz"],"language":"en","source_country":"us","sentiment":-0.052},{"id":269052408,"title":"Trudeau Arrives In Mar A Lago In Time For Dinner","text":"Justin Trudeau travelling to Florida to meet with Donald Trump on Friday: source\n\nA source with knowledge of the communications says Trudeau and Trump are expected to have dinner Friday.\n\nOTTAWA—Prime Minister Justin Trudeau is en route to Florida to meet president-elect Donald Trump along with his Public Safety Minister Dominic LeBlanc, the Star has learned.\n\nA source with knowledge of the communications says Trudeau and Trump are expected to have dinner Friday — on a weekend in which many Americans celebrate Thanksgiving. -- More...","url":"https://www.canadafreepress.com/article/trudeau-arrives-in-mar-a-lago-in-time-for-dinner","image":"https://canadafreepress.com/images/uploads/cover112924.jpg","video":null,"publish_date":"2024-11-30 00:05:29","author":"Bio And Archives","authors":["Bio And Archives"],"language":"en","source_country":"ca","sentiment":0.36},{"id":269054372,"title":"California suspends company’s sale of raw milk after new outbreak of bird flu","text":"California state officials have suspended a company’s sales of raw milk to retailers amid ongoing concerns about bird flu.\n\nRaw milk sales by Raw Farm, located in Fresno, was blocked from distributing its raw dairy products as of Thursday, the Los Angeles Times reported. However, their products already on shelves can still be sold, according to the newspaper. \n\nThe Independent has contacted Raw Farm for comment.\n\nOn Sunday the state’s Department of Public Health warned residents against drinking the batch of cream top, whole raw milk from Fresno County’s Raw Farm LLC and advised consumers to return the product to where it was purchased. Raw Farm LLC has issued a voluntary recall of the affected lot code 20241109.\n\nA Raw Farm batch bottled on November 9 was also recalled, the Times reported.\n\nThe sales suspension comes amid contradictory bird flu test results this month. County public health officials were finding bird flu in raw milk bought at stores, while state officials weren’t finding the virus in bulk tests, the Times reports. A new round of tests on Raw Farm products turned up positive Wednesday, and officials suspended sales.\n\nRaw Farm owner Mark McAfee told the Times that his cows are indeed infected with the H5N1 bird flu virus. He said he wasn’t aware of it until this week, however, because the cows are “so healthy that they don’t show the classic signs or symptoms.”\n\nThe sales suspension comes as human cases of dangerous H5N1 bird flu have risen across the country.\n\nThe Centers for Disease Control and Prevention says there were 55 cases across seven states as of Friday. The majority of the cases are in California.\n\nThe agency reported the first avian influenza H5 virus infection in a child in the US last week. The child’s condition is still unclear.\n\nThe uptick in bird flu comes as Robert F. Kennedy Jr., President-elect Donald Trump’s pick to lead the Department of Health and Human Services, continues to tout the consumption of raw milk. Kennedy has pledged that what he characterized as the “aggressive suppression” of raw milk is about to end and revealed he drinks raw milk.\n\nScientists have warned in recent days that the virus may be more widespread than previously believed.\n\n“We are in a soup of virus. I mean, there’s virus everywhere around us at this point,” Dr. Marcela Uhart, a wildlife veterinarian with the University of Cal-Davis’ One Health Institute, said earlier this month. “This virus is circulating left and right in mammals and in birds, as far as we can tell, some of them are not showing any signs of disease.”\n\nThe virus is spread to humans via several pathways. Farm workers can inhale infected particles, pick up germs from sick animals and other surfaces and then touch their faces and eyes. Consumers can also get it by drinking raw cow’s milk.\n\nThose who have had no contact with infected poultry or other sources of contamination are likely at very low risk of infection. No infections have been reported from eating properly cooked poultry or poultry products or proper handling of poultry meat.\n\nWith reporting from Julia Musto","summary":"RFK Jr., a proponent of raw milk, could soon lead the Department of Health and Human Services","url":"https://www.independent.co.uk/news/world/americas/california-raw-milk-bird-flu-rfk-jr-b2656276.html","image":"https://static.independent.co.uk/2024/11/26/20/MED-Bird_Flu-Raw_Milk_05155.jpg?width=1200","video":null,"publish_date":"2024-11-30 00:04:42","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","source_country":"gb","sentiment":-0.25},{"id":269061342,"title":"'Biggest challenge': Even Republicans are nervous about Trump’s new $4.6 trillion tax cut","text":"Despite Republicans keeping the House of Representatives and flipping control of the Senate, some are acknowledging that extending President-elect Donald Trump's tax cuts in 2025 will be a tall order.\n\nIn a recent Politico article, several Republican members of Congress expressed worry that renewing the Tax Cuts and Jobs Act (TJCA) of 2017 could be difficult given its $4.6 trillion price tag. While the initial legislation came with an estimated cost of $1.5 trillion over 10 years, Politico reported that extending the approximately 40 provisions in the law would come in at a cost of $4 trillion over that same time period, with another $600 billion in interest. \n\nThe bulk of those tax cuts overwhelmingly benefit the rich. According to CNN, an analysis from July found that if the TJCA was extended next year, the richest 5% of taxpayers would reap almost half the benefits. Those making $450,000 and up would see their incomes increase by 3.2%, while the richest 1% — who make $1 million a year or more – would get an average tax cut of nearly $70,000. And the top 0.1% richest Americans would see a whopping $280,000 average reduction in their own taxes.\n\nREAD MORE: Trump's inflation nightmare: How his own policies could backfire and skyrocket prices\n\nRep. Greg Steube (R-Fla.), who sits on the House Ways and Means Committee (which oversees tax-related matters) was skeptical that the GOP would be able to easily pass the new tax cuts without a big fight even among members of his own party.\n\n\"That’s going to be the biggest challenge for the [House Republican] conference,\" he said.\n\nRep. Jodey Arrington (R-Texas), who chairs the House Budget Committee, is also wary of any new tax cuts that will add to the federal deficit. In order to make the new round of tax cuts deficit-neutral, Arrington is pondering pairing them with cuts to Medicaid (the health insurance program for the poorest Americans), repealing green energy tax breaks and increasing taxes on corporate profits booked overseas that get repatriated. But House Ways and Means chairman Jason Smith (R-Mo.) told Politico he was less concerned about paying for a new round of tax cuts.\n\n\"“Look at history — were the Bush tax cuts paid for?” He said.\n\nREAD MORE: 'America depends on it': Nobel-winning economist reveals key lesson Dems must learn from 2024\n\nClick here to read Politico's article in full.","summary":"Despite Republicans keeping the House of Representatives and flipping control of the Senate, some are acknowledging that extending President-elect Donald Trump's tax cuts in 2025 will be a tall order.\n\nIn a recent Politico article, several Republican members of Congress expressed worry that renewing the Tax Cuts and Jobs Act (TJCA) of 2017 could be difficult given its $4.6 trillion price tag. While the initial legislation came with an estimated cost of $1.5 trillion over 10 years, Politico reported that extending the approximately 40 provisions in the law would come in at a cost of $4 trillion over that same time period, with another $600 billion in interest. \n\nThe bulk of those tax cuts overwhelmingly benefit the rich. According to CNN, an analysis from July found that if the TJCA was extended next year, the richest 5% of taxpayers would reap almost half the benefits. Those making $450,000 and up would see their incomes increase by 3.2%, while the richest 1% — who make $1 million a year or more – would get a","url":"https://www.alternet.org/republicans-trump-tax-cut/","image":"https://www.alternet.org/media-library/image.jpg?id=55009068&width=1200&height=600&coordinates=0%2C94%2C0%2C94","video":null,"publish_date":"2024-11-30 00:02:27","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.139},{"id":269058966,"title":"Prime Minister Justin Trudeau and Donald Trump meeting in Florida, source says","text":"OTTAWA — Prime Minister Justin Trudeau is meeting with U.S. president-elect Donald Trump at his Mar-a-Lago estate, a source has confirmed to The Canadian Press.\n\nTrudeau's plane landed in West Palm Beach, Fla., Friday evening, not far from where Trump's transition team is based at his Mar-a-Lago estate. \n\nThe source, who is not authorized to speak publicly about the events, confirmed Public Safety Minister Dominic LeBlanc is also in attendance.\n\nThe first in-person meeting between the two leaders comes at the end of a rocky week in which Trump threatened to impose stiff tariffs on all imports from Canada.\n\nEarlier in the day, Trudeau said he believes the president-elect's tariff threats against Canada and Mexico should be taken seriously.\n\nTrump said on social media on Monday night he would slap a 25 per cent tariff on imports from the U.S.'s closest neighbours unless the two countries stop illegal border crossings and prevent illicit drugs such as fentanyl from entering the U.S.\n\n\"One of the things that is really important to understand is that Donald Trump, when he makes statements like that, he plans on carrying them out. There's no question about it,\" Trudeau said when speaking with reporters in Queens County, P.E.I., on Friday.\n\nBut the prime minister said Canada can get through what is expected to be a tumultuous four years by taking the same approach to working with Trump as it did during his first term as president.\n\nTrudeau said his government started assembling its outreach plan for the next U.S. administration at the start of the year, when they began a \"Team Canada\" effort by pulling together premiers, business and labour leaders to network with officials and politicians across the U.S. \n\nCanada's ambassador to the U.S., Kirsten Hillman, Industry Minister François-Philippe Champagne and Trade Minister Mary Ng have been leading that effort.\n\nTrudeau activated a similar response during Trump's first term in the White House, dispatching Canadians of all political stripes to remind American officials that the two nations' economies are joined at the hip and that trade conflicts would cause blowback for American businesses and consumers as well.\n\nTrudeau said Friday he plans to remind Trump repeatedly that such tariffs would hamper the president's own political goals as well.\n\n\"Our responsibility is to point out in this way, he would be actually not just be harming Canadians,\" Trudeau said. \"He'd actually be raising prices for American citizens as well and hurting American industry and businesses.\"\n\nTrudeau called Trump on Monday night after the social media post and talked up the mutual dependence of the two economies.\n\nThe prime minister convened a meeting with the premiers on Wednesday at their request to discuss the incoming U.S. administration's approach on trade and its concerns about the Canadian border.\n\nDuring a debate in Parliament this week over Trump's tariff threat, Deputy Prime Minister Chrystia Freeland pointed to a long list of industry leaders she has met with since the U.S. election: steel, automotive, pension funds, oil and gas, nuclear, aluminum, electricity, banks and even AI companies.\n\n\"This is Team Canada,\" she said.\n\nBut the last time the Trudeau Liberals assembled such an effort, they were a relatively new majority government. They also had a lot of help from key conservative figures, such as former Conservative leader Rona Ambrose and, importantly, the late former prime minister Brian Mulroney, who personally knew Trump and his former commerce secretary Wilbur Ross.\n\nAsa McKercher, the Hudson Chair in Canada-U.S. Relations at St. Francis Xavier University, said those relationships are now lacking.\n\n\"Remember the video of Mr. Mulroney singing to Mr. Trump at his birthday party? We have nothing like that this time,\" McKercher said.\n\n“The centre of the Trump administration is Mr. Trump himself, and so having a good in with Mr. Trump is really important.\"\n\nWhile Trudeau and Trump are familiar with each other, there is a question about just how united a front Trudeau can rally this time around. His government has less political capital, as his Liberal party trails behind in public opinion polls and is running out of time before the next election, which has to happen in the next 11 months.\n\nAfter Trudeau's meeting with the premiers, Ontario Premier Doug Ford's office sent a statement to media criticizing Ottawa for being \"slow to react\" and \"stuck on its back foot.\" Several premiers have also said Trump's complaints are legitimate.\n\n\"The Team Canada approach is good, but it's really a Liberal party, Canadian diplomatic kind of thing,\" said McKercher.\n\n\"This government is on life support. Investors know it, the opposition knows that. The Americans know it, too. Canada doesn't have a strong hand to play necessarily in terms of building bridges if the Trudeau government's out in eight months or nine months.\"\n\nSebastian Skamski, a press secretary for Conservative Leader Pierre Poilievre, said Trudeau's office has not reached out seeking help from Poilievre to network with the incoming U.S. administration.\n\nFreeland was asked whether she would bring Poilievre into the fold at a Nov. 8 news conference, and said she would not speak for him. She said she has, however, spoken with some Conservatives and New Democrats, though she did not name any.\n\nAt the same press conference, Foreign Affairs Minister Mélanie Joly said, \"The question is whether Pierre Poilievre will want to be partisan and defend Canada's interests.\"\n\nThis report by The Canadian Press was first published Nov. 29, 2024.\n\nKyle Duggan, The Canadian Press","summary":"OTTAWA — Prime Minister Justin Trudeau is meeting with U.S. president-elect Donald Trump at his Mar-a-Lago estate, a source has confirmed to The Canadian Press. Trudeau's plane landed in West Palm Beach, Fla.","url":"https://www.biv.com/news/prime-minister-justin-trudeau-and-donald-trump-meeting-in-florida-source-says-9883995","image":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2024/11/2c0a4697e9d9c6d01ca2112c8f5f1629fdb5d53824b0c08020fd51423328c654.jpg","video":null,"publish_date":"2024-11-30 00:01:32","author":"Kyle Duggan,The Canadian Press","authors":["Kyle Duggan","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.02},{"id":269055410,"title":"US-Philippines alliance: on shaky ground under Trump 2.0?","text":"For the past eight decades, the Philippines has anchored its foreign policy in a steadfast alliance with the United States, based on mutual security interests and deep historical ties. But as Donald Trump prepares to reclaim the White House, this partnership now faces a formidable test.\nObservers warn that Trump’s transactional approach to diplomacy and unpredictable leadership style could strain cooperation between the two treaty allies, at a time when unified action looks ever more essential amid rising tensions with Beijing in the South China Sea.\nGiven Trump’s reputation “for squeezing allies or resources in order to offer some sort of promise for their defence”, Philippine President Ferdinand Marcos Jnr’s administration is likely concerned about the future, according to Walden Bello, an economist and former Philippine congressman.\n“My sense is Malacanang Palace probably knows that the close relationship … is not going to persist under Trump,” he told This Week in Asia, referring to the Philippine president’s official residence.\nBeyond their mutual defence obligations, the Philippines relies heavily on the US for aid packages, military modernisation support, intelligence sharing and joint training exercises.\n\nFor Washington, this long-standing alliance – nurtured under outgoing President Joe Biden – provides strategic access to Philippine military bases and a key partner in countering Beijing’s expansionism, particularly regarding Taiwan.\nTrump’s return to the White House could herald a reduction in US military engagement with the region, however, leaving the Philippines more exposed to China’s growing encroachment of its maritime territory.\n“Will the Trump administration follow Biden’s foreign policy of militarily containing China? I have doubts about that,” said Bello, co-chair of the Focus on the Global South think tank and an honorary research fellow at The State University of New York at Binghamton.\nBello, who previously stirred controversy by predicting Trump’s re-election, told This Week in Asia that the appeal of the returning president lies not in any compelling vision for the future but in his ability to “capitalise on people’s fears” about the economy, immigration and conflict.\n“Trump is mainly interested in economic stuff and walling off the US from Chinese imports. He’s not really that much into containing China militarily,” he said.\n\nA diminished US military focus could affect “not only the Philippines”, but also South Korea and Japan, said the former congressman, who has long advocated the withdrawal of American forces from all three countries.\nMeanwhile, the inclusion of Elon Musk in Trump’s new administration has also drawn scrutiny of the Tesla and SpaceX CEO’s business ties with China, the potential impact on Washington’s relations with Beijing and how this might affect Manila.\nBut Trump’s straightforward political style may ultimately benefit the US-Philippine alliance, according to defence and security analyst Renato Cruz De Castro, a distinguished professor of international studies at De La Salle University in Manila.\n“His foreign policy is simple: make America great again. Making sure that the US maintains its leadership role on the basis of power,” he told This Week in Asia.\nTrump “initiated the strategic competition against China” and intensified freedom of navigation operations in the South China Sea, De Castro pointed out, with US Navy ships sailing through waters claimed by Beijing – a move guaranteed to provoke China.\nIt was also under Trump that the White House started using the term “Indo-Pacific”, he said – signalling a commitment to countering China and reaffirming US engagement with the region.\nBusiness as usual?\nWhat the media has dubbed “Trump 2.0” is expected to “continue strategic competition with China and build up American forces here in the Indo-Pacific”, De Castro predicted. “In fact, the first thing that he will do is increase the defence budget.”\nAccording to De Castro, the motivation for supporting Manila will stem from the US’ broader strategic rivalry with Beijing rather than genuine concern for the Philippines’ maritime sovereignty.\nOther observers shared this view that the Philippine-US alliance will remain “business as usual” under the new administration.\n“I don’t want to get out ahead of what the Trump administration will do,” said US Ambassador to the Philippines Marykay Carlson during the Manila Dialogue on the South China Sea on November 8. “But I think it’s very clear that there is strong bipartisan support for the US-Philippine alliance.”\nShe added that she was “very confident” Trump would emphasise the importance of the two countries’ ties.\n\nMike Pompeo, Trump’s previous secretary of state, confirmed in March 2019 that any armed attack on Philippine forces or vessels in the South China Sea would trigger their 1951 Mutual Defence Treaty.\n“It was under the Trump administration when the United States finally stated once and for all that the Mutual Defence Treaty applies to the South China Sea,” said Jeffrey Ordaniel, convenor of the Indo-Pacific Maritime Security Expert Working Group, at the Manila Dialogue.\nTrump’s previous administration also took steps to shore up defence ties with Manila, initiating donations of surveillance drones to the Philippine military in 2020 as a gesture to mend relations after Duterte repeatedly threatened to scrap the Visiting Forces Agreement that allows for US troop presence in the Philippines.\nSo how committed is Trump to the region? “We have no idea. In four years in office, he never said the words ‘South China Sea’,” said Gregory Poling, director of the Washington-based Asia Maritime Transparency Initiative and author of On Dangerous Ground: America’s Century in the South China Sea.\n“But there is a strong consensus among Republican members of the Congress and probably among those who he’ll put in his cabinet. So I would be cautiously optimistic that we see policy remain stable.”\n\nTrump has already made nominations for cabinet positions that will influence US-Philippines relations. Marco Rubio, his pick for secretary of state, is “very much familiar with the Philippines and is very anti-communist”, De Castro said.\nRubio has previously stressed the strategic importance of the Philippines to US interests, particularly in countering Beijing’s assertiveness in the South China Sea, and has emphasised the need for US support to deter China’s ambitions in the region – citing its refusal to accept the 2016 ruling that rejected its claims over Philippine territory.\nMeanwhile, Pete Hegseth, Trump’s nominee for defence secretary, remains more of an unknown. De Castro said he had “no idea” what Hegseth knew about the Philippines, noting that many had expected Pompeo to be chosen instead.\nAs for Trump himself, Bello said the US president-elect is “very personalistic in terms of relationships with heads of state”, which could have implications for Marcos.\n“I think he will not like the fact that Biden and [vice-president Kamala] Harris and Marcos had a very good relationship. Marcos will have to exert some effort to win him over.”\nThe Philippines has, under Marcos, practically outsourced its foreign and military policy to the United States\nWalden Bello, ex-Philippine congressman\nMarcos said he called Trump on November 19 to congratulate him on his victory but shared few details about their conversation, noting only that Trump asked, “How’s Imelda?” – a reference to Marcos’s mother, now 95 and rarely seen in public. Known for her wealth and alleged corruption, Imelda Marcos last encountered Trump socially in the early 1990s.\nWhen asked about future relations between Marcos and Trump, Poling said he did not think the US president-elect had “any particular personal attachment to the Philippines or to the Marcoses”, adding that “the alliance is not dependent on who’s in the White House and who’s in Malacanang”.\n“You will have a whole lot of people around him telling him that the Philippine alliance is important,” he said.\n“I think that President Marcos is the kind of savvy politician who knows how to work a man like Donald Trump. I’m sure he’ll be able to get along just fine.”\n‘Waltzing with a Dictator’\nIn contrast to the steady relationship Marcos enjoyed with Biden, analysts warn that he will need to adapt to Trump’s unpredictable style.\nElected in 2022 during Biden’s term, Marcos has sought to replicate the kind of arrangement his father had with the US from 1965 to 1986. During that era, five US presidents overlooked allegations of human rights abuses and corruption by Ferdinand Marcos Snr in exchange for access to military bases in the Philippines – a dynamic American investigative reporter Raymond Bonner called Waltzing with a Dictator in his 1987 book of the same name.\nSo far, Marcos Jnr has mirrored this waltz with a US administration under Biden that’s been eager to collaborate against Chinese expansionism and overlook his family’s past crimes.\n“Look at it this way: when Marcos came in there were five EDCA (Enhanced Defence Cooperation Agreement) sites; there are now nine. And basically, whatever happens at those bases, the Philippine government doesn’t know about,” said Bello, the former Philippine congressman.\n“The Philippines has, under Marcos, practically outsourced its foreign and military policy to the United States.”\n\nHowever, this arrangement could deteriorate under Trump, warned Roland Simbulan, a former University of the Philippines professor who is now vice chair of the Centre for People Empowerment in Governance and has written multiple books on Philippine-US security ties.\nBased on his past actions and campaign promises, “Trump’s position is that if allies are going to get support from the US, they’re going to have to buy it,” Simbulan said. “[He believes] it should not just be the responsibility of the US to bankroll or finance the defence of these countries.”\nBello agreed that when dealing with governments, Trump asks, “what’s in it for me? In terms of what the US can gain”.\n“He looks at military and security relationships as transactional,” he said. “If you can pay, great. If you can’t pay, then we can’t guarantee your security.”\nUnlike South Korea and Japan, the Philippines may lack the financial means to secure increased US support, which could lead to cuts instead, Bello said.\nHe speculated that Trump might leverage the Marcos family’s estimated “US$5 billion to US$10 billion” in plundered assets stashed abroad during negotiations. “I don’t think Trump is stupid,” Bello said. “Don’t think he will not make an effort to use that as a negotiating leverage.” He noted that with Russia’s invasion of Ukraine, the US “essentially froze the assets of Russian oligarchs” – an approach that Trump could consider repeating.\n“I wouldn’t be surprised if Malacanang is worried about that,” Bello added.\n\nUltimately, the Philippines may feel forced to seek out other partners and allies, De Castro said. “Not because of Trump, but simply because the United States is an external power,” he said. “We need to rely on security partners who are also in the region … the best candidates are Japan, South Korea and even Australia.”\nPoling, however, expressed scepticism that such drastic adjustments to Manila’s foreign policy would be needed, emphasising the relative stability of the US-Philippines alliance.\n“I think the Philippines should stay the course,” he said, noting that the absence of permanent US military bases in the Southeast Asian nation means “no issue of cost sharing”.\n“Trump will go after the Europeans, and then maybe he’ll go after the Koreans. But he has no animus towards the Philippines.”\nThis could present an opportunity for Manila to chart a new foreign policy direction, Bello said, although he remained pessimistic about Marcos’ ability to navigate these complexities.\n“I served with Marcos in Congress, back around 2009, 2010, and let me tell you, the guy has no sense of what a national interest is,” Bello said.\n“He spent most of the time outside Congress and really hardly delivered a speech or anything. Not a person known for having foreign policy savvy.”","summary":"The US president-elect’s interest in containing China militarily and supporting the Philippines’ defence remains an open question.","url":"https://www.scmp.com/week-asia/politics/article/3288695/us-philippines-alliance-shaky-ground-under-trump-20","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/29/004fe50f-f703-4ca7-8a86-ec6b575c4172_e0584c67.jpg","video":null,"publish_date":"2024-11-30 00:00:12","author":"Alan Robles,Raissa Robles","authors":["Alan Robles","Raissa Robles"],"language":"en","category":"politics","source_country":"cn","sentiment":0.27},{"id":269062410,"title":"Letters: PG&E waste | Rate accountability | Auto theft | Convicted president | Unlikely to help | Inaction expensive","text":"Rate hike an outrage\nin light of PG&E waste\n\nRe: “PG&E is seeking to increase bills to meet energy demands, more” (Page A1, Nov. 26).\n\nIs PG&E seeking to increase bills to meet energy demands, or is it to cover the cost of their endless TV commercials about burying cables?\n\nThis tiring commercial has been running for years, over and over again, on multiple TV channels, several times a day. Why? Bury the cables instead of just talking about it. We got it, years ago, so why keep wasting more of our money? A slip about it in connection with the bill would have been more than enough.\n\nIs there no oversight? Who is responsible for such enormous waste? Should PG&E have been taken over by the state? And on top of it, their CEO made $17 million in 2023 — for doing what? How can that be justified?\n\nJorg Aadahl\n\nPG&E rate hikes must\nhave accountaility\n\nRe: “PG&E is seeking to increase bills to meet energy demands, more” (Page A1, Nov. 26).\n\nPG&E, enough with the rate increases. California’s largest investor-owned utility has paid out billions of dollars in profits to its shareholders. PG&E has also paid millions of dollars in bonuses to its executives. Both payouts were in the shadow of some of California’s largest utility-related disasters. In support of these expenses, customers will be paying another rate increase just as winter approaches.\n\nPG&E needs to reinvest profits, not demand a handout from current customers. PG&E needs to also be accountable to its customers by providing them with a safe and reasonably priced product.\n\nAnd the PUC needs to be accountable to the ratepayers by holding them to it.\n\nConrad Garcia\n\nConcerted effort is\nneeded to stop car theft\n\nRe: “Bay Area auto thefts on rise” (Page A1, Nov. 25).\n\nYour article sheds light on an alarming issue impacting our communities. With over 1 million vehicles stolen nationwide in 2023 and the Bay Area ranking among the highest in theft rates, it’s clear this is a crisis requiring immediate action.\n\nLaw enforcement faces resource limitations. Car manufacturers must improve anti-theft technologies to address the problem effectively. Companies like Honda can enhance security measures, such as advanced tracking systems and tamper-resistant locks, to deter theft. Local governments should strengthen task forces and invest in public awareness campaigns to educate residents on protecting their vehicles.\n\nI urge policymakers and automakers to collaborate on these solutions and encourage residents to take proactive steps, like installing security devices and reporting suspicious activity. Together, we can combat auto thefts and safeguard neighborhoods.\n\nMaher Dedgeba\n\nConvicted president\npromises a bumpy ride\n\nOur military generally rejects those with felony convictions, yet our next commander in chief will be a felon with a record of 34 convictions. In addition, he has been charged with many more serious felonies that would certainly result in us ordinary folk spending most of the rest of life in a federal penitentiary.\n\nI can almost hear the sounds of high-pitched spinning from the graves of our Founding Fathers. Fasten your seat belts, I think we are in for a bumpy ride.\n\nMusk unlikely to make\ngovernment efficient\n\nWe can all breathe a sigh of relief, now that President-elect Donald Trump announced he will appoint Elon Musk and Vivek Ramaswamy to head a new Department of Government Efficiency, responsible for rooting out wasteful government spending.\n\nAlso promised by the new administration is a massive reduction in the government workforce, an area where Musk has expertise. When he bought Twitter, he reduced its workforce by 80%, and since then his investment has lost a corresponding 80% of its value.\n\nThis time may be different, but the first Trump administration was unconcerned with spending and racked up more debt than at any time in history. One area the new department should immediately focus on is the excessive lodging costs charged by the Trump Organization for Secret Service protection when the president is staying at his own properties.\n\nWarren Seifert\n\nNot switching to clean\nenergy would be costly\n\nRe: “Climate legacy we leave will be the financial mess” (Page A8, Nov. 24).\n\nI share Mr. Gutmann’s concern about leaving our children a financial mess. But the mess we leave them will be much larger if we scale back on the tremendous progress we are making in transitioning to clean energy.\n\nA recent report from the Environmental Defense Fund entitled “Fighting climate change costs far less than doing nothing” states, “Without action to slow global warming, the economic damage caused by climate change is projected to cost $38 trillion a year.”\n\nSolar was the fastest-growing source of electricity in 2023 for the 19th consecutive year, and has been cheaper than fossil fuels for years.\n\nClimate pollution is not a “future existential problem.” Hurricanes are becoming increasingly destructive due to warming oceans. Total 2024 economic losses due to hurricanes in the United States are estimated at more than $7.5 billion.\n\nTo avoid financial (and social) ruin we must transition to clean energy.","summary":"Mercury News Letters to the Editor for Dec. 1, 2024","url":"https://www.mercurynews.com/2024/11/29/letters-1949/","image":"https://www.mercurynews.com/wp-content/uploads/2016/08/20130314__0316grid2.jpg?w=400&h=267","video":null,"publish_date":"2024-11-30 00:00:10","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.145},{"id":269065032,"title":"Project 2025 backers are infesting Trump's next administration","text":"During the 2024 campaign, Donald Trump claimed to know nothing about Project 2025—the deeply unpopular roadmap for a second Trump term created by the right-wing Heritage Foundation.\n\n“I have nothing to do with Project 2025,” Trump said at the only debate he had with Vice President Kamala Harris, trying to distance himself from the plan that calls for banning medication abortion and purging the federal government of anyone not deemed sufficiently loyal to Trump, among other things. “I haven’t read it. I don’t want to read it purposely. I’m not going to read it.”\n\nBut now, over a month since Trump’s unfortunate victory, he's nominated at least seven people who either directly contributed to the document or who promoted it, according to a Daily Kos review—with more Project 2025 contributors rumored to be on the short list for other positions.\n\nThis breaks a promise from Trump’s transition co-chair Howard Lutnick, now Trump’s nominee to lead the Department of Commerce. Lutnick said there would be no Project 2025 people in a second Trump administration.\n\n“Heritage, because of Project 2025, is radioactive,” Lutnick told the New York Post the night of the vice presidential debate. “As in, none, zero, radioactive. So that’s a clear position.”\n\nBut now that Trump won, he is installing Project 2025 contributors and promoters to roles such as director of the CIA, chair of the Federal Communications Commission, ambassador to Canada, and border czar, to name a few.\n\nAnd let’s not forget JD Vance, who wrote the foreword to a book by the head of Project 2025.\n\nHere are the other Project 2025 contributors and promoters Trump has chosen for his administration.\n\nRuss Vought, nominee for director of the Office of Management and Budget\n\nTrump tapped Russ Vought—who wrote a chapter in Project 2025 on the executive office of the president—to serve as the head of the Office of Management and Budget. \n\nVought wants Trump to amass more power by purging the federal government of employees deemed not sufficiently loyal to Trump, as well as by allowing Trump to take more unilateral executive actions to achieve his goals.\n\n“The American people currently are not in control of their government, and the president hasn’t been either,” Vought said in an interview with right-wing webshow host Tucker Carlson, according to The New York Times. “We have to solve the woke and the weaponized bureaucracy and have the president take control of the executive branch.”\n\nDuring the campaign, Vought was surreptitiously taped talking about how he would help implement Project 2025 goals if Trump won. \n\nIn the video, Vought said, “Eighty percent of my time is working on the plans of what’s necessary to take control of these bureaucracies. And we are working doggedly on that, whether it’s destroying their agencies’ notion of independence … whether that is thinking through how the deportation would work.”\n\nVought also said he would help Trump transform the country based on his Christian nationalist views.\n\n“I want to make sure that we can say we are a Christian nation,” Vought is caught on camera saying. “And my viewpoint is mostly that I would probably be Christian nation-ism. That’s pretty close to Christian nationalism because I also believe in nationalism.”\n\nBrendan Carr, nominee for chair of Federal Communications Commission\n\nTrump nominated Brendan Carr, who wrote the Project 2025 chapter on the FCC, to chair the commission that regulates communication in the United States. Carr is currently an FCC commissioner.\n\n“Commissioner Carr is a warrior for Free Speech, and has fought against the regulatory Lawfare that has stifled Americans’ Freedoms, and held back our Economy,” Trump wrote in a statement announcing Carr’s nomination. “He will end the regulatory onslaught that has been crippling America’s Job Creators and Innovators, and ensure that the FCC delivers for rural America.”\n\nIn Project 2025, Carr called for going after Big Tech by reforming Section 230, which shields social media companies from being held liable for what users on their platforms say. Changing Section 230 would actually hurt internet users more than Big Tech, according to the Electronic Frontier Foundation, which said in May: “[O]nline speech is frequently targeted with meritless lawsuits. Big Tech can afford to fight these lawsuits without Section 230. Everyday internet users, community forums, and small businesses cannot. Engine has estimated that without Section 230, many startups and small services would be inundated with costly litigation that could drive them offline.”\n\nTom Homan, border czar\n\nTom Homan—one of the masterminds of the inhumane family-separation policy Trump implemented in his first term in office—is listed as a contributor to Project 2025.\n\nProject 2025 calls for allowing the Trump administration to use “expedited removal” for undocumented immigrants found at places like hospitals, schools, or churches. It also calls for building more immigration detention centers to keep undocumented immigrants locked up as they await deportation proceedings, which could take years. \n\nTrump said that Homan, as border czar, will be \"in charge of all Deportation of Illegal Aliens back to their Country of Origin.\"\n\n“I'm going to run the biggest deportation operation this country has ever seen,” Homan said in 2023, before Trump was the GOP nominee. \n\nJohn Ratcliffe, nominee for CIA director\n\nTrump picked John Ratcliffe, a former representative from Texas who served in the first Trump administration as director of national intelligence, to head the CIA.\n\nRatcliffe is also listed as a contributor to Project 2025, which calls for reforming the Foreign Intelligence Surveillance Act, which was used during the probe of Trump’s possible collusion with Russia during the 2016 campaign.\n\n“From exposing fake Russian collusion to be a Clinton campaign operation, to catching the FBI’s abuse of Civil Liberties at the FISA Court, John Ratcliffe has always been a warrior for Truth and Honesty with the American Public,” Trump said in a statement of Ratcliffe. “When 51 intelligence officials were lying about Hunter Biden’s laptop, there was one, John Ratcliffe, telling the truth to the American People.” \n\nPete Hoekstra, nominee to be ambassador to Canada\n\nTrump nominated Pete Hoekstra, chair of the Michigan Republican Party, to serve as U.S. ambassador to Canada, saying in a statement that he gave Hoekstra the role because \"Pete is well-respected in the Great State of Michigan - A State we won sizably.”\n\nHoekstra is listed as a contributor to Project 2025.\n\nKaroline Leavitt, White House press secretary\n\nTrump chose Karoline Leavitt, a failed congressional candidate who worked as a spokesperson for Trump’s 2024 campaign, to be White House press secretary. \n\nDuring the campaign, Leavitt insisted that Trump knew nothing about Project 2025.\n\n“He has unveiled hundreds of policy proposals on his website. … The media likes to talk about Project 2025, which has nothing to do with our campaign. It is Agenda 47,” Leavitt said in August. \n\nHowever, Leavitt herself appeared in a Project 2025 training video called “The Art of Professionalism,” where, according to Media Matters for America, Leavitt “discussed working in the Trump White House and how to navigate working for the federal government.”\n\nJames Braid, White House director of legislative affairs\n\nPunchbowl News reported that Trump chose Braid as his liaison to Capitol Hill to help him get his legislative agenda through Congress. \n\nBraid is a Vance ally, working as legislative director and deputy chief of staff in Vance’s U.S. Senate office.\n\nLike Leavitt, Braid also starred in Project 2025 training videos, talking about congressional relations and how Trump could get the Project 2025 agenda through Congress.","summary":"During the 2024 campaign, Donald Trump claimed to know nothing about Project 2025—the deeply unpopular roadmap for a second Trump term created by the right-wing Heritage Foundation.\n\n\n\n“I have nothing to do with Project 2025,” Trump said at the only debate he had with Vice President Kamala Harris, trying to distance himself from the plan that calls for banning medication abortion and purging the federal government of anyone not deemed sufficiently loyal to Trump, among other things. “I haven’t read it. I don’t want to read it purposely. I’m not going to read it.”\n\n\n\nBut now, over a month since Trump’s unfortunate victory, he's nominated at least seven people who either directly contributed to the document or who promoted it, according to a Daily Kos review—with more Project 2025 contributors rumored to be on the short list for other positions.\n\n\n\nThis breaks a promise from Trump’s transition co-chair Howard Lutnick, now Trump’s nominee to lead the Department of Commerce. Lutnick said there would be no Project","url":"https://www.dailykos.com/story/2024/11/29/2287120/-Project-2025-backers-are-infesting-Trump-s-next-administration?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1372151/story_image/GettyImages-2185634376.jpg?1732561236","video":null,"publish_date":"2024-11-30 00:00:02","author":"Emily Singer","authors":["Emily Singer"],"language":"en","category":"politics","source_country":"US","sentiment":0.151},{"id":269064588,"title":"Biden, FBI address hoax threats to lawmakers, Trump cabinet","text":"NANTUCKET, Massachusetts >> President Joe Biden said today that his administration was working with the FBI to address “swatting” and bomb threats made this week targeting lawmakers and several of President-elect Donald Trump’s cabinet picks.\n\nRep. Seth Magaziner, a House Democrat from Rhode Island, said today he was targeted by a bomb threat at home, a day after six Democratic lawmakers from Connecticut reported similar threats to their homes over the Thanksgiving Day holiday. Law enforcement in each case found no evidence of explosive devices, the lawmakers said.\n\nPete Hegseth, Trump’s choice to become U.S. defense secretary, and Lee Zeldin, Trump’s pick to lead the Environmental Protection Agency, were among nominees targeted with bomb threats and swatting attempts on Tuesday and Wednesday.\n\nSwatting is a false report made to police to induce chaos and fear by drawing a potentially heavy, armed response by officers at someone’s home. Law enforcement experts say it’s a form of harassment that is increasingly being used to target prominent figures.\n\n“House Democrats will not be deterred or intimidated from serving the people by violent threats,” Democratic House leader Hakeem Jeffries said in a statement today.\n\nTrump was wounded in an assassination attempt in Pennsylvania in July. In a separate incident in September, a man was charged with attempted assassination after allegedly positioning himself with a rifle outside one of Trump’s Florida golf courses.\n\nBiden, speaking today to reporters in Nantucket, Massachusetts, where he is spending the Thanksgiving holiday, said he expected to speak to Trump again during the transition.","summary":"NANTUCKET, Massachusetts >> President Joe Biden said today that his administration was working with the FBI to address &#8220;swatting&#8221; and bomb threats made this week targeting lawmakers and several of President-elect Donald Trump&#8217;s cabinet picks.","url":"https://www.staradvertiser.com/2024/11/29/breaking-news/biden-fbi-address-hoax-threats-to-lawmakers-trump-cabinet/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/11/web1_20241130_brk_jbi01.jpg","video":null,"publish_date":"2024-11-30 00:00:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":-0.44},{"id":269051220,"title":"Trump DJs during star-studded Thanksgiving dinner at Mar-a-Lago with guests including Sylvester Stallone, Bill Belichick","text":"President-elect Donald Trump played DJ in chief at his private club Mar-a-Lago on Thanksgiving —spies told Page Six — as his BFF Elon Musk grooved at his VIP table.\n\nAlso at the Thanksgiving dinner, sources said, was “Rocky” star Sylvester Stallone, 78, former Patriots coach Bill Belichick, 72, and his young girlfriend, Jordon Hudson, 24, as well as Trump’s family members including wife Melania and son Barron.\n\nSaid a source: “Melania looked very svelte and chic in a brown/orange fall colored dress with long sleeves with bursts of color in squares. Eric and Laura [Trump] were there, as was Elon Musk and his mother Maye, and Tiffany Trump and her husband.”\n\nThe source said: “Stallone came in around 8p.m. The Trump family arrived at 6:45p.m., and left at 9:15p.m. There were 300 people at the dinner — which was open to members and their guests.”\n\nThe insider added: “Trump played DJ all night and opened up with ‘YMCA,’ and went on to play Elvis hits and ‘Phantom of the Opera’ and ‘Ave Maria’ as his go-to songs. There were no speeches, but Elon was seen making a toast to the president and his family.”\n\nTrump and his techie sidekick Musk were jubilantly belting out “YMCA,” according to an Instagram clip. \n\nThe bros bopped in their seats — with Trump playfully patting Musk’s back at Trump’s roped off table The Post reported.\n\nTrump has been known to regularly DJ at the club where membership fees have soared past $1 million, we hear.\n\nAn insider said the Thanksgiving feast was about $350 a pop, including drinks. \n\n“It was a lavish buffet with turkey and all the fixings, and literally everything else imaginable,” said the source, adding, “fall colored [arrangements] were on the table.”\n\nIn typically understated fashion, Trump posted on social media for the holiday: “Happy Thanksgiving to all, including to the Radical Left Lunatics who have worked so hard to destroy our Country.”","summary":"Trump has been known to regularly DJ at the club where initiation fees have soared past $1 million, we hear.","url":"https://pagesix.com/2024/11/29/gossip/trump-djs-during-star-studded-thanksgiving-dinner-at-mar-a-lago-with-guests-including-sylvester-stallone-bill-belichick/","image":"https://pagesix.com/wp-content/uploads/sites/3/2024/11/94495673.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/nsHcPINW-guILbWnz.mp4","publish_date":"2024-11-29 23:59:43","author":"Ian Mohr","authors":["Ian Mohr"],"language":"en","source_country":"us","sentiment":0.381},{"id":269054368,"title":"Zelensky says Ukraine could temporarily cede territory to Russia in exchange for Nato membership","text":"Ukrainian president Volodymr Zelensky has suggested he would temporarily cede Ukrainian territory to Russia in exchange for joining Nato.\n\nMr Zelensky said Nato membership would have to be offered to unoccupied parts of the country to end the “hot phase” of the war and appeared to accept eastern parts of the country would fall outside this deal.\n\nIt comes after reports claimed one of US president-elect Donald Trump’s plans to end the war might be for Kyiv to cede the land Moscow has taken to Russia in exchange for Ukraine joining the alliance.\n\n“If we want to stop the hot phase of the war, we need to take under the Nato umbrella the territory of Ukraine that we have under our control,” Mr Zelensky told Sky News.\n\n“We need to do it fast. And then on the occupied territory of Ukraine, Ukraine can get them back in a diplomatic way.”\n\nHe said Nato should “immediately” cover the part of Ukraine that remains under Kyiv’s control, something he said Ukraine needs “very much otherwise he [Putin] will come back”.\n\nMr Zelensky was asked what he thought of the Mr Trump and said “we have to work with the new president” in order to “have the biggest supporter”.\n\n“I want to work with him directly because there are different voices from people around him. And that’s why we need not to allow anybody around to destroy our communication,” he said.\n\n“It will be not helpful and will be destructive. We have to try to find the new model. I want to share with him ideas and I want to hear from him.”\n\nThroughout the conflict, Mr Zelenskyy has never said he would cede any occupied Ukrainian territory to Russia - including Crimea, which Russia occupied in February 2014.\n\nIn September 2022, Russia unilaterally declared its annexation of areas in and around the Ukrainian oblasts of Donetsk, Kherson, Luhansk and Zaporizhzhia following referendums that were not internationally recognised.\n\nMr Zelensky’s long-held position is that the territory remains Ukrainian, that Russia’s occupation of the land is unlawful and that Kyiv will not cede any of its territory in order to strike a peace deal.","summary":"Zelensky’s long-held position is that Russian-controlled Ukraine remains Ukrainian and occupation is illegal","url":"https://www.independent.co.uk/news/world/europe/zelensky-putin-russia-ukraine-war-ceasefire-trump-b2656221.html","image":"https://static.independent.co.uk/2024/11/29/19/SEI230174392.jpg?width=1200","video":null,"publish_date":"2024-11-29 23:59:24","author":"Alexander Butler","authors":["Alexander Butler"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.059},{"id":269050546,"title":"Stimulus Policy Perplexity Why China Leadership Foreign Investors Cant See Eye Eye?module=top Story&pgtype=homepage","text":"For countless foreigners, their investment strategy over the past two years was as easy as ABC.\n“Anything but China”, became an increasingly common mantra and mindset, often abbreviated in everyday discourse to “ABC”. Trade publications and consultants warned there was too much risk and too little upside as the world’s second-largest economy sputtered and struggled to regain its footing after the pandemic.\nBut two months ago, that thinking was challenged by what appeared to be a sharp U-turn in China’s economic policies. And in the weeks that followed, hope arose that national-level changes could sustain a long-awaited bull run while stamping out the ABC ethos.\nChinese stocks, as measured by Hong Kong’s Hang Seng Index, surged 12 per cent in the first 30 days after Beijing fired off a monetary policy bazooka on September 24. But the gains were short-lived, scaling back as market participants were disappointed by fiscal measures that fell short of their elevated expectations.\nMeanwhile, Beijing has taken every opportunity to hail economic improvements and bolster confidence, including by releasing positive datasets early and using state mouthpieces to trumpet positivity, even as the two sides seem to have reached a consensus on the root causes of challenges – an ongoing property crisis, persistent local government debt woes, and weak consumption.\nThe official messages out of Beijing reflect the pursuit of a “slow-moving bull” in the market, rather than a “crazy bull”, after officials were called on to be “fearless and bold” in boosting the economy.\nAll the while, anxious foreign investors continue to wait for China’s trickle of stimulus measures to disperse the economic storm clouds and reinvigorate the market.\nThis has resulted in divergent perceptions between those investors and China’s central leadership toward the true nature and purpose of economic stimulus measures. And getting them on the same page could be an arduous undertaking.\n\n“Any investor who thinks the stimulus is for them and for stocks and GDP, but not for the greater good of the public, is deeply misinformed and will lose money,” said Zak Dychtwald, founder and CEO of Young China Group, a market-insight consultancy based in Shanghai.\n“The focus is on employment, livelihoods, stability and an economic transition, as well as on easing some pain for people in the midst of tumult.\n“It is more like a painkiller than a stimulant.”\nThe stimulus package was unveiled in a quick-fire manner. Since late September, China’s central bank, financial regulators, economic planner, finance and housing ministries, and the top legislature, have announced or endorsed loosening measures to jolt the tepid economy.\nThese moves include interest- and mortgage-rate cuts, more fiscal spending, support for developers and consumers, urban renewal, and a 6 trillion yuan (US$827 billion) respite for heavily indebted local governments.\nSome observers now say that investors aiming to capture opportunities in China should not be short on long-term visions amid Beijing’s long-term strategy to cultivate an advanced, sustainable economy while maintaining its overarching social vision, including improving its people’s lives.\nOn September 25, a day after leadership’s stimulus salvo, China’s State Council unveiled a 24-point set of guidelines to prioritise job creation and prevent the risk of large-scale unemployment as “a bottom line”.\nAnd the next day, as the fresh measures ignited capital-market exuberance and fuelled talk of how it could help the rich get wealthier, employment and livelihoods featured prominently at a rare Politburo meeting dedicated to economic matters.\nBeijing is very carefully leveraging its monetary and fiscal might\nDenis Depoux, Roland Berger consultancy\n“We must benefit people’s livelihoods and increase their income,” said an official readout of the meeting. “We must … focus on employment for key groups, such as fresh graduates, migrant workers, zero-employment households and those who have been jobless for a long time.”\nYoung China Group’s Dychtwald said the purpose of the stimulus, first and foremost, is stability, through improving livelihoods and employment, and with long-term economy-boosting benefits in mind.\n“If investors understand this, they will see there are a lot of themes around these goals to invest in, and they are relatively safer bets,” he said.\nDenis Depoux, global managing director of Germany-based consultancy Roland Berger, contends that Beijing’s plan should not even be called a stimulus, because it is not just about growth.\n“Rather, it is about economic transformation and derisking some systemic threats related to unemployment and local debts,” he said.\n“Beijing is very carefully leveraging its monetary and fiscal might, while avoiding creating bubbles, speculative moves or overlooking the hardship of the grass roots that would ultimately make the situation worse.”\nChina’s labour market has had a rough year, as evidenced by youth unemployment in October hovering above 17 per cent for the fourth straight month.\n\nOther than supporting jobs and improving livelihoods, China’s long-term goal of achieving a technology-driven economy through industrial policy has remained unchanged.\n“The Chinese economy disappointed in 2023-24, and many wonder why Beijing is not doing more to stimulate,” noted a report by financial services firm Gavekal Dragonomics in August. “One reason may be that industrial policy is working.”\nChina’s ratio of fixed-asset investment by tech hardware, telecoms and IT sectors per unit of new aggregate financing, including credit and equity issuance, rose to a recording high of 0.13 in 2023, from 0.1 in 2021, according to data from Gavekal Dragonomics.\nGoldman Sachs has said that Beijing’s resolve in the realms of tech and self-reliance is obvious, and that leadership appears willing to tolerate less stellar growth for an economy in transition.\n“The recent policy turn notwithstanding, the leadership’s determination to restructure the economy and pursue a technology-driven and self-reliant economy has not changed,” it said in its November report about China’s outlook for next year.\n“The cost of climbing up the ‘high-quality’ ladder is a slower speed of growth. We expect real GDP growth to average 3.5 per cent from 2025-35, compared with 9 per cent from 2000-19.”\nMeanwhile, Morgan Stanley, in its 2025 China Economics Outlook this month, said GDP growth was expected to slow to “around 4 per cent” in 2025-26.\n“Policy easing is likely to remain modest and supply-centric,” the report said. “It will take time for policymakers to decisively shift away from the old mindset.”\n\nAdditionally, Morgan Stanley analysts said that while the first round of China’s stimulus measures has been aimed at helping “mitigate the deflationary downward spiral”, the second round next year will likely be supply-centric, supporting consumption, housing inventory digestion, infrastructure and manufacturing.\nAnd with deflationary pressures seen lingering, they said a third round of stimulus could be triggered by evolving social dynamics, potentially opening the door to more decisive policy support for consumption and social welfare.\nThus far, Beijing’s measured approach to propping up the economy is also seen as indicative of its conviction that its industrial policies are paying off, and of how the nation’s economy is relying more on an engine fuelled by tech-related gains.\nThomas Gatley, an analyst with Gavekal Dragonomics, said in the August report: “Capital is flowing to where policymakers want it, going mainly to the government’s preferred tech-intensive manufacturing, and policymakers are getting the capital expenditure and R&D they want, with both in these sectors rising. Profit margins are still solid, and leverage is low.”\nBut such a model depends on cheap inputs and low labour costs and is perpetuating weak domestic demand while forcing companies to rely more on export sales, he warned.\nMonthly or quarterly GDP, and capital market gains or losses that concern most foreign investors, appear to be down on Beijing’s priority list\nKer Gibbs, AmCham Shanghai\nAgainst this backdrop, at the forefront of Beijing’s considerations for next year are further headwinds on trade and geopolitical fronts, as well as Donald Trump’s return to the White House, with his newly intensified tariff threats hanging over China’s export-heavy economy.\nAnalysts say these factors will influence Beijing’s design of further stimulus measures and of its future priorities.\n“Further stimulus is likely to make precautions for employment and livelihood. [Higher tariffs] will damage China for sure, dealing a big hit to exports and employment,” said Ker Gibbs, former president of the American Chamber of Commerce in Shanghai.\n“Monthly or quarterly GDP, and capital market gains or losses that concern most foreign investors, appear to be down on Beijing’s priority list when it is faced with more pressing issues,” Gibbs said.\nIn recent communications, top financial and fiscal policymakers have reiterated that Beijing has an ample toolbox and will roll out more stimulus in light of the changing circumstances.\nYoung China Group’s Dychtwald also warned of how adverse trends around China are accelerating, so further stimulus could provide relief.\n“Going forward, it will measure the softness of the landing of the economy as Beijing tries to ease people through this prolonged, painful economic transition and external challenges to move the needle toward a new economy – a process deemed necessary,” he said.\n“The stimulus will increasingly aim to lessen the pain for people and businesses, like for homebuyers who have to pay mortgages while home prices slump, or for those who are low-paid or unemployed.\n“This is one key part of the stimulus that is … underappreciated by many investors.”\n\nPoverty elimination and the expansion of welfare coverage have been elevated by Beijing despite the economic slowdown.\nThe country will pour more resources into strengthening universal and basic livelihood protections and will provide a safety net for the poor and underprivileged, according to an article by Minister for Civil Affairs Lu Zhiyuan that appeared this month on the website of the Communist Party’s top theoretical journal, Qiushi.\n“We will make sure that young have access to education, that workers have income, that the elderly and the sick can get care, that the homeless can be housed, and that the underprivileged can find support,” the article said.\nIn the meantime, investor enthusiasm may remain curbed on China, but those with an eye on the future are staying put, hopeful for a better tomorrow.\nMorgan Stanley CEO Ted Pick said at a summit in Hong Kong last week that while it will take a while for consumer confidence to be reignited in China, “we’re seeing some green shoots”.\n“Once that confidence starts to build,” he said, “the capital will move.”","url":"https://www.scmp.com/economy/china-economy/article/3288725/stimulus-policy-perplexity-why-china-leadership-foreign-investors-cant-see-eye-eye","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/29/682318d9-d301-4df8-8084-7fc1edaeef1c_fceb1558.jpg","video":null,"publish_date":"2024-11-29 23:57:30","author":"Frank Chen","authors":["Frank Chen"],"language":"en","category":"politics","source_country":"hk","sentiment":-0.253},{"id":269050608,"title":"Los aranceles de Trump afectarían al canal de Panamá y a los precios en Centroamérica","text":"Los aranceles estadounidenses a México, Canadá y China afectarán el comercio internacional, y por tanto al canal de Panamá, y elevarán los precios en Centroamérica, que tendrá que «reposicionarse» impulsando la integración regional y el ‘nearshoring’, dijeron a EFE analistas.\n\nEl presidente electo de Estados Unidos, el republicano Donald Trump, anunció un recargo del 25 % a todos los bienes importados desde México y Canadá, así como un arancel adicional del 10 % a los productos chinos, hasta que estos países – que son sus principales socios comerciales – frenen la llegada de inmigración ilegal y drogas.\n\nEl efecto en el canal de Panamá\n\nEl canal de Panamá es una vía relevante por la que pasa alrededor del 3 % del comercio mundial. Su principal cliente es Estados Unidos, que acapara dos tercios del tonelaje que lo cruza, seguido de lejos por China y Japón.\n\nEl economista y catedrático panameño, Felipe Argote, dijo a EFE que los aranceles anunciados por Trump podrían «tener un efecto negativo» en la vía interoceánica panameña «en función de la reducción del comercio mundial», que puede ser una consecuencia esperada de esa medida.\n\n«Cuando Estados Unidos aumenta aranceles, esto tiene unos efectos en la economía mundial. Esto sería un retroceso al modelo económico de la década de 1970, el llamado sistema de sustitución de importaciones, en donde cada país se cerró a las importaciones y lo que pasó fue un desastre mundial. Y luego de la globalización eso es peor todavía», indicó Argote.\n\nEn un comentario enviado a EFE, el canal de Panamá indicó que «en el pasado, a pesar de las diferencias comerciales entre Estados Unidos y China, el desempeño del Canal de Panamá se ha mantenido sólido. Sin embargo», agrega, se «monitorea constantemente el tráfico marítimo mundial y las políticas comerciales globales que podrían impactar» la operación de la vía, que une el Atlántico con el Pacífico.\n\nInflación importada en Centroamérica\n\nA lo interno de Estados Unidos, un efecto inevitable de las trabas al comercio será la escalada de la inflación, dijo a EFE el economista panameño, Carlos Araúz, un extremo que también destaca Argote al señalar que los aranceles de Trump, combinado con su promesa de expulsar a millones de inmigrantes, encarecerá aún más la mano de obra en ese país.\n\nY en ese contexto, Centroamérica se verá afectada porque le compra mucho a Estados Unidos y «va a recibir la inflación importada» del gigante norteamericano.\n\nEstados Unidos es la principal fuente de importaciones de Centroamérica, con un total de 31.531,1 millones de dólares en 2023, seguido de China (15.917,1 millones de dólares) y México (8.069,6 millones de dólares), según el Sistema de Estadísticas de Comercio de Centroamérica.\n\nMás integración regional y ‘nearshoring’\n\nA juicio de Araúz, Estados Unidos «va a hacer que el mundo retroceda 100 años en materia de intercambio comercial» con una política de aranceles que será insostenible y le conducirá a «momentos muy complejos», por lo que «eventualmente cambiará».\n\n«Y mientras eso ocurra, Panamá y la región tiene que reposicionarse. La interacción y la integración centroamericana y del Caribe es importante, y además el ‘nearshoring’, específicamente hacia el Sur, pero también hacia la Unión Europea y el oeste de Europa», añade.\n\nEl ‘nearshoring’ ocurre cuando una empresa traslada una parte o la totalidad de su producción más cerca del consumidor final.\n\nEn este escenario, agrega Argote, se puede dar «alguna reestructuración», con compradores en América Latina que comiencen a «preferir comprarle a China, que está avanzando a nivel mundial por una serie de factores, como la mano de obra barata y la tecnología».\n\nLas empresas chinas podrían «poner centros de redistribución en Latinoamérica, y la Zona Libre de Colón, en Panamá, es un excelente puesto para eso, siempre y cuando cambie sus estructuras operativas», agregó. EFE","summary":"Los aranceles estadounidenses a México, Canadá y China afectarán el comercio internacional, y por tanto al canal de Panamá, y elevarán los precios en Centroamérica,...","url":"https://www.latribuna.hn/2024/11/29/los-aranceles-de-trump-afectarian-al-canal-de-panama-y-a-los-precios-en-centroamerica/","image":"https://cdn.latribuna.hn/wp-content/uploads/2024/08/Canal-de-Panama-latribuna-.jpg","video":null,"publish_date":"2024-11-29 23:55:30","author":"Redacción Web","authors":["Redacción Web"],"language":"en","category":"politics","source_country":"hn","sentiment":1},{"id":269050392,"title":"Trudeau in Florida to meet Trump as tariff threats loom: media","text":"Canadian Prime Minister Justin Trudeau arrived in Palm Beach, Florida, on Friday for what Canadian and American media said was a meeting with US President-elect Donald Trump at his Mar-a-Lago luxury estate.\n\nFlight trackers first spotted a jet broadcasting the prime minister's callsign en route to the southern US state, in a visit that comes days after Trump threatened the United States' northern neighbor with import tariffs once he takes office.\n\nAccording to the website Flightradar, the Canadian leader's plane landed at Palm Beach International Airport late in the afternoon.\n\nCanadian public broadcaster CBC said Trudeau would be dining with Trump, and that his public safety minister, Dominic LeBlanc was accompanying him on the trip.\n\nThe prime minister's office did not immediately confirm the unannounced trip.\n\nTrump sent shockwaves across Canada when he announced pending import tariffs against neighbors Canada and Mexico and also rival China in social media posts on Monday.\n\nMore than three-quarters of Canadian exports, or Can$592.7 billion ($423 billion), went to the United States last year, and nearly two million Canadian jobs are dependent on trade.\n\nA government source told AFP that Canada is considering possible retaliatory tariffs against the United States.\n\nSome have suggested Trump's tariff threat may be bluster, or an opening salvo in future trade negotiations. But Trudeau rejected those views when he spoke with reporters earlier in Prince Edward Island province.\n\n\"Donald Trump, when he makes statements like that, he plans on carrying them out,\" Trudeau said. \"There's no question about it.\"\n\nSource: AFP","summary":"Canadian Prime Minister Justin Trudeau arrived in Palm Beach, Florida, on Friday for what Canadian and American media said was a meeting with US President-elect Donald Trump at his Mar-a-Lago luxury estate. According to the website Flightradar, the Canadian leader's plane landed at Palm Beach International Airport late in the afternoon.","url":"https://yen.com.gh/business-economy/272346-trudeau-florida-meet-trump-tariff-threats-loom-media/","image":"https://cdn.yen.com.gh/images/1200x675/6a2d02c7fc7c3db7.jpeg?v=1","video":null,"publish_date":"2024-11-29 23:55:05","author":"Samuel Obour","authors":["Samuel Obour"],"language":"en","category":"politics","source_country":"gh","sentiment":0.2},{"id":269050610,"title":"FBI probes bomb threats to lawmakers, Trump nominees","text":"Camera IconA number of Democrats and several of Donald Trump's cabinet picks have been threatened. (AP PHOTO) Credit: AAP\n\nFBI probes bomb threats to lawmakers, Trump nominees\n\nJeff Mason and Rich McKayReutersNovember 30, 2024 7:51AM","summary":"The US government and FBI are looking into a series of hoax threats aimed at Democratic politicians and some of Donald Trump's cabinet picks.","url":"https://www.perthnow.com.au/politics/fbi-probes-bomb-threats-to-lawmakers-trump-nominees-c-16926821","image":"https://images.perthnow.com.au/publication/C-16926821/1eecb613cfcc461a5dfd611fed517481572a486d-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-11-29 23:51:35","author":"Jeff Mason","authors":["Jeff Mason"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.932},{"id":269052676,"title":"Canadian Prime Minister Trudeau flies to Florida to meet with Trump on tariffs threat","text":"WEST PALM BEACH, Fla. (AP) — Canadian Prime Minister Justin Trudeau has flown to Florida to meet with President-elect Donald Trump at his Mar-a-Lago club after Trump threatened to impose sweeping tariffs on Canadian products.\n\nA person familiar with the matter said Trudeau will have dinner with Trump. The official was not authorized to speak publicly about the matter and spoke on condition of anonymity.\n\nCanadian Public Safety Minister Dominic LeBlanc accompanied Trudeau on the trip.\n\nTrump has threatened to impose tariffs on products from Canada and Mexico if the countries don’t stop what he called the flow of drugs and migrants across southern and northern borders. He said he would impose a 25% tax on all products entering the U.S. from Canada and Mexico as one of his first executive orders.\n\nAlthough Trump once called Trudeau “weak” and “dishonest” during his first term, ties between the two countries have remained among the closest in the world.\n\nTrudeau said earlier Friday that he would resolve the issue by talking To Trump.\n\n“We’re going to work together to meet some of the concerns,” Trudeau told reporters in Prince Edward Island in Atlantic Canada. “But ultimately it is through lots of real constructive conversations with President Trump that I am going to have, that will keep us moving forward on the right track for all Canadians.”\n\nTrudeau said Trump got elected because he promised to bring down the cost of groceries but now he’s talking about adding 25% to the cost of all kinds of products including potatoes from Prince Edward Island.\n\n“It is important to understand that Donald Trump, when he makes statements like that, he plans on carrying them out. There’s no question about it,” Trudeau said.\n\n“Our responsibility is to point out that he would not just be harming Canadians, who work so well with the United States, but he would actually be raising prices for Americans citizens as well and hurting American industry and business,” he added.\n\nThose tariffs could essentially blow up the North American trade pact that Trump’s team negotiated during his initial term. Trudeau noted they were able to successfully re-negotiate the deal, which he calls a “win win” for both countries.\n\n“We can work together as we did previously,” Trudeau said.\n\nTrump made the tariff threat Monday while railing against an influx of illegal migrants, even though the numbers at the Canadian border pale in comparison to the southern border.\n\nThe U.S. Border Patrol made 56,530 arrests at the Mexican border in October alone — and 23,721 arrests at the Canadian one between October 2023 and September 2024.\n\nTrump also railed about fentanyl from Mexico and Canada, even though seizures from the Canadian border are few in comparison to the Mexican border. U.S. customs agents seized 43 pounds of fentanyl at the Canadian border last fiscal year, compared with 21,100 pounds at the Mexican border.\n\nCanadian officials say lumping Canada in with Mexico is unfair but say they are ready to make new investments in border security.\n\nMexican President Claudia Sheinbaum said Thursday she is confident that a tariff war with the United States will be averted. Trump posted on social media that he had spoken with her and she had agreed to stop unauthorized migration across the border into the United States.\n\nWhen Trump imposed higher tariffs during his first term in office, other countries responded with retaliatory tariffs of their own. Canada, for instance, announced billions of new duties in 2018 against the U.S. in a tit-for-tat response to new taxes on Canadian steel and aluminum.\n\nCanada is already examining possible retaliatory tariffs on certain items from the U.S. should Trump follow through on his threat to impose sweeping tariffs on Canadian products, a senior official told The Associated Press this week.\n\nA government official said Canada is preparing for every eventuality and has started thinking about what items to target with tariffs in retaliation. The official stressed no decision has been made. The person spoke on condition of anonymity as they were not authorized to speak publicly.\n\nCanada is the top export destination for 36 U.S. states. Nearly $3.6 billion Canadian (US$2.7 billion) worth of goods and services cross the border each day.\n\nAbout 60% of U.S. crude oil imports are from Canada, and 85% of U.S. electricity imports are from Canada.\n\nCanada is also the largest foreign supplier of steel, aluminum and uranium to the U.S. and has 34 critical minerals and metals that the Pentagon is eager for and investing in for national security.\n\nCanada is one of the most trade-dependent countries in the world, and 77% of Canada’s exports go to the U.S.\n\n“Canada has reason to fear because Trump is impulsive, often influenced by the last thing he sees on Fox News,” said Nelson Wiseman, professor emeritus at the University of Toronto. “He can leverage that by catering to what he thinks will sound and look good to the public rather than to what happens or will happen.”\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WEST PALM BEACH, Fla. (AP) — Canadian Prime Minister Justin Trudeau has flown to Florida to meet with President-elect Donald Trump at his Mar-a-Lago club...","url":"https://wsvn.com/news/politics/canadian-prime-minister-trudeau-flies-to-florida-to-meet-with-trump-on-tariffs-threat/","image":"https://wsvn.com/wp-content/uploads/sites/2/2018/07/s091079138.jpg?quality=60&strip=color","video":null,"publish_date":"2024-11-29 23:51:02","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","category":"politics","source_country":"us","sentiment":0.159},{"id":269050346,"title":"A comparison of the 2020 and 2024 elections is revealing: Letter to the Editor","text":"A comparison of the 2020 vs the 2024 elections is revealing. In 2020, Joe Biden won with 81,283.501 popular votes and 306 electoral votes. For Donald Trump, it was 74,223,975 popular votes and 232 electoral votes.\n\nIn 2024, Trump won with 76,917,038 popular votes and 312 electoral votes. For Kamala Harris it was 74,441,439 popular votes and 226 electoral votes.\n\nWhat this says is that Trump’s figures differ by about 2.7 million votes for both elections, as I would expect, but Harris got nearly 7 million votes fewer than Biden.\n\nThat suggests that millions of previous Joe Biden voters decided not to vote or voted for Trump. I have no comment other than a slogan I once heard or read: “If you vote, the choice is yours; if you don’t, the choice is theirs.”\n\nCharles F. Cicco, Cleveland Heights","summary":"The presidential vote totals between 2020 and 2024 suggest that millions of previous Joe Biden voters decided not to vote or voted for Donald Trump. I have no comment other than a slogan I once heard or read: “If you vote, the choice is yours; if you don’t, the choice is theirs,” writes Charles F. Cicco of Cleveland Heights in a letter to the editor.","url":"https://www.cleveland.com/letters/2024/11/a-comparison-of-the-2020-and-2024-elections-is-revealing.html","image":"https://www.cleveland.com/resizer/v2/XGRJHEJK6VEPVCJKLVAUCTLH5E.jpg?auth=3f671a723f783af4be6b4a24c728b6863f8c2f960403299a657eb9c815ab7eef&width=1280&quality=90","video":null,"publish_date":"2024-11-29 23:50:20","author":"Other Voices","authors":["Other Voices"],"language":"en","source_country":"US","sentiment":0.254},{"id":269049522,"title":"Canada's Prime Minister argues Donald Trump's tariff plan will hurt Canadians and Americans","text":"Canadian Prime Minister Justin Trudeau responded to President-elect Donald Trump's Monday vow to impose tariffs on Canada and Mexico on day one in office.Trudeau, who's been Canada's prime minister since 2015, told reporters in Prince Edward Island, Canada, that Trump's expected action will have consequences not just on Canadians but also on American consumers, according to the Associated Press.\"Our responsibility is to point out that he would not just be harming Canadians, who work so well with the United States, but he would actually be raising prices for Americans citizens as well and hurting American industry and business,\" Trudeau said.After a phone call earlier in the week to discuss the plans, Trudeau also made his way to West Palm Beach on Friday to meet with Trump, sources told Bloomberg.Trump plans to impose 25% tariffs on goods coming from the northern and southern neighbors of the US. He said it's a direct response to the inflow of immigrants and narcotics coming into the country illegally from Canada and Mexico, he said.Canada and the US worked together during Trump's first presidency when re-negotiating the North American Free Trade Agreement. Trump threatened to use tariffs then as well. His threat of tariffs on imports from Mexico led to an expansion of the Migrant Protection Protocols program across the US-Mexico border.Trudeau noted that the two have been able to come to an agreement in the past.\"We can work together as we did previously,\" Trudeau said.While Canada has yet to impose any tariffs of its own, a senior official told AP that it is looking into introducing retaliatory tariffs on certain items from the US.\"We're going to work together to meet some of the concerns,\" Trudeau said. \"But ultimately it is through lots of real constructive conversations with President Trump that I am going to have, that will keep us moving forward on the right track for all Canadians.\"Mexico's President Claudia Sheinbaum Pardo has already said that her country would impose tariffs on the US if Trump goes through with his plan.Sheinbaum said during a press conference this week that \"one tariff will be followed by another, and so on, until we put joint ventures at risk.\"As previously reported by Business Insider, Canada was the top export destination for 32 states in 2016. According to the Toronto Region Board of Trade, about 77% of Canada's exports go to the US.","summary":"Canada's Prime Minister Justin Trudeau reportedly flew to Mar-a-Lago after Trump announced new tariff plans.","url":"https://www.businessinsider.com/justin-trudeau-trump-tariffs-harm-canadians-americans-2024-11","image":"https://i.insider.com/674a3cadfa0140cdd56643e5?width=1200&format=jpeg","video":null,"publish_date":"2024-11-29 23:45:52","author":"Jordan Pandy","authors":["Jordan Pandy"],"language":"en","category":"politics","source_country":"US","sentiment":-0.165},{"id":269064452,"title":"Report: Trudeau to meet with Trump at Mar-a-Lago","text":"Canadian Prime Minister Justin Trudeau will meet with President-elect Donald Trump Friday at Trump's Mar-a-Lago estate in Florida, Canada's CBC News reported. The meeting comes in the wake of Trump's threat to impose tariffs on goods coming from Canada. Trudeau will dine with Trump at Mar-a-largo Friday night, according to senior sources who spoke to CBC News on condition they not be named due to the sensitivity of the trip. The sources said the meeting was pushed for by Canadian officials, the Canadian broadcaster said.Trudeau's plane landed at Palm Beach International Airport at about 5:30 p.m. local time. The meeting comes after Trudeau earlier Friday cautioned that if Trump follows through on this threat to impose sweeping tariffs on Canadian products, he would be raising prices for Americans and hurting American businesses.Trump has threatened to impose tariffs on products from Canada and Mexico if the countries don't stop what he called the flow of drugs and migrants across southern and northern borders. He said he would impose a 25% tax on all products entering the U.S. from Canada and Mexico as one of his first executive orders.\"It is important to understand that Donald Trump, when he makes statements like that, he plans on carrying them out. There's no question about it,\" Trudeau said to reporters in Prince Edward Island in Atlantic Canada.\"Our responsibility is to point out that he would not just be harming Canadians, who work so well with the United States, but he would actually be raising prices for American citizens as well and hurting American industry and business,\" he added.Trudeau said Trump got elected because he promised to bring down the cost of groceries but now he's talking about adding 25% to the cost of all kinds of products, including potatoes from Prince Edward Island.Those tariffs could essentially blow up the North American trade pact that Trump's team negotiated during his first term. Trudeau noted they were able to successfully re-negotiate the deal, which he calls a \"win-win\" for both countries.\"We can work together as we did previously,\" Trudeau said.Trump made the tariff threat Monday while railing against an influx of illegal migrants, even though the numbers at the Canadian border pale in comparison to the southern border.The U.S. Border Patrol made 56,530 arrests at the Mexican border in October alone — and 23,721 arrests at the Canadian one between October 2023 and September 2024.Trump also railed about fentanyl from Mexico and Canada, even though seizures from the Canadian border are few in comparison to the Mexican border. U.S. customs agents seized 43 pounds of fentanyl at the Canadian border last fiscal year, compared with 21,100 pounds at the Mexican border.Canadian officials say lumping Canada in with Mexico is unfair but they are ready to make new investments in border security.\"We're going to work together to meet some of the concerns,\" Trudeau said. \"But ultimately it is through lots of real constructive conversations with President Trump that I am going to have, that will keep us moving forward on the right track for all Canadians.\"Mexican President Claudia Sheinbaum said Thursday she is confident that a tariff war with the United States will be averted. Trump posted on social media that he had spoken with her and she had agreed to stop unauthorized migration across the border into the United States.When Trump imposed higher tariffs during his first term in office, other countries responded with retaliatory tariffs of their own. Canada, for instance, announced billions of new duties in 2018 against the U.S. in a tit-for-tat response to new taxes on Canadian steel and aluminum.Canada is the top export destination for 36 U.S. states. Nearly $2.7 billion worth of goods and services cross the border each day.Canada is also the largest foreign supplier of steel, aluminum and uranium to the U.S. and has 34 critical minerals and metals that the Pentagon is eager for and investing in for national security.","summary":"Canadian Prime Minister Justin Trudeau will meet with President-elect Donald Trump Friday at Trump's Mar-a-Lago estate in Florida, Canada's CBC News reported.","url":"https://www.cbsnews.com/news/canada-trudeau-trump-tariff-threat-prices-americans-mar-a-lago-meeting/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/29/cb4d240a-e6d2-49b2-8137-42245e991a30/thumbnail/1200x630/3aca1aace0c40b844a1fd834c68ce067/ap24327821819976.jpg?v=e3aa8b4a58817620ee227c79202c9709","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3366155_hls/master.m3u8","publish_date":"2024-11-29 23:45:09","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.115},{"id":269049274,"title":"Biden's is lead through the streets by grandson Beau and helped on stage by Hunter on Black Friday shopping trip","text":"Biden's is lead through the streets by grandson Beau and helped on stage by Hunter on Black Friday shopping trip\n\nREAD MORE: Biden says he hopes Trump has an 'internal reckoning' \n\nBy EMILY GOODIN, SENIOR WHITE HOUSE CORRESPONDENT ON NANTUCKET\n\nPublished: 23:44 GMT, 29 November 2024 | Updated: 23:48 GMT, 29 November 2024\n\nPresident Joe Biden joined millions of Americans searching for a Black Friday deal with a shopping trip on Nantucket with first lady Jill and son Hunter.\n\nHis grandson Beau, 4, got into the act, leading his grandpa through the cobble stone streets of Nantucket by the hand. \n\nThe Biden family capped off their day of shopping at the town Christmas Tree lighting ceremony. Afterward Hunter helped his father step up onto a small platform to take a photo with the children's choir, who entertained the crowd with traditional carols. \n\nThe 82-year-old commander-in-chief started the day by dining at The Brotherhood of Thieves restaurant during his annual wealthy Massachusetts enclave.\n\nMeanwhile Donald Trump spent part of the day after his bash with Elon Musk, son Barron and wife Melania at the Trump International Golf Club West in Palm Beach\n\nBiden scoured the stores, holding hands with his grandson Beau and petting a Dachshund, while pedestrians watched and shouted 'we love you, Joe'. At one point, Biden even held the dog to pose for a photo with its owner. Hunter snapped the picture. \n\nHunter, who is facing sentencing next month on federal tax on and gun crimes, walked alongside his wife Melissa in jeans and a bomber jacket. \n\nBiden responded to two questions from reporters waiting outside as he browsed holiday deals.\n\nHe said he was 'working hard with the FBI' after several of president-elect's Trump Cabinet picks and Democrats were targeted with bomb threats and swatting.\n\nBiden also said he expects to speak to Trump again during the transition.\n\nPresident Joe Biden joined millions of Americans searching for a Black Friday deal with a shopping trip on Nantucket with first lady Jill. Hunter Biden, his wife Melissa and their son Beau also joined them\n\nHunter helped dad Joe up on the platform to take a photo with the choir\n\nJill Biden was shopping for books, and appeared to be getting sentimental by picking up a copy of her husband's 2021 inaugural address.\n\nHer husband also picked up a book, The Hundred Years' War on Palestine by Rashid Khalidi.\n\nTheir daughter Ashley was spotted trying on a headband as she looked for her own bargain.\n\nThe Biden family celebrated Thanksgiving the same way they have done for the last 40 years, with a vacation on Nantucket. \n\nOn Thursday he visited a firehouse, as he does every year, to deliver pumpkin pies. \n\nHe urged Trump to rethink his tariff war with Canada and Mexico, fretted about the state of the mainstream media and offered what he was thankful for\n\nHe paused to take questions from reporters to reflect on the holiday season and discuss the actions of his successor in the Oval Office.\n\nThe Biden family watches the Christmas tree lighting on Nantucket to mark the end of the Thanksgiving holiday\n\nBiden walks hand-in-hand with grandson Beau, his son Hunter Biden and daughter-in-law Melissa Cohen\n\nBiden said said he was 'working hard with the FBI' after several of president-elect's Trump Cabinet picks and Democrats were targeted with bomb threats and swatting\n\nBiden responded to two questions from reporters waiting outside as he browsed holiday deals\n\nHunter looks on with wife Melissa Cohen on his arm during the Christmas tree lighting on Nantucket\n\nBiden, daughter Ashley and daughter-in-law Melissa Cohen clap during the Christmas tree lighting\n\nMembers of the first family watch as a children's choir performs in the center of the town\n\nThe 82-year-old commander-in-chief started the day by dining with his family at The Brotherhood of Thieves restaurant in the wealthy Massachusetts enclave\n\nHunter, who is facing sentencing next month on federal tax on and gun crimes, walked alongside his wife Melissa in jeans and a bomber jacket \n\nAshley Biden was spotted trying on a headband as she looked for her own bargain\n\nBiden scoured the stores, holding hands with his grandson Beau and petting a Dachshund, while pedestrians watched and shouted 'we love you, Joe'\n\nBiden holds hands with his son Beau while walking the streets of Nantucket on Black Friday\n\nBiden poses for a selfie with spectators watching as he wandered around the stores \n\nHe said he hopes Trump rethinks his plan to impose tariffs on Mexico and Canada, saying it could 'screw up' relationships with close allies.\n\n'I hope he rethinks it. I think it's a counterproductive thing to do,' he said.\n\n'We're surrounded by the Pacific Ocean, the Atlantic Ocean, and two allies: Mexico and Canada. The last thing we need to do is begin to screw up those relationships.'\n\nA heavy Secret Service presence was on standby as Biden and members of his family went for lunch in Nantucket\n\nBiden said he thinks Chinese President Jinping Xi will be more measured in his response. Chinese officials have said they don't want a trade war.\n\n'We have reached a relationship with a status quo regarding China,' Biden noted. 'We set up a hotline between President Xi and myself, as well as a military - a direct line. One thing I'm confident about Xi is he doesn't want to make a mistake. I mean it sincerely.\n\nBiden also said he thinks Trump will have an 'internal reckoning' when it comes to some of his plans as president.\n\n'I want to make sure this transition goes smoothly. I want to make sure it goes smoothly. All the talk about what (Trump) may do or not do - I think there may be an internal reckoning on his part .. so it remains to be seen.' \n\nJoe BidenMexicoPoliticsCanada\n\nShare or comment on this article:\nBiden's is lead through the streets by grandson Beau and helped on stage by Hunter on Black Friday shopping trip\n\nAdd comment","summary":"President Joe Biden joined millions of Americans searching for a Black Friday deal with a shopping trip on Nantucket with first lady Jill and son Hunter.","url":"https://www.dailymail.co.uk/news/article-14141753/biden-joe-hunter-beau-shopping-nantucket.html","image":"https://i.dailymail.co.uk/1s/2024/11/29/23/92638625-0-image-a-2_1732923823647.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/29/6133493286467514588/1024x576_MP4_6133493286467514588.mp4","publish_date":"2024-11-29 23:45:06","author":"Editor,Emily Goodin","authors":["Editor","Emily Goodin"],"language":"en","source_country":"gb","sentiment":0.149},{"id":269055424,"title":"Retailers offer big Black Friday deals to coax inflation-weary shoppers","text":"Retailers used giveaways and big discounts to reward U.S. shoppers who ventured out for Black Friday even as earlier offers, the prospect of better bargains in the days ahead and the ease of e-commerce drained much of the excitement from the holiday shopping season’s much-hyped kickoff.\n\nFrequent deals throughout the month and more awaiting on Cyber Monday gave consumers less of a reason to squabble over store shelves while trying to get their hands on TVs or toys. But shopping malls and merchants big and small used the day after Thanksgiving to entice customers into physical stores at a time when many prefer to browse and buy online.\n\nSome Target shoppers lined up as early as 11:30 p.m. on Thanksgiving Day to get their hands on an exclusive book devoted to Taylor Swift’s Eras Tour and a bonus edition of her “The Tortured Poets Department: The Anthology” album. Although both will be available purchase online starting Saturday, many locations sold out their supply of the products, the discount retailer said.\n\nAt a Target in Southfield, Michigan, a few miles north of Detroit, Marge Evans, 32, used her cellphone to take and send photos of shirts, sweaters and other apparel with Black Friday markdowns. Her shopping cart was full, but she was shopping for an upcoming cruise with her fiance, not Christmas.\n\n“I’ll see what things are looking like the first week in January,” the 32-year-old massage therapist said. “Really, after the holidays are over is when the real deals come through. They get rid of everything.”\n\nIndustry analysts observed Black Friday shoppers displaying the same choosy, deal-driven behavior many U.S. consumers exhibited all year while adjusting prices after the period of inflation that started toward the end of the coronavirus pandemic.\n\nAt many stores, the huge crowds of Black Fridays past never returned after the pandemic. A Walmart in Germantown, Maryland, had only half of the parking spots filled on Friday morning. Some shoppers were returning items or buying groceries.\n\nBharatharaj Moruejsan, a 35-year-old software engineer, decided to check out Walmart’s offers because he was jet-lagged after returning from a month-long family vacation to India. He scored an iPad for his 1-year-old daughter for $250, 32% off its original $370 price tag.\n\n“That’s a good deal,” Moruejsan said.\n\nAfter visiting stores and shopping centers on Long Island, Marshal Cohen, chief retail adviser at market research firm Circana, said that apart from people lining up for Target’s Taylor Swift merchandise, the number of shoppers appeared typical.\n\n“The spreading out of the holidays has created the lack of need and lack of urgency,” said Cohen, who had a 20-person team monitoring crowds nationwide. “This is going to be a long, slow tedious process” of getting shoppers to buy, he said.\n\nMichael Brown, a partner at management consulting firm Kearney, saw no lines at the Westfield Garden State Plaza in Paramus, New Jersey, 10 minutes before the 7 a.m. opening.\n\n“It’s not the old Black Friday that we used to know,” he said.\n\nRetailers that offered at least 40% off drove shoppers’ attention, according to Brown. For example, Forever 21 had 50% to 70% discounts and had lines to the stores, while H&M, which offered 30% discounts, was relatively quiet.\n\nEnough consumers still enjoy holiday shopping in person that Black Friday nonetheless was expected to retain its crown remains the biggest day of the year for retail foot traffic in the U.S., according to retail technology company Sensormatic Solutions.\n\nAt Macy’s Herald Square in Manhattan, the setting for the 1947 Christmas movie “Miracle on 34th Street,” a steady stream of shoppers early Friday found some shoes and handbags priced half-off, special occasion dresses marked down by 30%, and 60% off the store’s luxury bedding brand.\n\nKeressa Clark, 50, and her daughter Morghan, 27, who were visiting New York from Wilmington, North Carolina, arrived at 6:15 a.m.\n\n“I am actually shocked to see so many Black Friday deals because so many things are online,” Morghan Clark said.\n\nKaressa Clark, who works as a nurse practitioner, said President-elect Donald Trump’s pending return to the White House made her feel better about the economy. She plans to spend $2,000 this holiday season, about $500 more than a year ago.\n\nJulie Rambo, a retired school teacher, shoved aside her worries about the incoming Trump administration as she shopped with her grandchildren at the Target in Southfield, Michigan.\n\nRambo, 74, said she was “totally, completely scared of tariffs because I’m still going to need an automobile,” but it was a problem to confront later. As she does each year, she was primarily looking for Christmas gifts through a prison ministry for children with parents who are incarcerated.\n\n“As we’re shopping, we find things for ourselves too,” Rambo said.\n\nOnline sales figures from Thanksgiving Day gave retailers a reason to remain hopeful for a lucrative end to the year.\n\nVivek Pandya, the lead analyst at Adobe Digital Insights, said consumers spent a record $6.1 billion online Thursday, 8.8% more than on Thanksgiving last year. Bigger-than-expected discounts helped spur spending on electronics, apparel and other categories, Pandya said.\n\nAcross the board, Black Friday weekend discounts should peak at 30% on Cyber Monday and then retreat to around 15%, according to Adobe’s research.\n\nAnalysts forecast a solid holiday shopping season overall in the U.S., though perhaps not as robust as last year. Retailers were even more under the gun to get shoppers in to buy early and in bulk since there are five fewer days between Thanksgiving and Christmas this year.\n\nShoppers at Lakeside Shopping Center in Metairie, Louisiana, were treated to a glass of champagne and a $50 gift receipt.\n\n“This is a nice touch. I was just talking to my best friend and rehashing over Thanksgiving so this was a nice little treat after that conversation. Everyone needs a little drink,” said Faren Kennedy, a Houston resident who was in town visiting family and wanted to stop at the mall for the nostalgia of Black Friday shopping.\n\nAt Mall of America in Bloomington, Minnesota, some 13,000 people showed up the first hour of its 7 a.m. opening, roughly 1,000 more than a year ago, according to Jill Renslow, the mall’s chief business development and marketing officer.\n\nThe mall was on target to exceed the 200,000 Black Friday customer visits it received in 2023, Renslow said. Stores with deep discounts and promotions were the most packed, she said, citing Lego’s giveaway of a free retro record player with a $250 purchase.\n\nStephen Lebovitz, CEO of CBL Properties, which operates 85 shopping properties, and Bill Taubman, president and chief operating officer of upscale mall landlord Taubman Realty Group, also said customer visits were up.\n\nBlack Friday no longer is an American-only sales event. Retailers in Australia, Canada, France, Germany and the U.K. also appealed to holiday shoppers looking to save money.\n\nIn India, about 200 Amazon warehouse workers and delivery drivers, rallied Friday in New Delhi, some wearing masks of Amazon chief Jeff Bezos, to demand better wages and working conditions. Similar protests were planned in other countries.\n\n-- Anne D’Innocenzio, Haleluya Hadero and Alexandra Olson, The Associated Press\n\nStephen Smith and Corey Williams contributed to this report.","summary":"Businesses are trying to make the most of a short holiday shopping season brought by this year's late Thankgiving.","url":"https://www.oregonlive.com/business/2024/11/retailers-offer-big-black-friday-deals-to-coax-inflation-weary-shoppers.html","image":"https://www.oregonlive.com/resizer/v2/DKJYIR54IBGBDKYHC522AKL4TY.jpg?auth=efd0d7159a5c3170857b7e61bc02b53c9297127ce4cad969bf47e1512c26f005&width=1280&quality=90","video":null,"publish_date":"2024-11-29 23:44:38","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.062}]}