{"offset":0,"number":50,"available":18048,"news":[{"id":297902370,"title":"Science at a crossroads: Dispatches from Friday's 'Stand Up for Science' rallies across the US","text":"Since the inauguration of President Donald Trump on Jan. 20, a number of actions aimed at slashing federal science spending and restricting research topics have begun to worry the American scientific community.\n\nThese include firing many — then rehiring some — staff across major science agencies, as well as holding up over a billion dollars in federal funding and triggering a pause in graduate admissions and faculty job postings at universities. Executive orders prompted the flagging of research projects for review based on whether they contain words like \"female\" or \"gender,\" and scrubbing peer-reviewed papers from agency websites if they conflict with the current administration's policy priorities.\n\nIn response, scientists have begun to mobilize. On her Bluesky feed, Colette Delawalla, a graduate student in clinical psychology at Emory University in Atlanta, posted on Feb. 9 simply, \"Get in Dorks, we are going protesting.\"\n\nDelawalla is the lead organizer of Stand Up for Science, a grassroots movement with three main policy goals: to end political interference in science, to secure science funding, and to defend diversity, equity, inclusion and accessibility in science.\n\nRelated: Trump executive order calls mental health prescriptions a 'threat' — why?\n\nOn Friday (March 7), people in more than two dozen cities across the U.S. attended Stand Up for Science rallies. The main rally was held in D.C., with speakers like Bill Nye slated to talk, and 31 other cities held their own events.\n\nLive Science reported from two of these locations — New York City and Raleigh, North Carolina — to learn more about what science supporters want from the U.S. government.\n\nIn New York City\n\nHundreds of rally attendees assembled in Washington Square Park in Manhattan under a bright-blue sky, although they occasionally had to grasp their signs tightly as they were buffeted by gusts of strong wind.\n\nThe crowd represented a wide range of age groups and vocations. Young children teetered on their caregivers' shoulders, high schoolers hoisted homemade cardboard signs, members of professional groups crowded together for a group photo in front of the square's iconic arch, and prominent professors stood alongside members of state government.\n\nAmong the clever and emphatic signage was the giant head of the beloved Muppets character Beaker, worn by an attendee affiliated with the Zuckerman Institute at Columbia University.\n\nAlthough many attendees were scientists, not all were.\n\n\"I think all expertise is under attack. That's really why I'm here,\" said Randi from Brooklyn, a retiree who previously worked in construction and asked that her last name not be used. \"When you undermine expertise, then nobody knows what the facts are.\" She said she \"had to come out\" to the event after she heard that the Centers for Disease Control and Prevention was telling scientists to scrub their research papers of \"words that might cause trouble.\"\n\n\"I think they're going after experts of all kinds, trying to bankrupt them so that eventually functions that scientists do will all be privatized,\" Randi told Live Science.\n\nTwo young attendees, Caitlin and Amalia, who declined to give their last names, held up signs reading, \"Science is for everyone\" and \"Girls just wanna have fun-ding for research.\" In regard to the recent developments in the federal government, Amalia, a high-school senior who plans to major in biology in college, said, \"I'm just kind of in awe — shock — that this is all going on.\"\n\nAmong the medical providers in attendance was Dr. Michelle Ng Gong, secretary of the American Thoracic Society (ATS), a medical society dedicated to accelerating the advancement of global respiratory health. The work of ATS is aimed at preserving lung health, in terms of both caring for patients and understanding factors that affect lung health, such as climate change and pollution, Gong said.\n\nCutting National Institutes of Health (NIH) funding for diverse research teams and studies that aim to meet the needs of all patients is \"basically gambling on our futures,\" she emphasized.\n\n\"Scientists have always tried to speak through our work, and our publications,\" she added. \"But now I think we need to do a better job of communicating overall the impact that science has on day-to-day life.\"\n\nThat point was driven home by the chant \"Science, not silence,\" which the crowd called out between the speakers featured at the rally. When asked to raise their hands if their work relies on federal research funding, the majority of the crowd reached to the sky.\n\nAmong the formal speakers at the rally was Dr. Claire Pomeroy, president and CEO of the Lasker Foundation, which gives out the coveted Lasker Awards for biomedical research. She spoke of her experience during the HIV/AIDS epidemic, when she couldn't offer patients solutions; she could only hold their hands and attend their funerals. Science changed that — now, people with HIV can lead long, prosperous lives, and the infection can be prevented with powerful medications.\n\nAttacks on science put those kinds of breakthroughs in jeopardy, Pomeroy emphasized. She encouraged those gathered to stay informed and keep their networks outside science in the loop, as well. \"We have to spread the message beyond this crowd,\" Pomeroy said.\n\nJosh Dubnau, a Stony Brook University professor who studies ALS and other neurodegenerative disorders, underscored the wide range of jobs that NIH funding supports — tens of thousands of jobs in New York State, alone, he said. He called the funding cuts and firings orchestrated by the Department of Government Efficiency (DOGE) and other federal actors a \"planned and coordinated assault\" on science, as well as on America's education system.\n\nDubnau urged the rally attendees to band together in response, not stay silent in an attempt at self preservation.\n\nAdditional speakers included Griffin Gowdy, a biomedical researcher with Scientists Rebellion, a collective calling for action to address the climate crisis, who encouraged attendees to start or join organizations assembling on behalf of the scientific enterprise.\n\n\"Like a burning Tesla battery that not even Poiseden himself could put out, we will never stop fighting for what's right,\" Gowdy quipped.\n\nSeveral New York politicians also stepped to the microphone, including state Assemblymember Harvey Epstein and state Sen. Brad Hoylman-Sigal.\n\nEpstein, who also teaches an environmental law clinic at CUNY Law School, acknowledged there will be cuts to federal funding but called on the crowd to collectively stand up to \"bullies in the White House\" despite that.\n\nHoylman-Sigal condemned Department of Health and Human Services Secretary Robert F. Kennedy Jr. for claiming measles can be cured with vitamin A and fish oil amid the ongoing outbreak in Texas and said it's \"not right\" that anyone is dying from vaccine-preventable diseases.\n\nTo conclude his talk, Hoylman-Sigal also thanked scientists for their role in making it so that HIV is no longer a death sentence; as a gay man, Hoylman-Sigal was grateful for the lives HIV drugs have spared within the LGBTQ+ community.\n\nA crowd of around 500 people gathered slowly but steadily on Halifax Mall, a block from the state capitol building and the North Carolina Museum of Natural Sciences. A stiff wind blew posters willy-nilly as people listened to speakers, including Jamie Vernon, the executive director of Sigma Xi, the scientific honor society headquartered in North Carolina's \"Research Triangle.\"\n\nProtest leaders encouraged the gathering of young, mid-career and retired scientists and supporters to take occasional \"warm-up breaks\" while chanting phrases like \"What do we want? Science! When do we want it? Now!\" and \"Vaccines are awesome, imagine if we lost 'em.\"\n\nToxicologist Noelle Muzzy told Live Science that she organized the Raleigh Stand Up for Science rally because \"in one sentence: science is under attack.\"\n\nThe executive orders affecting funding, federal jobs and censorship were at the forefront for Muzzy. \"All of that is limiting what we can do as researchers. That's very concerning, not just for career scientists but also for the general public,\" she said, adding that \"we're going to be losing access to new technology that could save lives and produce medical treatments as well.\"\n\nBut the general tenor of the Raleigh event was optimistic, even as many signs satirized the language that President Trump and Elon Musk in particular have used recently to denigrate science they deem worthless, such as \"Transgender ≠ Transgenic.\"\n\n\"I'm here because I support science in every way, shape and form. Not only for myself and my colleagues personally, but for everyone because science is, in fact, for everyone,\" McKenzie Gehris, a graduate student in pharmacology at the University of North Carolina at Chapel Hill, told Live Science. She had a poster of the muppet Beaker that read, \"This is the only orange muppet I trust to tell me about science.\"\n\n\"The research that scientists do across the country helps cure diseases, helps figure out things about our climate and the world that we live in,\" Gehris said. \"It's important that we fund that sort of research.\"","summary":"Our science journalists reported on the Stand Up for Science rallies held in New York City and Raleigh, North Carolina.","url":"https://www.livescience.com/human-behavior/politics/science-at-a-crossroads-dispatches-from-fridays-stand-up-for-science-rallies-across-the-us","image":"https://cdn.mos.cms.futurecdn.net/EAUUF24BAEpyQrajpKsVyS.jpg","video":null,"publish_date":"2025-03-08 00:44:46","author":"Kristina Killgrove,Nicoletta Lanese","authors":["Kristina Killgrove","Nicoletta Lanese"],"language":"en","source_country":"us","sentiment":0.01},{"id":297902268,"title":"Trump administration to drop case against plant polluting Louisiana’s ‘Cancer Alley’","text":"The Donald Trump administration has formally agreed to drop a landmark environmental justice case in Louisiana’s “Cancer Alley” region, marking a blow to clean air advocates in the region and a win for the Japanese petrochemical giant at the centre of the litigation.\n\nLegal filings made public on Friday morning reveal that Trump’s Department of Justice agreed to dismiss a long-running lawsuit against the operators of a synthetic rubber plant in Reserve, Louisiana, which is allegedly largely responsible for some of the highest cancer risk rates in the US for the surrounding majority-Black neighborhoods.\n\nThe litigation was filed under the Biden administration in February 2023 in a bid to substantially curb the plant’s emissions of a pollutant named chloroprene, a likely human carcinogen. It had targeted both the current operator, the Japanese firm Denka, and its previous owner, the American chemical giant DuPont, and formed a central piece of the former administration’s Environmental Protection Agency (EPA) efforts to address environmental justice issues in disadvantaged communities. A trial had been due to start in April 2025 following lengthy delays.\n\nCommunity leaders in Reserve had expressed grave concerns about the case’s future following Trump’s return to the White House after the president moved to gut offices within the EPA and justice department responsible for civil rights and environmental justice.\n\nOn Friday, 84-year-old Robert Taylor, a resident in Reserve who has lost a number of family members to cancer, described the move as “terrible” for his community.\n\n“It’s obvious that the Trump administration doesn’t care anything for the poor Black folk in Cancer Alley,” Taylor said. “[Trump’s] administration has taken away what protections we had, what little hope we had.”\n\nFilings show that parties involved in the litigation, including lawyers for Denka and DuPont, met on Wednesday and agreed jointly with the US justice department to dismiss the case.\n\nIn a statement released on Friday evening, the justice department said the dismissal was made in compliance with an executive order issued by Trump targeting “wasteful government” and “DEI programs” aimed to “eliminate ideological overreach and restore impartial enforcement of federal laws”.\n\nThe department claimed Biden’s EPA had overreached by utilizing the Clean Air Act’s emergency powers authority and had not alleged the plant had violated “any regulatory air quality standard”.\n\n“We do not regulate through litigation, nor do we stretch statutes beyond their plain meaning to advance political agendas,” said Adam Gustafson, acting assistant attorney general.\n\nThe EPA’s longterm exposure limit for chloroprene is 0.2 micrograms per cubic meter. Air monitoring around the plant has frequently shown readings dozens over times about this threshold.\n\nA spokesperson for Denka did not respond to questions from the Guardian but issued a statement thanking the Trump administration and lauding Louisiana’s Republican governor, Jeff Landry, for his “unwavering support”.\n\nThe chemical firm pointed to a $35m investment in emissions offsets and said “the facility’s emissions are at an historical low”. The company “remains committed to implementing the emissions reductions achieved as we turn the page from this relentless and draining attack on our business”, the statement added.\n\nAccording to the complaint filed in 2023, emissions from the plant pose “an imminent and substantial endangerment to public health and welfare”. The lawsuit had specifically singled out the risk to children living near the plant and those attending an elementary school situated close to the plant’s fence line. It noted that average readings at an air monitor near the school between April 2018 to January 2023 showed that those under 16 could surpass the EPA’s excess cancer risk rate within two years of their life.\n\nOn Friday, Taylor vowed to continue pushing back against pollution.\n\n“We are going to fight them and prepare ourselves to keep going. We were preparing for the worst, and I don’t know how it could get any worse now that the government has totally abandoned us, it seems.”\n\nDuPont did not immediately respond to a request for comment.","summary":"Biden-era suit sought to curb emissions of the carcinogen chloroprene at Denka plant formerly owned by DuPont\n\nThe Donald Trump administration has formally agreed to drop a landmark environmental justice case in Louisiana’s “Cancer Alley” region, marking a blow to clean air advocates in the region and a win for the Japanese petrochemical giant at the centre of the litigation.\n\nLegal filings made public on Friday morning reveal that Trump’s Department of Justice agreed to dismiss a long-running lawsuit against the operators of a synthetic rubber plant in Reserve, Louisiana, which is allegedly largely responsible for some of the highest cancer risk rates in the US for the surrounding majority-Black neighborhoods.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/mar/07/trump-cancer-alley-plant-biden-lawsuit","image":"https://i.guim.co.uk/img/media/e41f8320cefdaac771a3cdaadbbbe7f0cef82fac/0_625_9520_5711/master/9520.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-03-08 00:42:38","author":"Oliver Laughland","authors":["Oliver Laughland"],"language":"en","category":"politics","source_country":"us","sentiment":-0.512},{"id":297902896,"title":"Trump says he sent Iran leader letter urging nuclear talks","text":"U.S. President Donald Trump wrote this week to Iran’s leadership urging the country to negotiate a new nuclear deal, days after it emerged that Tehran’s atomic activities have surged. 'I’ve written them a letter saying I hope you negotiate, because if we have to go in militarily, it’s going to be a terrible thing for them,” Trump told Fox’s Maria Bartiromo in an interview that aired Friday, when asked if he had written to Supreme Leader Ayatollah Ali Khamenei. Trump said that while he isn’t ruling out a military intervention, he would 'rather negotiate a deal.”","summary":"Trump said that while he isn’t ruling out a military intervention, he would \"rather negotiate a deal.”","url":"https://www.japantimes.co.jp/news/2025/03/08/world/politics/trump-iran-leader-letter-nuclear-talks/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/03/08/456086.jpg?v=3.1","video":null,"publish_date":"2025-03-08 00:41:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.873},{"id":297902096,"title":"\"We're Coming Up To Get You\" Trump's Shout-Out To Stranded NASA Astronauts Being Rescued By SpaceX","text":"Last Updated:March 08, 2025, 06:10 IST Crux India\n\nPresident Donald Trump told stranded NASA astronauts Sunita Williams and Butch Wilmore that they would soon be brought back to Earth after nine months at the International Space Station (ISS). While referring to Williams, Trump said \"And I see the woman with the wild hair, good, solid head of hair she's got. There's no kidding, there's no games with her hair.\" Trump also took a dig at the Biden administration, \"You shouldn’t have been up there so long. The most incompetent president in our history has allowed that to happen to you, but this president won’t let it happen.” n18oc_world n18oc_crux","summary":"President Donald Trump told stranded NASA astronauts Sunita Williams and Butch Wilmore that they would soon be brought back to Earth after nine months at the International Space Station (ISS). While referring to Williams, Trump said \"And I see the woman with the wild hair, good, solid head of hair she's got. There's no kidding, there's no games with her hair.\" Trump also took a dig at the Biden administration, \"You shouldn’t have been up there so long. The most incompetent president in our history has allowed that to happen to you, but this president won’t let it happen.” n18oc_world n18oc_crux","url":"https://www.news18.com/videos/world/we-re-coming-up-to-get-you-trump-s-shout-out-to-stranded-nasa-astronauts-being-rescued-by-spacex-9253600.html","image":"https://images.news18.com/ibnlive/uploads/2025/03/1741394402_8b634f31-5a2d-49fe-bb7a-b90c73182b20.jpeg","video":null,"publish_date":"2025-03-08 00:40:08","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":-0.243},{"id":297903410,"title":"Pressure on Trump to push for Puerto Rico’s independence in order to save $617 billion for America","text":"Donald Trump is being lobbied to make Puerto Rico an independent nation and save American taxpayers $617.8 billion, DailyMail.com has learned.\n\nAt least two congressional offices are in possession of a seven-page draft ‘executive order’ on how the U.S. can help the island territory transition to independence.\n\nOne individual familiar with the document’s origins said at least two members of Congress have a copy of the draft, which DailyMail.com has obtained and reviewed.\n\nA source familiar with the document’s existence disclosed that it is also in the possession of Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard, White House Chief of Staff Susie Wiles, Rep. Tom McClintock (R-Calif.) and potentially other Cabinet secretaries. \n\nStaffers for the Senate Energy & Natural Resources Committee and a staffer for Rep. Tom Kean (R-N.J.) have already held or scheduled meetings about the draft executive order.\n\nThe committee has jurisdiction over issues relating to Puerto Rico and other U.S. territories. But committee officials did not reply to a request for comment.\n\nThe order appears to have been drawn up by a congressional office and leaders of Puerto Rico secessionist efforts, and not the White House.\n\nBut it is a clear effort to apply pressure on the White House to transition Puerto Rico out of its current status as a U.S. territory. \n\nTrump has not indicated that he wants to rid the U.S. of the territory.\n\nThe White House declined to comment on the draft order and appears to be unaware of its origins. \n\nAccording to the document, the effort seeks to establish the Caribbean island as a ‘sovereign and independent’ nation and in the process decouple its financial and security interests from those of the U.S.\n\nCopies of the proposed executive action has been circulating in a few Capitol Hill offices.\n\nSpokespeople for Gabbard and McClintock did not respond to DailyMail.com when asked about the drafted executive order. It’s also not clear how McClintock might be involved in the efforts. \n\nOne person familiar with the efforts said a field representative for Kean is aware of the document but did not reveal how the congressman or his staff might be involved.\n\nThe draft is made to look like an executive order and is written as though it were authored – or at least authorized – by Trump.\n\nIt includes a line for ‘Donald J. Trump’ to add his signature, and a March 2025 date with the day left as a blank.\n\nAmid a myriad of Trump’s shake-ups, including cutting thousands of jobs, billions in contracts and entire agencies, the draft seeks to cut the fat off the U.S. budget that’s allocated to the island territory.\n\nIt also comes amid outrage over Trump seeking to establish English as the official language of the U.S. – raising questions on what that means for the mostly-Spanish-speaking island.\n\nThe order, if ever adopted, would establish a 21-month timeline for the end of birthright citizenship for Puerto Ricans.\n\nAny person born in Puerto Rico after December 31, 2026 would not be eligible for birthright citizenship, but anyone who was made a U.S. citizen through their birth in Puerto Rico before that date would retain their U.S. citizenship.\n\n‘This plan results in $617.8 billion in savings for the U.S. while providing Puerto Rico with the necessary resources for economic self-sufficiency,’ the draf proposal notes.\n\nThe draft notes how Washington is projected to spend $1.37 trillion over the next 50 years in supporting Puerto Rico – in addition to up to $8.6 billion in disaster relief.\n\nShould Trump adopt the action proposed in the document, there would be a decades-long plan to give Puerto Rico $36 billion every year for 20 years in a so-called Puerto Rico Transition Fund. It would over the next two decades ‘facilitate Puerto Rico’s successful transition to independence.’\n\n‘This plan results in $617.8 billion in savings for the U.S. while providing Puerto Rico with the necessary resources for economic self-sufficiency,’ the draft proposal notes.\n\nHomeland Security Secretary Kristi Noem visited Puerto Rico last week during her first visit to the U.S. territory as part of Trump’s Cabinet.\n\nShe pledged to help Puerto Rico as it struggles to rebuild from catastrophic hurricanes amid chronic power outages.\n\nFEMA has been funding much of the reconstruction after Hurricane Maria hit the island as a Category 4 storm in September 2017. But Puerto Rico Gov. Jennifer González said the agency has not released $18 billion slated for the power grid.\n\nThe executive order proposal would establish the Executive Transition Commission (ETC), which would oversee Puerto Rico’s change from territory to sovereign nation.\n\n‘The Executive Transition Commission will operate as part of the White House staff, in coordination with Congress on matters that require legislation,’ it details.\n\n‘It will have an Administrator appointed by the President who will be responsible for the oversight, administrative and legislative functions of the Government of Puerto Rico in furtherance of the objectives of this Order. Additionally, the Administrator will use all the federal funds allocated for the orderly transition of the Island towards independence and socioeconomic self-sustainability.’\n\nThe line for the name of the person Trump would appoint as the ETC Administrator remains blank on the drafted file.\n\nBut the proposal does note: ‘The Administrator shall be a Puerto Rican National domiciled in Puerto Rico and shall not be or have been a member of the Government of Puerto Rico.’\n\nThere is a growing rift on the island among those who want to secede from the U.S. and those Puerto Ricans who want to be a U.S. state in order to gain more rights. In nearly every recent election, statehood has been on the ballot in Puerto Rico.\n\nWhile the secession movement has gained traction, it is still widely unpopular compared to the number of the population who want to be a state or even just remain a territory.\n\nOf the votes on the non-binding voter preference measure in 2024, 58 percent say they want statehood while only 11 percent sought independence.\n\nTrump would, however, make the decision for the people of the island with the stroke of a pen.\n\n‘Rather than perpetuating indefinite territorial dependence, this approach eliminates wasteful spending, establishes a clear exit strategy, and redirects federal resources toward national priorities and domestic programs,’ the seven-page paper reads.\n\n‘This solution ensures Puerto Rico’s successful transition to sovereignty while upholding an America First policy,’ it notes.\n\nThe executive director of the Puerto Rico Federal Affairs Administration Gabriella Boffelli said in a statement that there is ‘no evidence’ that there is a plot to free Puerto Rico.\n\n‘There is no evidence to support these allegations. Any insinuation about a secret plan to force Puerto Rico’s independence is completely false and only seeks to misinform and divert attention from the real problem: our status.’\n\nPuerto Rico’s Secretary General of the Puerto Rico Independence Party Juan Dalmau called the report an ‘interesting development.’\n\nHe called for the ‘de-colonization’ of the state to be a ‘democratic’ process. \n\nDuring Trump’s rally at Madison Square Garden in October, comedian Tony Hinchcliffe made a joke calling Puerto Rico a ‘floating island of garbage,’ which liberals tried to use to mobilize Hispanic voters against the Republican candidate.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump is being lobbied to make Puerto Rico an independent nation&#8230;\n\n\nThis Post: Pressure on Trump to push for Puerto Rico&#8217;s independence in order to save $617 billion for America first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/pressure-on-trump-to-push-for-puerto-ricos-independence-in-order-to-save-617-billion-for-america/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Trump-pressured-to-make-Puerto-Rico-independent.jpg","video":null,"publish_date":"2025-03-08 00:33:58","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.318},{"id":297903346,"title":"World News | Trump Will Lead Task Force Preparing for 2026 World Cup","text":"Washington, Mar 8 (AP) President Donald Trump created a task force Friday to prepare for the 2026 World Cup, which will bring the globe's premier soccer tournament to North America at a time when his on-again, off-again tariffs have ratcheted up tensions across the continent. “I think it's going to make it more exciting,” Trump said of playing the World Cup amid sharp rhetoric between leaders of the host nations. “Tension's a good thing.” Also Read | Famous Birthdays on March 8: Harmanpreet Kaur, Benny Blanco, Vasundhara Raje and Fardeen Khan - Know About Celebrities and Influential Figures Born on March 8. The task force, which Trump will chair, will coordinate the federal government's security and planning for the tournament, which is expected to draw millions of tourists to the United States, Canada and Mexico. “It's a great honour for our country to have it,” Trump said of the World Cup after meeting with officials from FIFA, the international soccer governing body. He said he'd like to attend multiple games. Also Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'. Preparations are ramping up across the continent alongside tensions between the United States and its neighbours as Trump has repeatedly threatened to impose tariffs before backing off, spooking markets and leading to fears of a trade war and economic downturn. He also speaks pejoratively of Canadian Prime Minister Justin Trudeau and muses about Canada becoming a US state, which has boosted national pride north of the border. For 2026, the World Cup will expand to 48 teams playing 104 matches across three nations, the first time the tournament will be split between countries. Seventy-eight of 104 matches will be played in the US, with 13 games each in Mexico and Canada, and as many as six matches a day. The final will be played July 19 at MetLife Stadium in New Jersey. FIFA President Gianni Infantino said the task force will ensure that each of the visitors who will travel from around the world “feels safe, feels happy and feels that we are doing something special.” “So we're here to create and to make the best show on the planet ever,” Infantino said. He gave Trump a personalised game ball and unveiled an elaborate trophy that will go to the winner of the 2025 FIFA Club World Cup, which will pit top soccer clubs against each other this summer ahead of next year's matchup of national teams. Trump later brought Infantino to show off the trophy at the start of a White House cryptocurrency summit. The United States, where soccer has grown in popularity but remains a niche sport, represents a major growth area for soccer, he said. Infantino likened producing the World Cup to holding three Super Bowls daily for a month, a dizzying security and logistical challenge for the host governments. The Trump administration will face a second test on the global sports stage in 2028, when the summer Olympics will be held in California, the first time the Games will have been in the US since Salt Lake City hosted in 2002. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump created a task force Friday to prepare for the 2026 World Cup, which will bring the globe's premier soccer tournament to North America at a time when his on-again, off-again tariffs have ratcheted up tensions across the continent.","url":"https://www.latestly.com/agency-news/world-news-trump-will-lead-task-force-preparing-for-2026-world-cup-6694664.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-08 00:32:08","author":null,"language":"en","source_country":"in","sentiment":0.847},{"id":297903360,"title":"World News | Trump Warns Russia of Sanctions, Tariffs Until Ukraine Ceasefire Deal Reached","text":"Washinton, DC [US], March 8 (ANI): US President Donald Trump has said he is \"strongly considering large-scale banking sanctions and tariffs\" on Russia until a \"ceasefire and a final peace settlement agreement\" with Ukraine is reached.\nHis statement comes after Moscow launched a massive drone and missile attack on Ukrainian energy and gas infrastructure on Thursday.\nAlso Read | Famous Birthdays on March 8: Harmanpreet Kaur, Benny Blanco, Vasundhara Raje and Fardeen Khan - Know About Celebrities and Influential Figures Born on March 8.\nIn a post on Truth Social on Friday, Trump wrote, \"Based on the fact that Russia is absolutely \"pounding\" Ukraine on the battlefield right now, I am strongly considering large-scale Banking Sanctions, Sanctions, and Tariffs on Russia until a Cease Fire and FINAL SETTLEMENT AGREEMENT ON PEACE IS REACHED.\"\n\"To Russia and Ukraine, get to the table right now, before it is too late,\" he added.\nAlso Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\nMeanwhile, according to Al Jazeera, Ukraine and the United States have indicated they will meet in Saudi Arabia next week to discuss a framework for ending Russia's war.\nZelenskyy said on Thursday he would travel to Saudi Arabia on Monday for a meeting with Saudi Crown Prince Mohammed bin Salman before bilateral talks with US officials.\nUS envoy Steve Witkoff confirmed he would meet Ukrainian officials in Saudi Arabia, signalling that he would discuss an \"initial ceasefire\" and a \"framework\" for a longer agreement, as per Al Jazeera.\nSaudi Arabia's Ministry of Foreign Affairs said the talks would take place in the Red Sea city of Jeddah.\nNotably, after a fiery exchange with his Ukrainian counterpart, Volodymyr Zelenskyy, on March 1, Trump suspended military aid and intelligence sharing with Kyiv.\nTrump used some strong words during his media interaction with Zelenskyy, telling the visiting leader that he \"does not have the cards\" and is not \"acting thankful\" for the support the United States has provided to Ukraine in its war with Russia, which began in February 2022.\nIn the explosive media interaction with Trump, Ukraine's President had emphasised the need for security guarantees and noted that the Russian President Vladimir Putin had continued with his actions against his country even during Trump's first term as President.\nUS Vice President JD Vance also expressed his disapproval of Zelenskyy's remarks, saying it is \"disrespectful to come to the Oval Office of the United States of America and attack the administration that is trying to prevent the destruction of your country.\"\nTrump emphasised the need for a deal to bring peace and prevent killings and told Zelenskyy, \"if you didn't have our military equipment, this war would have been over in two weeks\". (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  &quot;To Russia and Ukraine, get to the table right now, before it is too late,&quot; he added.","url":"https://www.latestly.com/agency-news/world-news-trump-warns-russia-of-sanctions-tariffs-until-ukraine-ceasefire-deal-reached-6694663.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307155032.jpg","video":null,"publish_date":"2025-03-08 00:30:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.001},{"id":297902884,"title":"Tiger Woods not in the field for The Players Championship in his final year of an exemption","text":"The decision was not surprising, especially when Woods said after a TMRW Golf League match earlier this week that it was only the third time he had played since his mother, Kultida, died suddenly on Feb. 4.\n\nTwo of those times were at TGL. The other was with President Donald Trump on Feb. 9. He also played in the Seminole Pro-Member on Monday.\n\n“This is the third time I’ve touched a club since my mom passed, so I haven’t really gotten into it,” Woods said Tuesday. “My heart is not into practicing right now. I have so many other things to do with the tour. Once I start probably feeling a little bit better and start getting into it, I’ll start looking at the schedule.”\n\nWoods, a two-time winner at The Players, has not played the PGA Tour’s flagship event since 2019. He tied for 30th, and a month later won the Masters for his fifth green jacket and his 15th major championship.","summary":"Tiger Woods is not in the field for The Players Championship next week at the TPC Sawgrass, the final year of his exemption from winning the 2019 Masters. The decision was not surprising, especially when Woods said after a TMRW Golf League match earlier this week that it was only the third time he had [&#8230;]","url":"https://torontosun.com/sports/golf/tiger-woods-not-in-the-field-for-the-players-championship-in-his-final-year-of-an-exemption","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/03/trump-2.jpg","video":null,"publish_date":"2025-03-08 00:29:58","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"sports","source_country":"CA","sentiment":-0.238},{"id":297903322,"title":"World News | India-Israel Hold Research Symposium on Financial Resilience and Inclusivity","text":"New Delhi [India], March 8 (ANI): The Israeli embassy partnered with Bennett University and the FICCI Ladies Organisation (FLO) to host a first-of-its-kind Research Symposium on financial literacy, investment behaviour, and gender at Federation House, New Delhi on Friday.\nAs per the official statement, the event stands as an innovative research initiative that sheds light on the intersection of financial literacy, technology, and policy in advancing economic inclusion, particularly for women and youth. Despite increasing digital access and economic growth, women's participation in financial markets remains a global challenge. The event served as a pioneering platform for experts, policymakers, and academics to discuss innovative solutions and foster international collaboration.\nAlso Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\nFares Saeb, Deputy Ambassador of Israel, emphasised the shared commitment of Israel and India to financial empowerment.\nHe said, \"Empowering women through financial literacy is not just an economic goal--it is a global necessity. Both Israel and India recognize the importance of ensuring that financial knowledge and investment opportunities are accessible to all, particularly women. By leveraging media, technology, and strong bilateral cooperation, we can build a more inclusive financial future where everyone has the tools to thrive.\"\nAlso Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nGauri D Chakraborty, Times School of Media and Chairperson, Bennett University Women Development Cell, highlighted the pivotal role of media in financial education and said, \"Academia -industry interface is the hallmark for a progressive approach to redefining education. Our attempt as media practitioners and research scholars is to probe meaning-making of 'agency' especially financial aspects of the empowerment discourse. The aim is to create strategic action-oriented outcomes from the symposium like modules which can be included in school and higher education curriculum on personal finance, technology adoption and access, investment prudence for women within the all-encompassing term of 'media and digital literacy.\"\nReinforcing the importance of industry leadership, Joyshree Das Verma, President of FICCI FLO, stressed the need for collective action: \"More than just understanding numbers, financial literacy equips women with the confidence and knowledge to make informed financial decisions, creating long-term benefits for themselves, their families, and society. At FLO, we are committed to bridging the gender gap in financial participation by fostering education, accessibility, and opportunities for women to become active investors and decision-makers. This symposium is a vital step toward building a more inclusive financial landscape--one where women have the tools to thrive, contribute, and lead. Investing in financial literacy programs for women is not just about individual empowerment; it is a strategic investment in the economic growth and social progress of our nation.\"\nAs per the statement, the conference featured a high-impact panel discussion on 'The Influence of Technology and Marketing on Democratising Investment Access for Women', where experts delved into the role of digital tools, media narratives, and policy frameworks in shaping financial inclusion.\nThe symposium underscored the commitment of India and Israel to fostering financial resilience and inclusivity through knowledge-sharing, technological innovation, and collaborative policymaking.\nThe statement underscored that as the world moves towards a more digital and interconnected economy, equipping women with financial skills remains a crucial step in building sustainable and equitable economic growth. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The symposium underscored India and Israel's commitment to fostering financial resilience and inclusivity through knowledge sharing, technological innovation, and collaborative policymaking.","url":"https://www.latestly.com/agency-news/world-news-india-israel-hold-research-symposium-on-financial-resilience-and-inclusivity-6694661.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307230742.jpg","video":null,"publish_date":"2025-03-08 00:28:19","author":null,"language":"en","source_country":"in","sentiment":0.529},{"id":297903364,"title":"World News | India-Russia Hold Foreign Office Consultations in Moscow","text":"Moscow [Russia], March 8 (ANI): Foreign Secretary Vikram Misri visited Moscow to hold bilateral Foreign Office Consultations with Russian Deputy Foreign Minister Andrey Rudenko on Friday, the Ministry of External Affairs (MEA) said in an official statement. During the consultations, the two sides reviewed the entire gamut of bilateral ties and also shared perspectives on regional and global issues of mutual interest. Also Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\nAs per the MEA, India and Russia took stock of progress on implementation of decisions taken at the 22nd Annual Summit held in Moscow in July 2024, the meeting in Kazan on the side-lines of the 16th BRICS Summit between PM Modi and Russian President Vladimir Putin, the 25th session of the India-Russia Intergovernmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation held in New Delhi in November 2024, and other high level engagements.\nNotably, during the visit, Foreign Secretary also held meetings with Maxim Oreshkin, Deputy Chief of Staff of the Russian Presidential Executive Office; Yury Ushakov, Aide to the Russian President; and Alexey Gruzdev, Deputy Minister of Industry and Trade.\nAlso Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nAs per the MEA, the last round of Foreign Office Consultations was held in New Delhi in November 2023.\nRussia has been a longstanding and time-tested partner for India. The development of India- Russia relations has been a key pillar of India's foreign policy.\nAs per the MEA, since the signing of the \"Declaration on the India-Russia Strategic Partnership\" in October 2000 (during the visit of President Putin), India-Russia ties have acquired a qualitatively new character with enhanced levels of cooperation in almost all areas, including political, security, defence, trade and economy, science & technology, culture, and people-to-people ties.\nThe bilateral relationship has remained strong and stable over 75 years.\nThe India-Russia partnership has been among the steadiest in the contemporary era with a shared commitment to a multipolar world as well to expand the engagement beyond the traditional military, nuclear and space cooperation.\nAccording to the MEA, in the past two years, the bilateral trade has expanded significantly, doubling the target of USD 30 billion set earlier for 2025. There are discussions on ways to increase exports from India as well as on developing new models of cooperation.\nBoth countries also look to strengthen inter-regional cooperation, especially with the Russian Far East and connectivity initiatives like the International North-South Transport Corridor, the Chennai-Vladivostok Eastern Maritime Corridor and the Northern Sea Route. There is a synergy between Russia's pivot to the East, its resource and technology and India's own flagship initiatives such as Atmanirbhar Bharat and Make in India, the MEA said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  During the consultations, the two sides reviewed the entire gamut of bilateral ties and also shared perspectives on regional and global issues of mutual interest.","url":"https://www.latestly.com/agency-news/world-news-india-russia-hold-foreign-office-consultations-in-moscow-6694656.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307220741.jpg","video":null,"publish_date":"2025-03-08 00:22:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.483},{"id":297903326,"title":"World News | India-Singapore Hold 18th Round of Foreign Office Consultations","text":"New Delhi [India], March 8 (ANI): India and Singapore held the 18th round of Foreign Office Consultations (FOC) in Singapore on Friday, the Ministry of External Affairs said in an official statement. As per the MEA, the Indian delegation was led by Jaideep Muzumdar, Secretary (East), Ministry of External Affairs, and the Singapore side was headed by Luke Goh, Permanent Secretary, Ministry of Foreign Affairs.\nAlso Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\nThe MEA noted that the co-chairs reviewed the entire gamut of India-Singapore bilateral and multilateral cooperation and exchanged views on regional and global matters of mutual interest. \"The discussion focused on the six pillars of cooperation (Digitalization, Skills Development, Sustainability, Healthcare & Medicine, Advanced Manufacturing and Connectivity), which were identified during the two rounds of India-Singapore Ministerial Roundtable for further strengthening bilateral cooperation\", the MEA said. Also Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nNotably, the discussion also covered bilateral cooperation in the areas of defence, trade, investments, culture and people-to-people exchanges. India and Singapore discussed the roadmap for implementation of the Comprehensive Strategic Partnership between India and Singapore, which was announced during the visit of PM Modi to Singapore in September 2024.\nAs India and Singapore celebrate the 60th anniversary of establishment of diplomatic relations this year, the MEA noted that the 18th meeting of this dialogue mechanism was timely for reviewing the progress of outcomes of recent high-level exchanges and to set the agenda of exchanges and cooperation for this special year.\nIt was noted that both the sides agreed to convene the next round of India-Singapore Foreign Office Consultations in India at mutually convenient dates.\nMEA said that during the visit to Singapore, Secretary (East) called on Minister for Foreign Affairs Vivian Balakrishnan, had a meeting with Beh Swan Gin, Permanent Secretary, Ministry of Trade and Industry and also interacted with scholars and academics at an interaction organised by the Institute of South Asian Studies, National University of Singapore. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  &quot;The discussion focused on the six pillars of cooperation (Digitalization, Skills Development, Sustainability, Healthcare &amp; Medicine, Advanced Manufacturing and Connectivity), which were identified during the two rounds of India-Singapore Ministerial Roundtable for further strengthening bilateral cooperation&quot;, the MEA said.","url":"https://www.latestly.com/agency-news/world-news-india-singapore-hold-18th-round-of-foreign-office-consultations-6694654.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307205707.jpg","video":null,"publish_date":"2025-03-08 00:20:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.106},{"id":297903362,"title":"World News | EAM Jaishankar Highlights 'focus' of Indian Consulate in Belfast","text":"Belfast [UK], March 8 (ANI): External Affairs Minister S Jaishankar said that the newly inaugurated Indian consulate in Belfast, a \"meeting point for the UK with the European Union\", will not only serve the growing diaspora but also help in exploring economic opportunities.\nIn an exclusive interview with ANI, Jaishankar highlighted the focus areas that the new consulate will serve.\nAlso Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\n\"I think the focus number one is to obviously serve the Indian community which is marked in thousands and growing. Focus number two is to explore the economic opportunities here and we see those opportunities increasing because our ties with the UK are deepening and this is also a meeting point in a way for the UK with the European Union. Focus number three is actually education and technology,\" the EAM said.\nHe highlighted the presence of a number of IT companies there and noted, \"We have an important university here, the Queen's University, which has decided to set up a presence in India.\"\nAlso Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nElaborating upon the region, Jaishankar said, \"This is a part of UK where there's a strong history of manufacturing. There's a lot of industry here. There's a shipbuilding activity here\".\nSpeaking about the factors which will benefit the India-UK relationship, EAM said, \"If the economic cooperation grows, travel becomes easier, the Indian community is assisted and education is increased, I think the benefits to the relationship are very obvious.\"\nHe made the remarks after inaugurating the new Consulate General of India in Belfast, Northern Ireland, on Friday. Earlie, in his inaugural address, the EAM noted that when looking around the world, it was very clear that the deepening of the relationship between India and the UK was evident.\n\"We could see the people of the Indian community also increasing in numbers, so it made great sense that after we came back into government to move very early to set up a consulate, and when we looked at the UK, we also looked a little bit ahead\".\n\"When we looked at the history of Belfast and this region... it made eminent sense to take the call\". \"We do think that we can use this consulate as a way of pursuing our twin engagements with the UK and Europe as a whole and of course very much in support of this region's aspirations and most of all in the service of our community\", he said in his concluding remarks. EAM S Jaishankar is on an official visit to the United Kingdom & Ireland from March 4 to March 9. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  After inaugurating the new Consulate General of India in Belfast, Northern Ireland, Jaishankar, in an exclusive interview with ANI,  highlighted the focus areas that the new consulate will serve.","url":"https://www.latestly.com/agency-news/world-news-eam-jaishankar-highlights-focus-of-indian-consulate-in-belfast-6694651.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307213033.jpg","video":null,"publish_date":"2025-03-08 00:16:19","author":null,"language":"en","source_country":"in","sentiment":0.468},{"id":297900638,"title":"Trump Says India Agreed To Cut Tariffs Following Reciprocal Tariffs Threat, Indian Businesses Prepare For The Potential Impact","text":"US President Donald Trump announced on Friday that India has agreed to reduce tariffs on American imports. The announcement comes days after Trump declared that the US would impose reciprocal tariffs on Indian goods starting April 2, citing India's \"unfair trade policies.\" The decision follows mounting pressure from the US administration, which has been vocal about its dissatisfaction with India's tariff structure.\n“India charges us massive tariffs. Massive. You can't even sell anything in India. They have agreed, by the way; they want to cut their tariffs way down now because somebody is finally exposing them for what they have done,” ANI quoted Trump as saying\nIndian Companies Prepare for Impact of Tariffs\n\"India charges us tariffs higher than 100 per cent, China’s average tariff on our products is twice what we charge them, and South Korea’s average tariff is four times higher. This is happening by friends and foes. The system is not fair to the US; it never was. On April 2, reciprocal tariffs kick in. Whatever they tax us, we will tax them,\" Trump said during his joint address to the US Congress. The speech marked his first address to Congress since taking office in January. Trump further quipped that he avoided making the announcement on April 1, to steer clear of April Fool's Day connotations.\nThe decision triggered widespread discussions among Indian companies, with businesses across sectors such as auto parts, consumer electronics, jewellery, and apparel strategising on mitigating potential risks. According to a report in The Economic Times, many Indian firms are actively engaging with American partners to ensure business continuity.\nUS Demands Near-Total Tariffs Removal\nReports suggest that the US recently asked India to remove tariffs on nearly all goods, excluding agricultural products. If accepted, the demand would require India to abandon its long-standing trade protections without receiving any reciprocal concessions. The proposal has added further complexity to the ongoing trade negotiations between the two countries.\nEarlier on Friday, US Secretary of Commerce Howard Lutnick addressed the issue at the India Today Conclave 2025. Lutnick, who is leading the US-India trade discussions, highlighted that India maintains some of the highest tariffs globally.\n\"I would like to point out that India has some of the highest tariffs in the world, which will necessitate a reassessment of the special relationship between India and the US,\" Lutnick said.\nGlobal Trade Tensions Escalate\nHe also proposed a macro-level approach to expedite the tariff negotiations. \"If the approach were to focus on individual products -- motorcycles, bourbon, and so on, it would take forever. However, given the sheer size of both India and the United States, the right strategy is to take a macro approach. That’s why we believe this can be accomplished,\" Lutnick explained.\nTrump's reciprocal tariff pledge follows the implementation of new 25 per cent tariffs on Canadian and Mexican imports, along with a doubling of duties on Chinese goods to 20 per cent. In response, the three largest trading partners of the US have announced retaliatory measures, escalating global trade tensions.\nAlso Read: Canada To Become US' 51st State? Trump Tells Trudeau To ‘Revise’ U.S.-Canada Border, End Treaty On Sharing Great Lakes","summary":"India has agreed to reduce tariffs on American imports, days after US President Donald Trump announced reciprocal tariffs on Indian goods starting April 2. The decision has prompted Indian businesses across key sectors to prepare for the potential impact on trade and operations.","url":"https://www.newsx.com/world/trump-says-india-agrees-to-cut-tariffs-following-reciprocal-tariffs-threat-indian-businesses-prepare-for-the-potential-impact/","image":"https://www.newsx.com/wp-content/uploads/2025/03/indian-tariffs-US-President-Donald-Trump-American-imports-Indian-Businesses-.webp","video":null,"publish_date":"2025-03-08 00:15:04","author":"Zubair Amin","authors":["Zubair Amin"],"language":"en","source_country":"in","sentiment":-0.296},{"id":297903350,"title":"World News | India- Bhutan Hold Meeting to Review Boundary-related Field Work","text":"New Delhi [India], March 8 (ANI): Indian and Bhutanese officials held a meeting in New Delhi from March 6 and 7 to review matters related to boundary-related field work, the Ministry of External Affairs (MEA) said\nThe two sides discussed the potential for technological and capacity-building collaboration relating to survey and boundary-related work, as per the priorities of both the nations, the MEA said in a release on Friday\nAlso Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\nBoth sides expressed satisfaction with the work completed by the respective field survey teams and other stakeholders on boundary-related field matters. They also finalised the work plan for the next three field seasons.\nThe Indian side was led by Surveyor General of India, Hitesh Kumar S Makwana, and the Bhutanese side was led by Dasho Letho T Tangbi, Secretary, International Boundaries, Royal Government of Bhutan.\nAlso Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nAs per the MEA, the meeting was held in a cordial and friendly atmosphere and is in keeping with the tradition of regular dialogues in all sectors of bilateral cooperation. Earlier in February, Bhutan Prime Minister Dasho Tshering Tobgay concluded his official visit to India from February 20-21. During this visit, he participated in the School of Ultimate Leadership (SOUL) conclave, which was inaugurated by Prime Minister Narendra Modi.\nAs per the statement by the MEA, during the visit, PM Tobgay had a meeting with Prime Minister Modi and other senior ministers and officials of the Government of India.\n\"The visit of the Prime Minister of Bhutan is in keeping with the tradition of regular high-level exchanges between India and Bhutan, a hallmark of the special partnership}\", the MEA had observed.\nIndia and Bhutan enjoy unique ties of friendship and cooperation underpinned by mutual trust, shared values, and utmost goodwill at all levels. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Both sides expressed satisfaction with the work completed by the respective field survey teams and other stakeholders on boundary-related field matters. They also finalised the work plan for the next three field seasons.","url":"https://www.latestly.com/agency-news/world-news-india-bhutan-hold-meeting-to-review-boundary-related-field-work-6694649.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307210201.jpg","video":null,"publish_date":"2025-03-08 00:14:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.241},{"id":297903378,"title":"Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitol","text":"MIAMI (AP) — A company owned by President Donald Trump sued Capital One on Friday, claiming the bank unjustifiably terminated over 300 of the Trump Organization’s accounts without cause in 2021, shortly after the Jan. 6 attack on the U.S. Capitol.\n\nThe suit was filed by the Donald J. Trump Revocable Trust and Eric Trump in Miami-Dade Circuit Court.\n\nThe Trump Organization claims the decision by Capital One to close the accounts was an attack on free speech and free enterprise. The suit also claims the decision was a response to Trump’s political views.\n\n“Capital One has not and does not close customer accounts for political reasons,” the company said in a statement.\n\nThe Trump Organization claims it suffered considerable financial harm and losses when Capital One notified them in March 2021 that accounts holding millions of dollars would be closed in three months. The lawsuit claims Capital One violated the law and the Trump Organization is seeking damages.\n\nThe account closures were announced about two months after Jan. 6, 2021, when a mob of several thousand Trump supporters attacked the U.S. Capitol in an attempt to stop lawmakers from certifying the 2020 election results, which named President Joe Biden as the winner.\n\nOther banks also stopped doing business with the Trump Organization around the same time, while the business and Trump family members were facing civil and criminal investigations.","summary":"The suit was filed by the Donald J. Trump Revocable Trust and Eric Trump in Miami-Dade Circuit Court.","url":"https://www.bostonherald.com/2025/03/07/trump-organization-capital-one/","image":"https://www.bostonherald.com/wp-content/uploads/2025/03/Capitol_Riot_Pardons_10482.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-08 00:14:16","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-1},{"id":297899932,"title":"Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitol","text":"MIAMI (AP) — A company owned by President Donald Trump sued Capital One on Friday, claiming the bank unjustifiably terminated over 300 of the Trump Organization’s accounts without cause in 2021, shortly after the Jan. 6 attack on the U.S. Capitol.\n\nThe suit was filed by the Donald J. Trump Revocable Trust and Eric Trump in Miami-Dade Circuit Court.\n\nThe Trump Organization claims the decision by Capital One to close the accounts was an attack on free speech and free enterprise. The suit also claims the decision was a response to Trump’s political views.\n\n“Capital One has not and does not close customer accounts for political reasons,” the company said in a statement.\n\nThe Trump Organization claims it suffered considerable financial harm and losses when Capital One notified them in March 2021 that accounts holding millions of dollars would be closed in three months. The lawsuit claims Capital One violated the law and the Trump Organization is seeking damages.\n\nThe account closures were announced about two months after Jan. 6, 2021, when a mob of several thousand Trump supporters attacked the U.S. Capitol in an attempt to stop lawmakers from certifying the 2020 election results, which named President Joe Biden as the winner.\n\nOther banks also stopped doing business with the Trump Organization around the same time, while the business and Trump family members were facing civil and criminal investigations.","summary":"The suit was filed by the Donald J. Trump Revocable Trust and Eric Trump in Miami-Dade Circuit Court.","url":"https://www.sandiegouniontribune.com/2025/03/07/trump-organization-capital-one/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/03/Capitol_Riot_Pardons_10482.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-08 00:14:16","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-1},{"id":297901224,"title":"National Weather Service Suspending Critical Weather Tool Sparks Concerns","text":"Meteorologists are warning that cancelled weather balloon launches due to National Weather Service (NWS) staffing shortages could seriously impact \"critical\" weather forecasting abilities.Newsweek reached out for comment to the NWS via email on Friday evening.Why It MattersPresident Donald Trump has tasked Elon Musk and the so-called Department of Government Efficiency (DOGE) with dramatically reducing government spending. Trump, Musk and DOGE have faced heavy criticism for a series of controversial cost-cutting measures and mass firings at multiple federal agencies.The National Oceanic and Atmospheric Administration (NOAA), which includes the NWS, has has been severely impacted by the cuts, with hundreds of employees recently losing their jobs and thousands more at risk. Some critical NOAA facilities are also set to be shuttered due to the activities of DOGE.What To KnowA \"public information statement\" on the weather balloon launch suspensions was shared to the NWS website late on Friday afternoon. The statement announced that NWS was immediately \"temporarily suspending some weather balloon launches in Albany, New York, and Gray, Maine, due to a lack of Weather Forecast Office (WFO) staffing.\"Several meteorologists shared the statement and expressed alarm at the development a short time later on X, formerly Twitter.\"Effective immediately, @NWSAlbany& @NWSGray are suspending some weather balloon launches due to staffing shortages,\" wrote Pete Bouchard, chief meteorologist at NBC10 Boston. \"Weather balloon launches sample the upper atmosphere & provide critical input to our weather models.\"Jeff Berardelli, the chief meteorologist at Tampa Bay NBC affiliate WFLA, suggested that the development indicated that weather forecasting abilities were moving \"backwards.\"\"Holy cow. Folks, one of the biggest reasons for forecast error is uncertain initial conditions due to lack of observations,\" Berardelli wrote. \"This is a huge setback for NOAA and weather forecasting overall because all models rely on this data. Do we want better or backwards?\"Cory Smith, a meteorologist for Spectrum News in Buffalo, New York, argued that news was evidence that the Trump administration's cuts to the NWS was causing \"local impacts.\"\"Cuts to the NWS now having local impacts,\" he wrote. \"Weather balloons are temporarily no longer launching from Albany due to staffing shortages. They provide very important data for models, but are also EXTREMELY USEFUL during winter wx and severe weather to real-time forecast events.\"The weather balloon suspensions, which may or may not be the direct result of the DOGE cuts, were not the only incident to recently cause concern among weather forecasters.A DOGE plan to cancel the lease on a facility that meteorologists call \"the nerve center for the entire weather enterprise in the United States\" just before tornado season also raised alarm bells this week.What People Are SayingLori Arguelles, NOAA's former director of strategic communication and partnerships, speaking about the impact of NOAA and NWS cuts in comments to Newsweek earlier on Friday: \"Every single person that I know and have spoken directly with are so deeply concerned about the American people, because the mission matters. What these people at NOAA do is incredibly impactful and important.\"Democratic Congressman Jared Huffman, in a statement on the NOAA layoffs late last month: \"People nationwide depend on NOAA for free, accurate forecasts, severe weather alerts, and emergency information. Purging the government of scientists, experts, and career civil servants and slashing fundamental programs will cost lives.\"What Happens NextThe Trump administration's cuts to federal agencies, including NOAA and the NWS, are likely to continue. It is unclear when, or if, the cancelled NWS weather balloon launches will resume.","summary":"Recent cuts to national weather forecasting infrastructure have inspired backlash against the Trump administration.","url":"https://www.newsweek.com/national-weather-service-suspending-critical-weather-tool-sparks-concern-2041552","image":"https://d.newsweek.com/en/full/2602988/nws-cutting-weather-balloons-sparks-alarm.jpg","video":null,"publish_date":"2025-03-08 00:12:54","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"US","sentiment":-0.312},{"id":297903352,"title":"World News | EAM Jaishankar Inaugurates New Indian Consulate in Belfast","text":"Belfast [UK], March 8 (ANI): External Affairs Minister S Jaishankar inaugurated the new Consulate General of India in Belfast, Northern Ireland, on Friday. He shared insights into how the inauguration of the Consulate came into being and how it will help cater to the needs of a growing diaspora.\nHe also said that India hope to conclude the free trade agreement with the UK and the European Union soon. \"We saw in Belfast a meeting place for our UK policy and our European policy. We could see this had a privileged access to both\", Jaishankar added.\nAlso Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\nIn his inaugural address, Jaishankar thanked the dignitaries present and shared how the Bharatiya Janta Party (BJP) gave \"a significant amount of attention to foreign policy and within that the welfare of the diaspora\". \"One reflection of that was to see where we needed new consulates to cater to the needs of a growing diaspora. That was a broad global objective\", he said. Also Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nThe EAM noted that when looking around the world, it was very clear that the deepening of the relationship between India and the UK was evident, and highlighted sectors such as the economy, technology, and people-to-people exchanges.\n\"We could see the people of the Indian community also increasing in numbers, so it made great sense that after we came back into government to move very early to set up a consulate, and when we looked at the UK, we also looked a little bit ahead\".\n\"When we looked at the history of Belfast and this region... it made eminent sense to take the call\". He shared that within a month and a half after the Modi government came to power again in 2024, he moved the proposal in the cabinet for the consulate to be set up.\n\"When I reflect on the potential of this consulate and what it can do, we can see that Belfast and this region has a great economic history\". He highlighted the shipbuilding industry and the presence of Indian IT companies and businesses. \"There is a lot we can see happening out of this consulate; at the same time, we do want it very much to be at the service of the Indian community.\"\nThe External Affairs Minister highlighted how diaspora welfare has been a priority of the government, and that is what the consulate will advance to do. \"We do think that we can use this consulate as a way of pursuing our twin engagements with the UK and Europe as a whole and of course very much in support of this region's aspirations and most of all in the service of our community\", he said in his concluding remarks. EAM S Jaishankar is on an official visit to the United Kingdom & Ireland from March 4 to March 9. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   &quot;We do think that we can use this consulate as a way of pursuing our twin engagements with the UK and Europe as a whole and of course, very much in support of this region's aspirations and most of all in the service of our community,&quot; he said.","url":"https://www.latestly.com/agency-news/world-news-eam-jaishankar-inaugurates-new-indian-consulate-in-belfast-6694643.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307203745.jpg","video":null,"publish_date":"2025-03-08 00:08:20","author":null,"language":"en","source_country":"in","sentiment":0.175},{"id":297903328,"title":"World News | France Begins Handing over Military Bases to Senegal","text":"Dakar (Senegal), Mar 8 (AP) France handed control of two military facilities to Senegal on Friday, beginning the formal process of withdrawing its military presence from the West African country amid its waning influence in the region. The handover follows the declaration by Senegal's President Bassirou Diomaye Faye late last year that all foreign troops would leave the country. Also Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'. “The French side handed over to the Senegalese side the facilities and housing in the Maréchal and Saint-Exupéry districts on Friday, March 7, 2025,\" the French Embassy in Senegal said in a statement Friday. “Located near the Hann Park, these districts were ready to be returned since the summer of 2024.” France set up a joint commission with Senegal last month to organise the withdrawal, and the French army recently announced it had dismissed 162 Senegalese who worked on military bases in Dakar. Also Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine. The French Embassy did not respond to an email late Friday seeking details on how many service members remain in Senegal. Senegal's new government has taken a hard-line stance on the presence of French troops as part of a larger regional backlash against what many see as the legacy of an oppressive colonial empire. France has faced opposition from some African leaders over what they described as a demeaning and heavy-handed approach to the continent. It has suffered setbacks in West Africa in recent years, including Chad, Niger and Burkina Faso, where French troops are no longer on the ground. France has said it is planning to sharply reduce its presence at all its bases in Africa except Djibouti, including the 350 French troops in Senegal. It has said it could instead provide defence training or targeted military support, based on needs expressed by those countries. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   France handed control of two military facilities to Senegal on Friday, beginning the formal process of withdrawing its military presence from the West African country amid its waning influence in the region.","url":"https://www.latestly.com/agency-news/world-news-france-begins-handing-over-military-bases-to-senegal-6694641.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-08 00:08:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.127},{"id":297897296,"title":"Muslim Nations Endorse Alternative To Trump's Gaza Takeover Plan","text":"The Organisation of Islamic Cooperation on Friday endorsed an Arab League counter-proposal to US President Donald Trump's controversial plan to take over Gaza and displace its residents, two ministers told AFP.The decision by the 57-member grouping came at an emergency meeting in Jeddah, Saudi Arabia, three days after the Arab League ratified the plan at a summit in Cairo.The Egyptian-crafted alternative to Trump's widely condemned takeover proposes to rebuild the Gaza Strip under the future administration of the Palestinian Authority.\"The emergency ministerial meeting of the Organisation of Islamic Cooperation adopted the Egyptian plan, which has now become an Arab-Islamic plan,\" Egyptian Foreign Minister Badr Abdelatty said, in comments echoed by his Sudanese counterpart.\"It is certainly a very positive thing,\" Abdelatty said.Trump triggered global outrage by suggesting the US \"take over\" Gaza and turn it into the \"Riviera of the Middle East\", while forcing its Palestinian inhabitants to relocate to Egypt or Jordan.At Tuesday's summit in Cairo, Arab leaders also announced a trust fund to pay for Gaza's reconstruction and urged the international community to back it.\"The next step is for the plan to become an international plan through adoption by the European Union and international parties such as Japan, Russia, China and others,\" Abdelatty said.\"This is what we will seek and we have contact with all parties, including the American party.\"However, the counter-proposal does not outline a role for Hamas, which controls Gaza, and was rejected by both the United States and Israel.The plan \"does not meet the expectations\" of Washington, State Department spokeswoman Tammy Bruce told reporters on Thursday.Trump's Middle East envoy Steve Witkoff gave a more positive reaction, calling it a \"good-faith first step from the Egyptians\".Rabha Seif Allam, of the Al-Ahram Center for Political and Strategic Studies in Cairo, said Egypt was seeking \"broad support\" for its proposal.\"This is an attempt to build a broad coalition that refuses the displacement\" of Palestinians from Gaza, she said.Trump's plan has already united Arab countries in opposition, with Saudi Arabia also hosting Arab leaders two weeks ago to discuss alternatives.The OIC also readmitted Syria, which was suspended in 2012 early in the civil war under Bashar al-Assad, following the long-time ruler's toppling in December.\"This decision represents an important step towards Syria's return to the regional and international communities as a free and just state,\" a Syrian foreign ministry statement said.","summary":"The Organisation of Islamic Cooperation on Friday endorsed an Arab League counter-proposal to US President Donald Trump's controversial plan to take over Gaza and displace its residents, two ministers told AFP.\nThe decision by the 57-member grouping came at an emergency meeting in Jeddah, Saudi Arabia, three days after the Arab League ratified the plan at a summit in Cairo.","url":"https://www.ibtimes.com/muslim-nations-endorse-alternative-trumps-gaza-takeover-plan-3765593","image":"https://d.ibtimes.com/en/full/4585679/oic-endorsed-arab-league-counter-proposal-us-president-donald-trumps-controversial-plan-take.jpg","video":null,"publish_date":"2025-03-08 00:06:12","author":"Haitham El-Tabei","authors":["Haitham El-Tabei"],"language":"en","category":"politics","source_country":"US","sentiment":-0.248},{"id":297897364,"title":"Blake Lively hit with Justin Baldoni protestor outside Another Simple Favor premiere at SXSW","text":"Black Friday\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nSaturday, Mar 8th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nGene Hackman and wife Betsy Arakawa's causes of death revealed\n\nBrad Sigmon is executed by firing squad for murdering his ex-girlfriend's parents... as his final meal is revealed\n\nBreathtaking extravagance of the most expensive Commons Speaker in history: 'Long-haul' Lindsay Hoyle blew £250k of your money on luxury travel - yet MPs are too timid to take him to task\n\nThe toxic girls' trip at 40 that meant I never spoke to my 'best friends' again\n\nI know Donald Trump. He might seem mad... but he has a secret plan. Underestimate him at your peril, writes NILE GARDINER\n\nFather-of-three who withdrew his eight-year-old from private school over Labour's tax raid says his son is being 'forced to leave his friends behind through no fault of his own'\n\nThe Beckhams have arrived! Harper, 13, is her mother's mini-me in a satin gown as she holds hands with father David while Romeo and Cruz step out with their girlfriends for Victoria's Paris Fashion Week show\n\nFrom a brilliant new Agatha Christie mystery to an early show from the creator of The White Lotus: The 20 best things to stream this weekend, picked by our TV experts\n\nNew photos offer rare glimpse of Elon Musk's Texas empire, where he keeps his favorite baby mama VERY close... as neighbors spill on how billionaire really lives\n\nElon Musk's social media platform X refused to hand over account details of hundreds of users in the wake of last summer's far right riots\n\nReform UK in meltdown as party ousts MP Rupert Lowe amid 'bullying' probe and 'violent threats' against their chairman... but he blasts 'vexatious' claims issued a day his clash with Nigel Farage\n\nBlake Lively is 'terrified' ahead of tonight's Another Simple Favor premiere, as insiders reveal why Anna Kendrick NEVER wants to work with her again\n\nAll that matters is my kids are happy: PADDY McGUINNESS reveals how his unique domestic set-up helps him support his autistic children - as well as how his old mates don't see him as a star\n\nRevealed: The 8 new emoji officially coming to your iPhone - including one face that EVERYONE will use\n\nALEX BRUMMER: Boots' uncertain fate adds to worries about our hollowed out High Streets\n\nEDEN CONFIDENTIAL: Lord Brocket daughter's fairytale marriage to prince falls apart\n\nHow hi-viz workmen digging up roads were in fact criminal gang stealing electricity worth millions to power more than 100 secret Albanian-run cannabis farms producing £21m of illicit drugs\n\nEngland legend Stuart Pearce, 62, suffers health scare on flight from Las Vegas as plane is forced to make emergency landing in Canada\n\nIconic 90s band known for smash hit song back in studio for first time in 31 years\n\nThe hunt for Interpol's most wanted: Puppet-master behind UK spy ring was recruited for Putin's intelligence network by erotic model, is wanted over £1.6bn Wirecard fraud and is now hiding out pretending to be a priest\n\nMarquess of Ailesbury, 98, who died after falling out of his bedroom window onto a patio at his west London home took his own life, coroner rules\n\nNatalie Portman shows 'cheating' ex what he's missing as she gets touchy feely with another famous French hunk\n\nSky Sports presenter reveals she has a brain infection following cancer battle as she provides health update from hospital bed - before sending heartwarming message to English manager boyfriend\n\n'Perfectly healthy' 33-year-old woman issues urgent warning after she almost died on long haul flight: 'It's a miracle I'm still alive'\n\nBlake Lively hit with Justin Baldoni protestor outside Another Simple Favor premiere at SXSW\n\nHave YOU got a story? Email tips@dailymail.com \nBy SARAH SOTOODEH and CHRISTINE RENDON FOR DAILYMAIL.COM \n Published:23:26 GMT, 7 March 2025 |Updated:00:05 GMT, 8 March 2025 \n\nOn Friday, Blake Lively attended the Another Simple Favor premiere at South by Southwest Film & TV Festival in Austin, Texas - with a Justin Baldoni protestor waiting outside of it.\nThe protestor, who also wore a shirt that said 'Blake lied' - held a sign that read: 'Justice for Justin Baldoni. Blake lied,' as the star walked the red carpet nearby.\nThe actress donned a skintight nude and black dress - layered under a pink cover up - she took off for the afternoon premiere.\nBlake is currently in the midst of a legal war against her It Ends With Us co-star and director, actor Justin Baldoni. \nAnother Simple Favor is the sequel to her 2018 thriller A Simple Favor.\nThe movie follows main characters Stephanie (Kendrick) and Emily (Lively) 'head to the beautiful island of Capri, Italy, for Emily's extravagant wedding to a rich Italian businessman,' according to Variety. \n\nOn Friday, Blake Lively attended the Another Simple Favor premiere at South by Southwest Film & TV Festival in Austin, Texas - with a Justin Baldoni protestor waiting outside of it\n\nThe protestor held a sign that read: 'Justice for Justin Baldoni. Blake lied,' as the star walked the red carpet nearby\n'Along with the glamorous guests, expect murder and betrayal to RSVP for a wedding with more twists and turns than the road from the Marina Grande to the Capri town square.' \nWhile on the red carpet on Friday, Blake was heard telling the screaming crowd: 'You guys are so sweet, not to shout, so civil.' \n\n Fans think Blake Lively's It Ends With Us costar Brandon Sklenar supports Justin Baldoni via red carpet detail \nAfter smiling and posing for a few seconds, Blake proceeds to take off the plastic-style cover up, as she says aloud: 'Okay this is coming off now, that's better.' \n'Hi there,' she adds, as she takes the cover up off to reveal the strapless skintight dress beneath. \nThe timing is a publicity nightmare for the movie, which will no doubt be over shadowed by Blake's ongoing legal drama with her It Ends With Us co-star Baldoni.\nLively accused Baldoni of sexual harassment and orchestrating a smear campaign against her in a lawsuit filed in December while Baldoni accused Lively, her husband Ryan Reynolds, 48, and publicist Leslie Sloane of defamation and extortion in a $400 million suit filed in February.\nBaldoni has denied the allegations from Lively, while Lively, Reynolds and Sloane have denied the accusations made by Baldoni.\n\nBlake is currently in the midst of a legal war against her It Ends With Us co-star and director, actor Justin Baldoni\n\nThe movie follows main characters Stephanie (Kendrick) and Emily (Lively) 'head to the beautiful island of Capri, Italy , for Emily's extravagant wedding to a rich Italian businessman,' according to Variety\n\nThe actress donned a skintight nude and black dress - layered under a pink cover up - she took off for the afternoon premiere\n\nBlake brushed off the protestor as she posed with fans\nBaldoni's team has also released a website which includes private communications such as text messages that were included in court filings detailing his interactions with the Hollywood power couple over the making of romantic drama.\nHe claimed in court filings they made efforts made to usurp and undermine his input as the director of It Ends with Us.\nAfter Prime Video released a promotional post for Another Simple Favor February 5 - which Lively stars in opposite Anna Kendrick - a number of commenters implicated that Lively might have tried to assert her influence over director Paul Feig, 62, over that movie, leading the filmmaker to respond to the speculation.\nAmid Baldoni's claims that Lively and her inner circle used their considerable clout to commandeer changes to the script - even enlisting Swift to lean on him at one point - and re-cut the motion picture, a user asked in the comment section, 'Is it Paul Feig's cut or Blake's cut?'\nFeig - whose other cinematic credits include 2011's Bridesmaids, 2016's Ghostbusters and 2024's Jackpot! - made clear he had full creative control over the film, replying, 'It’s my cut. There is no other cut ... just wanted to clear that up.'\nFeig in his reply heaped massive praise on Lively, who he previously worked with on 2018's A Simple Favor.\n'Blake has been nothing but supportive and a dream to work with,' said the Emmy-nominated director, who has directed shows such as Arrested Development, The Office and Nurse Jackie. 'She is the best and an amazing collaborator and I’m her biggest fan.'\n\nLively is currently embroiled in legal warfare with Baldoni after It Ends With Us\nA number of the director's fans criticized his defense of Lively, amid the allegations Baldoni made in court filings and on the website.\n'Paul, I know you’re gonna wanna shake off these comments as coming from a bunch of loons, but Blake and Ryan really did use their star power to bulldoze Justin,' said one user. 'It makes me really sad, and I hope you remember when you were starting off in this business.'\nOthers told Feig that his stellar reputation as a feted industry veteran insulated him from the strong-arming and meddling Lively allegedly subjected Baldoni to in regard to It Ends with Us's screenplay, wardrobe and editing.\nTexasJustin BaldoniBlake Lively\n\nShare or comment on this article: \nBlake Lively hit with Justin Baldoni protestor outside Another Simple Favor premiere at SXSW\n\nAdd comment\n\nComments 15\n\n Share what you think\n\nWorst rated\n\nThe comments below have not been moderated.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nEnter search term:\n\nGene Hackman and wife Betsy Arakawa's causes of death revealed\n\nThe Beckhams have arrived! Harper, 13, is her mother's mini-me while Romeo and Cruz step out with girlfriends for Victoria's Paris Fashion Week show\n\nFriends legend David Schwimmer turns on 'two faced' Hollywood pals for heinous silence\n\nBlake Lively is 'terrified' ahead of tonight's Another Simple Favor premiere, as insiders reveal why Anna Kendrick NEVER wants to work with her again\n\nNatalie Portman shows 'cheating' ex what he's missing as she gets touchy feely with another famous French hunk\n\nWhat your health priorities should be in your 30s, 40s, 50s, 60s and beyond! Real women share the most important things to put before everything\n\nHow Gene Hackman's wife Betsy Arakawa caught rare rodent disease hantavirus that led to her death\n\nFrom a brilliant new Agatha Christie mystery to an early show from the creator of The White Lotus: The 20 best things to stream this weekend, picked by our TV experts\n\nJennifer Garner spotted looking VERY at home in ex Ben Affleck's house after intimate photos sparked rumours of reunion\n\nNeed a style update? Why some new arm candy is all you need (and our pick of the most lust-worthy bags of the season)\n\nWarwick Davis reveals more details about mystery woman 'Sponge' who has helped him 'love again' after his wife's death\n\nVictoria Beckham blows kisses to the crowds during her PFW show as husband David and kids Romeo, Cruz and Harper watch... but where is Brooklyn?\n\nLily Allen lashes out at ex-husband David Harbour as she mocks his abilities in the bedroom\n\nBrooks Nader goes braless in a sheer top with a see-through skirt that flashes her thong in Paris\n\nThe bra you've been waiting for! Meet the range of cotton bras that is leading a comfort revolution\n\nScarlett Johansson describes Selena Gomez and Benny Blanco's chemistry after sitting next to them at the Oscars\n\nJennifer Lopez's 'revenge romance' on Ben Affleck after he hugged ex Jennifer Garner\n\n80s sitcom bombshell who later played Chloe Sevigny's mother is unrecognizable at 70... who is she?\n\nBlake Lively and Ryan Reynolds leave legal woes behind to attend daughter's Rhode Island horse show... 40 minutes from Taylor's Watch Hill mansion\n\nBoost your health and happiness: Top 10 brands to kick-start your wellness journey\n\nJacqueline Jossa 'finally sells £2m six-bedroom mansion after slashing price' - despite spending three years renovating with husband Dan Osborne\n\nShowmance 2.0? Sydney Sweeney flirts with Housemaid costar Brandon Sklenar... after Glen Powell affair rumors\n\nElvis Presley's widow Priscilla reveals her family has suffered another tragic loss in heartbreaking post\n\nEDEN CONFIDENTIAL: Lord Brocket daughter's fairytale marriage to prince falls apart\n\nLooking for inspiration? These 10 travel brands will help you plan your dream getaway today!\n\nFamous 90s pop star looks unrecognisable as she steps out in New York City - but can YOU guess who she is?\n\nZendaya looks tired filming Euphoria after cast complained of grueling days on set\n\nBig Brother star Narinder Kaur reveals terrifying hospital dash and how she 'almost died' after taking overdose of weight loss drug \n\n14474195 Iconic 90s band known for smash hit song back in studio for first time in 31 YEARS\n\nChristine McGuinness puts on a very leggy display in a leather mini dress as she joins pregnant Arabella Chi at London's Unstoppable boxing event\n\nAshley James opens up about her personal struggles with self-worth and body image and has inspiring message for her daughter\n\nInside Russell Crowe and ex-wife Danielle Spencer's close friendship as they co-parent their teenage sons\n\nKourtney Kardashian's warning to Alabama Barker over Bhad Bhabie feud revealed after threats to her son\n\nHis son is an out-of-this-world movie heartthrob while he starred as a no-nonsense cop on a 70's TV drama... Can you guess who?\n\nBeauty fans obsess over new £29 fake tan mousse that develops in just ONE hour: 'It gave me the deepest, most natural tan'\n\nLuann de Lesseps, 59, and mini-me daughter Victoria, 30, could pass for sisters while in bikinis\n\nThe real reason for Kristina Rihanoff and Ben Cohen's split after 'six months of hell' is revealed as the couple separate after 12 years\n\nDaisy May Cooper explains how her 10-stone weight loss and lip filler derailed filming season two of Am I Being Unreasonable?\n\nDenise Richards admits daughter Sami Sheen was furious when she joined OnlyFans just weeks after her\n\nBereaved Downton Abbey actress Anna Chancellor, 59, said no one noticed her grief when her daughter died aged 36 because she's 'middle aged and invisible'\n\nCindy Bruna showcases her incredible figure in a white cut-out bodysuit and baggy trousers at Victoria Beckham's PFW show\n\nAnnie Kilner is supported by fellow WAG Coleen Rooney at International Women's Day lunch after Kyle Walker's night out with two mystery brunettes\n\nSky Sports presenter reveals she has a brain infection following cancer battle as she provides health update from hospital bed \n\nBleary-eyed Olivia Attwood puts on a VERY leggy display in TINY leopard hot pants as she heads home following boozy International Women's Day lunch\n\nLooking for the best Mother's Day gift? These flower-filled greeting cards make the perfect Mother's Day gift - and now you can get 10% off\n\nTop Boy's Ashley Walters opens up on rebuilding relationship with his children after overcoming alcoholism and reflects on his difficult time in prison\n\nD'Wayne Wiggins dead at 64: Tony! Toni! Tone! guitarist and former Beyoncé mentor dies after cancer battle\n\nNetflix fans fuming as streaming giant cancels beloved series after just two seasons\n\nOnlyFans star Ebanie Bridges announces birth of baby boy... before shocking fans by revealing the father is a former world champion\n\nTeddi Mellencamp escapes LA after sharing devastating health update amid cancer battle\n\nGrey's Anatomy star Eric Dane and Rebecca Gayheart mysteriously call off divorce in shock move\n\nHailey Bieber urged to 'leave Selena Gomez alone' after 'dig' at the singer and Benny Blanco\n\nStrictly's Kristina Rihanoff breaks social media silence after split from Ben Cohen\n\nPawn Stars vet Rick Harrison, 59, proposes to girlfriend, 41, with 6.5 carat diamond... one year after son's death\n\n70s rock star, 65, shares major health update amid brave cancer battle\n\nTammy Abraham and his girlfriend Leah Monroe look as loved-up as ever as they enjoy family time with their son Amari, two, at a park\n\nThe Beckham clan take over Paris! Victoria cuts a chic figure in all-black as she's supported by her famous family ahead of her Fashion Week show\n\nJessica Simpson hints ex Eric Johnson cheated in savage new track months after heartbreaking split\n\nLady Mary Charteris parties into the early hours with Noel Gallagher and Joe Jonas at star-studded karaoke bash\n\n'Murder may have crossed my mind!': Lily Allen discusses the challenges of her separation from Stranger Things star husband David Harbour\n\nTaylor Swift's fans trash 'meanie' Dance Moms vet Abby Lee Miller for knocking the singer's moves\n\nPregnant Arabella Chi shows off her growing bump in a stylish mini dress as she steps out at The Baby Show ahead of welcoming her first child\n\nLaura Whitmore infuriates BBC bosses by pulling out of Celebrity Apprentice special just DAYS before filming as lineup is revealed\n\nLady Gaga reveals the very blunt thing she asked fiance Michael Polansky on their first date in Sin City\n\nSouthern Charm star Craig Conover shocks fans by admitting he struggles with a secret addiction\n\nThe White Lotus star Aimee Lou Wood puts on a VERY leggy display in a skimpy denim skirt and cowboy boots while filming series two of sitcom Daddy Issues\n\nBeloved Dragons' Den star QUITS show with emotional message to co-stars and BBC crew - leaving fans 'truly gutted'\n\nInside Pamela Bach-Hasselhoff's tragic final days: Friends reveal her secret heartache, missed warning signs... and the decision that 'could have saved her life'\n\nKim Cattrall, 68, looks effortlessly chic in a plunging blazer as she joins braless Dianna Agron, 38, at the Nina Ricci show during Paris Fashion Week\n\nEastEnders stars look unrecognisable after glam makeover for 'sexiest ever' Agatha Christie drama Towards Zero\n\nGillian McKeith looks glamorous in a black sequin gown while her daughter Afton, 24, puts on a leggy display in a glitzy number at the London premiere of Chicago-inspired show\n\nMiquita Oliver brands Jack Whitehall 'inappropriate and condescending' as comedian faces backlash for jokes at BRIT Awards\n\nKim Kardashian seductively parts her legs while in a bikini as Kourtney's ex Scott Disick hits 'like' button\n\nAll that matters is my kids are happy: PADDY McGUINNESS reveals how his unique domestic set-up helps him support his autistic children - and how his old mates don't see him as a star\n\nHelen Mirren drama blasted for 'senselessly horrific' torture and rape scenes as disgusted viewers rage 'I won't watch another moment!'\n\nMeghan Markle's new Netflix show 'is renewed for second season' just days after first episodes were panned by critics and fans\n\nMegan McKenna rushes her baby to A&E in 'scary' hospital dash after he was left 'screaming in pain'\n\nLiam Payne's girlfriend Kate Cassidy's commits herself to charity work as she plans to help others through their grief and she is NOT\n\nHumiliation of Danny Jones' wife: Friends tell of Georgia's devastating move after McFly love cheat's grovelling apology for Maura kiss\n\nALISON BOSHOFF: The real reason why James Bond was sold to Amazon after Broccoli dynasty made 'no progress on a new film'\n\nAll the signs Kristina Rihanoff and Ben Cohen had split from social media posts to money troubles after he admitted to 'fighting to save their relationship'\n\nTruth behind Meghan Markle's 'unhygienic' chicken storage - after Netflix viewers say her kitchen practice is 'disgusting'\n\nDoechii looks incredible in a plunging corset dress as she continues to take PFW by storm in another stunning look at the Schiaparelli show\n\nHow Ben Cohen's ex-wife Abby has had the last laugh as star splits from Kristina Rihanoff 12 years after her life fell apart when he left for Strictly's 'Siberian siren'\n\nHeidi Montag breaks down in tears over 'painful' discovery at burned house on 2 month anniversary of LA fires\n\nTOWIE icon reveals he is in hospital for surgery after he found a 'lump' on his testicle and admits that the situation is 'not great'\n\nWho needs Glastonbury! 'Sober-curious' Gen Zzz are organising 'restivals' and watching music gigs on TV instead of partying\n\nThe White Lotus star in horror hospital dash after snake bite that felt like 'dying a slow death'\n\nEva Mendes puts on a leggy display in sheer black dress and gushes she's 'never felt sexier' as she marks her 51st birthday with sultry new Stella McCartney campaign\n\nWill Mellor hits out at Frozen the Musical over casting choices that saw characters change race midway through the show: 'It confused the whole audience'\n\nEmotional Danny Dyer admits he'll be sobbing and snotting everywhere' at daughter Dani's wedding to footballer fiancé Jarrod Bowen\n\nCoronation Street legend teases epic return to soap seven years on from exit after moving back to hometown by ITV set - and even hints at first new storyline\n\nTwiggy fans are only just finding out how she got her famous nickname at the age of 15\n\nEmmerdale are flogging memorabilia for 99p after show was hit by budget cuts and redundancies at ITV\n\nFormer Page 3 model Linda Lusardi's stark warning to OnlyFans stars that X-rated content will 'haunt them for the rest of their lives'\n\nBraless Paris Jackson shows off her assets in completely sheer dress as she puts on ANOTHER very racy display at Costes party during PFW\n\nMindy Kaling jokes about going viral after Meghan told her off for calling her Markle in 'awkward' exchange on Netflix show\n\nMaura Higgins 'lined up for celebrity dating show' in wake of Danny Jones kiss scandal - with TV bosses 'desperately circling her'\n\nEamonn Holmes reunites with former nemesis Anthea Turner for sweet snap after the pair squashed 10-year feud\n\nLily Allen enjoys dinner with lookalike of ex Sam Cooper amid 'painful' divorce from husband David Harbour\n\nNoel Clarke has been 'completely exiled from showbiz and perceived as a criminal' after newspaper labelled Dr Who star a sex pest, £70m libel trial hears\n\nMeghan is 'overwhelmed by love' as she affectionately bats her eyelashes while speaking about Prince Harry with Drew Barrymore, body language expert claims\n\nBhad Bhabie's troubled life takes dark turn as gunmen 'try to break into home' after baby daddy was shot\n\nSlimmed down Pete Doherty reveals why he is wearing medical boots in new health update after doctors shared amputation warning over his diabetes diagnosis\n\nRichard Hammond seen without wedding ring after marriage split as he films Workshop series and returns refurbished Mercedes to Debbie McGee\n\nDrake offered chance at ultimate Kendrick Lamar revenge after savage Super Bowl diss\n\nKendrick La\n\nVanessa Kirby, Raye and Gwendoline Christie exude glamour as they lead the stars at Givenchy's Paris Fashion Week show\n\nWho is UK's Eurovision act Remember Monday? Meet first girl band to represent country in over 25 years and their unlikely situation with Sabrina Carpenter\n\nALISON BOSHOFF: It's a summer wedding for Jeff Bezos and his high-flying bride\n\nMeghan Trainor debuts new boob job and fans are all saying the same thing\n\nUK's Eurovision 2025 act announced as 'genuinely brilliant' group that rose to fame on The Voice\n\nLiam Payne's girlfriend Kate Cassidy denies she is in talks to appear on reality TV shows following singer's tragic death\n\nLorraine Kelly attempts to hide her painful-looking black eye in Elton John style shades as she admits she 'feels silly' after disastrous fall at home\n\nLaurence Llewelyn-Bowen doubles down on Stacey Solomon series criticisms as he fumes: 'Decluttering makes my toes curl'\n\nDynasty star Stephanie Beacham says there should be MORE bullying on Strictly to whip celebs into shape \n\nTwiggy recalls nightmare interview with 'misogynist' Woody Allen as she claims he quizzed her on her favourite philosophers to 'make her look stupid'\n\nBattle of the celebrity chefs! James Martin declares war on TV cook rival Jamie Oliver's air fryer obsession in furious rant at live show\n\nGardeners' World fans all say the same thing as Monty Don reveals future of hit BBC show with long-awaited announcement\n\nHollywood star looks unrecognisable with a long grey beard as he arrives in Greece to film Christopher Nolan's The Odyssey\n\nThe curse strikes again! Strictly's Kristina Rihanoff and Ben Cohen 'split after 12 years together after financial difficulties tore the relationship apart'\n\nRuby Wax sparks concern from worried fans as she shares snap of herself from hospital\n\nThe Apprentice star Jonny Heaver reveals mortifying way he 'embarrassed himself' after being fired by Lord Sugar in moment cut from show\n\nHouse Of The Dragon's Emma D'Arcy admits the cast haven't kept in touch as they join co-stars at panel event\n\nThe fitness regime that prepped Harry Styles for his impressive Tokyo Marathon time as the singer's PT reveals his training secrets\n\nHuge A-list actor keeps a low profile as he rides the tube before hopping on a Lime bike in London - but can you guess who he is?\n\nDrew Starkey gives Anya Taylor-Joy a piggyback as they film scenes for their new Apple TV series Lucky in a Las Vegas casino\n\nVictoria's Secret model Taylor Hill channels Audrey Hepburn with stylish look at Paris Fashion Week\n\nEd Sheeran's secret is out! Star plays his new album during secret gig at his favourite London pub\n\nBBC axes popular property series designed to take on Netflix's Selling Sunset in blow to fans\n\nColeen Rooney and Westlife's Nicky Byrne enjoy collagen-infused Guinness as pair try to 'split the G' to celebrate the launch of WAG's wellness range\n\nKate Moss looks edgy in leggy satin shorts as she attends Isabel Marant show during Paris Fashion Week\n\nBlake Lively will attend Another Simple Favor premiere at SXSW despite legal war with Justin Baldoni\n\nTimothee Chalamet hits Knicks game without Kylie Jenner after shock details emerge about her hairstylist's tragic death\n\nDolly Parton releases heartbreaking new song dedicated to late husband Carl Dean just days after death at 82 \n\nNicolas Cage's son Weston announces engagement to girlfriend after 'vicious attack' on mom Christina Fulton\n\nCher stuns in all black at the Love Rocks concert in New York City just weeks after making Kevin Costner awestruck at SNL50\n\nMeghan Markle's 'family favourite' single-skillet spaghetti bears striking resemblance to recipe made famous by British chef dubbed 'the new Nigella'\n\nKate Moss, 51, flaunts her supermodel legs in skimpy satin shorts as she departs Ritz hotel in Paris during Fashion Week\n\nSelena Gomez and Martin Short film scenes for Only Murders in the Building on Staten Island\n\nLady Gaga celebrates release of 'masterpiece' new album Mayhem as she greets fans in NYC\n\nHorror as it's revealed Pamela Bach-Hasselhoff's daughter ran out 'screaming and crying' on finding her mother's body after gunshot suicide\n\nHow Prince Harry and Meghan's explosive interview with Oprah REALLY made Prince Philip feel as he battled poor health\n\nBritney Spears explains she drinks to cope with heartache and being 'abused' in worrying message\n\nKate Hudson looks gorgeous in edgy black sequin dress at star-studded benefit concert in NYC\n\nMiley Cyrus' Flowers music video mansion that once belonged to Frank Sinatra sells for $5M\n\nBrian James dead at 70: Brit punk rock guitarist who played with Black Sabbath and founded the Damned dies\n\nDemi Moore's daughter Rumer Willis wears mom's gold bikini from Striptease 30 years after co-starring in film\n\nFan shares tear-jerking story about Dolly Parton's reclusive husband following his death at 82\n\nDevastated Teddi Mellencamp reveals shock new diagnosis amid cancer battle as she begins urgent treatment\n\nAngelina Jolie looks elegant in a black overcoat as she steps out in NYC after supporting daughter Zahara\n\nNepo baby actor makes rare appearance with A-list dad\n\nLindsay Lohan's father Michael Lohan has active arrest warrant in Florida after probation violation\n\nDavid Hasselhoff's wife Hayley Roberts goes for jog after news of ex Pamela Bach's tragic suicide\n\nKim Kardashian accused of a Photoshop fail after sharing bikini snaps\n\nAre you a Traitor? Gogglebox star Izzi Warner's son steals the show as he transforms into TV royalty Claudia Winkleman for World Book Day\n\nInside David Hasselhoff and Pamela Bach's wild marriage and ugly divorce that left him 'broke' following her tragic suicide at 62\n\nDJ Funk dead at 54: Chicago musician who was pioneer of 'ghetto house' dies after cancer battle\n\nLauryn Goodman 'reveals the truth about her move to Italy' after Kyle Walker's AC Milan transfer in bizarre twist - after she was seen with removal men outside her home\n\nKylie Jenner fans say new perfume bottle resembles X-rated 'sex toy'\n\nCate Blanchett cuts a sophisticated style as she joins co-star Emma Corrin at The Seagull press night as new play receives rave reviews\n\nMadonna enrages fans by supporting trans Emilia Perez star Karla Sofia Gascon after her 'racist' tweets\n\nKylie Minogue's staggering earnings revealed as she prepares to kick-off her Tension tour\n\nGeri admits 'women we are expected to work twice as hard for half as much' during speech as she joins Lucy Boynton at Harper's Bazaar International Women's Day\n\nChristina Ricci poses for rare photo with husband and kids as she receives star on Hollywood Walk Of Fame\n\nLove Island's Olivia Hawkins breaks down in tears as she reveals the truth behind THOSE messages - after fiery on-air exchange with Grace Jackson\n\nPete Davidson reveals the disturbing truth about celebrities appearing on Hot Ones\n\nIrina Shayk wows in very quirky oversized bra top as she sunbathes in Brazil after THAT sexy Carnival outfit\n\nLeonardo DiCaprio and Adrien Brody both vying for roles in Evel Knievel biopic for director Damien Chazelle\n\nPost Malone reveals shock split from fiancée as he shows off some PDA with new girlfriend\n\nKatherine Heigl accuses dog rescue center of 'smear campaign' in new legal war\n\nAmelia Gray Hamlin puts on a leggy display in a £595 Kim Kardashian T-shirt and thigh high boots as she steps out in Paris during fashion week\n\nKhloe Kardashian reveals whether she had a boob job after looking VERY busty in corset\n\nADRIAN THRILLS reviews: Lady Gaga: Mayhem (Interscope): Lady Gaga promises mayhem but delivers 80s power pop\n\nPATRICK MARMION reviews The Seagull at the Barbican Theatre: At last, a West End drama starring a movie idol that's not a dud. Take a bow, Cate\n\nCan Meghan REALLY call herself Sussex? What royal protocol says about her preferred name, by REBECCA ENGLISH\n\nGigi Hadid cuts a chic figure in a black leather jacket and jeans as she's mobbed by fans at Schiaparelli show during Paris Fashion Week\n\nShrinking Mindy Kaling shows off dramatically slimmed down frame amid Hollywood's Ozempic craze\n\nBaywatch, lots of booze, and broken bones: Inside David Hasselhoff and Pamela Bach's ill-fated marriage... from Knight Rider to tragedy\n\nRupert Murdoch's 'wild child' granddaughter Charlotte Freud finds love again after collapse of whirlwind marriage\n\nJax Taylor offers a glimpse of his new healthy lifestyle while recovering from his cocaine addiction\n\nBRIAN VINER reviews Twiggy: A beguiling portrait of the waif with a trucker's laugh who defined the late Sixties\n\nEDEN CONFIDENTIAL: Pop star Rachel Stevens's ex-husband and star of Netflix property show shutters his own estate agency\n\nCruz and Romeo Beckham arrive in Paris ahead of mum Victoria's fashion show but will Brooklyn's new career as a racing driver stop him joining the FROW support squad?\n\nSimon Cowell, 65, recalls shocking two-week bender in wild party destination\n\nKylie Jenner's hairstylist Jesus Guerrero 'showed health warning signs' before his shock death aged 34\n\nDanny Dyer's new film Marching Powder is savaged with 1-star reviews - as it's added to his roll call of 'more bad films than almost any other actor'\n\nKing of rock 'n' roll? Charles reveals VERY eclectic music taste as he becomes first ever British monarch to record podcast \n\nGene Hackman's extreme exercise and diet regime forced on him by wife after they moved to a 'spiritual vortex'\n\nMeghan Markle's six-word jab to Drew Barrymore over her 'clingy' behavior in 'awkward' interview\n\nDanny Jones makes first TV appearance after 'drunken kiss' with I'm A Celeb co-star Maura Higgins\n\nLorraine Kelly reveals truth behind her swollen face on Loose Women after being asked 'if she has had fillers or an allergic reaction' by panicked fans\n\nWho was fired from The Apprentice 2025? Jonny Heaver is the fifth candidate to be axed by Lord Sugar as his luck finally runs out\n\nRoy Ayers dead at 84: Everybody Loves The Sunshine singer worked with Whitney Houston and Alicia Keys\n\nDragons' Den viewers left confused after BBC airs an old episode featuring a company no longer in business in the middle of new season\n\nQueen Camilla appears on The One Show to present prizes during final of national writing competition as she praises young 'writers of the future'\n\nDavid Hasselhoff's dating past: his girlfriends, ex-wives, and 'battle with the bottle'\n\nQueen Letizia puts on a sombre display in a black coat dress as she joins King Felipe at remembrance concert for victims of 2004 Madrid train bombings\n\nHailey Bieber's healthy living shoot reveals disturbing reality of couple's marriage\n\nKhloe Kardashian disgusts fans with her 'creepy' nickname for brother Rob in shock Instagram comment\n\nSingle Drew Barrymore seemed 'envious' as Meghan Markle gushed over Prince Harry, body language expert reveals\n\nMTV alum looks unrecognizable in new mugshot after he's thrown in jail for trying to meet a minor for sex\n\nJustin Baldoni's father makes savage diss at Blake Lively and Ryan Reynolds with shady message\n\nChappell Roan stuns with dramatic butterfly-inspired makeup and racy silver dress at Rick Owens show during Paris Fashion Week\n\nPrincess Beatrice is seen for the first time since giving birth to daughter Athena as she and Edoardo Mapelli Mozzi attend gala \n\nSummer House star Hannah Berner forced to apologize over shambolic interview at Oscars party with A-Lister\n\nDavid Hasselhoff's ex wife Pamela Bach dead at 62 after shock suicide at Hollywood mansion\n\nFaster Pussycat frontman Taime Downe heard 'loudly arguing' with fiancee in cabin before her cruise ship death\n\nSelena Gomez fans freak out at her speaking voice changing from 'bubbly to sluggish' over the years\n\nFriends star accuses beloved sitcom of racism and recalls 'toxic' incident on set\n\nChelsea Handler breaks silence on shock Ralph Fiennes romance rumors\n\nLinda Lusardi, 66, admits she now 'cringes' at her Page Three modelling days and insists 'it was wrong' to strip off for men's entertainment\n\nCoronation Street legend confirms return to soap after nine years off screen after co-star demanded comeback for emotional exit storyline\n\nDanny Jones' past cheating scandals resurface after the McFly star's 'drunken kiss' with Maura Higgins at the BRITs afterparty\n\nDavid Hasselhoff breaks silence on ex-wife Pamela Bach-Hasselhoff's suicide aged 62\n\nUS rapper Ice Cube looks relieved as he escapes Cyclone Alfred to touch down in Sydney - after revealing he was trapped on the Gold Coast amid severe weather warnings\n\nMichael Sheen clears £1m of debt for 900 Welsh people with his own money in Hollywood star's latest heartwarming gesture\n\nAnnie Kilner steps out without her wedding and tucks into a strawberry as she runs errands after husband Kyle Walker's night out with two mystery brunettes\n\nWayne Lineker is rushed to hospital in London as he gives a health update after obtaining serious injury\n\nWill Tommy Fury appear in Molly-Mae Hague's documentary? Insiders claim the couple could be about to go public with their rumoured reunion\n\nX Factor star announces they are set to welcome second child via surrogate as they reveal the gender in sweet video\n\nMORE DON'T MISS\n\nTrisha Paytas is pregnant! Fans in shock as she's expecting third baby 10 months after her second child\n\nHow Diddy's fellow inmates really feel about him revealed by his new jail pal Sam Bankman-Fried\n\nJamie Laing and Sophie Habboo reveal terrifying burglary ordeal which saw him woken up at 6am by a balaclava-wearing intruder\n\nDolly Parton reveals how she is grieving following tragic death of husband Carl Dean after 59 year marriage\n\nBlake Lively and Ryan Reynolds CLASH with Justin Baldoni again as couple claim their 'profound medical issues' are at risk of being leaked\n\nFresh humiliation for Justin Timberlake as fading star's worst scandal is dragged back into public view\n\nTeddi Mellencamp shares major health update after undergoing brain surgery to remove tumors\n\nMindy Kaling breaks her silence over backlash to guest appearance on Meghan Markle's Netflix show\n\nCarrie Underwood tears up for surprising reason while holding a child during an American Idol audition\n\nMichelle McManus is shocked by unexpected invite from Robbie Williams to join him on tour\n\nRoman Kemp reveals horrifying moment involving father Martin that cost them a million pounds\n\nSam Thompson and Pete Wicks jump out of a plane to announce major news for their hit Staying Relevant podcast\n\nGene Hackman police blunders leads to series of troubling unanswered questions\n\nChris Pratt commended for stepping in to protect Millie Bobby Brown during wardrobe issue: 'A real gentleman'\n\nThe Sopranos star Jamie-Lynn Sigler feared son Beau, 11, 'was going to die' after rare health condition put him in hospital\n\nHailee Steinfeld and fiance Josh Allen's 'intimate' wedding plans revealed just FOUR months after engagement\n\nBen Affleck wants to 'make another movie' with Jennifer Garner as they get 'closer'... 22 years after Daredevil\n\nParis Hilton slams 'hurtful' comments after she is accused of having 'no relationship' with daughter London\n\nKim Kardashian reveals which sister handed over her 'life savings' to help her during first divorce\n\nAdrien Brody's artwork branded 'horrendous and ugly' by very unimpressed viewers\n\nCandice Swanepoel flaunts her muscular body as she announces 'dream' project with Victoria's Secret\n\nAlexa Chung puts on sultry display in tan dress and faux fur coat in surprise appearance at the Chloé show during Paris Fashion Week\n\nMeghan Markle enlists Archie and Lilibet to help her in the kitchen as she bakes cookies for Drew Barrymore\n\nLaurence Llewelyn-Bowen brands Holly Willoughby 'the angel of death' and Bear Grylls 'a semi-naked, old Etonian' as he reflects on Celebrity Bear Hunt\n\nBBC confirms fate of Amandaland after mixed reviews - as show creator pens emotional message to fans\n\nDuchess of day drinking! Viewers of Meghan's new Netflix show joke they want to spend the day at her house as she serves up boozy lunches \n\nDrew Barrymore viewers brand host 'clingy' and say she 'doesn't respect personal boundaries' in interview with Meghan Markle\n\nGemma Collins reveals she has shed two stone on weight loss jabs after previously thinking she would die following horror gastric surgery: 'I couldn't get out of bed'\n\nMolly-Mae Hague posts hilarious throwback of scathing school report as she reveals what teachers pulled her up on as a teenager\n\nBBC Radio 2 leaves listeners in shock as station goes silent for the first time in two decades as building is evacuated during fire scare\n\nFormer First Lady Carla Bruni, 57, reveals her surprising new hobby of pole dancing as she shows off her flexibility in hot pants\n\nOlivia Colman and Richard E. Grant beam from ear-to-ear as they join celebrity pals at the Stella McCartney after party during Paris Fashion Week\n\nAntiques Road Trip fans all say the same thing as a new expert takes over hit BBC daytime show\n\nKhloe Kardashian makes stunning admission about co-parenting relationship with Tristan Thompson\n\nMyleene Klass, 46, exudes sophistication in bright red suit as she arrives for work at Smooth Radio\n\nIconic noughties pop group look unrecognisable after it is announced they will play at Glastonbury\n\nKanye West's ex-girlfriend Amber Rose recalls the moment the rapper 'reduced her to tears by making her wear a revealing dress' in Paris\n\nMarried At First Sight UK star Lacey Martin reveals she has experienced 'dark thoughts' since split from co-star Nathan Campbell\n\nWoman who bought Nicole Kidman's beach house makes shock discovery\n\nDoja Cat flashes her cleavage while Jade Thirlwall and Ice Spice rock quirky red ensembles at the Off-White Fall show during Paris Fashion Week\n\nBrooklyn Beckham reveals his surprising daily routine after putting the breaks on his culinary aspirations to become a racing driver\n\nAwkward moment Meghan Markle is caught off guard when emotional Drew Barrymore surprises her with a photo of Diana during interview \n\nBhad Bhabie's baby daddy Le Vaughn gives health update after being shot at LA strip club\n\nInside the five-star hotel in the Scottish Highlands where Georgia Toffolo and James Watt are spending their honeymoon\n\nRosie Huntington-Whiteley shows off her incredible figure in glitzy sequin gown for Balenciaga dinner during Paris Fashion Week\n\nThe Apprentice contestant Johnny Heaver takes aim at Lord Sugar on social media after revealing what happened to his face\n\nKristin Cavallari continues war with 'pathological liar' ex Jay Cutler over fresh drama\n\nNetflix viewers poke fun at Meghan's food tips by adding flower petals to hot dogs and fish and chips (and Justine Bateman can't resist another swipe)\n\nMindy Kaling looks sensational in a leggy black velvet mini dress in NYC - after going viral for awkward Meghan Markle moment on Netflix show\n\nAmanda Holden puts on a leggy display in floral mini skirt and blouse after 'massive heels' left her with a swollen foot\n\nThe Windsors and Drop The Dead Donkey star Haydn Gwynne leaves massive fortune to her two sons after her death aged 66\n\nGlastonbury reveals acts for 2025 as headliners are confirmed and festival goers slam 'worst line-up ever'\n\nKanye West's ex Amber Rose reveals the real reason the controversial rapper 'dresses his girlfriends' in X-rated clothing\n\nDrew Barrymore calls Meghan Markle 'Meghan Sussex' on her talk show as Duchess's clash over name with Mindy Kaling goes viral\n\nNepo baby takeover! Mabel, Paris Jackson, Ever Anderson and Georgia May Jagger lead celebrity offspring at Chloe Paris Fashion Week show\n\nLorraine Kelly sparks concern with 'puffy' face on Good Morning Britain - as worried fans gasp 'what has happened?!'\n\nTate McRae reveals the brutal injuries she suffered while filming the music video for her Revolving Door single\n\nKerry Katona reveals breast reduction plans as she says she needs to have the surgery for 'health and safety reasons'\n\nProud David Beckham flashes a smile as he steps out hours ahead of supporting wife Victoria Beckham at her Paris Fashion Week show\n\nBritain's Got Talent pulled from screens just weeks into new series after fresh wave of Ofcom complaints\n\nThe touching details in Queen Mary of Denmark's regal ensemble that pay tribute to her husband's family history\n\nInternet trolls accuse Meghan Markle of being 'incredibly rude' to her friend Mindy Kaling in awkward exchange on new Netflix show\n\nLily James flashes her bra and underwear in sheer lace co-ord as she joins leggy Paris Jackson and Gemma Chan in leading stars at Chloe show during Paris Fashion Week\n\nStephen A. Smith tells Jimmy Fallon why he could be a genuine presidential candidate\n\nYouTuber Andrew Cross dies aged 36 after being taken off life support following horror accident\n\nPete Wicks fails to address former flame Maura Higgins' kiss with Danny Jones as he remains tight-lipped during emotional Lorraine interview\n\nThe Repair Shop guest breaks down in tears as expert admits 'I don't know what to do' and resorts to 'forcing his way into' locked till\n\nDoechii puts on a cheeky display as she joins leggy Kate Moss and braless Camilla Rowe at the Tom Ford Paris Fashion Week show\n\nTanya Bardsley recalls doctors having to 'draw blood' from her boob job as she reveals horrific details of plastic surgery\n\nMaya Jama slips on a dressing gown and enjoys a cocktail as she promotes new collaboration\n\nNetflix fans rave over 'hilariously quirky' comedy series with whopping 97% Rotten Tomatoes score as it rockets up the charts\n\nProud mum Denise Welch reveals her excitement at her rock star son headlining Glastonbury as she shares plans to attend her very first festival\n\nNeil Gaiman brands rape accuser 'fantasist' and he has WhatsApp messages that prove their relationship was 'consensual'\n\nAmanda Holden slips into a sexy Little Red Riding Hood outfit while Ashley Roberts rocks a wolf costume as they celebrate World Book Day\n\nNaomi Campbell cuts a chic figure in a black gown as she parties with Burna Boy at PrettyLittleThing relaunch bash\n\nInsiders reveal the real reason Selena Gomez decided to settle with Benny Blanco... and it's as heartwarming as it is surprising\n\nKelly Hoppen details becoming part of a 'dysfunctional modern family' as stepmother to Sienna and Savannah Miller\n\nBrooklyn Beckham reveals sweet nods to father David and wife Nicola Peltz on his personalised racing helmet from his experience as a Formula E driver\n\nMindy Kaling emerges after going viral for THAT awkward Meghan Markle moment on Duchess of Sussex's new Netflix show\n\nOlivia Colman looks glam as she cosies up to husband Ed Sinclair in rare loved-up display for Stella McCartney show\n\nTed Lasso's Ellie Taylor reveals the fate of Apple TV's hit show for the long-awaited fourth season\n\nCharlotte Crosby shares a sweet insight into the first few weeks of her new life as a mother of two\n\nEmily Ratajkowski flaunts her jaw-dropping figure in a skimpy metallic co-ord while partying it up at Carnival in Brazil\n\nA Cruel Love: The Ruth Ellis Story viewers have A LOT of complaints as they 'give up' on new ITV drama after just one episod\n\nThe Apprentice's Jana Denzel 'quit because he felt labelled \"disruptive\"'- as star is caught up in racism row\n\nIconic 80s rock band call off Las Vegas residency just weeks before first gig as lead singer is hit by surgery news\n\nUnder-fire Emilia Perez actress Karla Sofía Gascón claims Madonna is 'supporting her' amid tweets controversy\n\nFans convinced Blake Lively's It Ends with Us co-star Brandon Sklenar is showing solidarity with Justin Baldoni with telling red carpet detail\n\nA Place In The Sun star Laura Hamilton shows off her incredible figure in a black bikini as she shares exciting property update from Dubai\n\nOfcom flooded with more than 800 complaints over the Brits - after Charli XCX's see-through dress and Sabrina Carpenter's 'sex show'\n\nMichaela Strachan, 58, 'feels 20 years younger' and proudly wearing bikinis again after Dancing On Ice training - as she becomes favourite to win show\n\nDanny Dyer's new film Marching Powder 'risks upset with controversial jokes about drugs and sex offenders'\n\nJaden Smith looks stylish as ever in tailored suit for LVMH event during Paris Fashion Week after being named as brand ambassador\n\nRochelle Humes' kids dress as Mary Poppins and Spider-Man and Coleen Rooney's son Cass brings the magic as Harry Potter on World Book Day\n\nDanny Jones and his wife Georgia 'hold crisis talks' after his 'drunken kiss' with I'm A Celeb co-star Maura Higgins\n\nOlivia Bowen and husband Alex share sweet behind-the-scenes glimpse at their gender reveal party as they surprise their family with happy news\n\nLily James cuts an effortlessly chic figure in a black asymmetric top and tailored trousers as she joins stylish Elle Macpherson at LVMH Prize event \n\nZara Tindall becomes an official ambassador for Fairfax & Favor - we speak to the co-founder\n\nDua Lipa cuts a stylish figure in a leggy knitted dress and fur boots as she steps out for dinner with her sister Rina at swanky Mayfair restaurant\n\nDisney scrap plans for Snow White UK premiere in an attempt to avoid anti-woke backlash to the controversial adaptation\n\nAmanda Seyfried dazzles in a gold mini dress at premiere of her crime drama Long Bright River in NYC\n\nKeith Richards is honoured with new award celebrating residents of Connecticut - where the Rolling Stones legend has lived since 1985\n\nRuPaul's Drag Race star The Vivienne's 'extraordinary life' is to be honoured in a new documentary\n\nTruth about Justin Bieber's assistant who 'quit' amid fan concerns\n\nLady Gaga rocks plaid for Saturday Night Live rehearsals in NYC after roasting the cast in new promo\n\nHow Jennifer Garner REALLY feels about 'rekindling' romance with Ben Affleck 10 years after nanny cheating scandal\n\nThat was quick! Christina Haack's rebound lover debuts on Flip Off finale weeks after husband No. 3 Josh Hall was axed from same HGTV show\n\nHalle Bailey's son Halo recognizes her as Ariel in The Little Mermaid for the first time\n\nGene Hackman's nephew breaks silence on death theories amid 'companion suicide' speculation\n\nJesy Nelson breaks down in tears as she reveals she's suffering ongoing 'complications' during her pregnancy with identical twins\n\nKhloe Kardashian reveals how she really feels about plastic surgeon who did her nose job\n\nRosie Huntington-Whiteley flaunts her incredible figure in a sexy black mini dress at PrettyLittleThing's Legacy In Progress party in Paris \n\nKim Kardashian refuses to pay for Khloe Kardashian's 40th extravagant birthday party after fall-out with sisters\n\nDua Lipa shares sweet family photos and gushing tribute to her hunky manager dad as she marks his 56th birthday\n\nMeghan Markle's REAL reaction to 'relentlessly clingy' Drew Barrymore revealed in awkward interview\n\nBhad Bhabie shares unbelievable OnlyFans earnings - and it makes her the richest celebrity on the site\n\nTaylor Swift's stolen Eras Tour tickets allegedly resold by cybercrew in hacking scheme\n\nTom Sandoval reveals status of $2M home he bought with ex Ariana Madix after ugly split and money war\n\nDolly Parton's career was forged in a 'poor but proud' family of 14 - now her siblings will rally around as she grieves her husband\n\nJay-Z's rape accuser speaks out amid rapper's defamation lawsuit against her and attorney Tony Buzbee\n\nClarkson's Farm star Kaleb Cooper becomes a millionaire - two years after paying himself just 50p an hour for gruelling farm work\n\nParis Jackson goes braless in a black sheer gown as she joins leather-clad Kate Moss and Cameron Diaz at the Stella McCartney show\n\nGreat Celebrity Bake Off for Stand Up to Cancer 2025 line-up revealed: Full list of famous faces out to impress Paul Hollywood \n\nRay Winstone throws his hat in the ring for Bond as he slams the idea of casting a non-British 007 after the franchise's shock Amazon deal\n\nGlastonbury fans claim they've 'worked out' the exact time the 2025 lineup will be announced - and it's just hours away\n\nMyleene Klass puts on a very leggy display in hotpants and platform heels for a pink carpet appearance at the Royal Albert Hall Barbie concert\n\nCameron Diaz cuts a trendy figure in a long leather coat as she enjoys a night out with friends at Costes during Paris Fashion Week\n\nPink shows off her very muscular frame (and 25 tattoos!) during game of tennis\n\nRegina Hall calls out Kevin Hart for crass comments about her breasts\n\nStrictly Come Dancing star Nikita Kuzmin reveals shock new career move ahead of solo tour\n\nPete Davidson shells out thousands on gift for estranged friend Colin Jost so as to settle their mysterious feud\n\nJAN MOIR: Meghan's new show seems like a bowl of consommé - strained and thin. Does she even enjoy it herself?\n\nKelly Osbourne flaunts her slimmed down frame in chic ensemble as she and husband Sid Mason arrive in Sydney \n\nJennie Garth breaks her silence after late friend Shannen Doherty was omitted from Oscars in memoriam segment\n\nZac Efron's brother Dylan strips down to a speedo in a bid to debunk viral rumor\n\nDanny Jones reveals why his 'overwhelmed' wife Georgia left their home after his I'm A Celeb stint with Maura Higgins\n\nFormer Doctor Who star David Tennant offers to bequeath his own skull for use in Hamlet\n\nBrooklyn Beckham unveils his latest career as a Formula E driver... despite taking SEVEN times to pass his theory test\n\nEDEN CONFIDENTIAL: Former It girl Pattie Boyd reveals her later-life hallucinogenic drug adventure\n\nJustin Baldoni slams claims his good deeds are 'phony' and workplace 'toxic' amid Blake Lively battle\n\nControversial Olympian 'in advanced talks to join the Celebrity Big Brother lineup - with bosses hoping he'll cause a stir with younger stars'\n\nPop veteran Edwyn Collins to quit the stage 20 years after suffering a stroke and haemorrhages\n\nLala Kent talks Jax Taylor's 20-year cocaine habit after he admitted being high on Vanderpump Rules\n\nEverybody Loves the Sunshine hitmaker and jazz great Roy Ayers dies at 84 after a long illness\n\nLady Gaga reveals how fiancé Michael Polansky's unorthodox proposal inspired song on new album Mayhem\n\nJackie O Henderson and bestie Gemma O'Neill prepare for a wild night out at Berlin's infamous KitKatClub as they go lingerie shopping\n\nMeghan Markle gushes over 'sweet' surprise from husband Prince Harry\n\nEurovision 2025 'sparks huge row as BBC bosses demand Malta's song is changed over a VERY X-rated lyric'\n\nShock reason why Heather Locklear was blamed for Melrose Place being cancelled\n\nROLAND WHITE reviews A Cruel Love: The Ruth Ellis Story on ITV1: Killer Ruth Ellis is still on trial... 70 years after she went to the gallows\n\nEPHRAIM HARDCASTLE: Could King Charles commission a portrait of Queen Camilla for her 80th birthday celebrations?\n\nJesse McCartney in TEARS over gender reveal as pregnant wife Katie Peterson gives him a comforting hug\n\nDisgraced 7th Heaven actor Stephen Collins' child sexual abuse scandal subject of bombshell documentary\n\nGene Hackman friend reveals why two of star's dogs survived, as mystery over dead dog deepens\n\nMarried At First Sight bride Morena Farina, 57, reveals her new X-rated career after split from groom Tony Mojanovski\n\nKyle Richards reveals why she dropped 'wife' from bio amid Mauricio Umansky split and lesbian romance rumors\n\nDoja Cat goes wild for Balmain as she poses in plunging leopard print jacket alongside a leggy Kim Cattrall at Paris Fashion Week Show\n\nHeather Graham, 55, shows off her body at a yoga retreat in Mexico as she recycles a bikini from seven years ago\n\nKate Moss looks incredible in a dramatic feathered coat as she arrives at the Tom Ford show during Paris Fashion Week\n\nJackie 'O' Henderson doesn't look like this anymore! Radio queen unveils fresh new look and she's loving it\n\nMeghan Markle reveals who her kids call 'uncle'... and it is not Prince William\n\nGigi Hadid cuts a cool figure in a striped jacket and jeans as she signs autographs for fans in Paris during fashion week\n\nWhy Meghan Markle decided against filming her new Netflix show in her actual Montecito home\n\nKaty Perry asks Taylor Swift for 'advice and support' after disappointing tour ticket sales\n\nTruth about Maura Higgins and the OTHER famous man she had her eye on: After the kiss with McFly's Danny Jones\n\nLegendary British actor joins the cast of EastEnders in a hard-hitting new storyline - and fans will be shocked to discover his VERY famous offspring\n\nShe's the great granddaughter of an iconic novelist while her mom acted with Meryl Streep (and there's Taylor Swift link).... can you guess who?\n\nDanny Jones's 'humiliated' wife Georgia Jones pulls out of public Q&A - just days after husband shared a 'drunken kiss' with Maura Higgins\n\nHelen Flanagan posts video to normalise tummy 'over-hang' as she speaks candidly about 'stressful' days solo parenting\n\nSimone Ashley cuts a stylish figure in a brown faux-fur coat and blue denim skirt as she arrives at NBC Studios in NYC\n\nShania Twain opens up about wanting to be a bodybuilder after being 'touched inappropriately' as a kid\n\nGeorgia Toffolo wows in a red swimsuit as she enjoys wild ice swimming in Scotland during low-key honeymoon with husband James Watt\n\nMeghan Markle reveals the 'adorable' way Archie and Lilibet speak as she opens up about family life\n\nFull Celebrity Apprentice line-up is 'revealed' as huge EastEnders actor and Gladiators star join AJ Odudu and JB Gill for the 20th anniversary\n\nTimothee Chalamet's cringe rap dance moves resurface after devastating Oscars loss\n\nHuge comedian confirms Channel 4 show has been axed after 'disastrous' episode - admitting 'everything went wrong'\n\nCoronation Street favourite is set to be 'KILLED OFF after the actor was brutally axed from the soap after 14 years on screen'\n\nBill Murray, 74, talks 'dating' Kelis, 45, as he FINALLY addresses romance rumors\n\nToday's headlines\n\nGene Hackman and wife Betsy Arakawa's causes of death revealed\n\nBrad Sigmon is executed by firing squad for murdering his ex-girlfriend's parents as his final meal is...\n\nHow hi-viz workmen digging up roads were in fact criminal gang stealing electricity worth millions to power...\n\nThe toxic girls' trip at 40 that meant I never spoke to my 'best friends' again\n\nI know Donald Trump. He might seem mad... but he has a secret plan. Underestimate him at your peril, writes...\n\nBreathtaking extravagance of the most expensive Commons Speaker in history: 'Long-haul' Lindsay Hoyle blew...\n\nThe Beckhams have arrived! Harper, 13, is her mother's mini-me in a satin gown as she holds hands with...\n\nFrom a brilliant new Agatha Christie mystery to an early show from the creator of The White Lotus: The 20...\n\nNew photos offer rare glimpse of Elon Musk's Texas empire, where he keeps his favorite baby mama VERY...\n\nBereaved Downton Abbey actress Anna Chancellor, 59, said no one noticed her grief when her daughter died...\n\nReform UK in meltdown as party ousts MP Rupert Lowe amid 'bullying' probe and 'violent threats' against...\n\nBlake Lively is 'terrified' ahead of tonight's Another Simple Favor premiere, as insiders reveal why Anna...\n\nAll that matters is my kids are happy: PADDY McGUINNESS reveals how his unique domestic set-up helps him...\n\nRevealed: The 8 new emoji officially coming to your iPhone - including one face that EVERYONE will use\n\nThe real reason for Kristina Rihanoff and Ben Cohen's split after 'six months of hell' is revealed as the...\n\nFootballer, 19, dies after drowning in his own stomach acid while on the phone to his mother\n\nNatalie Portman shows 'cheating' ex what he's missing as she gets touchy feely with another famous French...\n\nFamily's gut-wrenching reaction as panicked text messages sent by Idaho victims during stabbings are...\n\nIconic 90s band known for smash hit song back in studio for first time in 31 years\n\nThe hunt for Interpol's most wanted: Puppet-master behind UK spy ring was recruited for Putin's intelligence...\n\nMarquess of Ailesbury, 98, who died after falling out of his bedroom window onto a patio at his west London...\n\nEngland legend Stuart Pearce, 62, suffers health scare on flight from Las Vegas as plane is forced to make...\n\nAnnie Kilner is supported by Coleen Rooney at International Women's Day lunch after fellow WAG 'offered...\n\n'Perfectly healthy' 33-year-old woman issues urgent warning after she almost died on long haul flight: 'It's...\n\nElvis Presley's widow Priscilla reveals her family has suffered another tragic loss in heartbreaking post\n\nMy mother forgot who I was. These are the health tips I'm using to avoid the same fate\n\nJennifer Lopez's 'fizzing chemistry' with hunky new co-star revealed amid Ben Affleck rumors he's rekindled...\n\nI've been to every country in Eastern Europe - here are the best places to go and the THREE countries you...\n\nI've traveled to 67 countries, here are the hidden gems and the popular destinations you should skip\n\nI'm 60 but still have tight, smooth skin - my trick is a £2.50 face tool I can't live without\n\nAshley James opens up about her personal struggles with self-worth and body image: 'I want my daughter...\n\nDiddy and Luigi Mangione are TARGETS after brutal stabbing at Brooklyn prison as insiders claim gangs plan...\n\n'You've got the wrong place!' Moment Putin's spy makes one last bluff as armed police storm Bond-style Q's...\n\nInside Bali's execution island: How inmates are shipped to 'Indonesia's Alcatraz' before being led chained...\n\nFailed asylum seeker who was not deported despite repeated crimes against women is jailed after raping a sex...\n\nRevealed: The world's most beautiful dog, according to science\n\nBlundering 4x4 driver gets marooned on beach before it is engulfed by incoming tide\n\nMeghan Markle's new Netflix show is renewed for second season just days after first episodes were panned by...\n\nI'm a GP - women need to know these 'silent' signs of deadly cancer that kills more than 4,000 every year\n\nALISON BOSHOFF: The real reason why James Bond was sold to Amazon after Broccoli dynasty made 'no progress...\n\nBonnie Blue reveals the real reason for her divorce from her husband - and insists it's nothing to do with...\n\nDramatic moment hero retired boxer, 52, disarms airport knifeman after selflessly replacing terrified female...\n\nSex experts bust myths about one of the most misunderstood bedroom kinks\n\nTruth behind Meghan Markle's 'unhygienic' chicken storage - after Netflix viewers say her kitchen practice...\n\nSky Sports presenter reveals she has a brain infection following cancer battle as she provides health update...\n\nBoots owner agrees £18.4bn takeover deal with private equity firm\n\nOld English foxhound 'Sparkle' from the Percy Hunt in Northumberland makes history as she wins Best of Breed...\n\nThe bungling bed-hopping Bulgarian spy ring based in Norfolk hotel: A 'Queen of Lashes' beautician, a...\n\nFriends legend David Schwimmer turns on 'two faced' Hollywood pals for heinous silence\n\nSadiq Khan says he expects Brits to stage mass protests when Donald Trump returns for second state visit -...\n\nMORE HEADLINES\n\nGene Hackman and wife Betsy Arakawa's causes of death revealed\n\nFirst he stabbed the mother, then cruelly violated his ex for two and a half hours before killing her and her sister with a crossbow: How 'evil' Kyle Clifford's murderous plot unfolded\n\nTwist of fate that left mother dead in freak beach accident: Mother slipped and got wedged head-first underwater in front of her daughter as bystanders tried in vain to save her\n\nBritish 'drug dealer' faces execution by firing squad in Bali: Thirty-two-year-old 'who was caught with a kilogram of ecstasy at Airbnb' is paraded in an orange jumpsuit ahead of trial\n\nTrump reduces Trudeau to tears: Canada's outgoing PM cries at press conference after humiliating tariff war with US\n\nTrump threatens devastating new tariffs on Russia unless Putin and Zelensky make peace 'right now'\n\nCan Meghan REALLY call herself Meghan Sussex? What royal protocol says about her preferred name, by REBECCA ENGLISH\n\nCharming countryside village is silently turning into the new Cotswolds as families flock there buy £200k cheaper homes\n\nPassengers watch on in horror as two families brawl over The Karate Kid in the middle of a flight - forcing easyJet plane to make an emergency landing\n\nHow hi-viz workmen digging up roads were in fact criminal gang stealing electricity worth millions to power more than 100 secret Albanian-run cannabis farms producing £21m of illicit drugs\n\nMeghan Markle's new Netflix show is renewed for second season just days after first episodes were panned by critics and fans\n\nHow many people can't speak English in YOUR neighbourhood? Interactive map covering England and Wales's 36,000 districts reveals 43% of residents struggle with the language in one part of the country\n\nDesperate final plea of death row inmate Brad Sigmon before he's shot dead in firing squad TONIGHT\n\nWheelie bin wars! Neighbour from hell's three-year campaign of bullying in dispute about where wheelie bins should go exposed on camera\n\nThe REAL inspiration for Labour's 'two-tier' justice system revealed as fury grows over 'softer sentences' for minority criminals\n\nNorth Korea 'disappears' 20 of its elite soldiers with death notices sent to their loved ones after they 'endangered Kim Jong-un's life' by breaking one simple rule\n\nNetflix comedian Christina Pazsitzky gives scathing review of Meghan Markle's new cookery show telling fans 'she's no Martha f****** Stewart'\n\nHow Prince Harry and Meghan's explosive interview with Oprah REALLY made Prince Philip feel as he battled poor health and the Sussexes refused to postpone the ill-timed broadcast\n\nEurostar chaos forces bride-to-be to miss her own hen party while others lose thousands with dream trips to Paris and Disneyland axed because of WW2 bomb\n\nDramatic moment hero retired boxer, 52, disarms airport knifeman after selflessly replacing terrified female security officer as the attacker's hostage\n\nPutin's promiscuous honey trap spies face jail: Six bed-hopping Bulgarians are convicte","summary":"On Friday, Blake Lively attended the Another Simple Favor premiere at South by Southwest Film & TV Festival in Austin, Texas.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14475155/Blake-Lively-Justin-Baldoni-protestor-outside-Simple-Favor-premiere-SXSW.html","image":"https://i.dailymail.co.uk/1s/2025/03/07/23/95970187-0-image-m-13_1741389846783.jpg","video":null,"publish_date":"2025-03-08 00:05:39","author":"Christine Rendon,Editor,Sarah Sotoodeh","authors":["Christine Rendon","Editor","Sarah Sotoodeh"],"language":"en","category":"politics","source_country":"gb","sentiment":0.332},{"id":297901478,"title":"US Man Executed By Firing Squad For First Time Since 2010","text":"A South Carolina man convicted of murdering his ex-girlfriend's parents was put to death by firing squad on Friday in the first such execution in the United States in 15 years, prison officials said.Brad Sigmon, 67, who confessed to murdering David and Gladys Larke in 2001 with a baseball bat, was executed by a three-person firing squad at the Broad River Correctional Institution in the state capital Columbia, prison spokeswoman Chrysti Shain said.Sigmon had asked the Supreme Court for a last-minute stay of execution but it was denied.South Carolina Governor Henry McMaster also rejected his appeal for clemency.Sigmon had a choice between lethal injection, the firing squad or the electric chair as his manner of execution.Gerald \"Bo\" King, one of his lawyers, said Sigmon had chosen the firing squad after being placed in an \"impossible\" position, forced to make an \"abjectly cruel\" decision about how he would die.\"Unless he elected lethal injection or the firing squad, he would die in South Carolina's ancient electric chair, which would burn and cook him alive,\" King said.\"But the alternative is just as monstrous,\" he said. \"If he chose lethal injection, he risked the prolonged death suffered by all three of the men South Carolina has executed since September.\"The last firing squad execution in the United States was in Utah in 2010. Two others have also been carried out by firing squad in the western state -- in 1996 and in 1977.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");The 1977 execution of convicted murderer Gary Gilmore was the basis for the 1979 book \"The Executioner's Song\" by Norman Mailer.The vast majority of US executions have been done by lethal injection since the Supreme Court reinstated the death penalty in 1976.Alabama has carried out four executions recently using nitrogen gas, which has been denounced by UN experts as cruel and inhumane. The execution is performed by pumping nitrogen gas into a facemask, causing the prisoner to suffocate.Three other states -- Idaho, Mississippi and Oklahoma -- have joined South Carolina and Utah in authorizing the use of firing squads.There have been six executions in the United States this year, following 25 last year.The death penalty has been abolished in 23 of the 50 US states, while three others -- California, Oregon and Pennsylvania -- have moratoriums in place.Arizona, Ohio and Tennessee had paused executions but recently announced plans to resume them.President Donald Trump is a proponent of capital punishment and on his first day in office called for an expansion of its use \"for the vilest crimes.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"A South Carolina man convicted of murdering his ex-girlfriend's parents was put to death by firing squad on Friday in the first such execution in the United States in 15 years, prison officials said.","url":"https://www.ndtv.com/world-news/us-man-brad-sigmon-executed-by-firing-squad-for-first-time-since-2010-7874353","image":"https://c.ndtvimg.com/2025-03/e51bgjvo_brad-sigmon_625x300_08_March_25.jpeg","video":null,"publish_date":"2025-03-08 00:02:59","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"sports","source_country":"in","sentiment":-0.353},{"id":297903356,"title":"World News | Indian Defence Forces to Participate in Mauritius National Day Celebrations, PM Modi to Be Chief Guest","text":"New Delhi [India], March 8 (ANI): A contingent of the Indian defence forces will participate in the celebrations of the National Day of Mauritius, with Prime Minister Narendra Modi as the chief guest for the event, the Ministry of External Affairs announced on Friday. An official statement by the MEA said that, at the invitation of the Prime Minister of Mauritius, Navinchandra Ramgoolam, PM Modi will pay a State Visit to Mauritius from March 11-12 and attend the National Day celebrations of Mauritius on March 12 as the Chief Guest. Also Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'.\n\"A contingent of Indian Defence Forces will participate in the celebrations along with a ship from the Indian Navy. Prime Minister last visited Mauritius in 2015\", the statement added. As per the MEA, during the visit, PM Modi will call on the President of Mauritius, meet the Prime Minister, and hold meetings with other senior dignitaries and leaders of political parties in Mauritius. The Prime Minister will also interact with the members of the Indian-origin community and inaugurate the Civil Service College and the Area Health Centre, both built with India's grant assistance. A number of Memorandums of Understanding (MoUs) will be exchanged during the visit.\nAlso Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine.\nIndia and Mauritius share a close and special relationship rooted in shared historical, cultural and people-to-people ties. Further, Mauritius forms an important part of India's Vision SAGAR, that is, Security And Growth for All in the Region.\nThe Ministry of External Affairs observed that the PM's visit will reaffirm the strong and enduring bond between India and Mauritius and reinforce the shared commitment of both countries to enhance the bilateral relationship across all sectors.\nLast month, Mauritius PM Ramgoolam said while addressing the country's Parliament said, \"I have great pleasure to inform the House that following my invitation, Narendra Modi, Prime Minister of India, has kindly agreed to be the Guest of Honour for our National Day celebrations. It is indeed a singular privilege for our country to host such a distinguished personality who is doing us this honour, despite his very tight schedule and his recent visits to Paris and the United States.\"\nRamgoolam further said that the visit serves as a testament to the strong and enduring relationship between the two countries. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  An official statement by the MEA said that, at the invitation of the Prime Minister of Mauritius, Navinchandra Ramgoolam, PM Modi will pay a State Visit to Mauritius from March 11-12 and attend the National Day celebrations of Mauritius on March 12 as the Chief Guest.","url":"https://www.latestly.com/agency-news/world-news-indian-defence-forces-to-participate-in-mauritius-national-day-celebrations-pm-modi-to-be-chief-guest-6694636.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250307193653.jpg","video":null,"publish_date":"2025-03-08 00:02:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.806},{"id":297899122,"title":"John Swinney mocked for claiming SNP colleague burst into tears after he revealed First Minister bid","text":"AN SNP figure “burst into tears” at the news John Swinney was considering running to become First Minister, the Nats leader claimed last night.\n\nMr Swinney told the Ponsonby and Massie podcast that he caused the emotional outburst from an unknown colleague on the morning Humza Yousaf resigned his post as First Minister.\n\nThe Nats were in crisis with no leader and no Holyrood majority after Mr Yousaf ended the Bute House coalition agreement with the Scottish Greens.\n\nBut Mr Swinney said his decision to run caused relief among some SNP figures - as he admitted he feared for the future of the party.\n\nHe said: “I got a phone call from one of my colleagues, someone very precious to me.\n\n“They phoned me up on the morning Humza Yousaf resigned and said ‘I hate to make this phone call to you but I can’t live with myself if I don’t make it’ and suggested that I should stand.\n\n“I said, well, I’m thinking about it [standing for First Minister] and they burst into tears.\n\n\"And they said the very prospect that you’re even contemplating this, I’m weeping.”\n\nMr Swinney also admitted he was “actively considering” whether he should stand down as an MSP and quit Holyrood at the 2026 election.\n\nWe reported last week how Mr Swinney insisted he plans on staying on as First Minister and standing at the 2031 election too - potentially being in the job for 12 years.\n\nElsewhere, Swinney was accused of risking a trade war by calling for Donald Trump’s UK visit to be cancelled.\n\nThe First Minister was warned his stance could lead to “devastating” retaliation on exports like whisky and salmon.\n\nAnd he was urged by Tory MSP Murdo Fraser to stop “grandstanding on matters he has no control over”.\n\nWe also told how a poll found the Nats are failing on education in a “damning verdict” on John Swinney’s government.\n\nAnd the public was critical of the party’s record on helping those on low incomes as well as on tax bands and climate change.","summary":"","url":"https://www.thescottishsun.co.uk/news/14453526/john-swinney-mocked-colleague-snp-tears/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/03/Off-platform-pics-2025-03-07T223404.480.png?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-03-08 00:01:00","author":"Conor Matchett","authors":["Conor Matchett"],"language":"en","source_country":"gb","sentiment":-0.402},{"id":297899700,"title":"Letters: Donald Trump standing U.S. foreign policy on its head","text":"Trump standing\nforeign policy on its head\n\nRe: “Trump rootin’ for Putin in war with Ukraine” (Page A7, March 4).\n\nMy sons and I returned today from a much-anticipated father-sons trip to Canada to see our beloved San Jose Sharks play in Ottawa and Toronto. At both of the venues, we witnessed 18,000-plus Canadians booing loudly during the playing of our national anthem and singing aloud in deafening fashion during the Canadian anthem, particularly the stanza that includes, “God keep our land glorious and free!”\n\nThe USA is now viewed with scorn and incredulity by our closest historical ally. This well-deserved enmity and undisguised rage is the result of the actions of our resident despotic bully, Donald Trump, and his deplorable sycophants.\n\nAs a 72-year-old American, I take no solace in knowing that our closest allies are Russia and North Korea, dictatorships led by men who murder their political rivals and whom our vacuous president wishes to emulate. Where is the shame?\n\nBarry Goldman-Hall\n\nCommunity failed\ncombatants in stabbing\n\nRe: “Clashing accounts heard in stabbing” (Page A1, March 4).\n\nSince the Santana Row stabbing, which occurred on Feb. 14, I’ve been in disbelief and shock.\n\nThe reason why I’ve been in such disbelief is because Santana Row and Valley Fair mall are both areas that I visit weekly. Whenever I visit these areas, I have always seen huge crowds of people and plenty of security and police officers monitoring the area. It shocks me how something so tragic could occur in an area so populated and monitored. It saddens me that a 13-year-old boy and a 15-year-old boy would be involved in a situation in which one kills the other.\n\nAs a society, we should be educating our young boys to resort to options other than violence. Both of these boys were failed by our community.\n\nErika Morales\n\nTrump tariffs will\nincrease PG&E bills\n\nI am concerned that PG&E gets some of its natural gas from Canada, and Donald Trump’s targeting of Canada for tariffs is going to have a detrimental effect on our utility costs.\n\nA 10%-25% tariff will substantially affect everyone in PG&E’s territory.\n\nRobert Mandler\n\nTariffs prime market\nfor short sales\n\nThere is a stock market strategy known as “selling short,” in which an investor sells quantities of stock that they don’t even own, hoping that the market price will go down. If the investor is right, they can “cover the short” at a future time by buying the same shares at a lower price. If I sell XYZ shares short while they’re priced at $100, then cover the short by buying the shares at $60, I make $40 per share (minus commissions). The trick is knowing that XYZ shares are going to lose market value.\n\nIf I were a liar and a grifter, and I were in a position to declare a series of on-again, off-again tariffs, and I knew that the stock market would react negatively to such news, I could make a killing.\n\nTell me this isn’t exactly what’s happening.\n\nZelenskyy shows Trump\nthe meaning of honor\n\nRe: “Zelenskyy calls Oval Office spat with Trump ‘regrettable’” (Page A4, March 5).\n\nVolodymyr Zelenskyy sees the spat with Donald Trump as “regrettable,” yet is still willing to work with him toward peace. Here’s a perfect example of a real leader.\n\nInstead of ranting and raving, he swallowed his pride for the sake of the people in his country. This is something that Trump could never do — thinking of anyone other than himself. Trump’s not for Americans. His actions are those of a narcissistic dictator. He and his sidekick Elon Musk are money-driven egoists. But Trump, Musk and the GOP are not fully to blame for what’s happening to the honor and integrity of the United States. We, the voters, are to blame.\n\nIs there anyone honorable and brave enough to correct this tragic mistake? God, I hope so. I know I’ll do what I can. Let’s get to work and make America honorable again.\n\nZelenskyy has plenty\nof cards in the game\n\nRe: “Trump, Vance berate Zelenskyy” (Page A1, March 1).\n\nLike many Americans I was appalled by the scene in the Oval Office on Feb. 28.\n\nAccording to President Trump, President Zelenskyy does not have sufficient “cards” in the game. I guess fighting a just war against the Russian aggression and preserving a democracy aren’t enough “cards” in Trump’s view.\n\nKatherine Avila\nSanta Clara\n\nTrump is facilitating\nRussian aggression\n\nDonald Trump has officially joined the Russian side. In addition to stopping funding to Ukraine, Trump also stopped sharing American intelligence with Ukraine. This actively helps Russia attack Ukraine.\n\nWithout the intelligence that helps Ukraine intercept Russian missile attacks, many more Russian missiles will reach Ukraine. On Wednesday night, a Russian missile struck a hotel in central Ukraine. Unfortunately, just before the strike, volunteers from a humanitarian organization from the U.S., U.K. and Ukraine checked in. Luckily, none of them were injured, but four people were killed and more than 30 injured.\n\nThis is reprehensible. Trump is facilitating attacks by Russia on a democratic country. Is this Trump letting us see his true status as a Russian asset?\n\nBarry Jackson","summary":"Also: Community failure &#124; Trump tariffs &#124; Short sales &#124; Meaning of honor &#124; Zelenskyy's cards &#124; Russia. Mercury News reader letters to the editor for March 9, 2025.","url":"https://www.mercurynews.com/2025/03/07/letters-donald-trump-stood-us-foreign-policy-head/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/Trump_Zelenskyy_29453.jpg?w=1024&h=685","video":null,"publish_date":"2025-03-08 00:00:14","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":0.052},{"id":297895582,"title":"Elon Musk disrupts 240 flights with SpaceX rocket explosion after spate of air disasters","text":"The SpaceX Starship explosion caused delays or diversions to around 240 flights, according to the Federal Aviation Administration (Pictures: Middle East Images/Getty Images)\n\nElon Musk’s SpaceX Starship which exploded only minutes after takeoff disrupted hundreds of plane flights as the US is still grappling with a spate of aviation disasters. \n\nThe rocket sent debris flying from Texas where it launched, to as far as the Turks and Caicos Islands in the Caribbean, and interrupted around 240 flights, according to the US Federal Aviation Administration (FAA) on Friday. \n\nSpecifically, the Starship failure on Thursday caused 171 delays in departure averaging 28 minutes, 28 diversions, and 40 planes to hold in the air for 22 minutes on average with the FAA’s Debris Responsive Area active. \n\nThe federal agency also issued ground stops spanning more than an hour at Miami International Airport, Fort Lauderdale-Hollywood International Airport, Palm Beach International Airport and Orlando International Airport in Florida.\n\n Elon Musk said his SpaceX Starship exploding on Thursday was ‘a minor setback’. (Picture: ZUMA Press Wire)\n\nNo one was injured in what was SpaceX’s second test launch explosion within just over a month. Starship’s seventh test flight exploded on January 16 and littered Turks and Caicos with debris. \n\nSpaceX owner Musk, who has been spending much of his time at the White House leading the Trump administration’s Department of Government Efficiency, said the explosion on Thursday was ‘a minor setback’. \n\n‘The next ship will be ready in 4 to 6 weeks,’ wrote Musk on his X (formerly Twitter) platform, adding that ‘progress is measured by time’. \n\nShortly after the Thursday mishap, the FAA called on SpaceX to investigate why the unmanned spaceship imploded. The 123m rocket was supposed to make its way back into the Earth’s orbit after one hour. \n\n Debris streaking through the sky after SpaceX’s Starship spacecraft tumbled and exploded in space, seen from Big Sampson Kay, Bahamas (Picture: Reuters)\n\nStarship is a critical component in Musk’s mission to have humans land on Mars. \n\nThe explosion and resulting disruptions to flights happened just over a month after an American Airlines regional jet and a Black Hawk helicopter collided mid-air and resulted in the worst aviation disaster in the US since 2001. Numerous small plane crashes across the US recently also have Americans nervous about air travel.\n\nA few hundred FAA employees reportedly received termination notices in mid-February from an ‘exec order’ Microsoft email after President Donald Trump vowed to fire air traffic controllers who are not mentally competent for the job.\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"Elon Musk's SpaceX Starship explosion caused hundreds of flights to divert or get delayed.","url":"https://metro.co.uk/2025/03/07/elon-musk-disrupts-240-flights-spacex-starship-rocket-explosion-22691749/","image":"https://metro.co.uk/wp-content/uploads/2025/03/SEI_242963215-168c.jpg?quality=90&strip=all","video":null,"publish_date":"2025-03-07 23:59:01","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","source_country":"gb","sentiment":-0.499},{"id":297897354,"title":"Sadiq Khan says he expects Brits to stage mass protests when Donald Trump returns for second state visit - as Mayor of London insists his views on US President 'have not changed'","text":"London Mayor Sir Sadiq Khan has issued a warning to US President Donald Trump ahead of a potential second state visit to the UK. \n\nThe Labour politician has told the US President that he should prepare to face mass protests upon any return to London after Mr Trump received an invite from King Charles last week.\n\nSir Sadiq said in a Sky News interview on Friday that he expects the British public to turn out in force and 'use their right to free speech and the right to protest'.\n\nMr Trump and Sir Sadiq have shared a tempestuous relationship in the past, with the latter reiterating in the same interview that his views on the US President 'have not changed'.\n\nDuring Mr Trump's previous state visit, Sir Sadiq made headlines when he authorised a blow-up blimp of the controversial Republican Party leader which was flown over Parliament Square.\n\nMore recently, last November saw the London Mayor break Labour Party ranks by issuing a rather disparaging 'congratulatory' message to Mr Trump upon his second US Presidential election victory.\n\n'Progress is not evitable', said Sir Sadiq at the time in a statement which left him painfully at odds with Prime Minister Sir Keir Starmer. He has also previously labelled Mr Trump as 'sexist, homophobic, Islamophobic and racist'.\n\nThe animosity on Sir Sadiq's behalf stems from President Trump's pledge during his first White House term to ban Muslims from gaining entry to the US - a policy which Sir Sadiq blasted as 'ignorant'.\n\nOf course, Mr Trump stayed true to his abrasive style and returned fire, dubbing the London Mayor a 'stone-cold loser' and 'very dumb'. \n\nLast November, Sir Sadiq levelled accusations of racial bias against Mr Trump in an appearance on the High Performance Podcast. \n\n'He wasn't coming for me because I'm five foot six. He's coming for me because of – let's be frank – my ethnicity and my religion, so it's incredibly personal to me', Sir Sadiq said at the time.\n\n'It affects me, my family. What worries me though, it's not about me and my family – it's about the fact that he's the leader of the free world'.\n\nSpeaking on Friday, Sir Sadiq reiterated these words by stating that his 'views on President Trump are known by everybody and haven't changed in his second term'.\n\nHe went on to critique last week's unprecedented Oval Office altercation between President Trump, Vice President JD Vance and Ukrainian President Volodymyr Zelensky and the subsequent decision by the Trump administration to halt the flow of military aid into Ukraine \n\n'I think we are living in unprecedented times. In my adult life I've not seen what I have over the past three years. Russia invading Georgia, annexing Crimea and once again illegally invading Ukraine', Sir Sadiq said.\n\n'What does Russia want? Russia wants the USA to be disentangled with Europe and to leave NATO. Russia is pleased that the UK has left the EU'.\n\nGoing on to admit that he did not agree with the decision to re-invite President Trump for a second state visit, Sir Sadiq said that he 'accepted' Downing Street's stance and need to retain close ties with the US.\n\n'I accept when the government says its in the national interest for President Trump to have a state visit, but for me personally, my views on President Trump in his second term have not changed'. \n\nSir Sadiq continued by issuing a warning to Mr Trump to expect a less than kind welcome from Londoners and the wider UK population should he accept the invitation of King Charles. \n\n'I'm sure you'll see when President Trump comes to the UK, Londoners and Brits exercising their right of freedom of speech and freedom of protest and letting our views be known... \n\n'Unlike the views of Vice President JD Vance, we do have free speech in this country which includes the right to protest. I expect you'll see Londoners and those across the country letting their views be heard loud and clear if and when President Trump comes', Sir Sadiq concluded.\n\nEarlier this week, Scottish National Party (SNP) leader John Swinney echoed Sir Sadiq's misgivings around Mr Trump's muted second state visit.\n\nMr Swinney said that no visit should be considered by government until the Trump administration pledges its 'full scale' support for Ukraine.\n\nHowever, Prime Minister Sir Keir Starmer rubbished these calls, claiming he would not be 'diverted by SNP rhetoric' on the issue.","summary":"London Mayor Sir Sadiq Khan has reignited his long-standing feud with US President Donald Trump by calling on Londoners and the wider British population to stage mass protests over his UK visit.","url":"https://www.dailymail.co.uk/news/article-14475059/Sadiq-Khan-Brits-mass-protests-Donald-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/03/07/22/95969701-0-image-m-60_1741388366596.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/01/1019235011858184601/1024x576_MP4_1019235011858184601.mp4","publish_date":"2025-03-07 23:53:28","author":"Editor,Rory Fleming","authors":["Editor","Rory Fleming"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.057},{"id":297894348,"title":"Trump hits pause on tariffs - but still sees them as vital tool","text":"Some scepticism about that comfort might be understandable, given the abrupt policy turns on tariffs Trump made this week, as financial markets dropped and the outcry from US businesses intensified.\n\nThose who see Trump's tariff threats as economic bluster might be tempted to conclude that he wants to talk tough, but flinches at the first signs of economic damage.\n\nBut that view is to some extent undermined by the trade war against China he started in his first term which has seriously intensified. \n\nIn just a few weeks, Trump has raised taxes to at least 20% on all Chinese imports.\n\nIt means the average effective tariff rate on imports from China now stands at roughly 34%, because taxes on some sectors - like electric vehicles and steel - stand at much higher rates.\n\nThe 25% tariff on Mexican and Canadian goods hasn't completely gone away either. The levy still stands on goods that aren't compliant with a trade deal that Trump negotiated in his first term - and so some goods coming from both neighbours will still be subject to it.\n\nTrump expands exemptions from Canada and Mexico tariffsWhat are tariffs and why is Trump using them?China says it is ready for 'any type of war' with US\n\nThe White House also says its much-touted reciprocal tariffs targeting nearly all US trade partners are still in the pipeline. The details, they say, will be unveiled on 2 April, with rates tailor-made to address whatever policies other countries impose that officials consider unfair - whether in the form of taxes on US tech firms, Value-Added Taxes, or other import rules.\n\n\"It's a certainty – reciprocal tariffs are coming,\" Trump's senior adviser on trade and manufacturing Peter Navarro told business broadcaster CNBC on Friday.\n\nHe said the White House had seen signs that its threats alone were spurring car companies to start taking action and bolster their supply chains in the US - exactly the kind of investment that Donald Trump says his tariffs will spur.\n\n\"They're getting the picture,\" Navarro said.","url":"https://www.bbc.com/news/articles/c4gmjmymg0no","image":"https://ichef.bbci.co.uk/news/1024/branded_news/7942/live/182fc9f0-fba7-11ef-896e-d7e7fb1719a4.jpg","video":null,"publish_date":"2025-03-07 23:50:58","author":"Natalie Sherman","authors":["Natalie Sherman"],"language":"en","source_country":"gb","sentiment":-0.109},{"id":297903344,"title":"World News | Defendant in $250 Million Pandemic Food Fraud Case Pleads Guilty to Wire Fraud","text":"Minneapolis, Mar 8 (AP) A man accused of witness tampering in a courtroom hallway pleaded guilty Friday to wire fraud for his role in a scheme that prosecutors said stole $250 million from a federally funded program meant to feed children. The allegation of witness tampering against Abdinasir Abshir, 32, of Lakeville, surfaced last month in the trial of the alleged ringleader, Aimee Bock, the founder of the now-defunct nonprofit Feeding Our Future, and Salim Said, a former Minneapolis restaurant owner. Also Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'. Seventy defendants have been charged altogether. Abshir was the 37th to plead guilty. Five were convicted last year in the first trial. The ongoing trial of Bock and Said is the second in the case. Abshir was due to stand trial in August as part of a later group. That first trial was marred by an alleged attempt by some defendants and people linked with them to bribe a juror with a bag of $120,000 in cash. That juror went straight to police. That led to tighter security for Bock's trial, and additional precautions ordered by U.S. District Judge Nancy Brasel. Also Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine. Under Abshir's plea deal, both sides agreed that federal guidelines recommend 63 to 78 months in prison on the wire fraud count, a sentence made tougher because of Abshir's attempt to intimidate the witness. He also agreed to pay nearly $2.3 million in restitution and forfeit a 2021 Range Rover he bought with his proceeds. Brasel noted that she is not bound by the recommendations and did not set a sentencing date. Prosecutors alleged that Abshir approached a government witness and asked to speak with him in a courthouse bathroom. That witness, Sharmake Jama, the former owner of a Rochester restaurant, pleaded guilty earlier and agreed to testify against Bock and Said. Jama declined to enter the bathroom and instead told his lawyer, who informed prosecutors. Earlier that day, court filings show, Abshir and another man had entered the courtroom loudly, apparently aware that a postal inspector was expected to testify about Abshir's role. Abshir and the other man sat in the front row, close to the jury box, and continued to be disruptive until security approached them and they left. Then Abshir approached Jama, who was sitting on a bench in the hallway, waiting to testify. Abshir was later taken back into custody. In a detention order Thursday, Magistrate Judge Tony Leung found probable cause that Abshir committed a felony by attempting to intimidate Jama. “Like the jury tampering that has been alleged to have occurred in the only other Feeding Our Future case tried thus far, intimidation of a witness is also a direct attack on the integrity, efficacy, and reliability of this nation's judicial system,\" Leung wrote. \"The disregard for norms of laws and rules is all the more brazen in the context of the heightened scrutiny after the jury tampering charges stemming from the previously tried case.” Abshir was accused of opening a fraudulent food distribution site called Stigma Free Mankato. Prosecutors allege he and his brother falsely claimed to have served more than 1.6 million meals to children in 2020 and 2021 in Mankato, a city of about 46,000 people. They allegedly collected $5.4 million. Abshir admitted to his role in that, and to paying $100,000 in bribes and kickbacks to a Feeding Our Future employee. Defense attorney Craig Cascarano acknowledged that it was “a huge misstep on his part” for Abshir to approach the witness. “It was a shocking incident,” Cascarano told the judge. In ordering Abshir held without bail, Brasel cited the “flagrant actions” he took “not very far” from her bench, after warning him that going forward, it would be “a really bad idea” to for him try to talk to other witnesses or defendants. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A man accused of witness tampering in a courtroom hallway pleaded guilty Friday to wire fraud for his role in a scheme that prosecutors said stole $250 million from a federally funded program meant to feed children.","url":"https://www.latestly.com/agency-news/world-news-defendant-in-250-million-pandemic-food-fraud-case-pleads-guilty-to-wire-fraud-6694632.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-07 23:50:07","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.415},{"id":297901476,"title":"Islamic Bloc Adopts Arab Nations' Counter To Trump's Gaza Takeover Plan","text":"The Organisation of Islamic Cooperation on Friday endorsed an Arab League counter-proposal to US President Donald Trump's controversial plan to take over Gaza and displace its residents, two ministers told AFP.The decision by the 57-member grouping came at an emergency meeting in Jeddah, Saudi Arabia, three days after the Arab League ratified the plan at a summit in Cairo.The Egyptian-crafted alternative to Trump's widely condemned takeover proposes to rebuild the Gaza Strip under the future administration of the Palestinian Authority.\"The emergency ministerial meeting of the Organisation of Islamic Cooperation adopted the Egyptian plan, which has now become an Arab-Islamic plan,\" Egyptian Foreign Minister Badr Abdelatty said, in comments echoed by his Sudanese counterpart.\"It is certainly a very positive thing,\" Abdelatty said.Trump triggered global outrage by suggesting the US \"take over\" Gaza and turn it into the \"Riviera of the Middle East\", while forcing its Palestinian inhabitants to relocate to Egypt or Jordan.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");At Tuesday's summit in Cairo, Arab leaders also announced a trust fund to pay for Gaza's reconstruction and urged the international community to back it.\"The next step is for the plan to become an international plan through adoption by the European Union and international parties such as Japan, Russia, China and others,\" Abdelatty said.\"This is what we will seek and we have contact with all parties, including the American party.\"However, the counter-proposal does not outline a role for Hamas, which controls Gaza, and was rejected by both the United States and Israel.The plan \"does not meet the expectations\" of Washington, State Department spokeswoman Tammy Bruce told reporters on Thursday.Trump's Middle East envoy Steve Witkoff gave a more positive reaction, calling it a \"good-faith first step from the Egyptians\".Rabha Seif Allam, of the Al-Ahram Center for Political and Strategic Studies in Cairo, said Egypt was seeking \"broad support\" for its proposal.\"This is an attempt to build a broad coalition that refuses the displacement\" of Palestinians from Gaza, she said.Trump's plan has already united Arab countries in opposition, with Saudi Arabia also hosting Arab leaders two weeks ago to discuss alternatives.The OIC also readmitted Syria, which was suspended in 2012 early in the civil war under Bashar al-Assad, following the long-time ruler's toppling in December.\"This decision represents an important step towards Syria's return to the regional and international communities as a free and just state,\" a Syrian foreign ministry statement said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The Organisation of Islamic Cooperation on Friday adopted the Arab League's counter-proposal to US President Donald Trump's plan to take over Gaza and displace its residents, two ministers told AFP.","url":"https://www.ndtv.com/world-news/islamic-bloc-oic-adopts-arab-nations-counter-to-trumps-gaza-takeover-plan-7874293","image":"https://c.ndtvimg.com/2025-03/e5keqnf8_oic_625x300_08_March_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-03-07 23:45:22","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.319},{"id":297900636,"title":"Canada To Become US&#8217; 51st State? Trump Tells Trudeau To ‘Revise’ U.S.-Canada Border, End Treaty On Sharing Great Lakes","text":"President Donald Trump reportedly proposed a revision of the US-Canada border during a phone conversation with Canadian Prime Minister Justin Trudeau last month, raising concerns that the US president's ultimate goal might be to annex Canada.\nAccording to a report by The New York Times published on Friday, the two leaders spoke twice on February 3 regarding US tariffs on Canadian goods. While Trudeau initially interpreted Trump's reference to him as Canada’s “governor” as a joke, he later came to believe the remarks signaled a more serious intent.\nLongstanding Trade Grievances With Canada\nCiting four sources familiar with the discussions, The Times reported that Trump presented a list of grievances about the trade relationship between the two nations. These included Canada’s protected dairy sector, barriers facing American banks operating in Canada, and Canadian consumption taxes that Trump viewed as unfairly making American goods more expensive.\nHowever, the report indicated that Trump's comments went beyond trade disputes. The president reportedly told Trudeau that he did not consider the 1908 treaty establishing the US-Canada border to be valid and expressed his desire to revise the boundary. Trump did not provide further details on how he envisioned altering the border.\nWater Sharing Agreements Between US and Canada at Risk\nDuring the call, Trump also brought up the sharing of lakes and rivers between the two countries, an issue governed by several longstanding treaties. The report noted that Trump had previously expressed interest in revisiting these agreements. Canadian officials reportedly took the comments seriously, particularly in light of Trump's past statements about wanting to bring Canada to its knees.\nAdditionally, Trump reportedly expressed a desire to tear up agreements regulating the management of the Great Lakes—Superior, Michigan, Huron, Erie, and Ontario—a position that was later echoed privately to Canadian officials by US Commerce Secretary Howard Lutnick.\nTrudeau's Response\nSpeaking on Tuesday, Trudeau suggested that Trump's underlying objective was to pressure Canada into accepting US statehood. “What he wants is to see a total collapse of the Canadian economy, because that’ll make it easier to annex us,” the Canadian prime minister said.\nThe reported conversations have heightened tensions between the two countries, raising concerns among Canadian officials about the future of US-Canada relations.\nAlso Read: Trump Punishes Columbia University, Cancels $400 Million Federal Grants Over Alleged Anti-Semitism Inaction","summary":"President Donald Trump reportedly proposed redrawing the US-Canada border during a recent call with Prime Minister Justin Trudeau, sparking fears of a potential bid to annex Canada. The revelation has further strained ties between the two nations, already at odds over trade disputes and water-sharing agreements.","url":"https://www.newsx.com/world/canada-to-become-us-51st-state-trump-tells-trudeau-to-revise-u-s-canada-border-end-treaty-on-sharing-great-lakes/","image":"https://www.newsx.com/wp-content/uploads/2025/03/Canada-Trudeau-Trump-51st-State-US-Canada-Canada-Border-Great-Lakes.webp","video":null,"publish_date":"2025-03-07 23:44:53","author":"Zubair Amin","authors":["Zubair Amin"],"language":"en","category":"politics","source_country":"in","sentiment":-0.006},{"id":297897484,"title":"As top podcasters host rank antisemites, Jews need to stand up to the bullies across the spectrum","text":"Joe Rogan, the host of the world’s most popular podcast, welcomed Ian Carroll as his guest this week.\n\nCarroll is a crackpot conspiracist, known for sharing such chestnuts as “the Jews did 9/11,” and he regaled Rogan with tales of how Jeffrey Epstein was secretly a Mossad agent sent by the devious Israeli government to ensnare America’s unsuspecting elites.\n\nNot to be outdone, Theo Von, another wildly popular podcaster, dedicated this week’s episode to a conversation with Candace Owens, who sweetly asked the host if he’d ever noticed how the Jews really only take care of their own.\n\nOther examples abound. \n\nEverywhere you look these days, you see throngs of influencers gaining fame and fortune posing as brave truth-tellers, unafraid to criticize the all-powerful, sinister Jews.\n\nThat these pronouncements are made freely, with no attempt at censorship, on some of the world’s most highly watched platforms doesn’t spoil the fun for these preening paranoids: In their minds, the Jews are always out to get them and everyone else.\n\nAnd their millions of followers seem to believe this gunk, too: Having dispensed with the woke left, the woke right has now settled on the Jews as the villains that must be vanquished.\n\nIt’s understandable, then, that Jews everywhere this week rushed to ask what could be done about this surge of antisemitism on the right.\n\nAnd the solution to the problem, hallelujah, is simple. \n\nIt’s one most of us alighted on some time in middle school, and it requires no particular resources.\n\nWant to fight antisemitism? \n\nHere we go.\n\nFirst, instead of holding up pictures of your hostages and demanding that the world empathize over their barbaric captivity and murder, realize this: The world doesn’t care. \n\nNever has, never will.\n\nWhen you demand that people feel sorry for you, you just look weak.\n\nThis is where the wisdom we earn in high school comes in handy: Bullies savor the weak, because when they pester the weak, they’re guaranteed to get precisely the emotional response they crave.\n\nThe only way out of this cycle of degradation is being strong. \n\nAnd, alas, these past 500 days or so, Jews everywhere have been very bad at doing just that.\n\nIn America, Jews held mournful vigils for the hostages, complete with Holocaust-era rhetoric.\n\nNone, sadly, considered a march, say, to celebrate the elimination of mass murderers like Hassan Nasrallah or Yahya Sinwar, to say nothing of 20 or 30 strapping young lads marching onto Columbia’s campus and making it understood that the Hamas encampments must now end or else.\n\nSuch actions would’ve sent a very clear message to the bullies that the Jews aren’t to be trifled with again.\n\nThat, of course, is precisely the point of Zionism.\n\nA sovereign and strong Jewish nation is the ultimate answer to the world-doesn’t-care problem: We don’t need the world to care when we have nukes.\n\nBut the great tragedy of the last year and a half was the Israeli government’s inability to stand up to the moment and act as a sovereign and strong Jewish nation ought to have done.\n\nWhile winning some tactical victories (see under: Beepers, exploding) and degrading Hamas’ fighting capabilities, Israel kept insisting, correctly, that it was hampered by a hostile Democratic administration kneecapping it at every turn.\n\nBut then came Donald Trump’s election, and the new president couldn’t have been clearer on what needs to be done in Gaza.\n\nInstead of leaping into action, however, Prime Minister Benjamin Netanyahu sent his emissaries to explain meekly why Trump’s plan was impractical, and continued equivocating over the next step of the cease-fire deal with Hamas.\n\nTrump, meanwhile, was talking about the gates of hell opening should all captives not be released immediately.\n\nEven with this unprecedented blank check from the Oval Office, Israel could not follow up with action.\n\nAnd that is the epitome of weakness.\n\nWhen the antisemitic freaks saw the big, bad Israeli state whimper and waffle, they knew their moment had arrived.\n\nWhere does all this leave us? \n\nThankfully, in a good place.\n\nIf you want to fight antisemitism, stop ululating about Joe Rogan, or Columbia University, or the left, or the right, or whoever.\n\nStop begging the world to understand you or feel sorry for you.\n\nStop finding any excuse you can to be perfectly swell while your enemies hack away at you.\n\nIn short: Stop being weak.\n\nLeave bad institutions, bad leaders and bad habits behind, and spend your days doing wonderful, beautiful, constructive Jewish things: Have more Jewish babies. \n\nLearn more Torah. \n\nBuild new Jewish institutions. \n\nBecome stronger in spirit and in flesh.\n\nAnd when you do, take a break and look up: You’ll be surprised to see that the freaks who were picking at you when you were quivering have all disappeared. \n\nLiel Leibovitz is editor at large for Tablet and senior fellow at the Hudson Institute.","summary":"The only way out of this cycle of degradation is being strong.","url":"https://nypost.com/2025/03/07/opinion/as-top-podcasters-host-antisemites-jews-need-to-stand-up-to-bullies-across-the-spectrum/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/DLEODOEM.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-07 23:42:23","author":"Liel Leibovitz","authors":["Liel Leibovitz"],"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":297895756,"title":"Day in Photos: Police Disperses Rally in Bangladesh, Cyclone in Australia, US Space Force Test Flight Lands","text":"Pilots from the Indian Air Force's Surya Kiran aerobatics team take part in an aerial display during the Royal Thai Air Force 88th Anniversary Air Show in Bangkok, Thailand, on March 7, 2025. Lillian Suwanrumpha/AFP via Getty Images\n\nA mahout walks with his elephant along a street in Biyagama, Sri Lanka, on March 7, 2025. Ishara Kodikara/AFP via Getty Images\n\nYoung men crouch behind a wall as they play in record-breaking waves caused by the outer fringe of Tropical Cyclone Alfred at Point Danger in Coolangatta, Australia, on March 7, 2025. David Gray/AFP via Getty Images\n\nFrench President Emmanuel Macron addresses the media during a press conference at the end of a Special European Council to discuss continued support for Ukraine and European defense at the EU headquarters in Brussels, Belgium, on March 6, 2025. Ludovic Marin/AFP via Getty Images\n\nIndian Army cadets perform Kalaripayattu martial arts during an activity display at the Officers Training Academy in Chennai, India, on March 7, 2025. R.Satish Babu/AFP via Getty Images\n\nA Palestinian Muslim woman talks to an Israeli soldier at a checkpoint in Bethlehem in the occupied West Bank on March 7, 2025. Hazem Bader/AFP via Getty Images\n\nThe X-37B Orbital Test Vehicle-7, the U.S. Space Force’s dynamic unmanned spaceplane, successfully deorbited and landed at Vandenberg Space Force Base, Calif., on March 7, 2025. United States Space Force via AP\n\nBritish Foreign Secretary David Lammy (2nd-L) and Secretary of State for Business and Trade Jonathan Reynolds (L) meet with Japanese Foreign Minister Takeshi Iwaya and Economy, Trade and Industry Minister Yoji Muto (R) at their Japan-UK 2+2 economic meeting in Tokyo on March 7, 2025. Issei Kato/AFP via Getty Images\n\nA forensic police officer inspects the site of a fire in the center of Arnhem, Netherlands, on March 7, 2025, a day after a fire destroyed part of the city's historic center. Rob Engelaar/ANP/AFP via Getty Images\n\nStudents shout slogans during a demonstration asking for justice for the victims of the country's worst rail disaster in 2023, in Athens, Greece, on March 7, 2025. Aris Messinis/AFP via Getty Images\n\nThe U.S. consulate in Nuuk, Greenland, on March 7, 2025. President Donald Trump has repeatedly signaled that he wants control over Greenland, an autonomous Danish territory that will hold legislative elections on March 11. Odd Andersen/AFP via Getty Images\n\nFighters with the new Syrian government load a rocket launcher in Baniyas, Syria, on March 7, 2025. Ali Haj Suleiman/Getty Images\n\nDalmatian dogs attend the second day of the Crufts dog show at the National Exhibition Centre in Birmingham, England, on March 7, 2025. Oli Scarff/AFP via Getty Images\n\nA firefighter extinguishes a burning car at a site of a Russian strike in Kharkiv, Ukraine, on March 7, 2025. Sergey Bobok/AFP via Getty Images\n\nPolish government members applaud Prime Minister Donald Tusk after his speech in parliament on the situation in Ukraine, in Warsaw, Poland, on March 7, 2025. Wojtek Radwanski/AFP via Getty Images\n\nPolice break down the door of a house during an operation in the neighborhood where at least 22 people were killed on the eve in Guayaquil, Ecuador, on March 7, 2025. Rival factions of an Ecuadoran drug trafficking gang fought Thursday in the port city of Guayaquil, leaving at least 22 people dead, officials said. Marcos Pin/AFP via Getty Images\n\nResidents carry their belongings during the demolition in Otumara neighborhood in Lagos, Nigeria, on March 7, 2025. Olympia de Maismont/AFP via Getty Images\n\nArrival of Yulia Svyrydenko, Deputy Prime Minister and Minister of the Economy of Ukraine, Jean Noel, Barrot Minister of Europe, and Foreign Affairs Eric Lombard Minister of the Economy, Finance and Industrial and Digital Sovereignty and Laurent Saint Martin Minister Delegate in charge of Foreign Trade and the French Abroad at the presentation of the Ukraine Fund and the 19 winning reconstruction and resilience projects led by French companies at the Ministry of the Economy, Finance and Industrial and Digital Sovereignty in Paris on March 7, 2025. Bastien Ohier/Hans Lucas/AFP via Getty Images\n\nA seller cleans a used car part in the new N'dotre scrapyard in the popular commune of Abobo in Abidjan, Ivory Coast, on March 7, 2025. Sia Kambou/AFP via Getty Images\n\nPresident Donald Trump speaks from the Oval Office of the White House on March 7, 2025. Jim Watson/AFP via Getty Images\n\nRescue teams evacuate flood victims after a flash flood struck the village at Gumelar village in Sukabumi, Indonesia, on March 7, 2025. Edo Bss/AFP via Getty Images\n\nSupporters of impeached South Korean President Yoon Suk Yeol gather in front of the Seoul Detention Center in Uiwang, South Korea, on March 7, 2025. Yoon was released from custody Friday after a court accepted his request to cancel his arrest over his short-lived imposition of martial law. Chung Sung-Jun/Getty Images\n\nWorkers do a quality control check on cars at the Volkswagen automobile factory in Wolfsburg, Germany, on March 7, 2025. Sean Gallup/Getty Images\n\nPhilippine Army troops fire rounds from Sabrah light tanks during live fire exercises in Tarlac, Luzon, Philippines, on March 7, 2025. Ezra Acayan/Getty Images","summary":"A look into the world through the lens of photography.","url":"https://www.theepochtimes.com/article/day-in-photos-police-disperses-rally-in-bangladesh-cyclone-in-australia-us-space-force-test-flight-lands-5822035","image":"https://img.theepochtimes.com/assets/uploads/2025/03/07/id5822039-GettyImages-2203179609-LSedit-300x180.jpg","video":null,"publish_date":"2025-03-07 23:41:15","author":"Epoch Times Staff","authors":["Epoch Times Staff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.003},{"id":297899094,"title":"The Right’s Trump Derangement Syndrome","text":"Shortly before the last election, Scott Bessent, now Donald Trump’s Treasury secretary, assured The Financial Times that Trump had no interest in reducing international trade and that his threats to impose sweeping, 20 percent tariffs on foreign goods were simply a “maximalist” negotiating position to be watered down during trade talks. “My general view is that at the end of the day, he’s a free trader,” said Bessent.\n\nA few weeks later, CNN’s Kaitlan Collins asked Howard Lutnick, now Trump’s commerce secretary, whether Robert F. Kennedy Jr. could become secretary of health and human services. “Of course not,” said Lutnick, treating the question as if it were absurd.\n\nDuring the transition, Senator Thom Tillis, Republican of North Carolina, acted indignant when Democrats asked Pam Bondi, now Trump’s attorney general, if she and the president-elect might consider blanket pardons for Jan. 6 insurrectionists. “I was the last member out of the Senate on Jan. 6,” said Tillis. “I walked past a lot of law enforcement officers who were injured. I find it hard to believe that the president of the United States, or you, would look at facts that were used to convict the violent people on Jan. 6 and say it was just an intemperate moment.”\n\nJust last month, Representative Dan Crenshaw of Texas, who is both a Trump apologist and a supporter of Ukraine, insisted that when Trump trashes Ukraine’s president, Volodymyr Zelensky, it’s actually a sign of affection. “Trump tends to talk that way to his friends,” said Crenshaw. “He tends to talk nicer to his enemies. So if he’s talking to you that way, it still means you’re his friend.”","summary":"They keep pretending the president is someone he’s not.","url":"https://www.nytimes.com/2025/03/07/opinion/republicans-trump-derangement-syndrome.html","image":"https://static01.nyt.com/images/2025/03/09/multimedia/07goldberg-ftcj/07goldberg-ftcj-facebookJumbo.jpg","video":null,"publish_date":"2025-03-07 23:39:09","author":"Michelle Goldberg","authors":["Michelle Goldberg"],"language":"en","category":"politics","source_country":"us","sentiment":-0.009},{"id":297893566,"title":"Justice Dept. Doubles Down on Request to Break Up Google","text":"WASHINGTON -- In a sign that President Donald Trump is following the Biden administration's lead in reining in Google, the Justice Department on Friday reiterated its demand that a court break up the search giant.\n\nThe request followed a landmark ruling last year by Judge Amit Mehta of U.S. District Court for the District of Columbia that found Google had illegally maintained a monopoly in online search by paying web browsers and smartphone manufacturers to feature its search engine. The judge is scheduled to hear arguments on proposed solutions from the government and Google in April.\n\nUnder the Biden administration last year, the Justice Department asked Mehta in a preliminary filing to force Google to sell its popular web browser, Chrome, among other remedies. The department's lawyers on Friday reiterated that demand, which could reshape internet competition.\n\n\"Google's illegal conduct has created an economic goliath, one that wreaks havoc over the marketplace to ensure that -- no matter what occurs -- Google always wins,\" the government said in its Friday filing. \"The American people thus are forced to accept the unbridled demands and shifting, ideological preferences of an economic leviathan in return for a search engine the public may enjoy.\"\n\nThe Justice Department's decision to stick with its proposal to fundamentally alter the $2 trillion company's business is one of the first signals from the new administration on how it may approach tech regulation. The requests, the most significant remedies proposed in a tech monopoly case since the Justice Department asked to break up Microsoft in 2000, could presage how Trump's appointees will handle a string of other antitrust cases that challenge the dominance of tech behemoths.\n\nDuring a trial in 2023, the government said Google locked out rivals by signing deals with Apple, Mozilla, Samsung and others to automatically appear as the search engine when users opened a smartphone or new tab in a web browser. Google paid $26.3 billion for those arrangements in 2021, according to evidence presented at the trial.\n\nGoogle argued that its deals had not broken the law, and that users chose its search engine because it was better at finding information than rivals like Microsoft's Bing or DuckDuckGo.\n\nMehta is scheduled to preside over a hearing next month to determine remedies in the case.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- In a sign that President Donald Trump is following the Biden administration's lead in reining in Google, the Justice Department on Friday reiterated its demand that a court break up the search giant.","url":"https://www.berkshireeagle.com/nyt/justice-dept-doubles-down-on-request-to-break-up-google/article_ae489b6b-cbd7-5d8f-8e6c-65c2bc69dec3.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:36:26","author":"David McCabe,Judge Amit Mehta","authors":["David McCabe","Judge Amit Mehta"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.455},{"id":297893846,"title":"Florida Wildfire Risk Map Shows Threat to Mar-a-Lago","text":"There is a high threat for wildfires at President Donald Trump's resort residence at Mar-a-Lago as well as all of Palm Beach County, according to a wildfire risk map from Florida Department of Agriculture and Consumer Services (FDACS).Newsweek reached out to a Mar-a-Lago representative by email for comment.Why It MattersWildfire season runs year-round in the Sunshine State, though it peaks from late spring through summer when drought is most widespread.So far this year, more than 600 fires have ignited across the state, burning more than 8,700 acres of land. As of Friday evening, there are 18 active fires burning in Florida.Trump's Mar-a-Lago estate has a 62,000-square-foot perimeter, which makes it the 22nd largest house in the United States—larger than the White House. The president splits his time between there and the White House and his property portfolio in New York City.What To KnowOne of the fires is burning in Palm Beach County where Mar-a-Lago is located. The flames are on the opposite side of the county than Mar-a-Lago. The fire is 10 acres in size and 90 percent contained, according to the most recent update.On Friday morning, National Weather Service (NWS) meteorologists warned of sensitive fire weather conditions persisting across parts of Florida through Friday.The estimated fire danger for Friday was highest in south Florida, including Mar-a-Lago and Palm Beach County, and in north-central Florida. All of these areas were classified as having a \"high\" fire risk, according to the map from FDACS.The rest of Florida was classified as having \"moderate\" risk.\"The Florida Forest Service uses the Wildland Fire Danger Index (FDI) for estimating the potential for a fire to start and require suppression action on any given day,\" information included with the map said. \"It does not consider how quickly any fires that do start will grow, or how difficult they will be to suppress.\"In addition to the active fires burning throughout the Sunshine State, numerous fires are marked as \"contained\" and are no longer considered active fires. There are also several fires that are marked as reported and have not yet been labeled as active.What People Are SayingNWS office in Miami wrote in a post on X, formerly Twitter, on Thursday: \"Numerous reports of smoke have been reported from Broward county. The source of this smoke is coming from a couple of fires in western Palm Beach county, and the brisk NW winds are carrying this smoke into portions of the metro.\"NWS office in Melbourne, Florida, in a weather statement: \"Despite lighter winds today, fire-sensitive weather conditions will continue as relative humidity values plummet to between 25 and 35 percent over all but the immediate coast this afternoon.\"What Happens Next?NWS meteorologist Megan Tollefsen previously told Newsweek that the sensitive fire weather conditions will start to improve heading into the weekend.","summary":"Sensitive fire weather conditions were in place across Florida on Friday, including at Mar-a-Lago in Palm Beach County.","url":"https://www.newsweek.com/florida-wildfire-risk-map-shows-threat-mar-lago-donald-trump-2041539","image":"https://d.newsweek.com/en/full/2602966/wildfire-risk-map-mar-lago.png","video":null,"publish_date":"2025-03-07 23:34:51","author":"Anna Skinner","authors":["Anna Skinner"],"language":"en","source_country":"US","sentiment":0.047},{"id":297893538,"title":"Fed in No Hurry to Adjust Rates Amid Trump Policy Uncertainty","text":"Jerome Powell, chair of the Federal Reserve, said the central bank is focused on the \"net effect\" of President Donald Trump's economic agenda, amid high uncertainty about which policies will actually be enacted, as he reiterated that officials are still not in a \"hurry\" to adjust interest rates.\n\n\"As we parse the incoming information, we are focused on separating the signal from the noise as the outlook evolves,\" Powell said at an event Friday. \"We do not need to be in a hurry, and are well positioned to wait for greater clarity.\"\n\nIf inflation stays sticky but the economy remains strong, the Fed chair said the central bank can \"maintain policy restraint for longer.\" But if either the labor market were to weaken more than expected, or inflation were to rapidly decline, Powell said officials can \"ease policy accordingly.\"\n\nHis comments underscore the delicate balancing act the Fed is trying to navigate at a tenuous moment for the economy.\n\nSpeaking at the same event earlier Friday, Michelle Bowman, a Fed governor, said as inflation returns to the central bank's 2% target, the labor market and economic activity \"will become a larger factor\" in policy discussions.\n\nThe Fed is expected to hold interest rates steady at 4.25% to 4.5% when officials gather March 18-19, extending a pause that has been in place since January. But its decisions after that point may get more fraught, especially if the economy weakens and price pressures rise to the extent economists fear.\n\nHow significantly Trump's tariffs will impact the economy is not yet known. The president has flip-flopped on levies he placed on Mexico and Canada this week but has kept the threat alive by issuing only a short-term reprieve. Sweeping retaliatory tariffs are also still on the table, as are other penalties on aluminum, steel and other products. The size of the potential impact depends on the duration of the policies and how fervently other countries protect themselves with retaliatory measures and how businesses and consumers adapt to higher costs.\n\nThe Fed is having to consider these implications alongside other policies Trump is pursuing, including mass deportations and steep cuts to government spending, which are expected to drag down growth. Tax cuts and deregulation efforts, which make up the other part of the president's economic agenda, may help to bolster business activity, but to what extent is unclear.\n\nThis article originally appeared in The New York Times.","summary":"Jerome Powell, chair of the Federal Reserve, said the central bank is focused on the \"net effect\" of President Donald Trump's economic agenda, amid high uncertainty about which policies will actually be enacted, as he reiterated that officials are still…","url":"https://www.berkshireeagle.com/nyt/fed-in-no-hurry-to-adjust-rates-amid-trump-policy-uncertainty/article_a6396299-2bbf-5cbb-b8ce-9f0805da6f84.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:33:13","author":"Colby Smith,North Adams Pride","authors":["Colby Smith","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":0.148},{"id":297895940,"title":"How much is Karoline Leavitt’s wealth?","text":"What is Karoline Leavitt’s Net Worth and Salary?\n\nKaroline Leavitt is a political aide and government official who has a net worth of $100 thousand. Karoline Leavitt became the White House press secretary under Donald Trump in 2025. Previously, she served as a presidential writer and assistant press secretary for Trump. In 2022, Leavitt unsuccessfully ran for the US House of Representatives in New Hampshire’s 1st district, and later was found to have committed campaign finance fraud.\n\nFinancial Summary\n\nKaroline Leavitt’s official financial disclosures reveal no significant personal assets, liabilities, or net worth during her congressional campaign. In her 2021 House candidate filing, she reported no assets, such as investments, real estate, or bank accounts, and no unearned income. This remained unchanged in her 2022 campaign disclosure, indicating she had no major financial holdings at the time.\n\nLeavitt also reported no liabilities, listing no debts, loans, or financial obligations in her disclosures. While her campaign incurred debt, those obligations were tied to the campaign itself and not her personal finances. Because she had zero reported assets and liabilities, her disclosed net worth was effectively near zero, based solely on any cash savings from her salary. Her earned income for 2021 was around $70,000, with a prior year’s salary of $48,800, but no investments or property.\n\nAs the White House Press Secretary, Leavitt earns an estimated $180,000 per year, a substantial increase from her prior earnings. This salary is consistent with past press secretaries and falls within the Executive Schedule Level IV pay grade, which applies to high-ranking government officials. The role comes with standard federal benefits, including retirement contributions and health insurance, significantly improving her financial standing compared to her time as a congressional candidate.\n\nEarly Life and Education\n\nKaroline Leavitt was born on August 24, 1997 in Atkinson, New Hampshire. Her family owned an ice cream shop and a used truck dealership in nearby Plaistow. As a teenager, Leavitt went to Central Catholic High School in Lawrence, Massachusetts. After graduating in 2015, she went to Saint Anselm College in New Hampshire on an NCAA Division II softball scholarship. In college, Leavitt became a supporter of Donald Trump, writing op-eds in the college paper defending his 2017 travel ban and his attack on the news media. She also founded Saint Anselm College’s first broadcasting club, worked at Hearst Television’s WMUR-TV, and interned at Fox News. Leavitt graduated in 2019 with a bachelor’s degree in communications and politics.\n\nGovernment Positions\n\nAfter graduating from college, Leavitt became an assistant press secretary in the White House under Kayleigh McEnany. She went on to become the communications director for Republican US Representative Elise Stefanik. After serving as the national press secretary for Donald Trump’s 2024 presidential campaign, Leavitt became the new White House press secretary in 2025, succeeding Karine Jean-Pierre. In the process, she became the youngest person ever appointed to the position.\n\n2022 Congressional Campaign\n\nIn 2022, Leavitt ran for the US House of Representatives in New Hampshire’s 1st district. Using a brash style that attracted such rightwing personalities as Ted Cruz and Lauren Boebert, she ended up winning the Republican primary in a surprise victory. In the general election, Leavitt lost to Democratic incumbent Chris Pappas.\n\nCampaign Finance Troubles\n\nIn relation to her 2022 congressional campaign, Leavitt faced a Federal Election Commission complaint alleging that she illegally accepted campaign donations exceeding the legal limit, and never repaid her donors. Later, in early 2025, Leavitt disclosed over $325,000 in unpaid campaign debts she had been concealing. Around $200,000 of the debt was made up of illegal donations made in excess of campaign finance limits, donations she never paid back.\n\nPersonal Life\n\nIn late 2023, Leavitt got engaged to real estate developer Nicholas Riccio, who is 32 years her senior. The pair subsequently married, and had a son in the summer of 2024.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWhat is Karoline Leavitt&#8217;s Net Worth and Salary? Karoline Leavitt is a&#8230;\n\n\nThis Post: How much is Karoline Leavitt&#8217;s wealth? first appeared on Internewscast Journal","url":"https://internewscast.com/celeb/celeb-zone/how-much-is-karoline-leavitts-wealth/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-03-07 23:32:49","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.232},{"id":297893544,"title":"Fed in No Hurry to Adjust Rates Amid Trump Policy Uncertainty","text":"Jerome Powell, chair of the Federal Reserve, said the central bank is focused on the \"net effect\" of President Donald Trump's economic agenda, amid high uncertainty about which policies will actually be enacted, as he reiterated that officials are still not in a \"hurry\" to adjust interest rates.\n\n\"As we parse the incoming information, we are focused on separating the signal from the noise as the outlook evolves,\" Powell said at an event Friday. \"We do not need to be in a hurry, and are well positioned to wait for greater clarity.\"\n\nIf inflation stays sticky but the economy remains strong, the Fed chair said the central bank can \"maintain policy restraint for longer.\" But if either the labor market were to weaken more than expected, or inflation were to rapidly decline, Powell said officials can \"ease policy accordingly.\"\n\nHis comments underscore the delicate balancing act the Fed is trying to navigate at a tenuous moment for the economy.\n\nIn an interview Friday, Austan D. Goolsbee, president of the Chicago Fed and a voting member on this year's policy-setting committee, warned that a situation in which inflation stayed sticky while growth deteriorated at the same time would be a \"harder problem\" for the Fed to solve and something that is increasingly \"on the radar screen\" as a result of the policies that Trump is pursuing.\n\n\"Tariffs on intermediate goods are a negative supply shock,\" he said, referring to goods that are used to make other products and services for consumers. \"If there were large negative supply shocks that were to hit the economy, they would have a tendency to both drive down employment and drive up prices.\n\n\"That's a stagflationary impulse,\" he later added. \"There isn't a generic answer to what you're supposed to do.\"\n\nSpeaking at the same event earlier Friday, Michelle Bowman, a Fed governor, said that as inflation returns to the central bank's 2% target, the labor market and economic activity \"will become a larger factor\" in policy discussions.\n\nThe Fed is expected to hold interest rates steady at 4.25% to 4.5% when officials gather March 18-19, extending a pause that has been in place since January. But its decisions after that point may get more fraught, especially if the economy weakens and price pressures rise to the extent that economists fear.\n\nHow significantly Trump's tariffs will impact the economy is not yet known. The president has flip-flopped on levies he placed on Mexico and Canada this week but has kept the threat alive by issuing only a short-term reprieve. Sweeping retaliatory tariffs are also still on the table, as are other penalties on aluminum, steel and other products. The size of the potential impact depends not only on the duration of the policies but also on how fervently other countries protect themselves with retaliatory measures and how businesses and consumers adapt to higher costs.\n\nThe Fed is having to consider these implications alongside other policies Trump is pursuing, including mass deportations and steep cuts to government spending, which are expected to drag down growth. Tax cuts and deregulation efforts, which make up the other part of the president's economic agenda, may act as an offset and help to bolster business activity, but to what extent is unclear.\n\nWhat has given officials at the Fed some comfort is that the economy Trump inherited has a solid foundation. In fact, new data released Friday showed that hiring held steady in February as the unemployment rate ticked up to 4.1%. That sturdiness may mean it will require a very significant blow for the economy to be knocked into a recession.\n\nStill, the volatility alone has been enough to prompt concern about the economic outlook, with measures tracking consumer sentiment suggesting there has been a significant deterioration in how confident Americans are feeling. Many economists have also lowered their forecasts for growth, and policymakers have taken notice, too.\n\nGoolsbee said the backdrop still appeared \"fairly strong, but he was increasingly hearing from companies in his district about an \"uncertainty-induced chill, especially to business investment.\"\n\nPointing to recent measures of sentiment and other \"soft data,\" Christopher J. Waller, a Fed governor, added Thursday that those gauges suggest \"maybe things are not going be quite as good on the real side of the economy.\"\n\nOn Friday, however, Powell sought to strike a more positive tone, saying that \"despite elevated levels of uncertainty, the U.S. economy continues to be in a good place.\" Sentiment data, meanwhile, \"have not been a good predictor of consumption growth in recent years.\"\n\nThe growth scare comes as Americans are also bracing for higher consumer prices, a toxic combination that will make the Fed's job more challenging.\n\nAfter failing to spot the pandemic-era inflation problem quickly enough, and with price pressures from that episode still lingering, the Fed is being careful not to make the same mistake again. Since Trump was reelected, officials at the central bank have raised their forecasts for inflation for the year, and some have more recently drawn a direct link to the president's policies.\n\nPowell noted that consumers who are raising their expectations about inflation cited tariffs as a \"driving factor,\" even as he stressed that longer-run measures that are more indicative of the trajectory for inflation were \"stable.\" In a moderated discussion after his speech, he suggested that tariffs would end up impacting prices to some extent, but that the policy response would depend on whether it was just a one-off increase or if there were a series of shocks.\n\nGoolsbee expressed concern that the frequent changes to trade policy could ultimately prove problematic. \"The fact that it's changed multiple times in a short period also raises the question of, would this be a one-time cost shock?\"\n\n(BEGIN OPTIONAL TRIM.)\n\nEarlier this week, John C. Williams, president of the New York Fed and a top ally of Powell, said he expected tariffs to stoke higher inflation as those effects \"filter into prices that consumers pay.\"\n\nEven Waller, who previously said the Fed can \"look through\" the effects of tariffs, acknowledged Thursday that the impact of the recent levies risks being \"much larger\" than he initially expected.\n\n(END OPTIONAL TRIM.)\n\nThe latest Beige Book released by the Fed this week, which tracks economic conditions across the country, showed businesses bracing for the same. Most surveyed across the 12 districts that make up the Federal Reserve System said they planned to raise prices as a result of tariffs, with some even preemptively doing so.\n\nAgainst this backdrop, officials have been consistent in their support of the Fed holding firm on rate cuts until it sees more evidence that inflation is moving back down to the central bank's target or the labor market unexpectedly weakens.\n\nFinancial markets are betting those conditions will be met by its June meeting, allowing the Fed to lower rates by 0.75 percentage point this year.\n\nThis article originally appeared in The New York Times.","summary":"Jerome Powell, chair of the Federal Reserve, said the central bank is focused on the \"net effect\" of President Donald Trump's economic agenda, amid high uncertainty about which policies will actually be enacted, as he reiterated that officials are still…","url":"https://www.berkshireeagle.com/nyt/fed-in-no-hurry-to-adjust-rates-amid-trump-policy-uncertainty/article_ee8ac853-062c-54ef-b21f-f57290b1eba7.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:28:47","author":"Colby Smith,North Adams Pride","authors":["Colby Smith","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":0},{"id":297895948,"title":"“The Surprising Side of Donald Trump: Beware of Underestimating Him, Advises NILE GARDINER”","text":"My first meeting with Donald Trump was surprising, to say the least. It came in January 2019, a time when he was dealing with several international crises, among them Iran’s dangerous drive to become a nuclear weapons power.\n\nThat was something which I had discussed during a TV interview shortly before I was invited to the White House to attend a round-table discussion on foreign policy.\n\nAs I walked into the Roosevelt Room, close to the Oval Office, President Trump spotted me amongst the 20 or so people present and shook my hand.\n\n‘Good job on the interview,’ he said before turning back to the task of leading the free world.\n\nIt seemed remarkable that a man with so much on his mind should have taken the time not only to have caught my TV appearance in the first place, but then to mention it.\n\nAs I quickly discovered, however, this extraordinary memory for names and faces, and ability to make people feel special, is part of the sharp intelligence and charisma of a man all too often vilified by his critics as a bull in a diplomatic china shop.\n\nSince he returned to the White House, he has stunned the world with his shock and awe tactics covering everything from imposing tariffs against Canada and Mexico to his plan to take over the Gaza Strip and turn it into the ‘Riviera of the Middle East’. On Tuesday this week, he threw in a blood-curdling ‘last warning’ to the terror group Hamas to free all remaining Israeli hostages held in Gaza, telling them that if they did not, ‘it is OVER for you’.\n\nHorrified headline writers worldwide screeched disapproval of his humiliation of Emmanuel Macron on his visit to the White House — failing to meet him at the front door and seating him at the side of the Oval Office desk, not to mention the unusual handshakes which were cited as examples of Trump one-upmanship.\n\nThere was also widespread outrage at the AI video he re-posted on the social media site X, envisioning what a Gaza Strip resort town could look like if the Western investment he has talked about goes ahead, and featuring a gigantic, golden statue of Trump looming over tourists.\n\nHe has come across as so unpredictable that he was recently denounced as ‘out of control’ by a Member of Congress.\n\nThis is nonsense. His modus operandi is very deliberate, with a clear rationale behind it. By adopting the positions he does, he forces people to think outside the box and lays the ground for a deal. His address to a joint session of the United States Congress this week was a political tour de force, proclaiming ‘the dawn of the golden age of America’, ushering in a new conservative revolution at home while urging an end to the bloodiest war on European soil since World War Two. In his first 44 days in office, Trump’s presidency has secured the US border, declared war on both woke and waste within the federal government, withdrawn from the Net Zero insanity of the Paris Agreement, and has emphatically thrown down the gauntlet to the European Union over its decades of unfair protectionist measures against US exports.\n\nI’ve worked at the heart of the foreign policy world in Washington for more than 20 years and my experience as a competition chess player in my youth tempts me to compare him with the Grandmasters of the game, always thinking several steps ahead to ‘checkmate’ while others are still focused on shuffling around their knights and bishops.\n\nTake Ukraine. After observing Trump in the foreign policy meetings I attended during his first presidency, I am convinced that he wants to be remembered as a man who brings about peace.\n\nHe genuinely believes that the war in Ukraine with its massive loss of life is a huge tragedy, thanks not least to bungling Joe Biden — who did nothing to stop the barbaric Russian invasion. That was a critically important mistake and then, when he did eventually provide support to Ukraine, it was at a point where the Russians had already gained a huge strategic advantage.\n\nWhile Biden, and Barack Obama before him, were cautious and conventional presidents, Trump never hesitates to get on with things and he has a clear vision both for ending the war and ensuring that Ukraine’s long-term security is guaranteed.\n\nHe has already succeeded in galvanising a coalition of European allies who have agreed in principle to send troops to Ukraine if necessary — the UK and France among them. The recent visits to the White House by Emmanuel Macron and Keir Starmer — one of the least impressive British prime ministers in decades — were very much about that.\n\nDuring their admittedly successful meeting in the Oval Office, Starmer was effusive in his support for Trump’s efforts to secure a peace deal for Ukraine, acknowledging that no end for the war can be achieved without US leadership.\n\nThat’s certainly true and Trump is ensuring that the US has a long-term stake in Ukraine as part of the deal that he is negotiating with Zelensky to develop Ukrainian rare earth mineral resources. The genius of this lies in his awareness that the Russians will not dare to launch future attacks on Ukraine while the US has economic interests there.\n\nThat ‘checkmate’ depends, of course, on Vladimir Putin believing that Trump might hit back at any such invasion and we need to dispel the ridiculous notion that the president is somehow kowtowing to the Russian leader.\n\nTrump has managed against all odds to lure Putin to the negotiating table, just as Winston Churchill — of whom more later — had to work with Soviet tyrant Josef Stalin to bring an end to World War II.\n\nLet’s be clear. Putin is not viewed as some partner or potential friend of the United States. He’s a deeply unpleasant adversary and he knows that Trump is very capable of being extremely tough on Russia.\n\nWe saw that in Syria in 2018, when pro-government forces led by Russian mercenaries launched an assault on a US base at the height of the campaign against ISIS and Trump ordered an airstrike response which killed some 200 to 300 attackers, including many Russians.\n\nSo Trump doesn’t hold back when the Russians attack US interests. If he is provoked and prodded, they know he will retaliate very fast and he is the only man that Putin fears. Not Macron or Starmer. Just Trump.\n\nIt’s no coincidence that Trump ordered the third anniversary of the start of the war to be marked by a B-52 Stratofortress strategic bomber flying over the Baltic states, alongside F-35A stealth fighters and other US combat aircraft. This very significant show of force sent a clear message to Putin – don’t mess with Trump.\n\nAs he knows, there’s a lot to be said for an America that’s feared rather than loved. And with the US’s allies, including President Zelensky, he is willing to be forceful and robust in order to get results.\n\nOn the face of it, Trump’s strong language on Ukraine might seem objectionable to Europe’s elites. But this is all part of his power play.\n\nThe tumultuous Trump/Zelensky White House confrontation last Friday reverberated across the world. But in its aftermath the Ukrainian leader looks poised to sign the proposed deal with the United States, move to the negotiating table and work towards ending the war without ceding any further Ukrainian sovereignty to the Russians. In addition, European leaders are finally serious about significantly raising defence spending, and ending their welfare state-style dependence upon the United States.\n\nTrump knows exactly what he’s doing in putting Zelensky under pressure. He’s knocking heads together to get results and, while people may not like his confrontational style, they should not confuse it with the impulsive recklessness of someone who speaks first and thinks later.\n\nDuring the policy round-tables at the White House I attended, I gained firsthand insight into how he likes to listen to a wide range of different views and opinions and takes a genuine interest in people’s advice.\n\nHe then makes up his own mind, decisively and in ways which are often revolutionary, as with Gaza.\n\nHe knows that the situation there has reached a critical juncture. Gaza is now a complete disaster case, a terrorist hornet’s nest and Trump is simply pointing out that conventional wisdom offers no solutions.\n\nWhile we don’t know yet the details of Trump’s Gaza plan, his idea of turning the territory into something that actually functions well and offers its people prosperity, rather than poverty, destruction and despair, surely makes complete sense.\n\nWe should be grateful to Trump for daring to think outside the box and saying we need an alternative solution here. What the Middle East needs right now is hope and there’s no one more optimistic than Donald Trump.\n\nThe same willingness to change the rules of the game was apparent in the speech given in Munich by Vice-President JD Vance. This very much reflected Trump’s view that if you want the US to be invested in the future of Europe’s defence through the NATO Alliance, Europe must stand for the same values America does: freedom of speech, secure borders, free markets.\n\nTrump has genuine concerns about Europe and Britain in particular. Let’s not forget that his mother was born in Scotland. We matter to him. And so does NATO. The alliance often came up in the meetings I attended and it was clear that, far from not caring about NATO, he wants to make it great again.\n\nAs I said, his ‘tough love’ message has forced both Britain and France to announce significant increases in their defence budgets. Here, he is once again taking the longer view for behind this lies a concern for Western civilisation.\n\nEurope matters to the US because if Europe falls to the Left, or to Islamists, then that’s dangerous for America. And, with apologies for adopting chess terminology yet again, this forcing of Europe to get its act together shows that Trump is once again looking towards the end-game.\n\nAnother charge often laid against him is that he is ignorant of international law, for example in recoiling against the International Criminal Court’s issue of a hugely political and utterly ludicrous arrest warrant against Israeli president Benjamin Netanyahu for supposed war crimes.\n\nThe truth is that Trump has a very strong understanding of international law and how it is wielded by foreign courts. It’s just that he doesn’t like it. He has an instinctive distrust of supranational courts and globalist elites constraining what the leaders, or indeed the citizens, of individual nation-states can do.\n\nHe says things that no one else is willing to say and does them too, and that’s refreshing. Look at how he so successfully threatened Colombia with immediate trade tariffs if it refused to take back the drug dealers and other criminals deported as part of his crusade against illegal immigration.\n\nColombian president Gustavo Petro caved instantly, as Trump knew he would. Who else but the Donald would have dared?\n\nHe’s fearless in the same way as Winston Churchill, whose bust was removed from the Oval Office by Joe Biden but reinstated almost as soon as Trump moved back into the White House. While Biden and Obama, and numerous presidents before them, were endlessly swayed by opinion polls and focus groups, Churchill didn’t care what anyone thought, and neither does Trump.\n\nIn part, this is because of his unconventional background. Unlike Biden, a cynical, career politician who always seemed to be somewhat ‘plastic’, Trump is very authentic. The ultimate outsider president, he doesn’t think like typical Washington politicians and, when you’re in the room with him, you know that he really believes what he’s saying.\n\nThat, of course, is often controversial and has won him many enemies on the Left who mindlessly attack him as an unthinking bully. If they want to persist in that misguided view, then that is their prerogative but I would offer them one piece of advice. Hate Donald Trump all you like but underestimate him at your peril.\n\nNile Gardiner is a former aide to Margaret Thatcher and lives in Washington","summary":"Internewscast Journal\n\nInternewscast\n\n\nMy first meeting with Donald Trump was surprising, to say the least.&#8230;\n\n\nThis Post: &#8220;The Surprising Side of Donald Trump: Beware of Underestimating Him, Advises NILE GARDINER&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/the-surprising-side-of-donald-trump-beware-of-underestimating-him-advises-nile-gardiner/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-I-know-Donald-Trump-He-might-seem.jpg","video":null,"publish_date":"2025-03-07 23:28:45","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.238},{"id":297891498,"title":"Starlink not allowed in South Africa ‘because I’m not black’ – Musk","text":"Tech billionaire Elon Musk has claimed that his Starlink satellite internet service cannot operate in South Africa because he is “not black.” South African officials fired back, insisting that the issue has nothing to do with Musk’s race. \n\nMusk, who was born in Pretoria but mainly resides in the US, made his comments on Friday in reaction to a podcast featuring South African businessman Rob Hersov. In a snippet shared online, Hersov claimed that “race-based laws in South Africa are all anti-white” and argued that the country has been “infected… with an evil woke mind virus.”\n\n“Starlink is not allowed to operate in South Africa, because I’m not black,” Musk wrote on X. \n\nClayson Monyela, South African diplomatic spokesman, quickly rejected Musk’s claims. “Sir, that’s NOT true and you know it! It’s got nothing to do with your skin color,” Monyela wrote on X. He added that Starlink was welcome to operate in South Africa “provided there’s compliance with local laws.”\n\nSouth African laws designed to address racial inequalities left from the Apartheid era mandate that foreign telecommunications firms be at least 30% owned by “persons from historically disadvantaged groups.” Starlink, a subsidiary of Musk’s SpaceX, does not sell its shares publicly.\n\nLast year, Starlink’s parent company wrote a letter to South African telecommunications regulator ICASA, describing the 30% shareholding requirement as a “significant barrier” to investment.\n\nLast month, US President Donald Trump threatened to cut off aid to South Africa. He accused the country of cozying up with Iran and condemned its lawsuit to the International Court of Justice, which alleged that Israel was committing genocide in Gaza. Trump also argued that South Africa’s land reform violates human rights.\n\nSouth African President Cyril Ramaphosa has denied that his government was tolerating human rights abuses. “We will not be bullied,” he said in a speech in February. Ramaphosa met with Musk last month, discussing the “issues of misinformation and distortions about South Africa,” according to the president’s office. \n\nThe South African government says that the controversial Expropriation Act is aimed at remedying the disparities in the country, where white farmers still own the majority of land, despite whites comprising around 7% of the population. The government has set a target of transferring 30% of farmland to black farmers by 2030.","summary":"Elon Musk has claimed that Starlink was being shunned in South Africa because of his race \nRead Full Article at RT.com","url":"https://www.rt.com/news/613889-starlink-musk-not-black/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67cb508385f5400c906ab293.jpg","video":null,"publish_date":"2025-03-07 23:28:36","author":null,"language":"en","source_country":"ru","sentiment":-0.297},{"id":297892974,"title":"FIFA crypto coin surges 142,000% after wild Donald Trump claim in White House address","text":"FIFA crypto coin surges 142,000% after wild Donald Trump claim in White House address\n\nREAD MORE: Kirk Cousins makes shock visit to US President Donald Trump \n\nPODCAST: Trump’s tariff whiplash, Trudeau’s tears, and Hunter Biden’s ‘sugar brother’ – on the latest episode of Welcome to MAGAland\n\nBy LEOCCIANO CALLAO\n\nPublished: 23:25 GMT, 7 March 2025 | Updated: 23:28 GMT, 7 March 2025\n\nA cryptocurrency named FIFA COIN has been surging since US President Donald Trump teased the potential of a coin built around the highly-anticipated World Cup next summer.\n\nThe FIFA Club World Cup trophy appeared at the White House Crypto Summit, which added flare to the high-profile event focused on digital assets and blockchain policy.\n\nSpeaking at the event, FIFA president Gianni Infantino suggested that the football federation is 'very, very interested under my presidency to develop the FIFA coin.\n\n'So if there is anyone interested in teaming up with FIFA, we'll conquer the world of soccer with the FIFA coin,' Infantino added.\n\nSeemingly excited by the idea, Trump joked 'That coin may be worth more than FIFA in the end.'\n\n'It could be quite a coin, actually,' he added.\n\nUS President Donald Trump claimed a FIFA cryptocurrency 'may be worth more than FIFA' \n\n“So FIFA is very, very interested under my presidency to develop the FIFA coin. So if there is anyone interested in teaming up with FIFA, we'll conquer the world of soccer with the FIFA coin.”\n\nTrump: That coin may be worth more than FIFA in the end. pic.twitter.com/KEDBvR406o\n— Acyn (@Acyn) March 7, 2025\n\nBREAKING NEWS\n\nDonald Trump hands himself vital World Cup role with US set to host soccer showpiece\n\nAfter Trump's remarks, a cryptocurrency named FIFA COIN (FIFA) spiked by 142,000 percent, reaching a market capitalization of approximately $3million.\n\nFIFA COIN saw heightened trading volumes, with a 24-hour trading volume of $0.65 and a price of $0.0645 on decentralized exchanges like Uniswap. However, FIFA COIN has no official affiliation with FIFA or the upcoming 2026 World Cup.\n\nThat said, crypto investors are advised to be cautious as opportunistic meme coins frequently emerge behind major public events or statements from influential figures.\n\nApart from FIFA, the event featured some of the biggest names in crypto, including Coinbase CEO Brian Armstrong, MicroStrategy’s Michael Saylor, and Kraken CEO Arjun Sethi. Furthermore, Trump reiterated his commitment to making the United States the global leader in crypto.\n\nThe 2026 FIFA World Cup will be hosted in Canada, Mexico, and the United States. This would be the first time the tournament will be co-hosted by three countries.\n\nAn expanded 48-team format will feature 104 matches, making 2026 the largest World Cup in history.\n\nThe United States will have 11 host cities, while Mexico and Canada will have three and two, respectively. The final is set to take place at MetLife Stadium in East Rutherford, New Jersey.\n\nDonald TrumpWhite House\n\nShare or comment on this article:\nFIFA crypto coin surges 142,000% after wild Donald Trump claim in White House address\n\nAdd comment","summary":"The FIFA Club World Cup trophy appeared at the White House Crypto Summit, which added flare to the high-profile event focused on digital assets and blockchain policy.","url":"https://www.dailymail.co.uk/sport/football/article-14475077/fifa-crypto-coin-donald-trump-world-cup.html","image":"https://i.dailymail.co.uk/1s/2025/03/07/23/95970195-0-image-m-139_1741389901199.jpg","video":null,"publish_date":"2025-03-07 23:28:27","author":"Editor,Leocciano Callao","authors":["Editor","Leocciano Callao"],"language":"en","category":"politics","source_country":"gb","sentiment":0.235},{"id":297902150,"title":"US government revokes some access to satellite imagery for Ukraine - Reuters","text":"CompaniesMaxar Technologies Inc.\n\nWASHINGTON, March 7 (Reuters) - U.S. aerospace firm Maxar Technologies said on Friday it had disabled Ukrainian users' access to satellite imagery on one U.S. government platform, as U.S. President Donald Trump's administration suspends intelligence sharing with Kyiv.\n\nIn a statement, Maxar said it has contracts with the U.S. government and dozens of allied and partner nations, and \"Each customer makes their own decisions on how they use and share that data.\"\n\nAdvertisement · Scroll to continue\n\nThe company said the contract in question is GEGD (the Global Enhanced GEOINT Delivery program), a U.S. government program providing access to commercial satellite imagery collected by the United States.\n\n\"The U.S. government has decided to temporarily suspend Ukrainian accounts in GEGD,\" Maxar said, referring further questions to the U.S. National Geospatial-Intelligence Agency, which confirmed the action.\n\n\"In accordance with the administration’s directive on support to Ukraine, NGA has temporarily suspended access to the Global Enhanced GEOINT Delivery system, or GEGD, which is the primary portal for access to U.S. government-purchased commercial imagery,\" a spokesperson for the agency said.\n\nAdvertisement · Scroll to continue\n\nMaxar's action was first reported by the military news outlet Militarnyi.\n\n\"We take our contractual commitments very seriously, and there is no change to other Maxar customer programs,\" the company said in a statement.\n\nJohn Ratcliffe, director of the Central Intelligence Agency, said on Wednesday that Washington had suspended intelligence-sharing with Ukraine, piling pressure on President Volodymyr Zelenskiy's government to cooperate with the Trump administration in convening peace talks with Russia.\n\n(This story has been corrected to show that just one U.S. government platform is involved, in the headline, and in paragraphs 1 and 3)\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 480pAuto (480p) \n\nAbout ConnatixV567366 \nAbout ConnatixV567366 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Patricia Zengerle; Editing by Daniel Wallis\n\nPurchase Licensing Rights","summary":"US government revokes some access to satellite imagery for Ukraine  Reuters","url":"https://www.reuters.com/world/us-aerospace-firm-maxar-disables-satellite-photos-ukraine-2025-03-07/","image":"https://www.reuters.com/resizer/v2/VMA3UYZL6RLMTFKMLTTCUNEVME.jpg?auth=f3788f3552358290f155265addd7dc96a15320a151cdb139eaa1c0a57ce01861&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-03-07 23:26:01","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"gb","sentiment":0.027},{"id":297893564,"title":"Justice Dept. Doubles Down on Request to Break Up Google","text":"WASHINGTON -- In a sign that President Donald Trump is following the Biden administration's lead in reining in Google, the Justice Department on Friday reiterated its demand that a court break up the search giant.\n\nThe request followed a landmark ruling last year by Judge Amit Mehta of U.S. District Court for the District of Columbia that found Google had illegally maintained a monopoly in online search by paying web browsers and smartphone manufacturers to feature its search engine. The judge is scheduled to hear arguments on proposed solutions from the government and Google in April.\n\nUnder the Biden administration last year, the Justice Department asked Mehta in a preliminary filing to force Google to sell its popular web browser, Chrome, among other remedies. The department's lawyers on Friday reiterated that demand, which could reshape internet competition.\n\n\"Google's illegal conduct has created an economic goliath, one that wreaks havoc over the marketplace to ensure that -- no matter what occurs -- Google always wins,\" the government said in its Friday filing. \"The American people thus are forced to accept the unbridled demands and shifting, ideological preferences of an economic leviathan in return for a search engine the public may enjoy.\"\n\nThe Justice Department's decision to stick with its proposal to fundamentally alter the $2 trillion company's business is one of the first signals from the new administration on how it may approach tech regulation. The requests, the most significant remedies proposed in a tech monopoly case since the Justice Department asked to break up Microsoft in 2000, could presage how Trump's appointees will handle a string of other antitrust cases that challenge the dominance of tech behemoths.\n\nThe Justice Department has also sued Google over its dominance in advertising technology, a case awaiting a ruling, as well as Apple over claims that its tightly knit system of devices and software makes it challenging for consumers to leave. A Federal Trade Commission case against Meta, over claims that Meta snuffed out competition when it bought Instagram and WhatsApp, is scheduled to go to trial in April. The agency has also sued Amazon, accusing it of illegally protecting a monopoly in online retail.\n\nThe tech industry is closely watching Trump's choices to lead those agencies as it tries to determine his approach to regulation. The antitrust cases against the tech giants stem from investigations that began during Trump's first term.\n\nAndrew Ferguson, the new chair of the FTC, has expressed concern about the tech giants' power as a gatekeeper to online discourse. Gail Slater, Trump's nominee to lead the Justice Department's antitrust division, said during her Senate confirmation hearing that she was worried that someone \"can be disappeared from the internet quite easily when there are only two platforms providing news, for example, to the American people.\"\n\nTech executives have visited Mar-a-Lago in recent months to court the president's favor, and have donated millions of dollars to Trump's inauguration. CEOs including Tim Cook of Apple, Sundar Pichai of Google and Mark Zuckerberg of Meta sat behind Trump during his inauguration.\n\nThe first major test of the Trump administration's approach to concerns about Big Tech's power will be how it proceeds in the Google search case.\n\nDuring a 10-week trial in 2023, the government said Google locked out rivals by signing deals with Apple, Mozilla, Samsung and others to automatically appear as the search engine when users opened a smartphone or new tab in a web browser. Google paid $26.3 billion for those arrangements in 2021, according to evidence presented at the trial.\n\nGoogle argued that its deals had not broken the law, and that users chose its search engine because it was better at finding information than rivals like Microsoft's Bing or DuckDuckGo, which claims to offer its users more privacy than search engines that collect more information to target users with ads.\n\nAfter Mehta ruled in August that Google had illegally maintained a monopoly, the Justice Department proposed last year that the company be forced to sell Chrome. It also suggested at the time a sale of Android, Google's smartphone operating system, unless Google changed some of its policies.\n\nThe government asked the court to stop Google from entering into paid agreements with Apple, Mozilla and smartphone makers to be the default search engine on smartphones and in browsers. The company should also allow rival search engines to display Google's results and have access to its data for a decade, the government said in its filing at the time.\n\nGoogle had urged Mehta to take a narrower approach. It asked that it continue to be allowed to pay other companies to give its search engine prime placement in web browsers and on smartphones. But it said those agreements should be less restrictive than in the past and allow other search engines to compete for prime placement on phones and browsers. In addition, browser makers like Apple and Mozilla should be allowed to change their default search engines at least every 12 months, the company said.\n\nMehta is scheduled to preside over an almost two-week hearing next month to determine remedies in the case, which will feature testimony and arguments from lawyers for both sides.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- In a sign that President Donald Trump is following the Biden administration's lead in reining in Google, the Justice Department on Friday reiterated its demand that a court break up the search giant.","url":"https://www.berkshireeagle.com/nyt/justice-dept-doubles-down-on-request-to-break-up-google/article_b4b942de-6070-5d46-98f4-1a5c5b60528f.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:25:11","author":"David McCabe,Judge Amit Mehta","authors":["David McCabe","Judge Amit Mehta"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.294},{"id":297895650,"title":"World News | A Single Day of Trump and Musk's Cost-cutting Campaign Remakes Huge Sections of Government","text":"Washington, Mar 8 (AP) A series of decisions revealed Friday provided a glimpse of the turmoil engulfing federal agencies since President Donald Trump and Elon Musk launched their campaign of disruption, upending how government functions in ways big and small. Some changes appeared designed to increase political control over agencies that have historically operated with some degree of autonomy, such as requiring Environmental Protection Agency officials to seek approval from the Department of Government Efficiency for any contracts exceeding $50,000. Also Read | London Gatwick-Bound EasyJet Flight Makes Emergency Landing in Portugal's Porto After 2 Families Brawl Over 'The Karate Kid'. Other directives increased burdens on federal workers, who have already endured insults, layoffs and threats from the president and other top officials. For example, government credit cards issued to civilian employees at the Pentagon were altered to have a $1 limit, choking off their ability to travel for work. The Transportation Security Administration became another target. The administration cancelled a collective bargaining agreement with 47,000 workers who screen travellers and luggage at airports around the country, eliminating union protections in a possible prelude to layoffs or privatisation. Also Read | Donald Trump Weighs New Sanctions on Russia, Days After Pausing Military Aid and Intelligence Sharing With Ukraine. The cascading developments are only a fraction of the upheaval that's taken place since Trump took office, but they still reshaped how hundreds of thousands of public servants do their jobs, with potentially enduring consequences. The ongoing shakeup is much more intense than the typical whiplash that Washington endures when one administration gives way to another, raising fundamental questions about how government will function under a president who has viewed civil servants as an obstacle to his agenda. The White House has wrestled with political blowback over Musk's role and legal challenges that have tried to block or slow down his work. Republicans who are facing growing pressure in contentious town halls have started to speak up. “I will fully admit, I think Elon Musk has tweeted first and thought second sometimes,” said Rep. Bill Huizenga, R-Mich., during a virtual meeting with constituents on Friday. “He has plunged ahead without necessarily knowing and understanding what he legally has to do or what he is going to be doing.” Mistakes are being made The overhaul of the federal government is happening at lightning speed, reflecting years of preparation by Trump's allies and the president's decision to grant Musk sweeping influence over his administration. Musk, a billionaire entrepreneur with no previous experience in public service, has shown no interest in slowing down despite admitting that he'll make mistakes in his crusade to slash spending and downsize the workforce. The government is facing even more dramatic changes in the coming weeks and months. Trump has directed agencies to prepare plans for widespread layoffs, known as reductions in force, that will likely require more limited operations at agencies that provide critical services. The Department of Veterans Affairs could shed 80,000 employees, while the Internal Revenue Service and the Social Security Administration are considering plans that would cut their workforces in half. Trump has vowed not to reduce Social Security benefits, but Democrats argue that layoffs would make it harder to deliver payments to 72.5 million people, including retirees and children. There are also concerns that politics could interfere with Social Security. Trump has feuded over transgender issues with Maine Democratic Gov. Janet Mills, and his administration recently said children born in the state would no longer have a Social Security number assigned at birth. Instead, parents would have to apply for one at a local office. Leland Dudek, the acting commissioner of Social Security, rescinded the order on Friday. “In retrospect, I realise that ending these contracts created an undue burden on the people of Maine, which was not the intent,” he said in a statement. Dudek added that “as a leader, I will admit my mistakes and make them right.” A startup mindset takes hold More than a month after Trump took office, there's still confusion about Musk's authority. In public statements and legal filings, administration officials have insisted that Musk does not actually run DOGE and has no direct authority over budgets. But Trump has contradicted both statements. He said Tuesday that DOGE is “headed by Elon Musk” in a prime-time speech to a joint session of Congress, and he said Thursday that “Elon will do the cutting” if agency leaders don't reduce their spending. Their approach has energised people like David Sacks, a venture capitalist serving as a Trump adviser on cryptocurrency and artificial intelligence, who praised the administration as moving “faster than any startup that I've been part of.” Trump denied reports of friction between Musk and Cabinet officials, particularly Secretary of State Marco Rubio, during a meeting Thursday. “Elon gets along great with Marco,” the president said. The State Department had no immediate comment. Norm Eisen, executive chair of State Democracy Defenders Fund, an organisation that has been suing the Trump administration, said the president “made clear that Musk and DOGE have been calling the shots.” Musk serves as a presidential adviser, not a Senate-confirmed official, which Eisen argued makes his role unconstitutional. He said Trump's comments are \"an admission that the vast chaos that Musk and DOGE have wrought without proper approval and documentation is illegal — and so must be completely unwound.” (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A series of decisions revealed Friday provided a glimpse of the turmoil engulfing federal agencies since President Donald Trump and Elon Musk launched their campaign of disruption, upending how government functions in ways big and small.","url":"https://www.latestly.com/agency-news/world-news-a-single-day-of-trump-and-musks-cost-cutting-campaign-remakes-huge-sections-of-government-6694631.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-07 23:24:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.094},{"id":297890322,"title":"Trump to lead task force for 2026 World Cup","text":"President Donald Trump created a task force Friday to prepare for the 2026 World Cup, which will bring the globe's premier soccer tournament to North America at a time when his on-again, off-again tariffs have ratcheted up tensions across the continent.\n\n\"I think it's going to make it more exciting,\" Trump said of playing the World Cup amid sharp rhetoric between leaders of the host nations. \"Tension's a good thing.\"\n\nThe task force, which Trump will chair, will coordinate the federal government's security and planning for the tournament, which is expected to draw millions of tourists to the United States, Canada and Mexico.\n\n\"It's a great honor for our country to have it,\" Trump said of the World Cup after meeting with officials from FIFA, the international soccer governing body. He said he'd like to attend multiple games.\n\nPreparations are ramping up across the continent alongside tensions between the United States and its neighbors as Trump has repeatedly threatened to impose tariffs before backing off, spooking markets and leading to fears of a trade war and economic downturn. He also speaks pejoratively of Canadian Prime Minister Justin Trudeau and muses about Canada becoming a U.S. state, which has boosted national pride north of the border.\n\nFor 2026, the World Cup will expand to 48 teams playing 104 matches across three nations. Seventy-eight of 104 matches will be played in the U.S., with 13 games each in Mexico and Canada, and as many as six matches a day. The final will be played July 19 at MetLife Stadium in New Jersey.\n\nFIFA President Gianni Infantino said the task force will ensure that each of the visitors who will travel from around the world \"feels safe, feels happy and feels that we are doing something special.\"\n\n\"So we're here to create and to make the best show on the planet ever,\" Infantino said. He gave Trump a personalized game ball and unveiled an elaborate trophy that will go to the winner of the 2025 FIFA Club World Cup, which will pit top soccer clubs against each other this summer ahead of next year's matchup of national teams.\n\nTrump later brought Infantino to show off the trophy at the start of a White House cryptocurrency summit. The United States, where soccer has grown in popularity but remains a niche sport, represents a major growth area for soccer, he said.\n\nInfantino likened producing the World Cup to holding three Super Bowls daily for a month, a dizzying security and logistical challenge for the host governments.\n\nThe Trump administration will face a second test on the global sports stage in 2028, when the summer Olympics will be held in California, the first time the Games will have been in the U.S. since Salt Lake City hosted in 2002.","summary":"President Donald Trump created a task force Friday to prepare for the 2026 World Cup, which will bring the globe's premier soccer tournament to North America.","url":"https://www.espn.com/soccer/story/_/id/44155171/president-donald-trump-task-force-2026-world-cup","image":"https://a.espncdn.com/photo/2025/0307/r1461009_2_1296x729_16-9.jpg","video":null,"publish_date":"2025-03-07 23:21:05","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.786},{"id":297895926,"title":"Texas governor requiring state employees return to office full-time: 'Present and engaged'","text":"Texas Gov. Greg Abbott recently announced he will mirror the Trump administration's return to work mandate for federal workers in requiring all state employees to return to the workplace. Abbott, a Republican, announced this week that he will require all state employees to return to the office full-time, in person, five days a week. The move comes after President Donald Trump, while addressing Congress on Tuesday, said there were hundreds of thousands of federal workers \"who have not been showing up to work.\" MUSK'S DEMAND THAT FED EMPLOYEES LIST THEIR ACCOMPLISHMENTS ROIL WORKFORCE: ‘MASS CIVIL DISOBEDIENCE’ \"My administration will reclaim power from this unaccountable bureaucracy, and we will restore true democracy to America again,\" Trump said on Tuesday. \"Any federal bureaucrat who resists this change will be removed from office immediately, because we are draining the swamp.\" While Abbott has not publicly provided a deadline, an email sent to thousands of employees by Texas Workforce Commission Executive Director Ed Serna said they are required to return to the office full-time by March 31, affiliate FOX 7 Austin reported. In a statement provided to Fox News Digital on Friday, deputy press secretary Eduardo Leal said Texans \"expect their public servants to be present and engaged in the work on their behalf.\" ELON MUSK SAYS FEDERAL EMPLOYEES MUST FILL OUT PRODUCTIVITY REPORTS OR RESIGN \"State agencies have been in office, and any remote work policies must ensure taxpayer dollars are being utilized efficiently,\" Leal wrote in the statement. \"With remote federal workers returning to the office where possible, it’s important that state agencies ensure they do the same.\" Returning to the office will look different at each individual state agency, and plans will be formulated by leadership. Under Texas Government Code, employees can work remotely for a variety of reasons to fulfill an agency’s needs, such as if an employee’s work is conducted in the field, or if there is limited office space due to pending renovations. Myko Gedutis, Vice President of the Texas State Employees Union, said the impact on state employees will be \"significant,\" noting concerns about space after downsizing, FOX 7 reported. \"There's literally not enough space in offices for everybody to return [to], in many, many of these locations,\" he said. Gedutis added that the agencies \"overwhelmingly responded that remote work was positive for them,\" noting it saved money in terms of recruitment and retention. Downtown Austin Alliance (DAA) President and CEO Davon Barbour told Fox News Digital that the city welcomes the return of federal employees working in-person downtown, calling it \"a significant step in bolstering our city's economic vitality.\" \"Establishing a consistent office presence downtown directly supports small businesses by increasing foot traffic and enhancing the dynamic energy of our urban core,\" the DAA said in a statement. \"Small businesses downtown rely on the steady demand created by office workers. This shift to in-person work will help sustain and grow these businesses, fostering a thriving downtown environment. CLICK TO GET THE FOX NEWS APP \"The Downtown Austin Alliance looks forward to the added vibrancy and economic activity this increase in foot traffic will bring.\" The Texas Workforce Commission did not immediately respond to Fox News Digital's request for comment.","summary":"Texas Gov. Greg Abbott will require state employees to return to the office full-time and in person, five days a week. The move comes after President Donald Trump issued a similar mandate at the federal level.","url":"https://www.foxnews.com/us/texas-governor-requiring-state-employees-return-office-full-time-present-engaged","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/04/931/523/GettyImages-2107849890-scaled-e1714473576739.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 23:12:22","author":"Alexandra Koch","authors":["Alexandra Koch"],"language":"en","category":"politics","source_country":"us","sentiment":-0.225},{"id":297893542,"title":"Lawyer Appointed in Adams Case Says Charges Should Be Dropped","text":"A lawyer who was asked to offer independent arguments on the U.S. Justice Department's motion to dismiss corruption charges against Mayor Eric Adams of New York told a judge Friday that he should end the prosecution.\n\nBut the lawyer, Paul Clement, said the judge should not allow the Trump administration to use the threat of criminal charges to compel Adams' political support. He recommended that the case be dismissed with prejudice, meaning the charges could not be brought again.\n\n\"A dismissal without prejudice creates a palpable sense that the prosecution outlined in the indictment and approved by a grand jury could be renewed, a prospect that hangs like the proverbial sword of Damocles over the accused,\" Clement wrote in his filing.\n\nClement's brief could spell the end of the long-running case against the mayor, the first to be indicted in modern New York history. Though the judge, Dale E. Ho, is not legally bound to accept Clement's recommendation, his guidance will likely be influential given that the judge requested that he weigh in.\n\nIf Ho follows it, the result could be the best possible outcome for Adams, whose administration has been in turmoil since his indictment in September. But the legal wrangling over the government's attempt to abandon the case has left the mayor, who is facing reelection this year, even more politically damaged than he was before the process began.\n\nHigh-ranking officials in President Donald Trump's Justice Department had asked Ho to dismiss the case without prejudice, meaning that the charges could be brought again. The officials did not argue that the case was weak, but rather that it was hindering Adams' cooperation with the White House's immigration agenda.\n\nTheir effort caused an uproar. Adams' campaign opponents and critics throughout New York suggested that the arrangement would keep the mayor beholden to the president rather than to New Yorkers.\n\nClement wrote in his filing that \"the prospect of re-indictment could create the appearance, if not the reality, that the actions of a public official are being driven by concerns about staying in the good graces of the federal executive, rather than the best interests of his constituents.\"\n\nIf the case ends without the prospect of future charges, not only would the legal threat to the mayor essentially disappear, but so would a cudgel that Trump could wield against him to enforce his program of mass deportations.\n\nAdams' lawyer, Alex Spiro, did not immediately respond to a request for comment. The Justice Department also had no immediate comment.\n\nClement, a political conservative, was the U.S. solicitor general during President George W. Bush's administration and has argued more than 100 cases before the Supreme Court. He wrote that he had reached his 33-page conclusion in the face of the extraordinary circumstances of the government's motion.\n\nThe U.S. attorney's office for the Southern District of New York had aggressively prosecuted Adams, a Democrat, ever since he was indicted last year on bribery, fraud and other counts. After the change in administrations, the Justice Department shifted positions and ordered the Southern District's top prosecutor, Danielle R. Sassoon, to seek the dismissal.\n\nShe refused and quit, leading to a cascade of resignations by other prosecutors in Manhattan and Washington, while several of Adams' campaign opponents called for him to step down.\n\nA top Justice Department official, Emil Bove, filed the dismissal motion with Adams' support. With no party opposing the motion, Ho appointed Clement to help with his decision-making \"via an adversarial process.\"\n\nHo had made it clear that judges have little leeway in reviewing such motions and may deny them only where they are \"clearly contrary to manifest public interest.\"\n\nThis article originally appeared in The New York Times.","summary":"A lawyer who was asked to offer independent arguments on the U.S. Justice Department's motion to dismiss corruption charges against Mayor Eric Adams of New York told a judge Friday that he should end the prosecution.","url":"https://www.berkshireeagle.com/nyt/lawyer-appointed-in-adams-case-says-charges-should-be-dropped/article_2582481d-dd55-565f-a7eb-d6aeeff53415.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:11:34","author":"Benjamin Weiser and Jonah E. Bromwich,North Adams Pride","authors":["Benjamin Weiser and Jonah E. Bromwich","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":-0.326},{"id":297895924,"title":"Falcons' Kirk Cousins visits President Trump at White House","text":"An NFL quarterback was spotted at the White House with President Donald Trump Friday. Atlanta Falcons veteran Kirk Cousins and Trump posed for a photo in the Oval Office that has since gone viral on social media. The picture, posted by Margo Martin, Trump’s special assistant and communications advisor, had the caption, \"#18 [handshake emoji] #47.\" The numbers represent Cousins’ jersey number and Trump being the 47th president of the United States. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Trump wore a navy blue suit with a bright yellow tie to meet with Cousins, who left the Minnesota Vikings for the Falcons in free agency last offseason. Trump and Cousins have a relationship that goes back to Cousins' time with the Vikings. Trump called Cousins after a 28-10 win by Cousins' Vikings over the New York Giants in October 2019. A spokesperson for the Vikings confirmed to a local station that Trump called Cousins to \"briefly congratulate him and the Vikings on the win in New York.\" Trump was scheduled for a rally in Minneapolis for the 2020 election when Cousins defeated the Giants on \"Monday Night Football.\" VIKINGS QUARTERBACK KIRK COUSINS RECEIVES CONGRATULATORY CALL FROM TRUMP: REPORT And even before that, Cousins got some attention for playing a round of golf with Trump at Trump National Golf Club in Bedminster, New Jersey, in June 2017. So, their relationship has spanned a few years, and Cousins clearly supports the president to this day. The upcoming NFL season will be interesting for the 36-year-old signal-caller. Falcons head coach Raheem Morris made the switch at quarterback to rookie Michael Penix Jr. toward the end of last season, even with Atlanta in a playoff race, because Cousins struggled in his first campaign down south. Cousins threw for 3,508 yards, 18 touchdowns and 16 interceptions, and his 88.6 quarterback rating was his worst since his 2014 season with the Washington Commanders. Cousins was coming off a torn Achilles with the Vikings in the 2023 campaign, and many were wondering what would happen with him on the open market as he was recovering. The Falcons signed him to a four-year, $180 million deal with a whopping $100 million guaranteed. However, in the biggest shock of the 2024 NFL Draft, the Falcons selected Penix eighth overall out of Washington, sparking immediate speculation about the quarterback position. Cousins was the starter at the beginning of last season, but it became clear to Morris a change was needed. How that quarterback situation plays out in training camp will be a huge NFL storyline in 2025. CLICK HERE TO GET THE FOX NEWS APP The Falcons can opt out of Cousins’ remaining two years on his deal after the 2025 season, when his $100 million guarantee is satisfied. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"President Donald Trump and Atlanta Falcons quarterback Kirk Cousins met in the Oval Office at the White House Friday and posed for a photo to remember it.","url":"https://www.foxnews.com/sports/falcons-kirk-cousins-visits-president-trump-white-house","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/kirk-cousins.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 23:09:14","author":"Scott Thompson","authors":["Scott Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":0.036},{"id":297893550,"title":"D.C.'s Planned Removal of Black Lives Matter Mural Reflects Mayor's Delicate Position","text":"WASHINGTON -- On Wednesday morning in downtown Washington, D.C., Keyonna Jones stood on her artwork and remembered the time when she and six other artists were summoned by the mayor's office to paint a mural in the middle of the night.\n\n\"BLACK LIVES MATTER,\" the mural read in bright yellow letters on a street running two city blocks, blaring the message at the White House sitting just across Lafayette Square. In June 2020, when Jones helped paint the mural, demonstrations were breaking out in cities nationwide in protest of George Floyd's murder. The creation of Black Lives Matter Plaza was a statement of defiance from D.C.'s mayor, Muriel E. Bowser, who had clashed with President Donald Trump, then in his first term, over the presence of federal troops in the streets of her city.\n\nBut Tuesday evening, the mayor announced the mural was going away.\n\nJones said the news upset her. But, she added of the mayor in an interview, \"I get where she is coming from.\"\n\nThe city of Washington is in an extraordinarily vulnerable place these days. Republicans in Congress have introduced legislation that would end D.C.'s already limited power to govern itself, stripping residents of the ability to elect a mayor and City Council. Trump himself has said that he supports a federal takeover of Washington, insisting to reporters that the federal government would \"run it strong, run it with law and order, make it absolutely, flawlessly beautiful.\" In recent days, the administration has been considering executive orders in pursuit of his vision for the city.\n\nPotential laws and orders aside, the administration has already fired thousands of federal workers, leaving residents throughout the city without livelihoods and, according to the city's official estimate, potentially costing Washington around $1 billion in lost revenue over the next three years.\n\nGiven all this, Bowser, a Democrat, described her decision about Black Lives Matter Plaza as a pragmatic calculation.\n\n\"We have bigger fish to fry\" than a fight over the plaza, she said at a town hall on Wednesday, which was set up to provide guidance to laid-off federal workers. Bowser said that the mural was a significant part of the city's history, particularly in the summer of 2020. But \"now our focus is on making sure our residents and our economy survive,\" she said.\n\nIf Trump was satisfied, he gave little sign of it. In a post on Truth Social on Wednesday night, the president said his administration had ordered the mayor to \"clean up all of the unsightly homeless encampments\" in the district. \"If she is not capable of doing so, we will be forced to do it for her!\" he wrote. He then thanked her for her efforts.\n\nTo be sure, Bowser did not say whether the decision about Black Lives Matter Plaza was in direct response to any specific actions or threats by Congress or the White House, though she acknowledged that people in the administration did not like the mural.\n\nOn Monday, U.S. Rep. Andrew Clyde, R-Ga., who has often taken legislative aim at Washington, introduced a bill threatening to withhold millions in federal funds if the city did not repaint and rename the plaza. But the mayor said the decision had been made for some time and that she had planned to announce it later this month at a meeting on the celebrations around the country's 250th birthday.\n\nIn a social media post Tuesday evening, the mayor said the plaza would be redesigned as part of a citywide mural project in connection with the anniversary. But, she said Wednesday, news media inquiries about the fate of the plaza forced her hand. The mayor's office gave few details as to whether or when Black Lives Matter Plaza might be renamed, or how the mural itself would be removed, a process that is more complicated than a simple paint job given its inlaid bricks and other features.\n\nAt the town hall, Bowser said that she believed one executive order possibly aimed at cracking down on crime and homelessness in the District of Columbia had apparently been withdrawn, as The Washington Post had reported.\n\nBut Trump administration officials said they remained committed to addressing the president's complaints about the district and said an executive order from the White House focused on the city could still come as soon as next week. Officials declined to elaborate on the specifics of the president's order, saying it was still under review and that the timeline remained fluid.\n\n\"President Trump has been crystal clear that he intends to restore law and order to the nation's capital and reinvigorate the majesty of this storied city,\" Harrison Fields, a White House spokesperson, said in a statement.\n\nBowser suggested that the risks to Washington of additional federal intervention and even a takeover were always present, given the city's complicated status within the U.S. government. She expressed no second thoughts about her decision concerning Black Lives Matter Plaza.\n\n\"This is the threat to our city right now,\" the mayor said. \"We go into a budget season where our revenue was estimated to be down by a billion dollars and we still have the threat of Medicaid cuts looming. That's what D.C. residents want me to be focused on.\"\n\n\"They want us to be smart and strategic and get to the other side,\" the mayor added. \"And that's my job: I'm going to navigate us to the other side.\"\n\n(STORY CAN END HERE. OPTIONAL MATERIAL FOLLOWS.)\n\nBowser has mostly taken a diplomatic approach toward Trump, visiting him at Mar-a-Lago before the inauguration and pledging to work closely with him on shared priorities, like bringing federal employees back to the office.\n\nWhen she characterizes her discussions with the White House about D.C., which she describes as frequent and ongoing, Bowser often emphasizes a quintessentially Trumpian goal of making D.C. \"the most beautiful capital city in the world.\" She has tried to make the case that some things the administration has apparently considered, like putting a multitude of large federal buildings on the local real estate market all at once, would be counterproductive to that aesthetic vision.\n\nThe decision about Black Lives Matter Plaza was perhaps the most high-profile sign yet of the mayor's attempted balancing act. Not everyone was sympathetic.\n\n\"I would never understand why she's doing it,\" said Angela Harrelson, an aunt of George Floyd, who lives in Minnesota. \"They can make up all the excuses that they want to about this. The message they are sending is still the same: You are trying to destroy history, you are trying to erase a memory.\"\n\nAt the plaza Wednesday afternoon, as a steady rain fell, Kevin Thornton, 63, a Black man who works at a nearby hotel, asked what the mayor hoped to achieve by ceding anything to Trump.\n\n\"You can kiss the ring all day\" and get nothing, he said. He believed Bowser showed strength back in 2020 when she ordered the mural painted in the first place. \"I thought you got a backbone,\" he said.\n\nStill, Jones, the artist who helped paint the mural five years ago, said she understood the mayor's difficult position, with so much at stake for the city. Jones said she was grateful to have played a part in the creation of Black Lives Matter Plaza, even if it would likely be gone soon.\n\n\"Being a Black woman, I'm kind of used to the feeling of things being taken away and being erased from our history,\" Jones said. \"It's a moment in time. You cannot take it away. I think the whole world felt that moment, recognized that moment. I think they are going to feel this moment too, when it's taken away.\"\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- On Wednesday morning in downtown Washington, D.C., Keyonna Jones stood on her artwork and remembered the time when she and six other artists were summoned by the mayor's office to paint a mural in the middle of the…","url":"https://www.berkshireeagle.com/nyt/d-c-s-planned-removal-of-black-lives-matter-mural-reflects-mayors-delicate-position/article_ece64d65-bba1-5add-a0bd-1496b7cfcab5.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:08:58","author":"Campbell Robertson and Tim Arango,North Adams Pride","authors":["Campbell Robertson and Tim Arango","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":0.036}]}