{"offset":0,"number":50,"available":13391,"news":[{"id":252248930,"title":"Ex-ESPN star Keith Olbermann questions whether Trump was shot by a bullet after former doc’s update","text":"Former ESPN anchor Keith Olbermann fired off a critical post about Donald Trump’s former doctor and the assassination attempt at Trump’s campaign rally last week. Congressman Ronny Jackson, who served as physician to the president during the Trump administration, said in a statement Saturday he evaluated the former president in Bedminster, New Jersey, last week. Jackson said Trump sustained a gunshot wound to the right ear from a high-powered rifle used by the would-be assassin. “The bullet track produced a 2 cm-wide wound that extended down to the cartilaginous surface of the ear,” the physician said. “There was initially significant bleeding, followed by marked swelling of the entire upper ear. The swelling has since resolved, and the wound is beginning to granulate and heal properly. “Based on the highly vascular nature of the ear, there is still intermittent bleeding requiring a dressing to be in place. Given the broad and blunt nature of the wound itself, no sutures were required.” Olbermann responded critically on X. “In brief: Ronny Jackson isn’t a doctor. Which is perfect, because Trump wasn’t hit by a bullet,” he wrote. Trump, who had a bandage over his right ear at the Republican National Convention earlier this week, recalled being wounded by the would-be assassin at a campaign rally in Butler, Pennsylvania. He said last week he was “struck by a bullet.” “If I had not moved my head at that very last instant, the assassin’s bullet would have perfectly hit its mark,” Trump said. “And I would not be here tonight. We would not be together.” Olbermann is the latest to question Trump’s injuries. MSNBC host Joy Reid did the same, while legendary tennis star Martina Navratilova called the bandage around his ear a “PR” stunt.","summary":"Former ESPN anchor Keith Olbermann fired off a critical post about Donald Trump’s former doctor and the assassination attempt at Trump's campaign rally last week.","url":"https://nypost.com/2024/07/20/us-news/ex-espn-star-keith-olbermann-questions-whether-trump-was-shot-by-a-bullet-after-former-docs-update/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-w2nyr0jin-1721523237361.jpg?quality=75&strip=all&1721508862&w=1200","video":"https://cdn.jwplayer.com/videos/YPaeFVyf-RyIcpnTz.mp4","publish_date":"2024-07-21 00:58:28","author":"Fox News","authors":["Fox News"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.502},{"id":252248728,"title":"Trump Embraces Polarizing Rhetoric at First Rally Following Assassination Attempt","text":"One week after a bullet nearly took his life, former President Donald Trump delivered a speech filled with divisive rhetoric that was largely in line with his usual tone. Despite Trump having told reporters that he would pivot to a message of unity, the former president used his Saturday speech in Grand Rapids, Michigan, to call President Joe Biden and Vice President Kamala Harris names, refer to Biden’s allies as “thugs,” argue without evidence that Democrats cheated in the 2020 election, and characterize migrants as coming from prisons, jails and mental institutions. The bombastic, expressive intonation that has defined his political career returned, as well as his penchant for name-calling, referring to Biden as “Crooked Joe,” “feeble old guy,” “low IQ” and “stupid,” and Harris as “Laughin’ Kamala,” “crazy” and “nuts.” He referred to Democrats as “enemies of the democracy” and bemoaned the “grossly incompetent people running our country.” Trump railed against migrants, arguing that the U.S. was a “dumping ground” for the world, which is “laughing at us.” He called for a “big deportation” to “get them the hell out.” The former president has long claimed without evidence that Democrats committed fraud in 2020, a false message that he reiterated on Saturday. “That’s the only thing they’re good at,” he said, adding later that “they have no shame whatsoever.” The name-calling and divisive rhetoric came just days after Trump said in his Republican National Convention acceptance speech that “the discord and division in our society must be healed.” Biden campaign spokesperson Ammar Moussa slammed Trump’s rally in a statement. “We were promised a new Donald Trump who would unite the country — instead all we saw tonight was the same Donald Americans keep rejecting over and over: He’s peddling the same lies, running the same campaign of revenge and retribution, touting the same failed policies, and — as usual — focused only on himself,” Moussa said. The Trump campaign has argued that it does not care who is at the top of the Democratic ticket, but a senior adviser to Trump said that it prefers Biden to be the nominee because the campaign had been planning for that matchup. During his Saturday speech, Trump criticized the Democrats who are urging Biden to exit the race. “This guy goes and he gets the votes, and now they want to take it away,” Trump said. “That’s democracy. They talk about democracy. ‘Let’s take it away from him.’” Trump also thanked Americans for their “extraordinary outpouring” of support after last Saturday’s shooting. “I shouldn’t be here,” Trump said. Saturday’s rally is Trump’s first since the assassination attempt in Butler, Pennsylvania, one week ago during which one attendee was killed and two were hospitalized. The former president said that the media “covered it fairly,” a departure from how he usually talks about reporters. However, minutes later he pivoted back to criticizing journalists. Trump also revealed during the rally that China’s President Xi Jinping wrote him a note after the shooting. “I got along very well with President Xi. He’s a great guy,” Trump said. “Wrote me a beautiful note the other day when he heard about what happened.” Trump did not describe the contents of the note. The atmosphere at the arena appeared cheerful and patriotic as many supporters expressed confidence in Trump’s electoral prospects. “If he can fight that hard and have all that money and do whatever he wants and comes out here and fights for us, that’s pretty powerful,” said Ben Beckon from Grand Rapids, Michigan. Trump’s running mate, Sen. JD Vance of Ohio, took the stage before the former president and almost immediately laid into his opponent, Harris. “What has she done other than collect a check from her political offices?” he said, adding that she was handling the border “during the biggest disaster, open border that we’ve ever had in this country.” Later, he tried to head off the suggestion that his ticket holds extreme views. “There’s nothing radical about stopping the poison and the gangs and the criminals, from taking care of our country,” Vance said. “We’ve got to shut down that border, shut down the fentanyl and make America safe for American citizens again.” The Biden campaign had pre-emptively criticized Saturday’s rally by calling the Trump-Vance ticket “the most extreme, anti-worker presidential ticket in American history.” “Today, an Ivy league billionaire who screwed over workers will partner with an Ivy League millionaire who left workers behind to hit the campaign trail,” the campaign said in an email ahead of the rally. A supporter at Trump’s rally summed up the former president’s running mate decision: “If Trump trusts him, I trust him,” Yvonne Beadle from Algonac, Michigan, told NBC News. “I don’t know much about him,” said Mandie Kirkpatrick from Ludington, Michigan. “Of course there’s a lot of things flying around about him. I trust Trump’s decision, so if he says he’s good, then I trust that.” The Grand Rapids rally comes on the heels of the Republican National Convention in Milwaukee, where Trump officially became the Republican nominee for president. His acceptance speech was the longest in convention history, topping the previous record he set in 2016. During his speech, which marked his first public remarks since the shooting, he offered his most detailed recollection of the assassination attempt so far. “The amazing thing is that prior to the shot, if I had not moved my head at the very last instant, the assassin’s bullet would have perfectly hit its mark, and I would not be with you tonight,” Trump said during Thursday’s acceptance speech. Much of the rest of his convention speech circled back to familiar themes and rhetoric he uses on the campaign trail. He reiterated a pledge to “launch the largest deportation operation in the history of our country,” accused opponents of cheating in elections without evidence, and criticized the United Auto Workers union. Michigan remains a crucial swing state on the road to the White House. Biden won the state in 2020, while Trump won it in 2016. Polling indicates that Biden and Trump remained locked in a tight race in battleground states. A July CBS News/YouGov poll found that in battleground states, Biden polled at 48% and Trump at 51%, though the results were within the margin of error.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOne week after a bullet nearly took his life, former President Donald&#8230;\n\n\nThis Post: Trump Embraces Polarizing Rhetoric at First Rally Following Assassination Attempt first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-embraces-polarizing-rhetoric-at-first-rally-following-assassination-attempt/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-07/240720-trump-vance-ch-1317-a6310f.jpg","video":null,"publish_date":"2024-07-21 00:42:02","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.816},{"id":252248652,"title":"Challenges in Biden’s campaign are causing worry among Democrats","text":"If you are a Trump-hating Democrat, you are probably having trouble separating your nightmares from reality. After all, the Republicans just had a wildly successful convention while your party is forming circular firing squads. Worst of all, Joe Biden has picked a terrible time to throw a hissy fit, making it impossible to know who will be your party’s presidential nominee. Consider two reports circulating Friday: One says Biden is “in it to win it” and sees a path to victory, the other insists he and his family are discussing his imminent withdrawal. At this point, it’s not clear which is true or even which would be better for Dems. One thing is certain: the confusion perfectly captures the helter-skelter mess Biden has created. His misbegotten presidency amounts to a long list of major failures and he should have had the sense a year ago to pass the torch. But he and the people around him grew fat with arrogance and, cosseted by a cheerleading media, came to believe their own lies about his “accomplishments.” The comeuppance is harsh, with even his exit a disaster. Make no mistake — it will be an exit from the race. He’s running out of time and options, and his attacks on Barack Obama and Hillary Clinton demonstrate that he’s mad enough to blow up the party on his way out the door. Feeling betrayed by people he thought were friends and allies, he’s hitting back by making the most incendiary charge one Dem can make against others: blaming them for Trump’s 2016 election. A Biden source tells NBC: “Can we all just remember for a minute that these same people who are trying to push Joe Biden out are the same people who literally gave us Donald Trump? In 2015, Obama, Pelosi, Schumer pushed Biden aside in favor of Hillary; they were wrong then, and they are wrong now.” The source went on to denounce polls as “BS” and added: “maybe, just maybe, Joe Biden is more in touch with actual Americans than Obama-Pelosi-Schumer?” If that’s Biden’s view, it’s especially bizarre coming from a man who has spent 50 years in Washington, where “actual Americans,” as in ordinary people, are as scarce as the proverbial hen’s teeth. His denial about the polls is also strange given that they have been consistent for months in showing that two-thirds of Democrats believe he should withdraw. A poll here or there might be off, but it’s a fool’s errand to argue with a clear consensus. Perhaps Biden doesn’t even remember the debate debacle on June 27, but it sealed his fate. I said then he was toast and predicted he would be gone from the race within a month, so his exit is on schedule. There’s another reason why Biden can’t be saved: when a Dem incumbent has lost the leftist media, there is no hope. Without the propaganda arm to cover up his stumbles and attack Trump, Biden is forced to articulate his own case, a job beyond his cognitive capacity. The New York Times, which has turned on Biden with a vengeance, recounted Saturday in painful detail how he fumbled every effort to save himself. The Gray Lady is finally getting the picture: the president is a bumbling incompetent, and always has been. In fact, Biden and his few remaining allies have given up arguing he has done a good job as president, focusing entirely on how bad they claim Trump would be. That the president told donors “it’s time to put Trump in a bullseye” shortly before the assassination attempt on the former president is an omen that Biden’s luck has run out. Finally, in a move that recalls the way vultures circle over a soon-to-be corpse, Vice President Kamala Harris picked Friday to visit an ice-cream store. There’s nothing subtle about stealing your boss’ favorite photo-op! Although there’s talk among party pooh-bahs of holding a mini-primary before or during the August convention, they’ll need Biden’s cooperation because the vast majority of delegates are pledged to him on the first ballot. And any move that doesn’t result in Harris being the nominee could split the party along racial lines. That would be rough justice given how Dems have racialized politics for decades. Meanwhile, the GOP convention was the party’s most enthusiastic in years and showcased several key developments. Among them are that Republicans are firmly united behind Trump and his goal of transforming the party into a populist force for working and middle-class Americans. Those forgotten voters provided his winning edge in 2016 and he is going back to the well with reinforcements. He is also broadening the base by making extra efforts to attract black and Latino workers. The roster of speakers included an incredibly diverse line-up, and even featured the president of the Teamsters Union. If there were any doubts about Trump’s focus on workers, they ended with his selection of Ohio Sen. JD Vance as his running mate. His announcement said the author of “Hillbilly Elegy” will be “strongly focused on the people he fought so brilliantly for, the American Workers and Farmers in Pennsylvania, Michigan, Wisconsin, Ohio, Minnesota, and far beyond . . .” It’s no secret the upper Midwest states hold the keys to victory, and Trump’s commitment to winning them is underscored by the way he assigned them to Vance. Indeed, that was a clarifying moment about why he chose Vance. During his conversations about his veep options, Trump always cited two general criteria: Someone who could help him win and someone who could succeed him. Among the contenders, Vance scored highest on both tests. He is half Trump’s age, a clear working-class populist, a big fundraiser and whip-smart. There are, it is true, differences between their economic and tax ideas, but that won’t be a problem unless Vance is foolish enough to undercut Trump. It’s more likely he will quickly realize there is no Republican future in pursuing policies that please Chuck Schumer and Bernie Sanders. As for Trump himself, his acceptance speech managed to be both inspiring and disappointing. His calls for national unity and his riveting description of the effort to kill him made the speech a must-see historic event. Unfortunately, he talked too long — 1 hour and 32 minutes — and lapsed into a rally ramble full of non sequiturs that diluted the initial impact. Less would have been more. In fairness, he had been through an extraordinary week and my interview with him the day after the shooting left me convinced he really does want to unite America and reduce the nasty rhetoric. He partially succeeded Thursday, but still has work to do to persuade fence-sitting voters he realizes the gravity of the nation’s polarization. If he can do that, it won’t matter whether Biden or somebody else is the Dem nominee. Building on his successful policies, a kinder, gentler Trump would win in a landslide.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIf you are a Trump-hating Democrat, you are probably having trouble separating&#8230;\n\n\nThis Post: Challenges in Biden&#8217;s campaign are causing worry among Democrats first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/challenges-in-bidens-campaign-are-causing-worry-among-democrats/","image":"https://internewscast.com/wp-content/uploads/2024/07/Bidens-fading-campaign-is-creating-a-Democrat-nightmare.jpg","video":null,"publish_date":"2024-07-21 00:31:21","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.344},{"id":252248792,"title":"Biden’s fading campaign is creating a Democrat nightmare","text":"If you are a Trump-hating Democrat, you are probably having trouble separating your nightmares from reality. After all, the Republicans just had a wildly successful convention while your party is forming circular firing squads. Worst of all, Joe Biden has picked a terrible time to throw a hissy fit, making it impossible to know who will be your party’s presidential nominee. Consider two reports circulating Friday: One says Biden is “in it to win it” and sees a path to victory, the other insists he and his family are discussing his imminent withdrawal. At this point, it’s not clear which is true or even which would be better for Dems. One thing is certain: the confusion perfectly captures the helter-skelter mess Biden has created. His misbegotten presidency amounts to a long list of major failures and he should have had the sense a year ago to pass the torch. But he and the people around him grew fat with arrogance and, cosseted by a cheerleading media, came to believe their own lies about his “accomplishments.” The comeuppance is harsh, with even his exit a disaster. Getting ugly, and sad Make no mistake — it will be an exit from the race. He’s running out of time and options, and his attacks on Barack Obama and Hillary Clinton demonstrate that he’s mad enough to blow up the party on his way out the door. Feeling betrayed by people he thought were friends and allies, he’s hitting back by making the most incendiary charge one Dem can make against others: blaming them for Trump’s 2016 election. A Biden source tells NBC: “Can we all just remember for a minute that these same people who are trying to push Joe Biden out are the same people who literally gave us Donald Trump? In 2015, Obama, Pelosi, Schumer pushed Biden aside in favor of Hillary; they were wrong then, and they are wrong now.” The source went on to denounce polls as “BS” and added: “maybe, just maybe, Joe Biden is more in touch with actual Americans than Obama-Pelosi-Schumer?” If that’s Biden’s view, it’s especially bizarre coming from a man who has spent 50 years in Washington, where “actual Americans,” as in ordinary people, are as scarce as the proverbial hen’s teeth. His denial about the polls is also strange given that they have been consistent for months in showing that two-thirds of Democrats believe he should withdraw. A poll here or there might be off, but it’s a fool’s errand to argue with a clear consensus. Perhaps Biden doesn’t even remember the debate debacle on June 27, but it sealed his fate. I said then he was toast and predicted he would be gone from the race within a month, so his exit is on schedule. There’s another reason why Biden can’t be saved: when a Dem incumbent has lost the leftist media, there is no hope. Without the propaganda arm to cover up his stumbles and attack Trump, Biden is forced to articulate his own case, a job beyond his cognitive capacity. The New York Times, which has turned on Biden with a vengeance, recounted Saturday in painful detail how he fumbled every effort to save himself. The Gray Lady is finally getting the picture: the president is a bumbling incompetent, and always has been. With allies like these . . . In fact, Biden and his few remaining allies have given up arguing he has done a good job as president, focusing entirely on how bad they claim Trump would be. That the president told donors “it’s time to put Trump in a bullseye” shortly before the assassination attempt on the former president is an omen that Biden’s luck has run out. Finally, in a move that recalls the way vultures circle over a soon-to-be corpse, Vice President Kamala Harris picked Friday to visit an ice-cream store. There’s nothing subtle about stealing your boss’ favorite photo-op! Although there’s talk among party pooh-bahs of holding a mini-primary before or during the August convention, they’ll need Biden’s cooperation because the vast majority of delegates are pledged to him on the first ballot. And any move that doesn’t result in Harris being the nominee could split the party along racial lines. That would be rough justice given how Dems have racialized politics for decades. Meanwhile, the GOP convention was the party’s most enthusiastic in years and showcased several key developments. Among them are that Republicans are firmly united behind Trump and his goal of transforming the party into a populist force for working and middle-class Americans. Those forgotten voters provided his winning edge in 2016 and he is going back to the well with reinforcements. He is also broadening the base by making extra efforts to attract black and Latino workers. The roster of speakers included an incredibly diverse line-up, and even featured the president of the Teamsters Union. If there were any doubts about Trump’s focus on workers, they ended with his selection of Ohio Sen. JD Vance as his running mate. His announcement said the author of “Hillbilly Elegy” will be “strongly focused on the people he fought so brilliantly for, the American Workers and Farmers in Pennsylvania, Michigan, Wisconsin, Ohio, Minnesota, and far beyond . . .” It’s no secret the upper Midwest states hold the keys to victory, and Trump’s commitment to winning them is underscored by the way he assigned them to Vance. Indeed, that was a clarifying moment about why he chose Vance. During his conversations about his veep options, Trump always cited two general criteria: Someone who could help him win and someone who could succeed him. GOP ticket’s promise Among the contenders, Vance scored highest on both tests. He is half Trump’s age, a clear working-class populist, a big fundraiser and whip-smart. There are, it is true, differences between their economic and tax ideas, but that won’t be a problem unless Vance is foolish enough to undercut Trump. It’s more likely he will quickly realize there is no Republican future in pursuing policies that please Chuck Schumer and Bernie Sanders. As for Trump himself, his acceptance speech managed to be both inspiring and disappointing. His calls for national unity and his riveting description of the effort to kill him made the speech a must-see historic event. Unfortunately, he talked too long — 1 hour and 32 minutes — and lapsed into a rally ramble full of non sequiturs that diluted the initial impact. Less would have been more. In fairness, he had been through an extraordinary week and my interview with him the day after the shooting left me convinced he really does want to unite America and reduce the nasty rhetoric. He partially succeeded Thursday, but still has work to do to persuade fence-sitting voters he realizes the gravity of the nation’s polarization. If he can do that, it won’t matter whether Biden or somebody else is the Dem nominee. Building on his successful policies, a kinder, gentler Trump would win in a landslide.","summary":"If you are a Trump-hating Democrat, you are probably having trouble separating your nightmares from reality.","url":"https://nypost.com/2024/07/20/opinion/bidens-fading-campaign-is-creating-a-democrat-nightmare/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/2024-las-vegas-nevada-biden-85656631_22dc98.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-21 00:26:04","author":"Michael Goodwin","authors":["Michael Goodwin"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.397},{"id":252248476,"title":"Trump says he loves Elon Musk even though he never heard of the $45 million-a-month donation plan from the billionaire","text":"During a rally in Michigan on Saturday, Donald Trump had high praise for Elon Musk, calling the Tesla CEO a \"great\" and \"brilliant guy.\"But the former president added that he didn't know about the tech billionaire's reported plan to donate $45 million a month to a pro-Trump super PAC that will support his campaign. The Wall Street Journal, citing anonymous sources, reported the plan.Musk came out with an endorsement of Trump on July 13, the day of the assassination attempt. Although he has repeatedly shown a rightward shift in his politics, the Tesla CEO had been silent on his preferred candidate until recently.Trump praised Musk at the Saturday rally.\"Elon. I love Elon Musk. Do we love him?\" Trump asked a cheering crowd. \"I love him.\"The former president said that \"we have to make life good for our smart people\" like Musk but added that he didn't know about the large donation plan and only read the report about it.\"I read — I didn't even know this, he didn't even tell me about it, but he gives me $45 million a month,\" Trump said. \"I talked to him just a little while ago to say, 'I was coming here. How you doing?' And he didn't even mention it.\"Musk and a spokesperson for Trump did not return a request for comment from Business Insider.After the Journal published the story about Musk's donation plans, Musk responded with a meme with the caption, \"FAKE GNUS.\" However, he also responded \"Yeah\" to a post from an X account that said, \"Elon Musk went from being an Obama voter to pledging $180 million to elect DJT. The woke left really f*cked up. Badly.\"On the surface, Musk's increasing gravitation toward Trump would appear at odds with their own interests: one runs a successful electrical vehicle company that has benefited from government subsidies, while the other is making EVs a political sticking point.During the Saturday rally, Trump said he thinks electric cars are \"incredible, but they're not for everybody.\"\"Some people have to drive long distances, and they tend to be more expensive,\" he said.The former president said later in the rally that he plans to eliminate the \"electric vehicle mandate on day one,\" even though the Biden administration has not implemented such a mandate.Some critics say the stricter emissions regulations issued by the Environmental Protection Agency in March force automakers to make electric vehicles a large part of their sales.Still, the Journal reported that Trump's appraisal of electric vehicles in recent weeks while bashing any potential government mandate around them represents a shift in tone from the former president.Musk, for his part, has given Trump his platform back on Twitter-turned-X — though Trump has only posted on the account a few times — and said earlier this week that he supports taking away government subsidies.\"Take away the subsidies. It will only help Tesla,\" Musk said on X on July 16. \"Also, remove subsidies from all industries.\"","summary":"Donald Trump praised Elon Musk at a Michigan rally but said that he never heard about the $45 million-per-month donation plan from the billionaire,","url":"https://www.businessinsider.com/donald-trump-loves-elon-musk-45-million-donation-pac-2024-7","image":"https://i.insider.com/66575a6e1cd3b17790413146?width=1136&format=jpeg","video":null,"publish_date":"2024-07-21 00:21:57","author":"Lloyd Lee","authors":["Lloyd Lee"],"language":"en","source_country":"US","sentiment":-0.453},{"id":252248752,"title":"Laura Loomer Cheers Rep. Sheila Jackson Lee’s Death in Racist Rant","text":"Laura Loomer, a white nationalist and Donald Trump’s one-time favored pick for a campaign role, sparked outrage on social media by metaphorically dancing on a Black Congresswoman’s grave. Rep. Sheila Jackson Lee (D-TX), a progressive voice in Congress who fought for civil and women’s rights, died Friday evening at 74, shortly after she announced she was battling pancreatic cancer. “Even on her death bed, this ghetto bitch couldn’t keep President Trump’s name out of her disgusting mouth,” the conservative TV host wrote in a series of posts on X. Loomer initially reposted one of Jackson’s last posts; a July 20 comment criticizing the former president. “Sheila Jackson Lee will be remembered as a destructive force in America and one of the most low IQ members of Congress in the history of our nation.” Jackson Lee was a graduate of Yale College and the University of Virginia Law School prior to serving 30 years in Congress. X users were quick to call Loomer’s “ghetto bitch” remarks racist and vile, including Jackson Lee’s former colleague in the Congressional Black Caucus, Rep. Ritchie Torres (D-NY.) “These are the words of a rabid racist who represents everything that is rancid and rotten about the far right,” Torres wrote on X. “There is a special place in hell for Laura Loomer.” Former Rep. Adam Kinzinger (R-IL) piled onto the debate, writing simply, “I don’t think ‘heaven bound’ people tweet things like this.” Loomer doubled down on her remarks Saturday afternoon, adding curtly: “I meant every word I said,” and “everything I said about Sheila Jackson Lee is true.”","summary":"Joe Raedle/Getty Images and Marcus Ingram/Getty ImagesLaura Loomer, a white nationalist and Donald Trump’s one-time favored pick for a campaign role, sparked outrage on social media by metaphorically dancing on a Black Congresswoman’s grave.\n\nRep. Sheila Jackson Lee (D-TX), a progressive voice in Congress who fought for civil and women’s rights, died Friday evening at 74, shortly after she announced she was battling pancreatic cancer.\n\n“Even on her death bed, this ghetto bitch couldn’t keep President Trump’s name out of her disgusting mouth,” the conservative TV host wrote in a series of posts on X. Loomer initially reposted one of Jackson’s last posts; a July 20 comment criticizing the former president. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/laura-loomer-cheers-rep-sheila-jackson-lees-death-in-racist-rant","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1721515064/MixCollage-20-Jul-2024-06-37-PM-7144_q2yn4t","video":null,"publish_date":"2024-07-21 00:15:23","author":"Josephine Walker","authors":["Josephine Walker"],"language":"en","source_country":"US","sentiment":0.135},{"id":252248442,"title":"Beyond Biden, Democrats are split over who would be next — VP Harris or launch a ‘mini primary’","text":"By LISA MASCARO, DARLENE SUPERVILLE and WILL WEISSERT WASHINGTON — As Democrats churn over whether President Joe Biden should stay in the 2024 race, the party turmoil is deepening over whether his Vice President Kamala Harris is next in line for the job or if a “mini primary” should be quickly launched to choose a new nominee before the party’s August convention. Harris hit the campaign fundraising circuit Saturday in breezy Provincetown, Massachusetts, and picked up a nod from the state’s prominent Democratic Sen. Elizabeth Warren, who said before the visit that if Biden were to step aside, his vice president is “ready to step up.” At the event, which organizers said raised $2 million and was attended by 1,000 guests, Harris did not mention the calls for Biden to leave the race or for her to replace him, instead repeating one of her regular campaign lines: “We’re going to win this election,” she said. “Do we believe in freedom? Do we believe in equality? Do we believe in the promise of America? Then are we ready to fight for it?” she called to a cheering crowd. “When we fight, we win.” But installing Harris to the top of the ticket, which would be a history-making moment for the party elevating the first woman, Black person and person of South Asian descent as its presidential nominee, is not at all certain. Officials from the highest ranks, including Speaker Emerita Nancy Pelosi, prefer an open process, some believing it would strengthen any Democratic nominee to confront Republican Donald Trump. “If you think that there is consensus among the people who want Joe Biden to leave…. that they will support Kamala, Vice President Harris, you would be mistaken,” Rep. Alexandria Ocasio-Cortez said this week on a widely discussed social media post. With the publicly aired deliberations, Democrats are prolonging an extraordinary moment of uncertainty and upheaval. Biden has weighty options before him this weekend that could set the direction of the country and his party as the nation heads toward the November election. It’s creating a stark juxtaposition with Republicans, who, after years of bitter and chaotic infighting over Trump, are energized and embracing the former president’s far-right takeover of the GOP, despite his criminal conviction in a hush money case and pending federal criminal indictment for trying to overturn the 2020 election before the Jan. 6, 2021, attack on the Capitol. Biden, despite a week of campaign stops, interviews and insistence that he is the best candidate to take on Trump in a rematch, hasn’t been able to quell the uproar. Skeptical Democrats doubt he can keep the White House after his stumbled debate performance last month, and worry he will take hopes for party control of Congress down with him. On Saturday, Rep. Mark Takano, the top Democrat on the House Veterans Affairs Committee, added his name to the list of nearly three dozen Democrats in Congress who say it’s time for Biden to leave the race. The Californian called on Biden to “pass the torch,” to Harris. More lawmakers are expected to speak out in the days ahead. Donors have raised concerns. “There is no joy in the recognition he should not be our nominee in November,” said Democratic Rep. Morgan McGarvey of Kentucky, one of the Democrats urging Biden’s exit from the race. From his beach home in Delaware, Biden, 81, is isolating after announcing a COVID infection, but also politically with a small circle of family and close advisers. White House doctor Kevin O’Connor said Saturday that Biden’s symptoms were improving, but that he remained plagued by a dry cough and hoarseness. He received separate briefings Saturday on domestic and national security issues, the White House said. The president’s team insisted he’s ready to return to the campaign this coming week to counter what he called a “dark vision” laid out by Trump. “Together, as a party and as a country, we can and will defeat him at the ballot box,” Biden said in a statement Friday. But outside the Rehoboth enclave, the debate and passions are intensifying. Very few of the Democratic lawmakers who are agitating for Biden to leave have mentioned Harris in their statements, and some have said they favor an open nominating process that would throw the party’s endorsement behind a new candidate. A person familiar with Pelosi’s thinking said that while she is a friend and admirer of the vice president, she believes that anybody who wants to be president is better served by such a process, believing that whoever emerges as the candidate would be strengthened to win the election. The person spoke on condition of anonymity to characterize Pelosi’s thought process. Rep. Zoe Lofgren of California, a Pelosi ally who has called on Biden to step aside, said Friday on MSNBC that some kind of “mini-primary” that would include Harris makes sense. Democratic Sens. Jon Tester of Montana and Peter Welch of Vermont have both called for Biden to exit the race and said they would favor an open nominating process at the convention. “Having it be open would strengthen whoever is the ultimate nominee,” Welch said in an interview with The Associated Press. Other Democrats say it would be politically unthinkable to move to someone other than Harris, and logistically unworkable with a virtual nominating vote being planned for early next month, before the Democratic convention opens in Chicago on Aug. 19. Minnesota Rep. Betty McCollum, who has called on Biden to step aside, explicitly endorsed Harris as a replacement. “To give Democrats a strong, viable path to winning the White House, I am calling upon President Biden to release his delegates and empower Vice-President Harris to step forward to become the Democratic nominee for President,” McCollum said in her statement. The standoff over Biden’s political future has become increasingly untenable for the party and its leaders, a month from the Democratic National Convention that should be a unifying moment to nominate their incumbent president to confront Trump. Instead, the party is at a crossroads unseen in generations. It’s unclear what else, if anything, the president could do to reverse course and win back lawmakers and Democratic voters, who are wary of his ability to defeat Trump and serve another term, Biden, who sent a defiant letter to Democrats in Congress vowing to stay in the race, has yet to visit Capitol Hill to shore up support, an absence noticed by senators and representatives. The president did conduct a round of virtual conversations with various caucuses in the past week — some of which ended poorly. Associated Press writers Mary Clare Jalonick, Seung Min Kim, Farnoush Amiri and Zeke Miller in Washington contributed to this report.","summary":"Officials from the highest ranks, including Speaker Emerita Nancy Pelosi, prefer an open process, some believing it would strengthen any Democratic nominee.","url":"https://www.ocregister.com/2024/07/20/beyond-biden-democrats-are-split-over-who-would-be-next-vp-harris-or-launch-a-mini-primary/","image":"https://www.ocregister.com/wp-content/uploads/2024/07/AP24199694798323.jpg?w=1024","video":null,"publish_date":"2024-07-21 00:12:42","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.014},{"id":252248416,"title":"Key Moments from Donald Trump's Michigan Rally","text":"Former President Donald Trump held his first campaign rally since surviving an assassination attempt last weekend, addressing a crowd at Van Andel Arena in Grand Rapids, Michigan, on Saturday.The event came on the heels of Trump's official nomination at the Republican National Convention (RNC) and recent legal victories.Heightened Security MeasuresSecurity was notably tighter at the Michigan rally, with the U.S. Secret Service taking the lead following the incident in Butler, Pennsylvania. Local law enforcement agencies, including the Grand Rapids Police Department, Kent County Sheriff's Office, and Michigan State Police, provided additional support.Trump's Appearance, No BandageAs Trump took the stage, he sported a smaller, beige-colored bandage on his ear, a visible reminder of the recent assassination attempt. The former president had been wearing a visible, white bandage over his right ear following the attempt on his life in Pennsylvania.Despite the ordeal, Trump appeared energetic and defiant, addressing the incident and praising the actions of his security team and first responders.JD Vance's Debut as Running MateOhio Senator JD Vance made his first appearance as Trump's newly announced running mate. In his 13-minute speech, Vance focused on appealing to blue-collar and middle-class voters in key Rust Belt states.He attacked the Biden administration's border policies and echoed Trump's \"Make America Safe Again\" slogan.Vance criticized Vice President Kamala Harris for her role as \"border czar,\" calling it a disaster. He emphasized his own humble beginnings in Ohio and stressed the importance of restoring the American dream for every child in the country.\"Took a Bullet for Democracy\" ClaimIn a striking moment during the rally, Trump declared that he \"took a bullet for democracy.\" This statement was a direct reference to the assassination attempt at his rally in Butler, Pennsylvania, last weekend.Rep. Ronny Jackson, Trump's physician, has stated that a bullet grazed Trump's right ear during the incident.Impromptu \"Poll\" on Democratic OpponentsIn a notable moment, Trump paused to comment on recent efforts by some Democrats to push President Biden off their ticket. He then conducted an impromptu \"poll\" with the Republican audience, asking who they most wanted him to run against.Trump first mentioned Vice President Kamala Harris, mispronouncing her name, which elicited boos from the crowd.When he named \"crooked Joe Biden,\" the crowd's booing intensified significantly. Trump also mentioned Gretchen Whitmer, the Democratic governor of Michigan, who received boos but not as loudly as those for Biden.Controversial Remarks on Foreign LeadersTrump doubled down on his praise for leaders that the Biden administration and other U.S. officials have condemned as dictators. He spoke positively about Chinese President Xi Jinping, describing him as a \"brilliant man\" who controls 1.4 billion people with an \"iron fist.\" Trump asserted that Xi makes people like Biden look like \"babies\" in comparison.In a notable revelation, Trump claimed that Xi and other world leaders had reached out to him following last week's assassination attempt. \"I got along very well with President Xi, who's a great guy,\" Trump said. \"He wrote me a beautiful note the other day when he heard about what happened.\"Trump extended this claim to other global leaders, stating, \"Most of the leaders did, you know, a lot of them didn't like what I was doing to them, but they also knew it was about time, the jig was up, right? It was about time. But they wrote me, almost all of them wrote me notes. It was nice.\"The former president used these purported communications to emphasize his international relationships, adding, \"No, I have a good relationship with all of them. That's a good thing.\"Acknowledging the scrutiny his praise of Xi often draws in the press, Trump remained undeterred, even expanding on his comments. He went further by describing both Xi and Russian President Vladimir Putin as \"smart\" and \"tough.\"Distancing from Project 2025In a surprising move, Trump used the rally to distance himself from Project 2025, a conservative policy initiative run by some of his allies. He declared that he is not an \"extremist\" and criticized the project as an effort from the \"severe right\" and \"seriously extreme.\"Trump positioned Project 2025 as \"the opposite of the radical left,\" seemingly attempting to portray himself as a more moderate choice in the upcoming election. This marks a significant escalation in Trump's efforts to separate himself from the Heritage Foundation-led initiative, which has been a target of criticism from Democrats.Looking AheadAs the rally concluded, Trump promised a vigorous campaign in the coming months, with a particular focus on battleground states like Michigan.The 2024 presidential race is shaping up to be one of the most closely watched in recent American history, with legal battles still looming for Trump and questions about Biden's political future persisting.Newsweek contacted the Trump-Vance campaign via email on Saturday for comment.","summary":"The former president said he took a \"bullet for democracy\" while addressing the crowd during the campaign stop.","url":"https://www.newsweek.com/key-moment-donald-trump-michigan-rally-1928061","image":"https://d.newsweek.com/en/full/2433341/donald-trump-michigan.jpg","video":null,"publish_date":"2024-07-21 00:11:27","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.203},{"id":252248316,"title":"Letter from Trump campaign provides update on his injury and treatment following last week’s assassination attempt","text":"NEW YORK – Donald Trump’s campaign released an update on the former president’s health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania. The memo, from Texas Rep. Ronny Jackson, who served as Trump’s White House physician, offers new details on the nature of the GOP nominee’s injuries and the treatment he received in the immediate aftermath of the attack. According to Jackson, Trump sustained a gunshot wound to the right ear from a high-powered riffle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” The bullet track, he said, “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear. There was initially significant bleeding, followed by marked swelling of the entire upper ear.” While the swelling has since resolved and the wound “is beginning to granulate and heal properly,” he said Trump is still experiencing intermittent bleeding, requiring the dressing that was on display at last week’s Republican National Convention. At Saturday’s rally, the white gauze on Trump’s ear was replaced by a skin-colored bandage. “Given the broad and blunt nature of the wound itself, no sutures were required,” Jackson wrote. Trump was initially treated by medical staff at Butler Memorial Hospital. According to Jackson, doctors “provided a thorough evaluation for additional injuries that included a CT of his head.” Trump, he said, “will have further evaluations, including a comprehensive hearing exam, as needed. He will follow up with his primary care physician, as directed by the doctors that initially evaluated him,” he wrote. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” he added. The letter is the first official update about the former president’s condition since the night of the shooting. Jackson, a staunch Trump supporter, said in the letter that, as Trump’s former doctor, he was deeply concerned about the former president’s wellbeing in the aftermath of the attack and met him in Bedminster, New Jersey, late Saturday after Trump returned from Pennsylvania “to personally check on him, and offer my assistance in any way possible.” He said he has been with Trump since that time, evaluating and treating his wound daily. That includes traveling with him Saturday to Michigan, where the former president will hold his first rally since the shooting, joined by his newly named running mate, Ohio Sen. JD Vance. Jackson appears to be licensed to practice medicine in Florida, according to a state health department database. Records from the American Board of Emergency Medicine also show that Jackson has a certification in Emergency Medicine, valid through the end of 2025. A spokesperson for the congressman did not immediately provide a response and Trump campaign’s did not immediately respond to questions. Last year, Trump’s campaign released a letter on President Joe Biden’s 81st birthday from Dr. Bruce A. Aronwald, a New Jersey physician, who said he had been the former president’s doctor since 2021. ___ A previous version of this story mistakenly said Jackson’s emergency certification was valid through the end of 2015. It is valid through the end of 2025. ___ Associated Press writer Cedar Attanasio contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – Donald Trump&#8217;s campaign released an update on the former&#8230;\n\n\nThis Post: Letter from Trump campaign provides update on his injury and treatment following last week&#8217;s assassination attempt first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/letter-from-trump-campaign-provides-update-on-his-injury-and-treatment-following-last-weeks-assassination-attempt/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Trump-campaign-releases-letter-on-his-injury.jpg","video":null,"publish_date":"2024-07-21 00:10:47","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.119},{"id":252248440,"title":"Trump holds first rally after assassination attempt with his new running mate, Vance, by his side","text":"By JOEY CAPPELLETTI and JILL COLVIN GRAND RAPIDS, Mich. — Donald Trump held his first campaign rally since he survived an assassination attempt Saturday, returning to the battleground state of Michigan alongside his newly named running mate. “It was exactly one week ago, even to the hour, even to the minute,” Trump told the crowd, reflecting on the July 13 shooting in Pennsylvania that left him with a bloodied ear, killed one of his supporters and left two others injured. “I stand before you only by the grace of almighty God,” he said, the white gauze on his ear now replaced by a skin-colored bandage. “I shouldn’t be here right now,” he went on. Trump was joined by Ohio Sen. JD Vance at the pair’s first event together since they became the GOP’s nominees at the Republican National Convention in Milwaukee. “I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said before Trump’s arrival. Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, insulting his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience. At one point, Trump glanced at a screen showing him from an unusual angle and joked about his combover. “That’s a severe sucker. What’s with that one?” he said. “I apologize. Man! I looked up there, I said, ‘Whoa!’ That’s like a work of art!” At another point, as he invited a supporter on stage, he quipped, “He does not carry guns!” But Trump also talked about the shooting, acting out how he’d turned his head to look up at a chart of southern border crossings projected on a giant screen, narrowly dodging the bullet that hit his ear. “I owe immigration my life,” he said. Hours before he took the stage, Trump’s supporters crowded the streets of downtown Grand Rapids in anticipation of the former president’s remarks. Supporters began lining up Friday morning, and by Saturday afternoon, the line stretched close to a mile from the entrance of the 12,000-seat Van Andel Arena. Many wore shirts featuring the image of Trump, on stage, after he was shot, pumping his fist in the air, along with the usual red “Make America Great Again” hats. Mike Gaydos, who traveled from Indiana with his three sons to attend the rally, said he didn’t consider himself a “huge” Trump supporter in the past but wanted to show support for the former president following his attempted assassination. “We can’t allow something like that to collar us,” he said. “Bravery is what I thought he showed that day, and I want to show my sons about bravery as well.” Numerous streets, closed as an additional security precaution, were dotted with vendors selling food and apparel. Among them was a vendor from North Carolina who said he had spent the night making shirts featuring “Trump Vance ’24.” Downtown Grand Rapids also saw a significant police presence, with officers stationed on nearly every block, while others patrolled on horseback and bicycles. The heightened security outside the venue created a tense environment, with some attendees mentioning that drones overhead had made them nervous. The event was held indoors, which makes it easier to secure. Attendees were required to pass through a metal detector upon entering the arena, yet the presence of security inside appeared consistent with previous events. “This is the tightest I’ve ever seen the security,” said Renee White, who said that she’s been to 33 of Trump’s rallies. “We usually can bring in some small bags, but today I had to just leave stuff out there.” White had been seated behind the podium at the rally in Butler, Pennsylvania, where the gunman opened fire from a nearby rooftop. She described the shooting as “surreal” but said that it wouldn’t stop her from going to his rallies. “If I’m going to be taken out, at least I’m doing something I love to do, right?” she said. On Saturday, she was again seated behind Trump, almost in the same spot as she had been in Butler. Trump’s choice of Vance was aimed, in part, at helping him win support from Rust Belt voters in places like Michigan, Pennsylvania, Wisconsin and Ohio who helped Trump notch his surprise 2016 victory. Vance specifically mentioned those places during his acceptance speech at the convention, stressing his roots growing up poor in small-town Ohio and pledging not to forget working-class people whose “jobs were sent overseas and children were sent to war.” Democrats have dominated recent elections in Michigan, but Republicans now see an opening in the state, especially as Democrats remain divided about whether Biden should drop out of the race. Biden has insisted he is not quitting, and has attempted to turn the focus back towards Trump, saying Friday that Trump’s acceptance speech at the Republican convention showcased a “dark vision for the future.” Trump on Saturday polled the crowd on who they’d like to see as his opponent, with cheers for Biden and loud boos when Trump asked about Vice President Kamala Harris. Trump and his team have tried to cast Democrats’ efforts to replace Biden as a “coup” in what appears to be part of a larger effort to try to distract from Trump’s efforts to overturn the 2020 election after he refused to accept the results, as well as the Jan. 6 attack on the Capitol by his supporters. “At this very moment, Democrat Party bosses are frantically trying to overthrow the results of their own party’s primaries to dump Crooked Joe Biden from the ballot,” Trump charged. Later, he pushed back against efforts to cast him as a threat to democracy and an extremist, even as he has vowed mass deportations and threatened retribution against his political enemies. “They keep saying, ’He’s a threat to democracy…’ Last week I took a bullet for democracy,” he said to rousing cheers. Trump also again tried to distance himself from the Heritage Foundation’s Project 2025, a policy and personnel plan for a second Trump term that was crafted by a host of former administration officials. Trump blasted the project, which has become a centerpiece of Biden’s campaign, as “severe right” and “seriously extreme,” just like the ”radical left.” “I don’t know anything about it,” he insisted. Biden’s campaign responded with a statement that noted Trump’s speech accepting the GOP nomination, in which he urged unity and said he was “running to be president for all of America, not half of America.” “We were promised a new Donald Trump who would unite the country — instead all we saw tonight was the same Donald Americans keep rejecting over and over,” said Biden-Harris spokesperson Ammar Moussa. “He’s peddling the same lies, running the same campaign of revenge and retribution, touting the same failed policies, and — as usual — focused only on himself.” The 81-year-old Democratic incumbent, who appeared in Detroit this month, is currently isolating at his beach home in Delaware recovering from COVID-19. U.S. Rep. Hillary Scholten, a Democrat representing Grand Rapids, is among the growing number of lawmakers calling on Biden to exit the race after his disastrous performance at last month’s debate. Colvin reported from New York","summary":"Hours before he took the stage, Trump’s supporters crowded the streets of downtown Grand Rapids, Michigan, in anticipation of the former president’s remarks.","url":"https://www.ocregister.com/2024/07/20/trump-holds-first-rally-after-assassination-attempt-with-his-new-running-mate-vance-by-his-side/","image":"https://www.ocregister.com/wp-content/uploads/2024/07/Election_2024_Trump_21016.jpg?w=1024","video":null,"publish_date":"2024-07-21 00:08:57","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.069},{"id":252248206,"title":"Alarming revelations from a recent Secret Service whistleblower suggest a shortage of trained agents and a controversial director with links to Jill Biden.","text":"There was a surreal scene at the Republican National Convention on Wednesday as irate senior senators chased the embattled director of the U.S. Secret Service into a women’s bathroom. ‘You answer to us!’ ‘You can’t hide from us!’ Senators Marsha Blackburn and John Barrasso shouted and pointed angrily – pursuing Secret Service director Kimberly A. Cheatle through the lobby of Milwaukee’s Fiserv Forum and up a flight of stairs. Cheatle, 53, flanked by her agents, scurried into the lavatory. Her staff held the door, blocking the livid lawmakers out. ‘It is appalling that the Secret Service Director refused to answer our questions,’ said Senator Blackburn after the incident. Fury had erupted earlier in the day after Cheatle and her top aides briefed senators in a private conference call about the attempted assassination of President Donald Trump at a campaign rally in rural Butler, Pennsylvania on Saturday. Senator Barrasso called the meeting a ‘100% cover-your-a** briefing.’ Cheatle was apparently unable to explain how agents failed to stop Thomas Matthew Crooks from clambering onto a roof and shooting at Trump from less than 150 yards away – even though the gunman was spotted by law enforcement 20 minutes before the shots were fired. ‘No one has taken responsibility. No one has been held responsible. Someone has died. The president was almost killed. The head of the Secret Service needs to go,’ Barrasso said later. Now as more fingers are pointed at Cheatle, new allegations have revealed the depth of dysfunction within the service, with Department of Homeland Security whistleblowers claiming the majority of Trump’s security detail on Saturday were ‘not even Secret Service’ and were ‘unfamiliar with standard protocols’. Republican Senator Josh Hawley wrote to the DHS Secretary Alejandro Mayorkas on Friday outlining those allegations and a litany of other claimed security flaws: ‘Detection canines were not used to monitor entry and detect threats in the usual manner. ‘Individuals without proper designations were able to gain access to backstage areas. Department personnel did not appropriately police the security buffer around the podium and were also not stationed at regular intervals around the event’s security perimeter.’ Whether or not Hawley’s wild claims are true, the Secret Service and Cheatle have a lot to answer for. And now experts tell DailyMail.com that these failings are a symptom of an ‘agency in crisis’ after decades of understaffing and corrupt promotion and hiring practices. John Koskinen, from the nonpartisan National Academy of Public Administration, led an 18-month study into the Secret Service’s workforce in 2019. Saturday’s events shocked him, but Koskinen was not surprised by the whistleblower claims, telling DailyMail.com that the Service has been struggling to cover an increasing number of people and respond to more sophisticated threats in recent years. ‘Life has gotten much more complicated,’ he said, ‘the threats are more sophisticated and ongoing, and now you’re in the middle of a campaign.’ Cheatle, 53, was appointed director of the Secret Service in 2022, having worked for the agency for 27 years before leaving in 2019 to head up global security at PepsiCo. Announcing her selection, President Joe Biden revealed that ‘Kim’ had ‘served on my security detail when I was Vice President’ and he and Dr. Jill Biden ‘came to trust her judgment and counsel’. Some sources went as far as to tell the New York Post on Monday that Cheatle had been personally tapped for the role by First Lady Jill Biden’s top aide, Anthony Bernal, who is reportedly ‘obsessed’ with DEI. ‘Cheatle served on Dr. Biden’s second lady detail and Anthony pushed for her,’ one source said. ‘I heard at the time she was being considered for director that Anthony had pushed her forward as an option,’ another added. For her part, Cheatle has spoken openly about her goals of raising the number of the agency’s female recruits to 30 percent of all new hires by the year 2030. And she hasn’t done herself any favors in public appearances since that shock security failure in Pennsylvania on last weekend. Cheatle said in an interview on ABC News days after the shooting that agents did not secure the roof from which the assassin fired because, ‘That building in particular has a sloped roof, at its highest point… And so, there’s a safety factor that would be considered there that we wouldn’t want to put somebody up on a sloped roof.’ Critics, like former FBI Assistant Director Chris Swecker said that explanation was ‘absurd.’ ‘Nobody’s saying you have to have somebody on the rooftop. You need to have eyes on the rooftop 100 percent of the time,’ he told the Mail. ‘If they’re too scared to climb up on top of the roof, just keep your eyes on it.’ Tristan Leavitt, who ran a year-long investigation into the Secret Service for the GOP Oversight Committee in 2015, told DailyMail.com it was likely that Cheatle was promoted due to her close relationship with the Bidens. ‘It is pretty standard,’ he said, ‘directors have typically come from within, so if you’re going to pick someone from within, you’re going to pick someone you have a good relationship with.’ The danger, Leavitt says, is that personal connection is ‘not a great basis on which to select someone’. He added: ‘The assassination attempt on Saturday appears to be closely associated to a manpower issue, the Secret Service have been hemorrhaging staff for a long time’. ‘Many, many agents within the Secret Service thought that within the service the best people weren’t being promoted, it’s more about who you knew,’ he said. ‘It’s an agency in crisis.’ Of course, previous Secret Service directors have also worked closely with presidents prior to their selection. James Murray, who was the director before Cheatle, served at Trump’s 2016 election and inauguration, and Joe Clancy, a few years before him, served in Barack Obama’s personal protection detail. However, this is not the first time that Cheatle’s or the Secret Service’s close ties to the Bidens have been called into question. Agents were accused of improperly intervening in the investigation into whether the President’s son Hunter Biden lied on federal firearms forms to buy a revolver at a Delaware gun shop in 2018. In June, Hunter was convicted on three felony charges related to the purchase. But early on in that case, FBI documents revealed, that the gun store owner claimed that Secret Service agents showed up at his business and asked to remove the documents Hunter has signed. The shop-owner refused and the agents allegedly left. The Secret Service has denied the claims, but two years later, the government transparency group Judicial Watch obtained hundreds of pages of internal communications between Secret Service officials about the alleged incident. The documents revealed that agency officials discussed media reports of the incident. One agent found it ‘odd’ that the agency would be involved in the investigation since the Biden Family was not receiving Secret Service protection at the time. Another official responded: ‘Maybe we were asked for a favor?’ ‘These new documents suggest that one can’t take at face value the Secret Service’s denial that it wasn’t involved in the Hunter Biden gun cover-up,’ Judicial Watch President Tom Fitton told DailyMail.com at the time. Cheatle herself was then dragged into the debacle surrounding Hunter’s trials in September 2023, when the House Oversight Committee ordered her to make her employees available for interview after whistleblowers alleged Secret Service agents tipped off the Bidens about an IRS investigation into Hunter. Additionally, IRS supervisory agent Gary Shapley and FBI supervisory special agent Joe Gordon alleged that they were told by FBI brass to wait for Secret Service permission before they could go to Hunter’s home to interview him. According to Shapley and Gordon that Secret Service call never came. Following Trump’s near-death, Leavitt says there is no way Cheatle will be able to stay in her post. ‘The difference between life and death in Saturday’s attempted assassination of former President Trump was centimeters and a slight wind,’ he said on X. And as fury mounts, he says it is not a question of if Cheatle resigns, but when.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThere was a surreal scene at the Republican National Convention on Wednesday&#8230;\n\n\nThis Post: Alarming revelations from a recent Secret Service whistleblower suggest a shortage of trained agents and a controversial director with links to Jill Biden. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/alarming-revelations-from-a-recent-secret-service-whistleblower-suggest-a-shortage-of-trained-agents-and-a-controversial-director-with-links-to-jill-biden/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Damning-new-Secret-Service-whistleblower-claims-about.jpg","video":null,"publish_date":"2024-07-21 00:08:05","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.804},{"id":252248434,"title":"1 in 3 Democrats believe Trump faked assassination attempt. I talked to one","text":"According to some polls, one in three Democrats believe that Donald Trump faked his own assassination attempt. When I read that, I thought, could this possibly be true? But this weekend on my drive home to West Virginia from the Republican National Convention in Milwaukee, I got the theory first hand. And it's a fascinating doozy. Station Square Ristorante, just off of I-80 in Liberty, Ohio, is an absolute gem. Ottavio and Bridget Musumeci have somehow managed to create a legitimate fine-dining experience attached to the Super 8 motel. And no, I’m not kidding. In the wood-paneled bar, as I ordered oysters and antipasto for a late lunch, I met Mark, originally from northern New Jersey, which his accent revealed before he did. And Mark, well, he had some very interesting things to say. MSNBC BRINGS THE CRAZY TO COVERAGE OF TRUMP ASSASSINATION ATTEMPT As is my way, I turned the conversation to politics and the assassination came up. \"That whole thing was a setup,\" Mark told me. Before I could even respond, John, the bartender, who I would learn doesn’t like Trump or Biden, said, \"Nah, two people are dead. No way.\" Mark’s response was, \"this is Donald Trump, he’s capable of anything.\" So I dug in a bit. How did they get the kid to do it? Mark was ready with answers. They paid off the family, or maybe told him he’d get off with just a few years in jail, he suggested. CLICK HERE FOR MORE FOX NEWS OPINION \"And the death of Corey Comperatore?\" I asked, referring to the retired fire chief who died shielding his family from the assassin's bullets. \"Donald Trump doesn’t care if his supporters die,\" Mark shot back, quite certain of himself. You should know that Mark did not come off as some kind of lunatic. A bit prone to conspiracy theories maybe, but by no means crazy. So how could he believe all this with no evidence whatsoever? He also had a good appetite, and as he wolfed down his caesar salad and veal piccante topped with mussels, he made it clear that it all came down to one simple precept: Trump is capable of anything. I couldn’t help but think that the fact that Mark shares this kind of weird, irrational thinking with a third of his party faithful is because it is exactly what Democrats and their media allies have been feeding them. EX-ESPN STAR KEITH OLBERMANN QUESTIONS WHETHER TRUMP WAS SHOT AFTER FORMER PHYSICIAN'S UPDATE Why wouldn’t Mark, if he has a steady diet of liberal media, think that Trump is capable of killing innocent people? After all, they say he will deny women their rights, he won’t let black people vote, he will destroy democracy, and on and on and on. Mark is conditioned to believe that Trump is a unique evil and nothing should be put past him. CLICK HERE TO GET THE FOX NEWS APP I said to Mark that if I thought one party, one side, or call it what you will, was willing to kill innocent Americans in this way, then it might be time to buy some guns. Then he said something that surprised me. \"It’s not the other side, it’s just Trump.\" It made little sense, but in a strange way, I was glad to hear him say it. At least Mark doesn’t blame his fellow citizens who support Trump. Not yet, anyway. Mark finished and left before I did, and we had a wholesome and sincere goodbye. After the door closed, I asked to John, \"What do you make of that?\" \"It’s crazy,\" he shrugged. Yes it is, but here we are. CLICK HERE FOR MORE FROM DAVID MARCUS","summary":"In a Liberty, Ohio, Italian restaurant, Fox News Digital columnist David Marcus meets a Democrat who believes Trump staged an assassination attempt on him. And who can blame a follower of liberal media for embracing the theory?","url":"https://www.foxnews.com/opinion/1-3-democrats-believe-trump-faked-assassination-attempt-i-talked-one-them","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/06/931/523/MADDOW-THE-VIEW-SCOTUS.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-21 00:07:19","author":"David Marcus","authors":["David Marcus"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.317},{"id":252248086,"title":"Biden Admin Hits Back At Attacks On Women Secret Service Agents","text":"The US homeland security chief hit back Saturday at misogynistic attacks on the women Secret Service agents who threw themselves into the line of fire to protect Donald Trump from a would-be assassin. \"These assertions are baseless and insulting,\" Alejandro Mayorkas said in a statement after the some on the US political right accused the Secret Service of \"woke\" hiring practices they say nearly got the former president killed. He praised the \"highly skilled and trained\" women serving at every level of law enforcement across the country for risking \"their lives on the front lines for the safety and security of others.\" \"They are brave and selfless patriots who deserve our gratitude and respect,\" he wrote. The Department of Homeland Security will \"with great pride, focus and devotion to mission, continue to recruit, retain and elevate women in our law enforcement ranks. Our Department will be the better for it, and our country more secure,\" he continued. In the week since a gunman opened fire during a Trump rally in Pennsylvania, killing one bystander, wounding two others and leaving the Republican bloodied but alive, right-wingers have unleashed a torrent of criticism on the Secret Service for having women in its ranks. Several women can be seen among the black-suited, sunglasses-clad agents racing to shield Trump with their bodies as the gunshots ring out at the rally, before hustling him from the stage and into a waiting car and safety. But they, along with their boss Kimberly Cheatle -- only the second-ever woman director of the federal agency tasked with protecting presidents current, former and would-be -- are now caught in the intense scrutiny over the nearly catastrophic attack. \"There should not be any women in the Secret Service. These are supposed to be the very best, and none of the very best at this job are women,\" right-wing activist Matt Walsh wrote on X, in one typical post. Many of the attacks cited DEI -- diversity, equity and inclusivity -- hiring practices that some Republicans have long criticized as discriminating against white people, white men in particular. \"The results of DEI. DEI got someone killed,\" read one post on the popular Libs of TikTok account. The Secret Service has defended itself against such accusations in the past, with a spokesman telling US media just weeks before the assassination attempt that agents \"are held to the highest professional standards... at no time has the agency lowered these standards.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The US homeland security chief hit back Saturday at misogynistic attacks on the women Secret Service agents who threw themselves into the line of fire to protect Donald Trump from a would-be assassin.","url":"https://nation.lk/online/biden-admin-hits-back-at-attacks-on-women-secret-service-agents-271402.html","image":"https://c.ndtvimg.com/2024-07/eutnrp9_us-secret-service-in-trump-assassination-bid-afp_625x300_17_July_24.jpeg","video":null,"publish_date":"2024-07-21 00:00:08","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.083},{"id":252248672,"title":"Trump revels in campaign trail return after shooting","text":"GRAND RAPIDS, Michigan — Despite promising during his nomination acceptance speech during last week’s Republican National Convention not to keep revisiting his assassination attempt, former President Donald Trump relived the moment during his first post-shooting rally in Grand Rapids. “It was exactly a week ago today almost to the hour, almost to the minute,” Trump told a crowd of 13,000 people Saturday in downtown Grand Rapids to chants of “fight, fight, fight,” the same words he uttered before Secret Service ushered him off the stage to safety seven days ago in Butler, Pennsylvania. When the crowd started booing members of the news media who were present at Trump’s mention, the former president discouraged them, contending that the attempt on his life was covered fairly. “They keep saying, ‘He’s a threat to democracy,'” he said. “I’m saying, ‘What the hell did I do for democracy? Last week I took a bullet for democracy! What did I do against democracy?’ Crazy.” Trump, who now has a smaller bandage covering where the bullet grazed his ear, shared with the crowd that he had telephone discussions with Elon Musk, who announced his endorsement of the former president this week. The SpaceX CEO also committed to donating $45 million to his campaign a month, revealing that he does not have a problem with the Republican presidential nominee’s position against electric vehicles, a hot-button issue in Michigan. Trump also welcomed Judge Aileen Cannon’s dismissal of his classified documents case in Florida, claiming, “When you have honorable judges … good things can happen.” Thousands of people were outside the Van Andel Arena by 9 a.m. Saturday, hours before Trump was scheduled to speak at 5 p.m., expecting stricter security after last week. The indoor venue can be compared with the outdoor Butler Farm Show, which experts describe as a soft target for attacks, such as the one that unfolded. A week after Secret Service agents, who have been criticized since the shooting, put themselves between Trump and a possible second bullet, the group outside repeatedly cheered and applauded passing police officers. The second promise Trump broke during his convention address was his aides’ pledge that he would not say President Joe Biden‘s name. Trump made no such promise for Saturday, mocking Democrats for reconsidering the incumbent as their nominee in a county the former president won in 2016 but lost in 2020. “It’s sort of interesting, this guy goes and he gets the votes and now they want to take it away,” he said of the primary. “That’s democracy. They talk about democracy, ‘Let’s take it away from him’.” Gov. Gretchen Whitmer (D-MI), among the rumored Democrats who could replace Biden as the party’s nominee should he decide to step aside, responded to Trump and Vance’s appearance in Michigan in a video, reiterating that her state is for abortion access, lowering costs, and workers’ rights. “Oh, and one more thing, Michigan is going to reject your extreme Project 2025 agenda,” Whitmer said, referring to policies proposed by the Heritage Foundation, a conservative think tank. Distancing himself from Project 2025 as a plan of the “severe right,” Trump quipped that he would rather run against Whitmer, conducting a poll of the crowd regarding who should be the Democratic nominee. “I’d like to run against her,” he said, reminding the crowd that Whitmer’s husband could do “whatever he wanted” during her COVID-19 lockdown. Trump was introduced by Sen. J.D. Vance (R-OH), his running mate, who spoke twice during his campaign trail debut Saturday. “You’re going to be a fantastic vice president of the United States,” Trump said. “I chose him because he’s for the worker, he is for the people who work so hard.” During his historically long prime-time acceptance remarks Thursday at Milwaukee’s Fiserv Forum, Trump told that arena that “the assassin’s bullet came within a quarter of an inch of taking my life.” “So many people have asked me what happened, ‘Tell us what happened please,’ and therefore I’ll tell you what happened, and you’ll never hear it from me a second time because it’s too painful to tell,” he said. After announcing that $6.3 million had been raised for the families of the victims of the Butler rally, including Corey Comperatore, the former fire department chief who was killed, Trump alluded to a chart with immigration statistics. The Republican presidential nominee has taken to projecting the chart at his rallies, and turning toward it last week caused the bullet to sideswipe his head instead of pierce his skull. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER “Last time I put up that chart, I didn’t really get to look at it,” he said. “Without that chart, I would not be here today.” Trump has cemented his position in the 2024 race against Biden as Democrats openly discuss replacing the president as their nominee. Trump leads Biden in Michigan by an average of 2 percentage points, in Pennsylvania by 4.5 points, and Wisconsin by 3.5 points, according to RealClearPolitics.","summary":"GRAND RAPIDS, Michigan — Despite promising during his nomination acceptance speech during last week’s Republican National Convention not to keep revisiting his assassination attempt, former President Donald Trump relived the moment during his first post-shooting rally in Grand Rapids. &#8220;It was exactly a week ago today almost to the hour, almost to the minute,&#8221; Trump told [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3092344/trump-revels-in-campaign-trail-return/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/trump-vance-michigan-scaled.webp","video":null,"publish_date":"2024-07-20 23:59:57","author":"Naomi Lim And Amy Delaura","authors":["Naomi Lim And Amy Delaura"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.3},{"id":252248432,"title":"Ex-ESPN star Keith Olbermann questions whether Trump was shot after former physician's update","text":"Former ESPN anchor Keith Olbermann fired off a critical post about Donald Trump’s former doctor and the assassination attempt at Trump's campaign rally last week. Congressman Ronny Jackson, who served as physician to the president during the Trump administration, said in a statement Saturday he evaluated the former president in Bedminster, New Jersey, last week. Jackson said Trump sustained a gunshot wound to the right ear from a high-powered rifle used by the would-be assassin. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"The bullet track produced a 2 cm-wide wound that extended down to the cartilaginous surface of the ear,\" the physician said. \"There was initially significant bleeding, followed by marked swelling of the entire upper ear. The swelling has since resolved, and the wound is beginning to granulate and heal properly. \"Based on the highly vascular nature of the ear, there is still intermittent bleeding requiring a dressing to be in place. Given the broad and blunt nature of the wound itself, no sutures were required.\" Olbermann responded critically on X. LIVE UPDATES: TRUMP ASSASSINATION INVESTIGATION \"In brief: Ronny Jackson isn't a doctor. Which is perfect, because Trump wasn't hit by a bullet,\" he wrote. Trump, who had a bandage over his right ear at the Republican National Convention earlier this week, recalled being wounded by the would-be assassin at a campaign rally in Butler, Pennsylvania. He said last week he was \"struck by a bullet.\" \"If I had not moved my head at that very last instant, the assassin’s bullet would have perfectly hit its mark,\" Trump said. \"And I would not be here tonight. We would not be together.\" CLICK HERE TO GET THE FOX NEWS APP Olbermann is the latest to question Trump’s injuries. MSNBC host Joy Reid did the same, while legendary tennis star Martina Navratilova called the bandage around his ear a \"PR\" stunt. Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Former ESPN anchor Keith Olbermann questioned Ronny Jackson&apos;s medical update on former President Trump a week after an assassination attempt.","url":"https://www.foxnews.com/sports/ex-espn-star-keith-olbermann-questions-whether-trump-shot-after-former-physicians-update","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Keith-Olbermann.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-20 23:59:03","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.292},{"id":252248438,"title":"Donald Trump says China’s Xi Jinping wrote him a ‘beautiful note’ after assassination attempt","text":"Former US President Donald Trump said on Saturday that Chinese President Xi Jinping wrote him a note after the Republican presidential nominee suffered a gunshot wound to his ear during an assassination attempt last week. “[Xi] wrote me a beautiful note the other day when he heard about what happened,” Trump told a crowd in Grand Rapids, Michigan, in his first campaign rally since narrowly escaping the July 13 assassination attempt. Trump mentioned Xi’s letter while discussing his economic policy toward China during his presidency, adding: “I got along very well with President Xi.” The former US president also referenced messages from other world leaders following the shooting at a rally in Pennsylvania. Trump, who called for national unity in a speech on Thursday as he accepted his party’s presidential nomination at the Republican National Convention, made no mention of that in his remarks before a raucous crowd on Saturday. He frequently mocked Democratic US President Joe Biden as feeble. He derided senior Democrats, including Pelosi, for trying to persuade Biden to end his re-election bid. Referring to Pelosi, Trump said: “She’s turned on him like a dog. She’s as crazy as a bed bug.” The Trump campaign did not immediately respond to a request for comment about Trump comparing Pelosi to a dog. Fresh from his nominating convention where his takeover of the Republican Party was cemented, Trump appeared in Grand Rapids with his new vice-presidential pick, Senator J.D. Vance from Ohio. They took the stage in their first campaign event together with the Republican Party unified behind them. In contrast, it is no longer certain that US President Joe Biden will be the Democratic Party’s nominee facing Trump in the November 5 election. Biden has faced calls from some senior Democrats to end his re-election bid after his poor debate performance last month raised concerns over whether he could beat Trump or complete another four-year term. Trump attacked Democrats, saying they wanted to kick Biden off the ticket after he won their presidential nominating contest. “They have a couple of problems. No 1, they have no idea who their candidate is,” Trump said to laughter and jeers. “This guy goes and he gets the votes and now they want to take it away.” “As you’re seeing, the Democrat Party is not the party of democracy. They’re really the enemies of democracy.” He added: “And they keep saying, ‘He’s a threat to democracy.’ I’m saying, ‘What the hell did I do for democracy?’ “Last week, I took a bullet for democracy.” Trump referred to the assassination attempt several times on Saturday. “I hope I don’t have to go through that again. It was so horrible,” Trump said. Opinion polls show a tight race between the Trump and Biden at a national level but Biden trailing Trump in the battleground states that are likely to determine the winner. Many Democrats fear he may not have a realistic path to victory and that the party needs a new candidate to take on Trump. There was a heavy police presence at Trump’s rally in Grand Rapids on Saturday, with police on every street corner for several blocks. US Secret Service officers were positioned on the top balconies in the Van Andel Arena, giving them a bird’s-eye view of the crowd inside. Bag searches for those entering the indoor arena earlier in the day were long and thorough, and the Secret Service sweep of the building took about an hour longer than usual. The rally in Butler, Pennsylvania, last weekend was outdoors. At that event, the gunman was able to scale the roof of a building outside the Secret Service perimeter before opening fire on Trump, clipping his ear, killing a rally-goer and wounding several others. The Secret Service, which is responsible for protecting Trump, declined to comment on security for the Grand Rapids event. An investigation is under way into the security failures at the Butler rally. Trump gave a detailed account of his narrow brush with death in his convention speech on Thursday, telling the audience that he was only talking to them “by the grace of Almighty God”. Trump’s former doctor, Ronny Jackson, said on Saturday that the former president is recovering as expected from the gunshot wound to his right ear, but noted intermittent bleeding and said Trump may require a hearing exam. The bullet fired by the would-be assassin at the July 13 rally in Pennsylvania came “less than a quarter of an inch from entering his head,” said Jackson, a Republican congressman from Texas who had served as doctor to US Presidents Trump and Barack Obama.","summary":"The Republican US presidential candidate also mocked rival Biden as feeble and compared senior Democrat Pelosi to a dog.","url":"https://www.scmp.com/news/world/united-states-canada/article/3271278/donald-trump-mocks-democrats-first-campaign-rally-after-assassination-attempt","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/07/21/40cb24a6-347d-4dca-bcd0-b993622ee9cc_ab2d3929.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/15/Web%20Video.mp4","publish_date":"2024-07-20 23:58:05","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.312},{"id":252248310,"title":"Harris gets back on the trail as Biden recovers from COVID","text":"PROVINCETOWN, Mass./REHOBOTH BEACH, Del. — Vice President Harris was back on the campaign trail this weekend, raising money for the Biden-Harris ticket on Cape Cod while President Biden remained sidelined by a case of COVID in his beach house in Delaware. In a large tent near the the harbor, hundreds of Democratic donors cheered and waved fans imprinted with \"Veeptown\" — a play on P-Town, as the beach town known for its LGBTQ history and community is called. Harris focused on former President Donald Trump's policies that removed protections for discrimination for LGBTQ people for health care, employment, and students and his ban on transgender military service. She said Trump's running mate, Ohio Sen. JD Vance, \"undoubtedly will be a rubber stamp for Trump's extremist anti-LGBTQ agenda,\" citing legislation he proposed that would ban gender-affirming care. That prompted a yell of \"Go get 'em, Kamala!\" from one of the donors. Harris is in the spotlight as Biden is sidelined The fundraiser came as the future of Biden's campaign is in question. A disastrous debate against Trump three weeks ago fueled a growing chorus of calls from Democratic party officials and donors for Biden, 81, to end his bid for a second term and let a younger candidate take over. Biden has insisted he will stay in the race. Harris has not publicly engaged in the debate, and did not mention it in her Provincetown remarks. She praised Biden, saying she was \"testifying\" that he fights for \"everyday working Americans.\" But some of the lawmakers asking Biden to step aside have been testifying that Harris should be at the top of the ticket. On Saturday, Rep. Mark Takano, D-Calif., called her a \"tenacious prosecutor\" with the experience to beat Trump. \"Joe, I love you and respect you. But the stakes are too high to fail. It's time to pass the torch to Kamala,\" Takano said in a statement. Sen. Elizabeth Warren, D-Mass. — who has not called for Biden to leave the race — said Harris would unite the party if Biden changes his mind, and praised her for her work on economic issues and abortion rights. \"Look — if you're running against a convicted felon, then a prosecutor like Kamala is really a good person to make that case,\" Warren said on MSBNC. Biden has said he'll be back on the trail this week Biden had been pushing back on concerns about his age and abilities, doing a flurry of events in swing states, as well as as a solo press conference and several interviews. But that came to a halt when he tested positive for COVID last week. His doctor said in a memo on Saturday that Biden's symptoms are improving, though he still has a cough. Since the Republican National Convention ended, the pace of Democrats asking Biden to leave has picked up. Campaign spokesman Michael Tyler told reporters on Saturday that the president would be back out on the trail next week once he gets the green light from his doctor.","summary":"Vice President Harris was in Provincetown, Mass. raising money for the Biden-Harris campaign. Meanwhile, President Biden is stuck in Rehoboth Beach, Del., after COVID took him off the trail.","url":"https://www.npr.org/2024/07/20/nx-s1-5047354/harris-lgbtq-biden-covid","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5559x3127+0+507/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6d%2Fcf%2F811d154f48cfb44ef6dc4bc481b8%2Fgettyimages-2162039073.jpg","video":null,"publish_date":"2024-07-20 23:54:02","author":"Asma Khalid","authors":["Asma Khalid"],"language":"en","source_country":"us","sentiment":-0.015},{"id":252248020,"title":"Spooky video shows deserted roads near Mar-a-Lago following a shooting involving Trump, leading to increased security by Secret Service until the election","text":"THE streets around Mar-a-Lago will remain empty as the Secret Service ramps up security around former President Donald Trump following an assassination attempt last week. Starting July 20, Palm Beach, Florida residents were alerted that no through traffic would be allowed near Trump’s personal resort. The restriction will extend until at least Election Day on November 5, “at minimum,” said town officials. Members of the Secret Service made the decision after Trump was injured at a campaign rally in Butler, Pennsylvania on July 13. A 20-year-old gunman shot at the former president, injuring his ear and killing a rally attendee. Thomas Crooks, the shooter, was fatally shot by a Secret Service sniper, however, the agency has come under fire for supposed failings on the day of the rally. Aside from the attempt on Trump’s life, there have also been ongoing threats including one from Iran weeks before the rally shooting. The street closure will affect the intersection of South County Road and South Ocean Boulevard to the traffic circle that connects Southern Boulevard and South Ocean Boulevard. “We learned on Saturday that whatever it was we were doing did not work. My hope and prayer is that the Secret Service gets it right,” Tim Miller, a retired agent told local NBC affiliate WPTV. DEMANDING ANSWERS Kimberly Cheatle, the Director of the Secret Service was subpoenaed on Wednesday by the House Oversight and Accountability Committee to appear at a congressional hearing regarding the attempted assassination. James Comer, the chairman of the committee, said the subpoena was necessary due to the “lack of transparency and failure to cooperate,” which led many to question Cheatle’s leadership. “The assassination attempt of the former President and current Republican nominee for president represents a total failure of the agency’s core mission and demands Congressional oversight,” he wrote in a letter to Cheatle. That same day, House Speaker Mike Johnson said he was planning to create a task force to investigate security failings during the assassination attempt. Johnson added that he would call on Cheatle to resign from her position. “I think she’s shown what her priorities are,” he told Fox News. However, Cheatle said she would fully participate in a review and would work with congressional committees to look into the shooting. ‘ABSOLUTE MIRACLE’ Republican Representative Ronny Jackson, who served as Trump’s doctor during his presidency revealed that he has been evaluating the wound to his right ear daily. Jackson, who represents the 13th Congressional District of Texas, confirmed that Trump received a gunshot wound to his ear. In a tweet, he explained that the bullet was less than a quarter inch away from Trump’s head, calling it a “miracle” that he survived. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” he wrote. “I am extremely thankful his life was spared. “It is an absolute miracle he wasn’t killed.” More from The U.S. Sun on the Trump rally shooting: Thomas Matthew Crooks, 20, was identified as a person of interest by the Secret Service 62 minutes before the shooting took place, according to reports. Local police spotted Crooks lurking on the rally grounds with a rangefinder, a hunting device used to measure distances to remote objects, about 30 minutes before Donald Trump took the stage at Butler, Pennsylvania. Federal officials said Crooks had a cell phone and a transmitter on him when he was killed on the roof of the AGR building about 400 feet from the rally’s podium. Crooks visited the site of Trump’s rally in Butler at least one time before the shooting, according to CBS News. He also conducted online searches for the date of Trump’s rally in Butler, the Democratic National Convention, FBI Director Christopher Way, Attorney General Merrick Garland, and members of the British Royal Family, the outlet reported. The would-be assassin searched for images of Trump and President Joe Biden. Crooks also hid his father’s assault rifle in advance, according to Fox News. FBI investigators are still working on determining a motive behind Thomas Crooks’ shooting. Crooks’ laptop and two cell phones have been sent to the FBI’s laboratory in Virginia for further analysis. Jackson added that there was significant bleeding and swelling on the upper part of the ear, which has since gone down. However, because the ears have many blood vessels, Jackson said there has been “intermittent bleeding,” which requires bandages. “Given the broad and blunt nature of the wound itself, no sutures were required,” he wrote. Trump will receive more evaluations, including a “comprehensive hearing exam,” said Jackson.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTHE streets around Mar-a-Lago will remain empty as the Secret Service ramps&#8230;\n\n\nThis Post: Spooky video shows deserted roads near Mar-a-Lago following a shooting involving Trump, leading to increased security by Secret Service until the election first appeared on Internewscast Journal","url":"https://internewscast.com/news/spooky-video-shows-deserted-roads-near-mar-a-lago-following-a-shooting-involving-trump-leading-to-increased-security-by-secret-service-until-the-election/","image":"https://internewscast.com/wp-content/uploads/2024/07/Eerie-footage-of-empty-streets-around-Mar-a-Lago-after-Trump-shooting.jpg","video":null,"publish_date":"2024-07-20 23:52:30","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.373},{"id":252248250,"title":"Trump holds first rally with running mate JD Vance","text":"Former President Donald Trump is holding his first campaign rally since he survived an attempted assassination, returning to the battleground state of Michigan alongside his new running mate.\"It was exactly one week ago, even to the hour, even to the minute,\" Trump said before the crowd in Grand Rapids, Michigan, reflecting on the July 13 shooting in Pennsylvania that left him with a bloodied ear, killed one supporter in the crowd and left two others injured.\"I stand before you only by the grace of almighty God,\" he said, the white gauze on his ear now replaced by a skin-colored bandage. \"I shouldn't be here right now,\" he went on.Trump was joined by Sen. JD Vance of Ohio at the pair's first event together since they became the GOP's nominees at the Republican National Convention in Milwaukee.\"I find it hard to believe that a week ago, an assassin tried to take Donald Trump's life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,\" Vance said before Trump's arrival.Michigan is one of the handful of crucial swing states expected to determine the outcome of November's presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democratic President Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency.After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, lashing out at his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience.At one point, Trump glanced at a screen showing him from an unusual angle and joked about his combover.\"That's a severe sucker. What's with that one?\" he said. \"I apologize. Man! I looked up there, I said, 'Whoa!' That's like a work of art!\"At another point, as he invited a supporter on stage, he quipped, \"He does not carry guns!\"But Trump also talked about the shooting, acting out how he'd turned his head to look up at a chart of southern border crossings projected on a giant screen and narrowly dodging the bullet that hit his ear.\"I owe immigration my life,\" he said. \"It's true.\"Hours before he took the stage, Trump's supporters crowded the streets of downtown Grand Rapids in anticipation of the former president's remarks. Supporters began lining up Friday morning, and by Saturday afternoon, the line stretched close to a mile from the entrance of the 12,000 seat Van Andel Arena.Many in the packed arena were seen wearing shirts featuring the image of Trump, on stage, after he was shot, pumping his fist in the air after surviving the shooting, along with the usual red \"Make America Great Again\" hats.Mike Gaydos, who traveled from Indiana with his three sons to attend the rally, said he didn't consider himself a \"huge\" Trump supporter in the past but wanted to show support for the former president following his attempted assassination.\"We can't allow something like that to collar us,\" he said. \"Bravery is what I thought he showed that day and I want to show my sons about bravery as well.\"Security heightened following assassination attemptNumerous streets, closed as an additional security precaution, were dotted with vendors selling food and apparel. Among them was a vendor from North Carolina who said he had spent the night making shirts featuring \"Trump Vance '24.\"Downtown Grand Rapids also saw a significant police presence, with officers stationed on nearly every block, while others patrolled on horseback and bicycles. The heightened security outside the venue created a tense environment, with some attendees mentioning that drones overhead had made them nervous. The event was held indoors — a change from last week in Pennsylvania, where the shooter fired from a rooftop outside the security perimeter.Attendees were required to pass through a metal detector upon entering the downtown Grand Rapids indoor arena, yet the presence of security inside appeared consistent with previous events.\"This is the tightest I've ever seen the security,\" said Renee White, who said that she's been to 33 of Trump's rallies. \"We usually can bring in some small bags but today I had to just leave stuff out there.\"White was seated behind the podium at the rally in Butler, Pennsylvania, where the gunman opened fire from a nearby rooftop. She described the shooting as \"surreal\" but said that it wouldn't stop her from going to rallies.\"If I'm going to be taken out, at least I'm doing something I love to do, right?\" said White.Republicans see opportunity in MichiganTrump's choice of Vance was seen as a move to gain support among so-called Rust Belt voters in places like Michigan, Pennsylvania, Wisconsin and Ohio who helped Trump notch his surprise 2016 victory. Vance specifically mentioned those places during his acceptance speech at the convention, stressing his roots growing up poor in small-town Ohio and pledging not to forget working-class people whose \"jobs were sent overseas and children were sent to war.\"Democrats have dominated recent elections in Michigan, but Republicans now see an opening in the state as Democrats are increasingly divided about whether Mr. Biden should drop out of the race. Biden has insisted he is not quitting and has attempted to turn the focus back towards Trump, saying Friday that Trump's acceptance speech at the Republican convention showcased a \"dark vision for the future.\"Trump weighs in on controversy surrounding Biden's reelection bidTrump, at Saturday's rally, polled the crowd on who they'd like to see as his opponent, with cheers for Biden and loud boos when Trump asked about Vice President Kamala Harris.Trump and his team have tried to cast Democrats' efforts to replace Mr. Biden as a \"coup,\" in what appears to be part of a larger effort to try to distract from Trump's efforts to overturn the 2020 election after he refused to accept the results and the Jan. 6 attack on the Capitol by his supporters.\"At this very moment, Democrat Party bosses are frantically trying to overthrow the results of their own party's primaries to dump Crooked Joe Biden from the ballot,\" he said. \"As you're seeing, the Democratic Party is not the party of democracy. They're really the enemies of Democracy.\"Later, Trump pushed back against efforts to cast him as an extremist, even as he has vowed mass deportations and threatened retribution against his political enemies.\"They keep saying, 'He's a threat to democracy...' Last week I took a bullet for democracy,\" he said to rousing cheers.Trump also again tried to distance himself from the Heritage Foundation's Project 2025, a policy and personnel plan for a second Trump term that was crafted by a host of former Trump administration officials.Trump blasted the project, which has become a centerpiece of Biden's campaign against Trump, as \"severe right\" and \"seriously extreme,\" just like the \"radical left.\"\"I don't know anything about it,\" he insisted.The 81-year-old Democratic incumbent, who appeared in Detroit this month, is currently isolating at his beach home in Delaware recovering from COVID-19.Grand Rapids, the largest city in Kent County, was historically a Republican stronghold, but has trended increasingly blue. It was one of three Michigan counties that Trump won in 2016 but Biden flipped in 2020. It's also an area where former United Nations Ambassador Nikki Haley secured a substantial number of votes as she ran against Trump in the GOP primary, a group of voters that both presidential campaigns are now hoping to pick up. Haley urged her supporters to back Trump in a convention floor speech.Rep. Hillary Scholten, a Democrat representing Grand Rapids, is among the growing number of lawmakers calling on Mr. Biden to exit the race after last month's disastrous debate performance.","summary":"It was the pair's first event together since they became the GOP's nominees at the Republican National Convention in Milwaukee.","url":"https://www.cbsnews.com/news/trump-jd-vance-first-joint-rally-grand-rapids-michigan/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/20/2f8e3c1d-104d-47ad-acd0-12f0c53383fd/thumbnail/1200x630/e6412de980eb511d8cb047bf5b8716a9/gettyimages-2162827631.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3066138_hls/master.m3u8","publish_date":"2024-07-20 23:48:25","author":null,"language":"en","source_country":"US","sentiment":-0.054},{"id":252247842,"title":"Historic First Baptist Dallas church sanctuary heavily damaged by fire","text":"Firefighters in Dallas reported that a fire nearly wiped out the historic church sanctuary at First Baptist Dallas. Despite the massive flames and smoke engulfing the city, fortunately, no casualties were reported. The fire broke out in the Victorian-style red brick church, labeled as a Texas Historic Landmark, which was originally constructed back in 1890. The incident was first reported around 6:30 p.m. on Friday and it took firefighters approximately three hours to bring it under control. Interim Fire Chief Justin Ball stated to KDFW-TV that the fire is believed to have originated in the basement before spreading to the second floor. An investigation will be carried out to ascertain the exact cause once the area is cleared and safe to access. A fire department spokesperson did not immediately return a phone call for comment Saturday morning. “We are grateful that no one was injured … and are thankful for the first responders who helped contain the fire to our historic sanctuary,” senior Pastor Robert Jeffress said. “We just had 2,000 children and volunteers on campus for Vacation Bible School earlier in the day.” The evangelical megachurch, with 16,000 members, now holds its main services in a modern worship center next door to the historic sanctuary. Jeffress, a close supporter of Republican presidential nominee Donald Trump, told WFAA-TV that he intends to hold services there on Sunday.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFirefighters in Dallas reported that a fire nearly wiped out the historic&#8230;\n\n\nThis Post: Historic First Baptist Dallas church sanctuary heavily damaged by fire first appeared on Internewscast Journal","url":"https://internewscast.com/news/historic-first-baptist-dallas-church-sanctuary-heavily-damaged-by-fire/","image":"https://internewscast.com/wp-content/uploads/2024/07/A-fire-severely-damages-the-historic-First-Baptist-Dallas-church.png","video":null,"publish_date":"2024-07-20 23:48:19","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.094},{"id":252247700,"title":"“Official: Gunman at Trump rally used drone to scout site before attack”","text":"WASHINGTON — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday’s shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump’s appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Associated Press writer Jill Colvin contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON &#8212; The gunman in the attempted assassination of former President Donald&#8230;\n\n\nThis Post: &#8220;Official: Gunman at Trump rally used drone to scout site before attack&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/official-gunman-at-trump-rally-used-drone-to-scout-site-before-attack/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-07-20 23:46:48","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.491},{"id":252248422,"title":"Trump says he’d like to take Kim Jong-Un to a baseball game as he boasts about their friendship","text":"Donald Trump said he’d like to take North Korean leader Kim Jong-Un to a baseball game as he boasted about their friendship at a Michigan rally on Saturday. The former president said he “got along” great with Kim when he was in office. “It’s a good thing to get along not a bad thing. I used to tell him, ‘why don’t you do something else?’ All he wants to do is buy nuclear weapons and make them,” Trump said of the North Korean leader. “I said, ‘just relax, chill.’ He got enough. He got so much nuclear weapons.” “I said, ‘just relax, lets go to a baseball game, I’ll show you how to baseball.’ We’ll go watch the Yankees,” Trump continued. The former president echoed similar rhetoric at the Republican National Convention in Milwaukee, Wisconsin on Thursday. “I get along with him, he’d like to see me back too,” Trump said during his keynote address. “I think he misses me, if you want to know.” Trump held in-person meetings with the dictator during his time in the Oval Office. In 2019, Trump became the first sitting US president to visit North Korea. North Korea is one of the most repressive countries in the world, according to Human Rights Watch. Under Kim’s leadership, “the government maintains fearful obedience by using threats of torture, executions, imprisonment, enforced disappearances, and forced labor,” Human Rights Watch reports. And yet, Trump has praised Kim’s leadership. “I may be wrong, but I believe that chairman Kim has a great and beautiful vision for his country, and only the United States, with me as president, can make that vision come true,” Trump said on X/Twitter in 2019. But Trump is no stranger to rubbing elbows with dictators. He has a long-standing friendship with Viktor Orbán, the far-right ruler of Hungary who triggered a democratic backslide in the country. Freedom House rates Hungary as only “partly free,” noting the country’s anti-immigration and anti-LGBTQ+ policies, as well as policies “that hamper the operations of opposition groups, journalists, universities, and nongovernmental organizations.” Trump mentioned Orbán during the same Michigan rally, celebrating praise he claimed to have received from the authoritarian leader. “Viktor Orbán... said when asked what happened with the world it’s falling to pieces, the wars all over, he said, ‘Bring back Trump. It’ll all end.’ It all ended,” Trump said. The Hungarian leader has similarly praised Trump, calling the former president his “good friend” earlier this year when the duo met in Washington, DC. Trump has also repeatedly praised Russia’s Vladimir Putin – even taking his side over that of US intelligence at a press conference in Helsinki in 2018 – and Xi Jinping of China.","summary":"Trump became the first sitting president to visit North Korea in 2019","url":"https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-kim-jongun-baseball-b2583156.html","image":"https://static.independent.co.uk/2024/07/20/23/2024-07-20T213919Z_1810345291_RC29Z8AY72TK_RTRMADP_3_USA-ELECTION-TRUMP-VANCE.jpg?width=1200","video":null,"publish_date":"2024-07-20 23:46:23","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","source_country":"gb","sentiment":0.145},{"id":252247922,"title":"Biden stews at allies’ pressure him to drop out of race","text":"WASHINGTON >> Sick with COVID and abandoned by allies, President Joe Biden has been fuming at his Delaware beach house, increasingly resentful about what he sees as an orchestrated campaign to drive him out of the race and bitter toward some of those he once considered close, including his onetime running mate Barack Obama. Biden has been around politics long enough to assume that the leaks appearing in the media in recent days are being coordinated to raise the pressure on him to step aside, according to people close to him. He considers Rep. Nancy Pelosi, the former House speaker, the main instigator but is irritated at Obama as well, seeing him as a puppet master behind the scenes. The friction between the sitting president and leaders of his own party so close to an election is unlike anything seen in Washington in generations — especially because the Democrats now working to ease him out were some of the allies most critical to his success over the last dozen years. It was Obama who elevated Biden from a presidential also-ran to the vice presidency, setting him up to win the White House in 2020, and it was Pelosi and Sen. Chuck Schumer, the Senate Democratic leader, who pushed through Biden’s landmark legislative achievements. But several people close to Biden, who insisted on anonymity to discuss internal matters, described an under-the-weather president coughing and hacking more than 100 miles from the corridors of power as his presidency meets its most perilous moment. He has watched with rising exasperation as a succession of news stories appeared, one after the other, reporting that Schumer, Pelosi, Obama and Rep. Hakeem Jeffries of New York, the House Democratic leader, all had warned of a devastating defeat for the party in November. And he certainly noticed that Obama has not done anything to help him in recent days even as his own former aides publicly have led the way in calling on Biden to withdraw in what was interpreted, rightly or wrongly, as a message from the former president’s camp. The unseen but clearly felt presence of Obama, in particular, has brought a Shakespearean quality to the drama now playing out, given their eight-year partnership. While Biden and his team publicly insist that he is staying in the race, privately, people close to him have said that he is increasingly accepting that he may not be able to, and some have begun discussing dates and venues for a possible announcement that he is stepping aside. One factor that may stretch out a decision: Advisers believe that Biden would not want to do it before Prime Minister Benjamin Netanyahu of Israel visits Washington on Wednesday at the initiative of Republicans to address Congress, unwilling to give the premier the satisfaction, given their strained relations lately over the war in the Gaza Strip. Yet Biden bristles at pressure, and those pushing him risk his getting back up and prompting him to remain after all. A person familiar with his thinking said he had not changed his mind as of Saturday afternoon. In privately railing about Obama and even aides to former President Bill Clinton, Biden has made clear that he finds it particularly rich that the architects of historic Democratic losses in the 1994 and 2010 midterm elections would be lecturing him about how to save the party after he presided over a better-than-expected midterm in 2022. While one person said Biden is not irked at Clinton himself — in fact, he is grateful the former president has been pressing donors to keep giving — others said that Obama is another story. “We have to cauterize this wound right now, and the sooner we can do it, the better,” said Rep. Gerald E. Connolly, D-Va., who has not publicly called for the president to step aside. He said the barrage of criticism must be difficult for Biden. “I mean, to me, this is very painful. I think it just shows the cold calculus of politics.” More congressional Democrats publicly called on the president Friday to pass the torch to another candidate to take on former President Donald Trump in the fall. Among them were Sen. Martin Heinrich of New Mexico, Sen. Sherrod Brown of Ohio and at least nine House Democrats, including Rep. Zoe Lofgren, a close ally of Pelosi, her fellow Californian. The fact that Pelosi’s allies have been coming out is seen as no coincidence at the president’s vacation house in Rehoboth Beach, Delaware. When another of her allies, Rep. Adam B. Schiff of California, spoke out earlier this week, a Biden administration official noted that it might be Schiff’s lips moving, but it was Pelosi doing the speaking. It has not just been her allies. Rep. Seth Moulton, D-Mass. and a Pelosi rival, said Friday that Biden, “a mentor and friend” who had helped him get elected to the House in 2014, “didn’t seem to recognize me” when they met at the D-Day anniversary commemoration in France last month. “Of course, that can happen as anyone ages, but as I watched the disastrous debate a few weeks ago, I have to admit that what I saw in Normandy was part of a deeper problem,” Moulton wrote in The Boston Globe, repeating his call for Biden to drop out. Biden pushed back Friday with a statement vowing to continue the race. “I look forward to getting back on the campaign trail next week to continue exposing the threat of Donald Trump’s Project 2025 agenda while making the case for my own record and the vision that I have for America: one where we save our democracy, protect our rights and freedoms, and create opportunity for everyone,” he said. The White House and the Biden campaign have denied that he is about to drop out. “Absolutely, the president is in this race,” Jennifer O’Malley Dillon, the campaign chair, said on MSNBC’s “Morning Joe” Friday, one of the president’s favorite shows and a regular venue for Democrats speaking to other Democrats. “You’ve heard him say that time and time again.” She acknowledged, though, that the campaign has seen erosion. “I’m not here to say that this hasn’t been a tough several weeks for the campaign,” she said. “There’s no doubt that it has been. And we’ve definitely seen some slippage in support, but it has been a small movement.” She argued that polls show the race was “hardened already” before the debate and not that many voters have shifted since. “The American people know that the president is older,” she said. “They see that. They knew that before the debate. Yes, of course, we have a lot of work to do to make sure that we are reassuring the American people that, yes, he’s old, but he can do the job, and he can win.” All of the political machinations were occurring as the president was fighting off symptoms from COVID in isolation in Rehoboth. He was still coughing and hoarse Friday, but he was improving, according to his doctor. Jill Biden was with him, although staying in a separate room. Among those with him in Rehoboth this weekend will be his aides Steve Ricchetti and Annie Tomasini. Anthony Bernal, the first lady’s chief of staff, accompanied her. It was unclear if Biden would still return to Washington on Sunday as planned, but he was tentatively scheduled to travel Wednesday to Austin, Texas, for a postponed celebration of the 60th anniversary of the Civil Rights Act at the Lyndon B. Johnson Presidential Library. Biden’s pique at his former partner, Obama, represents the latest chapter in a complicated relationship. While not close when they teamed up to run in 2008, they became friends over their two terms in the White House together, bonding especially when Biden’s son Beau died in 2015. But Biden has nursed a grudge ever since Obama gently discouraged him from running for president in 2016, steering the Democratic nomination to Hillary Clinton, who lost to Trump. So Obama’s advice may not be particularly welcome in Rehoboth at this point, which is perhaps one reason the former president is not offering it directly, according to people close to him. Obama last saw Biden at a lavish, record-setting Hollywood fundraiser before the debate in June, when the two appeared onstage together. At the end, Obama appeared to be leading Biden offstage. One former Obama aide who was present that night said that it was clear that the former president was startled and shaken by how much Biden had aged and seemed disoriented. That fundraiser was the last big haul for the campaign, which had hoped to raise about $50 million this month from large donors for the Biden Victory Fund, just as it did in June. But after the debate, it may collect less than $25 million in July, an excruciatingly modest sum for a summer month in a presidential race, according to four people briefed on the campaign’s finances. The campaign is not required to disclose its July fundraising numbers until mid-August, and a spokesperson dismissed the reports as “speculation.” As they try to influence Biden, many associates are holding back from harsh public statements because they feel empathy for him and worry such statements might backfire. Going public, some said, might cause the president to dig in even more. And some were reluctant to have their names attached to statements because they worry about his reaction to a pile-on from his friends. While the roughly 40 members of Congress who have publicly called on the president to leave the race represent a minority, privately, dozens more are said to agree. Two House Democrats estimated that on a secret ballot, 70% to 80% of their caucus would prefer Biden to withdraw. “They’re not going to be able to contain this. I think the dam has broken,” Connolly said. Even before Friday’s announcements, he said, “my sense was that a majority of my colleagues were so uneasy, they would welcome a decision to change horses.” But Sen. Chris Coons, D-Del., one of the president’s closest allies, made an impassioned defense of Biden’s ability to serve a second term. Speaking from the stage of the Aspen Security Conference in Colorado, Coons cited the president’s work hosting a NATO summit as well as his recent news conference and campaign events. “There are folks still saying he is not strong enough or capable enough to be our next president,” Coons said. “I disagree.” ——— This article originally appeared in The New York Times.","summary":"WASHINGTON >> Sick with COVID and abandoned by allies, President Joe Biden has been fuming at his Delaware beach house, increasingly resentful about what he sees as an orchestrated campaign to drive him out of the race and bitter toward some of those he once considered close, including his onetime running mate Barack Obama.","url":"https://www.staradvertiser.com/2024/07/20/breaking-news/biden-stews-at-allies-pressure-him-to-drop-out-of-race/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240720_WEB_CALIF-BIDEN-FUNDRAISER-6.jpg","video":null,"publish_date":"2024-07-20 23:45:00","author":"New York Times","authors":["New York Times"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.103},{"id":252248154,"title":"Airlines DON'T have to pay for disruption caused by global IT outage that paralysed global transport network leaving thousands of Brits out of pocket and stranded, CAA rules","text":"Home News Royals U.S. Sport Showbiz Femail Health Science Money Travel Podcasts Shopping Best Buys My Profile Logout Login Discounts TUI Booking.com ASOS Just Eat Deliveroo boohoo Very Nike Virgin Media Uber Eats Boots B&Q Amazon John Lewis My Profile Logout Login Breaking News Australia Video University Guide China Debate Meghan Markle Prince Harry King Charles III Weather Most read My Profile Logout Login Privacy Policy Feedback Sunday, Jul 21st 2024 1AM 17°C 4AM 16°C 5-Day Forecast Advertisement Strictly Come Dancing hit by new barrage of allegations: Amanda Abbington blasts 'abusive' Giovanni Pernice, Zara McDermott 'hid in toilets from Graziano Di Prima' and 'first FEMALE pro is accused of bullying' Brit eco-explorer and husband's yacht ‘smashed by tanker or capsized due to weight of its solar panels’, it's feared after they wash up dead in life raft following doomed bid to sail from Canada to the Azores without using fossil fuels 'Miracle' trial claims severe autism can be reversed with symptoms reduced to an indistinguishable level when treated with regular interventions at a young age PETER HITCHENS: Sacking old peers will lead to President Blair getting a 21-gun salute Risks of popular laser eye surgery may be MUCH higher than clinics claim: Everything you should know about chances of potential long-term side-effects - from permanent scarring and agonising pain to being left suicidal - before opting for £4,000 operation Hyde Park's Albert Memorial which was built in 1872 to honour Queen Victoria's husband is 'considered offensive' as it reflects a 'Victorian view of the world', Royal Parks claim ANNE WIDDECOMBE: I'm close to losing it with all the whingeing, whining and cries of misogyny from Strictly contestants Airlines WON'T have to pay you back if your flight was disrupted by CrowdStrike software disaster which has left thousands of Brits out of pocket and stranded, CAA rules It's time for this Lucy Letby is innocent madness to stop: I sat through almost every day of her two trials. Here's the evidence I believe proves her guilt, writes LIZ HULL DAN HODGES: Keir's no Che Guevara. This is a King's Speech that would have had Mrs Thatcher purring EU 'will demand access to UK fishing waters' in return for a closer relationship with Britain in fresh headache for Sir Keir Starmer's fledging Labour government SAUCY SECRETS: I am 26 and have a huge crush on my live-in landlord - he's 50, and super hot. Should I make a move? The world's fastest double take: Sprinters and identical twins Laviai and Lina Nielsen from London are among Team GB's best Olympic gold medal hopes - and both are living with MS BEL MOONEY: My leering husband makes me despair for all women Jay Slater's GoFundMe appeal tops £70,000 as money keeps pouring in for family determined to fly his body back to Britain for a funeral ROSIE GREEN: How mole-mapping could save your life LIZ JONES'S DIARY: In which I have a panic attack Evil on our streets: Brazen thugs torch a double-decker, overturn police cars and pelt officers with rocks - let's hope these yobs have been arrested! If not, can you help identify them? Sobbing Roma father breaks down and begs for his children back after they were removed by police - as crowd takes to streets of Leeds again following night of terrifying riots Man, 37, charged with violent disorder and arson in relation to riots in Leeds on Thursday which saw a bus torched Revealed: 12 organised crime gangs are behind a quarter of all shoplifting in England and Wales, with some brazen offenders flying into the UK to steal before fleeing on the same day Former Cabinet Minister David Davis to spearhead campaign raising questions over the conviction of killer nurse Lucy Letby as growing numbers of experts express concerns about her case Melania Trump's hilarious reaction to Kid Rock's performance warming up the Republican National Convention crowd before Donald goes on stage has fans in tears: 'Wait, this isn't a joke?' Internet in uproar as Donald Trump Jr. is seen on camera calling his teenage daughter Kai 'sexy' Previous Next Airlines DON'T have to pay for disruption caused by global IT outage that paralysed global transport network leaving thousands of Brits out of pocket and stranded, CAA rules Have YOU been affected by the outage? Email ryan.prosser@mailonline.co.uk By Ryan Prosser and Jon Brady Published:00:41 BST, 21 July 2024 |Updated:00:44 BST, 21 July 2024 e-mail 2 View comments Airlines are unlikely to have to pay out compensation for cancelled and delayed flights caused by the CrowdStrike outage that crippled 8.5million Windows computers across the world. The Civil Aviation Authority (CAA), the UK's air passenger watchdog, wrote to airlines on Friday to say that it believed the global IT meltdown was likely to be viewed as 'extraordinary circumstances' exempt from standard refund policies. However, it has warned flight operators to expect potential legal action from passengers or groups representing travellers if they try to claim compensation directly, only to be denied it because of the new guidance. Passengers would not, however, be denied the reimbursement of expenses such as unexpected hotel and food costs related to the delay - but they would be unable to claim further compensation under standard EU rules. Airlines could, in theory, claim some damages back from CrowdStrike, the Texas-based cybersecurity firm responsible for the botched update that took down millions of computers on Friday - and may have negotiated terms with the company. Huge queues of holidaymakers at London Gatwick Airport following the global IT outage caused by CrowdStrike software Passengers at Stansted Airport are left in chaos and without flight information following the worldwide IT failure Millions of users and businesses worldwide were faced with the 'blue screen of death' on Friday as systems were crippled by the outage Railway services still faced disruption in the UK on Saturday. Pictured: A South Western Railway ticket machine put out of action due to the outage Sky News temporarily went off air on Friday morning due to the outage, with viewers faced with this message apologising for 'the interruption to this broadcast' Microsoft said that it estimated 8.5million Windows devices had been affected by the outage (file photo) The CAA's guidance puts Friday's IT crisis into the same category of uncontrollable events such as terrorism, sabotage and disruption caused by unruly passengers, for which operators are not deemed to be responsible. But Paul Charles, chief executive of travel consultancy the PC Agency, told The Sunday Times of the CAA statement: 'This outage caused untold financial and emo- tional stress to thousands of people in the UK. 'If the regulator can’t protect passengers in this case and agree compensation for ruined holidays, what is it truly for?' Contract lawyers who have examined CrowdStrike's boilerplate terms and conditions believe that airlines and other companies using its Falcon endpoint security software - responsible for the global crash - may be limited in the compensation they claim. Read More Now trains are hit in Crowdstrike outage as ticket machines and scanners go down at London stations on one of year's busiest travel days - while families queue at Dover and 28,000 Brits battle to fly home with another 45 UK flights axed today Flights were grounded, GP surgeries disrupted and news channels taken off air on Friday after a faulty software update by the cybersecurity company caused blue screens to appear on computers across the globe. But Elizabeth Burgin Waller, a cybersecurity lawyer with US firm Woods Rogers, told Business Insider the company's standard terms limit liability to 'fees paid' - meaning many firms may only be able to get a refund of the money they've paid to the firm. 'Even if they did cover that lost revenue or downtime, they limit the recovery against CrowdStrike to fees paid,' she said. While the issue of the Falcon content update has now been fixed, the impact was still being felt in the UK on Saturday, with thousands of passengers still left stranded as a result of the major outage. In a statement this afternoon, Microsoft said it estimated the error had affected at least 8.5million machines or one per cent of Windows computers worldwide. But the tech giant acknowledged the 'broad economic and societal' impact of the outage, worsened by the number of enterprises running critical services and infrastructure which rely on CrowdStrike. Microsoft insisted that while software updates can cause disturbances, major crashes on this scale are 'infrequent'. In a statement issue on Saturday, Microsoft said: 'We recognise the disruption this problem has caused for businesses and in the daily routines of many individuals. 'Our focus is providing customers with technical guidance and support to safely bring disrupted systems back online. 'We’re working around the clock and providing ongoing updates and support. 'Additionally, CrowdStrike has helped us develop a scalable solution that will help Microsoft’s Azure infrastructure accelerate a fix for CrowdStrike’s faulty update.' A large blue screen is shown at Madrid Barajas airport in Spain, as the major IT outage saw flights thrown into chaos worldwide Passengers face huge queues at Madrid's Barajas airport as the global outage disrupted check in systems in the terminal Some Waitrose stores were forced to revert to cash only operations as cashless services on self checkouts were disabled by the crash A ticket machine at King's Cross Station in central London that was left out of service following the huge IT outage NHS services relying on online-stored patient data including GP surgeries and prescriptions were also affected by the IT outage In a statement, CrowdStrike said it was 'working with all impacted customers' to get systems up and running again What has been dubbed the worst IT outage the world has ever seen also affected shops, banks and even football teams, which were left unable to sell tickets online. GP appointments were disrupted because of a failure in EMIS, the NHS England system used by surgeries and pharmacies to look up patient records, while some payroll systems using CrowdStrike may have been unable to process salaries. On Friday, UK Government officials convened an emergency COBRA meeting amid the crisis, after major disruption was reported at several major travel hubs. Heathrow, Gatwick and Edinburgh airports all suffered disruption in what was estimated to be the busiest day for air travel since before the Covid pandemic as families hoped to jet off on well-earned holidays. Instead many spent the night on the floor of airport concourses as flights were grounded and airports were left with no option but to revert to manual check in procedures and paper tickets. Other major international airports worldwide, including Amsterdam Schiphol and Dubai International, were thrown into chaos as departure screens switched off. The outage, which has also been branded a 'digital pandemic', has reignited a debate over the increasing reliance on cashless transactions. Several major UK supermarkets including Waitrose were forced to resort to 'cash-only' operations in some stores, as self checkout systems went down. Other stores, including Gail's, Morrison's and B&Q were unable to process contactless payments on Friday. One of the country's largest broadcasters, Sky News, went off air on Friday morning, leaving viewers faced with a message apologising for an interruption in transmission. CBBC was also taken off air following the outage, with TV viewers informed 'something's gone wrong'. In sport, Manchester United warned that fans would experience delays getting matchday tickets after the failure affected its systems, while the Mercedes F1 team said it was working to rectify issues ahead of the Hungarian Grand Prix. BBC channel CBBC was taken off air due to the IT failure, as TV viewers were told 'something's gone wrong' Departure screens show dozens of delayed flights at New York's Newark Liberty airport Huge crowds at Singapore's Changi airport as communications are crippled due to the IT outage Passengers left on the floor at Gatwick airport as several flights are either delayed or cancelled Technology experts have compared the scale of the disruption to the that expected from Y2K or the 'Millennium Bug' - a computer programming shortcut that was forecast to cause chaos at the turn of the millennium in 2000 but never materialised. 'This is basically what we were all worried about with Y2K, except it's actually happened this time', security consultant Troy Hunt wrote on X. Cyber security company CrowdStrike has admitted to being responsible for the error that hit Microsoft 365 apps and operating systems and said a 'fix has been deployed'. The American firm said it was caused by a 'defect found in a single content update' and insisted the issue 'was not a security incident or cyberattack'. In a statement the company said: 'We understand the gravity of the situation and are deeply sorry for the inconvenience and disruption. We are working with all impacted customers to ensure that systems are back up and they can deliver the services their customers are counting on.' Microsoft Share or comment on this article: Airlines DON'T have to pay for disruption caused by global IT outage that paralysed global transport network leaving thousands of Brits out of pocket and stranded, CAA rules e-mail Add comment Bing Site Web Enter search term: Search Advertisement DON'T MISS EXCLUSIVEGiovanni Pernice denies accusations of abusive behaviour after Amanda Abbington claimed dancer was 'cruel and mean' on Strictly Amanda Holden reveals her daughter Lexi, 18, was rushed to hospital with life-threatening illness: 'She was in a lot of pain' EMILY PRESCOTT: A nice day for a Welsh wedding as Rufus Sewell ties the knot Paddy McGuinness and ex wife Christine 'settle divorce amicably out of court' as she enjoys holiday with 'tomboy' musician Roxxxan Desperate for sunshine? It's not too late to go and find it! Here's our pick of the best last-minute summer deals Ad Feature Gwyneth Paltrow shares rare photo with kids Apple, 20, and Moses, 18, as she worries about them being a part of the 'anxious generation' Strictly's Kristina Rihanoff says celebrity contestants should have chaperones as she weighs in on 'pressurised' reality of rehearsals First female Strictly star 'faces bullying claims after they screamed in rage at their celebrity partner if his steps were wrong' Power in your palm: Top 10 apps to help you level up your everyday - from working out to gardening Ad Feature Strictly's Anton Du Beke seen for first time since being dragged into misconduct scandal after breaking his social media silence Strictly on FIRE! BBC show creaking as Amanda Abbington breaks her silence while Graziano Di Prima is now battling off claims he was 'aggressive' to Zara McDermott Kylie Jenner stuns in a backless black dress during extravagant holiday with her two kids: 'When in Italy' Chelcee Grimes takes a savage swipe at Christine McGuinness and brands her 'fake' as she reveals new romance with mystery woman A dermatologist debunks common out-of-date myths about summer skincare (but how many do YOU still believe?) Ad Feature John Mayer, 46, reignites Kiernan Shipka, 24, romance rumors as duo grab late-night bite at exclusive West Hollywood hangout King Charles set to return to 'traditional' royal holiday schedule as aides reveal the monarch will enjoy an extended stay in Scotland this summer Prince George and Princess Charlotte prove they are true Swifties as they don beaded friendship bracelets at Wimbledon and Euros finals EXCLUSIVEColin Firth's Mark Darcy returns in new Bridget Jones despite fears he had been killed off as pictures reveal beloved character is alive... or is he? Secret coves and stunning cities: How Adele Roberts and Kate Holderness fell in love with magical Malta Ad Feature Perrie Edwards says her son Axel is 'the best thing that has ever happened to me' as she discusses motherhood John Stamos says he 'probably wouldn't be here' without his therapist helping him get sober Glen Powell chugs a beer on stage at Luke Combs concert with Twister co-stars Daisy Edgar-Jones and Anthony Ramos Sopranos star Drea de Matteo admits her 13-year-old son edits her OnlyFans content Do you own a business? Here's how to reach millions of potential customers with ads you can TRUST Ad Feature Shirley Ballas and Ruth Langsford show their support for Anton Du Beke after Strictly star was thrown into the misconduct probe Steph McGovern reveals unexpected career change after Channel 4 AXED her chat show Packed Lunch Love Island's Tiffany Leighton puts on a leggy display in skintight pink mini dress as she enjoys girls' night out Bikini-clad Bella Thorne talks about her insecurities as she slams Ozempic for creating 'crazy beauty standards' Out with the old, in with the new? Only 38 per cent of women in their 40s feel positive about career progression prospects, compared to 65 per cent of women in their 20s Advertising Is THIS the start of Adele's return to the UK? Singer enjoys a rare date night with husband Rich Paul at London's Chiltern Firehouse EXCLUSIVENewly-single Maya Jama shows off her curves in a white dress as she parties in Ibiza after announcing her split from Stormzy EXCLUSIVEBaby Reindeer star Richard Gadd promises intimate scenes in new series will be 'carefully handled' Hollyoaks actress Stephanie Waring secretly marries Tom Thornton-Brookes in lavish Maldives ceremony Vogue Williams displays her jaw-dropping figure in a stunning yellow bikini as she takes a dip in the sea during fun-filled Spanish holiday Taylor Swift thanks fans for keeping The Tortured Poets Department on top of the Billboard 200 for 12 weeks in a row: 'I am completely blown away' Jessie J reveals she has been diagnosed with ADHD and OCD and admits it has made her 'rethink' her whole life Zac Efron bares his chiseled chest and brawny arms as he goes shirtless on a yacht with friends in Ibiza Scott McTominay's girlfriend Cam Reading shows off her incredible figure in skintight gym gear as she climbs into his £200k Range Rover Anne Hathaway dances up a storm at 'phenomenal' Taylor Swift's record-breaking Eras Tour stop in Germany Jennifer Lopez shares optimistic message while posing for glamorous selfies in bed amid rumored marriage woes: 'Today is gonna be a great day' Strictly Come Dancing judge Craig Revel Horwood breaks his silence on misconduct allegations and admits 'it came as a shock' Love Island couple 'have been DUMPED and already left the villa in shock eviction' after latest recoupling Stars who struggled on Strictly: As Zara and Amanda call out their 'abusive' partners, the celebs who suffered physical and mental harm Helen Flanagan looks radiant in a red gingham dress as she joins leggy Ashley James at Sea Life Aquarium launch Strictly's Anton Du Beke breaks his silence after his '1970s-style behaviour' with former dance partner Laila Rouass 'raised concerns' Katie Price reveals the reason why she chose not to breastfeed any of her five children: 'I wasn't going to be vilified' Can you believe these stars used to date? Ben Affleck romanced Gwyneth after she dumped Brad Pitt and Justin Bieber had a thing for a Kardashian EXCLUSIVESpencer Matthews reveals 'shocking' relationship with alcohol left him feeling 'ashamed' and how he's in the 'best shape of his life' EXCLUSIVEInside Jennifer Lopez and Ben Affleck's desperate bid to salvage their marriage and shut down divorce speculation Kevin Spacey attends gala dinner in Italy alongside actress Madalina Ghenea after revealing he is on the brink of bankruptcy EXCLUSIVEBrad Pitt REFUSES to drop lawsuit against Angelina Jolie after she 'painted herself as a peacemaker' in desperate bid to have him end legal battle Gearing up for Kate's comeback? Prince and Princess of Wales are hiring a new private secretary to organise the royals' UK engagements EXCLUSIVEBritain's Got Talent winner Sydnie Christmas hits back at 'hateful' trolls who told her to quit West End dream Strictly's Dianne Buswell brushes off the show's misconduct scandal as she enjoys a fun day out with her co-stars ahead of her return to training Zara McDermott and boyfriend Sam Thompson are giving relationship 'one last shot' following weeks of 'crisis talks' Netflix fans go wild over 'masterpiece' new series but claim it has a frustrating plot hole 'that doesn't make sense' EXCLUSIVEChianti and fava beans are off the menu for Anthony Hopkins at famed Malibu bistro as his iconic character is dragged center stage Katie Price admits her children are 'definitely nepo babies' and will follow in her footsteps after claiming Netflix are making a documentary about her life Kady McDermott flashes her jaw-dropping physique in a skimpy white bikini as she relaxes on the beach in Mykonos Ronnie Wood, 76, and his wife Sally, 45, share sweet poolside snap with their twin daughters as they enjoy a break from The Rolling Stones tour Lewis Capaldi cuts a casual figure as he heads out for a jog in the park with a pal - after taking a career hiatus amid Tourette's battle EXCLUSIVEKelly Bensimon reveals top tips to ALL women on signing prenups - after calling off her wedding to ex-fiancé Scott Litner EXCLUSIVEStrictly: The worst case scenario. Even BBC bosses worry it could be the end as yet more complaints emerge and the 'nightmare goes on'. KATIE HIND reports Iconic British indie band are forced to postpone their show after missing their flight due to airport chaos caused by Crowdstrike IT outage EXCLUSIVEOh Beehave! Jeremy Clarkson goes to war with locals AGAIN but this time it has nothing to do with Diddly Squat's farmshop Travis Kelce goes on WILD shopping spree for Taylor Swift - splashing out '$75,000 on 14 Italian designer gifts' before Eras Tour hit Milan last week EXCLUSIVEWhy Netflix 'should pay real-life Baby Reindeer stalker £132m'! Her plans for payback after 'slap in the face' are revealed in exclusive interview Strictly Come Dancing judge Anton Du Beke 'raises concerns' over historic row and '1970s-style behaviour' amid misconduct scandal Brad Pitt's daughter Shiloh Jolie continues plan to drop his surname with newspaper ad - as its claimed Angelina Jolie divorce is still ongoing Ashley Roberts sets pulses racing in a sexy sheer lilac corset and matching trousers as she enjoys a night out at PIRANA London Twisters fans fume that director Lee Isaac Chung should be 'called before Congress' as they discover a HUGE scene was cut from the disaster film Missing the limelight, Lily? Singer is clawing her way back into the public eye with raunchy confessions, an OnlyFans for her feet and reigniting old feuds BBC could 'face £1million legal bill' over Strictly misconduct scandal as video emerges of former professional slapping partner's bottom EXCLUSIVEStrictly star Graziano Di Prima's 'very concerned' family are stunned by his sacking and 'rallying around him' after he fled home to Italy EXCLUSIVEJodie Marsh admits she wants to reverse her glamour model boob job after quitting fame to start an animal sanctuary - but surgeons refuse Clint Eastwood's partner Christina Sandera dead at 61: Oscar-winner, 94, pays heartbreaking tribute much' Sharon Stone, 66, stuns in a dramatic monochrome feathered gown as she accepts Lifetime Achievement award at the Taormina Film Festival Khloe Kardashian, 40, flaunts her incredible figure in a white string bikini... after admitting she 'probably would have' tried Ozempic 'Coolest King ever!' Frederik of Denmark sends royal fans wild by trying out hammer throwing, BMX biking and table tennis Daisy Edgar-Jones puts on a leggy display in tiny black shorts and a brown patent leather jacket as she continues her whirlwind press tour for Twisters in New York Jennifer Lopez REPLACES Ben necklace with her own name in diamonds as she puts on a busty display at Hamptons gym Molly-Mae's make-under! Reality star has bared back her Love Island look to channel a 'rich wife' aesthetic and 'clean' beauty EXCLUSIVEHeartbreaking pictures show Richard Simmons' grave heaped with pink roses as he's laid to rest - amid investigation into fitness guru's final hours Hannah Spearritt 'is set for surprising career change after a series of setbacks' following her ex Paul Cattermole's death Ben Affleck flashes wedding ring leaving ex Jennifer Garner's house as his marriage woes with Jennifer Lopez are 'deeper than his concerns over her fame' Armie Hammer DENIES that Robert Downey Jr. paid for him to go to rehab... in bombshell interview where he was asked if he's eaten human flesh Demi Lovato looks incredible in a faux leather corset and black pantsuit as she poses for sexy glamour shots before hitting the stage Selena Gomez says she's 'grateful' for Only Murders In The Building co-stars Steve Martin and Martin Short - after receiving first acting Emmy nod Ariana Grande is set to join HYBE's superfan platform Weverse... as she CONTINUES to work with the entertainment brand and ex manager Scooter Braun Jennifer Lawrence teases her black bra in a sheer cover up and sweats while out in New York House Of The Dragon season two earns highest streaming ratings to date for Game Of Thrones spin-off Shannon Beador says she was 'shocked' to see her bloodied face in graphic selfie as she didn't remember taking photo the night of DUI arrest Kyle Richards reunites with rumored girlfriend Morgan Wade as she supports musician backstage at concert The top 20 TV shows to watch on demand this weekend, from Netflix to Apple TV+ and BBC iPlayer: Our critics sift through thousands of options so you don't have to Judd Hirsch reflects on life of Bob Newhart and the kindness he showed him when they starred together on George & Leo Heidi Klum's ex Vito Schnabel, 37, marries Russian model Helena Althof, 21, in private NY wedding Mama June: Family Crisis: June's husband Justin calls her surprise vow renewal 'embarrassing' and was 'caught off guard' during season finale 'He's adorable': Kim Zolciak recalls 'deep conversations' with Chet Hanks while filming Surreal Life - after trailer teased potential hookup Dani Dyer cosies up to her boyfriend Jarrod Bowen during romantic getaway following England's Euros defeat 'I miss his kindness and his humour': Reese Witherspoon shares sweet tribute to her Legally Blonde 2 co-star Bob Newhart following his death at 94 Sean Kingston, 34, and mother Janice, 61, are INDICTED on federal charges in $1M fraud scheme... one month after rapper was released from jail 'It's fun to be young': Madonna's son David Banda, 18, is 'scavenging' for food and selling guitar lessons in NYC despite mom's $850M fortune Nicolas Cage, 60, steps out with son Kal-El, 18, on vacation in Italy - as his other son Weston, 33, is investigated by police Lily-Rose Depp sizzles in a red off-the-shoulder top and jeans as she enjoys summer outing with girlfriend 070 Shake in LA Pregnant Margot Robbie surprises diners at The Ivy Chelsea Garden as she and husband Tom Ackerley treat them to a round of drinks Eminem hits HUGE UK milestone and draws level with David Bowie and U2 after release of The Death Of Slim Shady (Coup De Grace) album Ellen DeGeneres surfaces with wife Portia de Rossi... after announcing she is 'done' with showbiz once her Netflix special drops Lindsay Lohan gives peek at son Luai's racing themed 1st birthday party as she shares sweet tribute: 'I love you more than anything in this world' Lily Allen, 39, admits she gets her mother and children to do her laundry and she has no idea how to use a washing machine Ryan Reynolds and Hugh Jackman match in pastels while promoting Deadpool & Wolverine in NYC Anna Faris wishes she got to know Matthew Perry better when she guest-starred on Friends... and says he suggested her for the role Christine Lampard says her husband Frank is like 'the son my mum and dad never had' as she confesses he loves being doted on by his in-laws Jordin Sparks says she 'wouldn't be a mean judge' if picked to take over Katy Perry's job on American Idol Adele 'set to live it up in £25k-a-night hotel' after announcing 'big break' from music - but the luxury suite doesn't include breakfast Meadow Walker wishes a happy birthday to her late father Paul's co-star Vin Diesel... proving they are still close 11 years after actor's death Nadiya Bychkova breaks silence on Strictly Come Dancing complaint amid misconduct scandal Miley Cyrus enjoys wild party at Chateau Marmont for VERY star-studded Gucci launch alongside Kendall Jenner, Salma Hayek and Rumer Willis Love Island fans in shock over Josh and Mimii's 'low budget' market date before demanding to know where all the money has disappeared to Clint Eastwood's tumultuous marriages and on-set love affairs laid bare - before finding long-lasting romance with Christina Sandera, as she dies at age 61 Beyonce continues to embrace her cowgirl era as she promotes hair care brand Cecred during lavish helicopter ride over Manhattan skyline Victoria's Secret model Emily DiDonato continues to shows off postpartum weight loss - one year after welcoming son Oliver Ulrika Jonsson 'was offered Strictly Come Dancing presenting job but lost out to Tess Daly because she was pregnant' Lady Gaga smiles during a romantic dinner date with boyfriend Michael Polansky in NYC... after revealing she is working on new music Scarlett Johansson names the job she refused to take for the sake of her kids... and the 'disturbing' twist after she said no EXCLUSIVEBen Affleck's harsh warning to daughter Violet revealed - as 18-year-old struggles to deal with 'ridicule' over her pro-mask speech Richard Simmons' cause of death at 76 still unknown amid police probe into fitness guru's final hours - as star's final resting place is revealed Rory McIlroy's wife Erica Stoll is nowhere to be seen at The Open as he misses the cut amid divorce U-turn Katie McGlynn packs on the PDA with TOWIE star boyfriend Ricky Rayment as they hit the beach during sun-soaked Greek Island getaway Baywatch star Nicole Eggert, 52, is spotted on a grocery run in Los Angeles... after shaving her head while battling 'rare' cancer King Charles and Queen Camilla were rushed to safety HOURS after Trump's shooting after security spotted a mysterious person on a nearby roof Sharon Stone, 66, exudes glamour in sheer dress with mini slip, as she arrives on the red carpet at the Taormina Film Festival Sam Smith reveals they were 'unable to walk' as they open up about traumatic ski accident that left them with 'permanent damage' and anxiety Michael Cera pokes fun at his 'weird' blonde locks which the normally dark-haired star is wearing for a new acting role Emily Ratajkowski bares her long toned legs in white shorts with stylish motorcycle boots as she gets ready to leave New York City Wonder Woman star Lynda Carter, 72, looks decades younger as she poses in black leather to promote her single Pink Slip Lollipop Strictly Come Dancing fans threaten to boycott series over Graziano Di Prima and Giovanni Pernice misconduct probe Sofia Vergara, 52, flashes her chest in a strapless dress before digging into a HUGE plate of pasta during lunch with friends on the beach in Italy Love Island's Ekin-Su Culculoglu takes a swipe at ex-boyfriend Davide Sanclimenti following their bitter split Strictly Come Dancing's Anton Du Beke unfollows Graziano Di Prima on social media but stands by Giovanni Pernice Freddie Flintoff looks in great spirits while smiling out and about in London 18 months after Top Gear horror crash Pregnant Jenna Coleman showcases her blossoming baby bump in black lace midi dress during afternoon outing Those About To Die is praised by fans who say they are 'hooked already' and compare it to Game Of Thrones Twisters star Glen Powell pays tribute to the late Bill Paxton as his reboot hits theaters Doja Cat is FLASHED by her male pal during chaotic Instagram live Olivia Rodrigo models a tank top and miniskirt as she snacks on cookies and an iced Matcha drink in New York City Lady Deadpool's full look is revealed in Deadpool & Wolverine's final trailer - featuring a surprise cameo from Dafne Keen alongside Hugh Jackman The 'real reason' behind Strictly 'golden couple' Nadiya Bychkova and Kai Widdrington's split is revealed Sharon Stone says THAT Basic Instinct scene now seems 'very ordinary' compared to raunchy present-day scenes - as star talks on-screen sex EXCLUSIVELottie Moss puts on a cheeky display in a TINY pair of Daisy Dukes as she enjoys a night out in London Lily Allen fumes she's stranded at Heathrow Airport after missing her flight home due to the Microsoft outage chaos Love Island's Uma Jammeh wows in a strapless white dress as she enjoys a night on the town after quitting show with boyfriend Wil Anderson Amy Dowden shares emotional post about finally returning to work as she prepares for Strictly comeback amid show's abuse scandal EXCLUSIVEAmanda Abbington will break her silence on Lorraine next week as she returns to TV for the first time since quitting Strictly Come Dancing Simon Cowell's boyband search is hit by another blow while Amanda Holden reveals the mogul brutally shut down her idea to spice up Britain's Got Talent Peter Andre claims he's 'BANNED' from Buckingham Palace after destroying priceless object in epic blunder Devon Windsor showcases her fit form in a yellow and orange bikini as she enjoys the beach with 'mini me' daughter Enzo Mauricio Umansky's mystery woman is identified as a Russian-born actress who is 20 years younger than Kyle Richards' ex and is in a movie with Alec Baldwin Strictly pros reveal FOURTH celebrity clashed with their partner and claim some female dancers 'are even harsher' than the men in rehearsals EXCLUSIVEPregnant The Traitors star Charlotte Chilton says she's been contacted by MORE women who claim to have children with Conor Maynard Prince Harry's charity chief quits: Duke of Sussex thanks his friend Dominic Reid for 'relentless service, dedication and leadership' Strictly's Katya Jones breaks her silence on BBC scandal as she insists the competition isn't about the professionals The Boss is a billionaire! Bruce Springsteen, 74, reaches milestone after selling his music catalog for over $500M Candice Swanepoel says she ran into SHARKS when posing in a skimpy green bikini while visiting a remote tropical island BAFTA and Emmy-winning Channel 4 show to return after 10 years as a 'reimagination' of the original run Jess Wright shows off her abs in a plunging white crop top and £900 Lowe jeans as she goes shopping in Mayfair with a pal Imogen Thomas stuns in a plunging black mini dress as she kisses banker boyfriend Michel Aramouni during intimate al fresco lunch date Monty Don reveals his simple three-step plan to defend your garden against slugs and snails Jax Taylor heads to the gym as police visit the LA home he shared with estranged wife Brittany Cartwright which now has a $35k tax lien Adidas DROPS Bella Hadid from advertising campaign for retro sneakers - following outcry over her pro-Palestine views Little Mix fans go wild as Jade Thirwall transforms herself into a range of eccentric personas for the release of her debut single Angel Of My Dreams Joe Jonas releases first single from his album Music for People Who Believe in Love after his split from Sophie Turner EXCLUSIVEBikini bottoms to avoid and the style that's NOT flattering. Our fashion expert reveals the surprising bikini rules for over-50s Ellie Goulding sets pulses racing as she poses topless while frolicking through a field in sexy snaps Pregnant The Traitors star Charlotte Chilton showcases her baby bump in a mini dress after revealing she's been contacted by MORE women Rachel Stevens looks effortlessly chic in one-shoulder white top and black jeans as she heads out in London on the hottest day of the year Fans are convinced pregnant Margot Robbie will call her baby Barbie or Ken - as she awaits birth of first child with husband Tom Acklerey Hollyoaks' Jennifer Metcalfe reveals she suffered a terrifying health scare after finding a lump in her breast FIRST LOOK: Bulked-up Stephen Graham, 50, shows off his muscular physique as he begins filming his Netflix crime drama Adolescence with Ashley Walters Graziano Di Prima's rule for Zara McDermott during Strictly training that left her 'hurting and bleeding' is revealed after the dancer admitted to kicking her Love Island SPOILER: Grace confronts Reuben for 'embarrassing' her as the final recoupling looms Kate Garraway sparks concern with Good Morning Britain absence after her father was 'rushed to hospital following a stroke and heart attack' Britain's Got Talent winner Sydnie Christmas reveals the hilarious moment Amanda Holden stripped off in front of her and her mother Norwegian model Frida Aasen showcases her lithe figure in a leopard print bikini and a sheer black dress as she attends a boat party in St Tropez James Corden shares major Gavin and Stacey update after delay finishing script with Ruth Jones Vanessa Feltz defends former Strictly partner James Jordan after 'abusive' footage of him emerged Jennifer Lopez poses makeup free in lingerie before 55th birthday as she frolics in the Hamptons... while estranged husband Ben Affleck works in LA Giovanni Pernice brushes off break-up blues as he makes his first appearance since split from girlfriend Molly Brown Lauren Goodger reveals her daughter Larose, 2, has been rushed to hospital after struggling with 'breathing problems' Giovanni Pernice 'SPLITS from his girlfriend Molly Brown for the second time after they were involved in heated rows following Strictly abuse scandal' Kiefer Sutherland admits he feels 'sorry' that he didn't spend more time with his late father Donald as he reflects on the actor's death Daisy Edgar-Jones hysterically recalls ending up in an ambulance and wetting herself after trying Marijuana for the first time in Amsterdam Sharon Stone, 66, is the epitome of elegance in a dramatic hooded gown at the Taormina Film Festival in Italy - after recreating THAT Basic Instinct scene Strictly's Zara McDermott hits back at Graziano Di Prima by insisting it 'wasn't a singular incident' after he downplayed his 'abusive' behaviour Ashley Roberts sends temperatures soaring as she flaunts her figure in a skimpy black bikini during her Caribbean getaway Advertisement Follow DailyMail Subscribe Daily Mail Follow @dailymail Follow DailyMail Follow MailOnline Follow Daily Mail MORE DON'T MISS Brad Pitt looks youthful looks in a green sweatshirt and denim as he arrives at Grand Prix in Hungary to continue filming scenes for F1 film Love Island's Jess and Eve Gale put on a VERY leggy display as they step out to Frameless art gallery just hours after soaking up the sun in Ibiza Kyle Richards, 55, ditches 'wife' from Instagram after Mauricio Umansky's kiss with mystery woman and celebrates two years of sobriety with sexy selfie Bradley Cooper, Matt Damon, and Jeremy Strong enjoy girl-dad day together at Copenhagen theme park... before dining with Liam Hemsworth EXCLUSIVEJodie Marsh reveals 'bully' Ulrika Jonsson left her 'crying for days' after making 'vile' comments about her appearance while she was suicidal Paddy McGuinness reveals his divorce with ex-wife Christine will be discussed in his stand-up comedy show as he embarks on his first tour in eight years Strictly's Kai Widdrington seen for the FIRST time since split from co-star Nadiya Bychkova as he dresses up to promote upcoming panto Kylie Jenner resembles Audrey Hepburn on her Roman holiday with kids Stormi, six, and Aire, two, as they eat pasta and sightsee Sarah Jayne Dunn shows off her abs in black bralet and sparkly sheer mini skirt as she enjoys a night out in Manchester Love Island's Jess White endures an awkward run-in with ex Ronnie Vint and new girlfriend Harriet Blackmore Maura Higgins is left mortified after unseen Aftersun clip shows her flirting with hunky Love Island USA contestant before confessing her love for him As Giovanni Pernice splits from girlfriend Molly Brown, all the reasons their romance hit the rocks - from brief early break-up and Strictly scandal Rumer Willis puts on a leggy display in an orange lace mini dress as she's helped through the exit clutching a Gucci goody bag after a night of partying EXCLUSIVEChristina Aguilera, 43, showcases her incredible figure amid Ozempic rumors in sexy photos to promote sexual wellness brand Playground Was Maya Jama and Stormzy's split inevitable? How their second go at love was thwarted by career progress they made apart Daisy Edgar-Jones ruffles fans' feathers as she declares her love for chickens - days after wolfing down wings on Hot Ones Cristiano Ronaldo and his partner Georgina Rodriguez show off their flexibility in a suggestive stretching video Rose McGowan cuts a stylish figure in a black jumpsuit with a fun Aztec print as she attends Frauen100's anniversary party in Berlin Judge Rinder says Strictly's pro dancers are more focused on winning than 'the journey' with their partners as abuse claims engulf the show Georgina Rodriguez shows off her toned figure in a dark grey bikini as she and her partner Cristiano Ronaldo enjoy a family getaway Idris Elba and Jude Bellingham put on a very animated display as the unlikely pals party until 3am with Paul Mescal at the Chiltern Firehouse Kym Marsh, 48, shows off her huge new Cruella de Vil tattoo which is covering an old inking - after hitting back at criticism over toyboy lover, 29 Dani Dyer cuts a chic figure in a blue mini dress as she cosies up to her boyfriend Jarrod Bowen during a loved-up holiday after England's Euros defeat Twisters review: Daisy Edgar-Jones' action adventure hailed as the 'blockbuster of the summer' Kate Hudson makes surprise personal hygiene confession while being grilled about Matthew McConaughey's refusal to wear deodorant Tess Daly lets her hair down on night out with husband Vernon and lookalike daughter Phoebe, 19, after 'vowing to stand by' Strictly amid abuse scandal Camila Morrone stuns in a plunging black dress while Naomi Watts opts for a gold mini as they attend Dom Perignon launch party in New York Strictly's Graziano Di Prima apologises for kicking dance partner Zara McDermott as he brands abusive rehearsals a 'mistake' Lottie Tomlinson is pregnant! Influencer, 25, announces she is expecting her second child with fiancé Lewis Burton as she shares sweet clip Maya Jama slips into a sexy white dress as she enjoys a fun car ride with her pals in Ibiza - after stunning in THAT 'revenge' look following Stormzy split Twiggy, 74, looks sensational in a hot pink suit as she cosies up to her husband Leigh Lawson at Hello, Dolly! press night Kim Kardashian slips her famous curves into sheer bodycon dress alongside busty new BFF Olivia Pierson for steamy SKIMS shoot Love Island's Jess Harding puts on a busty display in skimpy black bikini while relaxing in Ibiza as she cozies up to new boyfriend Rosie Huntington-Whiteley goes braless in a nude vest and chic linen trousers as she enjoys a lavish lunch Selena Gomez shows off her glam and teases a hint of cleavage while wearing a plush white bathrobe in new snaps... after receiving first Emmy nomination Salma Hayek, 57, is ever the brunette bombshell in busty optical illusion dress as she arrives at Miley Cyrus' Gucci bash in LA Sofia Vergara shows off her cleavage and curves in plunging white dress during night out with friends in Italy: 'Happy place' Kim Kardashian reacts as BFF Ivanka Trump gives daughter Arabella a Taylor Swift-inspired cake for her 13th birthday Kate Beckinsale thanks 'warrior queen' Britney Spears for her support after hitting back at trolls: 'Women supporting women is my favorite thing' EXCLUSIVEStrictly plunges into further crisis as it emerges Nadiya Bychkova has made complaint about the show - and has split from Kai Widdrington Anitta showcases her toned figure in an eye-catching string bikini as she takes a dip off a yacht in St. Tropez after wrapping up European tour Whoopi Goldberg attacks Kai Trump's rousing RNC speech about grandfather Donald - urging viewers 'not to fall for it' Coronation Street set to air powerful episode devoted entirely to a day in the life of MND sufferer Paul Foreman in honour of Rob Burrows Jennifer Lopez reveals her washboard abs and ripped physique after hitting a gym in the Hamptons with manager Benny Medina - amid Ben Affleck marriage turmoil Jennifer Garner shares new snaps from San Francisco after meetings for her Once Upon a Farm company Susan Sarandon leads famous faces at premiere of The Fabulous Four... but co-star Bette Midler SKIPS event amid feud rumours Colin Jost makes rare comments about family life with wife Scarlett Johansson and reveals the reason he fell in love with her Jennifer Aniston cuddles up with Reese Witherspoon on The Morning Show set to celebrate their Emmy nods - as series scores most performance nominations for drama Kaia Gerber shows off her comfy model off duty style as she runs errands in NYC - after romantic date night with Austin Butler Bob Newhart dead at 94: Legendary comedian and Elf star passes away after a series of short illnesses Richard Simmons' death did NOT involve foul play insiders insist amid police probe into fitness guru's final hours Strictly hosts Claudia Winkleman and Tess Daly 'vow to stand by the show' after 'abuse' scandal - amid claims pros are 'concerned' about impact Halle Berry, 57, admits she 'hated' Catwoman backlash after DC film flopped in the box office 20 years earlier: 'It's my failure' The ultimate revenge dress! Maya Jama is seen for the first time since shock Stormzy split as she hits the town for a girls' night out in Ibiza Aisling Bea, 40, shows off her baby bump in a knitted dress as she cuddles up to pal Kadiff Kirwan at the opening night of his play The Hot Wing King Armie Hammer admits to carving an 'A' into ex Paige Lorenze's skin with a KNIFE but insists it was 'more like a scrape Love Island fans claim Lola played it 'safe' as she STEALS Reuben over Joey despite flirting up a storm with the former TOWIE star Sabrina Carpenter fans have major complaint as she announces UK and Europe Short n' Sweet tour Euphoria star Barbie Ferreira, 27, cuts a casual figure in a white shirt and denim jeans in LA after unveiling dramatic weight loss Emily Ratajkowski shows off her toned midriff in sporty look before changing into a chic black dress and heels for dinner 'It was the worst!' Sam Smith reveals they were unable to walk after horror skiing accident that left them with 'permanent damage' and anxiety Bob Newhart tributes: Young Sheldon and Big Bang Theory stars join Alec Baldwin and more stars to honor late comic legend after his death at 94 Gisele Bundchen, 43, shows off willowy figure in clinging workout gear while walking her dogs in Miami Kesha holds up cardboard sign that reads: 'I'm single' as she steps out in LA - nine months after getting 'dumped for the first time' Barbra Streisand wishes her husband James Brolin a happy 84th birthday... sharing a sweet throwback snap of them together Lindsay Lohan and Jamie Lee Curtis look outrageous in wild outfits as they film highly-anticipated sequel Freaky Friday 2 Nicolas Cage's son Weston Cage's divorce from wife Hila Cage Coppola has been finalized... following his arrest earlier this month over alleged assault on his mother Davina McCall, 56, receives an honorary degree in the same week daughter Holly, 22, graduates as she shares proud snaps Imelda Staunton is supported by her husband Jim Carter and Bridgerton actress daughter Bessie at the press night for her new show Hello, Dolly! Hannah Waddingham puts on a leggy display in a lace dress as she joins glamorous Claire Sweeney and Jowita Przystal at the opening night of Hello, Dolly! Bob Newhart's family shares emotional tribute to late actor alongside sweet throwback photo with his comedian pal Don Rickles: 'He was deeply loved by all' Mamma Mia star subtly announces marriage to long-term girlfriend after secretly tying the knot at drag queen theme ceremony Kevin Jonas and wife Danielle are 'not ruling out' having a third child after focusing on 'some health time' Pete Davidson's reckless driving case is dismissed... one year after crashing a sports car into a Beverly Hills home Hello Dolly! review: Nifty Imelda's a five star Dolly with the musical wattage of a nuclear power station, writes PATRICK MARMION Yungblud's girlfriend Jesse Jo Stark flashes her lingerie in a very racy sheer dress as the couple attend Dr. Dre and Snoop Dogg party in London Talk about bad timing! Chrishell Stause admits she's going to need a 'drink' as she films Neighbours in Melbourne... as spouse G Flip jets off to New Zealand for their tour Tom Sandoval DROPS lawsuit against Ariana Madix over explicit videos of Rachel Leviss and FIRES his attorney Christopher Reeve's lookalike son Will, 32, reveals how 'nervous' he was filming cameo for Superman: Legacy Chad Michael Murray revs up excitement for Freaky Friday 2 with hunky first look photo of him on a motorcycle - leaving fans hysterical: 'Screaming!' Princess Kate issues new statement hailing the 'power of nature' in supporting 'wellbeing' as she continues cancer treatment Lady Gaga sends fans wild revealing she's back in the studio making new music as she shares snaps from behind the microphone Anna Faris wants a sequel to The House Bunny where she plays a CIA interrogator... revealing that was a 'life-changing role' for her Leigh-Anne Pinnock flashes her abs in a cut-out lime green top as she attends Dr Dre and Snoop Dogg's star-studded Gin and Juice launch Kourtney Kardashian reveals terrifying incident in Australia and why she would NEVER move Down Under - as her big trip with Travis Barker is brought to life Meet Britain's most eligible bachelor. Aristocratic film maker Peter Czernin stands to inherit £3.5billion property fortune Travis Barker's daughter Alabama Barker, 18, admits she takes weight-loss medication... months after clapping back at plastic surgery claims Suspected Emma Watson 'stalker' arrested in Oxford after showing up at the Harry Potter star's college and demanding to see her Jason Donovan cuts a smart casual figure in a navy blazer as he spends quality time with his daughter Jemma at the opening night of Hello, Dolly! Sisters of Mersey review: Hallelujah! Sister Act meets panto in a joyfully saucy Scouse send-up, writes PATRICK MARMION Wendy Williams' relatives claim they're 'denied contact' with talk show host as she turns 60 and 'express their well wishes' CHRISTOPHER STEVENS reviews last night's TV: Computer graphics made this train catastrophe look like a video game Routine training methods...or a step too far? Newly unearthed footage reveals harsh and controversial coaching techniques used on celebs Defiant Alison Hammond laughs off 'fashion faux pas' as she wears skinny jeans for second time this week after Lisa Snowdon slated them Kim Kardashian handpicks Victoria's Secret vet Elsa Hosk, 35, to model her new SKIMS designs... 2 years after hiring Heidi Klum and Tyra Banks Katherine Ryan cuts a stylish figure in a plunging pink satin dress as she leads the star arrivals at the Cooking With The Stars premiere in London Thelma review: Mission Impossible on a mobility scooter, writes BRIAN VINER Ariana Madix and Katie Maloney sued by former Something About Her chef - just one day after Tom Sandoval's lawsuit Kesha is filled with 'gratitude' and 'happiness' over positive reactions to her new single Joyride Cobra Kai surprises fans by revealing Season 6 Part 2 will debut two weeks earlier on November 15 as Part 1 launches on Netflix Daisy Edgar-Jones looks chic in a structured grey mini dress as she models three stylish outfits in one day during Twisters promo tour Twisters review: It may all be gale-force nonsense, but it's very watchable, writes BRIAN VINER Lewis Hamilton shows off his toned arms in a cool knitted vest as he arrives in the paddock ahead of the Hungarian Grand Prix EXCLUSIVEKaty Perry is 'freaking out' over Woman's World flop and holding crisis talks in frantic bid to save her album Eva Longoria displays her incredible figure in a blue bikini as she packs on the PDA with husband Jose Antonio during a beach day in Marbella Julia Fox looks almost unrecognizable as she ditches her blonde hair to model new brunette locks while going makeup-free EPHRAIM HARDCASTLE: Harry's control over the film, television and stage rights to Spare prevents anyone dramatising his controversial memoir Kate Garraway's father 'is rushed to hospital after suffering suspected stroke and heart attack' Get a room! Olivia Rodrigo and boyfriend Louis Partridge pack on the PDA in New York City Little Mix star prepares to release her debut solo single tonight as fans express their excitement Janelle Monáe deletes video of her recreating Michael Jackson's infamous baby-dangling incident after backlash EXCLUSIVEKatie Price to star in her own three-part Netflix series about her colourful life as she follows in the footsteps of the Beckhams and Furys BBC Breakfast's Naga Munchetty fights back tears in emotional interview as Charlie Seyt steps in Priscilla Presley, 79, SUES ex-business associates for financial elder abuse as star claims they stole over $1million from her Christine McGuinness sends temperatures soaring as she flaunts her fit physique in a tiny black bikini as she holidays with musician Roxxxan Renee Zellweger looks loved-up as she cosies up to boyfriend Ant Anstead as the presenter visits her on set of Bridget Jones 4 in Hampstead Padma Lakshmi pays tribute to Top Chef Masters' Naomi Pomeroy after her death aged 49 in tubing accident: 'What a loss to our community' More Strictly drama as show's golden couple Nadiya Bychkova and Kai Widdrington SPLIT after two year relationship Queen Letizia and King Felipe of Spain dazzle in black tie as they attend awards ceremony in Madrid Travis Kelce wraps his arms around Taylor Swift at his potential last Eras Tour show before jetting to Chiefs training camp Sex and the City fans gush over show's most unlikely fashion icon - but who do YOU think has the best sense of style? Antiques Roadshow guest is left stunned by valuation of family heirloom oil painting Khloe Kardashian flashes her bra in a sheer gown as she arrives to Andrea Bocelli's 30th Anniversary concert with sister Kim Taylor Swift's stalker is detained while trying to attend Eras Tour in Germany after 'making threats' against her on social media Aurora Culpo labels Bethenny Frankel 'bitter' and 'petty' for leaking that Paul Bernon dumped her after two months Kim Kardashian is a blonde bombshell resembling Marilyn Monroe in new Balenciaga ad... 2 years after BDSM child photo controversy Gisele Bundchen reveals her family's 'favorite healthy snack' that helps keep her feeling great... after she was seen working out with Joaquim Valente Strictly bosses confirm future of show after professional dancers Giovanni Pernice and Graziano Di Prima's conduct was called into question Lori Harvey models a black dress that is innocent in the front but naughty in the back as she flashes sideboob and her butt in France Shannen Doherty's contentious divorce from Kurt Iswarienko finalized by family law judge two days AFTER her death Gogglebox's Stephen Webb, 52, shows off his weight loss in shirtless snap - after low testosterone levels left him feeling 'anxious and lethargic' Emily In Paris casts legendary actor to appear in fourth season alongside Lily Collins as hit Netflix show airs in a matter of weeks REVEALED: Zara McDermott's telling three-word nickname for Strictly's Graziano Di Prima... as professional is accused of 'kicking and hitting' star Euphoria star Barbie Ferreira looks unrecognizable in latest social post as fans speculate she's taking Ozempic Sabrina Carpenter is coming to the UK and Europe! Espresso singer announces new Short n' Sweet tour dates in 2025 sending fans wild Rihanna says she's 'proud' of inking MAJOR new Fenty Beauty deal with Paris Olympics and Paralympic Games Rebekah Vardy gives a cheeky flash of her bottom in a black thong bikini as she enjoys a family holiday in Marbella Amanda Holden baffles radio audience with strange hidden 'talent' leaving her co-star Jamie Theakston in stitches EXCLUSIVEKate Winslet's Titanic 'sinking coat' expected to fetch staggering price at upcoming Hollywood auction Luke Littler, 17, 'SPLITS with his girlfriend Eloise Milburn, 21,' - with darts sensation 'very upset' after relationship comes to an end The Howard Stern Show veteran Robin Quivers talks about embracing her hair loss amid cancer battle: 'It's my normal hairdo' Daisy May Cooper steps back from Never Mind The Buzzcocks after welcoming her third child as new A-list guest captains are revealed Love Island SPOILER: Joey Essex stirs the pot as he reveals Mimii's secret mission to get Ayo up to the terrace during a game of Couple Goals Brad Pitt and Angelina Jolie 'had disagreements over how to raise their six children' during their brief marriage Strictly bosses 'gagged Angela Rippon from speaking about bloody injury she got during training' as 'controlling' show bosses are slammed Bikini-clad Lizzie Cundy, 56, and Bruno Tonioli, 68, flaunt their toned abs in skimpy swimwear as they soak up the sun on holiday together in Mykonos Inside Rav Wilding's VERY chequered love life: From a dramatic romance with Chantelle Houghton to the wife who 'saved him' after a turbulent time Kate Hudson dishes on dating Nick Jonas when she was 36 and he was 23 in candid interview: 'He's like an old man in a young man's body' Shannen Doherty extended an olive branch to longtime frenemy Alyssa Milano ahead of death at age 53 EXCLUSIVEIs this Strictly's #MeToo? Male professional dancers are reportedly 'very concerned' about how abuse allegations could impact them Love Island's Molly Smith flashes her abs in a crop top following gym session after revealing boyfriend Tom Clare has moved in with her EXCLUSIVEZara Tindall reveals her favourite horse racing festival and why being a spectator is more nerve-wracking than being a competitor Sienna Miller enjoys a stroll with boyfriend Oli Green as they bump into pregnant model Adwoa Aboah in Notting Hill Katie Price admits she was forced to have ANOTHER of her pets put to sleep just five months after bringing them home Lady Lola Bute joins Sienna Miller at glamorous society wedding for son of Pret founder Julian Metcalfe Richard Madeley weighs in on Strictly drama as he claims 'people have known about the issues for years and years' as the scandal deepens Kourtney Kardashian's secret family heartbreak revealed as son Mason, 14, refuses to join her in Australia with her new husband Travis Barker David Beckham celebrates with a glass of red wine as he relaxes with Victoria and his family on their luxury yacht in Sardinia after receiving five Emmy nominations for Netflix documentary Ex-Strictly pro Giovanni Pernice gives a thumbs up during latest tour stop as chaos continues to surround the BBC show following suspension Kim Kardashian reveals one of her sons has the rare skin disorder vitiligo where patches of skin lose pigment Today's headlines Most Read Strictly on FIRE! BBC show creaking as Amanda Abbington breaks her silence to claim Giovanni Pernice was... Brit eco-explorer and husband's yacht 'smashed by tanker or capsized due to weight of its solar panels',... 'Miracle' trial claims severe autism can be reversed with symptoms reduced to an indistinguishable level... PETER HITCHENS: Sacking old peers will lead to President Blair getting a 21-gun salute Risks of popular laser eye surgery may be MUCH higher than clinics claim: Everything you should know about... Hyde Park's Albert Memorial which was built in 1872 to honour Queen Victoria's husband is 'considered... ANNE WIDDECOMBE: I'm close to losing it with all the whingeing, whining and cries of misogyny from Strictly... Airlines DON'T have to pay for disruption caused by global IT outage that paralysed global transport network... It's time for this Lucy Letby is innocent madness to stop: I sat through almost every day of her two trials.... DAN HODGES: Keir's no Che Guevara. This is a King's Speech that would have had Mrs Thatcher purring EU 'will demand access to UK fishing waters' in return for a closer relationship with Britain in fresh... SAUCY SECRETS: I am 26 and have a huge crush on my live-in landlord - he's 50, and super hot. Should I make... The world's fastest double take: Sprinters and identical twins Laviai and Lina Nielsen from London are among... BEL MOONEY: My leering husband makes me despair for all women Jay Slater's GoFundMe appeal tops £70,000 as money keeps pouring in for family determined to fly his body... ROSIE GREEN: How mole-mapping could save your life LIZ JONES'S DIARY: In which I have a panic attack Evil on our streets: Brazen thugs torch a double-decker, overturn police cars and pelt officers with rocks -... Leeds riots: Sobbing father breaks down and begs for his children back after Roma crowd take to streets... Man, 37, charged with violent disorder and arson in relation to riots in Leeds on Thursday which saw a bus... Revealed: 12 organised crime gangs are behind a quarter of all shoplifting in England and Wales, with some... Former Cabinet Minister to spearhead campaign raising questions over the conviction of killer nurse Lucy... Melania Trump's hilarious reaction to Kid Rock's RNC performance has fans in tears: 'Wait, this isn't a... Internet in uproar as Donald Trump Jr. is seen on camera calling his teenage daughter Kai 'sexy' Damning new Secret Service whistleblower claims about Trump shooting reveal staffing crisis, untrained... Trump reveals the Democratic candidate he wants to run against and gives his thoughts on Project 2025 at... FRANK GARDNER: Your gunshot injuries were not as serious as mine... but the scale of the trauma you still... CAROLINE GRAHAM meets Trump true believers in Milwaukee: 'He's our own very American messiah - and his... MAUREEN CALLAHAN: After surviving a history shattering week that nearly tore us apart, America now faces a... Horror as mother's car is 'deliberately set alight' with her two children still inside - as police arrest... Rapists who lured two women back to house party and sexually attacked them are jailed for total of 20 years... Pub boss forced to close blames customers working from home for turning historic city into a 'ghost town' How to unprocess your diet in 30 days: Just follow these steps to cut back on ultra-processed food - it's... The Park Lane shanty town: Amid the £40m houses and luxury supercars, a new tent city is flourishing in one... Inside Ray Reardon's scandalous love life: from walking out on first wife to pursuing an eight-year affair,... Jay Slater, the £60k GoFundMe and the truth behind the final tragic chapter: FRED KELLY investigates Brad Pitt REFUSES to drop lawsuit against Angelina Jolie after she 'painted herself as a peacemaker' in... Prince and Princess of Wales are hiring a new private secretary to organise the royals' UK engagements (but... Strictly's Anton Du Beke seen for first time since being dragged into misconduct scandal after breaking his... Strictly Come Dancing judge Craig Revel Horwood breaks his silence on misconduct allegations and admits 'it... Zara McDermott and boyfriend Sam Thompson are giving relationship 'one last shot' following weeks of 'crisis... Strictly: The worst case scenario. Even BBC bosses worry it could be the end as yet more complaints emerge... Strictly star Graziano Di Prima's 'very concerned' family are stunned by his sacking and 'rallying around... All the stars who struggled on Strictly: As Zara McDermott and Amanda Abbington call out their 'abusive' pro... Dramatic video shows devastating Israeli air strikes on 'military targets' in Houthi-controlled Yemen in... Woman recalls witnessing her abusive father brutally beating her mother - and the shock impact the heinous... Chancellor Rachel Reeves pledges to kickstart 'big bang on growth' by boosting Britons' pension pots,... RACHEL REEVES: My mission to aid investment, boost pensions - and to spread prosperity to all Alabama father 'shoots dead his wife and four children under the age of 10' at pastor's home after kid's... INSIDE WESTMINSTER: Why Rayner won't get a chance to lead her red revolution MORE HEADLINES Ben Needham's mother faces agonising wait to see if DNA results will confirm if a Danish man is her son - 33 years after he disappeared on the island of Kos Leeds riots: Sobbing father breaks down and begs for his children back after Roma crowd take to streets again following night of terrifying violence Four-day Swingathon sex festival in quaint Lincolnshire hamlet continues with fun in the hot tub, a fancy dress theme and body painting Millions of Tesco Clubcard holders to get up to £100 - but are YOU eligible for some free points? Twisted teen killer: How warped 16-year-old boy murdered baby in messy Derbyshire flat before smirking and swearing in chilling police interview despite shaking tot so hard he suffered whiplash Crowdstrike chaos spreads to Dover: Hundreds of ticketless families c","summary":"The UK's air passenger watchdog wrote to airlines to say that it believed the global meltdown was an 'extraordinary circumstance' exempt from standard refund policies.","url":"https://www.dailymail.co.uk/news/article-13655315/airlines-wont-pay-disruption-global-outage-transport.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/07/20/18/87570209-0-image-a-33_1721496187564.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/07/20/4276178334656843756/1024x576_MP4_4276178334656843756.mp4","publish_date":"2024-07-20 23:44:05","author":"Editor,Jon Brady,Ryan Prosser","authors":["Editor","Jon Brady","Ryan Prosser"],"language":"en","source_country":"GB","sentiment":0.172},{"id":252247554,"title":"Trump holds first rally after attempt on life, Vance by his side","text":"“I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said before Trump’s arrival. Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, lashing out at his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience. At one point, Trump glanced at a screen showing him from an unusual angle and joked about his comb over. “That’s a severe sucker. What’s with that one?” he said. “I apologise. Man! I looked up there, I said, ‘Whoa!’ That’s like a work of art!”","summary":"Donald Trump addressed a Michigan rally exactly a week after he was shot. Not much has changed.","url":"https://www.smh.com.au/world/north-america/trump-holds-first-rally-after-attempt-on-life-vance-by-his-side-20240721-p5jv98.html","image":"https://static.ffx.io/images/$zoom_0.29085397897897897%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_131%2C$y_192/t_crop_custom/q_86%2Cf_auto/5d773043e40eec05275d0846a6ef4092f8601d8f","video":null,"publish_date":"2024-07-20 23:42:10","author":"Jill Colvin,Joey Cappelletti","authors":["Jill Colvin","Joey Cappelletti"],"language":"en","source_country":"au","sentiment":-0.134},{"id":252247892,"title":"Trump holds first rally after attempt on life, Vance by his side","text":"“I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said before Trump’s arrival. Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, lashing out at his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience. At one point, Trump glanced at a screen showing him from an unusual angle and joked about his comb over. “That’s a severe sucker. What’s with that one?” he said. “I apologise. Man! I looked up there, I said, ‘Whoa!’ That’s like a work of art!”","summary":"Donald Trump addressed a Michigan rally exactly a week after he was shot. Not much has changed.","url":"https://www.theage.com.au/world/north-america/trump-holds-first-rally-after-attempt-on-life-vance-by-his-side-20240721-p5jv98.html","image":"https://static.ffx.io/images/$zoom_0.29085397897897897%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_131%2C$y_192/t_crop_custom/q_86%2Cf_auto/5d773043e40eec05275d0846a6ef4092f8601d8f","video":null,"publish_date":"2024-07-20 23:42:10","author":"Jill Colvin,Joey Cappelletti","authors":["Jill Colvin","Joey Cappelletti"],"language":"en","source_country":"au","sentiment":-0.134},{"id":252247660,"title":"Trump says he 'took a bullet for democracy' in first campaign rally since assassination attempt","text":"In his first campaign rally since a shooter made an attempt on his life, Donald Trump has declared he \"took a bullet for democracy\". The Republican presidential candidate held an event in Grand Rapids, Michigan, just seven days after surviving an assassination attempt at another rally in Pennsylvania. He was joined by his newly minted running mate JD Vance, who along with Mr Trump was officially nominated by the party at this week's Republican National Convention (RNC). Supporters began lining up outside the Van Andel arena from 6am local time, forming lines that snaked around 10 city blocks. In an almost two-hour speech, Mr Trump revisited the attempt on his life, criticised President Joe Biden, and attempted to distance himself from \"extremists\" on the far-right. Taking a less sombre tone than in his acceptance speech at the RNC, Mr Trump spoke about the assassination attempt, again crediting a sign for saving his life. \"It was exactly one week ago, even to the hour, even to the minute,\" he began his speech. Mr Trump told his supporters on Thursday night (local time) that he would only recount what had happened once, as it was \"too painful\" to revisit. He explained that in the seconds before a bullet grazed his ear, he had turned his head to the right to look at a chart titled \"illegal immigration into the US\". In front of the Grand Rapids crowd, he brought up that chart again, declaring: \"I owe immigration my life.\" Mr Trump went on to describe the conservative think tank Project 2025, which is aiming to shape the policy of a second Trump presidency, as a group on the \"severe right\" with \"radical\" ideas. \"I don't know what the hell it is. I don't know anything about it. I don't want to know anything about it,\" he said. Mr Trump also invited Michigan's Republican candidates for the Senate, Sandy Pensler and Mike Rogers, to the stage. Mr Pensler told the crowd he was ending his campaign bid to make way for Mr Rogers. Mr Rogers thanked his opponent and Mr Trump for their endorsement, telling the presidential candidate: \"It wasn't that the bullet took you to the ground, it was the fact that you got back up for America.\" In a speech that returned to the typical tone of a Trump election rally, the former president took aim at the Biden administration and made jokes about the Democratic campaign. At one point, he conducted a straw poll with his fans, asking them to cheer to indicate who they'd rather see him run against at the election in November. At the mention of Vice-President Kamala Harris, the crowd booed, and then erupted into cheers when he asked if they'd like to see him run against Mr Biden. It comes as pressure mounts on Mr Biden to drop out of the race and allow someone else to replace him at the top of the party's ticket. More than 30 congressional Democrats have spoken out publicly calling on Mr Biden to consider stepping aside.","summary":"Republican presidential candidate Donald Trump holds his first campaign event since the attempt on his life, telling a crowd of supporters he \"took a bullet for democracy\".","url":"https://www.abc.net.au/news/2024-07-21/trump-campaign-rally-grand-rapids/104123232","image":"https://live-production.wcms.abc-cdn.net.au/0328ef4aed94f94a18138d66b69a9512?impolicy=wcms_crop_resize&cropH=1618&cropW=2877&xPos=0&yPos=156&width=862&height=485","video":null,"publish_date":"2024-07-20 23:39:49","author":"Lucy Sweeney","authors":["Lucy Sweeney"],"language":"en","catgory":"politics","source_country":"AU","sentiment":-0.485},{"id":252248062,"title":"Secret Service honchos denied Trump additional security for 2 years before assassination attempt: damning report","text":"Secret Service officials rejected Donald Trump’s request for additional security in the two years before last weekend’s assassination attempt, a damning report revealed Saturday. The ex-president, 78, asked for more agents and magnetometers at large public events he attended, as well as snipers for outdoor venues, four insiders told The Washington Post. Each request was shot down by senior officials who claimed the agency lacked the resources Trump was asking for, the outlet reported. Trump was receiving a lesser level of protection afforded to former presidents and major party presidential candidates when 20-year-old gunman Matthew Thomas Crooks opened fire at his rally in Pennsylvania last Saturday. This is a developing story, Please check back for updates.","summary":"Secret Service officials rejected Donald Trump's request for additional security in the two years before last weekend's assassination attempt, a damning report revealed Saturday.","url":"https://nypost.com/2024/07/20/us-news/secret-service-honchos-denied-trump-additional-security-for-2-years-before-assassination-attempt-damning-report-reveals/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/trump-comp1_6957af.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/YPaeFVyf-RyIcpnTz.mp4","publish_date":"2024-07-20 23:36:57","author":"Katherine Donlevy","authors":["Katherine Donlevy"],"language":"en","source_country":"us","sentiment":-0.263},{"id":252247802,"title":"Biden Admin Hits Back At Attacks On Women Secret Service Agents","text":"The US homeland security chief hit back Saturday at misogynistic attacks on the women Secret Service agents who threw themselves into the line of fire to protect Donald Trump from a would-be assassin. \"These assertions are baseless and insulting,\" Alejandro Mayorkas said in a statement after the some on the US political right accused the Secret Service of \"woke\" hiring practices they say nearly got the former president killed. He praised the \"highly skilled and trained\" women serving at every level of law enforcement across the country for risking \"their lives on the front lines for the safety and security of others.\" \"They are brave and selfless patriots who deserve our gratitude and respect,\" he wrote. The Department of Homeland Security will \"with great pride, focus and devotion to mission, continue to recruit, retain and elevate women in our law enforcement ranks. Our Department will be the better for it, and our country more secure,\" he continued. In the week since a gunman opened fire during a Trump rally in Pennsylvania, killing one bystander, wounding two others and leaving the Republican bloodied but alive, right-wingers have unleashed a torrent of criticism on the Secret Service for having women in its ranks. Several women can be seen among the black-suited, sunglasses-clad agents racing to shield Trump with their bodies as the gunshots ring out at the rally, before hustling him from the stage and into a waiting car and safety. But they, along with their boss Kimberly Cheatle -- only the second-ever woman director of the federal agency tasked with protecting presidents current, former and would-be -- are now caught in the intense scrutiny over the nearly catastrophic attack. \"There should not be any women in the Secret Service. These are supposed to be the very best, and none of the very best at this job are women,\" right-wing activist Matt Walsh wrote on X, in one typical post. Many of the attacks cited DEI -- diversity, equity and inclusivity -- hiring practices that some Republicans have long criticized as discriminating against white people, white men in particular. \"The results of DEI. DEI got someone killed,\" read one post on the popular Libs of TikTok account. The Secret Service has defended itself against such accusations in the past, with a spokesman telling US media just weeks before the assassination attempt that agents \"are held to the highest professional standards... at no time has the agency lowered these standards.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The US homeland security chief hit back Saturday at misogynistic attacks on the women Secret Service agents who threw themselves into the line of fire to protect Donald Trump from a would-be assassin.","url":"https://www.ndtv.com/world-news/brave-patriots-biden-admin-hits-back-at-attacks-on-women-secret-service-agents-6151374","image":"https://c.ndtvimg.com/2024-07/eutnrp9_us-secret-service-in-trump-assassination-bid-afp_625x300_17_July_24.jpeg","video":null,"publish_date":"2024-07-20 23:35:05","author":null,"language":"en","catgory":"politics","source_country":"in","sentiment":-0.083},{"id":252247422,"title":"Doctor Says Trump Is OK After ‘2 cm Wide Wound’ to Ear","text":"A week after a shooter injured Donald Trump’s ear at his rally in Butler, Pennsylvania, the former president’s campaign released the first public update on his health. Rep. Ronny Jackson (R-Texas), who served as Trump’s physician in the White House, wrote in a letter that the would-be assassin’s bullet came “less than a quarter of an inch from entering his head, and struck the top of his right ear,” noting that it “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear.” “There was initially significant bleeding, followed by marked swelling of the entire upper ear,” he continued. “The swelling has since resolved, and the wound is beginning to granulate and heal properly. Based on the highly vascular nature of the ear, there is still intermittent bleeding requiring a dressing to be in place. Given the broad and blunt nature of the wound itself, no sutures were required.” Trump wore a bandage on his ear throughout the Republican National Convention in Milwaukee this week. Some convention attendees donned their own bandages in solidarity with the former president. At least one vendor sold American flag-themed earpieces. In his convention speech, Trump recounted what the shooting felt like, saying: “I heard a loud whizzing sound and felt something hit me really, really hard on my right ear. I said to myself, wow, what was that, it can only be a bullet, and moved my right hand to my ear, brought it down. My hand was covered with blood. Just absolutely blood all over the place.” Jackson concluded in his letter that Trump “is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” adding: “It is an absolute miracle he wasn’t killed.” The shooter, identified as 20-year-old Thomas Matthew Crooks, reportedly used an AR-15 style rifle. One rally attendee was killed in the shooting. Two attendees were critically injured.","summary":"Donald Trump’s campaign gave the first update on his health in the wake of the shooting at his Pennsylvania rally last week","url":"https://www.rollingstone.com/politics/politics-news/doctor-update-trump-2-cm-wide-wound-to-ear-1235064603/","image":"https://www.rollingstone.com/wp-content/uploads/2024/07/GettyImages-2161923127.jpg","video":null,"publish_date":"2024-07-20 23:33:06","author":"Andrew Perez,Maria Fontoura","authors":["Andrew Perez","Maria Fontoura"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.687},{"id":252248098,"title":"Gunman in Trump rally attack flew drone over rally site in advance of event, official says","text":"WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday’s shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump’s appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead...","url":"https://wsvn.com/news/politics/gunman-in-trump-rally-attack-flew-drone-over-rally-site-in-advance-of-event-official-says/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/07/240714_Thomas_Crooks_Pennsylvania_rally_gunman.jpg?quality=60&strip=color","video":null,"publish_date":"2024-07-20 23:32:38","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.51},{"id":252247514,"title":"Trump says he 'took a bullet for democracy' at massive battleground state rally alongside running mate Vance","text":"GRAND RAPIDS, Mich. — Former President Donald Trump declared Saturday that he \"took a bullet for democracy\" while firing up a crowd of voters in Grand Rapids, Michigan, at his first rally since surviving an assassination attempt last week. More than 12,000 people piled into the Van Andel Arena, home to the Grand Rapids Griffins hockey team, to see him and his running mate, Ohio Sen. JD Vance, who are coming off a packed week at the Republican National Convention (RNC) in Milwaukee, where each accepted their respective nominations to appear on the GOP ticket together. \"They keep saying he's a threat to democracy. I'm saying, ‘’What the hell did I do to democracy?' Last week I took a bullet for democracy,\" Trump said as the crowd cheered, referencing an often used Democrat talking point. \"What did I do against democracy? Crazy.\" WATCH: THOUSANDS DESCEND ON MICHIGAN TOWN FOR FIRST TRUMP RALLY SINCE FAILED ASSASSINATION ATTEMPT Vance spoke ahead of Trump, and dedicated part of his time on stage to slamming Vice President Kamala Harris, asking rallygoers \"what the hell\" she has ever done and noting his own service as a U.S. Marine. \"I've served in the United States Marine Corps … What the hell have you done?\" Vance said. \"What has she done other than collect a check from her political offices?\" he asked, before going on to talk about his grandmother, who he calls \"Mamaw,\" and his upbringing. Harris ripped Vance after his Wednesday speech at the RNC in which he accepted his role on the 2024 ticket. \"It was compelling. It’s a compelling story. But it’s not the full story,\" Harris said after Vance's RNC speech. \"Frankly, what is very telling is what he did not talk about on that stage. He did not talk about Project 2025, the 900-page blueprint for a second term. He did not talk about it because their plans are extreme, and they are divisive.\" RNC DELEGATES, GUESTS MAKE PREDICTIONS ABOUT BIDEN'S POLITICAL FUTURE AMID REPORTS HE MIGHT EXIT 2024 RACE Vance later spoke to rallygoers about the various challenges facing the nation under President Biden's administration, including the fentanyl crisis, the border crisis and the economy. Trump took the stage after Vance, beginning his speech by saying that he \"shouldn't be here right now, but something very, something very special happened.\" He took a moment to recognize the supporters who were injured or killed at the rally last week. \"We continue to pray for the recovery of the two citizens who were wounded in that evil attack – David Dutch and James Copenhaver, two really incredible people,\" the Republican frontrunner said. \"We remain in contact and send our deepest respect to the families.\" ALINA HABBA TAKES ON MAJOR ROLE IN TRUMP CAMPAIGN, DISHES ON HIS HIGHLY ANTICIPATED RNC SPEECH Trump also acknowledged the death of Corey Comparatore, calling him a \"hero\" for protecting his family from the bullets. \"Corey Comparatore was a brave firefighter who died, [his] funeral [was] yesterday,\" Trump said. \"Corey was a hero. And we will carry his memory in our hearts for all time.\" Later in his speech, Trump conducted a \"poll\" with the audience members about who should become the Democratic nominee if President Biden steps down from the race. \"We're going to do a poll, and it's going to be a very nice poll and great. Who is your favorite candidate? Who would you like?\" Trump said. GOV. WHITMER TELLS ‘THE VIEW’ SHE NEVER SAID MICHIGAN’S UNWINNABLE FOR BIDEN: ‘CRAZIEST THING TO THINK’ \"So who would you like to most run against, if you're us, if we want to win? Ready? Kamala Harris? Crooked Joe Biden?\" Trump asked. The audience booed louder in response to Biden. The former president also slammed Michigan Gov. Gretchen Whitmer, calling her a \"terrible\" leader. \"Well, you have a terrible governor here who did a terrible job. Whitmer – I'd like to run against her, actually,\" Trump laughed. CLICK HERE TO GET THE FOX NEWS APP Michigan is expected to be one of the most closely watched battleground states in November, and could narrowly determine who will serve the American people in the White House for the next four years. Polls have largely suggested Trump leads Biden in every battleground state, as well as in some states that have trended more Democratic in recent years. That comes as a growing number of Democrats call for Biden to step aside from the 2024 race, in favor of Harris or another candidate. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Thousands have gathered in Michigan for a joint rally with former President Trump and his running mate, JD Vance, the first since a failed assassination attempt last week against Trump.","url":"https://www.foxnews.com/politics/trump-says-took-bullet-democracy-massive-battleground-state-rally-alongside-running-mate-vance","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/AP24202794649570.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-20 23:31:14","author":"Andrea Vacchiano,Brandon Gillespie","authors":["Andrea Vacchiano","Brandon Gillespie"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.02},{"id":252247812,"title":"Donald Trump Wears Small Band-Aid on Ear During Michigan Rally","text":"It's a pretty boilerplate rally for Trump ... who's moving on from last week's attempt on his life at his rally in Butler, PA. 20-year-old Thomas Matthew Crooks skimmed his right ear, killed an attendee and injured two others in the shocking incident.","summary":"Donald Trump's clearly recovering quickly ... 'cause his bandages are getting a heck of a lot smaller -- trading in the big white gauze for a tiny skin-colored band-aid. The leading Republican candidate took the stage for his Grand Rapids, Michigan&hellip;","url":"https://www.tmz.com/2024/07/20/donald-trump-rally-bandage-bandaid-bullet-injured/","image":"https://imagez.tmz.com/image/fa/4by3/2024/07/20/faaa28a610ed469f9fa6340bc304630a_xl.jpg","video":null,"publish_date":"2024-07-20 23:27:35","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.605},{"id":252248184,"title":"House Homeland Security Committee chairman to visit Trump shooting site Monday","text":"House Homeland Security Committee Chairman Mark Green (R-TN) is scheduled to visit the site of the assassination attempt on former President Donald Trump on Monday, according to a press release from the committee. Green and 10 other committee members will tour the grounds in Butler, Pennsylvania, where Trump held a campaign rally that was quickly interrupted by a gunman who took aim at the former president, grazing his right ear, killing one person, and injuring two more. “This Committee continues to seek answers from DHS and Secret Service for the security lapses resulting in the near-assassination of former President Trump and the tragic murder of Corey Comperatore,” Green said in the release. “We will visit the site on Monday morning to better understand how this near-assassination took place.” The committee members’ visit to Butler will come after Green invited Homeland Security Secretary Alejandro Mayorkas, Secret Service Director Kimberly Cheatle, and FBI Director Christopher Wray to testify Tuesday on Capitol Hill. Wray declined his invitation to testify. Mayorkas has yet to respond and has since been subpoenaed by the committee. Cheatle received a subpoena, with which she has agreed to comply, from the House Oversight and Accountability Committee, before which she is scheduled to testify Monday. The Butler visit is scheduled for 11:30 a.m. Monday, and Green will address the media at 12:45 p.m. “to inform the public of the Committee’s oversight investigation into the security lapses of that day,” according to the release.","summary":"House Homeland Security Committee Chairman Mark Green (R-TN) is scheduled to visit the site of the assassination attempt on former President Donald Trump on Monday, according to a press release from the committee. Green and 10 other committee members will tour the grounds in Butler, Pennsylvania, where Trump held a campaign rally that was quickly [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3092462/homeland-security-chairman-to-visit-trump-shooting-site/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/mark-green-republican.webp","video":null,"publish_date":"2024-07-20 23:25:29","author":"Robert Stewart","authors":["Robert Stewart"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.38},{"id":252247472,"title":"What the papers say – July 21","text":"Sunday’s newspapers feature a wide range of topics including education, Brexit, Strictly Come Dancing and food nostalgia. The Sunday Telegraph reveals that Prime Minister Sir Keir Starmer is poised to give teachers and nurses pay rises above inflation. Further education is the focus of The Sunday Times which says the Government is being urged to introduce a rescue package to stop universities facing a financial “catastrophe”. The Independent turns its attention to the probation service with a warning from the head of the watchdog that it is failing in 97% of areas ahead of the release of prisoners early to ease overcrowding. The Sunday Express returns to the topic of Europe, saying the Government has been accused of a “great Brexit betrayal” over plans to overhaul product safety rules in line with the EU. Safety fears for politicians in the wake of increased threats and the assassination attempt on former US president Donald Trump has seen panic alarms given to all new MPs, according to the Mail on Sunday. The Sunday People says CrowdStrike, the security company behind Friday’s global IT outage, has worked alongside GCHQ. The scandal engulfing Strictly Come Dancing continues to occupy front pages with the Sunday Mirror saying claims of bullying have been made against a female professional dancer. The Sun on Sunday also focuses on Strictly as it leads with former dancer Giovanni Pernice and the BBC’s investigation into the issue. And the Daily Star Sunday hears from Red Dwarf star Craig Charles about why we should return to eating “classics” from the 1970s.","summary":"Education, Brexit, Strictly Come Dancing and food nostalgia all feature on Sunday’s front pages.","url":"https://www.standard.co.uk/news/uk/keir-starmer-brexit-the-sunday-times-the-telegraph-giovanni-pernice-b1171923.html","image":"https://static.standard.co.uk/2024/07/21/00/21ed4b663c2ab87e3f2f46069a6ca888Y29udGVudHNlYXJjaGFwaSwxNzIxNjAyNTAz-2.33243397.jpg?width=1200","video":null,"publish_date":"2024-07-20 23:23:03","author":"Pa Reporter","authors":["Pa Reporter"],"language":"en","source_country":"gb","sentiment":-0.166},{"id":252248100,"title":"Trump campaign releases letter on his injury, treatment after last week’s assassination attempt","text":"NEW YORK (AP) — Donald Trump’s campaign released an update on the former president’s health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania. The memo, from Texas Rep. Ronny Jackson, who served as Trump’s White House physician, offers new details on the nature of the GOP nominee’s injuries and the treatment he received in the immediate aftermath of the attack. According to Jackson, Trump sustained a gunshot wound to the right ear from a high-powered riffle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” The bullet track, he said, “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear. There was initially significant bleeding, followed by marked swelling of the entire upper ear.” While the swelling has since resolved and the wound “is beginning to granulate and heal properly,” he said Trump is still experiencing intermittent bleeding, requiring the dressing that was on display at last week’s Republican National Convention. At Saturday’s rally, the white gauze on Trump’s ear was replaced by a skin-colored bandage. “Given the broad and blunt nature of the wound itself, no sutures were required,” Jackson wrote. Trump was initially treated by medical staff at Butler Memorial Hospital. According to Jackson, doctors “provided a thorough evaluation for additional injuries that included a CT of his head.” Trump, he said, “will have further evaluations, including a comprehensive hearing exam, as needed. He will follow up with his primary care physician, as directed by the doctors that initially evaluated him,” he wrote. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” he added. The letter is the first official update about the former president’s condition since the night of the shooting. Jackson, a staunch Trump supporter, said in the letter that, as Trump’s former doctor, he was deeply concerned about the former president’s wellbeing in the aftermath of the attack and met him in Bedminster, New Jersey, late Saturday after Trump returned from Pennsylvania “to personally check on him, and offer my assistance in any way possible.” He said he has been with Trump since that time, evaluating and treating his wound daily. That includes traveling with him Saturday to Michigan, where the former president will hold his first rally since the shooting, joined by his newly named running mate, Ohio Sen. JD Vance. Jackson appears to be licensed to practice medicine in Florida, according to a state health department database. Records from the American Board of Emergency Medicine also show that Jackson has a certification in Emergency Medicine, valid through the end of 2025. A spokesperson for the congressman did not immediately provide a response and Trump campaign’s did not immediately respond to questions. Last year, Trump’s campaign released a letter on President Joe Biden’s 81st birthday from Dr. Bruce A. Aronwald, a New Jersey physician, who said he had been the former president’s doctor since 2021. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"NEW YORK (AP) — Donald Trump&#8217;s campaign released an update on the former president&#8217;s health Saturday, one week after he survived an attempted assassination at a rally...","url":"https://wsvn.com/news/politics/trump-campaign-releases-letter-on-his-injury-treatment-after-last-weeks-assassination-attempt/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/07/240715_Trump_bandaged_ear_RNC.jpg?quality=60&strip=color","video":null,"publish_date":"2024-07-20 23:18:39","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":-0.12},{"id":252247322,"title":"Trump, Vance hold first joint campaign rally","text":"Trump, Vance hold first joint campaign rally President Donald Trump and his new running mate, Sen. JD Vance, were holding a campaign rally in the battleground state of Michigan Saturday. With Saturday's event, the Trump campaign is signaling their path to victory runs through the Midwest. Caitlin Huey-Burns reports.","summary":"President Donald Trump and his new running mate, Sen. JD Vance, were holding a campaign rally in the battleground state of Michigan Saturday. With Saturday's event, the Trump campaign is signaling their path to victory runs through the Midwest. Caitlin Huey-Burns reports.","url":"https://www.cbsnews.com/video/trump-vance-hold-first-joint-campaign-rally/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/20/53a85f69-2c69-4673-bec8-95a4d0d6f3dc/thumbnail/1200x630/a22f9a75bd0e55309804b198cacb92fa/chburns.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d","video":null,"publish_date":"2024-07-20 23:17:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.31},{"id":252247190,"title":"Trump removes white dressing from his wounded ear","text":"NEW YORK, July 21. /TASS/. Former US President Donald Trump removed a white dressing that covered his wounded right ear after the failed assassination attempt when he stood before a rally of his supporters in Grand Rapids, Michigan. Instead of the dressing, which Trump wore during the Republican National Convention in Milwaukee, Wisconsin, his right ear is now covered by a small bandage. At the start of the rally, Trump criticized those who claimed that he was a threat to democracy. \"They keep saying [I'm] a threat to democracy. I'm saying: what the hell did I do for democracy? Last week, I took a bullet for democracy,\" he said The assassination attempt on Trump took place on July 13 at an election rally in Butler, Pennsylvania. A bullet grazed the ex-president’s ear, while one of his supporters was killed in the shooting. The attacker, 20-year-old Thomas Matthew Crooks, was killed by Secret Service officers.","summary":"Instead of the dressing his right ear is now covered by a small bandage","url":"https://tass.com/society/1819331","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2024-07-20 23:16:17","author":"Tass","authors":["Tass"],"language":"en","catgory":"politics","source_country":"ru","sentiment":-0.722},{"id":252247454,"title":"Alyssa Farah Griffin Once Took a Jab at Ex-Boss Donald Trump Over His 'Thirstiest' Post Ever","text":"Former Trump White House communications director Alyssa Farah Griffin once took a jab at her ex-boss over what she called his 'thirstiest' social media post ever. The incident unfolded on Super Bowl Sunday when Donald Trump posted a message on his Truth Social platform about Taylor Swift and Travis Kelce. Griffin, now a co-host on ABC's The View, didn't hold back in her critique. She offered a blunt summary of Trump's message on the broadcast. She started by saying, \"Can I mention my one Super Bowl highlight that we didn't get to? And I hate to interject politics... Donald Trump sent out the thirstiest tweet—er, 'Truth'—of all time, basically saying, 'Taylor Swift should like me and I think Travis Kelce should, too.' It was the funniest thing.\" She added, \"I was losing my mind over it. [Trump] knows how powerful they both are as an entity, and it was just the saddest thing I've seen,\" as per Newsweek. Trump wrote, \"I signed and was responsible for the Music Modernization Act for Taylor Swift and all other Musical Artists. Joe Biden didn't do anything for Taylor and never will. There's no way she could endorse Crooked Joe Biden, the worst and most corrupt President in the History of our Country, and be disloyal to the man who made her so much money.\" He continued, \"Besides that, I like her boyfriend, Travis, even though he may be a Liberal, and probably can't stand me!\" The timing of Trump's post coincided with baseless right-wing claims that Swift's relationship with Kansas City Chiefs tight end Kelce was part of a Democratic plot to boost President Joe Biden's re-election chances in November, as per HuffPost. These conspiracy theories gained traction as Swift cheered on Kelce during the Super Bowl, which ended with the Chiefs' victory over the San Francisco 49ers. Griffin's mockery of Trump's post resonated with many viewers. Some commenters on The View's YouTube channel applauded her humor and willingness to call out what they saw as Trump's tendency to exaggerate. One viewer remarked, \"I really don't care anything about football, but Kansas City winning makes the MAGAts heads explode! That's golden for Mel.\" Journalist Kara Swisher also weighed in on Trump's post, tweeting, \"Taking undeserved credit for her enormous success is classic (and heinous), but this reads as if he’s stone cold terrified of her and her power and realizes — after a lifetime of terrorizing women — that this is the one who can actually end him. Even her boyfriend frightens him.\" Though her fans have slammed these baseless theories, it is worth noting that Swift's showing up at NFL games has made a big difference. Apex Marketing Group claimed her presence has added $331.5 million to the Kansas City Chiefs brand. People are calling this \"The Taylor Effect,\" but her impact goes beyond football. A survey by Lending Tree found that around 13% of Americans are more into football because she is involved.","summary":"The incident unfolded on Super Bowl Sunday when Donald Trump posted a message on his Truth Social platform about a famous singer.","url":"https://www.inquisitr.com/alyssa-farah-griffin-once-took-a-jab-at-ex-boss-donald-trump-over-his-thirstiest-post-ever","image":"https://dab57h0r8ahff.cloudfront.net/706104/uploads/8682a000-466a-11ef-aa3b-4783b017997d_1200_630.jpeg","video":null,"publish_date":"2024-07-20 23:16:00","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.149},{"id":252247450,"title":"Trump calls Biden a ‘sick, weak, pathetic man’ in first rally since shooting","text":"Donald Trump warned of “slaughter in the suburbs” and called Joe Biden a “sick, weak, pathetic man” in his first rally since surviving an assassination attempt last weekend. The Republican presidential nominee had promised “unity” for the United States in the wake of his shooting in Pennsylvania last Saturday, which shocked the country and heralded a surge in support for Trump in opinion polls. But at a rally in Grand Rapids in Michigan on Saturday night, Trump returned to his usual rhetoric as he railed against the “radical Left Democrats”, accused his opponents of “rigging” the election and calling Mr Biden “crooked”. He also goaded Nancy Pelosi over reports that she has advised Mr Biden to quit the election race, accusing her of turning on the president “like a dog”. He took to the stage without the large white bandage that covered his ear at the Republican convention earlier this week, instead wearing a small plaster. Michigan is one of the vital swing states in the US election and has become even more important since the attempt on Trump’s life, with recent polls showing a chunky swing towards the former president, much to the alarm of Democrats. Republican momentum is in stark contrast to the mire around President Joe Biden, who remains hunkered at home with Covid, resisting unprecedented Democratic pressure to step aside. join the conversation in the comments","summary":"<![CDATA[Donald Trump warned of “slaughter in the suburbs” and called Joe Biden a “sick, weak, pathetic man” in his first rally since surviving an assassination attempt last weekend.\n\n]]>","url":"https://www.telegraph.co.uk/us/politics/2024/07/20/barack-obama-joe-biden-pelosi-latest-news-us-election/","image":"https://www.telegraph.co.uk/content/dam/en-us/politics/2024/07/20/TELEMMGLPICT000386288081_17215111818100-xlarge_trans_NvBQzQNjv4Bqqi-ULC5HvxH1EG-rVeSh2hWW7mUa35xjAb4OXlMYu_g.jpeg?imwidth=1200","video":null,"publish_date":"2024-07-20 23:15:48","author":"Josh White,Michael Murphy,Susie Coen","authors":["Josh White","Michael Murphy","Susie Coen"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.542},{"id":252247158,"title":"Trump mocks Democrats in first campaign rally since assassination attempt","text":"GRAND RAPIDS >> Donald Trump held his first campaign rally today since he narrowly escaped an assassination attempt one week ago, poking fun at Democrats in turmoil at a heavily secured indoor arena in the election battleground state of Michigan. Fresh from his nominating convention where his takeover of the Republican Party was cemented, Trump appeared in Grand Rapids with his new vice presidential pick, Sen. JD Vance from Ohio. They took the stage in their first campaign event together with the Republican Party unified behind them. In contrast, it is no longer certain that President Joe Biden will be the Democratic Party’s nominee facing Trump in the Nov. 5 election. Biden has faced calls from some senior Democrats to end his re-election bid after his poor debate performance last month raised concerns over whether he could beat Trump or complete another four-year term. Trump mocked Democrats, saying they wanted to kick Biden off the ticket after he won their presidential nominating contest. “They have a couple of problems. No. 1, they have no idea who their candidate is,” Trump said to laughter and jeers. “This guy goes and he gets the votes and now they want to take it away.” “As you’re seeing, the Democrat Party is not the party of democracy. They’re really the enemies of democracy.” He added: “And they keep saying, ‘He’s a threat to democracy.’ I’m saying, ‘What the hell did I do for democracy?’ “Last week, I took a bullet for democracy.” Opinion polls show a tight race between the two men at a national level but Biden trailing Trump in the battleground states that will likely determine the winner. Many Democrats fear he may not have a realistic path to victory and that the party needs a new candidate to take on Trump. There was a heavy police presence at Trump’s rally in Grand Rapids today, with police on every street corner for several blocks. U.S. Secret Service officers were positioned on the top balconies in the Van Andel Arena, giving them a bird’s eye view of the crowd inside. Bag searches for those entering the indoor arena earlier in the day were long and thorough, and the Secret Service sweep of the building took about an hour longer than usual. The rally in Butler, Pennsylvania, last weekend was outdoors. At that event, the gunman was able to scale the roof of a building outside the Secret Service perimeter before opening fire on Trump, clipping his ear, killing a rally-goer and wounding several others. The Secret Service, which is responsible for protecting Trump, declined to comment on security for the Grand Rapids event. An investigation is under way into the security failures at the Butler rally. Trump gave a detailed account of his narrow brush with death in his convention speech on Thursday, telling the audience that he was only talking to them “by the grace of Almighty God.” Trump’s former physician, Ronny Jackson, said today that the former president is recovering as expected from the gunshot wound to his right ear, but noted intermittent bleeding and said Trump may require a hearing exam. The bullet fired by the would-be assassin at the July 13 rally in Pennsylvania came “less than a quarter of an inch from entering his head,” said Jackson, a Republican congressman from Texas who had served as physician to Presidents Trump and Barack Obama.","summary":"GRAND RAPIDS >> Donald Trump held his first campaign rally today since he narrowly escaped an assassination attempt one week ago, poking fun at Democrats in turmoil at a heavily secured indoor arena in the election battleground state of Michigan.","url":"https://www.staradvertiser.com/2024/07/20/breaking-news/trump-mocks-democrats-in-first-campaign-rally-since-assassination-attempt/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240720_WEB_Vance-Trump.jpg","video":null,"publish_date":"2024-07-20 23:15:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.325},{"id":252247378,"title":"Trump says he knows nothing about ‘seriously extreme’ Project 2025 that mirrors many of his proposed policies","text":"Donald Trump called Project 2025, a 900-page blueprint for his second presidency, “seriously extreme” at his first rally since the assassination attempt against him. Trump made the comments at a rally in Michigan on Saturday afternoon. The event comes one week after Thomas Matthew Crooks opened fire at his Butler, Pennsylvania rally last weekend. Crooks killed one attendee and injured two others while one of his shots grazed Trump’s ear. “Like some on the right, severe right, came up with this Project 25, I don’t even know, some of them I know who they are, but they’re very, very conservative,” Trump said. “They’re sort of the opposite of the radical left.” “You have the radical left and the radical right and they come up — I don’t know what the hell it is, it’s Project 25,” he continued. “‘He’s involved in project — and then they read some of the things and they are extreme, they’re seriously extreme. “But I don’t know anything about it, I don’t want to know anything about it.” Project 2025 is led by the Heritage Foundation, a conservative think tank, and more than a dozen former Trump administration officials. The document includes plans to expand his executive authority, replace civil servants with loyalists, crush abortion rights, attack civil rights for LGBTQ+ people and impose an anti-immigrant agenda, among other policies. The plan would give Trump unprecedented executive authority over the federal government, The Independent has previously reported. While Trump claims to know nothing about the plan, he praised the Heritage Foundation and their “plans for exactly what our movement will do” two years ago. “Heritage does such an incredible job, this is a great group, and they’re going to lay the groundwork and detail plans for exactly what our movement will do and what your movement will do when the American people give us a colossal mandate to save America,” Trump said in 2022. Trump also said he has a place in his administration for Tom Homan, a member of The Heritage Foundation and one of the Project 2025 authors. He also claims the plan is “extreme,” but the document mirrors several policies the former president himself has endorsed. For example, at the Republican National Convention on Thursday, Trump committed to mass deportation if elected. “That’s why, to keep our family safe, the Republican platform promises to launch the largest deportation operation in the history of our country,” Trump said on Thursday night. Meanwhile, Project 2025 endorses a similar plan. “Prioritizing border security and immigration enforcement, including detention and deportation, is critical if we are to regain control of the border, repair the historic damage done by the Biden Administration, return to a lawful and orderly immigration system, and protect the homeland from terrorism and public safety threats,” the Project 2025 document reads. Trump has also repeatedly claimed that the human-driven climate crisis is a “hoax,” and several times has vowed to “drill, baby, drill.” In a similar vein, Project 2025 says the next Republican administration must “stop the war on oil and natural gas” and end efforts to “decarbonize the American economy.” Several Democratic lawmakers have now formed a task force to combat Project 2025. “Project 2025 is more than an idea, it’s a dystopian plot that’s already in motion to dismantle our democratic institutions, abolish checks and balances, chip away at church-state separation, and impose a far-right agenda that infringes on basic liberties and violates public will,” task force member Representative Jared Huffman said. Heritage Foundation President Kevin Roberts called the task force “unserious.” “Project 2025 will not be ‘stopped’ by an unserious, mistake-riddled press release or a task force of House Democrats lacking a basic understanding of federal governance,” Roberts said in a statement.","summary":"Ex-president has previously praised The Heritage Foundation and their ongoing work on the project","url":"https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-project-2025-rally-b2583142.html","image":"https://static.independent.co.uk/2024/07/20/23/SEI213589147.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/AjYgd8ke-4VHSaSK0.mp4","publish_date":"2024-07-20 23:11:58","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","source_country":"gb","sentiment":-0.148},{"id":252247052,"title":"Republican candidates for the Michigan Senate race are dropping out as the party begins to support former Representative Mike Rogers.","text":"GRAND RAPIDS, Mich. – Detroit-area businessman Sandy Pensler has withdrawn from the Republican Senate race in Michigan just ahead of the state’s primary, throwing his support behind former U.S. Rep. Mike Rogers for the party’s nomination. Pensler made the announcement at Donald Trump’s rally in Grand Rapids on Saturday after being called onto to stage by the former president. Trump endorsed Rogers earlier this year and many in the party have begun to coalesce around Rogers, who served in the U.S. House for 14 years and chaired the House Intelligence Committee. “We need control of the Senate,” Pensler said on stage. “A divisive continued primary effort hurts the chances of that.” “President Trump endorsed Mike Rogers,” he added. “Tonight, so am I.” Pensler was seen as a long-shot candidate, having previously lost the GOP primary for Senate in 2018 by over 9 percentage points to now-U.S. Rep. John James, who would go on to lose to incumbent Democratic Sen. Debbie Stabenow. Stabenow announced that she would retire next year, opening up one of the most competitive seats in the nation. With Pensler dropping his bid, Rogers’ only remaining high-profile opponent is Justin Amash, a former U.S. representative who left the GOP in 2019 after calling for the impeachment of Trump, who was president at the time. Amash represented Grand Rapids from 2011 to 2021. Democrats have coalesced around Rep. Elissa Slotkin as their candidate. She faces actor Hill Harper in the Aug. 6 primary but has a massive cash advantage. National Republicans had hoped Rogers would have a similarly easy path to his party’s nomination. But the campaigns of former U.S. Reps. Amash and Peter Meijer, who ended his bid earlier this year, made his task a little more complicated. Trump’s endorsement in March of Rogers – who in the past had been critical of Trump before changing his tune on the Senate trail – has pushed many other GOP candidates out of the race. Despite the turmoil within the Democratic Party regarding their top of the ticket, the party hasn’t lost a Senate race since 1994 and has exceeded expectations in recent Michigan elections.","summary":"Internewscast Journal\n\nInternewscast\n\n\nGRAND RAPIDS, Mich. – Detroit-area businessman Sandy Pensler has withdrawn from the&#8230;\n\n\nThis Post: Republican candidates for the Michigan Senate race are dropping out as the party begins to support former Representative Mike Rogers. first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/republican-candidates-for-the-michigan-senate-race-are-dropping-out-as-the-party-begins-to-support-former-representative-mike-rogers/","image":"https://www.clickorlando.com/resizer/5amrJztFGJDFbSVwNVHOYEFn8W0=/cloudfront-us-east-1.images.arcpublishing.com/gmg/IYPL2RYJM5C75DTX5GT5O3XAJY.jpg","video":null,"publish_date":"2024-07-20 23:08:53","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.298},{"id":252247120,"title":"'I took a bullet for democracy,' Trump tells first rally since shooting","text":"Security was reportedly tight inside the Van Andel Arena in Grand Rapids, Michigan, amid questions over Secret Service lapses at the Pennsylvania rally - though there were few visible signs of any greater law enforcement presence. Meanwhile, Biden loyalists continued to defend the embattled president as the drumbeat of calls for him to abandon his campaign grows louder. The 81-year-old and his team have remained publicly adamant that he is staying in the race, though some reports suggest discussions have begun in his inner circle about how exactly he might step aside. BIDEN'S \"BIG DECISION\" There has been massive speculation over who could replace him. As vice president, Harris appears best positioned to do so. Senator Elizabeth Warren, a leading progressive who sought the party's presidential nod in 2020, gave Harris a boost Saturday without turning her back on the president. \"Joe Biden is our nominee,\" she said on MSNBC. \"He has a really big decision to make. \"But what gives me a lot of hope right now is that if President Biden decides to step back, we have Vice President Kamala Harris, who is ready to step up, to unite the party, to take on Donald Trump, and to win in November.\" Some Democrats, however, fear that such a late switch could trigger chaos, dooming the party at the polls. Team Trump, for its part, is effervescent after an exceptional streak of luck - from the failed assassination bid to favorable court rulings and Biden's disastrous debate performance last month.","summary":"The Republican presidential nominee appeared wearing a new, smaller, flesh-coloured bandage over his right ear, bloodied in the attack by a 20-year-old gunman at a rally in Pennsylvania that killed one bystander.","url":"https://www.channelnewsasia.com/world/trump-shooting-took-bullet-democracy-campaign-rally-biden-november-election-4493861","image":"https://onecms-res.cloudinary.com/image/upload/s--UddLHXWP--/c_crop,h_1237,w_2200,x_0,y_17/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2024/07/21/2024-07-20t2254","video":null,"publish_date":"2024-07-20 23:08:40","author":null,"language":"en","catgory":"politics","source_country":"sg","sentiment":0.114},{"id":252246798,"title":"Pa. GOP Senate candidate and retired Army Capt. David McCormick shores up veteran support","text":"HARRISBURG, Pa. — GOP Senate candidate Dave McCormick had a simple message for veterans in Pennsylvania’s capital city on Saturday. “This is the moment where, the difference between our country going over the cliff and our country going in the right direction, is leadership,” McCormick told veterans attending the Pennsylvania American Legion’s 105th Convention at the Hilton Harrisburg hotel. McCormick, a hedge fund executive-turned-Senate hopeful, is a 1987 West Point graduate who served as a paratrooper in the US Army’s 82nd Airborne Division. He saw action in Iraq during the first Gulf War, received a Bronze Star and retired with the rank of captain. Leaning into his experience while trying to avoid strong political statements, McCormick told the crowd of combat veterans that no one in the Senate will have their backs like he will. “As a veteran, I can assure you, no one will stand more strong, more clear for our military and for our veterans than I will.” he said. According to McCormick, the military has “lost its focus on war-fighting” in recent years. To reverse this trend and strengthen America’s armed forces, McCormick suggested reforming GI benefits to ensure educated veterans can be competitive in the modern economy, as well as improving mental health care at the VA. About half of the 22 veterans who take their own lives each day never receive any mental health treatment, McCormick said. McCormick also discussed his experience at last Saturday’s western Pennsylvania rally where former President Donald Trump was shot. McCormick — who spoke almost two hours before Trump took the stage — said he was about 25 feet from the former president, while firefighter Corey Comperatore was fatally shot another 25 feet behind him. Trump showed “strength” and reassured the crowd by getting to his feet and pumping his fist after being shot, McCormick said. “Many of you know what it’s like to have bullets flying,” McCormick told veterans of his experience at the rally. “Of 100 people in that situation, 99 of them stay down. Very few stand up, and [Trump] stood up.” Speaking to The Post after his 18-minute speech, McCormick said he was “honored” to receive the endorsement of his state’s largest police union, the Pennsylvania Fraternal Order of Police — a group that has backed Sen. Bob Casey (D-Pa.) and other Democrats in the past. “I think the primary reason is [for endorsing me] is they’re deeply worried that our society and our leadership — Sen. Casey particularly — have not been supportive of law enforcement,” McCormick said. “His positions are out of step.” Polls show the incumbent Casey remains ahead of McCormick, but the race between the two is expected to be the country’s most expensive Senate election this year.","summary":"GOP Senate candidate Dave McCormick shored up support from fellow a simple message for veterans in Pennsylvania’s capital city on Saturday.","url":"https://nypost.com/2024/07/20/us-news/pa-gop-senate-candidate-david-mccormick-shores-up-veteran-support/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/85752449.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/YPaeFVyf-RyIcpnTz.mp4","publish_date":"2024-07-20 23:03:21","author":"Carson Swick","authors":["Carson Swick"],"language":"en","source_country":"us","sentiment":-0.17},{"id":252247342,"title":"J.D. Vance Wastes No Time Calling Out Kamala Harris at Trump Rally","text":"Sen. J.D. Vance (R-OH) wasted no time when taking to the podium at the Van Andel Arena in Grand Rapids, Michigan on Saturday, immediately taking jabs at Vice President Kamala Harris. The Trump campaign rally is the first joint event with his recent vice presidential pick and the first campaign rally since the assassination attempt at his rally in Pennsylvania last weekend. “What a cool thing it was to be asked by President Trump to serve as his running mate and to get out there on the campaign trail, but there’s some bad news, actually,” Vance said as he greeted supporters. “The Vice President Kamala Harris, she doesn’t like me,” the crowd responded with a chorus of boos. “Kamala Harris said something to the effect that I have no loyalty to this country,” the 39-year-old continued. “Well I don’t know, Kamala, I did serve in the United States Marine Corps and build a business, what the hell have you done, other than collect a check?” “What has she done other than collect a check from her political offices,” Vance asked the crowd. “We have to give her credit, my friends,” he continued, “she did serve as ‘Border Tsar’ during the biggest disaster open borders we ever had in this country.” Vance then said Trump would “close back that border, and bring some common sense and security to this country.” The packed crowd of nearly 14,000, according to the New York Post, cheered along during Vance’s speech, Vance also reiterated the classic 2008 Michael Steele line “drill, baby, drill” when talking about how Trump would secure “energy dominance.” Vance also promised to “kick out the drug cartels of our country.” The speech comes days after Harris used her first opportunity to take her own shots at Vance, after formally accepting the Republican vice presidential nomination. In Fayetteville, North Carolina, Friday, Harris told supporters that Vance only gave fans part of his story. “Some of you may have heard Donald Trump’s running mate deliver remarks at the Republican National Convention,” Harris said, adding that though “compelling,” it was “not the full story.” “Frankly, what is very telling is what he did not talk about on that stage,” she continued, as she began to outline the various right-wing movements the Ohio senator is linked to, including Project 2025. “Here’s the thing, if you claim to stand for unity, you need to do more than just use the word,” Harris said to a chorus of applause. “You cannot claim you stand for unity if you are pushing an agenda that deprives whole groups of Americans basic freedoms, opportunity, and dignity.” Vance will hold his first rally as Trump’s vice-presidential nominee on July 22 in his hometown of Middletown, Ohio, a Trump statement confirmed.","summary":"Anna Moneymaker/Getty ImagesSen. J.D. Vance (R-OH) wasted no time when taking to the podium at the Van Andel Arena in Grand Rapids, Michigan on Saturday, immediately taking  jabs at Vice President Kamala Harris.\n\nThe Trump campaign rally is the first joint event with his recent vice presidential pick and the first campaign rally since the assassination attempt at his rally in Pennsylvania last weekend.\n\n“What a cool thing it was to be asked by President Trump to serve as his running mate and to get out there on the campaign trail, but there’s some bad news, actually,” Vance said as he greeted supporters.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/jd-vance-wastes-no-time-calling-out-kamala-harris-at-trump-rally","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2476,w_4401,x_0,y_119/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1721516116/GettyImages-2162822071_el6duu","video":null,"publish_date":"2024-07-20 23:02:45","author":"Matt Young,Owen Lavine","authors":["Matt Young","Owen Lavine"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.033},{"id":252247374,"title":"Trump makes wild claims on immigration and boasts about Musk donations in first rally since shooting","text":"Donald Trump traveled to Michigan on Saturday for his first campaign appearance since being shot last week, and his first alongside his newly announced running mate JD Vance, the US senator for Ohio. His ear may have been bandaged, but otherwise, Trump seemed little different than his old self, continuing to mock Democrats, lie about the 2020 election, demonize migrants in racist terms, praise right-wing dictators, and tell bizarre stories of dubious truthfulness. Trump didn’t waste time in quickly addressing the recent assassination attempt. “I stand before you only by the grace of almighty God,” he told the crowd in Grand Rapids. “I shouldn’t be here. I shouldn’t be here.” “We will fight, fight, fight, and we will win, win win,” Trump added, a reference to when he held up his fist and chanted “fight” after being shot at in Pennsylvania last week. Elsewhere, Trump described the shooting as the moment he “took a bullet for democracy.” The former president then moved onto mocking the Democratic circus around whether Joe Biden will remain their 2024 presidential candidate. “They have no idea who their candidate is, and neither do we,” Trump said. Elsewhere, he called Nancy Pelosi “crazy,” and accused her of turning on Joe Biden “like a dog,” after reports she privately told the president he should step aside and can’t beat Trump in November. Trump seemed to be exceptionally confident in his campaign, even for someone who habitually boasts about himself. At one point, he told a bizarre story about offering to take the leader of North Korea to a baseball game as a way to stop him from pursuing further nuclear weapons. “Just relax, chill, you’ve got so much nuclear weapons,” Trump told the crowd. “Let’s go to a baseball game. I’ll show you what a baseball game is. We’ll go watch the Yankees.” It wasn’t the only mention of a strong man: Trump also celebrated praise he has claimed he got from Hungarian far-right leader Viktor Orbán. In fact, Trump was riding so high, he didn’t even seem worried about alienating one of his biggest, most influential recent backers: Elon Musk. Trump praised the tech billionaire for the millions he’s given to the wider Trump re-election effort, then spent a significant chunk of his speech bashing electric cars, trucks, boats, military vehicles — anything that might one day become the kind of EV that the Tesla co-founder made his name building. In between the jokes about Democrats and familiar, still-false claims that they “rigged” the 2020 election, Trump reserved special ire for migrants, describing them in ways that echoed the far-right “Great Replacement” theory. “They wanna get people to vote,” Trump said of those who advocate for immigration to the US. “This is an invasion of our country,” Trump added of migrants entering the US, people who he claimed were leading the “plunder, rape, and slaughter of our American suburbs and cities.” In fact there’s no documented relationship between increased migration and crime, and studies suggest immigrants are less likely than those born in the US to break the law. It wasn’t the only exaggerated claim of the night. The former president also attempted to distance himself from Project 2025, a policy blueprint for his potential second term from a far-right think tank, despite his well-documented ties to its authors. “I don’t know what the hell it is... They’re seriously extreme, but I don’t know anything about it. I don’t want to know anything about it,” Trump said. “But what they do is misinformation, and they keep saying he’s a threat to democracy. The hell did I do with democracy? Last week I took a bullet for democracy.” Prior to Trump taking the stage, his new VP pick JD Vance warmed up the crowd, and bashed his Democratic counterpart Kamala Harris. “What the hell have you done other than collect a check?” Vance asked during his speech, prompting the audience to burst into applause.","summary":"Former president embraced familiar lies and attacks on migrants in first speech alongside new VP pick JD Vance","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-michigan-rally-elon-musk-b2583144.html","image":"https://static.independent.co.uk/2024/07/20/23/97348c81543045648dffa464d9b1e24d.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/AjYgd8ke-4VHSaSK0.mp4","publish_date":"2024-07-20 23:02:33","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.158},{"id":252247804,"title":"\"They Have No Idea Who Their Candidate Is\": Trump Mocks Democrats At Rally","text":"Donald Trump held his first campaign rally on Saturday since he narrowly escaped an assassination attempt one week ago, mocking Democrats and at one point comparing former Democratic House Speaker Nancy Pelosi to a \"dog.\" Trump, who called for national unity in a speech on Thursday as he accepted his party's presidential nomination at the Republican National Convention, made no mention of that in his remarks before a raucous crowd of supporters in Grand Rapids. He frequently mocked Democratic President Joe Biden as feeble. He derided senior Democrats, including Pelosi, for trying to persuade Biden to end his re-election bid. Referring to Pelosi, Trump said: \"She's turned on him like a dog. She's as crazy as a bed bug.\" The Trump campaign did not immediately respond to a request for comment about Trump comparing Pelosi to a dog. Fresh from his nominating convention where his takeover of the Republican Party was cemented, Trump appeared in Grand Rapids with his new vice presidential pick, Senator J.D. Vance from Ohio. They took the stage in their first campaign event together with the Republican Party unified behind them. In contrast, it is no longer certain that President Joe Biden will be the Democratic Party's nominee facing Trump in the Nov. 5 election. Biden has faced calls from some senior Democrats to end his re-election bid after his poor debate performance last month raised concerns over whether he could beat Trump or complete another four-year term. Trump attacked Democrats, saying they wanted to kick Biden off the ticket after he won their presidential nominating contest. \"They have a couple of problems. No. 1, they have no idea who their candidate is,\" Trump said to laughter and jeers. \"This guy goes and he gets the votes and now they want to take it away.\" \"As you're seeing, the Democrat Party is not the party of democracy. They're really the enemies of democracy.\" He added: \"And they keep saying, 'He's a threat to democracy.' I'm saying, 'What the hell did I do for democracy?' Last week, I took a bullet for democracy.\" Trump referred to the assassination attempt several times on Saturday. \"I hope I don't have to go through that again. It was so horrible,\" Trump said. Opinion polls show a tight race between the Trump and Biden at a national level but Biden trailing Trump in the battleground states that will likely determine the winner. Many Democrats fear he may not have a realistic path to victory and that the party needs a new candidate to take on Trump. There was a heavy police presence at Trump's rally in Grand Rapids on Saturday, with police on every street corner for several blocks. U.S. Secret Service officers were positioned on the top balconies in the Van Andel Arena, giving them a bird's eye view of the crowd inside. Bag searches for those entering the indoor arena earlier in the day were long and thorough, and the Secret Service sweep of the building took about an hour longer than usual. The rally in Butler, Pennsylvania, last weekend was outdoors. At that event, the gunman was able to scale the roof of a building outside the Secret Service perimeter before opening fire on Trump, clipping his ear, killing a rally-goer and wounding several others. The Secret Service, which is responsible for protecting Trump, declined to comment on security for the Grand Rapids event. An investigation is under way into the security failures at the Butler rally. Trump gave a detailed account of his narrow brush with death in his convention speech on Thursday, telling the audience that he was only talking to them \"by the grace of Almighty God.\" Trump's former physician, Ronny Jackson, said on Saturday that the former president is recovering as expected from the gunshot wound to his right ear, but noted intermittent bleeding and said Trump may require a hearing exam. The bullet fired by the would-be assassin at the July 13 rally in Pennsylvania came \"less than a quarter of an inch from entering his head,\" said Jackson, a Republican congressman from Texas who had served as physician to Presidents Trump and Barack Obama. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Donald Trump held his first campaign rally on Saturday since he narrowly escaped an assassination attempt one week ago, poking fun at Democrats in turmoil at a heavily secured indoor arena in the...","url":"https://www.ndtv.com/world-news/they-have-no-idea-who-their-candidate-is-trump-mocks-democrats-at-first-rally-since-shooting-6151294","image":"https://c.ndtvimg.com/2024-07/98oqr5g8_trump-rally_625x300_21_July_24.jpeg?ver-20240615.100","video":null,"publish_date":"2024-07-20 23:01:51","author":null,"language":"en","catgory":"politics","source_country":"in","sentiment":-0.352},{"id":252247308,"title":"Junk bonds are now in high demand as Wall Street bets on another Trump presidency","text":"Corporate bond investors around the world have already started positioning to benefit from a potential Donald Trump election victory after an assassination attempt and the Republican National Convention boosted his position in polls. Spreads on US high-yield bonds strengthened compared with their euro counterparts in the past week and junk funds globally saw a surge in inflows. “US high yield is the trade,” said Al Cattermole, a portfolio manager at Mirabaud Asset Management. “It is more domestic-focused and exposed to US economic activity.” In a late June interview with Bloomberg Businessweek, Trump said he wants to bring the corporate tax rate down to as low as 15%. That lower expense could improve the creditworthiness of weaker firms. US companies could also benefit from protectionist policies that will see high tariffs slapped on imports if the Republican nominee is victorious. US junk is attractive to money managers because, when financials are excluded, more than half of top junk-rated borrowers only have domestic revenues, according to a Bloomberg News analysis. That compares with just a fifth in the high-grade space. The data excludes companies that don’t publicly disclose the information. Domestic manufacturers could also benefit from tariffs and looser regulation. “We have been adding US industrials that would benefit from a pro-business stance from a new government,” said Catherine Braganza, senior high yield portfolio manager at Insight Investment. “Companies that benefit from industrial manufacturing, in particular, those that deal with spare parts” are attractive, she said. Yield Curve Some fund managers are instead focusing on the shape of the yield curve, particularly as corporate bond spreads seem to have little room to fall further after nearing their tightest level in more than two years. “We have reduced duration by having shorter-dated bonds, using futures and also using steepener trades,” said Gabriele Foa, a portfolio manager at Algebris Investments’ global credit team, referring to wagers that benefit when the gap between short- and long-dated yields widens. Even though this spread has widened this year, it remains far below levels seen before major central banks started raising interest rates to tackle runaway inflation. At the moment, bondholders receive a measly 30 basis points in extra yield by holding seven- to 10-year global corporate bonds instead of shorter-term company notes, according to Bloomberg indexes, compared with 110 just before Trump left office in 2021. his gives the curve further room to steepen, particularly if the former President’s policies — which are expected to be inflationary and lead to higher national debt — are matched by interest-rate cuts by the Federal Reserve. To be sure, not all money managers are switching to a Trump portfolio just yet. It’s not yet a sure thing that he will win, and even if he does, it’s not completely clear what he will do in office. “It’s a bit too early to adjust your portfolio based on ‘what ifs’ when Donald Trump is in office,” said Joost de Graaf, co-head of the credit team at Van Lanschot Kempen Investment Management. “We still expect to see a bit of summer grind tighter in spreads.” If Trump does win, markets sensitive to higher interest rates, inflation and tariffs are expected to be more unpredictable. “Higher for longer is bad for emerging markets, and you’ll get weaker economic growth due to tariffs,” said Mirabaud’s Cattermole. “We would expect that European high yield underperforms in the next nine months.”","summary":"“US high yield is the trade. It is more domestic-focused and exposed to US economic activity.”","url":"https://fortune.com/2024/07/20/junk-bonds-donald-trump-trade-corporate-tax-cuts-tariffs-election/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/07/GettyImages-2162000451_2d93e9-e1721516063158.jpg","video":null,"publish_date":"2024-07-20 23:01:30","author":"Bloomberg,Olivia Raimonde,Tasos Vossos","authors":["Bloomberg","Olivia Raimonde","Tasos Vossos"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.204},{"id":252247854,"title":"Republicans want to bring back child labor. If Trump wins, they will","text":"Whenever people nowadays see photos of kids working in the mines and factories in the early 20th century, the response is usually disgust. Child labor was a serious issue at that time—but one our nation largely resolved with the passage of the Fair Labor Standards Act of 1938, which prevented companies from employing children in dangerous jobs. This is one of those laws that I just assumed everyone supported. In fact, most people do support its provisions—except, apparently, Republican lawmakers. Apparently, when confronted with old photos of child laborers, they see only a solution to our current labor shortage. Over the past few years, child labor has skyrocketed. Since 2018, the U.S. Department of Labor has seen a 69% increase in children being employed illegally by companies. (These figures likely represent only a fraction of the actual violations.) And elected Republicans’ response to this crisis has been to introduce bills and pass legislation—to help out those companies. Since 2021, Republican lawmakers have pushed over 60 bills to dismantle critical protections for child workers. These bills would allow employers to have children work longer hours, to take away child workers’ lunch breaks, and to even permit kids to work jobs previously deemed too dangerous. Thankfully, in some instances, federal law would still provide some of these protections. But federal law can always be changed. In the leadup to the 2018 midterms, then-President Donald Trump’s administration sought to roll back child protections on roofing work and the operation of industrial equipment. It did not matter if the equipment was power-driven woodworking machines, factory-grade meat grinders, or complex patient lifts in nursing homes. In fact, the nursing home industry's high injury rates were directly due to those lifts, yet Trump proposed eliminating the safety rules barring children from operating them. The child labor influx is particularly alarming for child farm laborers, many of whom are immigrants, who face even harsher conditions than in other areas because it is so dependent on immigrant labor. These kids are not going to school, and they don’t have to. Even the Fair Labor Standards Act exempted agriculture, which corporate farms have taken advantage of for decades. In agriculture, it’s possible for children as young as 12 to work unlimited hours as long as the employer has parental consent and the child doesn’t miss school for work. For Jacquline Aguilar, who was put to work at age 11 for 12-hour shifts in a lettuce field, it was a necessity for her survival since her parents were so poor. Yet her experience was grueling. “Most days would start with the fields cold and wet with dew,” she wrote in a 2023 blog post for The Child Labor Coalition, a group that seeks to end exploitative child labor. “I was often drenched in mud. By the time the sun rose, it was boiling outside. I would still wear layers of clothes to avoid getting sunburnt and wrap bandanas around my head and neck. There was no cold water available for us during working hours, or even on our lunch break.” It’s disturbing that young children can harvest crops but are barred from working in air-conditioned buildings to make copies, bag groceries, or sell movie tickets. This past April, Republicans in the Missouri General Assembly introduced a bill to remove work-permit requirements for children as young as 14. (Arkansas Gov. Sarah Huckabee Sanders signed a similar bill into law last year.) Missouri legislators were quick to defend themselves by claiming today’s youth is too lazy: Republicans would rather roll back laws than tackle the very real crisis before us: Children are getting exploited even under current labor laws. In 2023, the Department of Labor announced that Packers Sanitation Services, Inc., had been caught illegally employing over 100 children aged 13 to 17 in hazardous jobs at its meatpacking facilities. These children, many of whom were unaccompanied migrant youth, endured overnight shifts cleaning dangerous equipment on slaughterhouse floors, with some sustaining injuries from caustic chemicals and other hazards. In Wisconsin, a 16-year-old died while illegally working at a sawmill. Republicans often respond to this Labor Department oversight by attacking the agency. On July 5, Iowa Gov. Kim Reynolds demanded the reconsideration of fines against some businesses that violated federal child labor laws. A Labor Department spokesman responded bluntly, saying in a statement, \"No child should be working long hours, doing dangerous work, or be employed in unsafe conditions.” The conservative rollback of child labor protections is being driven by a think tank called the Foundation for Government Accountability, according to The Washington Post. This Florida-based group, funded by Republican mega-donors, designed the law eliminating work permits and age verification in Arkansas, as well as the law in Iowa that allows 14-year-olds to work night shifts and 15-year-olds to work assembly lines. (That bill was so controversial that the Iowa Senate passed the bill before 5 AM on April 18, 2023.) And in Florida, the group worked with lawmakers on a bill to roll back protections from 1913 on the number of hours that children can work. Going in the opposite direction, however, is California. For instance, children between the ages of 14 and 17 must have completed seventh grade before they are eligible to work during the school year. Additionally, children aged 12 to 13 are prohibited from working on any school day. Moreover, last fall, Gov. Gavin Newsom signed a law requiring schools to educate children about workplace safety and child labor laws. Assemblymember Liz Ortega was the bill’s sponsor. “We are seeing headlines about children abused at workplaces across the country―wage theft, violations of labor law, and even serious life-changing injuries,” she said. “As Republicans in other states are working hard to put our children in harm’s way, California is giving kids the tools to stand up for themselves.” As it turns out, conservatives were right: Children do need protection. However, the real threat doesn't come from books or the LGBTQ+ community. It comes from Republican lawmakers themselves.","summary":"Whenever people nowadays see photos of kids working in the mines and factories in the early 20th century, the response is usually disgust. Child labor was a serious issue at that time—but one our nation largely resolved with the passage of the Fair Labor Standards Act of 1938, which prevented companies from employing children in dangerous jobs. This is one of those laws that I just assumed everyone supported. In fact, most people do support its provisions—except, apparently, Republican lawmakers. Apparently, when confronted with old photos of child laborers, they see only a solution to our current labor shortage.&nbsp;","url":"https://www.dailykos.com/story/2024/7/20/2254501/-Republicans-want-to-bring-back-child-labor-If-Trump-wins-they-will?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1322322/story_image/GettyImages-640484289.jpg?1721147364","video":null,"publish_date":"2024-07-20 22:59:12","author":"SemDem","authors":["SemDem"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.345}]}