{"offset":0,"number":50,"available":15255,"news":[{"id":295756044,"title":"U.S.-UK Trade Agreement Has Big Pro-Growth Potential","text":"LONDON, ENGLAND - OCTOBER 20: An employee views trading screens at the offices of Panmure Gordon ... [+] and Co on October 20, 2014 in London, England. Markets stabilised over the weekend following global turbulence amid fears over the Ebola virus and global economic concerns. (Photo by Carl Court/Getty Images)\nGetty Images\n\nA prospective trade deal between the United States and the United Kingdom could, if handled right, be a catalyst to spur global economic growth through enhanced trade and regulatory reform. This would require recognition by other major trading nations of the advantages of removing regulatory obstacles to trade liberalization.\n\nA February 27 White House meeting between President Donald Trump and UK Prime Minister Sir Keir Starmer set the stage for negotiating a zero tariff “free trade” agreement between the two nations. Such an agreement might also include other provisions aimed at removing regulatory barriers that often impose huge impediments to mutually beneficial transactions.\n\nOne anticipated benefit of Brexit – the UK’s withdrawal from the European Union as the result of a 2016 popular referendum – had been a significant reduction in excessive regulatory costs through the elimination of burdensome EU rules. These costs, which businesses list as a top burden that discourages investment in the EU, have increased over the past year, with continuing regulatory expansion. The November 2024 Draghi Report, by a noted former European Central Bank President, highlighted the negative impact on European economies due to overregulation.\n\nRegrettably, the UK missed the boat post-Brexit in not opting for a more open, less regulatory economy that could have spurred economic growth. As a result, the UK faces serious continuing economic stagnation, absent significant changes to regulatory, budget, and tax policies.\n\nEconomically sensible UK policy reforms are badly needed now.\n\nProspects For International Trade Reform\n\nMORE FOR YOU\n\nToday’s NYT Mini Crossword Clues And Answers For Sunday, March 2nd\n\nGoogle Will Delete My Gmail And Photos On April 3—How To Save Yours\n\nPhysical Attacks Against Bitcoin Holders Surge As BTC Price Rises\n\nInternational trade is one area where the prospects for UK policy reforms finally look promising.\n\nThe Comprehensive and Progressive Trans-Pacific Partnership (CPTPP, accounting for 15% of global GDP), which the UK joined in 2024, leaves signatories free to shape their domestic regulatory regimes as they wish. It accomplishes this through “mutual recognition and equivalence.” MRE means that in applying national regulatory quality requirements to imports, the standard under which the imports were produced is irrelevant.\n\nThe CPTPP MRE-based model enhances economic growth in two key ways. It expands mutually beneficial international trade by eliminating a major impediment to trade among Partnership members. It also encourages standards-based competition among signatories, facilitating the emergence of “better” standards that can be adopted by other nations. Improved standards enhance innovation by providing a foundation for collaboration, reducing development costs, ensuring compatibility between products, and creating a reliable environment for new technologies to flourish.\n\nBy contrast, as trade expert and non-partisan Growth Commission Chairman Shanker Singham explains, the EU conditions market access on accepting the EU regulatory system and EU standards. The European approach to trade not only precludes the CFTPP’s benefits, its notorious economic efficiency further retards economic growth.\n\nFortunately, the U.S.-Mexico-Canada Agreement, like the CPTPP, features MRE. This should make it easier for both the UK and the U.S. to adopt MRE as a key feature in free trade negotiations. Very recently, bipartisan House and Senate sponsors of legislation to support UK-U.S. trade negotiations cited the importance of having those negotiations build on the USMCA framework.\n\nThe successful broadening of U.S. trade opportunities, in tandem with the CPTPP market opening (which encompasses major Asian countries plus Australia, Canada, Mexico, and Chile), would offer major economic dividends to the UK – and, also, to the U.S.\n\nA major expansion of U.S.-UK trade could raise economic growth in both countries. Furthermore, it would incentivize the UK to enhance the quality of its standards and system of rules with an eye to global trade, rather than focusing primarily on developing inferior alternatives aimed at satisfying EU strictures. This could generate economic dividends within the UK.\n\nNotably, as Shanker Singham points out, the “Growth Commission estimates that, if the UK made its domestic regulatory system just 10% more pro-competitive, it would see a 5.5% boost to GDP per capita.” Expert regulatory economists have pointed to analogous benefits to the American economy that would stem from U.S. regulatory reform (which President Trump has made a top priority for his second term).\n\nWhat’s more, the EU might also take note. The new leadership of the European Commission, the EU’s executive and administrative body, recently acknowledged the need for far-reaching systemic reform in light of the Draghi Report’s findings. The benefits to Europe of a less regulatory, MRE-centric EU international trade policy might become apparent if a new UK-U.S. trade agreement and enlarged CPTPP yield significant economic dividends.\n\nThe Next Steps\n\nMuch needs to be done, of course, to make a successful, growth-enhancing U.S.-UK treaty a reality. Negotiations have not even begun. But there are signs that momentum is already building for the swift completion of a deal.\n\nA U.S.-UKA FTA might turn out to be a lot more than a “win-win” for both nations. In the long run, it could become a catalyst for a substantial expansion of international trade and a major spur to global economic growth.\n\nFollow me on Twitter or LinkedIn.\nEditorial StandardsForbes Accolades","summary":"A UK-U.S. trade agreement could point the way to making other major trading nations recognize the advantages of removing regulatory obstacles to trade liberalization.","url":"https://www.forbes.com/sites/aldenabbott/2025/03/01/us-uk-trade-agreement-has-big-pro-growth-potential/","image":"https://imageio.forbes.com/specials-images/imageserve/67c3ade59bc4212d81091c32/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-03-02 01:03:24","author":"Alden Abbott,Carl Court,Contributor","authors":["Alden Abbott","Carl Court","Contributor"],"language":"en","category":"politics","source_country":"US","sentiment":0.181},{"id":295755116,"title":"UK’s Starmer embraces Zelensky after Trump fiasco","text":"The Ukrainian leader received a warm welcome in London from British Prime Minister Keir Starmer, who reassured Vladimir Zelensky of the UK’s “unwavering support” for “as long as it takes” following a contentious meeting with US President Donald Trump.\n\nThe encounter between Trump and Zelensky at the White House had been intended to finalize a minerals agreement but devolved into a heated exchange when the Ukrainian leader dug his heels in and insisted that Washington should support Kiev more rather than act as a neutral mediator with Moscow.\n\nTrump accused Zelensky of being ungrateful for American support and unwilling to make necessary concessions to end the conflict. “We’re looking for peace,” Trump stated. “We’re not looking for somebody that’s going to sign up a strong power and then not make peace because they feel emboldened.”\n\nIn contrast, Starmer assured Zelensky of the UK’s full backing “for as long as it takes,” emphasizing the importance of reaching a “just and lasting peace that secures Ukraine’s future sovereignty and security,” according to a spokesperson.\n\nThe UK also announced on Saturday a new $2.84 billion loan to bolster Ukraine’s military capabilities, which London hopes will be repaid with profits from frozen Russian assets. Zelensky hailed “a meaningful and warm meeting” with Starmer and promised that the “funds will be directed toward weapons production in Ukraine.”\n\nSince 2022, Washington and Brussels have frozen an estimated $300 billion in Russian central bank reserves along with billions in private assets. Western officials have proposed redirecting some of the funds to Ukraine, but legal concerns have slowed such efforts. However, proceeds from the assets are already being used to back some of the G7 loans to Ukraine.\n\nMoscow has repeatedly condemned the asset freeze as “theft,” arguing that accessing the funds would be illegal and set a troubling precedent. The Kremlin also maintains that Western nations’ support for Kiev makes them direct participants in the conflict.\n\nThe UK is one of the largest individual state donors, having already provided Kiev with more than $15.5 billion since January 2022. Berlin has sent over $18 billion worth of arms and other aid, while the US has provided almost $120 billion, according to Germany’s Kiel Institute.\n\nTrump, however, estimated the overall US aid to Kiev at over $300 billion and wants Ukraine to reimburse US taxpayers for their generosity via the minerals deal. He criticized his predecessor, Joe Biden, for simply giving cash away like “cotton candy,” while European countries, he noted, would be reimbursed for their aid to Kiev as it was provided “in the form of a loan.”","summary":"British Prime Minister Keir Starmer has reassured Ukrainian leader Vladimir Zelensky of UK’s “unwavering support,” and promised a new loan \nRead Full Article at RT.com","url":"https://www.rt.com/news/613563-london-starmer-zelensky-loan/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67c3ad042030272cc92b169b.jpg","video":null,"publish_date":"2025-03-02 01:03:16","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.108},{"id":295756068,"title":"UK Prime Minister Reaffirms Support for Ukraine","text":"London, March 01 (QNA) - UK Prime Minister Keir Starmer met with Ukrainian President Volodymyr Zelensky at Downing Street on Saturday to discuss continued support for Ukraine and the ongoing developments in the war.\n\nDuring the meeting, Starmer reiterated Britain's commitment to standing by Ukraine, emphasizing that the United Kingdom will continue to support Kyiv for as long as necessary.\n\nThe meeting comes just one day after Zelensky's visit to Washington, where he met with U.S. President Donald Trump at the White House, who threatened to cut American aid to Ukraine.\n\nThe discussions also take place ahead of the European Union leaders' summit on Sunday, which Zelensky is set to attend to discuss Ukraine’s peace plan.\n\nZelensky is also scheduled to meet with King Charles III on Sunday, according to British media reports. (QNA)","summary":"London, March 01 (QNA) - UK Prime Minister Keir Starmer met with Ukrainian President Volodymyr Zelensky at Downing Street on Saturday to discuss continued support for Ukraine and the ongoing developments in the war.","url":"https://qna.org.qa/en/news/news-details?id=uk-prime-minister-reaffirms-support-for-ukraine&date=2/03/2025","image":"https://cdn.qna.org.qa/media/uqdmomen/qna_uk_rawanda_6_7_2024.jpg?width=1200&height=900&v=1db8b0f7bc6fb90","video":null,"publish_date":"2025-03-02 00:54:42","author":null,"language":"en","category":"politics","source_country":"qa","sentiment":0.514},{"id":295753782,"title":"Hundreds of pro-Ukraine protesters demonstrate as JD Vance visits Vermont for family vacation","text":"Hundreds of protesters gathered in Vermont Saturday to protest Vice President JD Vance’s visit to a local ski resort, less than 24 hours after his explosive exchange with Ukrainian President Volodymyr Zelensky.\n\nVance, who brought his family to Sugarbush Resort in Warren, Vermont, was greeted by a half-mile gauntlet of protesters holding pro-Ukraine signs Saturday. There appeared to be hundreds in the crowd.\n\nThe protesters carried signs calling Vance “Nazi scum,” accusing him of being a “traitor” and telling him to “go ski in Russia.”\n\nOther signs said “Trump serves Putin,” “Theocracy is not freedom” and “Stand with Ukraine.”\n\nBut not all Green Mountain State skiers were upset with Vance’s visit, and one local skier complained about the demonstrations to Fox News Digital.\n\n“Those people protesting Vance are f—ing morons,” the skier said.\n\nFox News was also told Vance and his family planned to stay at a four-star inn near the resort, but they moved to an undisclosed location after seeing the ruckus.\n\n“Those people protesting Vance are f—ing morons,” one local skier remarked.\n\nVance and his family later skied on one side of a mountain to avoid crowds, but protesters gathered there as well.\n\nThe demonstrations came less than a day after Vance and Zelensky had a tense argument in the White House, which began when the Ukrainian leader balked at signing a mineral rights deal that President Trump said would pave the way for a peace deal.\n\n“Mr. President, with respect, I think it’s disrespectful for you to come into the Oval Office to try to litigate this in front of the American media,” Vance told Zelensky. “Right now, you guys are going around and forcing conscripts to the front lines because you have manpower problems. You should be thanking the president for trying to bring an end to this conflict.”\n\nLater, Vance implied that Zelensky, who was visiting Washington, D.C., to sign a rare earth minerals deal that has since been dropped, was ungrateful again and asked if he’d “said ‘thank you’ once this entire meeting.”\n\n“You went to Pennsylvania and campaigned for the opposition in October. Offer some words of appreciation for the United States of America and the president who’s trying to save your country,” the former Ohio senator said.\n\nThe Ukrainian leader replied that Vance was speaking “loudly” before President Donald Trump jumped in to support Vance, telling Zelensky that his country was “in trouble.”\n\nFox News Digital reached out to the White House and Sugarbush Resort for comment.","summary":"A local skier told Fox News the anti-Vance protesters were ' f---ing morons.'","url":"https://nypost.com/2025/03/01/us-news/jd-vances-visit-to-vermont-ski-resort-interrupted-by-pro-ukraine-demonstrators-after-zelensky-exchange/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/Screenshot-2025-03-01-at-7.26.20 PM.png?w=1200","video":"https://cdn.jwplayer.com/videos/Bmt07CdU-RyIcpnTz.mp4","publish_date":"2025-03-02 00:50:24","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.307},{"id":295753394,"title":"Ukraine 'cannot survive' without ongoing US support, ambassador says","text":"Ukraine's ambassador to Australia says the Oval Office showdown between US President Donald Trump and Ukrainian President Volodymyr Zelenskyy was a \"big shock\" and warns his country will not survive without ongoing US support.\n\n\"Emotions were high, we all know it. But Zelenskyy is a very direct man and a very honest man,\" Vasyl Myroshnychenko told Insiders on Sunday.\n\nDespite the extraordinary clash between the two leaders on Friday, Mr Myroshnychenko remains confident a deal between them is still possible. \n\n\"I'm optimistic that we can find a way to move forward … but we cannot survive without an American commitment. We will continue fighting. We will not surrender, but to end this war we need American involvement.\"\n\nMr Myroshnychenko said the fiery White House meeting was particularly difficult for his colleague, Ukraine's ambassador to the US, Oksana Markarova, who was pictured with her head in her hands during the meeting.\n\n\"These are very challenging times and when you represent a country and you spend almost four years working on American support like Oksana has, that was one of those moments which was very difficult for [her] and painful,\" he said.\n\nOpposition warns China against 'misinterpreting' US/Ukraine split\n\nShadow Home Affairs Minister James Paterson told Insiders that while diplomacy between allies could occasionally be \"robust\", American leadership remained critical, while warning China not to \"misinterpret\" the tensions between the US and Ukraine.\n\n\"I think that's in the world's interest, and I think that's in America's interest and I hope we are able to achieve a ceasefire on acceptable terms to Ukraine.\"\n\nSenator Paterson said a ceasefire that was unacceptable to Ukraine would be a \"significant win\" to Russian President Vladimir Putin.\n\n\"That will not just embolden [Putin], but it will involve others around the world, including our own region.\"\n\nHe also warned China not to misinterpret the tensions between Mr Trump and Mr Zelenskyy.\n\n\"It would be a mistake for China to believe the United States views the Indo Pacific theatre in the same way it views the European theatre,\" Senator Paterson said.\n\n\"There is no retreat for America from the Pacific.\"\n\nZelenskyy set to meet European leaders in London\n\nFollowing his clash with President Trump and Vice President JD Vance on Saturday, Mr Zelenskyy flew to London for a meeting with British Prime Minister Keir Starmer. \n\nThe reception he received at No 10 Downing St was far removed from the shouting match 24 hours earlier in the US capital.\n\nMr Starmer welcomed Mr Zelenskyy with a warm hug that was captured by the world's media as crowds cheered the Ukrainian leader's arrival.\n\n\"I hope you heard some of that cheering in the street. That is the people of the United Kingdom coming out to demonstrate how much they support you … and our absolute determination to stand with you,\" the British PM told him.\n\nMr Starmer told Mr Zelenskyy the UK would stand with Ukraine in its war against Russia for \"as long as it may take\".\n\nThe Ukrainian leader will attend a summit of European leaders on Sunday (UK time) followed by a meeting with King Charles.\n\nOn Saturday, Prime Minister Anthony Albanese reaffirmed Australia's \"unequivocal\" support for Ukraine.\n\n\"This is the struggle of a democratic nation versus an authoritarian regime led by [Russian President] Vladimir Putin who clearly has imperialistic designs not just on Ukraine but throughout that region,\" he said.\n\nThe government has committed more than $1.5 billion to aid Ukraine in its war with Russia, including the delivery of missiles, armoured personnel carriers and more than 20 Bushmaster vehicles.\n\nAmbassador Myroshnychenko thanked both the prime minister and Opposition Leader Peter Dutton for their ongoing commitment to Ukraine's war effort.\n\n\"They have been very heartening, very heartening to the Ukrainian people who have seen those statements, who have responded very positively to them,\" he said.\n\n\"Elections are coming, and I got a commitment from both leaders that should they win the elections they will continue supporting Ukraine and this is what I rely on.\"","summary":"Ambassador Vasyl Myroshnychenko calls the Oval Office showdown between US President Donald Trump and Ukrainian President Volodymyr Zelenskyy a \"big shock\".","url":"https://www.abc.net.au/news/2025-03-02/ukrainian-ambassador-australia-says-ongoing-us-support-crucial/105000148","image":"https://live-production.wcms.abc-cdn.net.au/476bc82d74b4b0ddcaae0d40d46c339c?impolicy=wcms_crop_resize&cropH=576&cropW=1024&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-03-02 00:49:19","author":"David Speers","authors":["David Speers"],"language":"en","category":"politics","source_country":"AU","sentiment":0.078},{"id":295753990,"title":"Trump announces border is closed and declares end of country’s invasion with mass ICE arrests","text":"President Donald Trump has declared that the ‘invasion’ of the United States is over and the border is now ‘closed to all illegal immigrants’ after mass ICE arrests. \n\nIn a post to his Truth Social page, Trump said that in the last month his administration had recorded the lowest number of immigrants trying to enter the country ever. \n\nTrump said in total there was 8,326 apprehensions by Border Patrol at the Southern Border. \n\nHe added that these people ‘were quickly ejected from our Nation or, when necessary prosecuted for crimes against the United States of America.’\n\nThe commander-in-chief added: ‘This means that very few people came – The Invasion of our Country is OVER. \n\n‘In comparison, under Joe Biden, there were 300,000 Illegals crossing in one month, and virtually ALL of them were released into our Country. \n\n‘Thanks to the Trump Administration Policies, the Border is CLOSED to all Illegal Immigrants. \n\n‘Anyone who tries to illegally enter the U.S.A. will face significant criminal penalties and immediate deportation.’\n\nHis statement came after Department of Homeland Security Secretary Kirsti Noem announced that the administration had arrested 20,000 illegal aliens in one month.\n\nNoem touted that as a 627 percent increase in monthly arrests, compared to President Biden. \n\nShe said: ‘President Trump and this Administration are saving lives every day because of the actions we are taking to secure the border and deport illegal alien criminals. \n\n‘Hundreds of thousands of criminals were let into this country illegally. We are sending them home, and they will never be allowed to return.’\n\nTrump’s stance is that all migrants in the US, without documentation, are criminals because they illegally entered or illegally remained in the country. \n\nHe vowed during his campaign to remove criminals from the country, labeling some migrants as the ‘worst of the worst’.\n\nAs his administration continues ramping up its crackdown on illegal immigration, some long-evading, at large fugitives are getting taken in after decades of delays. \n\nThis week, Ivan Oramas and Santos Maradiaga-Villalta were both arrested by immigration arrests, after over two decades on the lam. \n\nNews of their arrest was circulated Thursday in an internal immigration memo noting recent enforcement actions made by President Donald Trump’s administration.\n\nOramas, 61, is a citizen of Cuba with a rap sheet including convictions for sexual battery and aggravated assault.\n\nHis sexual battery case caused serious injury, according to his charges in the file.\n\nICE Houston nabbed Oramas this week, enforcing a deportation order first handed down in October 2003—21 years overdue.\n\nMaradiaga-Villalta, a 40-year-old alien from Honduras, has convictions for smuggling aliens into the U.S.\n\n He was arrested recently by ICE in Phoenix. His first deportation order dates back to January 2006, a 19-year lapse in action.\n\nAmong the other criminals that surfaced in this week’s federal data were Guatemalan national Alexis Aquirre-Velasquez, 37, who was ordered out of the U.S. 12 years ago.\n\nHe was charged with four counts of indecent liberty with a child and was sentenced to 10 years in prison.\n\nRecently, White House officials revealed to DailyMail.com that north of 6,000 migrants were deported in Trump’s first two weeks.\n\nMigrants have also been airlifted to Guantanamo Bay, Cuba, as well—a location that is expected to hold approximately 30,000 aliens as ICE facilities reach their limits.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump has declared that the &#8216;invasion&#8217; of the United States&#8230;\n\n\nThis Post: Trump announces border is closed and declares end of country&#8217;s invasion with mass ICE arrests first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-announces-border-is-closed-and-declares-end-of-countrys-invasion-with-mass-ice-arrests/","image":"https://i.dailymail.co.uk/1s/2025/03/01/23/95731997-14451285-image-a-1_1740870113054.jpg","video":null,"publish_date":"2025-03-02 00:47:47","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.291},{"id":295751734,"title":"Of eagles perching on Aso Rock, peeping at the President","text":"On Friday afternoon, President Bola Tinubu hosted the latest Super Bowl champion, the Philadelphia Eagles defensive tackle Morotoluwa Ojomo, at the State House. For Ojomo, it was one of those moments of pride when one could sigh “It all paid off!”\n\nHaving left Nigeria for the United States at age seven in 2009, Ojomo’s career success brought him face-to-face with the President of his home country. They discussed ways to give back to his roots. Some may argue that the encounter might not have been possible if the 23-year-old had not left Nigeria early with his parents to pursue his dreams.\n\nNine years later, Ojomo enrolled at the University of Texas, majoring in Business Finance. Over five seasons with the Longhorns, he played 50 games, recorded 95 tackles and tallied five sacks. His performance earned him second-team All-Big 12 honours in 2022.\n\nBuilding on years of dedication, his professional career kicked off when the Philadelphia Eagles selected him in the seventh round of the 2023 NFL Draft. Although his rookie season saw limited playtime, he eventually broke out in the 2024 season. That breakthrough culminated in his pivotal role during Super Bowl LIX, where he led the Eagles’ defensive success. The Eagles triumphed over the Kansas City Chiefs with a decisive 40-22 scoreline on February 9 in New Orleans.\n\nDuring that meeting with the President, Ojomo proposed establishing a foundation to give more young people the opportunities he had.\n\n“The plan is to have a facility here that provides opportunities for youth to attend secondary schools or universities in America. Places are looking for talent, and Nigeria is filled with talent. I believe education is power, and I want to educate the youth and give them opportunities. That is the first part.\n\n“Then, there is the idea of a facility where guys [fellow Nigerian NFL players] can come back and train, spend two, three weeks, or longer periods in Nigeria, just building Nigerian talent,” he explained.\n\nPresident Tinubu replied, “It is remarkable to have a talent like you believing in yourself and ready to help others. With your kind of focus, you can mentor and develop many youths here. Your perseverance, determination, courage and focus should be admired. If you have any recommendations or a pathway on what I can do to make it better or work faster, let me know.”\n\nReactions from Nigerians have been quite positive so far. However, some say they would have been worried for Ojomo’s career if he had met President Tinubu’s predecessor, Muhammadu Buhari, who many believe wielded a reverse Midas touch. In 2020, some netizens even superstitiously linked the meeting between Buhari and British-Nigerian Boxer Anthony Joshua to the latter’s loss of his championship title to Ukraine’s Oleksandr Usyk the following year.\n\nSome claimed the Super Eagles maintained a winning streak in the 2022 African Cup of Nations until Buhari’s video conference call. The sacking of then-U.S. Secretary of State, Rex Tillerson, by Donald Trump—barely 12 hours after meeting Buhari in Abuja—didn’t help matters either. Then came the former OPEC Chief, Mohammed Barkindo. After concluding his tenure in July 2022, Barkindo received a hero’s welcome from Buhari in Abuja, only to die barely 24 hours later. Although there is no factual basis for these beliefs, the Buhari phenomenon stuck like stubborn mud to a shoe sole. Where there is a will to cook up conspiracy theories, there will always be a way. \n\nUnlike Buhari, however, Tinubu has been quite fortunate. So far, Nigerians do not seem inclined to pin notable defeats on him, except for the disappointing outing at the Paris Olympics. Being only halfway through his presidency, it is too early to say how long that luck will last. Time and outcomes will tell. For now, Nigeria’s best from across the world will continue to enjoy access to the President.\n\nDon’t peep at the President\n\nSpeaking of access and conspiracy theories, those unfamiliar with the seat of power believe that everyone in the Villa sees the President daily at will. I recall Buhari’s meeting with the Villa community days before he left office. The whispers in the crowd that evening revealed that some State House staffers were seeing the President for the first time in a shockingly long time, despite working there every day for years.\n\nThanks to the heavy formation around the leader, you are more likely to see Arsenal win every tournament in English and European football in a single season, than see the President walking alone in his courtyard.\n\nIt was therefore no surprise that, last Monday, journalists were shooed away from peeking at the President as he posed for photographs with participants of Senior Executive Course 46 from the National Institute for Policy and Strategic Studies, Kuru. Although a metal grill stood between reporters and the President—providing ample distance—perhaps he was too holy to be looked upon.\n\nThis phenomenon is not peculiar to Aso Rock alone. In the United States, White House Correspondents who cover the leader of the free world do so from a distance. For instance, Richard Nixon’s team made it clear from the start that they considered the press dangerous to the political health of the President.\n\nThings were different under President John F. Kennedy and his successor, Lyndon B. Johnson, who sometimes gave interviews from his bedroom. However, Nixon’s legacy stood the test of time, and each president’s personality dictated their relationship with the press.\n\nVeteran journalist Judy Woodruff, who has covered various presidential cycles since 1976, once explained it this way: “How is it to cover the White House? It is the most stimulating turf. You are on the frontline of history.\n\nOn the other hand, you don’t have great access. You’re always behind the door,” she said in a 2016 PBS documentary on the White House. So, if you ever visit the Villa and see the President, consider it an honour. It’s certainly not the norm.","summary":"On Friday afternoon, President Bola Tinubu hosted the latest Super Bowl champion, the Philadelphia Eagles defensive tackle Morotoluwa Ojomo, at the State House. For Ojomo, it was one of those moments of pride when one could sigh “It all paid off!” Having left Nigeria for the United States at age seven in 2009, Ojomo’s career \n\n\n \n Read More","url":"https://punchng.com/of-eagles-perching-on-aso-rock-peeping-at-the-president/","image":"https://cdn.punchng.com/wp-content/uploads/2023/06/17220511/STEPHEN-ANGBULU.jpg","video":null,"publish_date":"2025-03-02 00:44:02","author":"Stephen Angbulu","authors":["Stephen Angbulu"],"language":"en","source_country":"ng","sentiment":0.044},{"id":295751728,"title":"33 world leaders back Zelensky after face-off with Trump","text":"Thirty-three world leaders have declared support for Ukrainian President, Volodymyr Zelensky, following a tense meeting between him and United States President, Donald Trump.\n\nThe world leaders also condemned Russia’s actions in Ukraine.\n\nZelensky and Trump’s meeting at the Oval Office on Friday, with US Vice President JD Vance also in attendance ended in a deadlock.\n\nDiscussions at the meeting generated heated arguments as the two leaders debated the future of Russia’s invasion of Ukraine.\n\nTensions escalated when the leaders clashed over a minerals deal that would grant the US extensive access to Ukraine’s rare earth resources in exchange for Washington’s continued support for Kyiv in its fight against Russia.\n\nZelensky insisted that any agreement must include genuine security guarantees for Ukraine, a demand that Trump resisted.\n\nThe press conference turned confrontational when Vance accused Zelensky of being “disrespectful,” pointedly asking, “Have you said ‘thank you’ once?”\n\nThe meeting concluded abruptly, with Zelensky and his delegation being escorted out of the White House.\n\nShortly after the meeting, Zelensky took to X to express gratitude to Trump, the US Congress, and Americans for their support.\n\n“Ukraine needs just and lasting peace, and we are working exactly for that,” he wrote.\n\nIn an interview with Fox News, Zelensky was asked if he would apologise to Trump. While he declined to elaborate, he acknowledged the public fallout, saying it was “not good for both sides.”\n\n“I’m not sure that we did something bad,” he added. “I cannot change the Ukrainian attitude towards Russia. They are killers for us.”\n\nHowever, when asked if his relationship with Trump could still be salvaged, Zelensky responded affirmatively.\n\nOn Saturday, he posted again on social media, saying, “It is very important for us that Ukraine is heard and that no one forgets about it, neither during the war nor after. It is important for people in Ukraine to know that they are not alone, that their interests are represented in every country, in every corner of the world.”\n\nGlobal leaders stand with Ukraine \n\nFollowing the event, leaders from various parts of the world took to social media, issuing statements on their X handles in support of Ukraine and criticising Russia’s continued aggression.\n\nCanadian Prime Minister, Justin Trudeau, condemned Russia for its “illegal and unjustifiable invasion” of Ukraine.\n\n“For three years now, Ukrainians have fought with courage and resilience. Their fight for democracy, freedom, and sovereignty is a fight that matters to us all. Canada will continue to stand with Ukraine and Ukrainians in achieving a just and lasting peace,” Trudeau wrote.\n\nAlso, French President Emmanuel Macron criticised Russia’s actions and defended the sanctions imposed three years ago.\n\n“Thanks to all those who helped and continue. And respect to those who, since the beginning, have been fighting. Because they are fighting for their dignity, their independence, for their children, and for the security of Europe,” Macron stated.\n\nSimilarly, Slovenian President Nataša Musar denounced Russia’s aggression and commented on the Oval Office meeting.\n\n“What we witnessed in the Oval Office undermines these values and the foundations of diplomacy. We stand firmly in support of Ukraine’s sovereignty. We repeat, Russia is the aggressor,” Musar wrote.\n\nAustrian Chancellor, Karl Nehammer, reiterated Europe’s backing for Ukraine.\n\n“Russia is the aggressor, and therefore Europe supports Ukraine‘s efforts to achieve a just and lasting peace,” he stated.\n\nLatvian President Edgars Rinkēvičs also expressed solidarity with Ukraine.\n\n“Ukraine is a victim of Russian aggression. It fights the war with help from many friends and partners,” he posted.\n\nFinnish President Alexander Stubb highlighted Ukraine’s struggle for survival.\n\nHe wrote, “The heroic fight of Ukraine against Russia’s war of aggression is about the existence of Ukraine as a nation. We in Finland understand what Ukraine is going through. Ukraine is fighting not only for her independence, sovereignty, and territorial integrity.”\n\nSimilarly, Montenegrin President, Jakov Milatovic and Slovak Republic’s fifth President Zuzana Čaputová also expressed support for Ukraine, with Čaputová stating, “The people of Ukraine are defending their right to live. It’s that simple. They deserve all the support they can get to defend this right and to live and prosper as a sovereign nation living in peace.”\n\nSeveral other world leaders echoed similar sentiments in their tweets, reaffirming their backing for Ukraine.","summary":"Thirty-three world leaders have declared support for Ukrainian President, Volodymyr Zelensky, following a tense meeting between him and United States President, Donald Trump. The world leaders also condemned Russia’s actions in Ukraine. Zelensky and Trump’s meeting at the Oval Office on Friday, with US Vice President JD Vance also in attendance ended in a deadlock. \n\n\n \n Read More","url":"https://punchng.com/33-world-leaders-back-zelensky-after-face-off-with-trump/","image":"https://cdn.punchng.com/wp-content/uploads/2023/09/29065110/Volodymyr-Zelenskyy.jpeg","video":null,"publish_date":"2025-03-02 00:44:02","author":"Muhammed Lawal","authors":["Muhammed Lawal"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.003},{"id":295753506,"title":"The Pentagon is sending about 3,000 more active-duty troops to the US-Mexico border","text":"By Lolita C. Baldor | Associated Press\n\nWASHINGTON — The Pentagon is sending about 3,000 more active-duty troops to the U.S.-Mexico border as President Donald Trump seeks to clamp down on illegal immigration and fulfill a central promise of his campaign, U.S. officials said Saturday.\n\nHis defense secretary, Pete Hegseth, has ordered elements of a Stryker brigade combat team and a general support aviation battalion for the mission, the Pentagon announced. The forces will arrive along the nearly 2,000-mile border in the coming weeks.\n\nThe Defense Department’s statement did not specify the size of the deployment, but it was put at about 3,000 by the officials, who were not authorized to discuss the matter publicly and spoke on condition of anonymity.\n\nThe Strykers are medium-armored wheeled personnel carriers.\n\nAlready, about 9,200 U.S. troops in total are at the southern border, including 4,200 deployed under federal orders and about 5,000 National Guard troops under the control of governors.\n\nThe new troops will “reinforce and expand current border security operations to seal the border and protect the territorial integrity of the United States,” the Pentagon said.\n\nTrump is determined to expand the military’s role in his effort to shut down the border and send detained migrants back to their home countries.\n\nMilitary personnel have been sent to the border almost continuously since the 1990s to help address migration, drug trafficking and transnational crime.","summary":"Defense Secretary Pete Hegseth has ordered elements of a Stryker brigade combat team and a general support aviation battalion for the mission.","url":"https://www.ocregister.com/2025/03/01/the-pentagon-is-sending-about-3000-more-active-duty-troops-to-the-us-mexico-border/","image":"https://www.ocregister.com/wp-content/uploads/2025/03/Border_Hegseth_85103.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-02 00:40:39","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.044},{"id":295754000,"title":"Protests Against DOGE Impact Tesla Stores in Effort to Influence Elon Musk’s Revenue","text":"BOSTON – Demonstrators gathered outside Tesla stores across the U.S. Saturday to protest the automaker’s billionaire CEO, Elon Musk, and his push to slash government spending on behalf of President Donald Trump.\n\nThe demonstrations are part of a growing backlash in North America and Europe to Musk’s disruptive role in Washington.\n\nCritics of Trump and Musk hope to discourage and stigmatize purchases of Tesla, the electric car company that is the world’s most valuable automaker. Liberal groups for weeks have organized anti-Tesla protests in hopes of galvanizing opposition to Musk’s Department of Government Efficiency and energizing Democrats still demoralized by Trump’s November victory.\n\n“We can get back at Elon,” said Nathan Phillips, a 58-year-old ecologist from Newton, Massachusetts, who was protesting in Boston on Saturday. “We can impose direct economic damage on Tesla by showing up at showrooms everywhere and boycotting Tesla and telling everyone else to get out, sell your stocks, sell your Teslas.”\n\nMusk is taking direction from Trump to slash federal spending and sharply reduce the workforce, arguing that Trump’s victory gave the president and him a mandate to restructure the U.S. government. DOGE officials have swiftly gained access to sensitive databases, directed thousands of federal job cuts, canceled contracts and shut down sections of the government, including the U.S. Agency for International Development.\n\nMusk’s critics say his actions defy Congress’s power to control the U.S. budget and present a host of ways for him to enrich himself. Musk leads several other companies, notably SpaceX, which conducts launches for NASA and the intelligence community, and the social media platform X.\n\nTesla and the White House did not respond to emailed requests for comment Saturday.\n\nMore than 50 demonstrations were listed Saturday on the website Tesla Takedown, with more planned later in March from coast to coast in the United States along with England, Spain and Portugal. News reports showed demonstrations in recent days in U.S. cities including Tucson, Arizona; St. Louis; New York City; Dayton, Ohio; Charlotte; and Palo Alto, California.\n\nSome Tesla owners have also reported their vehicles vandalized with spray painted swastikas amid what Jewish groups and observers fear is a rise in antisemitism.\n\nFederal prosecutors charged a woman in connection with a string of vandalism against a Colorado Tesla dealership, which included Molotov cocktails being thrown at vehicles and the words “Nazi cars” spray painted on the building.\n\nSaturday’s demonstration in Boston had a festive atmosphere, with a brass band playing music as protestors carried signs and chanted. Several of the signs mocked Musk and DOGE, with one reading: “Stop Elon and his despicable Muskrats.”\n\n“This government led by Trump and Musk, it’s gone completely off the rails and we are here to stop that,” said Carina Campovasso, a retired federal worker. “And I hope they listen.”\n\nAbout 300 demonstrators protested at a Tesla dealership in New York City on Saturday. Police said nine people were taken into custody but did not elaborate on the charges they faced.\n\nTesla’s share price has fallen by nearly a third since Trump took office, though it’s still higher than it was a year ago. Musk’s current net worth is an estimated $359 billion, according to Forbes, which calculated his 2024 net worth as $195 billion.\n\nCooper reported from Phoenix. Patrick Whittle contributed from Scarborough, Maine.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBOSTON – Demonstrators gathered outside Tesla stores across the U.S. Saturday to&#8230;\n\n\nThis Post: Protests Against DOGE Impact Tesla Stores in Effort to Influence Elon Musk&#8217;s Revenue first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/protests-against-doge-impact-tesla-stores-in-effort-to-influence-elon-musks-revenue/","image":"https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/BHZGRPHC7FBL7HD3BU6JQS45NM.jpg","video":null,"publish_date":"2025-03-02 00:36:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.097},{"id":295751618,"title":"What the papers say – March 2","text":"The Sunday papers highlight Volodymyr Zelensky’s warm welcome to the UK in the wake of the tense words between the Ukrainian president and his US counterpart Donald Trump.\n\nImages of Sir Keir Starmer hugging Mr Zelensky outside Downing Street adorn the front pages of the Sunday People, Sunday Mirror and The Sunday Telegraph, with the latter carrying the headline: “You are very welcome to No 10.”\n\nThe Sunday Times reports Chancellor Rachel Reeves announced a £2.26 billion loan agreement to support Kyiv’s military and the costs of rebuilding after the war.\n\nKing Charles has invited Mr Zelensky to Sandringham on Sunday, according to The Independent.\n\nThe Mail on Sunday says a number of public figures have called for Mr Trump’s state visit to Britain to be shelved following the president’s calamitous White House meeting with Mr Zelensky.\n\nAnd the Daily Star Sunday says racing fans could save money by watching Cheltenham from Spain.","summary":"The Ukraine conflict continues to dominate the news agenda on Sunday.","url":"https://www.standard.co.uk/news/uk/keir-starmer-ukraine-people-rachel-reeves-downing-street-b1214164.html","image":"https://static.standard.co.uk/2025/03/02/00/c8b33bdd22780ab97494f55e848b9d14Y29udGVudHNlYXJjaGFwaSwxNzQwOTYxMzYx-2.33243394.jpg?width=1200","video":null,"publish_date":"2025-03-02 00:31:42","author":"Pa Reporter","authors":["Pa Reporter"],"language":"en","source_country":"gb","sentiment":0.088},{"id":295754984,"title":"What the papers say – March 2","text":"The Sunday papers highlight Volodymyr Zelensky’s warm welcome to the UK in the wake of the tense words between the Ukrainian president and his US counterpart Donald Trump.\n\nImages of Sir Keir Starmer hugging Mr Zelensky outside Downing Street adorn the front pages of the Sunday People, Sunday Mirror and The Sunday Telegraph, with the latter carrying the headline: “You are very welcome to No 10.”\n\nThe Sunday Times reports Chancellor Rachel Reeves announced a £2.26 billion loan agreement to support Kyiv’s military and the costs of rebuilding after the war.\n\nKing Charles has invited Mr Zelensky to Sandringham on Sunday, according to The Independent.\n\nThe Mail on Sunday says a number of public figures have called for Mr Trump’s state visit to Britain to be shelved following the president’s calamitous White House meeting with Mr Zelensky.\n\nAnd the Daily Star Sunday says racing fans could save money by watching Cheltenham from Spain.","summary":"The Sunday papers highlight Volodymyr Zelensky’s warm welcome to the UK in the wake of the tense words between the Ukrainian president and his US counterpart Donald Trump. Images of Sir Keir Starmer hugging Mr Zelensky outside Downing Street adorn the front pages of the Sunday People, Sunday Mirror and The Sunday Telegraph, with the [&#8230;]\n\n\nThe post What the papers say – March 2 appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/02/what-the-papers-say-march-2-8/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/2.33243394-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-02 00:31:42","author":"Newsdesk","authors":["Newsdesk"],"language":"en","source_country":"gb","sentiment":0.088},{"id":295750946,"title":"Trump Picks Another Trade Fight With Canada Over Lumber","text":"WASHINGTON -- President Donald Trump on Saturday initiated an investigation into whether imports of lumber threaten America's national security, a step that is likely to further inflame relations with Canada, the largest exporter of wood to the United States.\n\nThe president directed his commerce secretary, Howard Lutnick, to carry out the investigation. The results of the inquiry could allow the president to apply tariffs to lumber imports. A White House official declined to say how long the inquiry would take.\n\nAn executive memorandum signed by Trump ordered the investigation and was accompanied by another document that White House officials said would expand the volume of lumber offered for sale each year, increasing supply and helping to ensure that timber prices do not rise.\n\nThe trade inquiry is likely to further anger Canada. Some of its citizens have called for boycotts of American products over Trump's plans to impose tariffs on all Canadian imports beginning Tuesday. The president, who also plans to hit Mexico with similar tariffs, says the levies are punishment for failure to stem the flow of drugs and migrants into the United States.\n\nCanada and the United States have sparred over protections in the lumber industry for decades. The countries have protected their own industries with tariffs and other trade measures, and argued about the legitimacy of those measures in disputes under the North American Free Trade Agreement and at the World Trade Organization.\n\nCanada provided $28 billion of lumber to the United States in 2021 -- the most recent year statistics were available from the U.S. International Trade Commission -- or nearly half of all U.S. lumber imports. Canada is distantly followed by China, Brazil and Mexico as import sources.\n\nThe United States also exported nearly $10 billion of lumber to Canada in 2021, as well as $6.5 billion to Mexico.\n\nWhite House officials said lumber was an industry in which the United States should be almost entirely self-sufficient based on its resources but that America's lumber mills had been undermined by cheap imports from bad actors, some of whom were putative allies.\n\nIf they are not offset by matching increases in supply, lumber tariffs would likely push up the price of imported wood and raise prices for various industries, particularly construction.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- President Donald Trump on Saturday initiated an investigation into whether imports of lumber threaten America's national security, a step that is likely to further inflame relations with Canada, the largest exporter of wood to the United States.","url":"https://www.berkshireeagle.com/nyt/trump-picks-another-trade-fight-with-canada-over-lumber/article_de84ee66-4c91-5316-bbc8-20e0b77e4d8b.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:20:51","author":"Ana Swanson,Blox Content Management","authors":["Ana Swanson","Blox Content Management"],"language":"en","source_country":"us","sentiment":-0.088},{"id":295750922,"title":"Trump Picks Another Trade Fight With Canada Over Lumber","text":"WASHINGTON -- President Donald Trump on Saturday initiated an investigation into whether imports of lumber threaten America's national security, a step that is likely to further inflame relations with Canada, the largest exporter of wood to the United States.\n\nThe president directed his commerce secretary, Howard Lutnick, to carry out the investigation. The results of the inquiry could allow the president to apply tariffs to lumber imports. A White House official declined to say how long the inquiry would take.\n\nAn executive memorandum signed by Trump ordered the investigation and was accompanied by another document that White House officials said would expand the volume of lumber offered for sale each year, increasing supply and helping to ensure that timber prices do not rise.\n\nThe trade inquiry is likely to further anger Canada. Some of its citizens have called for boycotts of American products over Trump's plans to impose tariffs on all Canadian imports beginning Tuesday. The president, who also plans to hit Mexico with similar tariffs, says the levies are punishment for failure to stem the flow of drugs and migrants into the United States.\n\nMany Canadians have contested Trump's assertion that fentanyl is flowing from its country into the United States.\n\nCanada and the United States have sparred over protections in the lumber industry for decades. The countries have protected their own industries with tariffs and other trade measures, and argued about the legitimacy of those measures in disputes under the North American Free Trade Agreement and at the World Trade Organization.\n\nCanada provided $28 billion of lumber to the United States in 2021 -- the most recent year statistics were available from the U.S. International Trade Commission -- or nearly half of all U.S. lumber imports. Canada is distantly followed by China, Brazil and Mexico as import sources.\n\nThe United States also exported nearly $10 billion of lumber to Canada in 2021, as well as $6.5 billion to Mexico.\n\nWhite House officials said that lumber was an industry in which the United States should be almost entirely self-sufficient based on its resources but that America's lumber mills had been undermined by cheap imports from bad actors, some of whom were putative allies.\n\nPeter Navarro, the senior counselor for trade and manufacturing, said in a call with reporters Friday that \"disastrous\" timber and lumber policies \"drive up construction and housing costs and impoverish America through large trade deficits that results from exporters like Canada, Germany and Brazil dumping lumber\" into the U.S. market.\n\n\"That stops today with a pair of Trumpian actions designed to both bolster supply of and demand for American timber and lumber,\" he said.\n\nIf they are not offset by matching increases in supply, lumber tariffs would likely push up the price of imported wood and raise prices for various industries, particularly construction. The U.S. investigation will include derivative lumber products, like kitchen cabinets.\n\nThe investigation is also likely to raise questions and pushback about whether lumber imports really constitute a threat to national security.\n\nThe president has also initiated national security investigations into steel, aluminum and copper, but those metals are directly used by the military to make planes, ships and weaponry. Asked about the national security justification, the White House official said that the military was a major consumer of lumber.\n\nThis article originally appeared in The New York Times.","summary":"WASHINGTON -- President Donald Trump on Saturday initiated an investigation into whether imports of lumber threaten America's national security, a step that is likely to further inflame relations with Canada, the largest exporter of wood to the United States.","url":"https://www.berkshireeagle.com/nyt/trump-picks-another-trade-fight-with-canada-over-lumber/article_eff059cc-d321-5488-8770-b2bf38c46399.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:18:00","author":"Ana Swanson,Blox Content Management","authors":["Ana Swanson","Blox Content Management"],"language":"en","source_country":"us","sentiment":-0.198},{"id":295749630,"title":"World News | Zelenskiy Meets UK PM a Day After Oval Office Clash with Trump","text":"London [UK], March 2 (ANI): British Prime Minister Keir Starmer welcomed Ukrainian President Volodymyr Zelenskyy to 10 Downing Street on Saturday (local time), assuring him of the UK's continued support, Al Jazeera reported.\nThe meeting came a day after Zelenskyy's tense exchange with former US President Donald Trump at the White House.\nAlso Read | US President Donald Trump Cutoff of Humanitarian Parole for Immigrants From Ukraine, 6 Other Countries Challenged.\nAs Zelenskyy arrived, crowds outside Downing Street cheered in support, where Starmer hugged him and ushered him inside, as per Al Jazeera.\n\"You're very, very welcome here in Downing Street,\" Starmer told Zelenskyy. \"And as you heard from the cheers on the street outside, you have full backing across the United Kingdom.\"\nAlso Read | Russia Reacts to Volodymyr Zelensky and Donald Trump Face-Off, Says Ukrainian President's US Visit 'Complete Political and Diplomatic Failure'.\n\"We stand with you, with Ukraine, for as long as it may take.\"\nZelenskyy responded that he had seen the hundreds of supporters gathered outside Downing Street and that \"I want to thank you, the people of the United Kingdom, for such big support from the very beginning of this war.\"\n\"I'm very happy that His Majesty the King accepted my meeting tomorrow, and we are very happy in Ukraine that we have such a strategic partner,\" he added. \"We count on your support.\"\nThe United Kingdom and Ukraine signed a £2.26 billion (USD 2.84 billion) loan agreement on Saturday to strengthen Ukraine's defence capabilities. London described the deal as a sign of \"our unwavering and ongoing support for the Ukrainian people.\"\nAccording to Al Jazeera, the agreement was signed virtually by UK Finance Minister Rachel Reeves and her Ukrainian counterpart Sergii Marchenko while Prime Minister Keir Starmer met with President Volodymyr Zelenskyy in London. The loan is set to be repaid using profits from frozen Russian sovereign assets.\nStarmer's office had earlier confirmed his meeting with Zelenskyy ahead of a European leaders' summit on Sunday. The discussions will focus on shoring up support for \"securing a just and enduring peace\" in Ukraine.\nSunday's summit is also expected to address the need for Europe to increase defence cooperation amid fears about whether the US will continue to support Ukraine or NATO. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  British Prime Minister Keir Starmer welcomed Ukrainian President Volodymyr Zelenskyy to 10 Downing Street on Saturday (local time), assuring him of the UK's continued support.","url":"https://www.latestly.com/agency-news/world-news-zelenskiy-meets-uk-pm-a-day-after-oval-office-clash-with-trump-6679827.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250301214301.jpg","video":null,"publish_date":"2025-03-02 00:16:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.552},{"id":295754424,"title":"50 Cent Reignites Feud with Floyd Mayweather Over Trump Endorsement","text":"Hip-hop mogul 50 Cent has once again taken aim at boxing legend Floyd Mayweather, mocking him over his recent endorsement of former U.S. President Donald Trump.\n\nMayweather, during an appearance on Fox Business’ Making Money with Charles Payne earlier this week, described Trump as “the best president” in U.S. history, praising his business acumen and leadership.\n\n“We had Trump before, and we didn’t appreciate him,” Mayweather said. “I think Trump is a great president—actually, he’s the best president in my eyes. Great businessman, and that’s what it’s about.”\n\nMayweather further claimed that Americans are always unhappy with their leaders, regardless of who holds office.\n\n“Trump has done an amazing job, and a lot of people around America are upset,” he added. “But no matter who goes into the White House, we’re always upset. And I think Trump is the man for the job.”\n\n50 Cent Mocks Mayweather’s Comments\n\n50 Cent, never one to miss an opportunity for a public jab, reposted the interview on Instagram on Thursday (February 27), ridiculing Mayweather and reviving past allegations about the boxer’s literacy struggles.\n\n“LOL YO, you know how, when you’re in school and a kid eats the crayons,” 50 Cent wrote in the caption. “Now you see what happens when they grow up. Spell BEST PRESIDENT champ! LOL.”\n\nThis latest exchange adds to the longstanding feud between the rapper and the undefeated boxing champion, which has been marked by social media trolling and personal insults over the years.\n\nDeeper Tensions Behind the Jabs?\n\nWhile 50 Cent’s latest dig appears to be about Mayweather’s Trump endorsement, some believe the rapper’s real motivation stems from the boxer’s recent associations with Big Meech and Rick Ross—both rivals of 50 Cent.\n\nThe Power producer has been vocal about his disdain for anyone connected to the BMF (Black Mafia Family) co-founder amid their ongoing dispute. He even recently criticized Detroit rapper 42 Dugg for gifting Big Meech $100,000 following his release from prison last year.\n\n“Your daddy my [ninja emoji],” 50 Cent wrote on Instagram at the time. “You made a mistake giving Screech a $100K, you could have given that to your [ninja emojis]’s. You always been hard-headed. WTF.”\n\nWith 50 Cent and Mayweather’s history of public feuds, it remains to be seen if Mayweather will fire back or if 50’s latest trolling will go unanswered. However, given their track record, this is unlikely to be the last exchange between the two outspoken figures.","summary":"Hip-hop mogul 50 Cent has once again taken aim at boxing legend Floyd Mayweather, mocking [...]","url":"https://www.thezimbabwemail.com/entertainment/50-cent-reignites-feud-with-floyd-mayweather-over-trump-endorsement/","image":"https://www.thezimbabwemail.com/wp-content/uploads/2025/03/50-Cent-and-Floyd-Mayweather.png","video":null,"publish_date":"2025-03-02 00:15:18","author":"Gdpr Cookie Consent,Staff Reporter","authors":["Gdpr Cookie Consent","Staff Reporter"],"language":"en","category":"politics","source_country":"zw","sentiment":-0.104},{"id":295750948,"title":"National News at a Glance","text":"The New American Gun Store: Grips, Grenade Launchers and More\n\nScopes, suppressors, handgrips and muzzle brakes were once inconspicuous options associated with firearms in the United States, footnotes to the hardware that often makes headlines. But with store workers reporting lower than expected gun sales in an election year -- firearms purchases usually spike in fear of new restrictions from incoming administrations -- expensive accessories have been \"keeping the door open,\" as one retailer from coastal Maine said. A new crop of retailers is now profiting more from limited-edition accessories and promoting lifestyle gear to women, minority gun owners and the LGBTQ+ community.\n\nHow Johnson, Who Put His Job at Risk to Save Ukraine Aid, Flipped for Trump\n\nThe night before House Speaker Mike Johnson defied the hard-right wing of his party in 2024 and brought up a bill to send more than $60 billion in aid to Ukraine, he spent a mostly sleepless night in a luxury hotel suite overlooking the Potomac River, bracing for a mutiny that would end his speakership. Now, less than one year later, Johnson still has his job and has made a 180-degree conversion on Ukraine. His reversal reflects a broader Republican capitulation to President Donald Trump, even from some of Congress' most vocal Russia hawks, as Trump pursues warmer relations with Russian President Vladimir Putin.\n\nMusk and Republican Lawmakers Pressure Judges with Impeachment Threats\n\nCongressional Republicans, egged on by Elon Musk and other top allies of President Donald Trump, are escalating calls to remove federal judges who stand in the way of the administration's efforts to overhaul the government. Judicial impeachments are rare and notoriously time-consuming, and the mounting calls for removing federal judges have so far not gained much traction with congressional leaders. But even the suggestion represents another extraordinary attempt by Republicans to breach the foundational separation of powers barrier as Trump allies seek to exert iron-fisted control over the full apparatus of government.\n\nPentagon Sending Combat Forces to the Border in Line With Trump Directive\n\nThe Pentagon is sending about 3,000 additional troops to the southwestern border to comply with President Donald Trump's order to increase the military's role in stemming migrant flow into the United States. Armed infantry and support troops from the 4th Infantry Division at Fort Carson in Colorado are expected to deploy within days, two Pentagon officials said Saturday. Combined with 1,100 support troops from the military's Northern Command announced on Friday, and the recently arrived headquarters personnel from Fort Drum, N.Y., the reinforcements announced Saturday would bring the total number of active-duty troops on the border to about 9,000, Defense Department officials said.\n\nJudge Blocks Trump's Plan to End Funds for Trans Youth Health Providers in 4 States\n\nA federal judge in Seattle issued a preliminary injunction late Friday blocking the government from withholding federal funds from hospitals in four states that offer gender-transition treatment for people younger than 19. Judge Lauren King, had issued a temporary restraining order in February, finding that states and doctors suing the administration would most likely prevail in their claim that the government's plan is unconstitutional. The injunction Friday signaled that the government will need to overcome substantial legal challenges to carry it out. King said the order likely violates the separation of powers between the executive branch and Congress, and the Fifth Amendment's equal protection guarantees to youth seeking gender-related treatments.\n\nCuomo Enters NYC Mayor's Race, Upending Contest to Unseat Adams\n\nFormer Gov. Andrew Cuomo announced Saturday that he would run for mayor of New York City, upending the race to unseat Eric Adams and setting up a comeback attempt three years after he resigned in disgrace. With near-universal name recognition, deep-pocketed supporters and a decade as governor, Cuomo is expected to quickly assume front-runner status for the June Democratic primary. Cuomo has spent years and millions in taxpayer dollars fighting to clear his name after 11 sexual harassment accusations prompted his resignation in August 2021. On Saturday, Cuomo presented himself as a forceful leader capable of rescuing a city that he said \"feels threatening, out of control and in crisis.\"\n\nThis article originally appeared in The New York Times.","summary":"The New American Gun Store: Grips, Grenade Launchers and More","url":"https://www.berkshireeagle.com/nyt/national-news-at-a-glance/article_681c9377-d6c1-536f-8831-aebabe36d44e.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:14:27","author":"Elon Musk","authors":["Elon Musk"],"language":"en","source_country":"us","sentiment":0.074},{"id":295750932,"title":"World News at a Glance","text":"Kurdish Insurgent Group Declares Ceasefire in Conflict With Turkey\n\nThe Kurdish guerrilla group that has been fighting a long-running insurgency against Turkey declared a ceasefire Saturday, days after a call from its jailed leader to disarm and disband the organization raised hopes of ending a conflict that has killed tens of thousands over four decades. The Kurdistan Workers' Party, or PKK, said the ceasefire would begin immediately. But it also called for Abdullah Ocalan, the PKK's founder and leader who has been in a Turkish prison for a quarter-century, to be freed so he can oversee the group's dissolution.\n\nWelcome to the Zero Sum Era. Now How Do We Get Out?\n\nZero-sum thinking is the belief that life is a battle over finite rewards where gains for one mean losses for another. The notion seems to be everywhere. But nowhere is the rise of our zero-sum era more pronounced than on the world stage, where President Donald Trump has been demolishing decades of collaborative foreign policy with threats of protectionist tariffs and demands for Greenland, the Gaza Strip, the Panama Canal and mineral rights in Ukraine. He often channels the age he most admires -- the imperial 19th century. Now how do we get out?\n\nTrump's Dressing Down of Zelenskyy Plays Into Putin's War Aims\n\nPresident Donald Trump says he wants a quick ceasefire in Ukraine. But Russian President Vladimir Putin appears to be in no rush, and the blowup Friday between Trump and Ukrainian President Volodymyr Zelenskyy may give Putin the kind of ammunition he needs to prolong the fight. With the United States' alliance with Ukraine suffering a public rupture, Putin now seems even more likely to hold out for a deal on his terms -- and he could even be tempted to expand his push on the battlefield. The extraordinary scene in Washington -- in which Trump lambasted Zelenskyy -- was broadcast as the top story on state television in Russia.\n\nGaza Residents Mark a Somber Ramadan Amid the Rubble\n\nFood and other goods that were scarce during the Israel-Hamas war have returned to the shops and street markets of the Gaza Strip in time for the holy fasting month of Ramadan. And the Israeli bombs have fallen silent. But the shadow of the war hangs heavy over what was once one of the most joyous seasons in the territory, and life in Gaza has not even begun to return to normal. The first phase of a ceasefire between Israel and Hamas has lasted a month and a half, but it was set to elapse Saturday, which coincides with the first day of Ramadan fasting.\n\nLawsuit Against Panama Challenges Detention of Trump Deportees\n\nA group of high-profile lawyers Saturday filed a lawsuit against Panama over its detention of migrants deported from the United States, threatening to disrupt President Donald Trump's new policy of exporting migrants from around the world to Central American countries. The lawsuit names 10 Iranian Christian converts and 102 migrants detained at a camp near a jungle in Panama as plaintiffs, according to a copy seen by The New York Times. The suit argues that the United States violated the Iranian group's right to asylum on account of religious persecution and that Panama has violated domestic and international laws in its detention of the migrants.\n\nCanada Curbed Illegal Migration to the United States. Now People Are Heading to Canada.\n\nBefore his inauguration, Donald Trump accused Canada of allowing large numbers of migrants to enter the United States without legal permission. He has made stopping that movement a demand as he threatens to impose crippling tariffs on Canadian exports to the United States. After a one-month reprieve, Trump said those tariffs will go into effect Tuesday. Canada has mobilized. It has deployed more staff and equipment along the border and tightened visa rules critics say made Canada a steppingstone to enter the United States illegally. But a new dynamic is emerging at the border: Asylum-seekers are fleeing north to Canada as Trump has embarked on his plan for sweeping deportations.\n\nThis article originally appeared in The New York Times.","summary":"Kurdish Insurgent Group Declares Ceasefire in Conflict With Turkey","url":"https://www.berkshireeagle.com/nyt/world-news-at-a-glance/article_c1878740-94e8-5d88-bd8a-2f3ebb14cc19.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:13:19","author":"The New York","authors":["The New York"],"language":"en","source_country":"us","sentiment":0.013},{"id":295753778,"title":"AOC asks NPR host to clarify the ‘problem’ when he brings up mass illegal immigration","text":"Rep. Alexandria Ocasio-Cortez, D-N.Y., argued that if there is a problem with mass illegal immigration, Republicans are the ones to blame.\n\nAs Democrats continue to reel from the November election loss to now-President Donald Trump, some have argued the party needs a fresh approach to the migrant crisis plaguing the southern border. \n\nOthers, like AOC, have urged citizens to find ways to resist the president and ICE agents’ efforts to deport illegal immigrants.\n\nNational Public Radio host Steve Inskeep spoke to the congresswoman, who won office initially during Trump’s first term, about where she and her party stand now.\n\n“To what extent is immigration, as an issue, part of your problem with working-class voters?” he asked.\n\n“I guess my question would be, what does the word ‘problem’ mean?” Ocasio-Cortez replied.\n\n“People voting for the other side and not for you,” Inskeep clarified.\n\n“I think that we have a problem on immigration because of the lack of progress that we’ve had on this issue, and as we know, Republicans weaponize that lack of progress,” AOC replied. She then referred to the purportedly bipartisan bill that Republicans have argued was “never designed to solve the problem.”\n\n“It is a problem not just for Democrats, it’s a problem for the entire country that Republicans do not want to solve,” Ocasio-Cortez argued.\n\nShe appeared to echo the argument that one of the best ways to curb illegal immigration is to make more immigration legal, such as by granting citizenship to illegal immigrants, saying, “They are completely uninterested in addressing undocumented people, in addressing a path to citizenship-“\n\n“Well they do want to address undocumented people by removing them, I mean that’s what the president is attempting now,” Inskeep interjected.\n\nOcasio-Cortez argued that Republican legislation such as the Laken Riley Act guts due process, and that Republicans lack the very infrastructure they need to effectively deport people.\n\n“So they are actually creating-it’s not even about creating a deportation pipeline, they are creating a private prison camp pipeline, so they are still creating pipelines to just increase this problem here in the United States,” she said.\n\nInskeep then asked the congresswoman why this issue continues to be a “political loser” for Democrats “if what you say is true.”\n\n“I think that a lack of a path to citizenship in the United States, the lack of addressing comprehensive immigration reform creates a large population of undocumented people in the United States and that is allowed to be weaponized in many ways,” AOC replied. \n\n“We have a large population of undocumented people in the US. Overwhelmingly, it is not because they crossed the southern border of the United States,” she continued. “It’s because they came here in a documented fashion and overstayed a visa and became undocumented. And it is the lack of ability for us to expand a path to citizenship, modernize paths to citizenship over decades that create this bubbling issue that Republicans are allowed to weaponize.”","summary":"The NPR host pointed out Americans feel the Democrats 'are not serious' about solving the migrant crisis.","url":"https://nypost.com/2025/03/01/media/aoc-asks-npr-host-to-clarify-the-problem-when-he-asks-about-migrant-crisis-concerning-voters/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/99529610.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Bmt07CdU-RyIcpnTz.mp4","publish_date":"2025-03-02 00:11:40","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.096},{"id":295749924,"title":"European leaders gather in London to forge common purpose on Ukraine","text":"European leaders will gather in London on Sunday to forge a common position on ending the war in Ukraine, before the country’s premier heads off to meet the King.\n\nWhile Donald Trump’s America is the driving force behind brokering a peace with Russia, Sir Keir Starmer wants Europe to be ready to lead peacekeeping efforts should a deal be struck.\n\nAt Lancaster House, a mansion near Buckingham Palace, the Prime Minister is expected to urge the 18 countries in attendance to follow the UK in answering the US’s calls to boost defence spending.\n\nSir Keir pledged this week to raise the UK’s defence spending to 2.5% of its economic output by 2027.\n\nThe summit comes after several days in which the foundations of the transatlantic Nato alliance have been shaken.\n\nA clash between Mr Trump and Volodymyr Zelensky in the Oval Office was broadcast around the world on Friday, in which the US President claimed his counterpart was “gambling with world war three”.\n\nIt resulted in Ukraine’s president being kicked out of the White House, and a deal to exchange mineral rights for further US military support was placed on ice.\n\nReports in the US media suggested Mr Trump was even considering halting all aid to Kyiv after the meeting, in which he and his vice president, JD Vance, engaged in heated exchanges with Mr Zelensky.\n\nEuropean leaders soon rallied in a show of solidarity with Ukraine, while Sir Keir tried to keep the peace and spoke to both presidents over the phone.\n\nThe Prime Minister then welcomed Mr Zelensky to Downing Street on Saturday, in a meeting described as “meaningful and warm” by the Ukrainian leader.\n\nThe two men embraced as they met, and again later as they parted, and Sir Keir took the unusual step of walking Mr Zelensky to his car, instead of waving him goodbye from the front step of No 10.\n\nAhead of Sunday’s gathering, Chancellor Rachel Reeves meanwhile signed a loan agreement worth £2.26 billion with her Ukrainian counterpart, to pay for further military support and the rebuilding of Ukraine in future.\n\nThe UK hopes to recoup the costs from frozen Russian assets locked in bank accounts across Europe.\n\nMr Zelensky is expected to meet the King at his Sandringham estate in Norfolk on Sunday, after attending the summit.\n\nThe embattled Ukrainian leader meets Charles days after Mr Trump was offered an unprecedented second state visit to the UK as part of a charm offensive aimed at winning the US president’s support.\n\nSir Keir spoke to Mr Trump on Sunday, for the second evening in a row, as well as French President Emmanuel Macron, as he seeks to be a bridge across the Atlantic and smooth out the ongoing division between Western allies.\n\nIn other developments:\n\n– Mark Rutte, Nato secretary general, told the BBC he urged Mr Zelensky to repair his relationship with the US president in a Friday-night phone call, as the alliance’s members “need to stick together” against Russia.\n\n– Mr Zelensky described Mr Trump’s support for Ukraine as “crucial”, in a sign he was willing to mend the relationship with the US.\n\n– Conservative leader Kemi Badenoch warned in a Telegraph newspaper article that America’s commitment to Europe “cannot now be taken for granted”, after urging Sir Keir to push for “concrete” pledges during the summit.\n\n– The Liberal Democrats called for Sir Keir to restore the size of the British Army to 82,000 troops, in step with the commitment to boost defence spending by 2027.","summary":"Sir Keir Starmer wants European leaders to be ready to lead peacekeeping efforts should a deal be struck.","url":"https://www.standard.co.uk/news/politics/keir-starmer-volodymyr-zelensky-ukraine-european-president-b1214154.html","image":"https://static.standard.co.uk/2025/03/02/00/b9c11cfcc74d4862e5103bfb4d169587Y29udGVudHNlYXJjaGFwaSwxNzQwOTU4NTk1-2.79235628.jpg?width=1200","video":null,"publish_date":"2025-03-02 00:11:06","author":"David Lynch","authors":["David Lynch"],"language":"en","category":"politics","source_country":"gb","sentiment":0.081},{"id":295749638,"title":"World News | Chinese Freighter Used Taiwan Ports for 3 Months","text":"Taipei [Taiwan], March 2 (ANI): A Chinese freighter suspected of cutting an undersea cable connecting Taiwan's main island to Penghu County is believed to be owned by a Chinese state-run company, Taipei Times reported.\nThe vessel had reportedly used different names while docking at the ports of Kaohsiung and Keelung for three months. Also Read | US President Donald Trump Cutoff of Humanitarian Parole for Immigrants From Ukraine, 6 Other Countries Challenged.\nThe Togo-flagged freighter, Hong Tai 58, was detained last Tuesday along with its Chinese crew after the Taipei-Penghu No. 3 submarine cable was found severed, as per the Taipei Times.\nAccording to CGA, when the Coast Guard Administration (CGA) first attempted to detain the ship on grounds of possible sabotage, its crew said the ship's name was Hong Tai 168, although the Automatic Identification System (AIS) displayed it as Hong Tai 58.\nAlso Read | Russia Reacts to Volodymyr Zelensky and Donald Trump Face-Off, Says Ukrainian President's US Visit 'Complete Political and Diplomatic Failure'.\nThe CGA added that the ship's name would be verified by an investigation.\nA review of AIS records by the Liberty Times (the sister paper of the Taipei Times) stated that the freighter Hong Tai visited the ports of Kaohsiung, Anping, Keelung, and Busan, South Korea, in September.\nAt some point after that, the vessel reportedly switched off its AIS signal.\nAccording to the Taipei Times, in January, the freighter reactivated its AIS and was detected near Kaohsiung Port. The signal remained on until 11 am last Thursday when the Coast Guard Administration (CGA) escorted the vessel to Anping Port.\nThe records also showed that Hong Tai had two International Maritime Organization (IMO) identification numbers, violating the agency's rules.\nAlso, the freighter's Maritime Mobile Service Identities (MMSI) identification number had been used by the Tanzania-flagged Hong Da 8 and China-flagged Jin Long 389.\nThe Jin Long 389's transponder has remained silent for years, and the Hong Da 8, which is active, has operated with three MMSI numbers. The records suggested that Hong Tai 58, Hong Da 8 and Jin Long 389 were the same freighter.\nChinese state-run China COSCO Shipping Corp and Guangdong-based Jin Long Maritime Transport owned and operated the Jin Long 389, the records showed.\nThe Hong Tai 58 was linked through its MMSI numbers to six vessels.\nFive of the ships sailed between Taiwan, China and South Korea in the past three months, each using their AIS, but intermittently.\nThe Hong Da 8 had entered the Port of Anping as recently as February 2.\nEarlier, experts said the CGA should be applauded for its swift response, but each cable-cutting incident was a blow to national security and government finance.\nTaiwan must come up with a strategy to prevent further attempts to sabotage submarine cables, they added.\nFurther, the Democratic Progressive Party Legislator Puma Shen said the government should track ships that have engaged in suspicious activities, and it should cooperate with friendly nations in maritime matters, Shared intelligence would enable the government to name the suspected ships and bring pressure on Beijing, he said.\nTaiwan should strengthen its use of intelligence-gathering assets and coast guard patrol ships and severely punish saboteurs to deter Chinese crews, Institute for National Defense and Security Research fellow Shen Ming-shih said.\nThe government should obtain more rotary and low-speed fixed-wing aircraft configured for maritime surveillance and increase multi-agency collaboration efficiency, he said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  A Chinese freighter suspected of cutting an undersea cable connecting Taiwan's main island to Penghu County is believed to be owned by a Chinese state-run company.","url":"https://www.latestly.com/agency-news/world-news-chinese-freighter-used-taiwan-ports-for-3-months-6679821.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250301185823.jpg","video":null,"publish_date":"2025-03-02 00:10:20","author":null,"language":"en","source_country":"in","sentiment":-0.436},{"id":295749636,"title":"World News | Delhi: Scholar from Sydney Visits Jan Aushadhi Kendra, Commends Efforts to Ensure Affordable Medicines","text":"New Delhi [India], March 2 (ANI): Ann Liebert, Adjunct Senior Lecturer at the University of Sydney, visited the Jan Aushadhi Kendra at AIIMS, Delhi, to gain insights into the Pradhan Mantri Bhartiya Janaushadhi Pariyojana (PMBJP) and explore potential avenues for knowledge-sharing and collaboration in the field of affordable healthcare solutions.\nAnn is on a visit to Delhi for a media conclave, a statement by the, Ministry of Chemicals and Fertilisers.\nAlso Read | US President Donald Trump Cutoff of Humanitarian Parole for Immigrants From Ukraine, 6 Other Countries Challenged.\nPradhan Mantri Bharatiya Janaushadhi Pariyojana is an initiative that can be represented in many countries, said Liebert. She added that there are many remote communities in Australia that don't have easy access to pharmacies, and this model of PMBJP could be followed there to provide affordable medicine, as per the statement.\nLiebert commended the efforts of India in ensuring affordable and high-quality medicines reach citizens. She emphasised that universal access to essential medicines is critical for public health and expressed her appreciation for India's commitment to this cause.\nAlso Read | Russia Reacts to Volodymyr Zelensky and Donald Trump Face-Off, Says Ukrainian President's US Visit 'Complete Political and Diplomatic Failure'.\nLiebert was provided an overview of the Jan Aushadhi initiative, explaining its core objective of making quality generic medicines accessible at affordable prices, where she was given a guided tour of the Kendra, where she observed the range of PMBJP products and gained a deeper understanding of their impact on public healthcare in India.\nA short film showcasing the Jan Aushadhi initiative was also presented, covering the operational framework and reach of Jan Aushadhi Kendras; efficient supply chain management and expansion strategy and affordability, accessibility and stringent quality control of medicines.\nLiebert expressed keen interest in the Jan Aushadhi POS (Point of Sale) software and its role in streamlining the distribution and allocation of medicines. PMBI officials highlighted the robust quality assurance protocols under PMBJP, including procurement from WHO-GMP certified manufacturers and a two-tier quality check with NABL-accredited laboratories before distribution.\nConcluding her visit, Liebert engaged with the pharmacists and staff at the Jan Aushadhi Kendra, appreciating their dedication to making quality healthcare accessible to all.\nThe visit ended on a highly positive note, reinforcing the significance of international collaboration in advancing affordable healthcare solutions, the statement said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Pradhan Mantri Bharatiya Janaushadhi Pariyojana (PMBJP) is an initiative that can be represented in many countries, said Liebert. She added that there are many remote communities in Australia that don't have easy access to pharmacies, and this model of PMBJP could be followed there to provide affordable medicine, as per the statement.","url":"https://www.latestly.com/agency-news/world-news-delhi-scholar-from-sydney-visits-jan-aushadhi-kendra-commends-efforts-to-ensure-affordable-medicines-6679819.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250301195850.jpg","video":null,"publish_date":"2025-03-02 00:08:20","author":null,"language":"en","source_country":"in","sentiment":0.122},{"id":295747610,"title":"Israel backs US proposal to extend ceasefire in Gaza through Ramadan and Jewish Passover","text":"Israel has backed a US proposal to extend the ceasefire in Gaza through the Muslim holy month of Ramadan and the Jewish Passover holiday.\n\nPrime Minister Benjamin Netanyahu's office said Israel accepted the proposal from US President Donald Trump's envoy to the Middle East, Steve Witkoff.\n\n'Israel adopts the plan of the US president's envoy Steve Witkoff for a temporary truce for the periods of Ramadan' due to end in late March 'and Pesach', the eight-day Jewish Passover to be observed in mid-April, said the statement, released just after midnight.\n\nThe first phase of a ceasefire that took effect on January 19 expired on Saturday.\n\nA second phase of that deal was supposed to secure the release of dozens of hostages still in Gaza and pave the way for a more permanent end to the war.\n\nAccording to Netanyahu's office, Witkoff tabled this temporary extension as a stopgap after concluding that Israel and Hamas were at a negotiating impasse and could not immediately agree on the terms of a permanent ceasefire.\n\nThis is a breaking news story, more to follow","summary":"Israel has approved a US proposal to extend the truce in Gaza through the Muslim holy month of Ramadan and the Jewish Passover holiday.","url":"https://www.dailymail.co.uk/news/article-14451571/Israel-backs-US-proposal-extend-ceasefire-Gaza-Ramadan-Jewish-Passover.html","image":"https://i.dailymail.co.uk/i/pix/m_logo_1908x1146px.png","video":null,"publish_date":"2025-03-02 00:07:59","author":"Editor,Emily Jane Davies","authors":["Editor","Emily Jane Davies"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.415},{"id":295750926,"title":"Lawsuit Against Panama Challenges Detention of Trump Deportees","text":"A group of high-profile lawyers on Saturday filed a lawsuit against Panama over its detention of migrants deported from the United States, threatening to disrupt President Donald Trump's new policy of exporting migrants from around the world to Central American countries.\n\nThe lawsuit, filed against the government of Panama before the Inter-American Commission on Human Rights, names 10 Iranian Christian converts and 102 migrants detained at a camp near a jungle in Panama as plaintiffs, according to a copy seen by The New York Times.\n\nThe suit argues that the United States violated the Iranian group's right to asylum on account of religious persecution and that Panama has violated domestic and international laws, such as the American Convention on Human Rights, in its detention of the migrants.\n\nThe lawsuit was filed only against Panama, although one of the lawyers involved said he planned to file a separate complaint against the U.S. Department of Homeland Security in the coming week.\n\nResponding to a request for a comment on the lawsuit, a spokesperson for President Raúl Mulino of Panama, Astrid Salazar, said the migrants \"are not detained\" by the Panamanian government. \"They are not in our command but rather that of IOM and UNHCR.\"\n\nThe migrants are being held at a fenced camp guarded by armed Panamanian police officers, and Panama's Security Ministry controls all access to the facility. The International Organization for Migration and the U.N. Refugee Agency do not have regular presence at the camp, and have said that they are not in charge of the migrants, but rather are offering some humanitarian support, like providing funds for food.\n\nThe suit filed Saturday requests that the commission issue emergency orders saying that none of the detained migrants at the jungle camp should be deported to their countries of origin.\n\nIn mid-February the Trump administration opened a new front in its efforts to deport millions of people by sending recently arrived migrants from around the world to Central America. About 300 people were flown to Panama and held at a hotel in Panama City, including the 10 Iranian converts, several children among them.\n\nMore than 100 people who did not agree to return to their countries of origin were later transferred to a detention camp near the Darién jungle, where they remain.\n\nThis article originally appeared in The New York Times.","summary":"A group of high-profile lawyers on Saturday filed a lawsuit against Panama over its detention of migrants deported from the United States, threatening to disrupt President Donald Trump's new policy of exporting migrants from around the world to Central American…","url":"https://www.berkshireeagle.com/nyt/lawsuit-against-panama-challenges-detention-of-trump-deportees/article_79631402-94b5-5aec-8658-002d5b3a501d.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:07:50","author":"Farnaz Fassihi and Julie Turkewitz,The New York","authors":["Farnaz Fassihi and Julie Turkewitz","The New York"],"language":"en","category":"politics","source_country":"us","sentiment":-0.08},{"id":295753502,"title":"Rep. Cisneros slams ICE arrest of woman, son in El Monte","text":"LOS ANGELES — Rep. Gil Cisneros, D-Covina, on Satufday criticized the arrest of an El Monte woman and her son by U.S. Immigration and Customs Enforcement officials.\n\nHer family told NBC4 that Yolanda does not have a criminal record and that Johnathan’s unspecified crime occurred 12 years ago.\n\n“These arrests are sickening, and I have grave concerns with how these arrests were reported to have been carried out by ICE,” Cisneros said in a statement. “The 31st District is home to many immigrant families who came to our country wanting to contribute to our communities and local economy. This El Monte family was simply trying to care for the youngest daughter and work to provide her with the healthcare treatments she needs. Stoking fear, targeting our community members, and ripping apart families is not an acceptable solution for our broken immigration system. We need humane comprehensive immigration reform that addresses bad actors, but still upholds our American values and helps bring immigrants who have been living in our country out of the shadows. My office will continue to monitor this situation.”\n\nICE officials released the following statement to NBC4:\n\n“ICE is focused (on) public safety and national security threats first and foremost. However, any individual illegally present in the U.S. who is encountered during an immigration enforcement operation may be taken into custody and processed for removal as stated by law.”\n\nSince taking office in January, President Donald Trump has followed through on his promise to increase enforcement of the nation’s immigration laws, carrying out deportation operations in multiple states focused primarily on undocumented immigrants accused of crimes.\n\nA series of recent federal law enforcement actions in the Los Angeles area have caught the attention of local officials and immigrant-rights activists.\n\nLos Angeles City Councilwoman Eunisses Hernandez spoke at the beginning of Friday morning’s council meeting to express concern about the activity.\n\n“Colleagues, this morning we have been receiving reports from my district and from others about aggressive immigration raids and enforcement,” Hernandez said. “My team and I have been in contact with community members and rapid response organizers since early this morning. The stories we are hearing are heartbreaking and indefensible. When we fought to make Los Angeles a sanctuary city last year, it’s because this is what we feared. We feared for our neighbors, for our families for our children, families being ripped apart. We feared for people who would be targeted by weak-minded politicians who rely on ripping families apart.”\n\nLAPD Chief Jim McDonnell said Friday that the department was not assisting in any federal actions directed at illegal immigration.\n\n“I want to be absolutely clear: The LAPD does not participate in civil immigration enforcement,” McDonnell said. “This has been the department’s policy since 1979, and it remains unchanged today.”\n\nMeanwhile, the Department of Defense announced Saturday that the Pentagon is deploying a Stryker Brigade Combat Team and a General Support Aviation Battalion to the southwestern border to boost security. The units, equipped with wheeled vehicle and air capabilities, are set be employed in the coming weeks.\n\nEach SBCT is a mechanized infantry force of approximately 4,400 soldiers.\n\n“These forces will arrive in the coming weeks, and their deployment underscores the department’s unwavering dedication to working alongside the Department of Homeland Security to secure our southern border and maintain the sovereignty, territorial integrity and security of the United States under President Trump’s leadership,” Pentagon Press Secretary Sean Parnell said.","summary":"The 50-year-old woman, identified in multiple media reports as Yolanda, was arrested last Monday at her home along with her son Johnathan.","url":"https://www.ocregister.com/2025/03/01/rep-cisneros-slams-ice-arrest-of-woman-son-in-el-monte/","image":"https://www.ocregister.com/wp-content/uploads/2025/03/SGT-L-CISNEROS-CONGRESS-05.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-02 00:07:23","author":"Tom Bray","authors":["Tom Bray"],"language":"en","category":"politics","source_country":"US","sentiment":-0.012},{"id":295750928,"title":"Judge Blocks Trump's Plan to End Funds for Trans Youth Health Providers in 4 States","text":"SEATTLE -- A federal judge in Seattle issued a preliminary injunction late Friday blocking the government from withholding federal funds from hospitals in four states that offer gender-transition treatment for people younger than 19. The decision dealt a setback to a key part of the Trump administration's broad effort to limit the official recognition of transgender identity.\n\nThe judge, Lauren J. King, had issued a temporary restraining order in February, finding that the states and doctors suing the administration would most likely prevail in their claim that President Donald Trump's plan is unconstitutional. The injunction Friday night signaled that the government will need to overcome substantial legal challenges to carry it out.\n\nKing said that Trump's order likely violates the separation of powers between the executive branch and Congress, and the Fifth Amendment's equal protection guarantees to youth seeking gender-related treatments. But she denied the states' challenge of a section of the order directing the Justice Department to investigate providers under a law that bans female genital mutilation, stating that \"no credible threat of prosecution exists\" in such cases.\n\n\"The court's holding here is not about the policy goals that President Trump seeks to advance; rather, it is about reaffirming the structural integrity of the Constitution by ensuring that executive action respects congressional authority,'' King wrote. \"This outcome preserves an enduring system of checks and balances that the founders considered to be 'essential to the preservation of liberty.'\"\n\nThe injunction by King, an appointee of President Joe Biden, applies only to medical providers in Washington, Oregon, Minnesota and Colorado, the states that brought the suit along with three doctors affiliated with the University of Washington School of Medicine.\n\nKing's injunction also blocks the government from carrying out parts of an earlier order Trump issued directing that grant funding for research or education does not support \"gender ideology,'' which it defines as the \"false claim that males can identify as and thus become women and vice versa.\"\n\nThis article originally appeared in The New York Times.","summary":"SEATTLE -- A federal judge in Seattle issued a preliminary injunction late Friday blocking the government from withholding federal funds from hospitals in four states that offer gender-transition treatment for people younger than 19. The decision dealt a setback to…","url":"https://www.berkshireeagle.com/nyt/judge-blocks-trumps-plan-to-end-funds-for-trans-youth-health-providers-in-4-states/article_b8eaea15-9af4-5b17-ba55-04661e85aaea.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:07:12","author":"Amy Harmon and Drew Atkins,Blox Content Management","authors":["Amy Harmon and Drew Atkins","Blox Content Management"],"language":"en","category":"politics","source_country":"us","sentiment":-0.209},{"id":295750936,"title":"Lawsuit Against Panama Challenges Detention of Trump Deportees","text":"A group of high-profile lawyers on Saturday filed a lawsuit against Panama over its detention of migrants deported from the United States, threatening to disrupt President Donald Trump's new policy of exporting migrants from around the world to Central American countries.\n\nThe lawsuit, filed against the government of Panama before the Inter-American Commission on Human Rights, names 10 Iranian Christian converts and 102 migrants detained at a camp near a jungle in Panama as plaintiffs, according to a copy seen by The New York Times.\n\nThe suit argues that the United States violated the Iranian group's right to asylum on account of religious persecution and that Panama has violated domestic and international laws, such as the American Convention on Human Rights, in its detention of the migrants.\n\nThe lawsuit was filed only against Panama, although one of the lawyers involved said he planned to file a separate complaint against the U.S. Department of Homeland Security in the coming week.\n\nResponding to a request for a comment on the lawsuit, a spokesperson for President Raúl Mulino of Panama, Astrid Salazar, said the migrants \"are not detained\" by the Panamanian government. \"They are not in our command but rather that of IOM and UNHCR.\"\n\nThe migrants are being held at a fenced camp guarded by armed Panamanian police officers, and Panama's Security Ministry controls all access to the facility. The International Organization for Migration and the U.N. Refugee Agency do not have regular presence at the camp, and have said that they are not in charge of the migrants, but rather are offering some humanitarian support, like providing funds for food.\n\nThe suit filed Saturday requests that the commission issue emergency orders saying that none of the detained migrants at the jungle camp should be deported to their countries of origin.\n\n\"Panama's government has no domestic or international authority to detain people under these circumstances,\" said Ian Kysel, associate clinical professor of law at Cornell Law School and the plaintiffs' lead counsel.\n\nIn mid-February the Trump administration opened a new front in its efforts to deport millions of people by sending recently arrived migrants from around the world to Central America. About 300 people were flown to Panama and held at a hotel in Panama City, including the 10 Iranian converts, several children among them.\n\nMore than 100 people who did not agree to return to their countries of origin were later transferred to a detention camp near the Darién jungle, where they remain.\n\nThe Trump administration has since thanked Panama for its assistance in tackling migration challenges. But the arrival of the deportees and their detentions have created problems for Mulino's government, which agreed to take the migrants but has received criticism from the United Nations, human rights activists and lawyers for holding them without criminal charges.\n\nThe human rights commission is a seven-member body whose decisions apply to members of the Organization of American States, including Panama. It is meant to be used when individuals feel their domestic legal options have been exhausted or in cases where irreparable harm is imminent and plaintiffs say they need rapid legal protections.\n\nThe commission cannot impose sanctions, but ignoring its decisions could come with political risks.\n\nJosé Miguel Vivanco, an expert on Latin American human rights issues and fellow at the Council on Foreign Relations, said that if the commission ruled in the plaintiffs' favor, he thought Panama would comply.\n\nWere the commission to rule in favor of the plaintiffs, halting their deportations, it could make it more difficult for Trump to persuade leaders in Panama and elsewhere to take in migrants the United States does not want to deal with.\n\nAfter sending the migrants to Panama, the Trump administration sent 200 migrants from Central Asia, the Middle East and Eastern Europe to Costa Rica, including dozens of children. As in Panama, the migrants are being held at a remote facility several hours' drive from the capital.\n\nKysel said similar legal actions are expected against other countries in Latin America, including Costa Rica, that are cooperating with Trump and accepting deportees.\n\nIn both cases, the Central American governments said they planned to deport people quickly to their home countries. In the lawsuit, lawyers argue that for the Iranian Christians deportation would carry \"irrefutable harm,\" because Iran's law stipulates that converting from Islam is a crime punishable by death.\n\n\"I am afraid of what will happen to me at the hands of the government of Panama,\" one of the Iranians, Artemis Ghasemzadeh, said in a sworn declaration filed in the lawsuit. \"I still want to seek asylum in the United States and pursue a free life as a Christian there.\"\n\nGhasemzadeh, 27, who fled Iran in December and made her way from Mexico across the southern U.S. border, has been publicizing their ordeal in media interviews. She first attracted global attention when a video in which she recounted being shackled and deported to Panama spread widely online.\n\nThe commission typically issues decisions in such cases within days, Vivanco said.\n\nThe bar for the commission to issue protections to plaintiffs is very high, he said. But given Iran's policy toward converted Christians, he thought the case had a chance. \"I think this is going to get the attention of everyone involved,\" he said.\n\nKysel said he hoped the lawsuit deterred other countries from participating in Trump's deportation plans.\n\n\"Panama and any other country in the region face legal liability if they receive, detain and deport asylum-seekers summarily expelled from the United States,\" Kysel said.\n\nThe lawsuit is a result of collaboration among lawyers and legal groups in multiple countries.\n\n(STORY CAN END HERE. OPTIONAL MATERIAL FOLLOWS.)\n\nOne of the lawyers, Ali Herischi, who is representing the Iranians pro bono, said he plans on filing a separate lawsuit in the coming week against the Department of Homeland Security. The lawsuit would be on behalf of Ghasemzadeh and the nine Iranian Christian converts, three of them children, in Panama and three Iranians deported to Costa Rica.\n\nA spokesperson for the Department of Homeland Security has previously said that none of the migrants had \"asserted fear of returning to their home country at any point during processing or custody.\"\n\nGhasemzadeh contends she repeatedly asked to fill out paperwork for asylum but immigration officials at the camp in California where she was held kept telling her this was not the time.\n\nHerischi said the motion would challenge the legality of their deportation and requests as a remedy that the group be allowed to apply for asylum in the United States.\n\nThis article originally appeared in The New York Times.","summary":"A group of high-profile lawyers on Saturday filed a lawsuit against Panama over its detention of migrants deported from the United States, threatening to disrupt President Donald Trump's new policy of exporting migrants from around the world to Central American…","url":"https://www.berkshireeagle.com/nyt/lawsuit-against-panama-challenges-detention-of-trump-deportees/article_55589d77-8395-5687-a8aa-36ccc2c8d273.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:04:00","author":"Farnaz Fassihi and Julie Turkewitz,The New York","authors":["Farnaz Fassihi and Julie Turkewitz","The New York"],"language":"en","category":"politics","source_country":"us","sentiment":-0.017},{"id":295749604,"title":"Two lunar landings in a week for Nasa's private Moon fleet","text":"WASHINGTON: More than fifty years passed between the last Apollo mission and the United States' return to the lunar surface, when the first-ever private lander touched down last February. Now, starting Sunday, two more missions are set to follow within a single week, marking a bold push by Nasa and its industry partners to make Moon landings a routine part of space exploration.First up is Firefly Aerospace's Blue Ghost Mission 1, nicknamed \"Ghost Riders in the Sky.\"After launching in January on a 45-day journey, it is targeting touchdown near Mons Latreille, a volcanic feature in Mare Crisium on the Moon's northeastern near side, at 3.34 am US Eastern time (0834 GMT). Along the way, it has captured stunning footage of the Moon, coming as close as 60 miles (100 kilometers) above the surface.The golden lander, about the size of a hippopotamus, carries ten instruments, including one to analyze lunar soil, another to test radiation-tolerant computing, and a GPS-based navigation system. Designed to operate for a full lunar day (14 Earth days), Blue Ghost is expected to capture high-definition imagery of a total eclipse on March 14, when Earth blocks the Sun from the Moon's horizon.On March 16, it will record a lunar sunset, offering insights into how dust levitates above the surface under solar influence -- creating the mysterious lunar horizon glow first documented by Apollo astronaut Eugene Cernan.Hopping droneBlue Ghost's arrival will be followed on March 6 by Intuitive Machines' IM-2 mission, featuring its lander, Athena.Last year, Intuitive Machines made history as the first private company to achieve a soft landing on the Moon, though the moment was tempered by a mishap.Coming down too fast, one of the lander's feet caught on the lunar surface, tipping it over and causing it to rest sideways -- limiting its ability to generate solar power and cutting the mission short. This time, the company says it has made key improvements to the hexagonal-shaped lander, which has a taller, slimmer profile than Blue Ghost, and is around the height of an adult giraffe. Athena launched on Wednesday aboard a SpaceX rocket, taking a more direct route toward Mons Mouton -- the southernmost lunar landing site ever attempted.It carries an ambitious set of payloads, including a unique hopping drone designed to explore the Moon's underground passages carved by ancient lava flows, a drill capable of digging three feet beneath the surface in search of ice, and three rovers. The largest, about the size of a beagle, will connect to the lander and hopper using a Nokia cellular network in a first-of-its-kind demonstration.But \"Grace,\" the hopping drone -- named after computing pioneer Grace Hopper -- could well steal the show if it succeeds in showing it can navigate the Moon's treacherous terrain in ways no rover can.Nasa's private Moon fleetLanding on the Moon presents unique challenges due to the absence of an atmosphere, making parachutes ineffective. Instead, spacecraft must rely on precisely controlled thruster burns to slow their descent while navigating hazardous terrain.Until Intuitive Machines' first successful mission, only five national space agencies had accomplished this feat: the Soviet Union, the United States, China, India and Japan, in that order. Now, the United States is working to make private lunar missions routine through NASA's $2.6 billion Commercial Lunar Payload Services (CLPS) program, a public-private initiative designed to deliver hardware to the surface at a fraction of traditional mission costs.These missions come at a pivotal moment for NASA, amid speculation that it may scale back or even cancel its Artemis lunar program in favor of prioritizing Mars exploration -- a key goal of both President Donald Trump and his close advisor, SpaceX founder Elon Musk.","summary":"More than fifty years passed between the last Apollo mission and the United States' return to the lunar surface, when the first-ever private lander touched down last February.  Now, the United States is working to make private lunar missions routine through NASA's $2.6 billion Commercial Lunar Payload Services (CLPS) program, a public-private initiative designed to deliver hardware to the surface at a fraction of traditional mission costs.","url":"https://timesofindia.indiatimes.com/world/us/two-lunar-landings-in-a-week-for-nasas-private-moon-fleet/articleshow/118657052.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-118657068/118657068.jpg","video":null,"publish_date":"2025-03-02 00:03:33","author":null,"language":"en","source_country":"in","sentiment":0.208},{"id":295747542,"title":"European leaders gather in London to forge common purpose on Ukraine","text":"European leaders will gather in London on Sunday to forge a common position on ending the war in Ukraine.\n\nWhile Donald Trump’s America is the driving force behind brokering a peace with Russia, Sir Keir Starmer wants Europe to be ready to lead peacekeeping efforts should a deal be struck.\n\nAt Lancaster House, a mansion near Buckingham Palace, the Prime Minister is expected to urge the 18 countries in attendance to follow the UK in answering the US’s calls to boost defence spending.\n\nSir Keir pledged this week to raise the UK’s defence spending to 2.5% of its economic output by 2027.\n\nThe summit comes after several days in which the foundations of the transatlantic Nato alliance have been shaken.\n\nA clash between Mr Trump and Volodymyr Zelensky in the Oval Office was broadcast around the world on Friday, in which the US President claimed his counterpart was “gambling with world war three”.\n\nIt resulted in Ukraine’s president being kicked out of the White House, and a deal to exchange mineral rights for further US military support was placed on ice.\n\nReports in the US media suggested Mr Trump was even considering halting all aid to Kyiv after the meeting, in which he and his vice president, JD Vance, engaged in heated exchanges with Mr Zelensky.\n\nEuropean leaders soon rallied in a show of solidarity with Ukraine, while Sir Keir tried to keep the peace and spoke to both presidents over the phone.\n\nThe Prime Minister then welcomed Mr Zelensky to Downing Street on Saturday, in a meeting described as “meaningful and warm” by the Ukrainian leader.\n\nThe two men embraced as they met, and again later as they parted, and Sir Keir took the unusual step of walking Mr Zelensky to his car, instead of waving him goodbye from the front step of No 10.\n\nAhead of Sunday’s gathering, Chancellor Rachel Reeves meanwhile signed a loan agreement worth £2.26 billion with her Ukrainian counterpart, to pay for further military support and the rebuilding of Ukraine in future.\n\nThe UK hopes to recoup the costs from frozen Russian assets locked in bank accounts across Europe.\n\nMr Zelensky is expected to meet the King at his Sandringham estate in Norfolk on Sunday, after attending the summit.\n\nThe embattled Ukrainian leader meets Charles days after Mr Trump was offered an unprecedented second state visit to the UK as part of a charm offensive aimed at winning the US president’s support.\n\nSir Keir spoke to Mr Trump on Sunday, for the second evening in a row, as well as French President Emmanuel Macron, as he seeks to be a bridge across the Atlantic and smooth out the ongoing division between Western allies.\n\nIn other developments:\n\n– Mark Rutte, Nato secretary general, told the BBC he urged Mr Zelensky to repair his relationship with the US president in a Friday-night phone call, as the alliance’s members “need to stick together” against Russia.\n\n– Mr Zelensky described Mr Trump’s support for Ukraine as “crucial”, in a sign he was willing to mend the relationship with the US.\n\n– Conservative leader Kemi Badenoch warned in a Telegraph newspaper article that America’s commitment to Europe “cannot now be taken for granted”, after urging Sir Keir to push for “concrete” pledges during the summit.\n\n– The Liberal Democrats called for Sir Keir to restore the size of the British Army to 82,000 troops, in step with the commitment to boost defence spending by 2027.","summary":"European leaders will gather in London on Sunday to forge a common position on ending the war in Ukraine. While Donald Trump’s America is the driving force behind brokering a peace with Russia, Sir Keir Starmer wants Europe to be ready to lead peacekeeping efforts should a deal be struck. At Lancaster House, a mansion [&#8230;]\n\n\nThe post European leaders gather in London to forge common purpose on Ukraine appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/02/european-leaders-gather-in-london-to-forge-common-purpose-on-ukraine/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/2.79235628-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-02 00:01:53","author":"Newsdesk","authors":["Newsdesk"],"language":"en","category":"politics","source_country":"gb","sentiment":0.139},{"id":295750930,"title":"Judge Blocks Trump's Plan to End Funds for Trans Youth Health Providers in 4 States","text":"SEATTLE -- A federal judge in Seattle issued a preliminary injunction late Friday blocking the government from withholding federal funds from hospitals in four states that offer gender-transition treatment for people younger than 19. The decision dealt a setback to a key part of the Trump administration's broad effort to limit the official recognition of transgender identity.\n\nThe judge, Lauren J. King, had issued a temporary restraining order in February, finding that the states and doctors suing the administration would most likely prevail in their claim that President Donald Trump's plan is unconstitutional. The injunction Friday night signaled that the government will need to overcome substantial legal challenges to carry it out.\n\nKing said that Trump's order likely violates the separation of powers between the executive branch and Congress, and the Fifth Amendment's equal protection guarantees to youth seeking gender-related treatments. But she denied the states' challenge of a section of the order directing the Justice Department to investigate providers under a law that bans female genital mutilation, stating that \"no credible threat of prosecution exists\" in such cases.\n\n\"The court's holding here is not about the policy goals that President Trump seeks to advance; rather, it is about reaffirming the structural integrity of the Constitution by ensuring that executive action respects congressional authority,'' King wrote. \"This outcome preserves an enduring system of checks and balances that the founders considered to be 'essential to the preservation of liberty.'\"\n\nThe injunction by King, an appointee of President Joe Biden, applies only to medical providers in Washington, Oregon, Minnesota and Colorado, the states that brought the suit along with three doctors affiliated with the University of Washington School of Medicine.\n\nIn a separate lawsuit, a judge in Maryland has temporarily instructed the Trump administration to keep federal funding in place for all providers in the country who offer youth gender medicine. A more considered ruling is expected in that case before its emergency order expires next week.\n\nThe ruling is the second preliminary injunction in a string of legal challenges to Trump's effort to block government agencies and taxpayer-funded institutions from supporting gender transition, or from recognizing people based on their gender identities. Last month, another federal judge blocked Trump's directive to withhold gender-transition medical treatment for federal prisoners and to house transgender women inmates with men.\n\nThe administration has sought to bar transgender women and girls from competing in women's sports, to bar openly transgender people from serving in the military, to no longer reflect the gender identities of transgender people on passports, and to bar references to gender identity in executive departments and agencies.\n\nThe order on medical treatments, titled \"Protecting Children From Chemical and Surgical Mutilation,\" states that the goal is to protect young people from long-term effects that may cause them to regret undergoing the treatments. It directs agencies to withhold funds from medical providers that offer puberty blockers, hormone therapies and surgeries to people younger than 19 for the purpose of gender transition.\n\nAfter it was issued, several hospitals stopped providing the treatments, and the lawsuit says that others may begin doing the same. A White House news release from early February stated that the order was \"already having its intended effect\" and cited several announcements from hospitals.\n\nKing's injunction also blocks the government from carrying out parts of an earlier order Trump issued directing that grant funding for research or education does not support \"gender ideology,'' which it defines as the \"false claim that males can identify as and thus become women and vice versa.\"\n\nYoung people seeking transition treatments in most Republican-led states have already had to travel elsewhere to receive them. Since 2021, amid an intensifying fight over when medical transition is appropriate for young people, 24 states have banned the treatments for minors. In December, the Supreme Court heard oral arguments in a case involving a Tennessee law that prohibits transition treatments for minors, and the justices appeared to lean toward upholding that state's law.\n\nIn recent years, several European countries have limited the treatments after scientific reviews, and the American Academy of Pediatrics has said that it was conducting its own review of the evidence. But the academy and most major medical groups in the United States continue to endorse youth gender medicine as effective in relieving the psychological distress that many young trans people say they experience when their bodies do not reflect their internal sense of gender.\n\nTrump's order is an effort to place financial pressure on clinics, largely in Democrat-led states, that continue to provide the treatments.\n\nIn her order, King wrote that the states had shown that they would lose hundreds of millions of dollars in federal funding, as well as experience \"devastating consequences for all manner of medical research and treatment,\" in the absence of an injunction. She also said that transgender youth deprived of the treatments would experience \"dire harms.''\n\nThis article originally appeared in The New York Times.","summary":"SEATTLE -- A federal judge in Seattle issued a preliminary injunction late Friday blocking the government from withholding federal funds from hospitals in four states that offer gender-transition treatment for people younger than 19. The decision dealt a setback to…","url":"https://www.berkshireeagle.com/nyt/judge-blocks-trumps-plan-to-end-funds-for-trans-youth-health-providers-in-4-states/article_58ef99df-b256-5b86-a974-886a2cdb34a2.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-02 00:01:24","author":"Amy Harmon and Drew Atkins,Blox Content Management","authors":["Amy Harmon and Drew Atkins","Blox Content Management"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":295749930,"title":"Ralph Fiennes and Cynthia Erivo among British talent hoping for Oscar success","text":"British stars Ralph Fiennes, Cynthia Erivo and Felicity Jones will be hoping for Oscar success in the acting categories at this year’s ceremony.\n\nSinger and actress Erivo, 38, is nominated in the leading actress category for her role as bullied green witch, Elphaba, in the film adaptation of the hit musical Wicked.\n\nIf Erivo wins the Oscar she will earn the coveted Egot status, making her the winner of an Emmy, Grammy, Oscar and Tony, alongside names such as Sir Elton John, actresses Viola Davis and Jennifer Hudson, and singer John Legend.\n\nThe Harriet actress will also perform at this year’s ceremony, the 97th Academy Awards, as will her co-star Ariana Grande, 31, who is nominated in the supporting actress category for playing Glinda in Wicked.\n\nAlso nominated in the leading actress category is Demi Moore, for the body-horror film The Substance, and Anora star Mikey Madison, who won the leading actress Bafta in February.\n\nOther names in the running are Emilia Perez actress Karla Sofia Gascon and Brazilian star Fernanda Torres for her role in I’m Still Here.\n\nTorres’s mother Fernanda Montenegro was nominated more than two decades ago in the best actress category for road trip movie Central Station.\n\nNetflix musical Emilia Perez leads this year’s nominations with 13, but has also hit headlines after social media posts Gascon made about Islam, the death of George Floyd and diversity at the Oscars resurfaced following the musical’s release.\n\nThe Spanish language movie, which also stars US actresses Zoe Saldana and Selena Gomez, is directed by Jacques Audiard and tells the story of a Mexican cartel boss who enlists the help of a lawyer to assume a new identity as a woman.\n\nBritish star Fiennes, who is nominated for papal drama Conclave, will face off against Adrien Brody for immigrant tale The Brutalist, Timothee Chalamet for Bob Dylan biopic A Complete Unknown and Colman Domingo for Sing Sing, about prisoners becoming part of a theatre group.\n\nIf Chalamet takes the Oscar, he will become the youngest winner of the prize, taking the title from Brody – who was also 29 when he won the Oscar for Holocaust drama The Pianist – by just a few months.\n\nSebastian Stan is also up for the category for playing Donald Trump before he became the US president in The Apprentice.\n\nConclave, about the election of a Catholic pope in the Vatican, and A Complete Unknown are named in eight award categories, while Wicked and The Brutalist have 10 nominations.\n\nThis year’s ceremony takes place following the wildfires which ravaged parts of Los Angeles in January.\n\nIn the supporting actor categories, The Brutalist star Jones has landed her second Oscar nomination as former Succession stars Jeremy Strong and Kieran Culkin secured their first Academy Awards nods.\n\nBritish star Jones, who previously received a best actress nomination for biopic The Theory Of Everything, will compete against Emilia Perez star Saldana and Italian-born US star Isabella Rossellini for playing a nun in Conclave.\n\nAlso nominated in the category is US pop singer Grande for Wicked and Monica Barbaro for A Complete Unknown.\n\nIn the supporting actor category, Culkin is nominated for A Real Pain, for playing a cousin to Jesse Eisenberg’s character who goes on a trip to retrace his Jewish grandmother’s past escaping the Holocaust in Poland, while Strong is nominated for his role as former Trump mentor Roy Cohn in The Apprentice.\n\nThey are nominated alongside Russian actor Yura Borisov for Anora, and Edward Norton for A Complete Unknown and Australian star Guy Pearce for The Brutalist.\n\nSir Elton John is competing in best original song for a fifth time, on this occasion for the release of his music documentary song Never Too Late for the Disney+ film Elton John: Never Too Late, about his Farewell Yellow Brick Road concert tour.\n\nThe ceremony will be hosted by comedian Conan O’Brien, and will also see performances from US rapper Doja Cat and British singer Raye.\n\nPresenters include Indiana Jones star Harrison Ford, British stars Andrew Garfield, and Joe Alwyn, Irish Oscar winner Cillian Murphy, Scarlett Johansson, Emilia Perez actress Gomez, and talk show host Oprah Winfrey.","summary":"Netflix musical Emilia Perez has 13 nominations but has been surrounded by controversy ahead of the ceremony.","url":"https://www.standard.co.uk/news/uk/ralph-fiennes-cynthia-erivo-british-elton-john-oscar-b1214161.html","image":"https://static.standard.co.uk/2025/03/02/00/9ccdc6c83fdcc826bfb07bf770228b13Y29udGVudHNlYXJjaGFwaSwxNzQwODM1Mzc1-2.78246774.jpg?width=1200","video":null,"publish_date":"2025-03-02 00:01:00","author":"Kerri-Ann Roper","authors":["Kerri-Ann Roper"],"language":"en","source_country":"gb","sentiment":0.808},{"id":295752028,"title":"Bessent ‘Slightly Shocked’ by Scale of Fraud Uncovered by DOGE","text":"Treasury Secretary Scott Bessent said Friday that the Department of Government Efficiency (DOGE) is making significant strides in cutting federal spending, adding that he is “slightly shocked” by the extent of fraud uncovered—not just waste and abuse.\n\n“I think we can make a pretty big hit here,” he replied, explaining that if DOGE identifies $300 billion in savings—which he suggested is possible—it could reduce the annual deficit by approximately 1 percentage point as a share of gross domestic product (GDP).\n\nEven if the savings total only $150 billion, he said, this is still “moving us back toward the target, and we’re determined to get this down.”\n\nBessent emphasized that DOGE, which was tasked by President Donald Trump with rooting out waste, fraud, and abuse in federal spending, has already uncovered substantial inefficiencies—and a surprising amount of outright fraud.\n\nWhen in comes to “waste, fraud, and abuse, I think most of us think in terms of waste and abuse,” Bessent said. “I’ve got to tell you that I’m slightly shocked at some of the fraud we’re finding, and you’re going to be hearing about more of that over the next couple of weeks.”\n\nAs for the ultimate savings that DOGE will deliver, Bessent said: “We'll see.”\n\nDOGE, led by Elon Musk in a special government role, has an 18-month mandate to slash $2 trillion in federal spending before its scheduled dissolution on Independence Day 2026. Musk has acknowledged the ambitious nature of this goal, saying that even cutting half that amount would be a major step toward reducing inefficiency and lowering deficits.\n\nThe CBO has warned that persistently high debt could slow economic growth, increase interest payments to foreign creditors, heighten the risk of a fiscal crisis, and limit policymakers’ ability to respond to future downturns. It has stressed that lawmakers must pursue comprehensive fiscal reforms, including spending cuts, revenue increases, or a combination of both, to put the budget on a sustainable long-term path.\n\nMeanwhile, DOGE’s aggressive efforts have drawn criticism from Democrats in Congress, who accuse the agency of overstepping its authority and operating without sufficient oversight or transparency. The agency also faces multiple lawsuits, some challenging its access to federal data and others questioning its constitutional legitimacy.\n\nBessent’s remarks suggest that such accountability may be on the horizon.","summary":"As DOGE pushes to cut spending, Treasury Secretary Scott Bessent says he’s somewhat shocked by the amount of fraud it has already uncovered.","url":"https://www.theepochtimes.com/us/bessent-slightly-shocked-by-scale-of-fraud-uncovered-by-doge-5818405","image":"https://img.theepochtimes.com/assets/uploads/2025/02/23/id5814861-Scott-Bessent-GettyImages-2198518365-300x180.jpg","video":null,"publish_date":"2025-03-02 00:00:25","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","source_country":"us","sentiment":-0.102},{"id":295750408,"title":"Thủ tướng Hungary đề nghị châu Âu cần ‘đồng điệu’ với Mỹ trong vấn đề Ukraine","text":"Trong bức thứ gửi tới tới Chủ tịch Hội đồng châu Âu Antonio Costa, ngay trước hội nghị thượng đỉnh khẩn cấp về quốc phòng, Thủ tướng Hungary Viktor Orban đã đề nghị châu Âu cần có cách tiếp cận giống Mỹ trong giải quyết vấn đề Ukraine hiện nay.\n\n Thủ tướng Hungary Viktor Orban phát biểu họp báo tại Budapest ngày 23/2/2024. Ảnh: AFP/TTXVN\n\nTheo đó, ông Orban cho biết: “Rõ ràng là có những khác biệt chiến lược trong cách tiếp cận của chúng ta đối với Ukraine mà không thể giải quyết được thông qua soạn thảo hoặc trao đổi”. Ông nhấn mạnh rằng Liên minh châu Âu (EU) cần có những bước đi tương đồng với Mỹ khi tuyên bố: “Tôi tin rằng Liên minh châu Âu nên tham gia thảo luận trực tiếp với Nga về lệnh ngừng bắ.n và hòa bình bền vững ở Ukraine”.\n\nBên cạnh đó, ông Orban cũng kêu gọi các nhà lãnh đạo EU tránh thông qua tuyên bố chung về Ukraine tại hội nghị thượng đỉnh ngày 6/3 tại Brussels.\n\nĐại diện của Hội đồng châu Âu cho biết đã nhận được bức thư từ Thủ tướng Hungary Orban nhưng từ chối đưa ra bình luận. Trong khi đó, chính phủ Hungary cũng chưa đưa ra trả lời cho các câu hỏi từ giới truyền thông.\n\nTại hội nghị thượng đỉnh khẩn cấp ở Brussels, các nhà lãnh đạo EU dự kiến ​​sẽ thảo luận về việc tăng chi tiêu quốc phòng, cung cấp thêm viện trợ cho Ukraine và xây dựng cách tiếp cận thống nhất cho các cuộc đàm phán tiềm năng.\n\nBloomberg trích dẫn nguồn thạo tin về các cuộc thảo luận cho biết rằng lập trường của EU sẽ tập trung vào việc tăng cường khả năng tự vệ của Ukraine và cam kết đảm bảo an ninh trong tương lai.\n\nVideo đang HOT\n\nChủ tịch Ủy ban Châu Âu Ursula von der Leyen dự kiến ​​sẽ trình bày đề xuất tài trợ trong hội nghị thượng đỉnh, khi các nhà lãnh đạo “lục địa già” cũng chuẩn bị cho các cuộc thảo luận tại London (Anh) vào ngày 3/3.\n\nKể từ khi cuộc xung đột Nga – Ukraine nổ ra vào năm 2022, Thủ tướng Orban được cho là có những động thái nhằm phản đối những nỗ lực hỗ trợ của EU tới Kiev cũng như ngăn hoặc trì hoãn các lệnh trừng phạt đối với Điện Kremlin. Truyền thông phương Tây cho biết chính lập trường của Thủ tướng Hungary đã phơi bày thêm những rạ.n nứ.t trong khối, đặc biệt là khi các nhà lãnh đạo châu Âu đang loay hoay tìm cách đối phó trước cách tiếp cận mới về xung đột Nga – Ukraine từ Tổng thống Mỹ Donald Trump.\n\nGần đây, Tổng thống Trump đã khiến các đồng minh châu Âu lo ngại khi tiến hành các cuộc đàm phán riêng rẽ với Moskva cũng như từ chối hành động lên án Nga trong cuộc xung đột hiện nay – vấn đề mà các nhà lãnh đạo châu Âu thường xuyên đề cập.\n\nTheo Bloomberg, các nhà lãnh đạo EU đã dành nhiều tuần cố gắng thuyết phục Tổng thống Trump không vội vàng ký kết một thỏa thuận theo các điều khoản từ phía Tổng thống Nga Vladimir Putin – một động thái mà họ lo ngại có thể làm suy yếu an ninh của châu Âu.\n\nBên cạnh Hungary, Thủ tướng Slovakia Robert Fico cũng đã kêu gọi các bên đạt được một thỏa thuận ngừng bắ.n ngay lập tức – một lập trường dường như đang đi ngược lại với Kiev và nhiều quốc gia EU.\n\nTheo một tài liệu mà Bloomberg nắm được, Thủ tướng Fico tuyên bố rằng Slovakia sẽ không hỗ trợ Ukraine về mặt tài chính hoặc quân sự để tiếp tục cuộc chiến. Ông cũng sẽ thúc đẩy việc nối lại hoạt động vận chuyển khí đốt của Nga đến Slovakia và Tây Âu.\n\nPhát biểu trước thềm hội nghị thượng đỉnh của châu Âu, ông Fico cho biết: “Nếu hội nghị thượng đỉnh không tôn trọng việc có những ý kiến ​​khác ngoài việc tiếp tục chiến tranh, Hội đồng châu Âu có thể không thể đạt được đồng thuận về kết luận liên quan đến Ukraine vào thứ Năm (6/3)”.\n\nVào tối 28/2, cuộc họp báo giữa Tổng thống Mỹ Donald Trump và người đồng cấp Ukraine tại Phòng Bầu dục của Nhà Trắng đã kết thúc bằng một cuộc tranh luận căng thẳng về viện trợ của Mỹ cho Ukraine, dẫn đến việc hủy bỏ kế hoạch ký kết thỏa thuận khai thác khoáng sản giữa Mỹ và Ukraine. Động thái trên đang làm dấy lên nghi ngờ mới về khả năng chấm dứt cuộc chiến Nga – Ukraine.\n\nTrước những diễn biến trên, nhiều nhà lãnh đạo châu Âu đã lên thể hiện tiếng ủng hộ đối với Tổng thống Zelensky sau cuộc họp căng thẳng với Tổng thống Trump tại Phòng Bầu dục. Chủ tịch Ủy ban châu Âu Ursula von der Leyen và Chủ tịch Hội đồng châu Âu Antonio Costa đã trấn an Tổng thống Ukraine về sự ủng hộ liên tục của EU.\n\nVề phía Hungary, Thủ tướng Orban có cách tiếp theo một chiều hướng khác hơn. Ông đán.h giá cao cách tiếp cận của Tổng thống Trump và tuyên bố: “Những người mạnh mẽ tạo ra hòa bình, những người yếu đuối tạo ra chiến tranh”. Ông Orban cũng gửi lời cảm ơn tới ông Trump vì đã “dũng cảm đấu tranh vì hòa bình” và nhấn mạnh sự chia rẽ ngày càng gia tăng trong quan điểm của châu Âu về cuộc xung đột Nga – Ukraine.\n\nHungary cảnh báo Ukraine trở thành Afghanistan với châu Âu Hungary, quốc gia thuộc EU và NATO, cảnh báo chiến sự ở Ukraine có thể biến thành Afghanistan với châu Âu, khiến lục địa này kiệt quệ và mệt mỏi. Thủ tướng Hungary Viktor Orban (Ảnh: EPA). Thủ tướng Hungary Viktor Orban nhận định rằng cuộc chiến ở Ukraine có thể trở nên mệt mỏi và vô vọng đối với EU giống như...","summary":"Đại diện của Hội đồng châu Âu cho biết đã nhận được bức thư từ Thủ tướng Hungary Orban nhưng từ chối đưa ra bình luận. Trong khi đó, chính phủ Hungary cũng chưa đưa ra trả lời cho các câu hỏi từ giới truyền thông.","url":"https://vietgiaitri.com/thu-tuong-hungary-de-nghi-chau-au-can-dong-dieu-voi-my-trong-van-de-ukraine-20250302i7389828/","image":"https://t.vietgiaitri.com/2025/3/1/thu-tuong-hungary-de-nghi-chau-au-can-dong-dieu-voi-my-trong-van-de-ukraine-600x432-6bd-7389828.webp","video":null,"publish_date":"2025-03-01 23:57:26","author":"Bình Thanh","authors":["Bình Thanh"],"language":"en","category":"politics","source_country":"vn","sentiment":0.395},{"id":295755118,"title":"Slovakia will not back Kiev’s war effort – Fico","text":"Bratislava will no longer provide military or financial aid to Kiev, Slovak Prime Minister Robert Fico has said, rejecting the Western mantra of “peace through force” and calling for an immediate ceasefire in Ukraine.\n\nThe announcement came in response to a tense meeting at the White House on Friday, where Ukraine’s Vladimir Zelensky, US President Donald Trump, and Vice President J.D. Vance were expected to formalize a minerals agreement between Washington and Kiev. The discussion devolved into a heated exchange when Zelensky insisted that Trump should support Kiev more rather than remain neutral to mediate a ceasefire with Moscow.\n\nTrump cut the meeting short, stating that Zelensky was “not ready” for peace. “We’re looking for peace. We’re not looking for somebody that’s going to sign up a strong power and then not make peace because they feel emboldened,” the US leader told the press afterward.\n\n“Slovakia will not support Ukraine, neither financially nor militarily, to continue the war. If others do so, we will respect it,” Fico wrote on social media on Saturday.\n\nThe Slovak leader criticized Kiev’s Western backers for pursuing “peace through force,” calling the approach unrealistic and a pretext for prolonging hostilities.\n\n“Ukraine will never be strong enough to negotiate from a position of military power,” he argued.\n\nSlovakia plans to propose an “immediate ceasefire” at the upcoming EU summit on March 6, even though the initiative has already been rejected by Zelensky and several EU member states.\n\nFico also warned that restricting Russian gas supplies harms European industry, calling for the resumption of gas transit through Ukraine to Slovakia and Western Europe.\n\n“Gas from east to west is not flowing, but Ukraine is taking European gas instead,” he said, describing the current situation as “absurd” and insisting that EU assistance to Ukraine “cannot be a one-way ticket.”\n\nWhile acknowledging the need to strengthen Europe’s defense capabilities, he urged EU leaders to recognize differing views on the Ukraine conflict. “If it is not respected at the summit that there are opinions other than continuing the war, the European Council may not be able to agree on conclusions about Ukraine,” he added.\n\nSince returning to office in 2023, Fico has been a vocal critic of the EU’s stance on the Ukraine conflict. He has halted Slovakia’s military aid to Kiev, opposed Ukraine’s NATO membership bid, and advocated for immediate peace talks. Fico has also criticized EU sanctions on Russia, arguing that they are ineffective and damaging to Europe, and has urged the West to resume normal dialogue with Moscow.","summary":"Robert Fico rejected the Western mantra of “peace through force,” arguing it only prolongs the Ukraine conflict \nRead Full Article at RT.com","url":"https://www.rt.com/news/613562-fico-ukraine-aid-power/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67c39ddd85f540682b536790.jpg","video":null,"publish_date":"2025-03-01 23:54:46","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.436},{"id":295749712,"title":"Reciprocal tariffs may make Indian generic drugs costlier in US: Pharma giants on Trump stance","text":"Mumbai: A looming threat of reciprocal tariffs on exports of pharmaceuticals from India by US President Donald Trump initially caused worries of a negative impact. However, while there is no clarity on the actual contours of the decision, doyens of the domestic pharmaceutical industry say levying tariffs may make generic drugs marginally costlier for the US patients and even lead to drug shortages.Dilip Shanghvi, chairman and managing director at Sun Pharma, India's largest drug maker by sales and market cap, told an industry gathering that his company sells products between $1 and $5 per bottle in the US and a tariff of 10% or 25% may marginally change that cost. Possibly it will not justify relocating manufacturing, Shanghvi said, responding to Trump's frenetic calls to either set up manufacturing bases in the US or face tariffs. He added the profit margins for drugs sold in the US are so low that the ability to absorb tariffs is limited. Ultimately it will get passed on to the consumers, he noted. For FY24, Sun Pharma had 32% of its total sales of ₹47,800 crore from the US, a notch higher than 31% that came from its home market India.118653999Umang Vohra, global CEO at Cipla, the third largest drug maker in India, asked for a holistic view of the tariff issue. He noted the quantum of imports of pharmaceutical products from the US to India is not significant. If a big medicine brand (from US or Europe) is sold in India at a very high price, a large section of our society cannot afford it...Tariffs (in India) are in any case between 0% and 10% and on most lifesaving drugs it is nil he said.India Moots Tariff Waiver“On the other side, the US needs much lower tariffs from the Indian companies because generic drugs industry is the only one that reduces their (US) healthcare spends,” Vohra added.He said from the pharma perspective it is very difficult to understand why there is even a talk of tariffs. “It is early to say but I am not sure if tariffs should be paid as there is a risk that four years later those tariffs may even go away,” he added. Vohra has a point seen from the historical data. A study by global consulting firm IQVIA shows overall, medicines from Indian companies provided $219 billion in savings to the US healthcare system in 2022 and a total savings of $1.3 trillion between 2013 and 2022. For example, during 2022, 23 Indian companies supplied 60% of all hypertension drug prescriptions in the US, leading to $25.3 billion in savings due to their affordability.Industry experts added India imports roughly $800 million worth of drugs from the US annually, of which 60% drugs attract nil tariffs, while India’s exports to the US are 10x more at over $9 billion. According to media reports, a proposal mooted to the Indian government by the Indian Pharmaceutical Alliance (IPA), the largest industry group, says if tariffs for the rest 40% of the drugs imported from the US are waived, it will not make a significant impact on revenues but can add an edge at the government level negotiations.Besides, industry experts who spoke on the sidelines of IPA’s 10th Pharmaceutical Quality Summit in Mumbai rejected the idea of setting up manufacturing facilities in the US as a bargain to ward-off the threat of tariffs.","summary":"Indian pharmaceutical industry leaders indicate that proposed US tariffs on pharmaceutical exports may lead to increased drug costs and potential shortages in the US. They argue that the tariffs might be absorbed by consumers and stress the significant cost savings that affordable Indian generics provide to the US healthcare system.","url":"https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/reciprocal-tariffs-may-make-indian-generic-drugs-costlier-in-us-pharma-giants-on-trump-stance/articleshow/118653963.cms","image":"https://img.etimg.com/thumb/msid-118654042,resizemode-4,width-1200,height-900,imgsize-186796,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-01 23:53:00","author":"Vikas Dandekar","authors":["Vikas Dandekar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.249},{"id":295749646,"title":"World News | Mud-covered Carnival Revellers Are Strange Sight in Sleepy Brazilian Town","text":"Paraty (Brazil), Mar 2 (AP) Several hundred mud-covered Carnival revellers paraded in the sleepy seaside town of Paraty in southeastern Brazil on Saturday, a decades-old tradition that has grown ever larger since its first edition nearly 40 years ago. Joyous partygoers threw themselves into the silty shallows in front of one Paraty beach, emerging grey from the sludge. They danced on the beach and grunted cavemen chants -- “Uga! Uga!” -- before marching along the sand. Also Read | US President Donald Trump Cutoff of Humanitarian Parole for Immigrants From Ukraine, 6 Other Countries Challenged. “It's the best bloco. It's not often that you can get muddy and go around dancing and singing. It's very gooey, it's sticky and it stinks, but it's very good,” said Thais Beazussi, 20, who lives almost two hours away by car, but makes the annual trip. Carnival in Brazil is a combination of world-famous parades by samba schools who spend all year around preparing and eccentric street parties, each with their own theme, aesthetic or musical style. Also Read | Russia Reacts to Volodymyr Zelensky and Donald Trump Face-Off, Says Ukrainian President's US Visit 'Complete Political and Diplomatic Failure'. The mud party's tradition dates to 1986, according to Paraty's tourism website. Friends were playing in the mangroves at Jabaquara Beach, and realised they weren't recognisable. They went strolling into the city's historic centre and caused a stir. The next year, a group lathered themselves up with mud to present themselves as a prehistoric tribe for Carnival. They carried skulls, vines and bones as they uttered their chants, the site said. And so the mud party was born. And in the years since, it has become a beloved tradition. Its growth has forced organisers and Paraty's tourist office to promote awareness ahead of the event regarding the importance of not dirtying the city's colourful walls, cars or onlookers. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Several hundred mud-covered Carnival revellers paraded in the sleepy seaside town of Paraty in southeastern Brazil on Saturday, a decades-old tradition that has grown ever larger since its first edition nearly 40 years ago.","url":"https://www.latestly.com/agency-news/world-news-mud-covered-carnival-revellers-are-strange-sight-in-sleepy-brazilian-town-6679810.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-01 23:46:08","author":null,"language":"en","source_country":"in","sentiment":0.016},{"id":295748496,"title":"Oscars Prop Bets And Odds Include Kanye, Red Carpet, Speeches And Picks","text":"Workers set up an Oscar statue in the red carpet area before the 97th Academy Awards in Los Angeles, ... [+] Saturday, March 1, 2025. (AP Photo/Jae C. Hong)\nCopyright 2025 The Associated Press. All rights reserved\n\nHollywood’s biggest night is Sunday, and there are hundreds of ways to wager on the Oscars. The Academy Awards include 20+ categories, and the highly-anticipated “Wicked” night includes musical performances as well. Beyond the daily sports betting options including on major events like the upcoming NCAA Tournament, movie and entertainment fans can get in on the watch and wager action with additional juicy prop bets to accompany the awards.\n\nWhile the legality of some of these Acadamy Awards props and betting options varies for select regulated U.S. Sportsbooks, top online sportsbook and Panama-based BetOnline is a fan favorite and has been a market leader in providing more betting options for sports and entertainment fans. That’s especially the case for people in the most populated states that currently don’t offer betting at U.S. sportsbooks - Texas, Florida and California, where the Oscars takes place at the Dolby Theatre in Hollywood.\n\nTune in Sunday, March 2 with the official live red carpet show starting at 6:30 p.m. ET / 3:30 p.m. PT and the ceremony itself set to begin at 7 p.m. ET. The red carpet and ceremony will be broadcast live on ABC Network including local ABC stations, ABC.com, and the ABC App. You can also stream the show live on Hulu, YouTube TV, FuboTV, and AT&T TV.\n\nTelevision host, comedian and actor Conan O’Brien will host the ceremony to celebrate artistry and innovation in filmmaking. Nearly two dozen celebrity presenters will share the stage, along with musical guests headlined by Ariana Grande and Cynthia Erivo.\n\nThe Academy will continue its mission to recognize and uphold excellence in the motion picture arts and sciences, inspire imagination, and connect the world through the medium of motion pictures.\n\nMORE FOR YOU\n\nGoogle Will Delete My Gmail And Photos On April 3—How To Save Yours\n\nPhysical Attacks Against Bitcoin Holders Surge As BTC Price Rises\n\nState Street Drops Corporate Board Diversity Requirement: Here Are All The Companies Cutting DEI Programs\n\n“The Oscars is totally opinion based,” says DraftKings Director Johnny Avello. “There’s really nowhere to look for what they’ve done in past performances except for some of the previous awards they won leading up to the Oscars.”\n\nOscars Props\n\nBetOnline has created a menu of eight Oscars props, which include topics such as Kayne West, worst dressed, Conan O’Brien and curse words. Often entertaining and amusing, Bet types, terms and options including on props can vary from leading online sportsbooks. Oscars odds are subject to change and will be updated in real-time on BetOnline.ag.\n\nWill Kanye West make a red-carpet appearance?\n\nYes (2/1, or +200) or No (1/3 or -300)\n\nWhat will be primary color of Ariana Grande red carpet dress?\n\nPink (-150) - Grey/Silver (+300) - Blue (+400) - Green (+600) - White (+600) - Yellow (+700) - Gold (+800)\n\nWho will be named \"worst outfit\" by DailyMail.com?\n\nAriana Grande (+160) - Megan Thee Stallion (+500) - Demi Moore (+500) - Kristen Stewart (+700) - Zendaya (+800) - Timothee Chalamet (+1000) - Cynthia Erivo (+1000) - Zoe Saldana (+1000) - Felicity Jones (+1000) - Billie Eilish (+1000) -DaVine Joy Randolph (+1000) - Lady Gaga (+1000) - Angelina Jolie (+1000) -Scarlett Johansson (+1000) - Matt Stone (+1200) Trey Parker (+1200) Anne Hathaway (+1200)\n\nWhat will be length of Conan O'Brien's opening monologue?\n\nOver 6.5 minutes (-175), Under 6.5 minutes (+135)\n\nWho will be mentioned first in Conan O'Brien's opening monologue?\n\nDonald/Trump (1/2, or -200) - Elon Musk (3/2, or +150)\n\nWill any recipient be censored during acceptance speech?\n\nYes (-150) - No (+100)\n\nWho will the Best Actor thank first? Same odds for Best Actress.\n\nThe Academy (-250) - Director (+300) - Husband/Wife/Partner (+600 or +740) - Mother (+800 down from +1200) - God (+1000 up from +700) - Viagara or Ozempic (50/1)\n\nAcademy Awards\n\nBest Picture\n\nThe Brutalist, a movie about a Holocaust survivor emigrating to the United States, won most critics awards and Best Picture – Drama at the Golden Globes. But it’s the third choice in the odds to win. See more insight and odds along with picks from an Off Shore Gaming Association colleague and entertainment insiders.\n\nAnora (-290) - Conclave (+210) - The Brutalist (+600)\n\nBig longshots include A Complete Unknown (+3300), Emilia Perez (+6600) and Wicked (+7500).\n\nThe Producer’s Guild Award (PGA) went to Anora, a convoluted movie about an American stripper working in a Russian neighborhood in Brooklyn who is set up with the son of a Russian oligarch. The oligarch convinces her to marry him at a Nevada wedding chapel (Las Vegas sportsbook?) to get a green card and the rest of the movie centers around the Oligarch parents trying to get the wedding annulled.\n\nAdrien Brody (-250 up from -190) in The Brutalist is the likely winner, and seemed like a virtual lock after winning all the early awards and BAFTA. If there’s an upset, then Timothee Chalamet (+140), playing Bob Dylan in A Complete Unknown, is the biggest challenger followed by Ralph Fiennes (+1200) in Conclave.\n\nChalamet got a lot of notice leading up to the SAG Award which he won. The SAG is noted as the most important predictor for actor success at the Oscars, but Brody won the BAFTA, Golden Globe for Actor Drama and Critics Choice Award, while Chalamet really only won the SAG and a couple of small film critics awards.\n\nBest Actress\n\nDemi Moore in The Substance (-300) - Mikey Madison Anora (+185) - Fernanda Torres I’m Still Here (+1000) - Cynthia Erivo Wicked (+2500) - Karla Sofía Gascón Emilia Pérez (+3300)\n\nDemi Moore got a lot of attention for her performance in The Substance, a movie about an older actress who takes a drug that transforms her into a younger version of herself. However, many critics said that her performance was almost a co-lead role since much of the movie features Margaret Qualley, who plays the younger Moore. Nevertheless, Moore won a few awards including the Golden Globe but most importantly, she won the SAG Award, which makes her the clear favorite. The only other real candidate is Mikey Madison, who plays the forementioned stripper in the film Anora.\n\nBest Director\n\nSean Baker Anora (-275) - Brady Corbet The Brutalist (+150) - James Mangold A Complete Unknown (+2000) - Coralie Fargeat The Substance (+2500) - Jacques Audiard Emilia Pérez (+2500)\n\nPredictions And Betting For The 97th Oscars\n\nCheck out more categories and predictions from a colleague at Off Shore Gaming Assocation, along with the Short Film picks below from an Oscars and entertainment insider.\n\nLive Action Short: The Man Who Could Not Remain Silent (+175 odds)\n\nDocumentary Short: The Only Girl in the Orchestra (+500)\n\nAnimated Short: Beautiful Man (+240)\n\nAs entertainment fans gear up for the glitz and glamour of Hollywood’s biggest night, there will be lots of people who can’t remain silent if some of the their favorites don’t win an Oscar, including Kieren Culkin (-5000) in the movie A Real Pain.\n\nYou can bet on it.\n\nMORE FROM FORBES\n\nForbesOscars 2025: Time, Where To Watch And More – Everything To KnowBy Tim LammersForbesLights, Camera, Leadership! Authentic Lessons From Oscars SpeechesBy Vibhas RatanjeeForbesPGA Tour 2025 Signature Events And Top Players Performances And OddsBy Jay GinsbachForbesKentucky Derby Championship Series Prep Race Schedule And 2025 TrackerBy Jay Ginsbach\n\nFollow me on Twitter. Check out my website.\nEditorial StandardsForbes Accolades","summary":"Hollywood’s biggest night is Sunday, and there are thousands of ways to wager on the Oscars. Betting odds, props, picks and information you can bet on for the 97th Academy Awards on Sunday, March 2, 2025.","url":"https://www.forbes.com/sites/jayginsbach/2025/03/01/oscars-prop-bets-and-odds-include-kanye-red-carpet-speeches-and-picks/","image":"https://imageio.forbes.com/specials-images/imageserve/67c387c0fbdaf6af308ae662/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-03-01 23:45:51","author":"Ariana Grande,Contributor,Jay Ginsbach","authors":["Ariana Grande","Contributor","Jay Ginsbach"],"language":"en","source_country":"US","sentiment":0.388},{"id":295749410,"title":"European Leaders Hold Crisis Talks In London After Zelenskyy’s Clash With Trump","text":"WASHINGTON — It was the White House clash watched around the world.\n\nWhat many Americans and Europeans hoped would be a meeting demonstrating strong U.S. support for Ukraine at a critical time in its more than three-year-old war with Russia, turned into a debacle no one expected.\n\nU.S. President Donald Trump and Vice President JD Vance slammed Ukrainian President Volodymyr Zelenskyy before domestic and international media as an ungrateful “tough guy” not interested in peace before cutting the meeting short.\n\nAs video of the astonishing tense exchange between what were considered two allies made its way around the world, European leaders, concerned about Trump’s outreach to Russia behind their backs, rushed to express support for Ukraine and its leader.\n\n“We will continue our support to Ukraine so that they can continue to fight back the aggressor,” Kaja Kallas, the EU high representative for foreign affairs and security policy, said in a post on X.\n\n“Today it became clear that the free world needs a new leader. It’s up to us, Europeans, to take this challenge,” she added.\n\nFriedrich Merz, who is set to become the chancellor of Germany and recently raised concerns about the political trajectory of the United States, also rushed to say his country stands united with Ukraine.\n\nPolish Prime Minister Donald Tusk, whose government has been a strong supporter of Ukraine in the war, told Zelenskyy and his \"dear Ukrainian friends, you are not alone.\"\n\nZelenskyy's early departure followed a meeting in which he pressed for U.S. security commitments and said there should be \"no compromises with a killer,\" a clear reference to Russian President Vladimir Putin,.\n\nTrump, meanwhile, said Ukraine would need to make concessions and that Kyiv should be more grateful for U.S. support.\n\nAfter shaking hands as they met on February 28 for the first time since Trump took office last month, the two leaders appeared at ease as they talked.\n\nBut then the exchange turned icy right in front of the cameras, raising their voices and reviving a dispute that Trump launched a week ago when he falsely blamed Ukraine for the war and called Zelenskyy a \"dictator.\"\n\n\"You're not acting at all thankful. It's not a nice thing,\" said Trump, who has had a difficult relationship with Zelenskyy since the latter was elected in 2019.\n\n\"It's going to be very hard to do business like this,\" he added.\n\n\"You’re gambling with the lives of millions of people,\" Trump said.\n\n\"You’re gambling with World War III, and what you’re doing is very disrespectful to...this country that’s backed you far more than a lot of people say they should have.”\n\nWith the cameras running inside the Oval Office, Trump and Zelenskyy continued to interrupt each other with the U.S. president telling his visitor \"your country's in big trouble. You're not winning.... You have a damn good chance of getting out of this OK because of us.... You don't have the cards.\"\n\nThe meeting was being closely watched for signs of whether the United States would commit to providing further aid to Kyiv or promise any specific security guarantees against further Russian aggression as part of any cease-fire or peace deal.\n\nThe two had been expected to sign a framework agreement on U.S. access to Ukraine's mineral resources. The agreement, now in at least its third version, was a source of contention between Trump and Zelenskyy earlier this month as they disagreed over the value of the deal and the absence of concrete security guarantees.\n\nBefore the clash, Zelenskyy told reporters inside the White House that he hoped the minerals deal would be a step forward for Ukraine and said he wanted to discuss in more detail with Trump what the United States is ready to do for his country.\n\nTrump said the agreement with Kyiv would be \"very fair\" and that a truce in Russia's war against Ukraine is \"fairly close.\" He said Ukraine would have to make compromises.\n\nAs he rejected Trump's call for compromise, Zelenskyy showed the U.S. president pictures of alleged Russian atrocities.\n\nZelenskyy's visit to Washington was aimed at shoring up U.S. support to repel Russia's assault at a time when Trump has shifted the White House's policy stance to end more than three years of isolation sparked by the Kremlin's unprovoked invasion.\n\nBeyond his meeting with the president, Zelenskyy engaged with key U.S. lawmakers, influential religious figures, and a think tank to bolster support for Ukraine, especially within Trump's Republican Party.\n\nPrior to arriving at the White House, Zelenskyy met with a bipartisan delegation from the Senate, where Ukraine enjoys strong support, to press for continued military aid. He also met with Franklin Graham, an evangelical leader who has sway within the Republican party.\n\nHowever, following the tense White House encounter, a discussion scheduled with Zelenskyy at the Hudson Institute, a conservative think tank, was canceled. CNN reported that it was Zelenskyy who had called off the session.\n\n'What Diplomacy?'\n\nThe clash began as the meeting with reporters present was about to wrap up, when Vice President JD Vance answered a question from a reporter who said Trump’s outreach to Putin unnerved Europeans. Vance said former President Joe Biden “talked tough” about Putin but didn’t stop the Russian leader.\n\n“The path to peace, the path to prosperity, is maybe engaging in diplomacy,” Vance said. “What makes America a good country is America engaging in diplomacy. That’s what President Trump is doing.”\n\nZelenskyy then responded to Vance, saying he and European leaders had negotiated with Putin and agreed to a cease-fire in 2019, when Trump was president, but that Russia had violated it.\n\n“He broke the cease-fire,\" Zelenskyy said of Putin. \"He killed our people…. What kind of diplomacy, JD, you are talking about? What do you mean?”\n\nVance responded with apparent anger.\n\n“I think it is disrespectful for you to come into the Oval Office and try to litigate this in front of the American media,” the vice president said. Trump then spoke sternly, telling Zelenskyy he holds no cards.\n\nIt was the second time in two weeks that the two leaders got into a fiery exchange, the first time a long-distance war of words. After Trump blamed Ukraine for the war, Zelenskyy said the U.S. president was being fed Russian propaganda.\n\nTrump responded angerly in a February 19 social media post, calling Zelenskyy a \"dictator\" who risks losing his country if he doesn't act fast to accept a peace deal.\n\nTrump played down the comments and struck a far softer tone at a joint news conference with visiting British Prime Minister Keir Starmer on the eve of Zelenskyy's visit, saying, \"Did I say that? I can't believe I said that.\"\n\nTrump also said he had a \"lot of respect\" for Zelenskyy, adding that Ukrainians \"have fought very bravely.\"\n\nUkrainian analyst Serhiy Harmash told Current Time he believes Trump stepped back from his earlier comments because meeting with a leader he had disparaged \"would be a blow to his credibility.\"\n\n\"And he's interested in meeting [Zelenskyy] because he needs to sign this minerals framework agreement\" to notch a diplomatic achievement and bolster his image as a dealmaker,\" said Harmash, who was in previous negotiations with Russia.\n\nNonetheless, Trump and Zelenskyy seemed at odds on some issues as they spoke to reporters before their White House meeting.\n\nBesides disagreeing with Zelenskyy on the need to compromise with Putin, Trump warned the Ukrainian leader that he was \"gambling with World War III\" and \"should be grateful\" to the United States.\n\nMinerals Deal\n\nThe main purpose of the meeting with Zelenskyy at the White House was to sign a framework agreement on the development of Ukrainian mineral deposits, including rare earth metals and fossil fuels.\n\nTrump says the deal will allow the United States to recoup some of the aid it has sent to Ukraine over the past three years while also stimulating Ukrainian economic growth.\n\n“It is like a huge economic development project. So it'll be good for both countries,” the U.S. president said. He said the United States working on mineral extraction in Ukraine would amount to “automatic security because nobody’s going to be messing around with our people when we’re there.”\n\nThe text of the agreement, a copy of which was obtained by RFE/RL, says the United States “supports Ukraine’s efforts to obtain security guarantees needed to establish lasting peace” and has “a long-term financial commitment to the development of a stable and economically prosperous Ukraine.”\n\nBut Washington has not promised concrete security guarantees, something Zelenskyy says is an absolute necessity if there is a cease-fire or peace deal due to concerns that Russia, which has been on the offensive since seizing Crimea in 2014 and holds about 20 percent of Ukraine, could build up its army and attack again.\n\n\"I’m not going to make security guarantees...very much,” Trump told reporters earlier this week. “We’re going to have Europe do that.”\n\nWhat Did Starmer and Macron Hope To Achieve With Trump?\n\nThe meeting of Trump and Zelenskyy comes during a week of lightning diplomacy between Europe and the United States.\n\nMeeting with Trump at the White House in a bid to mend a strained transatlantic relationship triggered by disagreements over Ukraine and trade, Starmer urged the U.S. president to guarantee Ukraine’s security should a deal be reached to end the fighting.\n\nTrump, who took office a month ago, has moved aggressively to end the war in Ukraine, holding a lengthy phone call with Russian President Vladimir Putin earlier this month and sending his national security team to Saudi Arabia to meet their Russian counterparts.\n\nAfter a meeting of U.S. and Russian officials in Istanbul on February 27, aimed at resolving disputes over their respective diplomatic missions, the Russian Foreign Ministry said the United States had given Moscow its blessing to appoint a new ambassador to Washington, Aleksandr Darchiyev.\n\nThe outreach to the Kremlin turned the U.S. policy with Russia on its head and shocked European leaders, who feared Trump would cut a deal with Moscow behind their backs that could hurt Ukraine and weaken their own security.\n\nNow, European leaders are traveling to Washington promising to step up their role in any settlement to steer the U.S. president away from what they worry could be an agreement that concedes too much to Russia and leaves them vulnerable.\n\nAt a White House news conference with Trump following their bilateral meeting, Starmer reiterated that Britain is ready to step up and contribute to a peacekeeping force in Ukraine if a deal is reached.\n\n“The U.K. is ready to put boots on the ground and planes in the air to support a deal, working together with our allies, because that is the only way that peace will last,” Starmer said.\n\nHe cautioned against rushing to end the war at any cost.\n\n“We have to get it right. We have to win the peace. It can’t be peace that rewards the aggressor. History must be on the side of the peacemaker, not the invader,” Starmer said.\n\nTrump did not commit to backstopping a European troop presence, a key ask of Starmer and French President Emmanuel Macron, who traveled to Washington on February 24.\n\nStarmer said he and Trump discussed a peace plan that \"Ukraine will help shape\" and that is \"backed by strength to stop Putin coming back for more.\"\n\nHe added that teams from the United States and the U.K. \"are going to be talking about how we make sure that deal sticks, is lasting, and enforced.\"\n\nU.K. media said Starmer is seeking U.S. guarantees of air, intelligence, logistics, and communications support for a European peacekeeping force.\n\nWhen asked about U.S. security guarantees, Trump said it was too early to discuss as a cease-fire had yet to be reached. Prior to his meeting with Starmer, Trump indicated a U.S. backstop wouldn’t be necessary because Putin could be trusted not to violate a peace deal.\n\nThat is not a view shared by European leaders or Zelenskyy. At his news conference with Trump, Macron said Putin had violated previous agreements with Ukraine, underscoring why strong deterrence that included a U.S. backstop was necessary.","summary":"The lavish interiors of Lancaster House in London will host crisis talks on March 2 as European leaders seek to recover from collective shock and horror after Ukrainian President Volodymyr Zelenskyy’s disastrous visit to Washington this week.","url":"https://www.rferl.org/a/london-starmer-europe-ukraine-zelenskyy-loan-summit-russia/33332840.html","image":"https://gdb.rferl.org/78a8c24f-acf2-4fef-b424-28016b7ea50f_cx0_cy1_cw0_w1080_h608.jpg","video":null,"publish_date":"2025-03-01 23:43:59","author":"Ray Furlong","authors":["Ray Furlong"],"language":"en","category":"politics","source_country":"iq","sentiment":0.034},{"id":295747606,"title":"Panic in Times Square as person stabbed in broad daylight as thousands march in support of Ukraine","text":"There was panic in New York's Times Square on Saturday afternoon after a person was stabbed in broad daylight close to where a march in support of Ukraine was taking place.\n\nThere were thousands of people including tourists and protestors in the area at the time the stabbing occurred at around 3pm on West 47th Street. \n\nThe NYPD confirmed officers were looking for a 20-year-old Asian male, about 5 foot 5 inches who was wearing a black puffer jacket. \n\nNo details were released as to the identity of the victim or what happened in the moments before the stabbing. The person's condition was unclear Saturday evening.\n\nDemonstrators were gathered to rally in support of Ukraine commemorating the third anniversary of Russia's invasion. \n\nWaving Ukrainian flags and holding banners with messages like 'Russia is a terrorist state' and 'Stand with Ukraine,' protesters called for continued global support. \n\nProtesters joined together in song, waving Ukrainian flags, including one held by dozens of people. \n\nThe city is home to the largest Ukrainian community in the US, with around 150,000 Ukrainian New Yorkers. \n\nThe demonstration took place one day after President Donald Trump and the Ukrainian leader Volodymyr Zelensky clashed in an explosive manner during meeting in the White House's Oval Office.\n\nDuring the diplomatic blowout broadcast around the world, Trump claimed his Ukrainian counterpart was 'gambling with World War Three'.\n\nThe Ukrainian leader was also accused of not being thankful enough for US military aid by both the US president and his vice president JD Vance, after he attempted to question some of their claims. \n\nThe spat has shaken the foundations of NATO, with European allies rallying to Ukraine's side, while Trump's American backers have insisted he was standing up for their country's interests.\n\nMedia reports on Saturday suggested Trump considered cutting off all aid to Ukraine following their clash.","summary":"A person was stabbed in broad daylight in New York's Times Square on Saturday near a large demonstration supporting Ukraine, causing panic among thousands of attendees.","url":"https://www.dailymail.co.uk/news/article-14451279/Panic-Times-Square-person-stabbed-broad-daylight-thousands-march-support-Ukraine.html","image":"https://i.dailymail.co.uk/1s/2025/03/01/23/95731259-0-image-a-14_1740870113722.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/01/3444260502154003982/1024x576_MP4_3444260502154003982.mp4","publish_date":"2025-03-01 23:40:37","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.031},{"id":295749702,"title":"Ukraine President Zelenskyy Gets Emotional During U.K. Meeting 1 Day After Trump Berated Him at White House","text":"Ukrainian President Volodymyr Zelenskyy was visibly emotional while speaking with British Prime Minister Keir Starmer just a day after his heated White House exchange with U.S. President Donald Trump.\n\n On Saturday, March 1, Zelenskyy, 47, arrived at London’s Downing Street to meet with the U.K. prime minister, 62, who immediately greeted him with a warm hug, per footage shared by the Associated Press\n\n After the leaders’ embrace, Zelenskyy could be seen waving and flashing a thumbs-up at the crowd gathered outside of the Westminster residences. As the duo chatted and posed for photos, reporters in the crowd peppered Zelenskyy with questions about Trump, 78, which he ignored.\n\n The U.K. and Ukraine leaders then walked arm in arm and shook hands before heading inside Downing Street for a conversation that was almost immediately emotional.\n\n \"Well, let me just say that you’re very, very welcome here in Downing Street, and as you heard from the cheers on the street outside, you have full backing across the United Kingdom,” Starmer told Zelenskyy.\n\n “And we stand with you and Ukraine for as long as it may take, and I hope you heard some of that cheering in the street,” the prime minister continued as Zelenskyy grew teary at the show of support.\n\n Starmer went on to say that the cheering at Zelenskyy’s arrival was “the people of the United Kingdom coming out to demonstrate how much they support you, how much they support Ukraine, and our absolute determination to stand with you, unwavering determination and to achieve what we both want to achieve, which is a lasting peace — a lasting peace based on sovereignty and security for Ukraine.”\n\n In response, Zelenskyy thanked the prime minister and “people of the United Kingdom” — including those who had gathered to welcome him in London earlier in the day — for their longtime and enthusiastic support amid the Russia-Ukraine war.\n\n The leaders’ meeting comes a day before Zelenskyy is also slated to meet with King Charles, and a day after his high-stakes visit to the White House turned sour.\n\n On Friday, Feb. 28, the Ukrainian president met with Trump and Vice President J.D. Vance, and their discussion quickly turned tense when the group began discussing U.S. support for Ukraine amid attempts to end the Russia-Ukraine war.\n\n Trump and Vance, 40, began berating Zelenskyy as Vance accused him of being \"disrespectful\" for trying to litigate U.S.-Ukraine policy in front of American journalists. “You should be thanking the president for trying to bring you into this conference,\" he told Zelenskyy.\n\n Zelenskyy responded by accusing Vance of never having been in combat or to Ukraine, and telling him he wasn't going to tell Ukrainians \"what we're going to feel.\"\n\n At another point during the meeting, Trump brought up \"World War III\" and accused Zelenskyy of \"gambling with the lives of millions of people.\" He also accused Zelenskyy of becoming too close to former President Joe Biden — whom he called “stupid.”\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. \n\n Zelenskyy's visit abruptly ended with the leader canceling his planned appearances in Washington, D.C., and with both he and Trump sharing statements on social media.\n\n The Ukrainian president shared a simple message of gratitude. Trump, meanwhile, claimed the leader \"disrespected\" America in a statement shared on Truth Social. The U.S. president said he has “determined that President Zelenskyy is not ready for Peace if America is involved, because he feels our involvement gives him a big advantage in negotiations.”","summary":"British Prime Minister Keir Starmer shared a hug with Zelenskyy, and later told him that he is \"very, very welcome here\"","url":"https://people.com/ukraine-president-zelenskyy-gets-emotional-in-uk-after-trump-white-house-meeting-11689069","image":"https://people.com/thmb/4pnWmx9frngD6gmFP2aLQDyNvVM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Volodymyr-Zelenskyy-Keir-Starmer-03-emotional-030125-052e94648f1747608b411f6caa3aa43d.jpg","video":null,"publish_date":"2025-03-01 23:38:49","author":"Bailey Richards","authors":["Bailey Richards"],"language":"en","category":"politics","source_country":"US","sentiment":0.079},{"id":295754536,"title":"Pro-Ukraine protests erupt across US after Trump and Vance ‘ambush’ Zelenskyy","text":"Protests against the Trump administration erupted across the US on Saturday following an unprecedented Oval Office clash, wherein Donald Trump and JD Vance escalated tensions with Ukraine’s president, Volodymyr Zelenskyy.\n\nHundreds of protesters gathered in Waitsfield, Vermont, on Saturday morning to oppose the vice-president’s visit to the state for a ski trip with his family.\n\nThe demonstration had been planned earlier in the week by the Mad River Valley chapter of Indivisible, a grassroots organizing group, but additional protesters said they were motivated to join after watching Vance and Trump’s combative White House meeting with Zelenskyy on Friday.\n\nProtesters held signs reading “Vermont stands with Ukraine” and “International embarrassment”, while many waved Ukrainian flags in solidarity. Fox aired video of the protesters, but blurred out signs displaying messages against Vance and in favor of Ukraine.\n\n“After what he did yesterday, he crossed the line,” protester Cori Giroux told Vermont Public Radio.\n\nOn Thursday, the governor, Phil Scott, a Republican who refused to vote for Trump in any of his three runs for the White House, issued a statement calling on Vermonters to be respectful of Vance and his family during their visit.\n\n“Please join me in welcoming them to Vermont and hoping they have an opportunity to experience what makes our state, and Vermonters, so special,” he said.\n\nWhile Vance, who admitted Friday he has never been to Ukraine, fled to an undisclosed location to evade protesters, some commentators noted that Zelenskyy, who stayed in Ukraine during Russia’s invasion, was returning to a Kyiv still under attack.\n\nThe protest followed a contentious confrontation in the Oval Office, where the US president told the Ukrainian leader to make a deal with Russia “or we’e out”. At one point, Trump accused Zelenskyy of not showing enough gratitude for US military and political aid, warning that he was “gambling with world war three”.\n\nZelenskyy countered that he had repeatedly thanked the American people and their leaders for their support, that but Ukrainians did not want to accept a ceasefire with Russia without security guarantees, since Russia’s president, Vladimir Putin, had repeatedly broken a previous ceasefire agreement.\n\nFollowing the exchange, European leaders, along with the prime ministers of Canada, Australia and New Zealand, posted messages of support for Ukraine.\n\nLeading Democratic lawmakers also rallied to Zelenskyy’s side, with one, the senator Chris Murphy of Connecticut, calling the Oval office meeting an “ambush” of the Ukrainian president by Trump and Vance.\n\nThe aggressive meeting led to protests in cities and towns across the US, including New York, Los Angeles and Boston, where hundreds gathered to express their support for Ukraine and Zelenskyy.\n\nVideos posted on social networks showed hundreds of demonstrators gathered in New York’s Times Square, many carrying the blue-and-yellow flag of Ukraine on their backs. In Los Angeles county, a pro-Ukraine crowd rallied in front of a SpaceX’s facility, and protesters in Boston held an “emergency rally” for “fair peace” for Ukraine at Boston Common.\n\n“Ukraine wants fair peace. Ukraine wants the war to end,” the group Boston Supports Ukraine wrote on Facebook. “Ukraine wants all of this on fair terms with security guarantees.”\n\nFor his part, Zelenskyy posted video of his warm reception in London on social networks, showing crowds of supporters lining the street outside Downing Street, where he was embraced by the UK prime minister, Keir Starmer.","summary":"Demonstrators surge in Vermont, New York City and Boston after Oval Office debacle with US president and vice-president\n\nProtests against the Trump administration erupted across the US on Saturday following an unprecedented Oval Office clash, wherein Donald Trump and JD Vance escalated tensions with Ukraine’s president, Volodymyr Zelenskyy.\n\nHundreds of protesters gathered in Waitsfield, Vermont, on Saturday morning to oppose the vice-president’s visit to the state for a ski trip with his family.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/mar/01/ukraine-protests-zelenskyy-trump","image":"https://i.guim.co.uk/img/media/334ebaf9cf32cfbc87271ca0d6d0f766097ac0fc/0_535_8029_4818/master/8029.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-03-01 23:37:44","author":"Coral Murphy Marcos","authors":["Coral Murphy Marcos"],"language":"en","category":"politics","source_country":"us","sentiment":0.111},{"id":295746914,"title":"More than half of Americans believe Trump will try for a third term - despite Constitution saying he can’t","text":"More than half of all Americans believe that President Donald Trump will attempt to go for a third term, according to a new poll.\n\nSurvey participants were asked if they think Trump \"will attempt to serve a third term\" — 21 percent said \"definitely\" and 31 percent said \"probably.\"\n\nTrump cannot run for a third term as a constitutional amendment states that presidents aren't allowed to \"be elected to the office of the President more than twice.\" That hasn't stopped the president from musing about the possibility. In the campaign, Trump said he wouldn't run in 2028 if he lost. But, now that he has won, he has floated a third term. \n\n\"Should I run again? You tell me,\" Trump said at a Black History Month event last week. \n\nTrump also posted on his Truth Social platform that New York was \"saved\" after his administration announced that it was rescinding a congestion pricing proposal. \"LONG LIVE THE KING!\" he added. \n\nIn the YouGov poll, 16 percent said Trump is \"probably not\" going to try to serve a third term, with 18 percent saying that he's \"definitely not\" going to do it, The Hill noted.\n\nHowever, a constitutional amendment was recently put forward by Tennessee Republican Rep. Andy Oagles that would allow Trump to serve a third term so the U.S. “can sustain the bold leadership our nation so desperately needs.”\n\nThe recent poll, which included 2,900 people, was conducted on February 25. \n\nThe 22nd Amendment of the Constitution says that presidents can only serve up to two full terms (eight years). Trump has said he may feel “entitled” to more while also suggesting he doesn’t want to run again after his next term ends in January 2029.\n\nCongressional Democrats have proposed a measure to clarify that the 22nd Amendment expressly forbids a third term in office, and the 78-year-old Trump has at times admitted defeat to the constitutional guardrails he’s up against, despite his rhetoric.\n\nThe 32nd U.S. President Franklin D. Roosevelt’s four terms in office helped inspire the 22nd Amendment in the first place.\n\nRatified in 1951, the amendment came after Roosevelt had been elected four consecutive times, from 1932 to 1944. He died in office in April 1945, shortly into his fourth term.\n\nThe amendment states that presidents can serve a maximum of two full terms.\n\nIf a vice president becomes president during the term of their predecessor, which has occurred nine times in U.S. history due to death or resignation, they can still serve two full terms as long as they serve less than half of their predecessor’s remaining term.\n\nBefore Roosevelt, whose time in office coincided with the twin international crises of the Depression and World War II, presidents had observed an unofficial tradition of not serving more than two terms.\n\nDespite Trump bucking constitutional guardrails in his first presidency, he would face a tall order in getting a constitutional amendment through Congress to try to secure a third term.\n\nA proposal for a constitutional amendment requires a two-thirds majority in both the House of Representatives and the Senate. Republicans hold slim majorities in both chambers. Ratifying an amendment would require the support of three-fourths of all state legislatures.","summary":"President has repeatedly mused about running for a third term and referred to himself as a ‘king’","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-third-term-constitution-poll-b2707345.html","image":"https://static.independent.co.uk/2025/03/01/17/TRUMP-ARANCELES-AUTOS_85158.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/LhkxGPHG-4VHSaSK0.mp4","publish_date":"2025-03-01 23:32:13","author":"Gustaf Kilander,James Liddell,Josh Marcus and Alex Woodward","authors":["Gustaf Kilander","James Liddell","Josh Marcus and Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.34},{"id":295743630,"title":"NASA Official Warns Staff About Publicly Displaying Their Badges Amid Reports of Harassment","text":"A high-ranking NASA official warned his employees Friday to “use discretion” in public when displaying badges or emblems that identify them as federal workers — part of an effort, the agency says, to protect its employees amid “stories of possible harassment” outside of work.\n\n“We are all very proud to work for the space program,” wrote Dr. James Polk, NASA’s chief health and medical officer. “But in the current environment, with a lot of negative rhetoric coming in our direction, I want you all to please use caution.”\n\nSince taking office in January, President Donald Trump and his administration and allies have used strong language to disparage federal workers, whom they have been firing en masse. “We’re bloated. We’re sloppy. We have a lot of people that aren’t doing their job,” the president said on Feb. 26 during his first Cabinet meeting.\n\nPolk’s warning to employees came two days later, after receiving a report about an employee who was “assaulted” at a Starbucks. “This is probably one of the saddest emails I have had to write of late,” he said in the email, which was obtained by ProPublica.\n\nPolk wrote that Nicola Fox, an associate administrator at NASA, said at a meeting that an employee was confronted at a Starbucks by someone “because she was a federal employee.” The worker was working on her computer and was identified by her badge and a logo, he wrote.\n\nReached Saturday, Polk said the email was not intended for anyone outside NASA. He said he did not have additional details about the incident and declined to comment on it or on his email to staff, which did not name the employee. Fox declined to comment.\n\nNASA spokesperson Cheryl Warner said the agency was “hearing stories of possible harassment toward employees, but not assault,” the term used in the email.\n\n“Our managers are hearing information thirdhand and using this as an opportunity to remind our teams to be mindful of their surroundings and to report any incidences to the Office of Protective Services,” she said.\n\nThe White House did not immediately return a request for comment.\n\nIt was not clear where the incident took place.\n\nThe email was circulating among NASA employees, some of whom said they are concerned by the Trump administration’s rhetoric regarding government workers. The president, his advisers and his congressional allies have all sharpened their attacks on federal employees over the past week as the administration undertakes expansive efforts to reduce the size of the federal government\n\nElon Musk, the tech billionaire who Trump named the head of the Department of Government Efficiency, has been leading the way.\n\nA week ago, he demanded federal employees respond to an email asking them to list five things they’d accomplished in the previous week — or be fired. “What he’s doing is saying ‘Are you actually working’?” Trump said.\n\nOn Tuesday, Rep. Marjorie Taylor Greene, R-Ga., said during a committee meeting that “federal employees do not deserve their jobs. Federal employees do not deserve their paychecks.”\n\nAnd senior Trump officials on Wednesday sent out a memo on reducing the federal workforce that said, “The American people registered their verdict on the bloated, corrupt federal bureaucracy on November 5, 2024, by voting for President Trump and his promises to sweepingly reform the federal government.”\n\nNASA sidestepped expected layoffs in February, but it is still losing personnel due to a buyout plan.\n\nPolk urged his staff to stay vigilant.\n\n“Be aware of your surroundings and keep good situational awareness and operational security,” he wrote. “Use caution when on the phone in public places, and ensure you are aware of those around you.”","summary":"by Heather Vogell                \n\n\n                                             \n\n                                                                    \n            \n                ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n\n\n            \n\n                \n\n      \n  \n\n\n\n                    \nA high-ranking NASA official warned his employees Friday to “use discretion” in public when displaying badges or emblems that identify them as federal workers — part of an effort, the agency says, to protect its employees amid “stories of possible harassment” outside of work.\n\n\n\n“We are all very proud to work for the space program,” wrote Dr. James Polk, NASA’s chief health and medical officer. “But in the current environment, with a lot of negative rhetoric coming in our direction, I want you all to please use caution.”\n\n\n\nSince taking office in January, President Donald Trump and his administration and allies have used strong","url":"https://www.propublica.org/article/nasa-official-warns-staff-trump-harassment-federal-workers","image":"https://img.assets-d.propublica.org/v5/images/GettyImages-1241158187_maxWidth_3000_maxHeight_3000_ppi_72_quality_95_embedColorProfile_true.jpg?crop=focalpoint&fit=crop&fp-x=0.5&fp-y=0.5&h=630&imgixProfile=propublicaAssetsV5&q=90&w=1200&s=1f7e1980ee5dd209c","video":null,"publish_date":"2025-03-01 23:30:00","author":"Heather Vogell","authors":["Heather Vogell"],"language":"en","category":"politics","source_country":"US","sentiment":-0.247},{"id":295746666,"title":"Meeting between Zelenskyy and British Prime Minister Keir Starmer in London after Trump Oval Office incident","text":"British Prime Minister Keir Starmer warmly welcomed Ukrainian President Volodymyr Zelenskyy outside 10 Downing St. in London. This friendly gesture took place a day after Zelenskyy’s intense interaction with President Donald Trump in Washington, D.C.\n\nFollowing their meeting with Trump in Washington, Zelenskyy and Starmer shared a warm embrace, shook hands, greeted reporters with waves, and flashed a thumbs-up before entering the prime minister’s residence for their discussions.\n\nThe London visit had been prearranged following Zelenskyy’s contentious encounter with Trump and Vice President JD Vance during a televised session in the Oval Office on Friday.\n\nZelenskyy was peppered with questions from shouting reporters about Trump outside the prime minister’s residence, but remained tight-lipped. \n\nTensions increased during the Oval Office meeting on Friday over a potential peace deal between Russia and Ukraine after Zelenskyy said Russian President Vladimir Putin couldn’t be trusted and had breached other agreements.\n\nTrump and Vance then accused Zelenskyy of not being grateful for the support the U.S. has provided over the years and said the Ukrainian leader was in a “bad position” at the negotiating table. \n\n“You’re playing cards,” Trump said. “You’re gambling with the lives of millions of people. You’re gambling with World War III. You’re gambling with World War III. And what you’re doing is very disrespectful to the country, this country.”\n\nAfter Vance told Zelenskyy Ukraine had manpower and military recruiting problems, Zelenskyy said war means “everybody has problems, even you,” adding the U.S. would feel the war “in the future.”\n\n“Don’t tell us what we’re going to feel,” Trump responded. “We’re trying to solve a problem. Don’t tell us what we’re going to feel.”\n\nZelenskyy was asked to leave the White House after the exchange, a scheduled news conference was canceled and a deal for Ukraine to give the U.S. its rare earth minerals was left unsigned. \n\nZelenskyy expressed his gratitude for America’s help after the meeting.\n\n“Thank you America, thank you for your support, thank you for this visit,” he wrote on X. “Thank you @POTUS, Congress, and the American people. Ukraine needs just and lasting peace, and we are working exactly for that.” \n\nThe Ukrainian president told Fox News chief political anchor Bret Baier in an interview after the meeting on “Special Report” that he believes Ukrainian-U.S. ties can be salvaged.\n\n“Yes, of course, because it’s relations more than two presidents,” he said in the exclusive interview. “It’s the historical relations, strong relations between our people. And that’s why I always began … to thank your people from our people.\n\n“Of course, thankful to the president and, of course, to Congress,” Zelenskyy added, “But, first of all, to your people … we wanted very much to have all this strong relations and where it counted. We will have it.”\n\nZelenskyy said he was “not sure we did something bad” when asked about the heated exchange but conceded the dustup was “bad for both sides.”\n\nFox News’ Madeline Coggins contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBritish Prime Minister Keir Starmer warmly welcomed Ukrainian President Volodymyr Zelenskyy outside&#8230;\n\n\nThis Post: Meeting between Zelenskyy and British Prime Minister Keir Starmer in London after Trump Oval Office incident first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/meeting-between-zelenskyy-and-british-prime-minister-keir-starmer-in-london-after-trump-oval-office-incident/","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/1200/675/trump-zelenskyy-and-vance-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-01 23:29:04","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.185},{"id":295746664,"title":"Drone footage captures airstrike eliminating ‘senior Al-Qaeda leader’","text":"THIS is the heart-stopping moment a senior Al-Qaeda leader was wiped out in a US airstrike.\n\nDrone footage captured the chilling moment monster Muhammed Yusuf Ziya Talay was killed in Syria.\n\nTalay was a military leader in the Al-Qaeda-affiliated terror group Hurras al-Din (HaD).\n\nThe monster was killed when a missile launched by U.S. Central Command forces struck Northwest Syria on February 23.\n\nUS authorities released the incredible drone footage that caught the terror bosses final moments.\n\nTalay, a Turkish national, was wiped out while in a car.\n\nAn X post from the US agency indicated that the recent airstrike was carried out as part of the agency’s dedication to disrupting and weakening the efforts of terrorists to plan, coordinate, and execute attacks on both civilians and military members.\n\nGen. Michael Erik Kurilla, the commander of CENTCOM, emphasized the ongoing pursuit of these terrorists to safeguard not only the homeland but also the personnel of the United States, its allies, and partners within the region and elsewhere.\n\nDonald Trump praised the deadly strike in a glowing Truth Social post.\n\nThe President conveyed that US forces executed a targeted airstrike against an al-Qaeda member in Syria over the weekend, noting that the individual in question had been collaborating with al-Qaeda operatives across different parts of the region.\n\n“Congratulations to CENTCOM Commander Gen. Michael Kurilla, and the US warfighters who dealt Justice to another Jihadi threatening America and our allies and partners.”\n\nThis has not been the only recent airstrike the US has launched in Syria, to halt growing fears of terrorism in the area.\n\nAnother senior HaD official was wiped out in a US attack just two days before Talay.\n\nWasim Tahsin Bayraqdar, a senior leadership facilitator for the terror group, was killed.\n\nDozens of missiles were launched after barbaric dictator Bashar al-Assad’s regime was overthrown on 8 December.\n\nMore than 75 “precision airstrikes” were carried out on that day as fears over a power vacuum forming in the wartorn country had grown.\n\nWARNING TO THE WEST\n\nAn expert told The Sun that The West was facing a “War on Terror” with the rise of extremists like the Houthis and Hezbollah.\n\nAnd security experts told The Sun that the Israel-Hamas conflict means a terrorist attack on UK soil is “absolutely possible”.\n\nFormer US General Ben Hodges and security expert Professor Anthony Glees spoke to The Sun about how the West needs to steel itself for the bloodshed that may be coming in the Middle East.\n\nProfessor Glees told us Hamas’ brutal massacre on October 7 was the spark that lit the fuse on a new powderkeg – and warned the UK is not prepared.\n\nAnd meanwhile, General Hodges said: “The UK is in a pre war environment. That means war is coming.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nTHIS is the heart-stopping moment a senior Al-Qaeda leader was wiped out&#8230;\n\n\nThis Post: Drone footage captures airstrike eliminating &#8216;senior Al-Qaeda leader&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/drone-footage-captures-airstrike-eliminating-senior-al-qaeda-leader/","image":"https://internewscast.com/wp-content/uploads/2025/03/Chilling-drone-footage-reveals-moment-‘senior-Al-Qaeda-leader-is-wiped.jpg","video":null,"publish_date":"2025-03-01 23:26:59","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.047},{"id":295749362,"title":"Ukraine peace deal 'not durable without US backing'","text":"Peace in Ukraine would not be possible without a US security guarantee, an opposition frontbencher says, after a heated clash between Donald Trump and Volodymyr Zelenskiy.\n\nPrime Minister Anthony Albanese and other world leaders have reiterated their support for Ukraine despite the US president being involved in a heated exchange with Mr Zelenskiy at the White House over the war in Ukraine and a potential peace deal.\n\nOpposition home affairs spokesman James Paterson said a ceasefire that is imposed on Ukraine would not be acceptable and would be a win for Russian leader Vladimir Putin.\n\nDespite the tense meeting between Ukraine and US presidents, Senator Paterson said America would still be crucial to any ceasefire negotiations.\n\n\"It's very hard to see how peace can be durable if there isn't American leadership, if there isn't an American security guarantee,\" he told ABC's Insiders program on Sunday.\n\n\"That does seem to be something that is part of the negotiations between Zelenskiy and Trump, and we're all hopeful that that is able to be achieved.\"\n\nMr Zelenskiy had reportedly viewed the meeting with Mr Trump as an opportunity to convince the United States not to side with President Putin, who ordered the invasion of Ukraine.\n\nInstead, Mr Trump and Mr Vance lectured Mr Zelenskiy, saying he showed disrespect, driving relations with Kyiv's most important wartime ally to a new low, according to Reuters.\n\n\"You're not in a good position. You don't have the cards right now. With us, you start having cards,\" Mr Trump said.\n\nSenator Paterson said Australia should not reconsider its defence alliance with the US despite the comments on the war in Ukraine.\n\n\"Occasionally, even between allies, when there is contention, diplomacy can be very robust. (It's) critical to have American leadership in the world,\" he said.\n\n\"That's in the world's interest, and ... that's in as America's interest, and I hope that we are able to achieve a ceasefire on acceptable terms to Ukraine.\"\n\nTreasurer Jim Chalmers said Australia was unequivocal in its support for Ukraine.\n\n\"We couldn't be more supportive of President Zelenskiy and his people. This is a brave and courageous country,\" he told Sky News.\n\n\"It has a democratically elected leader who will go down in history for the bravery of his position and his leadership, and we support him and his country without reservation.\"\n\nDr Chalmers said further financial support for Ukraine from the federal government was always under consideration.\n\nAustralia has committed $1.5 billion to help Ukraine defend itself.\n\nOpposition defence spokesman Andrew Hastie said the US President's approach on trade and security had implications for Australia.\n\n\"We need to demonstrate a strong hand. President Trump studies your cards very closely, and I think he wants to know that his allies have a strong hand,\" he told Sky News.\n\nAustralia stands with Ukraine. We've always stood with Ukraine since Russia's illegal, immoral and unjustified invasion of Ukraine ... we want to see Ukrainian sovereignty upheld in any peace settlement.\"","summary":"US support is still needed for a peace deal in Ukraine, a coalition frontbencher says, despite a heated exchange between Donald Trump and Volodymyr Zelenskiy.","url":"https://thewest.com.au/politics/ukraine-peace-deal-not-durable-without-us-backing-c-17897703","image":"https://images.thewest.com.au/publication/C-17897703/6f9e6a4e670c5157b8eccbe324b4897cc2ed76ba-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-03-01 23:25:27","author":"Andrew Brown,Andrew Brownaapsun","authors":["Andrew Brown","Andrew Brownaapsun"],"language":"en","category":"politics","source_country":"au","sentiment":0.208},{"id":295742418,"title":"Trump and Zelenskyy argue in White House","text":"What started as a friendly meeting between U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy quickly turned into an explosive argument, leaving world leaders, politicians, and the public in shock.\n\nThe Heated Exchange\n\nThe two leaders met at the White House to discuss Ukraine’s war with Russia and a U.S.-proposed peace deal. However, things quickly took a tense turn.\n\nU.S. Vice President JD Vance stated that the “path to peace” is through diplomacy. In response, Zelenskyy, who has long been advocating for more military aid, questioned, “What kind of diplomacy are you speaking about?” He reminded those in the room that Ukraine had faced Russian aggression long before the full-scale invasion in 2022.\n\nVance then accused Zelenskyy of being “disrespectful,” suggesting that Ukraine should be grateful for U.S. support. That’s when Trump stepped in, issuing a stark warning: “You’re either going to make a deal or we’re out.”\n\nThe meeting ended abruptly, with Zelenskyy being asked to leave the White House early, and a scheduled press conference was canceled.\n\nReactions From Around the World\n\nThe confrontation sent shockwaves across the globe, drawing strong reactions from political leaders.\n\nUK Prime Minister Sir Keir Starmer reaffirmed the UK’s “unwavering support for Ukraine” and stressed that he is committed to finding a lasting peace.\nFrench President Emmanuel Macron sided with Ukraine, saying: “There is an aggressor: Russia. There is a victim: Ukraine. We were right to help Ukraine and sanction Russia three years ago – and we should keep doing so.”\nAmerican Senator Lindsey Graham, a Republican and Trump ally, praised the U.S. president for being tough, saying: “I’ve never been more proud of President Trump for showing the world you don’t trifle with this man.”\nNew Zealand’s Prime Minister Christopher Luxon also stepped in, stating that New Zealand “remains steadfast in its support for Ukraine.”\n\nWhat Does This Mean for Ukraine?\n\nThe dramatic fallout raises serious concerns about Ukraine’s future. If Trump cuts military aid, Ukraine will have no choice but to fight on, but “the questions are how effectively, and for how long.”\n\nZelenskyy later spoke on U.S. television, calling the argument “bad for both sides.” Despite the clash, he thanked the American people for their support and emphasised the need for a “just and lasting peace.”","summary":"What started as a friendly meeting between U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy quickly turned into an explosive argument, leaving world leaders, politicians, and the public in shock. The Heated Exchange The two leaders met at the White House to discuss Ukraine&#8217;s war with Russia and a U.S.-proposed peace deal. However, things [&#8230;]","url":"https://www.kiwikidsnews.co.nz/trump-and-zelenskyy-argue-in-white-house/","image":"https://www.kiwikidsnews.co.nz/wp-content/uploads/2025/03/GettyImages-2202529095-1.webp","video":null,"publish_date":"2025-03-01 23:25:08","author":"Shem Banbury - Kiwi Kids News Editor","authors":["Shem Banbury - Kiwi Kids News Editor"],"language":"en","category":"politics","source_country":"nz","sentiment":-0.185},{"id":295750404,"title":"Israel backs US plan for temporary Gaza truce over Ramadan and Passover","text":"Israel will adopt the proposal by US President Donald Trump’s envoy, Steve Witkoff, for a temporary ceasefire in Gaza for the Ramadan and Passover periods, the prime minister’s office said early on Sunday, hours after the first phase of the previously agreed ceasefire was set to expire.\nOn the first day of Witkoff’s proposal, half of the hostages held in Gaza, both alive and dead, will be released, Prime Minister Benjamin Netanyahu’s office said, adding the remaining hostages will also be released after a permanent ceasefire was agreed on.\nWitkoff made the proposal to extend the current ceasefire after realising more time was needed for talks on a permanent ceasefire, Netanyahu’s office added.\nHamas spokesman Hazem Qassem earlier on Saturday said the group rejected Israel’s “formulation” of extending the first phase of the ceasefire in Gaza, but did not explicitly mention Witkoff’s plan.\n\nNetanyahu’s office said Israel would immediately conduct negotiations on Witkoff’s plan if Hamas agreed to it.\n“According to the agreement, Israel can return to fighting after the 42nd day if it feels that the negotiations are ineffective,” Netanyahu’s office also said, accusing Hamas of violating the deal.\nBoth sides have been trading accusations of violating the deal.\nThe ceasefire agreement reached in January halted 15 months of fighting, allowing the exchange of 33 Israeli hostages and five Thais for around 2,000 Palestinian prisoners and detainees.\nIt was meant to lead to subsequent talks to build on the ceasefire deal.\nTalks about the ceasefire have been ongoing, most recently in Cairo, but have not led to an agreement.","summary":"The proposal, which Hamas has yet to accept, seeks the release of half the remaining hostages, both dead and alive, on the first day.","url":"https://www.scmp.com/news/world/middle-east/article/3300707/israel-agrees-us-plan-temporary-gaza-truce-over-ramadan-and-passover","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/02/f6e1de10-7244-4532-aaba-672a20290f2b_40601926.jpg","video":null,"publish_date":"2025-03-01 23:17:24","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"cn","sentiment":-0.49},{"id":295748450,"title":"Zelenskyy embraced by British prime minister a day after White House blowout","text":"LONDON (AP) — British Prime Minister Keir Starmer embraced Ukrainian President Volodymyr Zelenskyy on Saturday and told him he had the U.K.’s unwavering support, a day after the blowout at the White House with President Donald Trump.\n\nZelenskyy arrived to cheers from people who had gathered outside of 10 Downing St., where Starmer gave him a hug and ushered him inside. The two leaders met on the eve of a meeting of European leaders in London. Called to discuss how European nations can defend Ukraine — and themselves — if the U.S. withdraws support, it has taken on new urgency following Trump’s televised berating of Zelenskyy.\n\n“And as you heard from the cheers on the street outside, you have full backing across the United Kingdom,” Starmer told the leader of the war-torn country. “We stand with you, with Ukraine, for as long as it may take.”\n\nZelenskyy thanked him and the people of the U.K. for their support and friendship.\n\nAfter the meeting, Britain announced it was extending a 2.26 billion pound ($2.84 billion) loan to Kyiv for military procurement, with the money coming from the profits on frozen Russian assets. It’s Britain’s contribution to a $50 billion package of support pledged by the G-7 group of wealthy industrialized nations.\n\nZelenskyy thanked Britain in a statement on X, saying: “This is true justice – the one who started the war must be the one to pay.”\n\nStarmer spoke to both Trump and French President Emmanuel Macron on Saturday evening after meeting Zelenskyy, the prime minister’s office said.\n\nThe meeting comes the day after an extraordinary diplomatic meltdown when Trump and Vice President JD Vance blasted Zelenskyy in the Oval Office on live television for not being grateful enough for U.S. support.\n\nZelenskyy had been poised to ink a deal to give the U.S. access to mineral riches as Trump pressures Ukraine to reach a deal to end the war with Russia. But he left town without signing anything.\n\nZelenskyy had been scheduled to meet with Starmer on Sunday before the European summit, but the timetable for their bilateral meeting was apparently sped up in the aftermath of the Washington visit.\n\nZelenskyy will meet with King Charles III on Sunday before the meeting at Lancaster House, a 200-year-old mansion near Buckingham Palace.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"LONDON (AP) — British Prime Minister Keir Starmer embraced Ukrainian President Volodymyr Zelenskyy on Saturday and told him he had the U.K.&#8217;s unwavering support, a...","url":"https://whdh.com/news/zelenskyy-embraced-by-british-prime-minister-a-day-after-white-house-blowout/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/03/ukraine.jpg?quality=60&strip=color","video":"https://bcbolt446c5271-a.akamaihd.net/media/v1/pmp4/static/clear/4744899807001/3ff5e8e8-6684-42a4-be3d-6aa3b06bc72e/c2efa55a-ef60-4ccf-95d1-24579d6d7c4e/main.mp4?akamai_token=exp=1740893546~acl=/media/v1/pmp4/static/clear/4744899807001/3ff5e8e8-6684-42a4-","publish_date":"2025-03-01 23:14:15","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.032},{"id":295742956,"title":"Is It the End of the Road for Solana?","text":"With the price of Solana (SOL -4.20%) crashing by 34% in the past 30 days, many investors are either looking for the exit or already well on their way out the door. Rocked by scandals connected to coins on the Solana platform and facing down a few macroeconomic headwinds, it's obvious that Solana's seas might be rough for a while.\n\nSo is this it? Is the chain's heyday giving way to a full-on collapse? Not so fast.\n\nThese problems are painfully thorny, but they're survivable\n\nSolana is the biggest casino for betting on meme coins, which attract a lot of capital from retail investors, making it an appealing place for shady schemes. It has a reputation as being the go-to blockchain for doing unethical and possibly illegal activities like pump-and-dump scams and insider trading. This is a bad reputation to have.\n\nIt's worse when that reputation gets confirmed in more than one big way in a short period.\n\nFor instance, in mid-February, the president of Argentina, Javier Milei, publicly endorsed a newly launched Solana-based meme coin called LIBRA via his social media account. The coin subsequently crashed by around 94% after extensive insider selling, evaporating an estimated $4.4 billion in value for holders and sparking an anticorruption investigation.\n\nThis meme coin collapse comes on the heels of several others earlier in the year, including President Donald Trump's Solana-based Official Trump meme coin, which has the ticker TRUMP and currently trades at a small fraction of its peak value shortly after launch in late January. According to reports, the coin's insiders sold off large portions of their holdings during the initial run-up, and they continue to retain large portions of the outstanding supply, suggesting that those who buy it now will be massively disadvantaged despite its lower price level.\n\nThen there's the upcoming issue of supply unlocks for the Solana coin itself, which will occur in early March. Approximately 11 million tokens will be unlocked, which means that early investors in the chain will be able to sell for the first time, if they want to. Many investors have interpreted this as a very bearish signal, expecting the newly unlocked coins to be immediately offloaded, depressing prices substantially.\n\nThe size of such unlocks has also been a point that Solana's detractors have criticized in the past, so the timing is quite unfortunate given the other ongoing issues.\n\nBuying the dip will probably pay off, and perhaps soon\n\nInvestors should carefully examine the above reasons to be bearish about Solana right now. It's reasonable to expect that the coin's price will take some time to recover, but that isn't the whole story.\n\nIt's true that recent celebrity meme coin catastrophes are not going to do investors any favors. And the prospect of more coins being available for the chain's early investors to dump isn't a very appealing one. But those issues don't have anything to do with the core investment thesis for buying the coin. And that makes the dip that's happening now an opportunity rather than a long-term threat.\n\nFrom the long-term view, Solana may soon be included in exchange-traded funds (ETFs), and it might even be included in a U.S. cryptocurrency repository, if one is ever made. It's also still dramatically faster and cheaper to use than its biggest competitors, Ethereum and Cardano, neither of which are likely to be able to change that state of affairs anytime soon.\n\nFurthermore, despite the recent plunge in meme coin valuations, Solana is still the main chain for them, which will keep risk-seeking investors coming back again and again. More serious segments, like artificial intelligence (AI) infrastructure and on-chain AI agents, are also blossoming right now, and they may soon drive significant demand for the coin.\n\nRumors of Solana's demise have been very much exaggerated. The near term could still be challenging for investors, but for those who can commit to holding through volatility long enough for its big value drivers to play out, buying the dip is a good strategy.","url":"https://www.fool.com/investing/2025/03/01/is-it-the-end-of-the-road-for-solana/?source=askdougpancakes&utm_source=chromefollow&utm_medium=feed&utm_campaign=news&referring_guid=e4a0c299-3842-46a0-bda2-8e83e4b8ee75","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F808772%2Fdownbeat-investor-looks-at-screen.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-03-01 23:14:00","author":"Alex Carchidi","authors":["Alex Carchidi"],"language":"en","category":"sports","source_country":"us","sentiment":-0.431}]}