{"offset":0,"number":50,"available":9828,"news":[{"id":375819270,"title":"“Jimmy Kimmel Live!” Hosts Food Bank As SNAP Halts Amid Government Shutdown","text":"Jimmy Kimmel Live! has established a \"Big, Beautiful\" food bank. \n\n The late-night show announced on Tuesday, Nov. 4, that it will host a food donation center in Los Angeles as millions are set to lose the Supplemental Nutrition Assistance Program (SNAP) benefits amid the government shutdown.\n\n “Cutting SNAP benefits creates uncertainty for American children, seniors and families,” the show's team wrote on Instagram. “To support our community members in need, we’re starting a donation center in our Hollywood backlot.”\n\n “If you are in LA, please come by to donate food and if you are not, please consider supporting your local food banks,” the caption continued. \n\n The Jimmy Kimmel Live! Big, Beautiful Food Bank is collecting food and donations for the L.A. Food Bank and the St. Joseph Center.\n\n Over 42 million Americans receive benefits from SNAP, and millions are at risk of losing those benefits as the government shutdown continues. The program is run by the U.S. Department of Agriculture Food and Nutrition Service, but funds are allocated to individual states to then distribute them to residents in need. \n\n Ronald Ward, Acting Associate Administrator of SNAP's Food and Nutrition Service, warned that the shutdown's impact on benefits was imminent.\n\n “If the current lapse in appropriations continues, there will be insufficient funds to pay full November SNAP benefits for approximately 42 million individuals across the Nation,\" Ward wrote in an October letter. \"FNS appreciates and understands that States have questions regarding operation of the program, and has begun the process of fact finding and information gathering to be prepared in case a contingency plan must be implemented.\"\n\n The name \"Big, Beautiful Food Bank\" is a reference to the \"Big, Beautiful Bill\" that President Donald Trump signed into law in July. Host Jimmy Kimmel has been a longtime critic of Trump and ABC temporarily pulled him off the air after he made a joke in September that was perceived to be about Charlie Kirk. Kimmel's show returned on Sept. 23.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n The Jimmy Kimmel Live! center will be open 9 a.m. to 5 p.m. and is located at 6901 Hawthorn Ave, Los Angeles, CA 90028. \n\n See the list of donation needs below. \n\n Low-sodium soupsChilis and stewsCans of tuna, chicken and salmonNut buttersLow-sugar cerealsProtein barsWhole-grain pastaRiceCrackersTrail mixFruit snacks100 percent juice boxesDried fruitUHT MilkCereal boxesWipesDiapersFacial cleanserDeodorantSoapLotionFeminine hygiene productsOral hygiene products","summary":"The late-night show is calling the donation center the “Jimmy Kimmel Live Big, Beautiful Food Bank”","url":"https://people.com/jimmy-kimmel-live-hosts-food-bank-snap-halts-amid-government-shutdown-11843662","image":"https://people.com/thmb/p-EP6I5NqcOnN2998w3_rrAH4EI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jimmy-kimmel-110425-5b06593744074bd695f8f09f93744b27.jpg","video":null,"publish_date":"2025-11-05 01:15:06","author":"Yamillah Hurtado","authors":["Yamillah Hurtado"],"language":"en","category":"politics","source_country":"US","sentiment":-0.019},{"id":375819756,"title":"Virginia Elections RESULTS: Democrat Abigail Spanberger Wins Governor's Race, Beating Winsome Earle-Sears","text":"Former Democratic Congresswoman Abigail Spanberger is projected to win the 2025 Virginia Governor’s Election, defeating Republican Lt. Gov. Winsome Earle-Sears. With nearly 40% of votes counted, Spanberger leads by nearly 140,000 votes. The victory flips control of the governor’s mansion from Republican to Democrat, as Spanberger succeeds outgoing GOP Governor Glenn Youngkin. The centrist Democrat will also become Virginia’s first female governor. A former CIA officer and federal law enforcement agent, Spanberger, 46, centered her campaign on affordability, government stability, and protecting Virginia’s federal workforce, emphasizing the toll of the ongoing government shutdown and federal job cuts on the state’s more than 300,000 US government employees. Her campaign also sought to tie Earle-Sears to President Donald Trump, branding her as a Trump loyalist despite Trump’s lack of endorsement. Earle-Sears, who was outraised by Spanberger, failed to gain momentum amid growing voter frustration over national chaos and local economic strain. Spanberger’s victory ends Republican Gov. Glenn Youngkin’s tenure and delivers a major boost for Democrats nationally, as they look to counter the influence of the second Trump administration. The win also underscores the rising power of centrist Democrats, who continue to prove their strength in swing states and competitive districts. A mother of three, Spanberger previously represented Virginia’s 7th Congressional District, where she first rose to prominence after unseating Republican Dave Brat, known for ousting former House Majority Leader Eric Cantor. Her career in intelligence and public service helped shape her image as a moderate, pragmatic leader, an approach that resonated with Virginians seeking stability amid political polarization. Other Races In Virginia Lieutenant Governor: Democrat Ghazala Hashmi leads GOP's John Reid Attorney General: Democrat Jay Jones leads GOP's Jason Miyares Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Ex-Democratic Congresswoman Abigail Spanberger is projected to win the 2025 Virginia Governor's Election, beating incumbent Lieutenant Governor and GOP nominee Winsome Earle Sears.","url":"https://www.timesnownews.com/world/us/us-news/virginia-elections-results-democrat-abigail-spanberger-wins-governors-race-beating-winsome-earle-sears-article-153102362","image":"https://images.timesnownews.com/thumb/msid-153102376,thumbsize-797241,width-1280,height-720,resizemode-75/153102376.jpg","video":null,"publish_date":"2025-11-05 01:14:27","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":0.147},{"id":375819868,"title":"Trump Strong on India-US Ties: White House","text":"Washington, DC: The White House reaffirmed President Donald Trump’s commitment to strengthening India-US relations, describing the partnership as one the US President feels “very strongly” about, even as tensions linger over trade tariffs and oil imports from Russia. Addressing a press briefing on Tuesday (local time), White House Press Secretary Karoline Leavitt said, “The President is positive and feels very strongly about the India-US relationship. A few weeks ago, he spoke to the Prime Minister directly when he celebrated Diwali in the Oval Office with many high-ranking Indian-American officials here at the White House.” She added that the US has “a great Ambassador to India, Sergio Gor,” and confirmed that Trump’s trade team is engaged in “very serious discussions” with New Delhi. “I know the President has great respect for Prime Minister Modi and they speak pretty frequently,” she said. Leavitt’s remarks come days after Trump claimed that India had significantly reduced its purchase of Russian oil, calling New Delhi “very good” on the issue during his recent five-day Asia tour. His comments marked another in a series of statements since mid-October asserting that Prime Minister Narendra Modi assured him India would curb or halt crude imports from Moscow. Trump’s claims come in the context of his administration’s push to economically isolate Russia through sanctions and energy restrictions amid the ongoing war in Ukraine. Earlier this month, India’s Ministry of External Affairs (MEA) issued a response to Trump’s comments, reiterating that the country’s energy sourcing decisions are based on national interests and consumer welfare. MEA spokesperson Randhir Jaiswal said, “India is a significant importer of oil and gas. It has been our consistent priority to safeguard the interests of the Indian consumer in a volatile energy scenario. Our import policies are guided entirely by this objective.” He added that India’s energy policy focuses on ensuring stable prices and secured supplies through diversified sourcing. “Where the US is concerned, we have for many years sought to expand our energy procurement. This has steadily progressed in the last decade. The current Administration has shown interest in deepening energy cooperation with India. Discussions are ongoing,” Jaiswal said. Relations between New Delhi and Washington have faced strains after the United States imposed steep trade tariffs on India in August. The US levied 50 per cent tariffs, including 25 per cent secondary duties, as punishment for India’s continued oil purchases from Russia. In August, India had slammed the move as “unfair, unjustified, and unreasonable,” while Trump described US-India trade ties as a “totally one-sided disaster.” During his address to corporate leaders at the Asia-Pacific Economic Cooperation (APEC) summit in South Korea last week, Trump also claimed he had “threatened India and Pakistan with tariffs” to prevent a potential nuclear war. His remarks referred to India’s Operation Sindoor, launched in May following the Pahalgam terror attack in Jammu and Kashmir that killed 26 civilians. Trump claimed he played a significant role in preventing a larger conflict. However, India has firmly rejected Trump’s version of events. The MEA stated that the ceasefire between India and Pakistan was achieved through established military communication channels between the Director Generals of Military Operations (DGMOs) of both sides. “India’s position remains unchanged, all issues with Pakistan are to be resolved bilaterally, without any third-party involvement,” the ministry reiterated.","summary":"Leavitt’s remarks come days after Trump claimed that India had significantly reduced its purchase of Russian oil, calling New Delhi “very good” on the issue","url":"https://www.deccanchronicle.com/world/americas/trump-strong-on-india-us-ties-white-house-1914937","image":"https://www.deccanchronicle.com/h-upload/2025/11/05/1974889-aa-5878646.webp","video":null,"publish_date":"2025-11-05 01:09:20","author":"ANI","authors":["ANI"],"language":"en","category":"politics","source_country":"in","sentiment":-0.074},{"id":375819864,"title":"Mamdani Poised for NY Win, Shakes US Politics","text":"NEW YORK: New Yorkers looked set to elect a young Muslim leftist as mayor Tuesday as US voters cast judgment for the first time on Donald Trump's tumultuous second presidency in nationwide local elections. While Zohran Mamdani's rise has dominated headlines, elections for governor in Virginia and New Jersey could also be revealing gauges of the US political mood nearly 10 months since Trump's return to the White House. Democratic wins in those states may indicate a revived opposition ahead of next year's midterm elections to decide control of Congress. In New York, Mamdani, aged just 34, is a self-described socialist who was virtually unknown before his upset victory to secure the Democratic nomination. He has focused on reducing living costs for ordinary New Yorkers, building support through his informal personal style and social-media-friendly clips of him walking the streets chatting with voters. Unabashedly playing the race card, President Trump on Tuesday labelled Mamdani, who would be New York's first Muslim mayor, as a \"Jew hater.\" \"Any Jewish person that votes for Zohran Mamdani, a proven and self professed JEW HATER, is a stupid person!!!\" the Republican president posted on his social media platform. Mamdani was on about 44 percent in latest polls, several points ahead of former state governor Andrew Cuomo who is running as an independent. Republican candidate Curtis Sliwa, founder of the Guardian Angels citizen crime patrol group, was on 24 percent -- a margin that could sway the vote if enough of his backers shifted to Cuomo. Turnout by midday, with nine hours of voting remaining was 1.195 million, exceeding the total of 1.14 million votes cast in 2021, which saw the election of current Mayor Eric Adams who bowed out when his reelection campaign was hit by scandals and corruption allegations. He endorsed Cuomo, 67. Denise Gibbs, 46, a doctor of physiotherapy, voted at a school in Brooklyn. \"I sure hope it improves the city. I want to see it decrease divisiveness and increase livelihoods of working-class households and services for children,\" she said, wearing green scrubs. Polls close at 9:00 pm (0200 GMT Wednesday). - Mamdani's improbable rise - The race has centered on cost of living, crime and how each candidate would handle Trump, who has threatened to withhold federal funds from New York. Syracuse University political science professor Grant Reeher said a Mamdani win would set up a clash with Trump. \"Trump will treat New York City more aggressively,\" he said. \"There will be some kind of political showdown.\" Mamdani's improbable rise highlights the Democratic Party's debate over a centrist or a leftist future. \"I think that this has to be a party that actually allows Americans to see themselves in it,\" Mamdani said last week. But Cuomo said there was \"a civil war in the Democratic Party.\" \"You have an extreme radical left that is run by the socialists that is challenging what they would call moderate Democrats. I'm a moderate Democrat,\" he said after voting. In New Jersey, Democratic Party candidate Mikie Sherrill, a former Navy helicopter pilot, faces off against Republican Jack Ciattarelli, a businessman backed by Trump. In Virginia's race for governor, Democratic candidate Abigail Spanberger has been polling ahead of Virginia's Republican Lieutenant Governor Winsome Earle-Sears. Both sides wheeled out big guns, with former president Barack Obama rallying support for Spanberger and Sherrill over the weekend and Trump scheduling tele-rallies for both Virginia and New Jersey on the eve of voting. Obama also reportedly spoke to Mamdani over the weekend but -- reflecting the internal party debate -- held off endorsing him. Emailed bomb threats involving polling stations across New Jersey forced the brief closure of several sites, said state Attorney General Matthew Platkin. Mamdani called the threats \"incredibly concerning.\" \"It's an illustration of the attacks we are seeing on our democracy,\" he said after voting in Astoria, Queens.","summary":"While Zohran Mamdani's rise has dominated headlines, elections for governor in Virginia and New Jersey could also be revealing gauges of the US political mood nearly 10 months since Trump's return to the White House","url":"https://www.deccanchronicle.com/world/americas/mamdani-poised-for-ny-win-shakes-us-politics-1914936","image":"https://www.deccanchronicle.com/h-upload/2025/11/05/1974888-aa-5877431.webp","video":null,"publish_date":"2025-11-05 00:59:58","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.054},{"id":375817918,"title":"Abigail Spanberger Defeats Winsome Earle-Sears to Flip Virginia from GOP","text":"Former Representative Abigail Spanberger, a Democrat, defeated Lieutenant Governor Winsome Earle-Sears, a Republican, in Virginia’s gubernatorial race, bringing the governorship back into Democratic control. Both CNN and NBC called the race just before 8 p.m. ET. \n\nAt the time the race was called, Spanberger led with 54.9 percent of the vote to Winsome-Earles’ 49.4 percent with 35 percent of the vote reported. \n\nWhy It Matters\n\nThe Virginia gubernatorial race served as a key bellwether for the mood of the electorate ahead of the 2026 midterm elections, when Democrats are hoping to flip seats nationwide. Spanberger, who served in Congress from 2018 through 2024, cast herself as a more centrist Democrat on the campaign trail, while Earle-Sears aligned closer to President Donald Trump.\n\nSpanberger’s victory could boost Democrats’ optimism about the midterm elections, as the party has continued to face questions about its future following former Vice President Kamala Harris’ loss last November.\n\nWhat To Know\n\nHer victory brings the seat back into Democratic control for the first time in four years. In 2021, incumbent Republican Governor Glenn Youngkin flipped the seat.\n\nSpanberger will be the first woman to serve as governor of Virginia.\n\nAbigail Spanberger speaks during a rally in Norfolk, Virginia, on November 1, 2025.\n\nNational politics loomed over the race. The ongoing government shutdown and President Donald Trump’s efforts to reshape the federal government were particularly important issues in Northern Virginia’s D.C. suburbs, which are home to a large concentration of federal workers.\n\nVirginia was once a swing state but has drifted toward Democrats over the past few decades.\n\nTrump, however, managed to narrow his margin in Virginia in 2024 compared to his 2020 performance. Five years ago, he lost the state by about 10 points to President Joe Biden. Last November, Harris carried the state by fewer than six points.\n\nRepublicans sought to tie Spanberger to the Democrats’ attorney general nominee Jay Jones, whose polling dipped after text messages appearing to show him suggesting political violence against a Republican lawmaker leaked. Earle-Sears also attacked Spanberger over her support for transgender rights.\n\nVirginia Lieutenant Governor Winsome Earle-Sears arrives on stage before addressing supporters at a rally in Richmond on June 17, 2025.\n\nWhy Didn’t Glenn Youngkin Seek Reelection? \n\nYoungkin was ineligible to run for reelection again due to term limits that prevent a governor from being elected to two consecutive terms in office.\n\nHe won in 2021 by just under 2 percentage points, defying the state’s political lean. He has remained fairly popular in office—an Emerson College poll released just days before the election showed him with a +10 approval (49 percent approving to 39 percent disapproving). It surveyed 880 likely voters from October 30 to 31 and had a margin of error of plus or minus 3.2 percentage points.\n\nWhat People Are Saying\n\nJeff E. Schapiro of Sabato’s Crystal Ball wrote in an October 29 update: “A Spanberger victory—consistently suggested by independent political polling that occasionally has her leading Earle-Sears by double-digits, a 2-to-1 advantage in fundraising, organizational and message discipline, as well as the counter-cyclical quirkiness of Virginia gubernatorial politics—would, as a rejection of Trump in a suburban-dominated, two-party-competitive state, not be interpreted only as a mini-referendum on the Republican president.”\n\nRepublican Winsome Earle-Sears wrote in a Fox News opinion piece published Monday: “Throughout this campaign I have met parents, small business owners, veterans and young people who are all asking for the same thing. They want leaders who listen, who lead with principle and who remember that common sense still matters. They do not want mealy-mouthed politicians.”\n\nDemocrat Abigail Spanberger said during a campaign event: “When the polls close, we will get the results of this election. This journey has been an incredible one because I have traveled all across Virginia, meeting Virginians, talking to Virginians. Listening to their challenges, their dreams, their concerns and their worries.”\n\nWhat Happens Next\n\nSpanberger will take office in January 2026.","summary":"Polls leading up to the race showed Spanberger with an advantage over Earle-Sears.","url":"https://www.newsweek.com/virginia-election-results-abigail-spanberger-winsome-earle-sears-governor-10985260","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-2244499310.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-05 00:59:42","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.077},{"id":375817420,"title":"Matson pays $6.4M in port fees to China since levies started","text":"LOS ANGELES >> Honolulu-based ocean shipping company Matson Inc. has paid $6.4 million in port fees to China since they were implemented on Oct.14, CEO Matt Cox said today.\n\nPresident Donald Trump and China’s President Xi Jinping last week agreed to put those tit-for-tat levies on pause for 12 months, starting on Nov. 10.\n\nMedia outlets in China had reported that Matson, one of several global shipping firms with U.S.-built and -flagged vessels, was the first to pay the fees in China.\n\nMatson expects the U.S. Trade Representative and the China Ministry of Transport to publish specific instructions, including any refund programs, regarding port entry fees shortly, Cox said on the company’s quarterly earnings call.\n\nEarly this year, the Trump administration announced plans to levy fees on China-linked ships to loosen the country’s grip on the global maritime industry and bolster U.S. shipbuilding — a move vessel operators warned would disrupt trade flows and ultimately drive up costs for consumers.\n\nChina retaliated with fees on ships with links to the United States, and started charging them on Oct. 14 — the same day U.S. fees went into effect.\n\n“This is a welcome development,” Cox said of the deal struck between the leaders of the world’s largest economies, which also trimmed U.S. tariffs on Chinese goods and put China’s rare earth export curbs on hold.\n\nIf the levies had not been put on hold, Matson could have paid $80 million annually in port fees in both 2026 and 2027, Cox said.\n\nChina’s state-owned COSCO container shipping line was most exposed to U.S. port fees, which analysts said could cost the firm $1.5 billion annually.","summary":"LOS ANGELES >> Honolulu-based ocean shipping company Matson Inc. has paid $6.4 million in port fees to China since they were implemented on Oct.14, CEO Matt Cox said today.","url":"https://www.staradvertiser.com/2025/11/04/breaking-news/matson-pays-6-4m-in-port-fees-to-china-since-levies-started/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/11/web1_20151104-034.jpg","video":null,"publish_date":"2025-11-05 00:59:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":-0.559},{"id":375819734,"title":"Republicans lash out at Pentagon officials over treatment of Australia","text":"Washington: Republican frustration with top personnel at the Pentagon has boiled over during a public hearing on Capitol Hill, with anger about the treatment of Australia and the AUKUS agreement at the heart of the dispute.\n\nThree Republicans on the powerful Senate Armed Services Committee voiced concerns about how the policy team inside the Pentagon, led by undersecretary of war Elbridge Colby, has appeared to deviate from President Donald Trump’s priorities on major matters concerning United States allies.\n\nThat included the AUKUS defence pact between Australia, the US and the United Kingdom, as well as a short-lived “pause” on US weapons assistance to Ukraine earlier this year and a recent drawdown of US troops stationed in NATO ally country, Romania.\n\nThe Pentagon launched a review of AUKUS in June and, in briefings to reporters, raised concerns about whether the agreement suited “America First” interests or was feasible. That included questions over whether the US was producing enough nuclear-powered submarines to sell them to Australia, and how Australia would use them in the event of a conflict with China.","summary":"Frustration with top personnel at the Pentagon has boiled over during a public hearing on Capitol Hill, with anger about AUKUS at the heart of the dispute.","url":"https://www.smh.com.au/world/north-america/republicans-lash-out-at-pentagon-officials-over-treatment-of-australia-20251105-p5n7t5.html","image":"https://static.ffx.io/images/$zoom_0.7486214814814816%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_194%2C$y_231/t_crop_custom/q_86%2Cf_auto/3bef0440f39316ab8e3b80a70450fe932d6d9723","video":null,"publish_date":"2025-11-05 00:49:20","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","source_country":"au","sentiment":0.012},{"id":375818656,"title":"World on track to dangerous warming as emissions hit record high: UN","text":"PARIS: National commitments to slash heat-trapping pollution would limit global warming up to 2.5C this century — nowhere near enough to avoid devastating climate impacts despite a sweep of new pledges, the UN warned Tuesday.\n\nScientists are in broad agreement that warming above 1.5C relative to pre-industrial times risks catastrophic consequences, and every effort must be made to stick as close as possible to this safer threshold.\n\nBut the world is set to blow past 1.5C in a matter of years and planet-warming emissions keep rising, hitting a new record high in 2024, according to a report by the UN Environment Programme (UNEP).\n\nThe sobering assessment was published just days before world leaders gather in Brazil on Thursday and Friday ahead of the COP30 climate summit in the rainforest city of Belem.\n\nWith an overshoot of 1.5C now inevitable, focus has shifted to how quickly temperatures can be returned to less-risky levels.\n\n“Our mission is simple, but not easy: make any overshoot as small and as short as possible,” UN Secretary-General Antonio Guterres said Tuesday at the launch of UNEP’s Emissions Gap report.\n\nBig polluters most responsible for the crisis have been urged to pledge faster and deeper emissions cuts to bend the curve back to 1.5C by the end of the century.\n\nInstead, the latest round of carbon-cutting targets announced ahead of the UN climate talks “have barely moved the needle”, concluded UNEP’s latest assessment.\n\n“Ambition and action are nowhere near the levels needed globally or collectively,” Anne Olhoff, the report’s chief scientific editor, told AFP.\n\nThe latest assessment projects that the world’s collective commitments to tackle climate change, if enacted in full, would result in 2.3C to 2.5C of warming by 2100.\n\nThat poses an unacceptable threat to the survival of nations most at risk by rising seas and extreme weather, and the global failure to rise to this challenge will loom over COP30.\n\nScientists have strong evidence that warming above 1.5C — let alone a degree or more — increases not only the intensity of hurricanes, floods and other disasters, but the likelihood of catastrophic climate tipping points.\n\nAt 1.4C above pre-industrial times, the Earth is already too warm for most tropical coral reefs to survive, while ice sheets and the Amazon rainforest could suffer severe and lasting changes below 2C, with consequences for the entire planet. \n\nUnder the Paris Agreement, each round of climate pledges is supposed to be more ambitious than the last to keep long-term warming “well below” 2C and as close as possible to 1.5C.\n\nDespite being obligated to do so, only around one-third of countries announced a 2035 emissions reduction target by September 30, UNEP said.\n\nThis year’s warming projections are 0.3C lower than last year, but Olhoff said little of that reduction was thanks to these latest pledges.\n\nUpdates to methodology accounted for 0.1C while another 0.1C was attributed to US commitments made under the Biden administration. These gains are unlikely to materialise as President Donald Trump has vowed to pull the United States out of the Paris accord and ditch the climate policies of his predecessor.\n\n“If we don’t include the US, then the progress is quite limited,” Olhoff said.\n\nThe dozens of other climate pledges made by governments in recent months “do not have a large effect on the temperature projections”, she added.\n\n“That is a very bleak picture, you can say.”\n\nGlobal emissions grew 2.3 percent in 2024 compared to the previous year, an increase driven by India followed by China, Russia and Indonesia.\n\nThis rise was quite high in the context of recent years “and comparable to the emissions growth in the 2000s”, the report said.","summary":"PARIS: National commitments to slash heat-trapping pollution would limit global warming up to 2.5C this century — nowhere near enough to avoid devastating climate impacts despite a sweep of new pledges, the UN warned Tuesday.\n\n\n\nScientists are in broad agreement that warming above 1.5C relative to pre-industrial times risks catastrophic consequences, and every effort must be made to stick as close as possible to this safer threshold.\n\n\n\nBut the world is set to blow past 1.5C in a matter of years and planet-warming emissions keep rising, hitting a new record high in 2024, according to a report by the UN Environment Programme (UNEP).\n\n\n\nThe sobering assessment was published just days before world leaders gather in Brazil on Thursday and Friday ahead of the COP30 climate summit in the rainforest city of Belem.\n\n\n\nWith an overshoot of 1.5C now inevitable, focus has shifted to how quickly temperatures can be returned to less-risky levels.\n\n\n\n“Our mission is simple, but not easy: make any overshoot as small and as ","url":"https://www.brecorder.com/news/40390878/world-on-track-to-dangerous-warming-as-emissions-hit-record-high-un","image":"https://i.brecorder.com/large/2025/11/690a7075342ac.jpg","video":null,"publish_date":"2025-11-05 00:48:16","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":-0.236},{"id":375818688,"title":"Trump backs Cuomo, threatens to cut funds for New York City if Mamdani wins","text":"WASHINGTON: US President Donald Trump endorsed former New York Governor Andrew Cuomo for mayor of New York City on Monday and threatened to hold back federal funds to the city if Democratic candidate Zohran Mamdani wins the mayoral election on Tuesday.","summary":"WASHINGTON: US President Donald Trump endorsed former New York Governor Andrew Cuomo for mayor of New York City on Monday and threatened to hold back federal funds to the city if Democratic candidate Zohran Mamdani wins the mayoral election on Tuesday.","url":"https://www.brecorder.com/news/40390940/trump-backs-cuomo-threatens-to-cut-funds-for-new-york-city-if-mamdani-wins","image":"https://i.brecorder.com/large/2025/11/690a932286146.jpg","video":null,"publish_date":"2025-11-05 00:48:15","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.354},{"id":375818678,"title":"US shutdown hurting economy, food assistance","text":"WASHINGTON: The US government shutdown on Tuesday entered its 35th day, matching a record set during President Donald Trump’s first term for the longest in history, as Republicans and Democrats in Congress continue to blame each other for the standoff. \n\nThe toll increases by the day. Food assistance for the poor was halted for the first time, federal workers from airports to law enforcement and the military are going unpaid and the economy is flying blind with limited government reporting. \n\nThe Senate has voted more than a dozen times against a stopgap funding measure passed by the House of Representatives, and no lawmakers have changed their position. Trump’s Republicans hold a 53-47 majority in the Senate but need votes from at least seven Democrats to meet the chamber’s 60-vote threshold for most legislation. Democrats are withholding their votes to extract an extension of some healthcare insurance subsidies. \n\n“The victims of the Democrats’ shutdown are starting to pile up,” Republican Senate Majority Leader John Thune said on Monday. “The question is how long are Democrats going to continue this. Another month? Two? Three?” \n\nHis Democratic counterpart Chuck Schumer on Monday pointed out how Trump’s attention has been focused elsewhere. \n\n“While Donald Trump is bragging about remodeling bathrooms at the White House, Americans are panicking about how they will afford healthcare next year,” Schumer said, referring to a remodeling Trump unveiled on Friday. \n\nOn Monday, however, there was talk rippling through the Senate that closed-door conversations between the two parties might be making some progress. \n\nThe 15th shutdown since 1981 stands out not just for its length. It has inverted the normal partisan dynamic in which shutdowns have often been provoked by Republicans. \n\nIn addition, little effort has been put into ending this latest shutdown. The House has been out of session since September 19 and Trump has repeatedly left Washington. \n\n“The political climate and the tensions that exist between the parties were so wide at the beginning of the shutdown, and even though bipartisan talks have continued through it, remain at this point still just as wide,” said Rachel Snyderman, managing director of economic policy at the Bipartisan Policy Center. Food assistance for approximately 42 million Americans in the SNAP program ran out on Saturday. Many families are now without the approximately $180 per month on average of food stamps. The Trump administration on Monday said it would partially fund November food benefits but warned that it could take weeks or months for the aid to be distributed. \n\nA portion of Head Start early learning programs for low-income children also faces some closed doors as new funding was not available on November 1. Federal workers like law enforcement and members of the military are now missing paychecks, as are airport security screeners and air traffic controllers, resulting in staffing challenges and travel delays.","summary":"WASHINGTON: The US government shutdown on Tuesday entered its 35th day, matching a record set during President Donald Trump’s first term for the longest in history, as Republicans and Democrats in Congress continue to blame each other for the standoff. \n\n\n\nThe toll increases by the day. Food assistance for the poor was halted for the first time, federal workers from airports to law enforcement and the military are going unpaid and the economy is flying blind with limited government reporting. \n\n\n\nThe Senate has voted more than a dozen times against a stopgap funding measure passed by the House of Representatives, and no lawmakers have changed their position. Trump’s Republicans hold a 53-47 majority in the Senate but need votes from at least seven Democrats to meet the chamber’s 60-vote threshold for most legislation. Democrats are withholding their votes to extract an extension of some healthcare insurance subsidies. \n\n\n\n“The victims of the Democrats’ shutdown are starting to pile up,” Republican Senate Majo","url":"https://www.brecorder.com/news/40390949/us-shutdown-hurting-economy-food-assistance","image":"https://i.brecorder.com/large/2025/11/05040438be74f00.webp","video":null,"publish_date":"2025-11-05 00:48:15","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.153},{"id":375813786,"title":"Polls close in Virginia as voters choose state's first female governor","text":"Richmond, Nov 5 (AP) Polls have closed in Virginia, where voters were deciding whether to keep the governor’s mansion in Republican hands by electing Lt Gov Winsome Earle-Sears or flipping it to Democratic control under former US Rep Abigail Spanberger.\nThe race, in one of two states where voters are picking governors this year, is seen as a snapshot of voter sentiment nine months into the Trump administration. That is especially true in Virginia, which has a concentration of federal workers in the north who have been impacted by the president’s cuts to the workforce and the government shutdown.\nVoters in Virginia have favoured Democrats in recent decades but the state in 2021 chose Republican Glenn Youngkin and in 2024, Democratic Vice President Kamala Harris won the state by only a modest margin.\nOne thing that is for certain is that the winner will be the commonwealth’s first female governor.\nVoters elsewhere were casting ballots to choose a new governor in New Jersey and a mayor in New York City.\nIn California, voters were deciding whether to approve a new congressional map that is designed to help Democrats win five more US House seats in next year’s midterm elections. The measure is a response to President Donald Trump’s efforts to aggressively gerrymander districts to favour Republicans in states where the GOP is in power.\nPolling across Virginia’s counties and cities were open from 6 am to 7 pm (local time). Voters in line at a polling place at 7 pm can still cast ballots.\n Virginia voters are choosing a new governor and lieutenant governor. They’re also deciding whether Republican Attorney General Jason Miyares should get another term or if Democratic challenger Jay Jones should replace him. All 100 seats in the House of Delegates also are up for election.\n There are well over 6 million registered voters in Virginia. The last time these statewide races were on the ballot in 2021, the overall voter turnout was 55 per cent.\n This year, nearly 1.5 million people have cast absentee ballots, mostly through the mail or in person. (AP) ARI","summary":"","url":"https://www.news18.com/agency-feeds/polls-close-in-virginia-as-voters-choose-states-first-female-governor-9680822.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-11-05 00:43:24","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.274},{"id":375813788,"title":"In Election 2025, economy still the main thing: AP Voter Poll","text":"Washington, Nov 5 (AP) Economic worries were the dominant concern as voters in the US cast ballots for Tuesday’s elections, according to preliminary findings from the AP Voter Poll.\nThe results of the expansive survey of more than 17,000 voters in New Jersey, Virginia, California and New York City suggested that the public was troubled by an economy that seems trapped by higher prices and fewer job opportunities.\nAnd a year after President Donald Trump was brought back to the White House on the promise that he could tame inflation and unleash growth, economic worries were still at the top of voters’ minds.\nDespite a rising stock market, inflation remains elevated, and hiring has slowed sharply. Since October, a federal government shutdown has only compounded the sense of uncertainty.\nWhile Trump has tried to highlight his efforts to deport immigrants in the country illegally and send federal officers and National Guard troops into cities to fight crime, few voters saw these issues as the top concern for the places they live.\nThese broader economic anxieties were accompanied by high discontent in some of the off-year elections. More than half of voters in New Jersey and Virginia said they were “angry” or “dissatisfied” with how things were going in the country.\nThe economic challenges have played out in different ways at the local level.\nMost New Jersey voters said property taxes were a “major problem”, while most New York City voters said this about the cost of housing. Most Virginia voters said they’ve felt at least some impact from the recent federal government cuts. (AP) ARI ARI","summary":"","url":"https://www.news18.com/agency-feeds/in-election-2025-economy-still-the-main-thing-ap-voter-poll-9680821.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-11-05 00:43:23","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.306},{"id":375814138,"title":"Rumors over who Trump plans to pardon next have turned into six-figure betting pools - with clear favorites","text":"Following last month’s pardon of crypto executive Changpeng Zhao, bettors are eagerly trying to guess whom Donald Trump will pardon next.\n\nThe online prediction site Polymarket’s users believe there is a nine percent chance that Trump pardons his former advisers Steve Bannon and Roger Stone, as of Tuesday.\n\nOther top picks included outgoing New York City Mayor Eric Adams at eight percent, and, each with seven percent, former Trump lawyer Rudy Giuliani, music mogul P. Diddy, and crypto executive Roger Ver. \n\nWhile bettors believed these individuals had higher chances of getting a pardon, more money was spent betting on those with lower percentages, including crypto executive Sam Bankman-Fried, who generated more than $916,000 in trading volume, and Jeffrey Epstein associate Ghislaine Maxwell, who caused more than $463,000 in trading.\n\nNot everyone on the list is currently facing the kind of federal charges or convictions that could be wiped with a presidential pardon, and some have gotten past reprieves from Trump.\n\nBannon was pardoned in 2021 for his involvement in swindling donors in a private attempt to build a wall along the U.S.-Mexico border. In October, he appealed to the U.S. Supreme Court to overturn the contempt of Congress conviction he got for refusing to testify in the January 6 investigation. \n\nIn 2020, Trump granted clemency to Stone, who was about to face prison time after being found guilty of lying to Congress and intimidating witnesses. \n\nFederal officials dropped a corruption case against Adams after the official spent months making overtures to the White House on its immigration agenda. The Trump administration has reportedly mulled a federal position for Adams, though he has denied reports he’s in conversations with the White House.\n\nSeveral top prosecutors resigned in protest of the decision to drop the case. \n\nVer, a cryptocurrency evangelist nicknamed “Bitcoin Jesus,” reached a $49.9 million deferred prosecution agreement with the Justice Department last month in a tax evasion case.\n\nTrump has attracted criticism for his pardon of Zhao, the former CEO of Binance, a company that has been involved in lucrative partnerships with the Trump family’s crypto endeavors. \n\n“I don’t know who he is,” Trump said over the weekend when pressed about the pardon on 60 Minutes.\n\nAs The Independent has reported, online betting markets have come to play an important role as real-time tools to track political sentiment. \n\nSome observers argue that such betting drives civic engagement and incorporates new information faster than traditional polling, while others fear such markets risk driving corruption.","summary":"Bettors have spent over $1 million guessing whom the president will pardon next","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-pardon-bet-polymarket-b2858708.html","image":"https://static.independent.co.uk/2025/11/04/11/13/GettyImages-2244245700.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/Mf2btm6h-OhrQWqOm.mp4","publish_date":"2025-11-05 00:38:32","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":0.078},{"id":375816258,"title":"Rumors over who Trump plans to pardon next have turned into six-figure betting pools - with clear favorites","text":"Following last month’s pardon of crypto executive Changpeng Zhao, bettors are eagerly trying to guess whom Donald Trump will pardon next.\n\nThe online prediction site Polymarket’s users believe there is a nine percent chance that Trump pardons his former advisers Steve Bannon and Roger Stone, as of Tuesday.\n\nOther top picks included outgoing New York City Mayor Eric Adams at eight percent, and, each with seven percent, former Trump lawyer Rudy Giuliani, music mogul P. Diddy, and crypto executive Roger Ver.\n\nWhile bettors believed these individuals had higher chances of getting a pardon, more money was spent betting on those with lower percentages, including crypto executive Sam Bankman-Fried, who generated more than $916,000 in trading volume, and Jeffrey Epstein associate Ghislaine Maxwell, who caused more than $463,000 in trading.\n\nNot everyone on the list is currently facing the kind of federal charges or convictions that could be wiped with a presidential pardon, and some have gotten past reprieves from Trump.\n\nBannon was pardoned in 2021 for his involvement in swindling donors in a private attempt to build a wall along the U.S.-Mexico border. In October, he appealed to the U.S. Supreme Court to overturn the contempt of Congress conviction he got for refusing to testify in the January 6 investigation.\n\nIn 2020, Trump granted clemency to Stone, who was about to face prison time after being found guilty of lying to Congress and intimidating witnesses.\n\nFederal officials dropped a corruption case against Adams after the official spent months making overtures to the White House on its immigration agenda. The Trump administration has reportedly mulled a federal position for Adams, though he has denied reports he’s in conversations with the White House.\n\nSeveral top prosecutors resigned in protest of the decision to drop the case.\n\nVer, a cryptocurrency evangelist nicknamed “Bitcoin Jesus,” reached a $49.9 million deferred prosecution agreement with the Justice Department last month in a tax evasion case.\n\nTrump has attracted criticism for his pardon of Zhao, the former CEO of Binance, a company that has been involved in lucrative partnerships with the Trump family’s crypto endeavors.\n\n“I don’t know who he is,” Trump said over the weekend when pressed about the pardon on 60 Minutes.\n\nAs The Independent has reported, online betting markets have come to play an important role as real-time tools to track political sentiment.\n\nSome observers argue that such betting drives civic engagement and incorporates new information faster than traditional polling, while others fear such markets risk driving corruption.","url":"https://uk.news.yahoo.com/rumors-over-trump-plans-pardon-003832061.html","image":"https://s.yimg.com/ny/api/res/1.2/pfsE0twwQeSoQ2WpYimxZQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/a31b59e15a734913bdc3d52cdb0b13ed","video":null,"publish_date":"2025-11-05 00:38:32","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":0.078},{"id":375812932,"title":"Dick Cheney was the chief architect of the catastrophic War on Terror who never apologised - even after he shot an elderly man in the face on a quail hunt","text":"Dick Cheney was the chief architect of the catastrophic War on Terror who never apologised - even after he shot an elderly man in the face on a quail hunt\n\nREAD: Dick Cheney dead: Vice President who served with George W. Bush dies \n\nBy TOM LEONARD, US CORRESPONDENT\n\nPublished: 00:23 GMT, 5 November 2025 | Updated: 00:34 GMT, 5 November 2025\n\nMost politicians try to avoid a reputation for villainy. But Dick Cheney relished his nickname in Washington: 'Darth Vader'.\n\nIn later life, when questioned about his ominous image, he'd point to a badge of the Star Wars baddie he'd fixed on his huge Ford pickup truck. 'I'm rather proud of that,' he'd say. In 2016, key Trump ally Steve Bannon offered an even more sinister comparison: 'Dick Cheney, Darth Vader, Satan: that's power.'\n\nWith his cultivated image as a strong, silent Westerner – complete with cowboy hat – Cheney was the driving force of the ill-fated Iraq War of 2003 to 2011, and a shadowy political operator widely regarded as the most powerful vice president in US history.\n\nLike the Vader comparison, he was proud, or at least unrepentant, of much in his career, even if it left plenty of his fellow Americans appalled.\n\nAs 'Veep' to the far less experienced George W. Bush, he was effectively the architect of the fateful 'War on Terror' that the US declared after the 9/11 attacks in 2001 – and in which some 4.6 million people are believed to have died.\n\nHe was unapologetic about his efforts in pursuing that conflict – judged a ruinous and destabilising misadventure by most historians – from waterboarding suspected terrorists even while critics insisted the practice was torture, to imprisoning Islamic radicals for years without trial in Guantanamo Bay.\n\nA leading light of the so-called 'neocons' (neo-conservatives) whose hawkish views on the primacy of defending American and Western civilisation dominated US foreign policy at the beginning of the 21st century, he always argued America had to be strong abroad and shouldn't hesitate to go to war.\n\nDick Cheney, the former US Vice President, died at the age of 84, his family said\n\nPresident Dick Cheney and his wife Lynn at the Stars and Stripes Gala in 2005\n\nCheney has died aged 84 from what his family described as complications of pneumonia, and cardiac and vascular disease. He'd already survived at least five heart attacks – the first when he was just 37 – and had a heart transplant in 2012.\n\nHe served three Republican presidents but, in Donald Trump, he finally found that there were limits to his loyalty.\n\nTrump, he said, was a 'coward' and a 'threat to the republic' who, he insisted, had tried to steal the 2020 election. Last year, Cheney publicly voted for Democrat rival Kamala Harris. Say what you like about Cheney – and the Left had plenty of objections to the conservative with the unnervingly crooked smile – but according to admirers he was a man who stuck to his principles and showed a moral backbone often missing in today's opportunistic and increasingly venal Republican Party.\n\nHe was fiercely anti-abortion but he staunchly supported his daughter Mary after she came out to the family as gay while in\n\nhigh school, many years before gay rights were a remotely mainstream cause in the US. 'Freedom means freedom for everyone,' he later said.\n\nHe said his favourite virtue was integrity, and his idea of happiness was fly fishing on Wyoming's Snake River. His image as a countryman took a knock in 2006, however, when he accidentally shot another hunter in the face, neck and torso – thankfully not fatally – during a quail hunt.\n\nThe victim, a 78-year-old Texan lawyer, suffered a heart attack several days later. Cheney never formally apologised.\n\nBorn in Nevada, he moved with his family to Wyoming when he was 13, where his father worked as a minor agricultural official. He met his future wife, Lynne Vincent, with whom he had two daughters, including politician Liz Cheney, at high school.\n\nCheney is seen with Joe Biden and his wife Jill at the Capitol in 2009 \n\nCheney won a scholarship to Yale University but was asked to leave after his grades slipped. Back in Wyoming, he began working as a line repairman for an electrical company before enrolling at the University of Wyoming, majoring in political science. It was Lynne who has been credited with encouraging him to pursue a political career.\n\nAfter starting as an aide to the Wyoming governor, he soon made his mark in Washington, where at just 34 he was made chief of staff (the youngest in American history) to President Gerald Ford.\n\nBREAKING NEWS\n\nFormer US Vice President Dick Cheney dies aged 84\n\nCheney rejected some of the perks of the job, continuing to drive around in his ten-year-old Volkswagen rather than using a chauffeur-driven limo. As a Wyoming US Congressman for a decade, he established himself as a hardline conservative and Cold War warrior who opposed Nelson Mandela's release from prison, condemned gun control and referred to Soviet officials as 'pigs in suits'.\n\nHe joined George Bush Snr's cabinet as defence secretary in 1989, unflappably overseeing the 1989 US invasion of Panama and the 1991 operation to liberate Kuwait from Saddam Hussein. The older Bush cemented Cheney's reputation for toughness by nicknaming him 'Old Iron Ass'.\n\nCheney left politics in 1993 – when Bill Clinton led the Democrats to power – to go into business, two years later taking over Halliburton, one of the world's biggest energy corporations.\n\nIn 2000, he was asked to help George W. Bush choose a running mate in his presidential campaign but, instead, 'Dubya' selected him. Cheney's heart issues – he'd had a quadruple bypass in 1988 – and lack of personal charisma made some Republicans reluctant to put him on the campaign trail, while he himself had dismissed the vice presidency as a 'cruddy job'. But he accepted and 'Bush/Cheney' won.\n\nIt soon became clear that, unlike other VPs, Cheney was intent on accumulating and exercising power himself – albeit subtly. Biographer Barton Gellman said: 'Dick Cheney played a paramount role in decisions that ranged from war and peace to the economy, the environment and the meaning of the law. His hand was often unseen even by colleagues.'\n\nBefore his vice presidency, Cheney (right) held a number of high ranking positions in the Republican party\n\nAfter the 9/11 attacks, he championed the so-called Cheney Doctrine, a national security strategy that argued that the US needed to attack anyone who conceivably posed a threat.\n\nThe idea was influential in Bush's decision – championed against domestic opposition by Tony Blair – to widen the War on Terror to include Iraq, which played no role in 9/11. Cheney remained unbowed even as US casualties mounted into the thousands and the 'weapons of mass destruction' used to justify the invasion failed to materialise.\n\nHis refusal to ever express any regret about the Iraq War fuelled suspicions that he'd had ulterior motives for pushing for it – a theory that gained traction when his old company, Halliburton, swiftly won major contracts to supply the US military in the field. Critics claimed Cheney had a personal financial interest in pursuing the invasion.\n\nBy the time he'd ended his tenure as VP, his public approval rating had sunk to 13 per cent. But he continued to heckle the Democrats from the sidelines, in particular raining criticism on Barack Obama.\n\n'Dick Cheney said I was the worst president of his lifetime,' Obama quipped. 'Which is interesting – because I think Dick Cheney is the worst president of my lifetime.'\n\nCheney's legacy will probably never overcome the Iraq War, in which up to a million people are estimated to have died and which laid the seeds for the rise of Isis and much else.\n\nIn 2018, Christian Bale played Cheney – unflatteringly – in a satirical feature film, Vice.\n\nCheney recalled that his granddaughter went to see it.\n\n'I said: 'What did you think?' She said: 'Well, it says you are a real badass. And that's cool.'\n\nHe would surely have been delighted.\n\nShare or comment on this article:\nDick Cheney was the chief architect of the catastrophic War on Terror who never apologised - even after he shot an elderly man in the face on a quail hunt\n\nAdd comment","summary":"Most politicians try to avoid a reputation for villainy. But Dick Cheney relished his nickname in Washington: 'Darth Vader'.","url":"https://www.dailymail.co.uk/news/article-15259405/Dick-Cheney-never-apologised-shot-elderly-man-face.html","image":"https://i.dailymail.co.uk/1s/2025/11/05/00/103598867-0-image-a-109_1762302838625.jpg","video":null,"publish_date":"2025-11-05 00:34:19","author":"Editor,Tom Leonard","authors":["Editor","Tom Leonard"],"language":"en","source_country":"gb","sentiment":0.252},{"id":375815710,"title":"Trump's shadow looms over U.S. elections as first polls close","text":"APWorkers prepare for voters at a poll site, in New York, Tuesday, Nov. 4, 2025. (AP Photo/Richard Drew)\n\nVoters in New Jersey and Virginia cast ballots for governor on Tuesday in a pair of races that will serve as an early gauge of the American electorate's mood after President Donald Trump's norm-shattering nine months in office. Polls closed at 7 p.m. ET (0000 GMT on Wednesday) in Virginia, where Democrat Abigail Spanberger, a former congresswoman and CIA officer, was vying with Republican Lieutenant Governor Winsome Earle-Sears to become the first woman to serve as the state's governor. Decision Desk HQ, a nonpartisan election forecaster, projected that Spanberger had won, though other news outlets had yet to name a winner.Polls in New Jersey's governor's race will close at 8 p.m. ET (0100 GMT). In New York City's mayoral race, Democratic nominee Zohran Mamdani, a 34-year-old democratic socialist, faced 67-year-old Andrew Cuomo, a moderate Democrat running as an independent after losing to Mamdani in the primary four years after resigning as New York state's governor in disgrace. The campaign has laid bare the Democratic Party's generational and ideological divides as it seeks to rehabilitate its damaged brand. And in California, voters will decide whether to give Democratic lawmakers the power to redraw the state's congressional map, expanding a national battle over redistricting that could determine which party controls the U.S. House of Representatives after next year's midterm elections.Democrats were watching Tuesday's results carefully, with the party locked out of power in Washington and struggling to find consensus on the best way to oppose Trump, a Republican, and find a path out of the political wilderness. Former President Barack Obama, still the party's most popular figure, headlined 11th-hour rallies over the weekend in New Jersey and Virginia, exhorting voters to elect Democrats to counter what he branded Trump's lawlessness.In interviews at polling stations on Tuesday, some voters said Trump's most contentious policies were on their minds, including his efforts to deport immigrants who entered the U.S. illegally and to impose costly tariffs on imports of foreign goods, the legality of which is being weighed by the U.S. Supreme Court this week.More than 3 million people voted early in Virginia, New York and New Jersey, in each case far exceeding the totals from four years ago. In New York City, there were 735,000 ballots cast, according to the city elections board, more than four times the number in 2021. The New Jersey race was the most hotly contested campaign, with opinion polls showing Democrat Mikie Sherrill, a congresswoman and former Navy pilot, holding a narrow lead over her Republican challenger, former state lawmaker and small-business owner Jack Ciattarelli.Live EventsA spate of hoax bomb threats sent by email briefly closed down New Jersey polling stations in seven counties in the morning, state officials said.TRUMP STILL ON VOTERS' MINDSTrump remained top of mind for many voters despite not appearing on the ballot.In Virginia, Juan Benitez, a self-described independent, was voting for the first time. The 25-year-old restaurant manager backed all of Virginia's Democratic candidates because of his opposition to Trump's immigration policies and the federal government shutdown, for which he blamed Trump.Jennifer Manton, 47, said she had voted for Trump all three times he ran for president, and backed Republican candidates on Tuesday, citing Trump's tariffs as a major issue.In New York, Mamdani, who was a little-known lawmaker in New York's state legislature before his surprising rise, has led by double digits over Cuomo, with Republican nominee Curtis Sliwa, 71, a distant third in most opinion polls.California's ballot measure, Proposition 50, which would install a new Democratic-backed congressional map that aims to flip five Republican seats in response to a similar move by Texas, was also widely expected to pass.AFFORDABILITY, TRUMP WEIGH ON RACESWhile Tuesday's results will offer some insight into the mood of American voters, the midterm elections are a year away, an eternity in politics.\"There's nothing that's going to happen in Virginia or New Jersey that's going to tell us much about what will happen in a congressional district in Missouri or a Senate race in Maine,\" said Douglas Heye, a Republican strategist.For Democrats, Tuesday's candidates offer a chance to assess differing playbooks.Spanberger and Sherrill, both moderate Democrats with backgrounds in national security, put Trump front-and-center, seeking to harness anger at the president's no-holds-barred agenda.In New York, Mamdani has proposed ambitious left-wing policies, including freezing rents for nearly a million apartments and making the city's buses free. A day after endorsing Cuomo, Trump said on Tuesday that any Jewish New Yorker who voted for Mamdani, a critic of the Israeli government who would be the city's first Muslim mayor, was a \"stupid person.\"It was the latest in a string of comments over the course of the U.S. president's career suggesting that Jewish Americans vote against their own interests. Mamdani, who did not immediately respond to a request for comment, rejects Republican accusations of antisemitism.For Republicans, Tuesday's elections will test whether the voters who powered Trump's victory in 2024 will still show up when he is not on the ballot.But Ciattarelli and Earle-Sears, each running in Democratic-leaning states, have faced a conundrum: criticizing Trump risks losing his supporters, but embracing him too closely could alienate moderate and independent voters who disapprove of his policies.Trump remains unpopular: 57% of Americans disapprove of his job performance, a Reuters/Ipsos poll showed. But Democrats are not gaining support as a result, with respondents evenly split on whether they would favor Democrats or Republicans in 2026. Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onnew york pollstrumpsenatedemocratic partyzohran mamdanius elections\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onnew york pollstrumpsenatedemocratic partyzohran mamdanius elections(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Voters in New Jersey and Virginia cast ballots for governor. These races offered an early look at the American electorate's mood.  Results from New York City's mayoral election and California's redistricting proposal were also closely watched.  Former President Barack Obama urged voters to elect Democrats.  Donald Trump's influence remained a key factor for many voters.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trumps-shadow-looms-over-u-s-elections-as-first-polls-close/articleshow/125099101.cms","image":"https://img.etimg.com/thumb/msid-125099110,width-1200,height-630,imgsize-181840,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-05 00:30:46","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.059},{"id":375813292,"title":"School Assembly News Headlines For November 4: Top National, International & Others News","text":"News Headlines for School Assembly, November 4, 2025: From PM Modi’s visit to Bhutan on November 11-12 to David Beckham being officially knighted on Tuesday, here are the top news highlights for November 4.\nTop National News:\n– A MEMU local train travelling from Gevra Road to Bilaspur collided with a goods train between Gatora and Bilaspur around 4 pm.\n– Prime Minister Narendra Modi is likely to visit Bhutan on November 11-12. He will be the guest of honour at celebrations marking the monarch’s 70th birthday. He is also expected to inaugurate Punatsangchhu-II Hydropower Project.\n– In India, a person’s chances of dying in a road accident are far higher than being murdered or dying by suicide. India has lost close to 15 lakh lives to road crashes in the 10-year period between 2014 and 2023, analysis of official data by News18 shows.\nTop International News:\n– US President Donald Trump on Tuesday warned fellow Republicans that if they “don’t do away with the filibuster,” they risk losing the 2026 midterm elections and the 2028 presidential race, paving the way for Democrats to sweep both.\n– In a tragic incident, six people were killed after a military helicopter, conducting disaster relief operations in the wake of Typhoon Kalmaegi, crashed on Tuesday.\nTop Sports News:\n– England and Manchester United legend David Beckham was officially knighted on Tuesday as the celebrated footballer added yet another feather to his decorated cap.\nTop News in Business:\n– Indian equity benchmarks experienced a sharp selloff in the latter half of Tuesday’s session, mainly due to weakness in information technology and metal stocks. After starting the day on a higher note, the BSE Sensex reversed its gains to close 519.34 points, or 0.62%, lower at 83,459.15. The benchmark had briefly risen by 0.11% earlier in the day. The Nifty50 also lost ground, ending 165.70 points, or 0.64%, lower at 25,597.65.\nTop News in Education:\n– India has achieved remarkable success in the QS Asia University Rankings 2026, with seven universities now among the top 100 in the region. Five IITs – Delhi, Madras, Bombay, Kanpur, and Kharagpur – have earned places within this prestigious group.","summary":"School Assembly News Headlines For November 4th: Check top national, international, education, business and sports news for school assembly.","url":"https://www.news18.com/education-career/school-assembly-news-headlines-on-november-4-top-national-international-sports-business-education-updates-9680487.html","image":"https://images.news18.com/ibnlive/uploads/2025/11/schools-30-2025-11-392c2cc253c768d973b753d3854bd6d9.jpg","video":null,"publish_date":"2025-11-05 00:30:23","author":"Education And Careers Desk,News18,Sukanya Nandy","authors":["Education And Careers Desk","News18","Sukanya Nandy"],"language":"en","source_country":"in","sentiment":-0.234},{"id":375818536,"title":"Letters: Who cares about ‘No Kings’? Millions of Americans.","text":"Who cares about\n‘No Kings’? Millions\n\nDonald Trump’s response to the No Kings 2.0 protests on Oct. 18 was “who cares?” We, the people, nearly 7 million of us here in the U.S., care. We care about all aspects of Trump’s retribution agenda that are taking us quickly into a fascist dictatorship that will harm everyone except Trump’s MAGA followers from his cabinet on down.\n\nAmericans say they’re “scared,” but are they scared enough? Are they scared enough to publicly protest courageously and peacefully, or accompany immigrants to buy groceries who are afraid to go out of the house, or phone their D.C. elected officials to express their fears and outrage, or speak up publicly instead of being silent, or cancel Facebook, or use Android instead of an iPhone (Mark Zuckerberg and Tim Cook bent their knees and are now two of Trump’s biggest supporters), or boycott Target and Walmart (both scaled back their DEI initiatives on orders from Trump)? When will Americans be “scared enough before it’s too late”?\n\nRamona Krausnick\n\nSupport state effort\nto restore CEQA rules\n\nRe: “Chamber pushing initiative to revise CEQA, permitting rules” (Page A6, Oct. 24).\n\nDan Walter’s review of the Chamber of Commerce’s proposed ballot initiative mischaracterizes a new law overhauling CEQA, California’s landmark environmental protection law. Walters claims SB 131 applies “particularly to high-density, multi-family projects.” In reality, it encompasses a broad category of construction unrelated to housing, exempting “advanced manufacturing” projects from public disclosure, environmental review and mitigation of environmental and health harms.\n\nThirty-five concerned legislators — including East Bay state Senators Jesse Arreguín and Christopher Cabaldon and Assemblymembers Rebecca Bauer-Kahan, Mia Bonta and Liz Ortega — signed onto a letter urging fixes. In response, Assemblymember Damon Connolly introduced AB 1083 to restore vital environmental protections. I urge state Senators Arreguín, Cabaldon, Tim Grayson, Jerry McNerney and Aisha Wahab and Assemblymembers Bauer-Kahan, Bonta and Ortega to join Assemblymember Connolly as co-authors. We’re counting on you to protect us from industrial pollution and not allow the need to boost housing to be used as cover for giving industry a free pass to pollute and undermine our bedrock environmental protections.\n\nKate Zimmerman\n\nGOP, Democrats milking\n\nshutdown crisis for votes\n\n“Never let a crisis go to waste” — words every politician lives by and why both Democrats and Republicans, especially the lifers who run the Senate and House, are willing to let their shutdown fester a few more weeks. After all, their next “I’m fighting for you every day to save our democracy” election is only 12 months away. They need someone to blame for all the chaos and suffering their incompetence and unwillingness even to try to improve our failing health care system has caused.\n\nSolving problems is not what politicians do for a living. Winning their next election is all that matters, so if a few thousand kids go hungry or eventually there are fewer nurses, doctors and hospitals, so be it — there’s an election to win and they all need someone else to blame.\n\nUS should engage\nwith Russia on SALT\n\nRe: “Putin tests nuclear weapons as talks with U.S. falter” (Page A14, Nov. 2).\n\nThe New York Times article that you published on Nov. 2 was generally dismissive of any negotiations with the Russians, but at least it acknowledged that Vladimir Putin proposed last September to extend the sole remaining nuclear arms limitation agreement between the U.S. and Russia for an additional year to prevent its expiration this February. This extension would forestall an accelerated nuclear arms race and provide time for negotiations. Unfortunately, there has been no response from the Trump administration other than vague threats to resume nuclear test explosions.\n\nDespite the perverse suggestions of some commentators cited in this article that negotiations with the Russians would only give them leverage over us, preventing a new nuclear arms race is vital to our security and humanity’s.\n\nAt a time when many experts are alarmed that the danger of nuclear war is at an all-time high, we must not allow START to expire.\n\nMichael Dunlap","summary":"Also: Restore rules &#124; Stripping dignity &#124; Milking shutdown &#124; Engage on SALT. East Bay Times reader letters to the editor for Nov. 5, 2025.","url":"https://www.mercurynews.com/2025/11/04/letters-million-americans-care-no-kings/","image":"https://www.mercurynews.com/wp-content/uploads/2025/06/SJM-L-PROTEST-MOS-07.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-05 00:30:22","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.252},{"id":375812088,"title":"Mamdani vs. Cuomo in New York’s Fierce Mayoral Battle, as Virginia Awaits a Historic First Female Governor","text":"NEW YORK (AP) — New York City’s voters are deciding the outcome of a generational and ideological divide that will resonate across the country Tuesday as they choose the next mayor to run the nation’s largest city.\n\nZohran Mamdani, who won the Democratic primary earlier this year, faces former Gov. Andrew Cuomo, who is running as an independent, and perennial Republican candidate Curtis Sliwa, who is trying to land a massive upset.\n\nA victory for Mamdani would give the city its first Muslim mayor and its youngest leader in generations, while elevating the democratic socialist to political stardom and giving his brand of economic populism one of the most visible political perches in America.\n\nIf Cuomo comes out on top, he will have staged a remarkable political comeback four years after resigning as governor over a barrage of sexual harassment allegations.\n\nFor Sliwa — the creator of the Guardian Angels crime patrol group and a longtime New York tabloid fixture — a win would put a Republican in charge of the nation’s largest city at a time when many New Yorkers are seeking a leader who can keep President Donald Trump at bay.\n\nMeanwhile, Polls have closed in Virginia, where voters were deciding whether to keep the governor’s mansion in Republican hands by electing Lt. Gov. Winsome Earle-Sears or flipping it to Democratic control under former U.S. Rep. Abigail Spanberger. The race is seen as a snapshot of voter sentiment nine months into the Trump administration. That is especially true in Virginia, which has a concentration of federal workers in the north who have been impacted by the president’s cuts to the workforce and the government shutdown. Voters in Virginia have favored Democrats in recent decades, but the state in 2021 chose Republican Glenn Youngkin.\n\nPolls have closed in Virginia, where voters were deciding whether to keep the governor’s mansion in Republican hands by electing Lt. Gov. Winsome Earle-Sears or flipping it to Democratic control under former U.S. Rep. Abigail Spanberger.\n\nThe race, in one of two states where voters are picking governors this year, is seen as a snapshot of voter sentiment nine months into the Trump administration. That is especially true in Virginia, which has a concentration of federal workers in the north who have been impacted by the president’s cuts to the workforce and the government shutdown.\n\nVoters in Virginia have favored Democrats in recent decades but the state in 2021 chose Republican Glenn Youngkin and in 2024, Democratic Vice President Kamala Harris won the state by only a modest margin. One thing that is for certain is that the winner will be the commonwealth’s first female governor.\n\nVoters elsewhere were casting ballots to choose a new governor in New Jersey and a mayor in New York City. In California, voters were deciding whether to approve a new congressional map that is designed to help Democrats win five more U.S. House seats in next year’s midterm elections. The measure is a response to President Donald Trump’s efforts to aggressively gerrymander districts to favor Republicans in states where the GOP is in power.\n\nHere’s the latest:\n\nVirginia’s polls have closed\n\nPolls across the commonwealth’s counties and cities were open from 6 a.m. to 7 p.m. Voters in line at a polling place at 7 p.m. can still cast ballots.\n\nVirginia voters are choosing a new governor and lieutenant governor. They’re also deciding whether Republican Attorney General Jason Miyares should get another term or if Democratic challenger Jay Jones should replace him. All 100 seats in the House of Delegates also are up for election.\n\nThere are well over 6 million registered voters in Virginia. The last time these statewide races were on the ballot in 2021, overall voter turnout was 55%.\n\nThis year, nearly 1.5 million people have cast absentee ballots, mostly through the mail or in person.\n\nNYC’s outgoing mayor warns voters not to mess things up\n\nNew York City Mayor Eric Adams told reporters he cast his ballot for Cuomo, telling voters not to screw up the city by electing Democratic nominee Zohran Mamdani.\n\n“The only message I can give to New Yorkers as I go to the next leg of my journey: I’m leaving you a good city,” don’t mess it up, he said, using an expletive.\n\nAdams abandoned his own reelection campaign earlier this year after failing to politically recover from his now-dismissed federal corruption case. He endorsed Cuomo last month.\n\nMamdani volunteers pledge to continue door-knocking ‘until the very last minute’\n\nWith three hours until polls closed, a few dozen Mamdani supporters were gathered in the dark corner of a Brooklyn park, preparing to set out on their final canvas launch of the long campaign.\n\n“We will deliver Zohran a mandate tonight, but we have to keep pushing,” Austin Dilley, a 26-year-old line cook and field coordinator for the campaign, told the group of volunteers. “Your job is to find the people who still haven’t voted and get them to the polls in time.”\n\nAs volunteers — some in bright yellow Mamdani beanies — sipped hot chocolate and chalked the candidate’s name on the pavement, Dilley said the group planned to continue talking to voters “until the very last minute.”\n\n“There’s folks we’re talking to here in the park who had questions about the agenda that we could answer,” he said. “I think we’re still changing hearts and minds.”\n\nNew York City’s Board of Elections puts out another turnout update\n\nAs of 6 p.m., 1.7 million people have voted in the mayoral election.\n\nThat’s the biggest turnout in a New York City mayoral election in at least 30 years. Just under 1.9 million people voted in the 1993 race, when Republican Rudy Giuliani ousted Mayor David Dinkins, a Democrat.\n\nA Trump supporter says he still cast his ballot for Sliwa despite president’s call to vote for Cuomo\n\nDamian Koszalka, a carpenter from Queens, says he knew Trump wanted supporters of Republican candidate Curtis Sliwa to back Cuomo. But Koszalka wasn’t swayed, saying, “You have to go with your own guts.”\n\n“I don’t give a damn, you know, if Trump or whoever, is telling me I have to vote for this guy because that’s the less evil, or this and that,” he said after casting his ballot. “It doesn’t work that way.”\n\nTrump reluctantly endorsed Cuomo on the eve of the election, saying Mamdani would bring “disaster” to the city.\n\nKoszalka voted for Sliwa in 2021 when he ran for mayor that year. Koszalka says Sliwa, the creator of the Guardian Angels crime patrol group, is the only candidate on the ballot this year who “actually did something for the city,” referring to Cuomo and Mamdani as “parasites.”\n\nSome voters outside Sacramento say California should redraw its map to fight Trump-backed redistricting in red states\n\nKalinda Jones, who teaches social work classes at Folsom Lake College, about 25 miles (40 kilometers) northeast of Sacramento, supports the ballot measure that would implement a new congressional map that could flip as many as five U.S. House seats from Republican to Democratic control.\n\n“This is a legitimate response to what happened in Texas,” said Jones, a 53-year-old who’s not registered with any political party. “I want California to respond. I think it’s ridiculous that we have to respond.”\n\nAaron Samson, a 29-year-old Democrat who takes science classes at Folsom Lake College, said he planned to vote “yes” on Proposition 50.\n\n“I think it’s unfair what the Republican side is doing,” he said. “I wish we didn’t have to be in this situation.”\n\nFACT CHECK: Why some candidates appear multiple times on NYC’s ballot\n\nFor many years, New York voters have found candidates listed twice, three times or even more on their ballots when they go to the polling booth.\n\nIt isn’t an error — it’s a practice known as fusion voting that allows candidates to appear under multiple political parties if they are nominated by multiple parties.\n\nBut such intentional duplications on the New York City ballot this year, along with other layout choices, have some outside observers around the country wondering whether they are seeing evidence of rigged voting, including billionaire X owner Elon Musk.\n\n“The New York City ballot form is a scam!” he wrote in an X post. “No ID is required. Other mayoral candidates appear twice. Cuomo’s name is last in bottom right.”\n\nBut there is nothing amiss about the ballots, which are in keeping with New York’s voting laws.\n\nFusion voting “occurs pretty frequently and it enables the Democratic candidate to get the votes of people who don’t normally vote for Democrats and Republicans to get the vote of people who don’t vote Republican etc.,” said Richard Briffault, an expert on election administration and a professor at Columbia Law School.\n\nCuomo is in the eighth spot because he filed to run as an independent later in the process.\n\nHouston voters say they are frustrated they’ve been without a voice in the US House for 8 months\n\nVoters are only deciding on Tuesday who will be Democratic Rep. Sylvester Turner’s successor after the former Houston mayor died in March, just weeks into his first term.\n\nTexas Gov. Greg Abbott said he set the election for November out of concern for what he described as Harris County’s history of election problems. Democrats accused Abbott, a Republican, of keeping the seat empty to help the GOP maintain their thin House majority.\n\nDistrict resident Jose Saucedo said not having representation has worried him.\n\n“The lack of leadership is concerning,” the 54-year-old design professor said. “I hope that we can get a very strong leader for us, to represent us all.”\n\nSixteen candidates are running in the district. If no candidate reaches 50% of the vote, the top two vote-getters will advance to a runoff.\n\nSome Virginia Dem supporters describe themselves as former Republicans who no longer align with the party\n\nVoters in northern Virginia mentioned economic uncertainty, healthcare costs, anti-immigration rhetoric and Republican extremism as reasons they were siding with Democrats on Tuesday.\n\nAccountant Sherry Kohan, 56, voted at the Aurora Hills Library in Arlington on Tuesday morning. She said she split her ticket — voting for Democratic U.S. Rep. Abigail Spanberger for governor while choosing Republican nominee Jason Miyares for attorney general.\n\nKohan said she used to think of herself as Republican but hasn’t felt aligned with either party since Trump’s first term. Her vote for Spanberger was a vote against Trump. She blamed Republicans for the government shutdown.\n\n“They have the majority and they should be able to get something done,” she said. “But I mean, there’s a little part of me that says, ‘Fire them all, get rid of all of them.’”\n\nSchumer stays out of the NYC mayor’s race\n\nSenate Democratic Leader Chuck Schumer on Tuesday declined to say who he voted for in New York City’s mayoral election, telling reporters only, “I voted, and I look forward to working with the next mayor to help New York City.”\n\nThe powerful New York Democrat has largely stayed out of the contentious race to lead America’s biggest city, choosing not to endorse Mamdani or Cuomo.\n\nMamdani has slowly picked up a slew of endorsements from many of the state’s Democratic leaders, including House Minority Leader Hakeem Jeffries and Gov. Kathy Hochul.","summary":"NEW YORK (AP) — New York City’s voters are deciding the outcome of a generational and ideological divide that will&#8230; Continue reading Mamdani vs. Cuomo in New York’s Fierce Mayoral Battle, as Virginia Awaits a Historic First Female Governor\n\n\nThe post Mamdani vs. Cuomo in New York’s Fierce Mayoral Battle, as Virginia Awaits a Historic First Female Governor appeared first on The National Herald.","url":"https://www.thenationalherald.com/mamdani-vs-cuomo-in-new-yorks-fierce-mayoral-battle-as-virginia-awaits-a-historic-first-female-governor/","image":"https://www.thenationalherald.com/wp-content/uploads/2025/11/Election-2025-America-Votes5-scaled.jpg","video":null,"publish_date":"2025-11-05 00:27:57","author":"Antonis","authors":["Antonis"],"language":"en","source_country":"us","sentiment":-0.006},{"id":375815272,"title":"Economic worries were at the top of voters’ minds in the 2025 elections, poll finds","text":"By JOSH BOAK, LINLEY SANDERS and AMELIA THOMSON-DEVEAUX, Associated Press\n\nWASHINGTON (AP) — Economic worries were the dominant concern as voters cast ballots for Tuesday’s elections, according to preliminary findings from the AP Voter Poll.\n\nThe results of the expansive survey of more than 17,000 voters in New Jersey, Virginia, California and New York City suggested the public was troubled by an economy that seems trapped by higher prices and fewer job opportunities.\n\nAnd a year after President Donald Trump was brought back to the White House on the promise that he could tame inflation and unleash growth, economic worries were still at the top of voters’ minds. Despite a rising stock market, inflation remains elevated, and hiring has slowed sharply. Since October, a federal government shutdown has only compounded the sense of uncertainty.\n\nWhile Trump has tried to highlight his efforts to deport immigrants in the country illegally and send federal officers and National Guard troops into cities to fight crime, few voters saw these issues as the top concern for the places they live.\n\nThese broader economic anxieties were accompanied by high discontent in some of the off-year elections. More than half of voters in New Jersey and Virginia said they were “angry” or “dissatisfied” with how things were going in the country.\n\nThe economic challenges have played out in different ways at the local level. Most New Jersey voters said property taxes were a “major problem,” while most New York City voters said this about the cost of housing. Most Virginia voters said they’ve felt at least some impact from the recent federal government cuts.\n\nMost voters said they aren’t getting ahead financially\n\nVoters mostly said their own finances were stable, but the poll results suggested that many feel they cannot get ahead in the current economy. That leaves them feeling stuck in place, instead of moving up the financial ladder.\n\nAbout 6 in 10 voters in New Jersey, Virginia and New York City said their family’s finances were “holding steady,” but relatively few felt they were “getting ahead,” and about one-quarter said they were “falling behind.”\n\nAbout half of Virginia voters, who were deciding between Democrat Abigail Spanberger and Republican Winsome Earle-Sears for governor, said the economy was the most important issue facing their state. Just 2 in 10 pointed to health care, about 1 in 10 named education or immigration, and fewer than that said crime was the top issue facing the commonwealth.\n\nMost New Jersey voters, who were choosing between Republican Jack Ciattarelli and Democrat Mikie Sherrill for governor, said either taxes or the economy were the top issue in their state. About one-third of voters named each of these issues, compared to about 2 in 10 who said this about health care. Less than 1 in 10 identified immigration or crime as top issues.\n\nJust over half of New York City voters said the cost of living was the most important issue in the city — as the expense of rent and level of income inequality has climbed in America’s most populated city. Democratic mayoral nominee Zohran Mamdani is running against Andrew Cuomo, the former New York governor, and Republican Curtis Sliwa. About one-quarter said crime was their major concern. Another 1 in 10 said this of immigration, and less than 1 in 10 pointed to health care or transportation as the top issue.\n\nDissatisfaction with direction of the country\n\nThe polling found a high level of discontent about America’s direction as a country in several states, a sign that few voters have felt reassured so far by Trump’s return to the White House.\n\nDemocratic-led California asked its residents to vote Tuesday on a plan to redraw the lines of its congressional districts, after Trump has pushed Republican states such as Texas to amend their district boundaries in hopes of helping GOP candidates in next year’s midterm elections.\n\nAbout half of California voters described themselves as “angry” about the direction of the country, with another 2 in 10 saying they were “dissatisfied.”\n\nAbout 6 in 10 voters in Virginia and New Jersey said they are “angry” or “dissatisfied” with the way things are going in the country today. Just one-third said they are “enthusiastic” or “satisfied.”\n\nFederal cuts hit Virginia voters, while New Jersey voters worry about taxes\n\nPeople are stressed about affordability, but that’s manifesting itself in different ways.\n\nIn Virginia, federal government layoffs and funding cuts initiated by the Trump administration seemed to be taking a toll. Roughly 6 in 10 voters said federal government cuts this year affected their family’s finances “a lot” or “a little.” Those economic woes could compound if the ongoing government shutdown persists and federal employees and contractors are forced to go without paychecks.\n\nIn New Jersey, property taxes and electricity costs were raising alarms. About 7 in 10 New Jersey voters called property tax rates where they live a “major problem” and about 6 in 10 said that about their utility bills. Sherrill, the Democrat, seized on cost-of-living issues to attack Trump, whereas Ciattarelli has suggested that tax cuts would help to provide relief on inflation.\n\nIn New York City, about 7 in 10 voters said the cost of housing where they live was “a major problem,” with renters being especially likely to point to this as an issue. Fewer voters called crime “a major problem” in the city.\n\nThe 2025 AP Voter Poll, conducted by SSRS from Oct. 22 – Nov. 4, includes representative samples of registered voters in California (4,490), New Jersey (4,244), New York City (4,304) and Virginia (4,215). The AP Voter Poll combines data collected from validated registered voters online and by telephone, with data collected in-person from election day voters at approximately 30 precincts per state or city, excluding California. Respondents can complete the poll in English or Spanish. The overall margin of sampling error for voters, accounting for design effect, is plus or minus 2.0 percentage points in California, 2.1 percentage points in New Jersey, 2.2 percentage points in New York City, and 2.1 percentage points in Virginia.","summary":"Poll results suggest that many voters feel they cannot get ahead in the current economy.","url":"https://www.ocregister.com/2025/11/04/election-2025-voter-poll-issues/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/APTOPIX_Election_2025_America_Votes_35646_9cb617.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-05 00:25:43","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.137},{"id":375811314,"title":"World News | Defence Secretary Meets Israeli Defence Minister, Signs MoU to Boost India-Israel Defence Ties","text":"Tel Aviv [Israel], November 5 (ANI): India's Defence Secretary Rajesh Kumar Singh met Israeli Defence Minister Israel Katz in Tel Aviv on Tuesday, where both sides reaffirmed their commitment to strengthening the long-standing defence partnership between the two nations.\nThe meeting took place alongside the 17th Joint Working Group (JWG) on Defence Cooperation, co-chaired by Defence Secretary Singh and Director General of Israel's Ministry of Defence Maj Gen (Res) Amir Baram. During the meeting, India and Israel signed a Memorandum of Understanding (MoU) on Defence Cooperation to provide a unified vision and policy framework for deepening bilateral defence collaboration, the Ministry of Defence said in a statement on Tuesday.\nAlso Read | US Government Shutdown: Donald Trump To Partially Finance SNAP Benefits After Court Orders GOP Administration To Pay for Food Aid.\nIn a post on X, the Ministry of Defence said, \"Defence Secretary Shri Rajesh Kumar Singh called on Israeli Defence Minister Mr. Israel Katz and briefed him on the key outcomes of the Joint Working Group (JWG) meeting, aimed at further strengthening the robust and enduring defence cooperation between India and Israel.\"\nThe MoU outlines a wide range of areas for cooperation, including strategic dialogues, training, defence industrial partnerships, and capability development. It also focuses on Science and Technology, Research and Development, Artificial Intelligence, and Cyber Security.\nAlso Read | US: Indian Ambassador Vinay Kwatra Meets Republican Senator Mike Rounds To Discuss Cooperation in Technology and Innovation (See Pic).\nAccording to the ministry, the agreement will promote co-development and co-production of advanced defence technologies and strengthen joint innovation between Indian and Israeli defence industries.\nThe JWG reviewed ongoing projects and agreed that both nations have benefited from each other's strengths in defence innovation and operational capability. The two sides discussed the potential areas for future collaboration in the field of technology as well as enhancing operational capabilities. They also deliberated on various issues, including shared challenges of terrorism and underscored their collective resolve to fight against the threat.\nIndia and Israel reaffirmed their shared commitment to fight terrorism and strengthen cooperation to address mutual security concerns.\nIndia-Israel defence partnership is long-standing, based on deep mutual trust and shared security interests, the Ministry added. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The meeting took place alongside the 17th Joint Working Group (JWG) on Defence Cooperation, co-chaired by Defence Secretary Singh and Director General of Israel's Ministry of Defence Maj Gen (Res) Amir Baram. During the meeting, India and Israel signed a Memorandum of Understanding (MoU) on Defence Cooperation to provide a unified vision and policy framework for deepening bilateral defence collaboration, the Ministry of Defence said in a statement on Tuesday.","url":"https://www.latestly.com/agency-news/world-news-defence-secretary-meets-israeli-defence-minister-signs-mou-to-boost-india-israel-defence-ties-7191830.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251104211636.jpg","video":null,"publish_date":"2025-11-05 00:24:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.116},{"id":375811310,"title":"World News | Third India-Belgium Foreign Office Consultations Reviews Full Spectrum of Ties","text":"Brussels [Belgium], November 5 (ANI): The third round of the India-Belgium Foreign Office Consultations was held on Tuesday in Brussels, and was co-chaired by Sibi George, Secretary (West), Ministry of External Affairs (MEA), and Theodora Gentzis, President of the Board, Federal Public Service Foreign Affairs of Belgium, the MEA said in an official statement. As per the MEA, during the consultations, the two delegations reviewed the full spectrum of India-Belgium relations and reaffirmed their commitment to further strengthen the bilateral partnership. The key areas discussed included trade and investment cooperation, technology, science and innovation, defence and security, renewable energy, education and people-to-people relations.\nAlso Read | US Government Shutdown: Donald Trump To Partially Finance SNAP Benefits After Court Orders GOP Administration To Pay for Food Aid.\nThe statement noted how the meeting came after the successful visit of Princess Astrid of Belgium, leading an Economic Delegation to India in March 2025. Regular high-level political visits and interactions, including the visit of the Belgian Deputy Prime Minister/Foreign Minister to India and the External Affairs Minister to Belgium, have provided guidance and renewed momentum to bilateral relations.\nBoth sides also discussed the importance of deepening India-European Union (EU) ties, following the historic visit of the EU College of Commissioners to India in February this year and the communication on the new India-EU Strategic Agenda. They reaffirmed their joint commitment to advancing a comprehensive, balanced, fair and mutually beneficial India-EU Free Trade Agreement (FTA). Further, the Consultations covered cooperation in multilateral fora and institutional dialogue mechanisms, the statement highlighted.\nAlso Read | US: Indian Ambassador Vinay Kwatra Meets Republican Senator Mike Rounds To Discuss Cooperation in Technology and Innovation (See Pic).\nIndia and Belgium also exchanged perspectives on regional and global issues of importance.\nIn a post on X, the Spokesperson of the Ministry of External Affairs, Randhir Jaiswal said,\" Secretary (West) @AmbSibiGeorge held the 3rd round of India-Belgium Foreign Office Consultations with Ms. Theodora Gentzis, President of the Board of Belgian MFA @BelgiumMFA. They reviewed the full spectrum of India-Belgium relations, discussed the deepening India-European EU ties and exchanged perspectives on regional and global issues of importance.\" https://x.com/MEAIndia/status/1985703303423078740\nIn its concluding remarks, the statement underlined how the Foreign Office Consultations reaffirmed both sides shared commitment to further deepen their bilateral relationship in a multidimensional manner -- political, economic, investment, technology, defence, and people-to-people spheres. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The third round of the India-Belgium Foreign Office Consultations was held on Tuesday in Brussels, and was co-chaired by Sibi George, Secretary (West), Ministry of External Affairs (MEA), and Theodora Gentzis, President of the Board, Federal Public Service Foreign Affairs of Belgium, the MEA said in an official statement.","url":"https://www.latestly.com/agency-news/world-news-third-india-belgium-foreign-office-consultations-reviews-full-spectrum-of-ties-7191825.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251104201045.jpg","video":null,"publish_date":"2025-11-05 00:18:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.294},{"id":375815504,"title":"After election night, GOP expected to center messaging on Mamdani and socialism","text":"President Donald Trump is weighing in on key races ahead of the first major election night of his second term in office, as republicans look ahead to the midterms.In New York City, Trump is endorsing former Democratic Gov. Andrew Cuomo, who’s running as an independent, and criticizing Democratic candidate Zohran Mamdani.“Whether you personally like Andrew Cuomo or not, you really have no choice. You must vote for him, and hope he does a fantastic job. He is capable of it, Mamdani is not!” Trump wrote on Truth Social.Trump added that “it is highly unlikely that I will be contributing Federal Funds, other than the very minimum as required,” should Mamdani win.The race could carry future implications for Trump and the Republican Party, according to a GOP operative.After election night, Republicans say they expect to sharpen their messaging around Mamdani.“Republicans have been missing out on a good foil to contrast with and Mamdani will provide that,” a republican operative said.Messaging will focus, in part, on socialism and Mamdani following election night and Democrats tying themselves to him, according to a republican official.“Mamdani will be the face of the Republican midterm campaign,” the operative added.In New Jersey and Virginia, Trump is pointing to policies his administration frequently touts.“Virginia and New Jersey, VOTE REPUBLICAN IF YOU WANT MASSIVE ENERGY COST AND CRIME REDUCTIONS. The Democrats will double and even triple your Energy Costs, and CRIME will be rampant. A vote for the Democrats is a DEATH WISH! VOTE REPUBLICAN!!!” He said on Truth Social.The president took part in tele-rallies in each state on election eve, but has only endorsed Republican candidate Jack Ciatterelli in New Jersey, rather than Republican candidate Winsome Earle-Sears in Virginia. Some republicans point to a belief in a “quality difference” between the candidates.The RNC, meanwhile, has made investments in personnel, digital efforts and election integrity in each state. In both Virginia and New Jersey, an official said it invested hundreds of thousands of dollars in election integrity and provided a “first of its kind” get-out-the-vote platform called \"VotePro\" to create websites available to Earle-Sears and utilized by Ciattarelli. Virginia saw seven full-time staffers and nearly 20,000 volunteers, while New Jersey saw five full-time staffers and more than 15,000 volunteer leads, according to the official.“In terms of the machine and operation that we're building, we feel like we're in a good groove heading into next year. We have a lot of staff on the ground. Our election integrity efforts are ramping up, and so we feel like we have built a good base heading into the midterms,” a Republican official said.Republicans are not putting weight in what the outcome means for the midterms, though, according to a source familiar with Republican efforts.“We’ll pull back the full layers of the onion and look at what the congressional races in these states look like. But we're also taking it all with a grain of salt,” an official said.While some strategists expect Democrats to win in New Jersey and Virginia, some Republican operatives see the competition itself as a positive.“The fact that it's as competitive as it is, we take that as a win like this is a state where Dems should be blowing it out of the water,” said the Republican official.They believe that having conversations about off-cycle elections in deep blue states is a testament to Trump’s influence and change in the political landscape, according to the source familiar with republican efforts.\"Only 3 off-off year elections since the 1960s saw one party take both Virginia and New Jersey, then go on to sweep the following midterms —1993, 2005, & 2009. Since 1976, the party that loses the White House has won the Virginia governor's race every time but once. No grand conclusions to draw,” said Doug Heye, a longtime GOP strategist.However, Trump is tying the midterms to his call for Republicans to abolish the filibuster as the government shutdown reaches record lengths.“The Democrats are far more likely to win the Midterms, and the next Presidential Election, if we don’t do the Termination of the Filibuster (The Nuclear Option!), because it will be impossible for Republicans to get Common Sense Policies done with these Crazed Democrat Lunatics being able to block everything by withholding their votes.,” he wrote on Truth Social.The White House has invited Republican senators to meet with Trump over breakfast on Wednesday, where he intends to discuss ending the filibuster, a White House official confirms.","summary":"President Donald Trump is weighing in on key races ahead of the first major election night of his second term in office, as republicans look ahead to the midterms.","url":"https://www.scrippsnews.com/politics/after-election-night-gop-expected-to-center-messaging-on-mamdani-and-socialism","image":"https://ewscripps.brightspotcdn.com/dims4/default/fe65b94/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F6c%2Fdf%2Fbbe0e5cd487cbc206c34ffa38f7c%2Fap25302033662643.jpg","video":null,"publish_date":"2025-11-05 00:15:42","author":"Haley Bull","authors":["Haley Bull"],"language":"en","source_country":"us","sentiment":-0.034},{"id":375811708,"title":"DONALD TRUMP: WHAT TINUBU SHOULD DO","text":"President Asiwaju Bola Ahmed Tinubu should immediately send a high-powered delegation composed of respected Nigerian statesmen, business leaders, and senior government officials to engage with U.S. authorities.\n\nThe team should include former President Olusegun Obasanjo, former Head of State General Abdulsalami Abubakar, business mogul Aliko Dangote, Bishop Hassan Matthew Kukah, and the President of the Christian Association of Nigeria (CAN), Most Rev. Dr. Daniel Okoh, His Eminence Sultan of Sokoto, representatives of religious groups, NGO, etc.\n\nFrom the government side, the delegation should include the Minister of State for Foreign Affairs, the Secretary to the Government of the Federation, and the Governors of Benue, Plateau, Niger, Katsina, Kaduna, Zamfara, Borno, Yobe and Adamawa States, given the security relevance of their regions.\n\nTwo, re-engage the U.S. Mission in Nigeria:\n\nThe Presidency should task the Ministry of Foreign Affairs and other well-placed Nigerians with deepening communication with the U.S. Mission in Abuja and the Consulate in Lagos to strengthen diplomatic rapport, address misperceptions, and align mutual strategic interests.\n\nThree, reach out to U.S. allies and partners: Nigeria should actively engage with other influential U.S. allies across Europe, the Middle East, and Asia to rally broader international support for Nigeria’s security and development agenda.\n\nFour, seek U.S. assistance in defense cooperation: President Tinubu should formally request more support from the Donald J. Trump administration in providing modern weapons, intelligence-sharing technology, and counter-insurgency training to bolster Nigeria’s fight against terrorism and violent extremism.\n\nFour, immediate appointment of ambassadors:\n\nNigeria’s diplomatic missions have remained without substantive ambassadors for too long. Swift appointments of competent, credible, and globally respected diplomats will help restore Nigeria’s voice and visibility on the international stage.\n\nFive, the Minister Yusuf Tuggar should be reassigned to another portfolio, and a new Minister of foreign affairs, preferably one with strong international connections and more diplomatic weight, should be appointed. This will send a clear signal that Nigeria is repositioning its foreign policy and engagement strategy.\n\nSix, launch a global public relations drive: Nigeria must embark on a robust, well-coordinated international PR campaign to reshape global perception. This should highlight the Tinubu administration’s economic reforms, anti-corruption measures, and counter-terrorism efforts, while showcasing Nigeria as a stable, investment-friendly democracy that protects all faiths and ethnicities\n\nSeven, The office of the National Security Adviser and the high military command are doing good, thus to further boost the effort, they should further re-align the war against insurgency and banditry: The war against bandits, terrorists, and other insurgent groups must be comprehensively restructured. This includes a better coordination among the armed forces, improved intelligence gathering, community-based security initiatives, and enhanced welfare for troops on the frontline. A unified national security strategy will yield faster and more sustainable results.\n\nIn addition, Nigeria’s efforts in the fight against terror are often underreported or misrepresented internationally. There should be massive, transparent media coverage, both traditional and digital, to showcase the government’s ongoing efforts, victories, and human stories of resilience. This will help counter misinformation, boost public morale, and attract global understanding and support.\n\nZayyad I. Muhammad, Abuja","summary":"&#160;President Asiwaju Bola Ahmed Tinubu should immediately send a high-powered delegation composed of respected Nigerian statesmen, business leaders, and senior government officials to engage with U.S. authorities. The team should","url":"https://www.thisdaylive.com/2025/11/05/donald-trump-what-tinubu-should-do/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Donald-Trump.avif","video":null,"publish_date":"2025-11-05 00:10:32","author":"Adeyinka Salami","authors":["Adeyinka Salami"],"language":"en","category":"politics","source_country":"ng","sentiment":0.164},{"id":375811318,"title":"World News | Jaishankar Meets Sri Lankan Opposition Leader Sajith Premadasa, Discusses Ties and Regional Cooperation","text":"New Delhi [India], November 5 (ANI): External Affairs Minister S. Jaishankar on Tuesday met Sri Lankan Opposition Leader Sajith Premadasa in New Delhi and reaffirmed India's commitment to supporting Sri Lanka's progress and development under its \"Neighbourhood First\" policy.\n\"Pleased to meet Leader of Opposition @sajithpremadasa of Sri Lanka. Discussed India-Sri Lanka relations and our Neighbourhood First policy. India will always be supportive of progress and development in Sri Lanka,\" Jaishankar said in a post on X after the meeting.\nAlso Read | US Government Shutdown: Donald Trump To Partially Finance SNAP Benefits After Court Orders GOP Administration To Pay for Food Aid.\nhttps://x.com/DrSJaishankar/status/1985697414544863489\nEarlier in the day, Premadasa attended a talk at Sapru House, organised by the Indian Council of World Affairs (ICWA), where he addressed key aspects of India-Sri Lanka bilateral relations, including the long-standing fishermen issue.\nAlso Read | US: Indian Ambassador Vinay Kwatra Meets Republican Senator Mike Rounds To Discuss Cooperation in Technology and Innovation (See Pic).\nCalling the fishermen issue between India and Sri Lanka a \"very important\" and long-standing one, Sri Lankan Opposition Leader Sajith Premadasa has said that both countries must cooperate to establish a proper, workable framework guided by international law to address the matter.\n\"The fishing issue is very important. The two countries must cooperate and establish a proper, workable framework -- one that is based on fact and substance,\" Premadasa said in a reply to a question by ANI at an event titled 'India-Sri Lanka Bilateral Relations' here.\n\"There are international laws and regulations under the UN Convention on the Law of the Sea (UNCLOS) concerning the continental shelf and high seas, which must be respected. It is important to ensure that illegal, unregulated, and unreported fishing is addressed in line with these legal prescriptions,\" he added.\nAcknowledging the livelihood concerns of fishermen, Premadasa said both governments must ensure that income-generation activities withstand the test of law.\n\"We understand that this involves the livelihood of households, but it is equally important to ensure that all such income-generation methods are lawful. Rather than operating without a clear and permanent framework, both sides should work together toward a lasting solution,\" he said.\nHis remarks come amid continued tensions between the two nations over fishermen from Tamil Nadu entering Sri Lankan waters near Katchatheevu, often resulting in arrests and maritime boundary disputes.\nEarlier, Sri Lankan Prime Minister Harini Amarasuriya, after meeting with Prime Minister Narendra Modi last month, described the issue as a \"sensitive one\" and said both countries would continue discussions to find a practical solution.\n\"We need to protect the livelihoods of our fishermen as well, but we understand that it's a sensitive issue, and we will continue to talk about it,\" Amarasuriya said.\nThe fishermen issue remains one of the most contentious aspects of India-Sri Lanka relations, with Sri Lankan Navy personnel in the past accused of firing at Indian fishermen and seizing their boats over alleged illegal entry into the island nation's territorial waters.\nThe Palk Strait, a narrow strip of water separating Tamil Nadu from Sri Lanka, is a rich fishing ground for fishermen from both countries. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  External Affairs Minister S. Jaishankar on Tuesday met Sri Lankan Opposition Leader Sajith Premadasa in New Delhi and reaffirmed India's commitment to supporting Sri Lanka's progress and development under its &quot;Neighbourhood First&quot; policy.","url":"https://www.latestly.com/agency-news/world-news-jaishankar-meets-sri-lankan-opposition-leader-sajith-premadasa-discusses-ties-and-regional-cooperation-7191818.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251104193748.jpg","video":null,"publish_date":"2025-11-05 00:10:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.01},{"id":375814704,"title":"Karoline Leavitt Blasts ‘Completely Irresponsible’ Mamdani","text":"Karoline Leavitt, White House press secretary, made headlines on Tuesday when she insisted that New York remains President Donald Trump’s “home”, despite the president having changed his primary residence to Florida in 2019. Per The Independent, he has even voted there several times.\n\nHer insistence that New York is Trump’s home is telling. It isn’t just geography. The city is a part of Trump’s political legacy, branding, and authority. It helped to shape the president’s national image. By staking out this territory, Leavitt is making it clear that the Trump administration will protect its narrative as fiercely as its voter base.\n\nAccording to The Independent, Leavitt told reporters, “He’s made his thoughts on this election very clear.” Of course the New York elections matter to Trump because has a stake in the outcome, and he will fight to get a mayor in the city that he approves of.\n\nNew York mayoral candidate Zohran candidate blasted Trump for threatening to cut federal funding to New York if Zohran wins. Y Net Global notes Trump also called Mamdani a “communist with no experience and a record of complete and total failure.”\n\nIn response, Mamdani stated, “Too often, we treat everything that comes out of Donald Trump’s mouth as if it is already legal, just by virtue of who is saying it.” He continued, “I will not be intimidated by this president. I will not be intimidated by anyone, because my job here is to serve the people of the city.”\n\nOn Tuesday morning, Leavitt called out Mamdani about his comments. According to WJBC, She felt his remarks on voter intimidation was “completely irresponsible” and “based on zero evidence.” She denied Mamdani’s claims that the Trump’s administration had created an atmosphere of intimidation at polling sites. \n\n🚨🇺🇸 BREAKING — Exit Polls Project Zohran Mamdani as Winner of NYC Mayoral Race. pic.twitter.com/PxmJJUwkR9\n— Pamphlets (@PamphletsY) November 4, 2025\n\nInstead of directly addressing Mamdani’s claims, she counterattacked. Leavitt stated that it was “another example of how the Democrat Party unfortunately stands for nothing.” She downplayed the exchange and blanketed Mamdani’s assertions as a bias.\n\nLeavitt blindly defended the president. She said, “I think it’s quite sad to see that we have someone at the top of the ticket on an election day today saying such things about the president, when he obviously had absolutely nothing to do with those threats.” \n\nMamdani previously argued that threats and chaos at polling stations, particularly in New Jersey, were “part of the general approach the Trump administration has taken to intimidate voters … as a means of trying to repress the voice of Americans across this country.” \n\nBy dismissing Mamdani’s warnings about Trump allegedly intimidating voters, he is now seen as directly challenging authority at all costs. \n\n Why is Leavitt protecting Trump’s symbolic grip on New York? Will Mamdani’s claims of intimidation force the electorate to engage and investigate for the sake of electoral fairness? Speculation is rife as voters try to make sense of the power struggle.\n\nThe exchange leaves one question lingering: is New York’s political identity still tied to Trump? Or is it time for a new story, told by voices bold enough to challenge decades of entrenched power? Only the election results will tell.","summary":"Karoline Leavitt says that Zohran Mamdani has \"zero evidence\" about claims of Trump voter intimidation.","url":"https://www.inquisitr.com/karoline-leavitt-blast-completely-irresponsible-mamdani","image":"https://www.inquisitr.com/wp-content/uploads/2025/10/karoline-leavitt.jpg","video":null,"publish_date":"2025-11-05 00:08:46","author":"Tracey Ashlee","authors":["Tracey Ashlee"],"language":"en","source_country":"us","sentiment":-0.162},{"id":375814154,"title":"Trump once again nominates tech space traveler Jared Isaacman to serve as NASA administrator","text":"President Donald Trump announced Tuesday he has decided to nominate Jared Isaacman to serve as his NASA administrator, months after withdrawing the tech billionaire's nomination because of concerns about his political leanings.\n\nTrump announced in late May he had decided to withdraw Isaacman after a “thorough review” of his “prior associations.” Weeks after the withdrawal, Trump went further in expressing his concerns about Isaacman's Republican credentials. \n\nAt the time, Trump acknowledged that he thought Isaacman “was very good,” but had become “surprised to learn\" that Isaacman was a \" blue-blooded Democrat, who had never contributed to a Republican before.” \n\nIsaacman had the endorsement of Trump's former DOGE adviser and tech entrepreneur Elon Musk. The president and Musk had a very public falling out earlier this year but are now on better terms.\n\nLast week, Trump told reporters he and Musk have spoken “on and off” since sitting together at conservative activist Charlie Kirk’s funeral last month in Arizona and that their relationship is “good.”\n\nTrump made no mention of his previous decision to nominate and then withdraw Isaacman in his Tuesday evening announcement of the re-nomination on his Truth Social platform. And the White House did not immediately respond to a request for comment on Trump's decision to reverse course.\n\n“This evening, I am pleased to nominate Jared Isaacman, an accomplished business leader, philanthropist, pilot, and astronaut, as Administrator of NASA,” Trump posted. “Jared’s passion for Space, astronaut experience, and dedication to pushing the boundaries of exploration, unlocking the mysteries of the universe, and advancing the new Space economy, make him ideally suited to lead NASA into a bold new Era.”\n\nTransportation Secretary Sean Duffy has also been serving as interim NASA administrator. The president on Tuesday praised Duffy for doing an “incredible job.\"\n\nIsaacman, CEO and founder of credit card-processing company Shift4, has been a close collaborator with Musk ever since buying his first chartered flight with SpaceX. \n\nHe also bought a series of spaceflights from SpaceX and conducted the first private spacewalk. SpaceX has extensive contracts with NASA.\n\nThe Senate Commerce, Science and Transportation Committee approved Isaacman’s nomination in late April and a vote by the full Senate had been expected when Trump announced he was yanking the nomination.","summary":"President Donald Trump is nominating Jared Isaacman to serve as his NASA administrator after all","url":"https://www.independent.co.uk/news/world/americas/donald-trump-jared-isaacman-nasa-washington-charlie-kirk-b2858750.html","image":"https://static.independent.co.uk/2025/11/05/00/Trump_07946.jpg?width=1200","video":null,"publish_date":"2025-11-05 00:08:12","author":"Aamer Madhani","authors":["Aamer Madhani"],"language":"en","category":"politics","source_country":"gb","sentiment":0.024},{"id":375809922,"title":"Rachel Maddow Says Trump’s Cratering Approval Rating Is Worse Than the ‘Immediate Aftermath of Jan. 6’ | Video","text":"Rachel Maddow detailed Monday night how new polls show that President Donald Trump “has never been more unpopular than he is right now.”\n\nThe MSNBC host began Monday by pointing to a new CNN poll, which revealed that Trump’s current disapproval rating among the American public is higher than it was in the “immediate aftermath of Jan. 6” back in 2021. \n\n“After Jan. 6, a whopping 62% of Americans said they disapproved of Trump,” Maddow explained. “Today, the number of Americans who say they disapprove of Donald Trump is not 62%. It is 63%!”\n\n“Only 37% approve of Trump. That means right now he is 26 points underwater in terms of his approval rating with the American people,” Maddow continued. “That’s astonishing.” The “Rachel Maddow Show” host then cited a number of recent statistics included in ABC News and The Washington Post’s new Ipsos poll, noting that “Americans disapprove of [Trump] on everything.” \n\n“Do you approve of Trump’s handling of immigration? No, -13. Do you approve of Trump’s management of our relationship with other countries? No, -19,” Maddow cited. “Do you approve of Trump’s handling of the Russia-Ukraine war? No, -21. Do you approve of Trump’s handling of the economy? No, -25.”\n\n“Since Trump has been back in office, has he made the United States weaker or stronger? Americans say Trump has made the United States weaker,” the MSNBC host concluded. “They say so by a 15-point margin.” \n\nYou can watch the full “Rachel Maddow Show” segment yourself in the video below:\n\nMaddow used Trump’s latest batch of negative approval ratings to make a point to some of America’s most powerful corporations. “If you’re a business leader watching this right now, thinking about, ‘I wonder if we should continue to do things to really kowtow to Trump,’ … take a little temperature of the public here, guys,” Maddow instructed. “You’re aligning yourself with something pretty radically and deeply unpopular.”\n\nIn the segment’s closing minutes, the “Rachel Maddow Show” host then turned her attention to the president himself. “What is Trump himself doing to make himself more palatable to the American people?” she rhetorically asked. “Literally, at the same time he is cutting off food aid to 40+ million Americans, Trump was bragging online about the new marble-and-gold-toned bathroom he just built himself at the White House, at your expense.” \n\n“He held a party at his mansion at Mar-a-Lago, which had a roaring ’20s ‘Great Gatsby’ theme, because, yeah, remind me again what happened right at the end of the roaring ’20s?” Maddow added. “Google ‘1929.’ Just see what comes up.”","summary":"The president \"has never been more unpopular than he is right now,\" the MSNBC anchor says\n\n\nThe post Rachel Maddow Says Trump&#8217;s Cratering Approval Rating Is Worse Than the &#8216;Immediate Aftermath of Jan. 6&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/rachel-maddow-trump-approval-rating-jan-6-msnbc/","image":"https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/11/Rachel-Maddow-Show-11-3-25.jpg?fit=1200%2C675&quality=89&ssl=1","video":null,"publish_date":"2025-11-05 00:07:51","author":"Alex Welch","authors":["Alex Welch"],"language":"en","category":"politics","source_country":"US","sentiment":0.052},{"id":375816266,"title":"Trump could declare Maduro a cartel boss to overthrow government","text":"Donald Trump could declare Nicolas Maduro a cartel boss as a pretence to overthrow his government and force regime change.\n\nLinking the Venezuelan president and his top officials to the Cartel de los Soles, which has been designated a narcoterrorist group by the US, may provide a legal basis for military action beyond the current campaign of bombing boats.\n\nMr Trump’s aides have sought guidance from the Department of Justice on designating Mr Maduro as a legitimate target, despite US laws prohibiting the assassination of world leaders, according to the New York Times.\n\nAdministration officials told the paper they expect guidance to focus on linking the Venezuelan leader to the Cartel de los Soles, a criminal organisation involved in international drug trafficking which is allegedly headed by high-ranking members of the country’s armed forces.\n\nIt would also negate the need for congressional approval for military intervention or a declaration of war.\n\nOn Sunday, Mr Trump was asked in an interview with CBS’s 60 Minutes if Mr Maduro’s days as president “are numbered”.\n\n“I think so, yeah,” the US president responded.\n\nCredit: @realDonaldTrump/Truth Social\n\nThe move is said to be one of several ideas being drawn up by the administration to justify ousting Mr Maduro, who is accused of facilitating the flow of illegal narcotics into the United States.\n\nMr Trump is yet to decide on the plans, which also reportedly include direct attacks on military units and seizing control of the country’s oil fields, sources told the New York Times.\n\nAt least 65 people have been killed in strikes on small vessels in the Caribbean Sea since Mr Trump announced a renewed war on drugs in September. The attacks remain controversial among critics and some Congress members who have questioned the legality and rationale given to justify the attacks, which the Trump administration claims have all taken place in international waters.\n\nIt is a tactic not without precedent. In 1989, the United States declared de facto Panama ruler General Manuel Noriega wanted for racketeering and drug trafficking. After tensions escalated, the US launched Operation Just Cause and invaded Panama, removed Noriega and brought him to America for trial.\n\nAt the time, the attack was the largest military action by the US since the Vietnam War and included more than 27,000 soldiers and 300 aircraft.\n\nToday, Mr Trump has dispatched eight warships, including the world’s largest, the USS Gerald Ford, as well as thousands of troops to the Caribbean.\n\nMr Trump has repeatedly expressed reservations about operations that may place American troops at risk or could turn into an embarrassing failure, according to the New York Times.\n\n“President Trump has been clear in his message to Maduro: Stop sending drugs and criminals to our country,” Anna Kelly, a White House spokeswoman, told the newspaper.\n\n“The president has made clear that he will continue to strike narcoterrorists trafficking illicit narcotics – anything else is speculation and should be treated as such.”\n\nMr Maduro was indicted in 2020 on federal charges of narcoterrorism and conspiracy to import cocaine.\n\nSince then, the Trump administration has doubled the reward for his arrest to $50m (£38m). Mr Maduro has denied the charges and said they are politically motivated.\n\nThe Trump administration has not given any evidence to support its claims about the boats and their connection to drug cartels, or the identity of those killed.\n\nIn a strike earlier this month with two survivors, the US military rescued the pair and repatriated them to Colombia and Ecuador.\n\nAuthorities released the Ecuadorian man after prosecutors said they had no evidence he had committed a crime in Ecuador.\n\nMr Trump has justified the strikes by asserting that the US is engaged in an “armed conflict” with drug cartels and proclaiming the criminal organisations to be unlawful combatants, relying on the same legal authority used by George W Bush’s administration during the war on terrorism.","url":"https://uk.news.yahoo.com/trump-could-declare-maduro-cartel-000552018.html","image":"https://s.yimg.com/ny/api/res/1.2/rcZVdSwyazb6E19NkOD6Og--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNTA0O2NmPXdlYnA-/https://media.zenfs.com/en/the_telegraph_818/866225e2eb19a85c675e9208e3e72318","video":null,"publish_date":"2025-11-05 00:05:52","author":"Connor Stringer","authors":["Connor Stringer"],"language":"en","category":"politics","source_country":"gb","sentiment":0.124},{"id":375812712,"title":"Economy top of mind for voters across races, preliminary ABC News exit polls show","text":"How are voters in Virginia, New Jersey and New York City feeling about the country, the economy and other issues? Here's what we learned from the ABC News exit polls, conducted by SSRS. \n\n This story will be updated throughout the evening as polling numbers come in.\n\nThe economy is the biggest issue for Virginia voters, by far:\n\nAbout half of Virginia voters said that the economy was the most important issue facing the Commonwealth, while about 2 in 10 said health care was. Fewer -- about 1 in 10 -- said immigration and education were the most important issues, while even fewer said crime.\n\nMore on how Virginian voters are viewing the economy:\n\nMost Virginia voters said federal government cuts are affecting their finances. About 6 in 10 Virginia voters said that the federal government cuts this year affected their family’s finances, including about 2 in 10 who said the cuts affected their finances \"a lot.\"\n\nMost Virginia voters said Virginia’s economy is doing well, but few said their personal finances are improving. Nearly 6 in 10 Virginia voters said that the state of the Commonwealth's economy is \"excellent\" or \"good,\" while about 4 in 10 said the economy is \"not so good\" or \"poor.\"\n\nBut few Virginia voters said their families are \"getting ahead\" financially. Just over 1 in 10 said they were getting ahead, while about 6 in 10 said they were \"holding steady\" and about a quarter said they were \"falling behind.\"\n\nMany voters in Virginia are employed or were previously employed by the federal government or as a federal contractor -- many of whom are currently furloughed.\n\nElection Day marks the 35th day of the government shutdown. Many federal employees have been furloughed; others have lost their jobs due to President Donald Trump's steep cuts to the federal government. About 1 in 5 Virginia voters said they either currently or were previously employed by the federal government or as a federal contractor.\n\nOther issues:\n\nJust over half of Virginia voters said that the Trump administration’s actions on immigration enforcement have \"gone too far.\"About 6 in 10 Virginia voters said that abortion should be legal in all or most cases.A slim majority of Virginia voters said that support for transgender rights in society have gone too far.\n\nWhat Virginia voters were looking for in a gubernatorial candidate:\n\nAbout a third of Virginia voters said that a candidate who shares their values was the quality that mattered the most in deciding how they voted for governor, followed by about 2 in 10 who said that the candidate was honest and trustworthy and another roughly 2 in 10 who said the candidate would work for people like them. About the same share said they were looking for a candidate who would bring needed change while fewer said a candidate who had the right experience mattered the most.\n\nVirginia voters are mostly negative about the state of the country:\n\nAbout 6 in 10 said they are either dissatisfied or angry about the way things are going in the country today -- including almost 4 in 10 who said they are angry. Just about a third said they are enthusiastic or satisfied. \n\nTaxes and the economy are the most important issues for New Jersey voters:\n\nAbout 4 in 10 New Jersey voters said taxes were the most important issue facing New Jersey today, while another roughly third of voters said the economy was. Fewer named health care, immigration or crime.\n\nMore on how New Jersey voters are viewing the economy:\n\nAbout 6 in 10 New Jersey voters said that the economy in the state was doing \"not so good\" or \"poor,\" while about 4 in 10 said it was \"excellent\" or \"good.\"\n\nAbout 6 in 10 New Jersey voters said their family’s financial situation was \"holding steady,\" while just about 1 in 10 said they were \"getting ahead\" and about a quarter were falling behind.\n\nNew Jersey voters are largely negative on property taxes, with roughly 7 in 10 saying they were \"a major problem\" where they live.\n\nAdditionally, about 6 in 10 New Jersey voters said electricity costs where they live were \"a major problem.\"\n\nOther issues:\n\nJust over half of New Jersey voters said that the Trump administration’s actions on immigration enforcement have \"gone too far,\" while half said that the next governor should cooperate with the Trump administration on immigration enforcement.Over 4 in 10 of New Jersey voters said that support for transgender rights in society have \"gone too far,\" according to preliminary exit polling. Roughly another quarter said they have not gone far enough and around a quarter said support for trans rights has been about right.\n\nWhat New Jersey voters were looking for in a gubernatorial candidate:\n\nAbout 3 in 10 voters in New Jersey said they were looking for a candidate for governor who would bring needed change, while roughly a quarter said they wanted a candidate who shared their values and about 2 in 10 said they wanted someone who would work for people like them. Slightly fewer said they wanted a candidate who was honest and trustworthy, while under 1 in 10 said they sought a governor who was a strong leader.\n\nMost New Jersey voters are negative about the state of the country:\n\nAbout two-thirds of New Jersey voters said they were \"dissatisfied\" or \"angry\" about the way things are going in the country today -- including about 4 in 10 who said they were angry. Just about a third said they were \"enthusiastic\" or \"satisfied.\"\n\nMost New Jersey voters feel political corruption is a big issue in the state:\n\nAround 9 in 10 New Jersey voters said they think political corruption is a problem in New Jersey, including over half who feel it’s a \"major problem.\"\n\nNew York City\n\nCost of living is the most important issue to New York City voters:\n\nMore than half of voters in New York City said the cost of living was the most important issue facing the city, dwarfing the other issues measured in preliminary ABC News exit polling. Under a quarter said crime was the most important issue, followed by about 1 in 10 who said immigration. Single-digit percentages said health care or transportation were most important.\n\nNew York City voters on cost of living and the economy:\n\nAlmost three-quarters of voters in New York City said that the cost of housing where they live is \"a major problem.\"About two-thirds of New York City voters said that the city’s economy was \"not so good\" or \"poor,\" while just about a third said it was \"excellent\" or \"good.\"About 6 in 10 New York City voters said their families were \"holding steady\" financially, while about a quarter said they were falling behind and roughly one in six were getting ahead.About 6 in 10 New York City voters think raising city taxes would do more to hurt the city's economy. Roughly a third said raising city taxes would improve the economy.\n\nWhat New York City voters were looking for in a mayoral candidate:\n\nNew York City voters are fairly divided in what candidate qualities mattered most to them. About a quarter said they most wanted a mayor who would bring needed change, while about 2 in 10 said they most sought someone with the right experience or someone who would work for people like them. Fewer said they most valued a mayor who was honest and trustworthy or who was a strong leader.\n\nMethodology","summary":"Results from Virginia, New Jersey, and New York City.","url":"https://abcnews.go.com/Politics/economy-top-mind-voters-races-preliminary-abc-news/story?id=127141841","image":"https://i.abcnewsfe.com/a/8cdf0b4a-a78c-448d-9f88-4d8fda9aa4cf/election-8-gty-gmh-251104_1762276767417_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-11-05 00:03:56","author":"Emily Guskin,Oren Oppenheim","authors":["Emily Guskin","Oren Oppenheim"],"language":"en","source_country":"us","sentiment":-0.193},{"id":375811302,"title":"World News | India's Cultural Spirit Shines in Riyadh as Embassy Hosts 'Gita Mahotsav - A Musical'","text":"Riyadh [Saudi Arabia], November 5 (ANI): The Embassy of India in Riyadh hosted 'Gita Mahotsav - A Musical' on Monday, celebrating the timeless teachings of the Bhagavad Gita and India's rich cultural heritage. The event marked the grand finale of the Pravasi Parichay Cultural Week 2025.\nThe musical opened with a congratulatory video message from Minister of State for External Affairs Kirti Vardhan Singh, who lauded the Indian community in Saudi Arabia for preserving and promoting India's cultural spirit abroad.\nAlso Read | US Government Shutdown: Donald Trump To Partially Finance SNAP Benefits After Court Orders GOP Administration To Pay for Food Aid.\nIn a post on X, the Embassy said, \"The grand finale of Pravasi Parichay Cultural Week concluded with a magnificent Gita Mahotsav, celebrating the eternal wisdom of the Bhagavad Gita and India's rich cultural heritage. The event featured soulful performances, spiritual reflections, and a spirit of unity.\"\nhttps://x.com/IndianEmbRiyadh/status/1985464464167338270\nAlso Read | US: Indian Ambassador Vinay Kwatra Meets Republican Senator Mike Rounds To Discuss Cooperation in Technology and Innovation (See Pic).\nThe post added that Minister Kirti Vardhan Singh shared an inspiring message for the Indian community, while the event was graced by Padma Shri and Sangeet Natak Akademi Awardee Pratibha Prahlad, a renowned Bharatanatyam dancer.\nA highlight of the evening was a special dance and musical performance by the female students of Vaidehi Nritha Vidyalayam, Riyadh, who brought to life the message of the Bhagavad Gita through expressive art and movement.\nIndia's Ambassador to Saudi Arabia, Suhel Ajaz Khan, said the Gita Mahotsav aimed to highlight the deep cultural and spiritual ties that connect the Indian diaspora with India's civilizational heritage. He added that the festival embodies the universal values of harmony, duty, and selfless action, which are the core teachings of the Gita.\nKhan also noted that the Riyadh celebration resonates with the spirit of the International Gita Mahotsav, which will be held later this month in Kurukshetra, Haryana.\nThe Pravasi Parichay series, launched by the Indian Embassy in 2023, showcases India's vibrant cultural traditions through the active participation of the Indian community in Saudi Arabia.\nIn his closing remarks, Ambassador Khan felicitated all sponsors and organisers for their contributions in making the Pravasi Parichay Cultural Week a grand success. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   The Embassy of India in Riyadh hosted 'Gita Mahotsav - A Musical' on Monday, celebrating the timeless teachings of the Bhagavad Gita and India's rich cultural heritage. The event marked the grand finale of the Pravasi Parichay Cultural Week 2025.","url":"https://www.latestly.com/agency-news/world-news-indias-cultural-spirit-shines-in-riyadh-as-embassy-hosts-gita-mahotsav-a-musical-7191811.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251104183649.jpg","video":null,"publish_date":"2025-11-05 00:02:21","author":null,"language":"en","source_country":"in","sentiment":0.408},{"id":375813616,"title":"Soccer legend Cristiano Ronaldo says Trump 'can change the world'","text":"European soccer superstar Cristiano Ronaldo opened up about his thoughts on President Donald Trump in an upcoming part of an interview with Piers Morgan, which was teased with a clip released on Tuesday. Morgan asked Ronaldo about a signed jersey the player gave to Trump in June, with a message that said \"playing for peace.\" \"He’s one of the guys that can help to change the world,\" Ronaldo told Morgan of the message to the president. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Ronaldo signed the most lucrative contract extension in sporting history with Saudi Pro League outfit Al-Nassr in June, becoming the first billionaire soccer player. \"It was my goal to reach that number,\" Ronaldo told Morgan of reaching the financial feat in the part of the interview that has been released. \"I’m not obsessed for the money, but when you reach some level, money doesn’t matter anymore. But it’s always good to have more.\" CRISTIANO RONALDO'S LONGTIME GIRLFRIEND GEORGINA RODRIGUES ANNNOUNCES ENGAGEMENT WITH MASSIVE RING The soccer star also addressed his potential future retirement plans, claiming he wants to invest more time in family and that he'll make his retirement decision \"soon.\" \"I will be prepared. It’ll be tough and difficult, of course. Probably I will cry, yes. It will be very difficult, but Piers, I have prepared for my future since 25 or 26 years old. Nothing will compare to the adrenaline we have to score a goal. But everything has a beginning and an end, so I’ll be prepared,\" he said. CLICK HERE TO GET THE FOX NEWS APP \"I’ll have more time for me, my family, to raise my kids. I want to follow [son] Cristiano Junior because he’s in the age where you do stupid things, normal, I did the same. \"I want to be more (of a) family person, more present.\" Ronaldo, 40, and Georgina Rodríguez, his girlfriend since 2017, announced their engagement in August. In an Instagram post, Rodriguez showed off her new, massive, oval-shaped engagement ring with a heartwarming caption in Spanish. The soccer star praised his fiancée in his interview with Morgan. \"Gio is unique. She takes care of me, which is very important. She takes care of the family, of the house, which takes a lot of work. If you want to be the opposite, I will not deal with that; men cannot deal with that, honest,\" he said. \"She’s the person who understands me and takes care of me and my family. This is what I’m looking for.\" Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Cristiano Ronaldo said President Donald Trump is &quot;someone who can help change the world&quot; in a forthcoming interview with commentator Piers Morgan.","url":"https://www.foxnews.com/sports/soccer-legend-cristiano-ronaldo-says-trump-can-change-world","image":"https://static.foxnews.com/foxnews.com/content/uploads/2023/07/ronaldo-2.jpg","video":null,"publish_date":"2025-11-05 00:01:56","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","category":"sports","source_country":"us","sentiment":0.138},{"id":375813618,"title":"Trump warns Supreme Court tariff showdown is 'life or death' for America","text":"President Donald Trump warned that the fate of the United States hangs in the balance ahead of Wednesday's hearing in front of the U.S. Supreme Court on his use of tariffs in a test of his presidential powers. In a post on Truth Social, Trump said the upcoming case is \"literally, LIFE OF DEATH for our country.\" The high court will consider whether Trump has the authority to impose tariffs on America’s trading partners. The Trump administration argues in legal briefs that the justices should back the president’s tariffs and overturn rulings by two lower courts that struck them down. TRUMP'S TARIFF POWER GRAB BARRELS TOWARD SUPREME COURT The court must decide whether a tariff is essentially a tax on imported goods. Trump has defended his use of tariffs as critical to national security. \"With a Victory, we have tremendous, but fair, Financial and National Security,\" Trump wrote. \"Without it, we are virtually defenseless against other Countries who have, for years, taken advantage of us.\" TRUMP ASKS SUPREME COURT FOR URGENT RULING ON TARIFF POWERS AS 'STAKES COULD NOT BE HIGHER' \"Our Stock Market is consistently hitting Record Highs, and our Country has never been more respected than it is right now,\" he added. \"A big part of this is the Economic Security created by Tariffs, and the Deals that we have negotiated because of them.\" Trump has argued that the outcome will determine whether presidents can use tariffs freely as a tool for both economic leverage and national security. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"Other countries use tariffs against us, and we weren't able to openly and freely use tariffs against them,\" Trump said. \"I'll give you an example – China. That was going to be a disaster for the world, and I was able to settle it very quickly, very easily because I was able to use tariffs. It's total national security, and economic health is also part of national security, by the way.\"","summary":"President Donald Trump said the Supreme Court’s upcoming hearing on his tariff powers is a “life or death&quot; moment for America, warning the nation’s security and economy are at stake.","url":"https://www.foxnews.com/politics/trump-warns-supreme-court-tariff-showdown-life-death-america","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/split-image-of-the-supreme-court-and-donald-trump.jpg","video":null,"publish_date":"2025-11-05 00:01:43","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","category":"politics","source_country":"us","sentiment":0.199},{"id":375814142,"title":"Rape survivors blocked from treatment as aid cuts make Africa’s unsafe abortion crisis worse, researchers warn","text":"A landmark study has found survivors of rape and incest in five African countries are being blocked from access to safe abortion, despite being entitled to it by law. \n\nPublished one year to the day since Donald Trump’s election, the first-of-its kind study has mapped out how unsafe abortion is risking women’s lives in the countries, as US aid cuts worsen the crisis.\n\nIn Benin, Cameroon, Togo, Burkina Faso and Cote D’Ivoire, survivors of sexual violence have the right to safe abortion in theory. But Dutch sexual health research group Rutgers and Benin-based Centre de recherche en reproduction humaine et en démographie (CERRHUD) found laws that existed on paper were not being enforced.\n\nThe researchers conducted in-depth interviews with survivors of sexual violence and their families as well as with health workers, lawyers and community groups. They also reviewed the laws and policies in each country. \n\nIn Togo, 16-year-old Laure* was raped by a neighbour and immediately told her mother. After delays including having to wait for her father to give permission, she was taken to a health centre for an examination five days later - too late to find evidence of the assault or to be given emergency contraception. When she discovered she was pregnant, the health centre started the legal proceedings needed to give her abortion care but, when nothing had progressed after two months, Laure’s mother helped her daughter to get an illicit abortion instead rather than allow the pregnancy to become any more advanced. \n\nIn Benin, when a 17-year-old girl reported an attack, the prosecutor told her rapist to, “to settle things amicably by coming to our house,” her mother told the researchers. \n\nIn Burkina Faso, a community leader told the interviewers, “when a girl is raped, it’s a shame for the whole family.\n\n“The parents prefer to settle it within the family. They go to the boy’s family, they talk. Sometimes they ask for money to make up for the offence, sometimes they force the marriage to hide the shame. But going to the police means that the whole neighbourhood will know. And then the girl will never be able to get married”.\n\nWomen and girls interviewed for the report often didn’t know they should seek medical care immediately after rape, or that they had a right to an abortion in these circumstances. Health workers were also often not aware of what they could legally provide and were scared to offer abortions without proper guidelines or training. \n\nFamilies were documented trying to stop survivors from reporting sexual violence - sometimes to protect the perpetrators who were also members of the community. The researchers found cases of relatives expelling survivors from their homes or forcing them to marry their attacker. \n\nResearcher on the report, Jonna Both, said the findings showed, “having these rights on paper is just not enough. It's really about implementation of these rights and ensuring access to…safe services for women and girls. And unfortunately, we see that that's increasingly under pressure with new funding cuts”. \n\n“Nobody should risk their lives for safe abortion care,” she said. \n\nIn West and Central Africa, 3.4 million women undergo unsafe abortions each year, among the highest rates in the world. \n\nAcross Sub-Saharan Africa, the report said, an estimated 42 per cent of pregnancies were unintended and of these 37 per cent ended in abortions - the majority of which were unsafe. This makes it a leading cause of death especially among teenage girls and young women, who are driven to drinking unsafe herbal concoctions or undergo invasive procedures that can cause infection, bleeding and death. \n\nWhen Trump took office for the second time, he scrapped all family planning funding for lower-income countries worth hundreds of millions of dollars. This has led to shortages of crucial contraceptives and risks millions more unplanned births, unsafe abortions and deaths. \n\nDr Both said access to post-rape care and safe abortion were directly affected by budget cuts.\n\n“We know that these global funding cuts are also going to impact access to post-abortion care significantly. And that's the last resort for many of these women and girls,” she added. \n\n“When they have felt forced to try something at home, that's when they can now legally access healthcare,” she said - including seeking emergency help after having an unsafe abortion. \n\nAs well as funding, the researchers found other barriers. For example, legal proceedings are often necessary in order to access an abortion on the grounds of rape. \n\nAfter experiencing sexual violence, survivors should also receive contraceptive counselling, Dr Both explained, but these contraceptives, “are no longer widely available” or come “with a higher cost for women and girls”. \n\nA US State Department spokesperson said a rule re-introduced by Trump prohibited providing assistance, “directly or indirectly to foreign nongovernmental organisations that perform or actively promote abortion as a method of family planning”. This includes centres that hand out contraceptives, the spokesperson added.\n\n*Names have been changed to protect identities\n\nThis article is part of The Independent’s Rethinking Global Aid project","summary":"Funding cuts are set to block more women and girls from getting lifesaving healthcare and post-rape support, researcher Dr Jonna Both tells The Independent","url":"https://www.independent.co.uk/news/world/africa/abortion-africa-aid-cuts-trump-b2858193.html","image":"https://static.independent.co.uk/2025/11/04/13/53/1L9A9748.jpg?crop=6648,4432,x0,y0&trim=0,0,0,0&width=1200","video":null,"publish_date":"2025-11-05 00:01:00","author":"Rachel Schraer","authors":["Rachel Schraer"],"language":"en","source_country":"gb","sentiment":-0.224},{"id":375818540,"title":"Letters: Expanded Spare the Air Alerts deserve Bay Area support","text":"Expanded Spare the Air\nAlerts deserve support\n\nRe: “Bay Area Air District responds to concerns over Spare the Air Alert increase” (Oct. 27).\n\nThe Bay Area Air District’s decision to expand Spare the Air Alerts deserves support.\n\nEach winter, fine particle pollution reaches dangerous levels, with residential wood burning responsible for up to 34% of emissions. This is a serious public health threat. Low-income families and communities of color already bear the greatest burden of polluted air, suffering higher rates of asthma and heart disease.\n\nThe need for cleaner air is urgent, and limiting wood burning is a reasonable, science-based solution. Cleaner winter air means fewer emergency room visits and lives saved. Residents have the option to certify eligible stoves as exempt or explore community energy-assistance programs designed to help reduce the financial burden of home heating during Spare the Air alerts.\n\nThe Air District and local leaders must strengthen outreach and funding for low-income heating alternatives so that equity and clean air progress together. Protecting community health requires shared responsibility.\n\nRemi Hernandez\n\nSunnyvale councilman\nshould stick to his job\n\nRe: “Campaign linked to insulting message” (Page B1, Nov. 2).\n\nAs a resident of Sunnyvale, I’d appreciate it if Richard Mehlinger would behave like the council member he is.\n\nWhy did he feel the need to reply to a generic campaign text by saying that Rishi Kumar “wasn’t fit to be a dog catcher”?\n\nLast year, Mehlinger posted a link on a public forum to his voting recommendations for the 2024 election. He accused those opposed to two local ballot measures he co-authored as being “a who’s-who of what’s left of the City’s angry conservative NIMBY faction,” and that “the opposition’s arguments are bogus and play to rank xenophobia and paranoia.”\n\nBoth measures failed, one of them 2-1.\n\nIf Mehlinger can’t respect people who disagree with him, or at least keep his mouth shut, he has no business representing the city of Sunnyvale.\n\nDoug Atkins\n\nTech titans trade souls\nfor their bottom line\n\nRe: “Building more than a ballroom” (Page A1, Nov. 2).\n\nThe need to protect the company assets is just the tech titans’ cop-out for their over-the-top support for Donald Trump.\n\nI’d like to ask: Your company’s valuation might skyrocket in the short run, but what good does it do when your family, employees, customers and shareholders all live under an authoritarian regime where corruption runs rampant, science is under attack, cruelty is celebrated and truth no longer matters?\n\nFlorence Chan\n\nStable solutions best\nchoice for S.J. homeless\n\nSan Jose is a beautiful city, and it’s devastating to witness the growing homelessness crisis on our streets. As a concerned, lifelong resident, I feel obligated to speak up. Our city’s homeless population has reached roughly 6,500, bearing over 60% of Santa Clara County’s total.\n\nThis crisis has ruinous effects on our community. Unsheltered individuals lack stability, straining vital public resources such as health care and the criminal justice system. This isn’t to say it’s their fault; it’s a call for better solutions.\n\nWe must advocate for those struggling. I urge the City Council to prioritize policies that focus on developing temporary housing, such as sheltersand to increase the supply of affordable, realistic housing. We must also expand homelessness prevention methods. By focusing on stable, effective solutions, we can help the less fortunate get back on their feet and lead San Jose toward a better future.\n\nAlberto Bautista\n\nIncrease visibility of\nhomeless resources\n\nHomelessness and drug abuse continue to be among the most visible and disheartening issues in our communities. While shelter and rehabilitation programs exist, it is highly unlikely the average person will hear about these resources. We need stronger efforts, such as advertisements, community service and expanded access to housing facilities and drug rehabilitation programs.\n\nToo often, some individuals will go through these struggles unaware of available resources and could benefit from the help of our communities to reintegrate into society and make a contribution.\n\nAs a community, we could take steps toward action, such as posting information in public areas where homeless people are known to gather, partnering with local organizationsand conversation and advocacy.\n\nInvesting in those in need will not only help our society but will also create unity. By spreading awareness and improving access, we can give more people a chance at a better life and a better path.\n\nAlexia Ramos\n\nDead man’s life was\ntestament to redemption\n\nRe: “Man who drove off Santa Cruz Wharf was registered sex offender” (Page B3, Oct. 30).\n\nA devoted son, he served as full-time caregiver for our father through his journey with dementia until his passing, and then for our 93-year-old mother. He was the “Fixit Will” who helped his neighbors. He found solace in the ocean’s beauty.\n\nFocusing on the grisly details of decades-old crimes, the article inflicted unnecessary pain and missed the crux of his story: the possibility of transformation. William, after prison, demonstrated that we are not solely defined by our worst actions but by our commitment to change. His journey of making amends truly serves the public interest — a lesson in hope and redemption.\n\nKenah Roberts","summary":"Also: Stick to job &#124; Trading their souls &#124; Stable solutions &#124; Visible resources &#124; Redemption story. Mercury News reader letters to the editor for Nov. 5, 2025.","url":"https://www.mercurynews.com/2025/11/04/letters-expanded-spare-air-alerts-deserve-support/","image":"https://www.mercurynews.com/wp-content/uploads/2016/08/20131220_013600_27_BAY_AREA_SMOG_C.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-05 00:00:33","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.165},{"id":375811872,"title":"Why revival of US-Cambodia drills is ‘good news’ for Southeast Asia","text":"The revival of US-Cambodia military exercises after an eight-year hiatus signals Washington’s renewed interest in Southeast Asia and offers Phnom Penh a chance to rebalance its strategic ties beyond Beijing, according to analysts.\nThe long-frozen Angkor Sentinel drills will resume following a meeting between US Defence Secretary Pete Hegseth and his Cambodian counterpart on the sidelines of a regional security summit in Malaysia last week.\nThe drills were suspended in 2017 after Washington raised concerns about democratic backsliding in Cambodia. That year, the Supreme Court dissolved the main opposition party, arrested its leader on treason charges and banned more than 100 senior opposition figures from politics.\nAnalysts say the resumption reflects a broader shift in American foreign policy under President Donald Trump, who has prioritised strategic engagement over democracy promotion in parts of the Indo-Pacific.\n“This is good news for Southeast Asia as it reflects Washington’s continuous interest in the region, and its willingness to engage with Cambodia,” Abdul Rahman Yaacob, a researcher at the Australian National University, told This Week in Asia.\n\nThe defence chiefs also discussed the possibility of Hegseth joining a future US naval ship visit to Cambodia’s Ream Naval Base, according to a readout.\nThe US has long expressed concerns that China will be given exclusive military access to the naval base in the Gulf of Thailand as part of a deal inked six years ago.\nDefence ties between the US and Cambodia have thawed in recent months, with the two militaries holding in July their first formal Bilateral Defence Dialogue since 2017.\nThis followed a port call by the US Navy ship USS Savannah in December 2024, the first port visit in eight years, and a visit by a US Army Pacific commander in February 2025.\nThese military developments are part of a broader warming of diplomatic ties, which also includes a new US-Cambodia trade agreement and a Washington-facilitated peace accord between Cambodia and Thailand over their border dispute.\nRahman said the warming of US-Cambodia defence relations was significant, given that they had until recently been “lukewarm”.\nA major issue was the Ream Naval Base modernised with China’s assistance, leading to concerns that Beijing would turn the base into its naval outpost similar to the one at Djibouti, he noted.\n“However, China’s control over Ream is unclear at this point,” Rahman said, adding that the joint drills showed growing interest between the US and Cambodia in expanding bilateral defence relations.\n\nChina has extensive influence over Cambodia, including strong military ties characterised by joint exercises, military aid and cooperation on training.\nBeijing has significantly helped modernise Cambodia’s military, and has funded and constructed new facilities at Ream, including a large pier capable of hosting warships like aircraft carriers and a logistics and training centre.\nPhnom Penh has consistently maintained that China does not have exclusive access to the base, which is open to all friendly foreign navies.\nWith the US and China competing for influence in Southeast Asia, Rahman said Beijing would be concerned about Washington’s growing ties with Phnom Penh.\n“For Cambodia, the growing defence partnership with the US reflects its non-aligned policy and interests to broaden its defence partners,” he added.\nSophal Ear, associate professor at Arizona State University’s Thunderbird School of Global Management, said the revival of military exercises showed that Cambodia was attempting to recalibrate its relationships beyond Beijing.\nThe drills would mean a “slightly reduced Chinese monopoly” in Cambodia’s defence ties while for Washington, they represented renewed engagement in a region that was becoming more “strategically contested”, Ear said.\n“[It is] an opportunity for the US to demonstrate reliability in a region that often perceives its attention as inconsistent. For Southeast Asia, this move reinforces that the regional security order remains open and fluid.”\nA potential downside, however, would be Cambodia facing new diplomatic pressure from Beijing while the US risked being accused of “militarising its reengagement” with the region, Ear added.\n\nIn recent years, the US is seen as being somewhat negligent of Southeast Asia due to Washington’s inconsistent engagement, especially at the highest level.\nThe US has also been accused of failing to match the scale and tangible results of China’s deep involvement in the region, particularly on the economic front.\nThe resumption of US-Cambodia military drills also clearly aligned with a broader American effort to “regain influence in what has long been considered China’s strategic neighbourhood”, Ear added.\nCambodia’s human rights record and military alignment with China, however, would complicate the extent to which these exercises could proceed, Ear noted.\n“For the US, the engagement carries reputational risks but also the potential to rebuild trust after years of neglect,” he said. “For Cambodia, this moment presents both leverage and new constraints.”\nBeijing’s reaction, whether by expanding its military presence in Ream or by intensifying economic incentives, would reveal much about the durability of Phnom Penh’s balancing strategy, Ear noted.\n“These exercises matter less for their size than for what they symbolise: Cambodia once again signalling that it does not wish to be trapped in any single power’s orbit.”\n\nThe drills, along with the symbolic Nobel Peace Prize nomination for Trump by Cambodian Prime Minister Hun Manet in August, “underscore Cambodia’s pragmatic diplomacy and its interest in fostering openness to multiple partners”, Ear added.\nHun Manet had lauded Trump’s “extraordinary statesmanship” in halting a border conflict between Cambodia and Thailand, following the US president’s July 26 phone calls to the leaders of the two feuding Southeast Asian neighbours to urge a ceasefire in the conflict.\nEven though both leaders agreed in principle to the truce, the fighting, including artillery shelling, continued after the calls.\nOn October 26, Trump witnessed an expanded ceasefire agreement signed by Hun Manet and his Thai counterpart Anutin Charnvirakul during the Association of Southeast Asian Nations summit.\nChinese President Xi Jinping, however, last week publicly refuted Trump’s claim that China had no role in resolving the Thailand-Cambodia dispute, asserting that Beijing had been involved in the de-escalation “in our own way”.\n“Xi’s correction of Trump’s comments about the peace deal underscores how closely China monitors these gestures and how sensitive Beijing remains to signs of American inroads into its sphere of influence,” Ear noted.","summary":"The revival of US-Cambodia military exercises after an eight-year hiatus signals Washington’s renewed interest in Southeast Asia and offers Phnom Penh a chance to rebalance its strategic ties beyond Beijing, according to analysts.\nThe long-frozen Angkor Sentinel drills will resume following a meeting between US Defence Secretary Pete Hegseth and his Cambodian counterpart on the sidelines of a regional security summit in Malaysia last week.\nThe drills were suspended in 2017 after Washington...","url":"https://www.scmp.com/week-asia/politics/article/3331504/why-revival-us-cambodia-drills-good-news-southeast-asia","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/04/f72f016c-4bd2-4349-91d9-447cad8d28bf_b479f456.jpg","video":null,"publish_date":"2025-11-05 00:00:13","author":"Maria Siow","authors":["Maria Siow"],"language":"en","source_country":"cn","sentiment":-0.057},{"id":375818524,"title":"Will beret-clad vigilante Curtis Sliwa swing the New York mayoral race?","text":"New York mayoral candidate Curtis Sliwa rallies with supporters at one of his campaign offices, in the Brooklyn borough of New York, Monday, Nov. 3, 2025. (AP Photo/Richard Drew)\n\nCurtis Sliwa, the red-beret wearing Republican, is looking to spoil the party as the New York mayoral race comes to a dramatic close.\n\nWith most eyes on Zohran Mamdani, the slick Gen-Z friendly democratic socialist trading blows with Independent Andrew Cuomo, who resigned as governor after sexual harassment allegations, it could be Sliwa who swings the ticket.\n\nHe is the motor-mouthed creator of New York City’s Guardian Angels anti-crime patrol group and despite dwindling crime stats in Sliwa’s mind, crime is ‘exploding’ in the Big Apple.\n\n‘Zohran obviously is very unique. He’s way to the left, but then again, Cuomo and Adams, listen to the way they talk. They’re Zohran-lite,’ the 71-year-old said. ‘I will be the alternative.’\n\nWith the biggest turnout in a New York City mayoral election in at least 30 years, here are some of Sliwa’s wackiest moments:\n\n‘Slapping fannies and killing grannies’\n\nSliwa has never come across as the most polished politician. But one of his greatest soundbites came as he embarked on a bizarre rant against his rivals in which he accused them of ‘slapping fannies and killing grannies.’\n\nIn an infamous rant on Fox News, he laid into Cuomo and former mayor Eric Adams: ‘Andrew Cuomo, who gave up this election to Zohran Mamdani, admitted he didn’t try hard, didn’t go into the streets, certainly didn’t go into the subways where I am every day campaigning.\n\n‘Eric Adams is damaged goods. Every day, there’s a new case of corruption in the police department. They believe he’s corrupt. \n\n‘Andrew Cuomo is a creep, slapping fannies and killing grannies. Everybody likes Curtis Sliwa. My favorability ratings are the highest in this cycle.’\n\n Curtis Sliwa boards a subway train while campaigning in Coney Island area (Picture: Reuters)\n\n$10 million bribes\n\nSliwa claimed he was offered up to $10 million by multiple people to exit the race, including offers of a car and a chauffer which he rejected.\n\n‘They all think that everybody has a price, that’s the way they talk. ‘Come on Curtis, everybody has a price,’ Sliwa told reporters recently. ‘Curtis Sliwa doesn’t have a price. I came into this world with nothing, I’m going to leave with nothing, ashes to ashes, dust to dust.’\n\n“Seven different people, a total of $10m when you bifurcate it out over the years,” he told Fox5 New York without naming names.\n\n“Car, Jeep, chauffeur, headquarters to operate out of, helping the Guardian Angels, helping animal welfare – and you know something? If you’re watching out there, you can’t bribe me, buy me, lease me: I’m not for sale.”\n\n‘Bang, bang, bang, bang, bang’\n\nSliwa’s Guardian Angels — a band of beret-wearing citizens — patrolled graffitied subway cars and the burned out, crumbling projects of the late 1970s, when life was cheap and The Warriors seemed more like a documentary.\n\nIn Sliwa’s mind, nothing has changed, in fact it’s all gone to hell in a handbasket. \n\nThe Bronx, he says, ‘blood is pouring from the streets.’ \n\nThe ‘madams and pimps’ on the outskirts of Queens need to be arrested and the ‘Johns’ should be named and shamed. When women ride the subway, they get ‘perved on,’ Sliwa said.\n\nAs Sliwa spoke with a small gaggle of journalists on a street corner at a recent campaign stop, he illustrated an argument about the statistics by forming his hand into a gun — a ‘9 millimeter’ he said — and pointed it at his surprised spokesperson.\n\n ‘Bang, bang, bang, bang, bang!’ he laughed.\n\n Curtis Sliwa, head of the Guardian Angels in the New York City Subway system in 1985 (Picture: Bettmann Archive)\n\nShot by the mob\n\nIn another interview, he recounted how, in 1992, he was shot multiple times in what prosecutors later said was an attempted mob hit. Sliwa had been blasting Gambino crime family boss John Gotti on the radio. \n\nThe mob boss’s son, John “Junior” Gotti, was charged with ordering the shooting, but multiple juries deadlocked and prosecutors eventually gave up the case.\n\nCan he actually win?\n\nIt seems unlikely but Sliwa, like President Donald Trump, has long been a larger-than-life New York City tabloid figure.\n\nTrump has already turned Mamdani into a foil and falsely branded him as a communist while urging people to vote for Cuomo and dismissing Sliwa as ‘not exactly prime time.’\n\nDamian Koszalka, a carpenter from Queens, says he knew Trump wanted supporters Sliwa to back Cuomo. But Koszalka wasn’t swayed, saying, ‘You have to go with your own guts.’\n\n‘I don’t give a damn, you know, if Trump or whoever, is telling me I have to vote for this guy because that’s the less evil, or this and that,’ he said after casting his ballot. ‘It doesn’t work that way.’\n\nTrump reluctantly endorsed Cuomo on the eve of the election, saying Mamdani would bring “disaster” to the city.\n\nKoszalka voted for Sliwa in 2021 when he ran for mayor that year. \n\nReferring to the Guardian Angels, he said Sliwa is the only candidate on the ballot this year who ‘actually did something for the city,’ referring to Cuomo and Mamdani as ‘parasites.’","summary":"Sliwa, like President Donald Trump, has long been a larger-than-life New York City tabloid figure.","url":"https://metro.co.uk/2025/11/04/will-beret-clad-ex-vigilante-shot-mob-swing-new-york-mayoral-race-24617286/","image":"https://metro.co.uk/wp-content/uploads/2025/11/SEI272901928-9b01.jpg?quality=90&strip=all","video":null,"publish_date":"2025-11-04 23:58:33","author":"Barney Davis","authors":["Barney Davis"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.098},{"id":375807440,"title":"Trump says he doesn't know who Binance Founder CZ is, despite pardoning him","text":"Last year, Changpeng Zhao (AKA “CZ”), the founder of Binance—the world’s largest cryptocurrency exchange—pleaded guilty to money laundering charges. Last month, he was pardoned by President Donald Trump. This week, Trump said that he has no idea who he is.\n\nTrump was being interviewed on the latest episode of 60 Minutes when he revealed that he actually doesn’t know much of anything about CZ, despite pardoning him just weeks ago. “Okay, are you ready? I don’t know who he is,” Trump said during the interview, as quoted by CNBC. “I don’t know the man at all. I don’t think I ever met him,” he continued.\n\nAs for how Trump came to pardon a man he doesn’t know, it seems that he was influenced by his family’s ties to the crypto business. “My sons are involved in crypto much more than I— me. I— I know very little about it, other than one thing. It’s a huge industry,” he said. Trump went on to say that he “was told” that CZ was a victim of the Biden Administration.\n\nChangpeng Zhao was sentenced to four months in prison in April of 2024, which he finished serving in September of the same year. In 2022, Binance acquired the non-US operations of FTX after the crypto exchange collapsed.","summary":"Changpeng Zhao pleaded guilty to money laundering in 2024.","url":"https://www.shacknews.com/article/146671/donald-trump-doesnt-know-cz-binance","image":"https://d1lss44hh2trtw.cloudfront.net/assets/article/2025/11/04/binance-cz-getty_feature.jpg","video":null,"publish_date":"2025-11-04 23:57:46","author":"Donovan Erskine","authors":["Donovan Erskine"],"language":"en","source_country":"us","sentiment":-0.506},{"id":375812086,"title":"Bomb Threats in New Jersey and Trump Warnings for California Mark Election Day","text":"Bomb threats to New Jersey polling stations, a voter roll mishap in Pennsylvania potentially affecting thousands of voters and warnings by President Donald Trump against California’s mail balloting system marked the final day of voting in an off-year election with several nationally prominent races.\n\nVoting otherwise appeared to go smoothly Tuesday across the U.S., as voters cast ballots in the first significant election since Trump won the White House for a second time.\n\nThey were deciding governor’s races in New Jersey and Virginia, a mayor’s race in New York, Supreme Court elections in Pennsylvania, and voting and gun control measures in Maine. A redistricting initiative in California that was a response to Trump’s push to redraw congressional lines in GOP-controlled states ahead of next year’s midterm elections has been of particular interest to the Republican president.\n\nHis Department of Justice sent election monitors to five counties in California, a state Trump has lost three times and whose mail balloting system he has often criticized despite no evidence of any widespread fraud or other voting-related problems. In a post Tuesday on his social media platform, the president called the state’s voting process “RIGGED” and warned that it was “under very serious legal and criminal review. STAY TUNED!”\n\nClaims of election rigging are almost routine for Trump in the run-up to elections and sometimes on the day of voting itself. On Election Day last year, before he was declared the winner, he claimed without providing any details or evidence that there was “talk about massive cheating in Philadelphia” and said law enforcement was on the way. He continues to lie about his loss in the 2020 presidential election.\n\nCalifornia Gov. Gavin Newsom, who has been championing the redistricting initiative, responded to Trump with his own social media post calling the president “A totally unserious person spreading false information in a desperate attempt to cope with his failures.” Secretary of State Shirley Weber called it “another baseless claim.”\n\n“The bottom line is California elections have been validated by the courts,” she said in a statement. “California voters will not be deceived by someone who consistently makes desperate, unsubstantiated attempts to dissuade Americans from participating in our democracy.”\n\nIn New Jersey, law enforcement and election officials acted swiftly as voting began to secure polling places following a series of bomb threats.\n\nLt. Gov. Tahesha Way, who also serves as the state’s top election official, said the threats had been emailed to seven counties, including Passaic, a key swing county. It also is the only county outside California where the Department of Justice had sent election monitors, in both cases at the request of the Republican parties in each state.\n\n“Law enforcement has determined that there are no credible threats at this time,” Way said. “We are doing everything in our power to protect voters and poll workers and coordinate closely with state, local and federal partners to ensure a smooth and safe election.”\n\nLater in the day, authorities arrested a juvenile suspect in connection with some of the bomb threats. The potential charges were not immediately released.\n\nThe threats came as the final day of voting began in New Jersey’s closely-watched race for governor and a year after a series of bomb threats disrupted voting during last year’s presidential election, mostly in battleground states. Bomb threat hoaxes also circulated in Springfield, Ohio, last year after Donald Trump during the campaign amplified false claims of Haitian immigrants there abducting and eating pets.\n\nThe threats Tuesday involved nearly two dozen polling places in Bergen, Essex, Mercer, Middlesex, Monmouth, Ocean and Passaic counties, New Jersey Attorney General Matthew Platkin said in a statement. Some polling places reopened quickly, he said, while voters at others were directed to nearby locations to cast their ballots.\n\n“Law enforcement officers have responded at each affected polling place, and they have worked swiftly to secure these polling locations and ensure the safety of every voter,” Platkin said.\n\nThe FBI’s Newark office said it was aware of the reports and was assisting the state and local agencies. “This Dept. of Justice is committed to free, fair and safe elections,” U.S. Attorney General Pam Bondi said in a social media post related to the bomb threat investigation.\n\nPassaic County received three threats and redirected some affected voters to other locations early Tuesday, county spokesperson Lindsay Reed said in an email. One location, a school building, was cleared and voting resumed.\n\nIn Pennsylvania, nearly 20% of voters in Chester County were left out of the poll books originally provided to polling locations Tuesday, county officials said. That included voters registered as anything other than a Republican or a Democrat, including those registered with the Green or Libertarian parties or independents with no party affiliation. The category includes about 75,000 registered voters out of roughly 385,000 countywide.\n\nA Chester County judge later extended voting by provisional ballot to 10 p.m. at all polling locations.\n\nElection officials in the Democratic-leaning county located about 40 miles (64.4 kilometers) west of Philadelphia became aware of the problem just after polling places opened and had provided supplemental poll books to all 230 polling locations by late afternoon. There will be a formal review.\n\nA majority of Chester County voters backed Democrat Kamala Harris over Trump in last year’s presidential election. Voters on Tuesday were weighing in on local offices, as well as on members of Pennsylvania’s highest court. Three Democratic justices on the state Supreme Court were running in nonpartisan retention elections, in which voters give a “yes” or “no” on whether they serve another term.\n\nThird-party and independent voters who came to cast ballots before supplemental poll books arrived were offered a provisional ballot. County review boards consider the status of provisional ballots within seven days of Election Day.","summary":"Bomb threats to New Jersey polling stations, a voter roll mishap in Pennsylvania potentially affecting thousands of voters and warnings&#8230; Continue reading Bomb Threats in New Jersey and Trump Warnings for California Mark Election Day\n\n\nThe post Bomb Threats in New Jersey and Trump Warnings for California Mark Election Day appeared first on The National Herald.","url":"https://www.thenationalherald.com/bomb-threats-in-new-jersey-and-trump-warnings-for-california-mark-election-day/","image":"https://www.thenationalherald.com/wp-content/uploads/2025/11/Election-2025-America-Votes-scaled.jpg","video":null,"publish_date":"2025-11-04 23:57:03","author":"Antonis","authors":["Antonis"],"language":"en","source_country":"us","sentiment":-0.173},{"id":375809958,"title":"San Diego County supervisors demand federal action on delayed CalFresh benefits","text":"SAN DIEGO (FOX 5/KUSI) -- With thousands of families struggling to afford food, San Diego County leaders are demanding that the federal government immediately restore funding for CalFresh benefits that were not reloaded onto EBT cards over the weekend. Roughly 400,000 San Diego County residents rely on CalFresh — California’s version of the federal Supplemental Nutrition Assistance Program (SNAP) — for food assistance. The federal shutdown halted the distribution of benefits nationwide, leaving food banks across the county overwhelmed. On Tuesday, the Board of Supervisors voted unanimously to send an emergency letter to the U.S. Department of Agriculture urging the release of SNAP contingency funds. Supervisor Terra Lawson-Remer, who co-authored the measure with Supervisor Paloma Aguirre, said the situation is dire. “One in four CalFresh households in San Diego has a zero balance left on their EBT cards,” Lawson-Remer said. “Another 45% has less than $50.” Aguirre called the crisis unacceptable and criticized federal leaders for political gridlock. “This is a humanitarian crisis,” Aguirre said. “People are left hungry and confused as they watch their government party like Gatsby and spend their tax dollars on lavish ballrooms, private jets, and foreign bailouts.” The board’s lone Republican, Supervisor Jim Desmond, joined in supporting the measure, but blamed government policies for creating long-term dependency. “Housing, groceries, and utilities have all skyrocketed, and families can’t keep up,” Desmond said. “That’s why we have more and more people on SNAP.” The lapse in CalFresh payments follows a confusing weekend of mixed messages from Washington. President Donald Trump initially said his administration would not release funds until the government shutdown ended, blaming Democrats for the impasse. The White House later said it would comply with federal court orders to restore funding, though it remains unclear when benefits will resume. County leaders said they hope the emergency resolution will pressure the USDA to act swiftly. Treasury officials have indicated that EBT payments could be restored as soon as Wednesday.","summary":"With thousands of families struggling to afford food, San Diego County leaders are demanding that the federal government immediately restore funding for CalFresh benefits that were not reloaded onto EBT cards over the weekend.","url":"https://fox5sandiego.com/news/local-news/san-diego/san-diego-county-supervisors-demand-federal-action-on-delayed-calfresh-benefits/","image":"https://fox5sandiego.com/wp-content/uploads/sites/15/2025/11/Screenshot-2025-11-04-153451.png","video":null,"publish_date":"2025-11-04 23:55:10","author":"Tony Shin","authors":["Tony Shin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.189},{"id":375813624,"title":"Body of final US hostage Itay Chen, held by Hamas terrorists, brought home after 2 years in captivity","text":"The body of the last U.S. citizen held by Hamas, Staff Sergeant Itay Chen, a 19-year-old dual U.S.–Israeli citizen, has been returned from Gaza for burial, the Israel Defense Forces confirmed Monday. Seven more hostages’ bodies remain in Gaza. \"Following the completion of the identification process by the National Institute of Forensic Medicine, in cooperation with the Israel Police and the Military Rabbinate, IDF representatives informed the family that Itay had been returned for burial,\" the military said. Chen served as a combat soldier in the 77th Battalion of the 7th Armored Brigade. He was killed on the morning of Oct. 7, 2023, while fighting near Kibbutz Nir Oz—one of the hardest-hit communities in Hamas’ brutal attack. Around 500 Hamas terrorists stormed the kibbutz, killing 47 people and taking 76 hostages out of the 251 abducted across Israel that day. Chen’s tank was struck during the battle, and his body was taken into Gaza. His death was officially confirmed on March 10, 2024. BODY OF ISRAELI HOSTAGE WHO WAS HELD FOR NEARLY 700 DAYS IN GAZA IS RECOVERED Itay was the middle of three brothers. He grew up in Netanya, a city in central Israel, studied in an advanced academic program, and was known for his warmth, humor, and dedication. He loved basketball, hiking, and rock climbing and before joining the army worked as a camp counselor. Even after sustaining an injury at camp, he insisted on finishing the summer to set an example for the kids he led. Later he enlisted as an armored-corps soldier, driven by a deep sense of duty to protect others. He leaves behind his parents, Ruby and Hagit, and his brothers Roi and Alon. Over the past two years, his parents led an unrelenting campaign to bring their son home. They met with senior officials in Israel and Washington, including President Donald Trump, advocating for the return of all hostages and the remains of the fallen. \"The Government of Israel shares in the deep sorrow of the Chen family and all the families of the fallen hostages,\" the Prime Minister’s Office said in a statement. \"We will not compromise and will spare no effort until every hostage is brought home. May his memory be blessed.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP The Hostages and Missing Families Forum said, \"The return of Itay brings a measure of relief to a family that lived in agonizing uncertainty for more than two years. We will not rest until the last hostage is returned.\" Chen’s funeral will take place this week with full military honors.","summary":"Body of Itay Chen, the last American Gaza hostage held in Gaza, returned for burial after being killed fighting Hamas on Oct. 7, 2023.","url":"https://www.foxnews.com/world/body-final-us-hostage-itay-chen-held-hamas-terrorists-brought-home-after-2-years-captivity","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/03/Sergeant-Itay-Chen.jpg","video":null,"publish_date":"2025-11-04 23:53:53","author":"Efrat Lachter","authors":["Efrat Lachter"],"language":"en","category":"politics","source_country":"us","sentiment":0.009},{"id":375807992,"title":"D.C. man on trial for throwing sandwich at Border Patrol officer","text":"Nov. 4 (UPI) -- A Washington man who hurled a sandwich at a Border Patrol officer in protest of President Donald Trump's troop deployment went on trial Tuesday for a misdemeanor charge.\n\nThe trial centers on an incident in August when Sean Charles Dunn, 37, threw a sandwich at the officer and shouted obscenities at other federal agents over their presence in the nation's capital.\n\nVideos of the incident went viral, and Dunn became something of a folk hero to opponents of Trump's deployment of federal agents to combat what the president described as rampant crime.\n\nA federal grand jury declined to indict Dunn on a felony, but prosecutors later filed a misdemeanor charge of assaulting a federal agent, which carries a potential penalty of one year in jail, fines and probation.\n\nFederal misdemeanor charges can be brought without a grand jury.\n\nDunn, a former paralegal and Air Force veteran, admits to throwing the sandwich.\n\nDuring opening arguments, defense attorney Julia Gatto called his action a \"harmless gesture\" that did not rise to the level of assault, The Washington Post reported.\n\n\"Sean Dunn expressed his opinions,\" Gatto said in her opening statement.\n\n\"He expressed them loudly, and he expressed them, maybe you think vulgarly, but he expressed his opinions,\" she said. \"But words without force are never assault.\"\n\nProsecutor John Parron argued that the case is straightforward and that the law prohibits throwing objects at people, the paper reported.\n\n\"You can't do it with your neighbor,\" he said. \"You can't do it with federal law enforcement.\"\n\nGreg Lairmore, the offended Border Patrol officer, also testified about what led up to the sandwich-throwing incident, CNN reported.\n\nHe described to jurors how Dunn \"became really irritated and started yelling obscenities\" at him and other officers before he threw \"a subway-style sandwich at me that struck me in the chest.\"\n\n\"It smelled of onions and mustard,\" Lairmore recalled, saying it \"exploded all over my chest.\"\n\nHowever, Sabrina Shroff, another attorney for Dunn, showed Lairmore a photo showing the sandwich on the ground that was still wrapped in Subway paper, reported CNN.\n\n\"Can you tell if it's a turkey sandwich?\" Sabrina asked. \"Lettuce? Tomatoes?\"\n\nLairmore responded that he could not tell, but he had mustard stains on his uniform and pieces of the sandwich stuck to his radio equipment.","summary":"Sean Dunn faces a misdemeanor assault charge after hurling a Subway sandwich at a federal agent to protest Trump's deployment of troops to the capital.","url":"https://www.upi.com/Top_News/US/2025/11/04/sandwhich-trial-dc/5701762296311/","image":"https://cdnph.upi.com/sv/ph/og/upi/5701762296311/2025/1/e30163545e757d25b75358190b9f2bec/v1.5/DC-man-on-trial-for-throwing-sandwich-at-Border-Patrol-officer.jpg","video":null,"publish_date":"2025-11-04 23:53:08","author":"Jake Thomas","authors":["Jake Thomas"],"language":"en","category":"politics","source_country":"US","sentiment":-0.407},{"id":375811874,"title":"Trump’s shadow looms as US voters pick New York mayor, state governors","text":"Voters in New Jersey and Virginia will choose their next governors on Tuesday in a pair of races that will serve as an early gauge of the American electorate’s mood after US President Donald Trump’s norm-shattering nine months in office.\nIn New York’s mayoral race, Democratic nominee Zohran Mamdani, a 34-year-old democratic socialist, faces 67-year-old Andrew Cuomo, a Democrat running as a more centrist independent after losing to Mamdani in the primary, four years after resigning as New York state’s governor in disgrace.\nThe campaign has laid bare the Democratic Party’s generational and ideological divides as it seeks to rehabilitate its damaged brand.\nAnd in California, voters will decide whether to give Democratic lawmakers the power to redraw the state’s congressional map, expanding a national battle over redistricting that could determine which party controls the US House of Representatives after next year’s midterm elections.\nPolls close first in Virginia at 7pm, followed by New Jersey, New York and California throughout Tuesday evening.\nDemocrats will be watching Tuesday’s results carefully, with the party locked out of power in Washington and struggling to find consensus on the best way to oppose Trump, a Republican, and find a path out of the political wilderness.\n\nFormer US president Barack Obama, still the party’s most popular figure, headlined 11th-hour rallies over the weekend in New Jersey and Virginia, exhorting voters to elect Democrats to counter what he branded Trump’s lawlessness.\nIn interviews at polling stations on Tuesday, some voters said Trump’s most contentious policies were on their minds, including his efforts to deport immigrants in the US illegally and impose costly tariffs on imports of foreign goods, the legality of which is being weighed by the US Supreme Court this week.\nMore than 3 million people voted early in Virginia, New York and New Jersey, in each case far exceeding the totals from four years ago. In New York City, there were 735,000 ballots cast, according to the city elections board, more than four times the number in 2021.\nThe New Jersey race is the most hotly contested campaign, with opinion polls showing Democrat Mikie Sherrill, a congresswoman and former Navy pilot, holding a narrow lead over her Republican challenger, former state lawmaker and small-business owner Jack Ciattarelli.\n\nA spate of hoax bomb threats sent by email briefly closed down New Jersey polling stations in seven counties in the morning, state officials said.\nIn Virginia, Abigail Spanberger, a former Democratic US congresswoman, held a comfortable opinion polling lead over the state’s Lieutenant Governor Winsome Earle-Sears, a Republican.\nTrump was not on the ballot but he was on the minds of voters in Stafford, Virginia, which Democrat Kamala Harris won by less than one point in last year’s presidential elections.\nJuan Benitez, a self-described independent, was voting for the first time. He backed all of Virginia’s Democratic candidates because of his opposition to Trump’s immigration policies and the federal government shutdown, for which he blamed Trump.\nBenitez, a 25-year-old restaurant manager, said he would be open to voting for Republicans in next year’s midterm elections but because of Trump’s first months in office, “I’m more inclined for Democrats.”\nJennifer Manton, 47, said she had voted for Trump all three times he ran for president, and backed Republican candidates on Tuesday, citing Trump’s tariffs as a major issue.\n\nIn New York, Mamdani, who was a little-known lawmaker in New York’s state legislature only a few months ago, has led by double digits over Cuomo, with Republican nominee Curtis Sliwa, 71, a distant third in most opinion polls.\nCalifornia’s ballot measure, Proposition 50, which would install a new Democratic-backed congressional map that aims to flip five Republican seats in response to a similar move by Texas, is also widely expected to pass.\nWhile Tuesday’s results will offer some insight into the mood of American voters, the midterm elections are a year away, an eternity in politics.\n“There’s nothing that’s going to happen in Virginia or New Jersey that’s going to tell us much about what will happen in a congressional district in Missouri or a Senate race in Maine,” said Douglas Heye, a Republican strategist.\nFor Democrats, Tuesday’s candidates offer a chance to assess differing playbooks.\nSpanberger and Sherrill, both moderate Democrats with backgrounds in national security, have put Trump front-and-centre seeking to harness anger at the president’s no-holds-barred agenda.\n\nIn New York, Mamdani has proposed ambitious left-wing policies, including freezing rents for nearly a million apartments and making the city’s buses free.\nA day after endorsing Cuomo, Trump said on Tuesday that any Jewish New Yorker who voted for Mamdani, a critic of the Israeli government who would be the city’s first Muslim mayor, was a “stupid person”.\nIt was the latest in a string of comments over the course of the US president’s career suggesting that Jewish-Americans vote against their own interests. Mamdani, who did not immediately respond to a request for comment, rejects Republican accusations of antisemitism.\nFor Republicans, Tuesday’s elections will test whether the voters who powered Trump’s victory in 2024 will still show up when he is not on the ballot.\nBut Ciattarelli and Earle-Sears, each running in Democratic-leaning states, have faced a conundrum: criticising Trump risks losing his supporters, but embracing him too closely could alienate moderate and independent voters who disapprove of his policies.\nTrump remains unpopular: 57 per cent of Americans disapprove of his job performance, a Reuters/Ipsos poll shows. But Democrats are not gaining support as a result, with respondents evenly split on whether they would favour Democrats or Republicans in 2026.","summary":"Voters in New Jersey and Virginia will choose their next governors on Tuesday in a pair of races that will serve as an early gauge of the American electorate’s mood after US President Donald Trump’s norm-shattering nine months in office.\nIn New York’s mayoral race, Democratic nominee Zohran Mamdani, a 34-year-old democratic socialist, faces 67-year-old Andrew Cuomo, a Democrat running as a more centrist independent after losing to Mamdani in the primary, four years after resigning as New York...","url":"https://www.scmp.com/news/world/united-states-canada/article/3331548/trumps-shadow-looms-us-voters-pick-new-york-mayor-state-governors","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/05/0bf89300-927c-4c38-8934-376efe478962_a199829e.jpg","video":null,"publish_date":"2025-11-04 23:52:25","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":0.025},{"id":375806530,"title":"Carney's federal budget plans billions in new spending in response to US tariff shocks","text":"The budget was presented by Canada's finance minister, François-Philippe Champagne, in the House of Commons late on Tuesday afternoon. \n\nIn his budget speech, Champagne warned that Canada is facing \"a time of profound change\" and that \"bold and swift action is needed\" to ensure the country prospers.\n\nPeppered throughout the budget are references to uncertainty and the need for protectionist measures as a result of US tariffs on Canada. President Donald Trump has placed a broad 35% levy on Canadian goods not covered by an existing free trade agreement, and has tariffed specific sectors like steel, aluminium and automobiles. \n\nThese levies, enacted earlier this year, have already led to Canadian job losses in those sectors, and business leaders have warned of a chill on investment in Canada due to trade uncertainty. \n\nTo counter this, the budget proposes spending of C$280bn over the next five years \"to strengthen Canada's productivity, competitiveness, and resilience\". \n\nThese include updating ports and other trade infrastructure with the goal of doubling Canadian exports to non-US markets over the next decade, as well as direct financing to support firms impacted by tariffs.\n\nThe fiscal update also outlines a plan to boost Canada's competitiveness, with the goal of making Canada a more attractive place to do business than the US.\n\nRebekah Young, the head of inclusion and resilience economics at Scotiabank, said the budget lays out a plan to reduce timelines and smooth regulatory hurdles with the hopes that it will boost private investment in Canada over the years.\n\nBut she cautioned that parts of the budget might be a hard sell for Canadians struggling immediately with the cost of living.\n\n\"They're going to open this budget and not see any new (supports),\" she said. \n\nAnd while the budget delivers on its promise of generational spending, Ms Young said it remains to be seen if it will be as \"transformational\" as Carney hopes.\n\n\"We want to unlock a trillion dollars based on this investment here. A lot has to happen to get to that trillion,\" she said. \n\nOn defence, the budget pledges nearly C$82bn over five years—the largest funding in decades—putting Canada in line with its Nato commitment to spend 2% of its gross domestic product (GDP) on its military by this year.\n\nThe Carney government is also betting big on AI, proposing nearly C$1bn to boost integration and use of the rapidly growing technology, including in government operations.\n\nCarney warned Canadians ahead of the budget of \"sacrifices\". Among them is a reduction of the size of the federal government that would result in 40,000 job losses by 2029. International aid is also slated to be cut to pre-pandemic levels. \n\nImmigration targets have been lowered slightly over the next three years to \"stabilise\" new admissions to the country, including a significant cut to student visas.\n\nThe budget will need to be passed by Canada's parliament before it's implemented. Carney's Liberal government is three seats shy of a majority, meaning it will need the support of other parties to enact its fiscal plan. \n\nFailure to pass the budget could risk a federal election. \n\nAccording to multiple reports, one Conservative MP, Chris d'Entremont, is no longer in the party's caucus after he told news outlet Politico on Tuesday that he was considering crossing the floor to the Liberals, and that he would decide \"in the next few days\" after reviewing the budget.\n\n​​If he does, it would narrow Carney's razor-thin minority at a critical time.\n\nMeanwhile, Conservative opposition MPs have criticised the budget for increasing Canada's deficit while doing little to address affordability for Canadians. \n\nYves-Francois Blanchet, the leader of the separatist Bloc Québécois party, said his caucus does not see how they could support the budget. \n\nMembers of the left-leaning New Democratic Party said they will take the time to study it, but have criticised planned public sector cuts. \n\nWith the projected larger deficit, Carney's fiscal plan maintains that Canada's still has the lowest deficit-to-GDP ratio in the G7, behind only Japan.","url":"https://www.bbc.com/news/articles/cd04yde70jmo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/286b/live/5096dfd0-b9cb-11f0-aa1d-d15856dba687.jpg","video":null,"publish_date":"2025-11-04 23:51:14","author":"Nadine Yousif","authors":["Nadine Yousif"],"language":"en","category":"politics","source_country":"gb","sentiment":0.043},{"id":375812882,"title":"Insurance tech firm Exzeo raises $168 million in US IPO","text":"Insurance technology firm Exzeo Group raised $168 million in its U.S. initial public offering on Tuesday, pricing its shares within its marketed range and becoming the latest insurance company to proceed with its listing plans. \n\nThe Tampa, Florida-based company sold 8 million shares priced at $21 apiece in the IPO, compared with its marketed range of $20 and $22, giving it a potential valuation of about $1.91 billion. \n\nExzeo's parent company, HCI Group, will retain an 81.5 per cent stake following the offering.\n\nU.S. IPO activity has rebounded strongly after an earlier slowdown triggered by U.S. President Donald Trump's shifting trade policies and broader market volatility. \n\nInvestor appetite for new listings has improved, but the recent government shutdown has caused short-term delays in the IPO pipeline.\n\nExzeo joins a string of insurance firms that have gone public this year, including Accelerant and Neptune Insurance, both of which were well-received on their debut.\n\nExzeo was established in 2012 and provides insurance technology and operational solutions through its proprietary platform, offering software and analytics tools for property and casualty insurers to streamline underwriting, claims, and policy management.\n\nThe company will list on the New York Stock Exchange under the symbol \"XZO\". Truist Securities, Citizens Capital Markets and William Blair were the joint bookrunning managers for the offering.","summary":"","url":"https://www.channelnewsasia.com/business/insurance-tech-firm-exzeo-raises-168-million-in-us-ipo-5446101","image":"https://dam.mediacorp.sg/image/upload/s--dmFUnhpi--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-11-04T234918Z_1_LYNXMPELA31EA_RTROPTP_3_EXZEO-IPO.JPG?itok=FLHIaRCv","video":null,"publish_date":"2025-11-04 23:49:36","author":null,"language":"en","source_country":"sg","sentiment":-0.286},{"id":375807366,"title":"Trump re-nominates Musk ally Jared Isaacman for position of NASA chief","text":"WASHINGTON: US President Donald Trump said on Tuesday (Nov 4) he was nominating Jared Isaacman, the private astronaut and ally of billionaire Elon Musk, for the office of administrator of NASA.\n\nIsaacman was removed from consideration to lead NASA earlier this year amid a high-profile falling-out between Trump and Musk. Sean Duffy, the head of the US Department of Transportation, was named acting NASA chief.\n\n\"This evening, I am pleased to nominate Jared Isaacman, an accomplished business leader, philanthropist, pilot, and astronaut, as Administrator of NASA,\" Trump said on social media. The role requires confirmation by the Senate, where Trump's Republican Party holds a 53-47 majority.\n\nLast year, Trump, as president-elect, tapped Isaacman to lead NASA at the recommendation of Musk, the SpaceX CEO who had been an influential adviser to the president and sought to more closely align the US space program with his goal of flying missions to Mars.\n\nIsaacman, a billionaire who commanded the first civilian space crew in 2021 aboard a SpaceX capsule, had spent months navigating the Senate confirmation process, balancing the Trump administration's desire to focus on Mars with NASA's multibillion-dollar strategy to return to the moon first in a geopolitical race with China.\n\n\"Jared's passion for Space, astronaut experience, and dedication to pushing the boundaries of exploration, unlocking the mysteries of the universe, and advancing the new Space economy, make him ideally suited to lead NASA into a bold new Era,\" Trump wrote in his post.\n\nIsaacman founded the Shift4 Payments company as a teenager.","summary":"","url":"https://www.channelnewsasia.com/world/trump-nasa-chief-musk-ally-jared-isaacman-5446016","image":"https://dam.mediacorp.sg/image/upload/s--egvCe7mO--/c_crop,h_449,w_799,x_1,y_3/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-11-04T230056Z_2_LYNXMPELA31D9_RTROPTP_3_","video":null,"publish_date":"2025-11-04 23:46:09","author":null,"language":"en","category":"politics","source_country":"SG","sentiment":0.088},{"id":375814896,"title":"Putin hails developers of nuclear-powered missile","text":"By Christian Edwards, Nina Subkhanberdina, CNN\n\n(CNN) — Russian President Vladimir Putin has given state awards to the developers of the Burevestnik cruise missile and the Poseidon underwater torpedo, the latest signal in what analysts have cast as efforts by the Kremlin to discourage the West from supporting Ukraine.\n\nAt an awards ceremony in the Kremlin on Tuesday, Putin claimed the two nuclear-powered, nuclear-capable weapons were of “historic significance” for Russia and “for the entire 21st century.”\n\n“In terms of flight range, the Burevestnik … has surpassed all known missile systems in the world,” Putin said in a speech, praising the state of Russia’s defense technology.\n\nPutin also said that Russia has begun serial production of the Oreshnik, another nuclear-capable missile. Russia used the hypersonic Oreshnik in a strike on the Ukrainian region of Dnipro in November 2024 – the first time in history an intermediate-range ballistic missile has been used in battle.\n\nThe awards ceremony comes amid growing tension between Moscow and Washington, after US President Donald Trump – frustrated by Putin’s prevarications over ending the war in Ukraine – last month imposed sanctions on two Russian oil giants and cancelled a proposed summit with the Russian leader in Hungary.\n\nOn October 28, Putin claimed the Poseidon – another “invincible” Russian weapon with a range of more than 6,000 miles (9,650 kilometers) – had been successfully tested.\n\nNeither weapon is new. Putin unveiled both weapons in 2018, and even announced a successful test of the Burevestnik in 2023.\n\nBut analysts say Russia is using previously announced missile technology to send new nuclear threats to the West, and the US in particular.\n\n“The repeated emphasis on the long range of the weapon and ability to overcome any missile defense system also indicates that the intended target would be the United States, not a regional adversary that Russia could strike with much cheaper shorter-range systems,” the Center for Strategic and International Studies (CSIS) said in a report published Tuesday.\n\nThe report noted the Trump administration’s plan to build a “Golden Dome” missile defense system to shield the US from foreign attacks. Although Putin did not explicitly reference the Golden Dome in his October 26 announcement of the Burevestnik test, he has repeatedly stressed the missile’s ability to evade missile defenses.\n\nThe awards ceremony in the Kremlin comes days after Trump ordered the resumption of US nuclear weapons tests. The US president said he gave the order “because of other countries’ testing programs.”\n\nIn his speech Tuesday, Putin claimed that Russia “is not threatening anyone.”\n\n“Russia, like all other nuclear powers, is developing nuclear potential and its strategic potential. Everything we have been talking about now is work that was announced long ago,” he said.\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.\n\nAbout The Author","summary":"November 4, 2025\n\n\nThe post Putin hails developers of nuclear-powered missile appeared first on  Caribbean Broadcasting Corporation.","url":"https://www.cbc.bb/news/international-news/putin-hails-developers-of-nuclear-powered-missile/","image":"https://www.cbc.bb/wp-content/uploads/2025/11/Russia-Vladimir-Putin-Kremlin-Moscow-Tuesday-October-4-2025-by-Maxim-Shipenkov-AFP-Getty-Images-via-CNN-Newsource--scaled.jpg","video":null,"publish_date":"2025-11-04 23:39:46","author":"admin","authors":["admin"],"language":"en","source_country":"bb","sentiment":-0.259},{"id":375811866,"title":"Trump signs order to lower fentanyl-related tariffs targeting China","text":"US President Donald Trump signed an order on Tuesday to lower fentanyl-related tariffs on Chinese products, formalising a key part of his deal with Chinese leader Xi Jinping after their first face-to-face talks in years.\nShortly after returning to the presidency this year, Trump imposed additional tariffs of 20 per cent on goods from China over its alleged role in the fentanyl supply chain.\nBut China has since committed efforts to halting the flow of precursors used to make fentanyl into the United States, after Trump and Xi’s summit last month in Busan, South Korea.\nIn turn, Washington pledged that it would cut its additional tariffs on Chinese imports from 20 per cent to 10 per cent, effective November 10.\nTrump’s order on Tuesday formalises this agreement, although it said US officials will monitor China’s compliance with the deal.\n\nThe US president’s talks with Xi also yielded a slate of other agreements, including a further suspension of steeper tit-for-tat tariffs until November 10, 2026.\nTemperatures have spiked between the world’s two biggest economies this year as Washington and Beijing slapped escalating tariffs on each other’s products.\nAt one point, duties on both sides reached prohibitive triple-digit levels, hampering trade.\nBoth countries have been engaged in an uneasy truce since, as top economic leaders met several times for talks in recent months, with tensions surging over export controls and other issues.\nBut Trump and Xi’s meeting has effectively extended their delicate truce for a year.","summary":"US President Donald Trump signed an order on Tuesday to lower fentanyl-related tariffs on Chinese products, formalising a key part of his deal with Chinese leader Xi Jinping after their first face-to-face talks in years.\nShortly after returning to the presidency this year, Trump imposed additional tariffs of 20 per cent on goods from China over its alleged role in the fentanyl supply chain.\nBut China has since committed efforts to halting the flow of precursors used to make fentanyl into the...","url":"https://www.scmp.com/news/china/diplomacy/article/3331547/trump-signs-order-lower-fentanyl-related-tariffs-targeting-china","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/05/e0f3d2e7-2f28-4e2c-89c0-a59f61dbb024_5db2d100.jpg","video":null,"publish_date":"2025-11-04 23:35:51","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.19},{"id":375815234,"title":"Bekas Naib Presiden Amerika Syarikat, Dick Cheney meninggal dunia","text":"WASHINGTON: Bekas Naib Presiden paling berkuasa dalam sejarah Amerika Syarikat, Dick Cheney, yang berkhidmat sebagai orang kanan George W Bush meninggal dunia akibat komplikasi radang paru-paru, penyakit jantung dan saluran darah, semalam.\n\n Cheney berusia 84 tahun, antara pemimpin berpengaruh dalam jawatan ketika era serangan 11 September, peperangan di Afghanistan serta Iraq.\n\n Dibenci ramai pihak di sayap kiri politik, Cheney membuat perubahan pendirian yang mengejutkan pada akhir hayatnya apabila beliau menentang kempen Donald Trump untuk kembali ke Rumah Putih pada tahun 2024.\n\n Anaknya, Liz Cheney, bekas ahli kongres dari Wyoming, berkata bapanya yang sangat berpegang teguh pada prinsip Republikan dan mengundi calon Demokrat, Kamala Harris, dalam pilihan raya berkenaan. \n\n \"Cheney, yang juga pernah menjadi ahli kongres dan Setiausaha Pertahanan, \"meninggal dunia akibat komplikasi radang paru-paru serta penyakit jantung dan saluran darah,\" menurut kenyataan keluarganya.\n\n Sebagai Naib Presiden ke-46, Cheney berkhidmat selama dua penggal dari 2001 hingga 2009. \n\n Jawatan itu sering mengecewakan ahli politik bercita-cita tinggi, namun kemahiran politiknya yang licik memberinya pengaruh besar.\n\n Beliau membantu memperkenalkan fahaman eksekutif yang agresif, mempercayai presiden sepatutnya dapat bertindak hampir tanpa sekatan daripada pihak perundangan atau kehakiman, terutamanya ketika waktu perang.\n\n Pendekatan itu menyebabkan Bush terbabit dalam konflik panjang di Afghanistan dan Iraq, serta mencetuskan kontroversi besar terhadap kesannya ke atas kebebasan sivil.\n\n Dilahirkan di Lincoln, Nebraska pada 30 Januari 1941, Cheney dibesarkan di Wyoming dan pernah menuntut di Universiti Yale tetapi tidak menamatkan pengajian, sebelum memperoleh ijazah sains politik di Universiti Wyoming.\n\n Cheney berkhidmat 10 tahun di Kongres sebagai wakil Wyoming sebelum dilantik sebagai Setiausaha Pertahanan oleh Presiden George H W Bush pada 1989.\n\n Beliau mengetuai Pentagon semasa Perang Teluk 1990–1991, yang mana pakatan tentera pimpinan AS menyingkirkan tentera Iraq dari Kuwait.\n\n Sebagai Naib Presiden, Cheney membawa ideologi neo-konservatif ke Rumah Putih dan memainkan peranan lebih besar dalam membuat keputusan dasar utama berbanding kebanyakan pendahulunya.\n\nCheney juga antara penggerak utama keputusan untuk menyerang Iraq selepas serangan 11 September 2001 oleh kumpulan Al-Qaeda di New York dan Washington.\n\n Dakwaannya yang tidak tepat mengenai Saddam Hussein yang memiliki senjata pemusnah besar-besaran mencetus kepada perang menjelang pencerobohan AS ke atas Iraq pada tahun 2003.","summary":"WASHINGTON:  Bekas Naib Presiden paling berkuasa dalam sejarah Amerika Syarikat, Dick Cheney, yang berkhidmat sebagai orang kanan George W Bush meninggal dunia akibat komplikasi radang paru-paru, penyakit jantung dan saluran darah, semalam.","url":"https://www.bharian.com.my/dunia/amerika/2025/11/1467675/bekas-naib-presiden-amerika-syarikat-dick-cheney-meninggal-dunia","image":"https://assets.bharian.com.my/images/articles/BH5DICK-O_BHfield_image_listing_featured.var_1762299084.jpg","video":null,"publish_date":"2025-11-04 23:31:31","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.846},{"id":375814706,"title":"Pam Bondi Scrambles, Give Lindsey Halligan A New Title To Rescue Trump’s Revenge Prosecutions","text":"Pam Bondi is in damage-control mode. The attorney general made a surprise legal move this week to rescue two of the most controversial prosecutions her department has ever touched — the cases against Donald Trump’s longtime political enemies, James Comey and Letitia James.\n\nIn a court filing dated October 31 and made public Monday, Bondi announced she was appointing Lindsey Halligan as a “special attorney” retroactive to September 22. She also said she was officially “ratifying” Halligan’s earlier actions before grand juries in both cases. In plain terms, Bondi is trying to backfill Halligan’s authority to make sure the indictments against Comey and James don’t collapse in court.\n\nHalligan, a former beauty pageant contestant turned insurance lawyer, had previously been Trump’s personal attorney before being tapped to run the U.S. Attorney’s Office for the Eastern District of Virginia. She took the role in September after her predecessor, Erik Siebert, was reportedly forced out for refusing to file charges against New York Attorney General Letitia James. Within weeks, Halligan indicted James and former FBI Director James Comey, both longtime Trump critics, on charges of lying to Congress and mortgage fraud.\n\nBut there was one big problem. Halligan’s appointment wasn’t legal, at least not according to defense lawyers. They argued Siebert had already served out the 120-day limit allowed for interim U.S. attorneys, which meant Halligan’s authority to act as top prosecutor was invalid. Since only her name appears on the indictments, the entire case could crumble if a judge agrees.\n\nIn her filing, Bondi tried to patch that hole, writing that “for the avoidance of doubt as to the validity” of Halligan’s actions, she was appointing her as a special attorney as of September 22, with authority to conduct “any kind of legal proceeding.” She also declared that she “ratified” Halligan’s signature on both indictments, giving them an official stamp of approval — at least on paper.\n\nBut legal experts aren’t convinced the fix will hold. Lawfare senior editor Roger Parloff pointed out that Bondi’s new appointment came a full month after the statute of limitations had expired in the Comey case. And even if the timing weren’t an issue, courts tend to look skeptically at retroactive authorizations. The whole idea of criminal law rests on clear, predictable rules, and giving someone power after the fact usually doesn’t pass muster.\n\nHalligan’s short tenure has already been rocky. Reports say she blindsided Bondi when she pushed ahead with the Letitia James indictment without clearing it first. Critics have slammed her lack of prosecutorial experience, saying she was fast-tracked into one of the most politically sensitive roles in the country purely because of her loyalty to Trump.\n\nNow Bondi’s move is seen as an effort to contain the fallout before the entire operation implodes. Both Comey and James have pleaded not guilty and accused the administration of using the Justice Department for revenge. Their lawyers have filed motions to dismiss the charges entirely, calling the prosecutions “politically vindictive” and “legally void.”\n\nA federal judge is scheduled to hear arguments on November 13, and Bondi’s last-minute paperwork may not be enough to save the cases. If the court rejects her fix, Trump’s hand-picked team could be staring down a pair of embarrassing defeats, and Bondi’s credibility could take a serious hit.","summary":"Bondi rushes to fix a major legal blunder by backdating Lindsey Halligan’s role in Trump’s revenge prosecutions.","url":"https://www.inquisitr.com/pam-bondi-scrambles-give-lindsey-halligan-a-new-title-to-rescue-trumps-revenge-proscecutions","image":"https://www.inquisitr.com/wp-content/uploads/2025/10/Pam-Bondi-DOJ.jpg","video":null,"publish_date":"2025-11-04 23:30:09","author":"Frank Yemi","authors":["Frank Yemi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.382}]}